{
    "original": {
        "text": "The beginning of an acquaintance whether with persons or things is to get a definite outline for our ignorance.\nMr. Grandcourt's wish to be introduced had no suddenness for Gwendolen; but when Lord Brackenshaw moved aside a little for the prefigured stranger to come forward and she felt herself face to face with the real man, there was a little shock which flushed her cheeks and vexatiously deepened with her consciousness of it. The shock came from the reversal of her expectations: Grandcourt could hardly have been more unlike all her imaginary portraits of him. He was slightly taller than herself, and their eyes seemed to be on a level; there was not the faintest smile on his face as he looked at her, not a trace of self-consciousness or anxiety in his bearing: when he raised his hat he showed an extensive baldness surrounded with a mere fringe of reddish-blonde hair, but he also showed a perfect hand; the line of feature from brow to chin undisguised by beard was decidedly handsome, with only moderate departures from the perpendicular, and the slight whisker too was perpendicular. It was not possible for a human aspect to be freer from grimace or solicitous wrigglings: also it was perhaps not possible for a breathing man wide awake to look less animated. The correct Englishman, drawing himself up from his bow into rigidity, assenting severely, and seemed to be in a state of internal drill, suggests a suppressed vivacity, and may be suspected of letting go with some violence when he is released from parade; but Grandcourt's bearing had no rigidity, it inclined rather to the flaccid. His complexion had a faded fairness resembling that of an actress when bare of the artificial white and red; his long narrow gray eyes expressed nothing but indifference. Attempts at description are stupid: who can all at once describe a human being? Even when he is presented to us we only begin that knowledge of his appearance which must be completed by innumerable impressions under differing circumstances. We recognize the alphabet; we are not sure of the language. I am only mentioning the point that Gwendolen saw by the light of a prepared contrast in the first minutes of her meeting with Grandcourt: they were summed up in the words, \"He is not ridiculous.\" But forthwith Lord Brackenshaw was gone, and what is called conversation had begun, the first and constant element in it being that Grandcourt looked at Gwendolen persistently with a slightly exploring gaze, but without change of expression, while she only occasionally looked at him with a flash of observation a little softened by coquetry. Also, after her answers there was a longer or shorter pause before he spoke again.\n\"I used to think archery was a great bore,\" Grandcourt began. He spoke with a fine accent, but with a certain broken drawl, as of a distinguished personage with a distinguished cold on his chest.\n\"Are you converted to-day?\" said Gwendolen.\n(Pause, during which she imagined various degrees and modes of opinion about herself that might be entertained by Grandcourt.)\n\"Yes, since I saw you shooting. In things of this sort one generally sees people missing and simpering.\"\n\"I suppose you are a first-rate shot with a rifle.\"\n(Pause, during which Gwendolen, having taken a rapid observation of Grandcourt, made a brief graphic description of him to an indefinite hearer.)\n\"I have left off shooting.\"\n\"Oh, then, you are a formidable person. People who have done things once and left them off make one feel very contemptible, as if one were using cast-off fashions. I hope you have not left off all follies, because I practice a great many.\"\n(Pause, during which Gwendolen made several interpretations of her own speech.)\n\"What do you call follies?\"\n\"Well, in general, I think, whatever is agreeable is called a folly. But you have not left off hunting, I hear.\"\n(Pause, wherein Gwendolen recalled what she had heard about Grandcourt's position, and decided that he was the most aristocratic-looking man she had ever seen.)\n\"One must do something.\"\n\"And do you care about the turf?--or is that among the things you have left off?\"\n(Pause, during which Gwendolen thought that a man of extremely calm, cold manners might be less disagreeable as a husband than other men, and not likely to interfere with his wife's preferences.)\n\"I run a horse now and then; but I don't go in for the thing as some men do. Are you fond of horses?\"\n\"Yes, indeed; I never like my life so well as when I am on horseback, having a great gallop. I think of nothing. I only feel myself strong and happy.\"\n(Pause, wherein Gwendolen wondered whether Grandcourt would like what she said, but assured herself that she was not going to disguise her tastes.)\n\"Do you like danger?\"\n\"I don't know. When I am on horseback I never think of danger. It seems to me that if I broke my bones I should not feel it. I should go at anything that came in my way.\"\n(Pause during which Gwendolen had run through a whole hunting season with two chosen hunters to ride at will.)\n\"You would perhaps like tiger-hunting or pig-sticking. I saw some of that for a season or two in the East. Everything here is poor stuff after that.\"\n\"_You_ are fond of danger, then?\"\n(Pause, wherein Gwendolen speculated on the probability that the men of coldest manners were the most adventurous, and felt the strength of her own insight, supposing the question had to be decided.)\n\"One must have something or other. But one gets used to it.\"\n\"I begin to think I am very fortunate, because everything is new to me: it is only that I can't get enough of it. I am not used to anything except being dull, which I should like to leave off as you have left off shooting.\"\n(Pause, during which it occurred to Gwendolen that a man of cold and distinguished manners might possibly be a dull companion; but on the other hand she thought that most persons were dull, that she had not observed husbands to be companions--and that after all she was not going to accept Grandcourt.)\n\"Why are you dull?\"\n\"This is a dreadful neighborhood. There is nothing to be done in it. That is why I practiced my archery.\"\n(Pause, during which Gwendolen reflected that the life of an unmarried woman who could not go about and had no command of anything must necessarily be dull through all degrees of comparison as time went on.)\n\"You have made yourself queen of it. I imagine you will carry the first prize.\"\n\"I don't know that. I have great rivals. Did you not observe how well Miss Arrowpoint shot?\"\n(Pause, wherein Gwendolen was thinking that men had been known to choose some one else than the woman they most admired, and recalled several experiences of that kind in novels.)\n\"Miss Arrowpoint. No--that is, yes.\"\n\"Shall we go now and hear what the scoring says? Every one is going to the other end now--shall we join them? I think my uncle is looking toward me. He perhaps wants me.\"\nGwendolen found a relief for herself by thus changing the situation: not that the _tete--tete_ was quite disagreeable to her; but while it lasted she apparently could not get rid of the unwonted flush in her cheeks and the sense of surprise which made her feel less mistress of herself than usual. And this Mr. Grandcourt, who seemed to feel his own importance more than he did hers--a sort of unreasonableness few of us can tolerate--must not take for granted that he was of great moment to her, or that because others speculated on him as a desirable match she held herself altogether at his beck. How Grandcourt had filled up the pauses will be more evident hereafter.\n\"You have just missed the gold arrow, Gwendolen,\" said Mr. Gascoigne. \"Miss Juliet Fenn scores eight above you.\"\n\"I am very glad to hear it. I should have felt that I was making myself too disagreeable--taking the best of everything,\" said Gwendolen, quite easily.\nIt was impossible to be jealous of Juliet Fenn, a girl as middling as mid-day market in everything but her archery and plainness, in which last she was noticeable like her father: underhung and with receding brow resembling that of the more intelligent fishes. (Surely, considering the importance which is given to such an accident in female offspring, marriageable men, or what the new English calls \"intending bridegrooms,\" should look at themselves dispassionately in the glass, since their natural selection of a mate prettier than themselves is not certain to bar the effect of their own ugliness.)\nThere was now a lively movement in the mingling groups, which carried the talk along with it. Every one spoke to every one else by turns, and Gwendolen, who chose to see what was going on around her now, observed that Grandcourt was having Klesmer presented to him by some one unknown to her--a middle-aged man, with dark, full face and fat hands, who seemed to be on the easiest terms with both, and presently led the way in joining the Arrowpoints, whose acquaintance had already been made by both him and Grandcourt. Who this stranger was she did not care much to know; but she wished to observe what was Grandcourt's manner toward others than herself. Precisely the same: except that he did not look much at Miss Arrowpoint, but rather at Klesmer, who was speaking with animation--now stretching out his long fingers horizontally, now pointing downward with his fore-finger, now folding his arms and tossing his mane, while he addressed himself first to one and then to the other, including Grandcourt, who listened with an impassive face and narrow eyes, his left fore-finger in his waistcoat-pocket, and his right slightly touching his thin whisker.\n\"I wonder which style Miss Arrowpoint admires most,\" was a thought that glanced through Gwendolen's mind, while her eyes and lips gathered rather a mocking expression. But she would not indulge her sense of amusement by watching, as if she were curious, and she gave all her animation to those immediately around her, determined not to care whether Mr. Grandcourt came near her again or not.\nHe did come, however, and at a moment when he could propose to conduct Mrs. Davilow to her carriage, \"Shall we meet again in the ball-room?\" she said as he raised his hat at parting. The \"yes\" in reply had the usual slight drawl and perfect gravity.\n\"You were wrong for once, Gwendolen,\" said Mrs. Davilow, during their few minutes' drive to the castle.\n\"In what, mamma?\"\n\"About Mr. Grandcourt's appearance and manners. You can't find anything ridiculous in him.\"\n\"I suppose I could if I tried, but I don't want to do it,\" said Gwendolen, rather pettishly; and her mother was afraid to say more.\nIt was the rule on these occasions for the ladies and gentlemen to dine apart, so that the dinner might make a time of comparative ease and rest for both. Indeed, the gentlemen had a set of archery stories about the epicurism of the ladies, who had somehow been reported to show a revolting masculine judgment in venison, even asking for the fat--a proof of the frightful rate at which corruption might go on in women, but for severe social restraint, and every year the amiable Lord Brackenshaw, who was something of a _gourmet_, mentioned Byron's opinion that a woman should never be seen eating,--introducing it with a confidential--\"The fact is\" as if he were for the first time admitting his concurrence in that sentiment of the refined poet.\nIn the ladies' dining-room it was evident that Gwendolen was not a general favorite with her own sex: there were no beginnings of intimacy between her and other girls, and in conversation they rather noticed what she said than spoke to her in free exchange. Perhaps it was that she was not much interested in them, and when left alone in their company had a sense of empty benches. Mrs. Vulcany once remarked that Miss Harleth was too fond of the gentlemen; but we know that she was not in the least fond of them--she was only fond of their homage--and women did not give her homage. The exception to this willing aloofness from her was Miss Arrowpoint, who often managed unostentatiously to be by her side, and talked to her with quiet friendliness.\n\"She knows, as I do, that our friends are ready to quarrel over a husband for us,\" thought Gwendolen, \"and she is determined not to enter into the quarrel.\"\n\"I think Miss Arrowpoint has the best manners I ever saw,\" said Mrs. Davilow, when she and Gwendolen were in a dressing-room with Mrs. Gascoigne and Anna, but at a distance where they could have their talk apart.\n\"I wish I were like her,\" said Gwendolen.\n\"Why? Are you getting discontented with yourself, Gwen?\"\n\"No; but I am discontented with things. She seems contented.\"\n\"I am sure you ought to be satisfied to-day. You must have enjoyed the shooting. I saw you did.\"\n\"Oh, that is over now, and I don't know what will come next,\" said Gwendolen, stretching herself with a sort of moan and throwing up her arms. They were bare now; it was the fashion to dance in the archery dress, throwing off the jacket; and the simplicity of her white cashmere with its border of pale green set off her form to the utmost. A thin line of gold round her neck, and the gold star on her breast, were her only ornaments. Her smooth soft hair piled up into a grand crown made a clear line about her brow. Sir Joshua would have been glad to take her portrait; and he would have had an easier task than the historian at least in this, that he would not have had to represent the truth of change--only to give stability to one beautiful moment.\n\"The dancing will come next,\" said Mrs. Davilow \"You are sure to enjoy that.\"\n\"I shall only dance in the quadrille. I told Mr. Clintock so. I shall not waltz or polk with any one.\"\n\"Why in the world do you say that all on a sudden?\"\n\"I can't bear having ugly people so near me.\"\n\"Whom do you mean by ugly people?\"\n\"Oh, plenty.\"\n\"Mr. Clintock, for example, is not ugly.\" Mrs. Davilow dared not mention Grandcourt.\n\"Well, I hate woolen cloth touching me.\"\n\"Fancy!\" said Mrs. Davilow to her sister who now came up from the other end of the room. \"Gwendolen says she will not waltz or polk.\"\n\"She is rather given to whims, I think,\" said Mrs. Gascoigne, gravely. \"It would be more becoming in her to behave as other young ladies do on such an occasion as this; especially when she has had the advantage of first-rate dancing lessons.\"\n\"Why should I dance if I don't like it, aunt? It is not in the catechism.\"\n\"My _dear_!\" said Mrs. Gascoigne, in a tone of severe check, and Anna looked frightened at Gwendolen's daring. But they all passed on without saying any more.\nApparently something had changed Gwendolen's mood since the hour of exulting enjoyment in the archery-ground. But she did not look the worse under the chandeliers in the ball-room, where the soft splendor of the scene and the pleasant odors from the conservatory could not but be soothing to the temper, when accompanied with the consciousness of being preeminently sought for. Hardly a dancing man but was anxious to have her for a partner, and each whom she accepted was in a state of melancholy remonstrance that she would not waltz or polk.\n\"Are you under a vow, Miss Harleth?\"--\"Why are you so cruel to us all?\"--\"You waltzed with me in February.\"--\"And you who waltz so perfectly!\" were exclamations not without piquancy for her. The ladies who waltzed naturally thought that Miss Harleth only wanted to make herself particular; but her uncle when he overheard her refusal, supported her by saying,\n\"Gwendolen has usually good reasons.\" He thought she was certainly more distinguished in not waltzing, and he wished her to be distinguished. The archery ball was intended to be kept at the subdued pitch that suited all dignities clerical and secular; it was not an escapement for youthful high spirits, and he himself was of opinion that the fashionable dances were too much of a romp.\nAmong the remonstrant dancing men, however, Mr. Grandcourt was not numbered. After standing up for a quadrille with Miss Arrowpoint, it seemed that he meant to ask for no other partner. Gwendolen observed him frequently with the Arrowpoints, but he never took an opportunity of approaching her. Mr. Gascoigne was sometimes speaking to him; but Mr. Gascoigne was everywhere. It was in her mind now that she would probably after all not have the least trouble about him: perhaps he had looked at her without any particular admiration, and was too much used to everything in the world to think of her as more than one of the girls who were invited in that part of the country. Of course! It was ridiculous of elders to entertain notions about what a man would do, without having seen him even through a telescope. Probably he meant to marry Miss Arrowpoint. Whatever might come, she, Gwendolen, was not going to be disappointed: the affair was a joke whichever way it turned, for she had never committed herself even by a silent confidence in anything Mr. Grandcourt would do. Still, she noticed that he did sometimes quietly and gradually change his position according to hers, so that he could see her whenever she was dancing, and if he did not admire her--so much the worse for him.\nThis movement for the sake of being in sight of her was more direct than usual rather late in the evening, when Gwendolen had accepted Klesmer as a partner; and that wide-glancing personage, who saw everything and nothing by turns, said to her when they were walking, \"Mr. Grandcourt is a man of taste. He likes to see you dancing.\"\n\"Perhaps he likes to look at what is against his taste,\" said Gwendolen, with a light laugh; she was quite courageous with Klesmer now. \"He may be so tired of admiring that he likes disgust for variety.\"\n\"Those words are not suitable to your lips,\" said Klesmer, quickly, with one of his grand frowns, while he shook his hand as if to banish the discordant sounds.\n\"Are you as critical of words as of music?\"\n\"Certainly I am. I should require your words to be what your face and form are--always among the meanings of a noble music.\"\n\"That is a compliment as well as a correction. I am obliged for both. But do you know I am bold enough to wish to correct _you_, and require you to understand a joke?\"\n\"One may understand jokes without liking them,\" said the terrible Klesmer. \"I have had opera books sent me full of jokes; it was just because I understood them that I did not like them. The comic people are ready to challenge a man because he looks grave. 'You don't see the witticism, sir?' 'No, sir, but I see what you meant.' Then I am what we call ticketed as a fellow without _esprit_. But, in fact,\" said Klesmer, suddenly dropping from his quick narrative to a reflective tone, with an impressive frown, \"I am very sensible to wit and humor.\"\n\"I am glad you tell me that,\" said Gwendolen, not without some wickedness of intention. But Klesmer's thoughts had flown off on the wings of his own statement, as their habit was, and she had the wickedness all to herself. \"Pray, who is that standing near the card-room door?\" she went on, seeing there the same stranger with whom Klesmer had been in animated talk on the archery ground. \"He is a friend of yours, I think.\"\n\"No, no; an amateur I have seen in town; Lush, a Mr. Lush--too fond of Meyerbeer and Scribe--too fond of the mechanical-dramatic.\"\n\"Thanks. I wanted to know whether you thought his face and form required that his words should be among the meanings of noble music?\" Klesmer was conquered, and flashed at her a delightful smile which made them quite friendly until she begged to be deposited by the side of her mamma.\nThree minutes afterward her preparations for Grandcourt's indifference were all canceled. Turning her head after some remark to her mother, she found that he had made his way up to her.\n\"May I ask if you are tired of dancing, Miss Harleth?\" he began, looking down with his former unperturbed expression.\n\"Not in the least.\"\n\"Will you do me the honor--the next--or another quadrille?\"\n\"I should have been very happy,\" said Gwendolen looking at her card, \"but I am engaged for the next to Mr. Clintock--and indeed I perceive that I am doomed for every quadrille; I have not one to dispose of.\" She was not sorry to punish Mr. Grandcourt's tardiness, yet at the same time she would have liked to dance with him. She gave him a charming smile as she looked up to deliver her answer, and he stood still looking down at her with no smile at all.\n\"I am unfortunate in being too late,\" he said, after a moment's pause.\n\"It seemed to me that you did not care for dancing,\" said Gwendolen. \"I thought it might be one of the things you had left off.\"\n\"Yes, but I have not begun to dance with you,\" said Grandcourt. Always there was the same pause before he took up his cue. \"You make dancing a new thing, as you make archery.\"\n\"Is novelty always agreeable?\"\n\"No, no--not always.\"\n\"Then I don't know whether to feel flattered or not. When you had once danced with me there would be no more novelty in it.\"\n\"On the contrary, there would probably be much more.\"\n\"That is deep. I don't understand.\"\n\"It is difficult to make Miss Harleth understand her power?\" Here Grandcourt had turned to Mrs. Davilow, who, smiling gently at her daughter, said,\n\"I think she does not generally strike people as slow to understand.\"\n\"Mamma,\" said Gwendolen, in a deprecating tone, \"I am adorably stupid, and want everything explained to me--when the meaning is pleasant.\"\n\"If you are stupid, I admit that stupidity is adorable,\" returned Grandcourt, after the usual pause, and without change of tone. But clearly he knew what to say.\n\"I begin to think that my cavalier has forgotten me,\" Gwendolen observed after a little while. \"I see the quadrille is being formed.\"\n\"He deserves to be renounced,\" said Grandcourt.\n\"I think he is very pardonable,\" said Gwendolen.\n\"There must have been some misunderstanding,\" said Mrs. Davilow. \"Mr. Clintock was too anxious about the engagement to have forgotten it.\"\nBut now Lady Brackenshaw came up and said, \"Miss Harleth, Mr. Clintock has charged me to express to you his deep regret that he was obliged to leave without having the pleasure of dancing with you again. An express came from his father, the archdeacon; something important; he was to go. He was _au dsespoir_.\"\n\"Oh, he was very good to remember the engagement under the circumstances,\" said Gwendolen. \"I am sorry he was called away.\" It was easy to be politely sorrowful on so felicitous an occasion.\n\"Then I can profit by Mr. Clintock's misfortune?\" said Grandcourt. \"May I hope that you will let me take his place?\"\n\"I shall be very happy to dance the next quadrille with you.\"\nThe appropriateness of the event seemed an augury, and as Gwendolen stood up for the quadrille with Grandcourt, there was a revival in her of the exultation--the sense of carrying everything before her, which she had felt earlier in the day. No man could have walked through the quadrille with more irreproachable ease than Grandcourt; and the absence of all eagerness in his attention to her suited his partner's taste. She was now convinced that he meant to distinguish her, to mark his admiration of her in a noticeable way; and it began to appear probable that she would have it in her power to reject him, whence there was a pleasure in reckoning up the advantages which would make her rejection splendid, and in giving Mr. Grandcourt his utmost value. It was also agreeable to divine that this exclusive selection of her to dance with, from among all the unmarried ladies present, would attract observation; though she studiously avoided seeing this, and at the end of the quadrille walked away on Grandcourt's arm as if she had been one of the shortest sighted instead of the longest and widest sighted of mortals. They encountered Miss Arrowpoint, who was standing with Lady Brackenshaw and a group of gentlemen. The heiress looked at Gwendolen invitingly and said, \"I hope you will vote with us, Miss Harleth, and Mr. Grandcourt too, though he is not an archer.\" Gwendolen and Grandcourt paused to join the group, and found that the voting turned on the project of a picnic archery meeting to be held in Cardell Chase, where the evening entertainment would be more poetic than a ball under chandeliers--a feast of sunset lights along the glades and through the branches and over the solemn tree-tops.\nGwendolen thought the scheme delightful--equal to playing Robin Hood and Maid Marian: and Mr. Grandcourt, when appealed to a second time, said it was a thing to be done; whereupon Mr. Lush, who stood behind Lady Brackenshaw's elbow, drew Gwendolen's notice by saying with a familiar look and tone to Grandcourt, \"Diplow would be a good place for the meeting, and more convenient: there's a fine bit between the oaks toward the north gate.\"\nImpossible to look more unconscious of being addressed than Grandcourt; but Gwendolen took a new survey of the speaker, deciding, first, that he must be on terms of intimacy with the tenant of Diplow, and, secondly, that she would never, if she could help it, let him come within a yard of her. She was subject to physical antipathies, and Mr. Lush's prominent eyes, fat though not clumsy figure, and strong black gray-besprinkled hair of frizzy thickness, which, with the rest of his prosperous person, was enviable to many, created one of the strongest of her antipathies. To be safe from his looking at her, she murmured to Grandcourt, \"I should like to continue walking.\"\nHe obeyed immediately; but when they were thus away from any audience, he spoke no word for several minutes, and she, out of a half-amused, half-serious inclination for experiment, would not speak first. They turned into the large conservatory, beautifully lit up with Chinese lamps. The other couples there were at a distance which would not have interfered with any dialogue, but still they walked in silence until they had reached the farther end where there was a flush of pink light, and the second wide opening into the ball-room. Grandcourt, when they had half turned round, paused and said languidly,\n\"Do you like this kind of thing?\"\nIf the situation had been described to Gwendolen half an hour before, she would have laughed heartily at it, and could only have imagined herself returning a playful, satirical answer. But for some mysterious reason--it was a mystery of which she had a faint wondering consciousness--she dared not be satirical: she had begun to feel a wand over her that made her afraid of offending Grandcourt.\n\"Yes,\" she said, quietly, without considering what \"kind of thing\" was meant--whether the flowers, the scents, the ball in general, or this episode of walking with Mr. Grandcourt in particular. And they returned along the conservatory without farther interpretation. She then proposed to go and sit down in her old place, and they walked among scattered couples preparing for the waltz to the spot where Mrs. Davilow had been seated all the evening. As they approached it her seat was vacant, but she was coming toward it again, and, to Gwendolen's shuddering annoyance, with Mr. Lush at her elbow. There was no avoiding the confrontation: her mamma came close to her before they had reached the seats, and, after a quiet greeting smile, said innocently, \"Gwendolen, dear, let me present Mr. Lush to you.\" Having just made the acquaintance of this personage, as an intimate and constant companion of Mr. Grandcourt's, Mrs. Davilow imagined it altogether desirable that her daughter also should make the acquaintance.\nIt was hardly a bow that Gwendolen gave--rather, it was the slightest forward sweep of the head away from the physiognomy that inclined itself toward her, and she immediately moved toward her seat, saying, \"I want to put on my burnous.\" No sooner had she reached it, than Mr. Lush was there, and had the burnous in his hand: to annoy this supercilious young lady, he would incur the offense of forestalling Grandcourt; and, holding up the garment close to Gwendolen, he said, \"Pray, permit me?\" But she, wheeling away from him as if he had been a muddy hound, glided on to the ottoman, saying, \"No, thank you.\"\nA man who forgave this would have much Christian feeling, supposing he had intended to be agreeable to the young lady; but before he seized the burnous Mr. Lush had ceased to have that intention. Grandcourt quietly took the drapery from him, and Mr. Lush, with a slight bow, moved away. \"You had perhaps better put it on,\" said Mr. Grandcourt, looking down on her without change of expression.\n\"Thanks; perhaps it would be wise,\" said Gwendolen, rising, and submitting very gracefully to take the burnous on her shoulders.\nAfter that, Mr. Grandcourt exchanged a few polite speeches with Mrs. Davilow, and, in taking leave, asked permission to call at Offendene the next day. He was evidently not offended by the insult directed toward his friend. Certainly Gwendolen's refusal of the burnous from Mr. Lush was open to the interpretation that she wished to receive it from Mr. Grandcourt. But she, poor child, had no design in this action, and was simply following her antipathy and inclination, confiding in them as she did in the more reflective judgments into which they entered as sap into leafage. Gwendolen had no sense that these men were dark enigmas to her, or that she needed any help in drawing conclusions about them--Mr. Grandcourt at least. The chief question was, how far his character and ways might answer her wishes; and unless she were satisfied about that, she had said to herself that she would not accept his offer.\nCould there be a slenderer, more insignificant thread in human history than this consciousness of a girl, busy with her small inferences of the way in which she could make her life pleasant?--in a time, too, when ideas were with fresh vigor making armies of themselves, and the universal kinship was declaring itself fiercely; when women on the other side of the world would not mourn for the husbands and sons who died bravely in a common cause, and men stinted of bread on our side of the world heard of that willing loss and were patient: a time when the soul of man was walking to pulses which had for centuries been beating in him unfelt, until their full sum made a new life of terror or of joy.\nWhat in the midst of that mighty drama are girls and their blind visions? They are the Yea or Nay of that good for which men are enduring and fighting. In these delicate vessels is borne onward through the ages the treasure of human affections.",
        "paragraph_chars": [
            [
                0,
                112
            ],
            [
                112,
                2706
            ],
            [
                2706,
                2902
            ],
            [
                2902,
                2946
            ],
            [
                2946,
                3073
            ],
            [
                3073,
                3178
            ],
            [
                3178,
                3230
            ],
            [
                3230,
                3376
            ],
            [
                3376,
                3404
            ],
            [
                3404,
                3644
            ],
            [
                3644,
                3724
            ],
            [
                3724,
                3752
            ],
            [
                3752,
                3865
            ],
            [
                3865,
                4026
            ],
            [
                4026,
                4051
            ],
            [
                4051,
                4133
            ],
            [
                4133,
                4329
            ],
            [
                4329,
                4431
            ],
            [
                4431,
                4582
            ],
            [
                4582,
                4730
            ],
            [
                4730,
                4752
            ],
            [
                4752,
                4923
            ],
            [
                4923,
                5034
            ],
            [
                5034,
                5184
            ],
            [
                5184,
                5218
            ],
            [
                5218,
                5418
            ],
            [
                5418,
                5479
            ],
            [
                5479,
                5703
            ],
            [
                5703,
                6006
            ],
            [
                6006,
                6026
            ],
            [
                6026,
                6132
            ],
            [
                6132,
                6340
            ],
            [
                6340,
                6420
            ],
            [
                6420,
                6513
            ],
            [
                6513,
                6692
            ],
            [
                6692,
                6729
            ],
            [
                6729,
                6900
            ],
            [
                6900,
                7572
            ],
            [
                7572,
                7685
            ],
            [
                7685,
                7837
            ],
            [
                7837,
                8441
            ],
            [
                8441,
                9597
            ],
            [
                9597,
                9989
            ],
            [
                9989,
                10239
            ],
            [
                10239,
                10343
            ],
            [
                10343,
                10361
            ],
            [
                10361,
                10453
            ],
            [
                10453,
                10585
            ],
            [
                10585,
                11333
            ],
            [
                11333,
                12084
            ],
            [
                12084,
                12241
            ],
            [
                12241,
                12454
            ],
            [
                12454,
                12496
            ],
            [
                12496,
                12553
            ],
            [
                12553,
                12615
            ],
            [
                12615,
                12712
            ],
            [
                12712,
                13467
            ],
            [
                13467,
                13545
            ],
            [
                13545,
                13648
            ],
            [
                13648,
                13700
            ],
            [
                13700,
                13746
            ],
            [
                13746,
                13781
            ],
            [
                13781,
                13795
            ],
            [
                13795,
                13880
            ],
            [
                13880,
                13921
            ],
            [
                13921,
                14055
            ],
            [
                14055,
                14298
            ],
            [
                14298,
                14373
            ],
            [
                14373,
                14532
            ],
            [
                14532,
                15077
            ],
            [
                15077,
                15437
            ],
            [
                15437,
                15824
            ],
            [
                15824,
                17108
            ],
            [
                17108,
                17441
            ],
            [
                17441,
                17645
            ],
            [
                17645,
                17806
            ],
            [
                17806,
                17850
            ],
            [
                17850,
                17975
            ],
            [
                17975,
                18143
            ],
            [
                18143,
                18693
            ],
            [
                18693,
                19117
            ],
            [
                19117,
                19248
            ],
            [
                19248,
                19533
            ],
            [
                19533,
                19719
            ],
            [
                19719,
                19837
            ],
            [
                19837,
                19857
            ],
            [
                19857,
                19917
            ],
            [
                19917,
                20373
            ],
            [
                20373,
                20444
            ],
            [
                20444,
                20573
            ],
            [
                20573,
                20749
            ],
            [
                20749,
                20780
            ],
            [
                20780,
                20802
            ],
            [
                20802,
                20927
            ],
            [
                20927,
                20981
            ],
            [
                20981,
                21017
            ],
            [
                21017,
                21165
            ],
            [
                21165,
                21235
            ],
            [
                21235,
                21374
            ],
            [
                21374,
                21536
            ],
            [
                21536,
                21670
            ],
            [
                21670,
                21718
            ],
            [
                21718,
                21767
            ],
            [
                21767,
                21906
            ],
            [
                21906,
                22217
            ],
            [
                22217,
                22408
            ],
            [
                22408,
                22525
            ],
            [
                22525,
                22587
            ],
            [
                22587,
                24297
            ],
            [
                24297,
                24737
            ],
            [
                24737,
                25413
            ],
            [
                25413,
                26022
            ],
            [
                26022,
                26056
            ],
            [
                26056,
                26452
            ],
            [
                26452,
                27469
            ],
            [
                27469,
                28080
            ],
            [
                28080,
                28474
            ],
            [
                28474,
                28603
            ],
            [
                28603,
                29517
            ],
            [
                29517,
                30219
            ],
            [
                30219,
                30463
            ]
        ],
        "segment_chars": [
            [
                0,
                112
            ],
            [
                112,
                433
            ],
            [
                433,
                569
            ],
            [
                569,
                1100
            ],
            [
                1100,
                1277
            ],
            [
                1277,
                1611
            ],
            [
                1611,
                1782
            ],
            [
                1782,
                1862
            ],
            [
                1862,
                2023
            ],
            [
                2023,
                2083
            ],
            [
                2083,
                2280
            ],
            [
                2280,
                2623
            ],
            [
                2623,
                2706
            ],
            [
                2706,
                2768
            ],
            [
                2768,
                2902
            ],
            [
                2902,
                2930
            ],
            [
                2930,
                2946
            ],
            [
                2946,
                3073
            ],
            [
                3073,
                3105
            ],
            [
                3105,
                3178
            ],
            [
                3178,
                3230
            ],
            [
                3230,
                3376
            ],
            [
                3376,
                3404
            ],
            [
                3404,
                3444
            ],
            [
                3444,
                3568
            ],
            [
                3568,
                3644
            ],
            [
                3644,
                3724
            ],
            [
                3724,
                3752
            ],
            [
                3752,
                3821
            ],
            [
                3821,
                3865
            ],
            [
                3865,
                4026
            ],
            [
                4026,
                4051
            ],
            [
                4051,
                4133
            ],
            [
                4133,
                4329
            ],
            [
                4329,
                4406
            ],
            [
                4406,
                4431
            ],
            [
                4431,
                4524
            ],
            [
                4524,
                4544
            ],
            [
                4544,
                4582
            ],
            [
                4582,
                4730
            ],
            [
                4730,
                4752
            ],
            [
                4752,
                4767
            ],
            [
                4767,
                4815
            ],
            [
                4815,
                4877
            ],
            [
                4877,
                4923
            ],
            [
                4923,
                5034
            ],
            [
                5034,
                5089
            ],
            [
                5089,
                5141
            ],
            [
                5141,
                5184
            ],
            [
                5184,
                5218
            ],
            [
                5218,
                5418
            ],
            [
                5418,
                5453
            ],
            [
                5453,
                5479
            ],
            [
                5479,
                5593
            ],
            [
                5593,
                5703
            ],
            [
                5703,
                6006
            ],
            [
                6006,
                6026
            ],
            [
                6026,
                6060
            ],
            [
                6060,
                6095
            ],
            [
                6095,
                6132
            ],
            [
                6132,
                6340
            ],
            [
                6340,
                6377
            ],
            [
                6377,
                6420
            ],
            [
                6420,
                6440
            ],
            [
                6440,
                6461
            ],
            [
                6461,
                6513
            ],
            [
                6513,
                6692
            ],
            [
                6692,
                6710
            ],
            [
                6710,
                6729
            ],
            [
                6729,
                6778
            ],
            [
                6778,
                6839
            ],
            [
                6839,
                6878
            ],
            [
                6878,
                6900
            ],
            [
                6900,
                7198
            ],
            [
                7198,
                7500
            ],
            [
                7500,
                7572
            ],
            [
                7572,
                7642
            ],
            [
                7642,
                7685
            ],
            [
                7685,
                7713
            ],
            [
                7713,
                7837
            ],
            [
                7837,
                8098
            ],
            [
                8098,
                8441
            ],
            [
                8441,
                8535
            ],
            [
                8535,
                8961
            ],
            [
                8961,
                9097
            ],
            [
                9097,
                9597
            ],
            [
                9597,
                9765
            ],
            [
                9765,
                9989
            ],
            [
                9989,
                10130
            ],
            [
                10130,
                10172
            ],
            [
                10172,
                10239
            ],
            [
                10239,
                10343
            ],
            [
                10343,
                10361
            ],
            [
                10361,
                10409
            ],
            [
                10409,
                10453
            ],
            [
                10453,
                10585
            ],
            [
                10585,
                10740
            ],
            [
                10740,
                11333
            ],
            [
                11333,
                11591
            ],
            [
                11591,
                11715
            ],
            [
                11715,
                11917
            ],
            [
                11917,
                12084
            ],
            [
                12084,
                12241
            ],
            [
                12241,
                12454
            ],
            [
                12454,
                12496
            ],
            [
                12496,
                12502
            ],
            [
                12502,
                12553
            ],
            [
                12553,
                12593
            ],
            [
                12593,
                12615
            ],
            [
                12615,
                12660
            ],
            [
                12660,
                12696
            ],
            [
                12696,
                12712
            ],
            [
                12712,
                12855
            ],
            [
                12855,
                13053
            ],
            [
                13053,
                13147
            ],
            [
                13147,
                13230
            ],
            [
                13230,
                13467
            ],
            [
                13467,
                13545
            ],
            [
                13545,
                13583
            ],
            [
                13583,
                13607
            ],
            [
                13607,
                13648
            ],
            [
                13648,
                13700
            ],
            [
                13700,
                13746
            ],
            [
                13746,
                13781
            ],
            [
                13781,
                13795
            ],
            [
                13795,
                13837
            ],
            [
                13837,
                13880
            ],
            [
                13880,
                13921
            ],
            [
                13921,
                13930
            ],
            [
                13930,
                14010
            ],
            [
                14010,
                14055
            ],
            [
                14055,
                14126
            ],
            [
                14126,
                14298
            ],
            [
                14298,
                14344
            ],
            [
                14344,
                14373
            ],
            [
                14373,
                14386
            ],
            [
                14386,
                14484
            ],
            [
                14484,
                14532
            ],
            [
                14532,
                14642
            ],
            [
                14642,
                14910
            ],
            [
                14910,
                15077
            ],
            [
                15077,
                15113
            ],
            [
                15113,
                15148
            ],
            [
                15148,
                15184
            ],
            [
                15184,
                15220
            ],
            [
                15220,
                15268
            ],
            [
                15268,
                15437
            ],
            [
                15437,
                15475
            ],
            [
                15475,
                15579
            ],
            [
                15579,
                15824
            ],
            [
                15824,
                15901
            ],
            [
                15901,
                16010
            ],
            [
                16010,
                16119
            ],
            [
                16119,
                16198
            ],
            [
                16198,
                16498
            ],
            [
                16498,
                16509
            ],
            [
                16509,
                16635
            ],
            [
                16635,
                16679
            ],
            [
                16679,
                16898
            ],
            [
                16898,
                17108
            ],
            [
                17108,
                17411
            ],
            [
                17411,
                17441
            ],
            [
                17441,
                17577
            ],
            [
                17577,
                17645
            ],
            [
                17645,
                17806
            ],
            [
                17806,
                17850
            ],
            [
                17850,
                17867
            ],
            [
                17867,
                17975
            ],
            [
                17975,
                18022
            ],
            [
                18022,
                18045
            ],
            [
                18045,
                18143
            ],
            [
                18143,
                18218
            ],
            [
                18218,
                18329
            ],
            [
                18329,
                18399
            ],
            [
                18399,
                18435
            ],
            [
                18435,
                18472
            ],
            [
                18472,
                18534
            ],
            [
                18534,
                18693
            ],
            [
                18693,
                18781
            ],
            [
                18781,
                18916
            ],
            [
                18916,
                18970
            ],
            [
                18970,
                19081
            ],
            [
                19081,
                19117
            ],
            [
                19117,
                19248
            ],
            [
                19248,
                19257
            ],
            [
                19257,
                19382
            ],
            [
                19382,
                19533
            ],
            [
                19533,
                19623
            ],
            [
                19623,
                19719
            ],
            [
                19719,
                19774
            ],
            [
                19774,
                19837
            ],
            [
                19837,
                19857
            ],
            [
                19857,
                19917
            ],
            [
                19917,
                20125
            ],
            [
                20125,
                20242
            ],
            [
                20242,
                20373
            ],
            [
                20373,
                20444
            ],
            [
                20444,
                20513
            ],
            [
                20513,
                20573
            ],
            [
                20573,
                20637
            ],
            [
                20637,
                20696
            ],
            [
                20696,
                20749
            ],
            [
                20749,
                20780
            ],
            [
                20780,
                20802
            ],
            [
                20802,
                20855
            ],
            [
                20855,
                20927
            ],
            [
                20927,
                20981
            ],
            [
                20981,
                20996
            ],
            [
                20996,
                21017
            ],
            [
                21017,
                21078
            ],
            [
                21078,
                21165
            ],
            [
                21165,
                21235
            ],
            [
                21235,
                21374
            ],
            [
                21374,
                21503
            ],
            [
                21503,
                21536
            ],
            [
                21536,
                21631
            ],
            [
                21631,
                21670
            ],
            [
                21670,
                21718
            ],
            [
                21718,
                21767
            ],
            [
                21767,
                21832
            ],
            [
                21832,
                21906
            ],
            [
                21906,
                22110
            ],
            [
                22110,
                22194
            ],
            [
                22194,
                22217
            ],
            [
                22217,
                22308
            ],
            [
                22308,
                22341
            ],
            [
                22341,
                22408
            ],
            [
                22408,
                22458
            ],
            [
                22458,
                22475
            ],
            [
                22475,
                22525
            ],
            [
                22525,
                22587
            ],
            [
                22587,
                22829
            ],
            [
                22829,
                23008
            ],
            [
                23008,
                23345
            ],
            [
                23345,
                23709
            ],
            [
                23709,
                23808
            ],
            [
                23808,
                23959
            ],
            [
                23959,
                24297
            ],
            [
                24297,
                24737
            ],
            [
                24737,
                25032
            ],
            [
                25032,
                25312
            ],
            [
                25312,
                25413
            ],
            [
                25413,
                25617
            ],
            [
                25617,
                25697
            ],
            [
                25697,
                25950
            ],
            [
                25950,
                26022
            ],
            [
                26022,
                26056
            ],
            [
                26056,
                26241
            ],
            [
                26241,
                26452
            ],
            [
                26452,
                26646
            ],
            [
                26646,
                26719
            ],
            [
                26719,
                26902
            ],
            [
                26902,
                27051
            ],
            [
                27051,
                27258
            ],
            [
                27258,
                27469
            ],
            [
                27469,
                27706
            ],
            [
                27706,
                27964
            ],
            [
                27964,
                28080
            ],
            [
                28080,
                28276
            ],
            [
                28276,
                28367
            ],
            [
                28367,
                28474
            ],
            [
                28474,
                28603
            ],
            [
                28603,
                28755
            ],
            [
                28755,
                28827
            ],
            [
                28827,
                28968
            ],
            [
                28968,
                29182
            ],
            [
                29182,
                29334
            ],
            [
                29334,
                29517
            ],
            [
                29517,
                30219
            ],
            [
                30219,
                30293
            ],
            [
                30293,
                30371
            ],
            [
                30371,
                30463
            ]
        ],
        "overlap_chars": [
            [
                112,
                150
            ],
            [
                182,
                192
            ],
            [
                173,
                182
            ],
            [
                296,
                377
            ],
            [
                431,
                433
            ],
            [
                433,
                532
            ],
            [
                537,
                568
            ],
            [
                569,
                845
            ],
            [
                851,
                916
            ],
            [
                1054,
                1057
            ],
            [
                980,
                998
            ],
            [
                1098,
                1100
            ],
            [
                1100,
                1125
            ],
            [
                1139,
                1163
            ],
            [
                1188,
                1242
            ],
            [
                1254,
                1277
            ],
            [
                1325,
                1328
            ],
            [
                1551,
                1558
            ],
            [
                1718,
                1735
            ],
            [
                1741,
                1781
            ],
            [
                1782,
                1862
            ],
            [
                1913,
                1940
            ],
            [
                1947,
                1991
            ],
            [
                2021,
                2023
            ],
            [
                2023,
                2083
            ],
            [
                2119,
                2128
            ],
            [
                2176,
                2181
            ],
            [
                2227,
                2279
            ],
            [
                2294,
                2310
            ],
            [
                2319,
                2320
            ],
            [
                2340,
                2352
            ],
            [
                2520,
                2527
            ],
            [
                2412,
                2520
            ],
            [
                2528,
                2549
            ],
            [
                2557,
                2623
            ],
            [
                2629,
                2658
            ],
            [
                2677,
                2706
            ],
            [
                2706,
                2768
            ],
            [
                2768,
                2807
            ],
            [
                2816,
                2822
            ],
            [
                2838,
                2851
            ],
            [
                2823,
                2828
            ],
            [
                2900,
                2902
            ],
            [
                2902,
                2930
            ],
            [
                2930,
                2946
            ],
            [
                2946,
                2987
            ],
            [
                3017,
                3035
            ],
            [
                3060,
                3070
            ],
            [
                3036,
                3041
            ],
            [
                3070,
                3073
            ],
            [
                3073,
                3105
            ],
            [
                3105,
                3178
            ],
            [
                3178,
                3230
            ],
            [
                3230,
                3260
            ],
            [
                3310,
                3345
            ],
            [
                3298,
                3308
            ],
            [
                3350,
                3355
            ],
            [
                3367,
                3376
            ],
            [
                3376,
                3404
            ],
            [
                3404,
                3413
            ],
            [
                3415,
                3444
            ],
            [
                3444,
                3526
            ],
            [
                3566,
                3568
            ],
            [
                3568,
                3644
            ],
            [
                3644,
                3724
            ],
            [
                3724,
                3752
            ],
            [
                3752,
                3778
            ],
            [
                3780,
                3821
            ],
            [
                3821,
                3865
            ],
            [
                3865,
                3899
            ],
            [
                3925,
                4026
            ],
            [
                4026,
                4051
            ],
            [
                4051,
                4083
            ],
            [
                4085,
                4133
            ],
            [
                4133,
                4329
            ],
            [
                4329,
                4356
            ],
            [
                4404,
                4406
            ],
            [
                4406,
                4431
            ],
            [
                4431,
                4443
            ],
            [
                4445,
                4524
            ],
            [
                4524,
                4544
            ],
            [
                4544,
                4582
            ],
            [
                4582,
                4730
            ],
            [
                4730,
                4752
            ],
            [
                4752,
                4767
            ],
            [
                4767,
                4815
            ],
            [
                4815,
                4877
            ],
            [
                4877,
                4923
            ],
            [
                4923,
                4929
            ],
            [
                4930,
                5034
            ],
            [
                5034,
                5089
            ],
            [
                5089,
                5141
            ],
            [
                5141,
                5184
            ],
            [
                5184,
                5185
            ],
            [
                5186,
                5189
            ],
            [
                5191,
                5218
            ],
            [
                5218,
                5254
            ],
            [
                5274,
                5278
            ],
            [
                5283,
                5310
            ],
            [
                5311,
                5373
            ],
            [
                5415,
                5418
            ],
            [
                5418,
                5453
            ],
            [
                5453,
                5479
            ],
            [
                5479,
                5550
            ],
            [
                5593,
                5703
            ],
            [
                5703,
                5833
            ],
            [
                5869,
                5891
            ],
            [
                5946,
                5949
            ],
            [
                5955,
                6006
            ],
            [
                6006,
                6026
            ],
            [
                6026,
                6045
            ],
            [
                6058,
                6060
            ],
            [
                6060,
                6095
            ],
            [
                6095,
                6108
            ],
            [
                6119,
                6132
            ],
            [
                6132,
                6231
            ],
            [
                6263,
                6267
            ],
            [
                6280,
                6287
            ],
            [
                6337,
                6340
            ],
            [
                6340,
                6377
            ],
            [
                6377,
                6420
            ],
            [
                6420,
                6421
            ],
            [
                6440,
                6461
            ],
            [
                6461,
                6513
            ],
            [
                6513,
                6692
            ],
            [
                6692,
                6710
            ],
            [
                6710,
                6712
            ],
            [
                6714,
                6729
            ],
            [
                6729,
                6741
            ],
            [
                6746,
                6754
            ],
            [
                6760,
                6771
            ],
            [
                6776,
                6778
            ],
            [
                6788,
                6817
            ],
            [
                6819,
                6839
            ],
            [
                6839,
                6878
            ],
            [
                6878,
                6900
            ],
            [
                6900,
                6915
            ],
            [
                6916,
                6924
            ],
            [
                7018,
                7020
            ],
            [
                6940,
                6944
            ],
            [
                6954,
                6981
            ],
            [
                6983,
                6984
            ],
            [
                6987,
                6990
            ],
            [
                6995,
                7017
            ],
            [
                7024,
                7049
            ],
            [
                7061,
                7198
            ],
            [
                7198,
                7221
            ],
            [
                7335,
                7475
            ],
            [
                7487,
                7498
            ],
            [
                7498,
                7499
            ],
            [
                7572,
                7642
            ],
            [
                7642,
                7685
            ],
            [
                7685,
                7713
            ],
            [
                7713,
                7742
            ],
            [
                7775,
                7821
            ],
            [
                7829,
                7836
            ],
            [
                7837,
                7891
            ],
            [
                7895,
                7903
            ],
            [
                7922,
                7955
            ],
            [
                8005,
                8008
            ],
            [
                7956,
                7975
            ],
            [
                7981,
                7984
            ],
            [
                8066,
                8097
            ],
            [
                8441,
                8472
            ],
            [
                8480,
                8495
            ],
            [
                8533,
                8535
            ],
            [
                8583,
                8592
            ],
            [
                8645,
                8708
            ],
            [
                8734,
                8757
            ],
            [
                8758,
                8805
            ],
            [
                8827,
                8836
            ],
            [
                8959,
                8961
            ],
            [
                8961,
                8999
            ],
            [
                9005,
                9039
            ],
            [
                9049,
                9097
            ],
            [
                9097,
                9224
            ],
            [
                9341,
                9361
            ],
            [
                9436,
                9446
            ],
            [
                9452,
                9597
            ],
            [
                9597,
                9649
            ],
            [
                9656,
                9663
            ],
            [
                9685,
                9694
            ],
            [
                9701,
                9702
            ],
            [
                9736,
                9742
            ],
            [
                9763,
                9765
            ],
            [
                9855,
                9989
            ],
            [
                9989,
                9995
            ],
            [
                9996,
                10010
            ],
            [
                10049,
                10088
            ],
            [
                10090,
                10127
            ],
            [
                10127,
                10130
            ],
            [
                10130,
                10138
            ],
            [
                10170,
                10172
            ],
            [
                10176,
                10239
            ],
            [
                10239,
                10254
            ],
            [
                10263,
                10308
            ],
            [
                10322,
                10342
            ],
            [
                10409,
                10453
            ],
            [
                10453,
                10454
            ],
            [
                10464,
                10503
            ],
            [
                10509,
                10585
            ],
            [
                10585,
                10662
            ],
            [
                10738,
                10740
            ],
            [
                11333,
                11399
            ],
            [
                11417,
                11440
            ],
            [
                11602,
                11605
            ],
            [
                11446,
                11448
            ],
            [
                11463,
                11500
            ],
            [
                11591,
                11598
            ],
            [
                11611,
                11646
            ],
            [
                11713,
                11715
            ],
            [
                11917,
                11938
            ],
            [
                11947,
                11990
            ],
            [
                12045,
                12084
            ],
            [
                12084,
                12241
            ],
            [
                12241,
                12341
            ],
            [
                12350,
                12365
            ],
            [
                12452,
                12454
            ],
            [
                12454,
                12495
            ],
            [
                12553,
                12554
            ],
            [
                12562,
                12593
            ],
            [
                12593,
                12615
            ],
            [
                12615,
                12660
            ],
            [
                12660,
                12694
            ],
            [
                12712,
                12800
            ],
            [
                12829,
                12855
            ],
            [
                12855,
                12924
            ],
            [
                12938,
                12953
            ],
            [
                12972,
                12975
            ],
            [
                12976,
                13037
            ],
            [
                13051,
                13053
            ],
            [
                13053,
                13146
            ],
            [
                13467,
                13514
            ],
            [
                13515,
                13545
            ],
            [
                13545,
                13583
            ],
            [
                13583,
                13607
            ],
            [
                13607,
                13637
            ],
            [
                13701,
                13746
            ],
            [
                13746,
                13781
            ],
            [
                13781,
                13795
            ],
            [
                13795,
                13808
            ],
            [
                13823,
                13837
            ],
            [
                13837,
                13880
            ],
            [
                13880,
                13881
            ],
            [
                13887,
                13893
            ],
            [
                13901,
                13921
            ],
            [
                14532,
                14642
            ],
            [
                14642,
                14672
            ],
            [
                14905,
                14908
            ],
            [
                14673,
                14727
            ],
            [
                14737,
                14769
            ],
            [
                14773,
                14794
            ],
            [
                14828,
                14835
            ],
            [
                14858,
                14884
            ],
            [
                14898,
                14904
            ],
            [
                14908,
                14910
            ],
            [
                14927,
                14930
            ],
            [
                14935,
                14977
            ],
            [
                15001,
                15077
            ],
            [
                15824,
                15901
            ],
            [
                15901,
                16010
            ],
            [
                16010,
                16019
            ],
            [
                16029,
                16078
            ],
            [
                16114,
                16118
            ],
            [
                16221,
                16244
            ],
            [
                16255,
                16291
            ],
            [
                16245,
                16254
            ],
            [
                16291,
                16292
            ],
            [
                16635,
                16679
            ],
            [
                16679,
                16749
            ],
            [
                16797,
                16898
            ],
            [
                16898,
                17049
            ],
            [
                17106,
                17108
            ],
            [
                17108,
                17137
            ],
            [
                17156,
                17186
            ],
            [
                17194,
                17233
            ],
            [
                17243,
                17297
            ],
            [
                17340,
                17351
            ],
            [
                17374,
                17411
            ],
            [
                17411,
                17441
            ],
            [
                17441,
                17577
            ],
            [
                17577,
                17645
            ],
            [
                17645,
                17741
            ],
            [
                17804,
                17806
            ],
            [
                17806,
                17850
            ],
            [
                17850,
                17860
            ],
            [
                17865,
                17867
            ],
            [
                17867,
                17900
            ],
            [
                17961,
                17966
            ],
            [
                17906,
                17924
            ],
            [
                17972,
                17975
            ],
            [
                17975,
                18022
            ],
            [
                18022,
                18045
            ],
            [
                18917,
                18970
            ],
            [
                18970,
                19081
            ],
            [
                19081,
                19082
            ],
            [
                19088,
                19105
            ],
            [
                19117,
                19121
            ],
            [
                19126,
                19156
            ],
            [
                19236,
                19237
            ],
            [
                19176,
                19187
            ],
            [
                19164,
                19174
            ],
            [
                19245,
                19248
            ],
            [
                19533,
                19556
            ],
            [
                19671,
                19672
            ],
            [
                19673,
                19676
            ],
            [
                19557,
                19560
            ],
            [
                19578,
                19588
            ],
            [
                19695,
                19719
            ],
            [
                19719,
                19774
            ],
            [
                19774,
                19782
            ],
            [
                19835,
                19837
            ],
            [
                19837,
                19857
            ],
            [
                19857,
                19876
            ],
            [
                19884,
                19892
            ],
            [
                19894,
                19917
            ],
            [
                19917,
                20032
            ],
            [
                20034,
                20044
            ],
            [
                20094,
                20108
            ],
            [
                20083,
                20092
            ],
            [
                20109,
                20125
            ],
            [
                20125,
                20242
            ],
            [
                20242,
                20271
            ],
            [
                20310,
                20324
            ],
            [
                20331,
                20373
            ],
            [
                20373,
                20444
            ],
            [
                20444,
                20513
            ],
            [
                20513,
                20573
            ],
            [
                20573,
                20637
            ],
            [
                20637,
                20696
            ],
            [
                20696,
                20749
            ],
            [
                20868,
                20872
            ],
            [
                20860,
                20867
            ],
            [
                20873,
                20927
            ],
            [
                20927,
                20981
            ],
            [
                20981,
                20996
            ],
            [
                20996,
                21017
            ],
            [
                21017,
                21078
            ],
            [
                21078,
                21163
            ],
            [
                21165,
                21235
            ],
            [
                21235,
                21341
            ],
            [
                21343,
                21374
            ],
            [
                21374,
                21503
            ],
            [
                21503,
                21536
            ],
            [
                21536,
                21558
            ],
            [
                21571,
                21608
            ],
            [
                21629,
                21631
            ],
            [
                21631,
                21670
            ],
            [
                21906,
                21909
            ],
            [
                21914,
                22108
            ],
            [
                22308,
                22338
            ],
            [
                22475,
                22524
            ],
            [
                22458,
                22474
            ],
            [
                22525,
                22547
            ],
            [
                22584,
                22587
            ],
            [
                22620,
                22698
            ],
            [
                22722,
                22725
            ],
            [
                22809,
                22816
            ],
            [
                22733,
                22743
            ],
            [
                22827,
                22829
            ],
            [
                22829,
                22865
            ],
            [
                22876,
                22905
            ],
            [
                22921,
                22972
            ],
            [
                22980,
                22986
            ],
            [
                22976,
                22979
            ],
            [
                23001,
                23008
            ],
            [
                23008,
                23062
            ],
            [
                23113,
                23196
            ],
            [
                23343,
                23345
            ],
            [
                23345,
                23351
            ],
            [
                23357,
                23369
            ],
            [
                23377,
                23381
            ],
            [
                23410,
                23433
            ],
            [
                23440,
                23447
            ],
            [
                23458,
                23473
            ],
            [
                23488,
                23626
            ],
            [
                23634,
                23646
            ],
            [
                23689,
                23708
            ],
            [
                23709,
                23713
            ],
            [
                23726,
                23741
            ],
            [
                23782,
                23785
            ],
            [
                23765,
                23781
            ],
            [
                23786,
                23793
            ],
            [
                23743,
                23746
            ],
            [
                24173,
                24174
            ],
            [
                24050,
                24057
            ],
            [
                24061,
                24113
            ],
            [
                24295,
                24297
            ],
            [
                24297,
                24336
            ],
            [
                24401,
                24402
            ],
            [
                24383,
                24401
            ],
            [
                24435,
                24465
            ],
            [
                24477,
                24520
            ],
            [
                24433,
                24434
            ],
            [
                24564,
                24579
            ],
            [
                24589,
                24675
            ],
            [
                24734,
                24737
            ],
            [
                24797,
                24807
            ],
            [
                24761,
                24791
            ],
            [
                24973,
                24974
            ],
            [
                24813,
                24892
            ],
            [
                24893,
                24898
            ],
            [
                24911,
                24915
            ],
            [
                24936,
                24973
            ],
            [
                24997,
                25032
            ],
            [
                25079,
                25150
            ],
            [
                25155,
                25167
            ],
            [
                25176,
                25182
            ],
            [
                25168,
                25172
            ],
            [
                25261,
                25270
            ],
            [
                25295,
                25298
            ],
            [
                25060,
                25065
            ],
            [
                25310,
                25312
            ],
            [
                25348,
                25413
            ],
            [
                25413,
                25439
            ],
            [
                25487,
                25551
            ],
            [
                25566,
                25617
            ],
            [
                25617,
                25697
            ],
            [
                25697,
                25714
            ],
            [
                25721,
                25739
            ],
            [
                25789,
                25880
            ],
            [
                25910,
                25950
            ],
            [
                25950,
                25960
            ],
            [
                25995,
                26020
            ],
            [
                26022,
                26056
            ],
            [
                26105,
                26125
            ],
            [
                26095,
                26104
            ],
            [
                26169,
                26241
            ],
            [
                26241,
                26271
            ],
            [
                26340,
                26452
            ],
            [
                26452,
                26528
            ],
            [
                26530,
                26586
            ],
            [
                26603,
                26646
            ],
            [
                26646,
                26718
            ],
            [
                26719,
                26722
            ],
            [
                26728,
                26772
            ],
            [
                26856,
                26868
            ],
            [
                26945,
                26948
            ],
            [
                26902,
                26920
            ],
            [
                26772,
                26773
            ],
            [
                26949,
                26952
            ],
            [
                26984,
                26988
            ],
            [
                26924,
                26927
            ],
            [
                27001,
                27022
            ],
            [
                27028,
                27036
            ],
            [
                27037,
                27043
            ],
            [
                26998,
                27000
            ],
            [
                27044,
                27051
            ],
            [
                27051,
                27101
            ],
            [
                27190,
                27258
            ],
            [
                27258,
                27299
            ],
            [
                27317,
                27325
            ],
            [
                27339,
                27445
            ],
            [
                27467,
                27469
            ],
            [
                27469,
                27508
            ],
            [
                27510,
                27538
            ],
            [
                27547,
                27574
            ],
            [
                27628,
                27695
            ],
            [
                27703,
                27706
            ],
            [
                27706,
                27759
            ],
            [
                27769,
                27772
            ],
            [
                27781,
                27792
            ],
            [
                27759,
                27760
            ],
            [
                27794,
                27796
            ],
            [
                27863,
                27886
            ],
            [
                27848,
                27851
            ],
            [
                27860,
                27862
            ],
            [
                27803,
                27831
            ],
            [
                27893,
                27915
            ],
            [
                27934,
                27964
            ],
            [
                27964,
                27971
            ],
            [
                27973,
                27978
            ],
            [
                27982,
                27986
            ],
            [
                28053,
                28080
            ],
            [
                28080,
                28202
            ],
            [
                28232,
                28244
            ],
            [
                28265,
                28276
            ],
            [
                28276,
                28303
            ],
            [
                28312,
                28367
            ],
            [
                28367,
                28474
            ],
            [
                28474,
                28564
            ],
            [
                28601,
                28603
            ],
            [
                28686,
                28701
            ],
            [
                28613,
                28629
            ],
            [
                28703,
                28753
            ],
            [
                28679,
                28680
            ],
            [
                28762,
                28798
            ],
            [
                28815,
                28827
            ],
            [
                28827,
                28863
            ],
            [
                28872,
                28968
            ],
            [
                28968,
                28988
            ],
            [
                29023,
                29057
            ],
            [
                29017,
                29018
            ],
            [
                28996,
                29002
            ],
            [
                29180,
                29182
            ],
            [
                29182,
                29244
            ],
            [
                29311,
                29334
            ],
            [
                29334,
                29365
            ],
            [
                29389,
                29459
            ],
            [
                29489,
                29516
            ]
        ],
        "row_chars": [
            [
                0,
                112
            ],
            [
                112,
                433
            ],
            [
                433,
                569
            ],
            [
                569,
                1100
            ],
            [
                1100,
                1277
            ],
            [
                1277,
                1782
            ],
            [
                1782,
                1862
            ],
            [
                1862,
                2023
            ],
            [
                2023,
                2083
            ],
            [
                2083,
                2280
            ],
            [
                2280,
                2623
            ],
            [
                2623,
                2706
            ],
            [
                2706,
                2768
            ],
            [
                2768,
                2902
            ],
            [
                2902,
                2930
            ],
            [
                2930,
                2946
            ],
            [
                2946,
                3073
            ],
            [
                3073,
                3105
            ],
            [
                3105,
                3178
            ],
            [
                3178,
                3230
            ],
            [
                3230,
                3376
            ],
            [
                3376,
                3404
            ],
            [
                3404,
                3444
            ],
            [
                3444,
                3568
            ],
            [
                3568,
                3644
            ],
            [
                3644,
                3724
            ],
            [
                3724,
                3752
            ],
            [
                3752,
                3821
            ],
            [
                3821,
                3865
            ],
            [
                3865,
                4026
            ],
            [
                4026,
                4051
            ],
            [
                4051,
                4133
            ],
            [
                4133,
                4329
            ],
            [
                4329,
                4406
            ],
            [
                4406,
                4431
            ],
            [
                4431,
                4524
            ],
            [
                4524,
                4544
            ],
            [
                4544,
                4582
            ],
            [
                4582,
                4730
            ],
            [
                4730,
                4752
            ],
            [
                4752,
                4767
            ],
            [
                4767,
                4815
            ],
            [
                4815,
                4877
            ],
            [
                4877,
                4923
            ],
            [
                4923,
                5034
            ],
            [
                5034,
                5089
            ],
            [
                5089,
                5141
            ],
            [
                5141,
                5184
            ],
            [
                5184,
                5218
            ],
            [
                5218,
                5418
            ],
            [
                5418,
                5453
            ],
            [
                5453,
                5479
            ],
            [
                5479,
                5703
            ],
            [
                5703,
                6006
            ],
            [
                6006,
                6026
            ],
            [
                6026,
                6060
            ],
            [
                6060,
                6095
            ],
            [
                6095,
                6132
            ],
            [
                6132,
                6340
            ],
            [
                6340,
                6377
            ],
            [
                6377,
                6420
            ],
            [
                6420,
                6461
            ],
            [
                6461,
                6513
            ],
            [
                6513,
                6692
            ],
            [
                6692,
                6710
            ],
            [
                6710,
                6729
            ],
            [
                6729,
                6778
            ],
            [
                6778,
                6839
            ],
            [
                6839,
                6878
            ],
            [
                6878,
                6900
            ],
            [
                6900,
                7198
            ],
            [
                7198,
                7500
            ],
            [
                7500,
                7572
            ],
            [
                7572,
                7642
            ],
            [
                7642,
                7685
            ],
            [
                7685,
                7713
            ],
            [
                7713,
                7837
            ],
            [
                7837,
                8098
            ],
            [
                8098,
                8441
            ],
            [
                8441,
                8535
            ],
            [
                8535,
                8961
            ],
            [
                8961,
                9097
            ],
            [
                9097,
                9597
            ],
            [
                9597,
                9765
            ],
            [
                9765,
                9989
            ],
            [
                9989,
                10130
            ],
            [
                10130,
                10172
            ],
            [
                10172,
                10239
            ],
            [
                10239,
                10343
            ],
            [
                10343,
                10361
            ],
            [
                10361,
                10409
            ],
            [
                10409,
                10453
            ],
            [
                10453,
                10585
            ],
            [
                10585,
                10740
            ],
            [
                10740,
                11333
            ],
            [
                11333,
                11715
            ],
            [
                11715,
                11917
            ],
            [
                11917,
                12084
            ],
            [
                12084,
                12241
            ],
            [
                12241,
                12454
            ],
            [
                12454,
                12496
            ],
            [
                12496,
                12502
            ],
            [
                12502,
                12553
            ],
            [
                12553,
                12593
            ],
            [
                12593,
                12615
            ],
            [
                12615,
                12660
            ],
            [
                12660,
                12696
            ],
            [
                12696,
                12712
            ],
            [
                12712,
                12855
            ],
            [
                12855,
                13053
            ],
            [
                13053,
                13147
            ],
            [
                13147,
                13230
            ],
            [
                13230,
                13467
            ],
            [
                13467,
                13545
            ],
            [
                13545,
                13583
            ],
            [
                13583,
                13607
            ],
            [
                13607,
                13648
            ],
            [
                13648,
                13700
            ],
            [
                13700,
                13746
            ],
            [
                13746,
                13781
            ],
            [
                13781,
                13795
            ],
            [
                13795,
                13837
            ],
            [
                13837,
                13880
            ],
            [
                13880,
                13921
            ],
            [
                13921,
                13930
            ],
            [
                13930,
                14010
            ],
            [
                14010,
                14055
            ],
            [
                14055,
                14126
            ],
            [
                14126,
                14298
            ],
            [
                14298,
                14344
            ],
            [
                14344,
                14373
            ],
            [
                14373,
                14386
            ],
            [
                14386,
                14484
            ],
            [
                14484,
                14532
            ],
            [
                14532,
                14642
            ],
            [
                14642,
                14910
            ],
            [
                14910,
                15077
            ],
            [
                15077,
                15113
            ],
            [
                15113,
                15148
            ],
            [
                15148,
                15184
            ],
            [
                15184,
                15220
            ],
            [
                15220,
                15268
            ],
            [
                15268,
                15437
            ],
            [
                15437,
                15475
            ],
            [
                15475,
                15579
            ],
            [
                15579,
                15824
            ],
            [
                15824,
                15901
            ],
            [
                15901,
                16010
            ],
            [
                16010,
                16119
            ],
            [
                16119,
                16198
            ],
            [
                16198,
                16679
            ],
            [
                16679,
                16898
            ],
            [
                16898,
                17108
            ],
            [
                17108,
                17411
            ],
            [
                17411,
                17441
            ],
            [
                17441,
                17577
            ],
            [
                17577,
                17645
            ],
            [
                17645,
                17806
            ],
            [
                17806,
                17850
            ],
            [
                17850,
                17867
            ],
            [
                17867,
                17975
            ],
            [
                17975,
                18022
            ],
            [
                18022,
                18045
            ],
            [
                18045,
                18143
            ],
            [
                18143,
                18218
            ],
            [
                18218,
                18329
            ],
            [
                18329,
                18399
            ],
            [
                18399,
                18435
            ],
            [
                18435,
                18472
            ],
            [
                18472,
                18534
            ],
            [
                18534,
                18693
            ],
            [
                18693,
                18781
            ],
            [
                18781,
                18916
            ],
            [
                18916,
                18970
            ],
            [
                18970,
                19081
            ],
            [
                19081,
                19117
            ],
            [
                19117,
                19248
            ],
            [
                19248,
                19257
            ],
            [
                19257,
                19382
            ],
            [
                19382,
                19533
            ],
            [
                19533,
                19719
            ],
            [
                19719,
                19774
            ],
            [
                19774,
                19837
            ],
            [
                19837,
                19857
            ],
            [
                19857,
                19917
            ],
            [
                19917,
                20125
            ],
            [
                20125,
                20242
            ],
            [
                20242,
                20373
            ],
            [
                20373,
                20444
            ],
            [
                20444,
                20513
            ],
            [
                20513,
                20573
            ],
            [
                20573,
                20637
            ],
            [
                20637,
                20696
            ],
            [
                20696,
                20749
            ],
            [
                20749,
                20780
            ],
            [
                20780,
                20802
            ],
            [
                20802,
                20855
            ],
            [
                20855,
                20927
            ],
            [
                20927,
                20981
            ],
            [
                20981,
                20996
            ],
            [
                20996,
                21017
            ],
            [
                21017,
                21078
            ],
            [
                21078,
                21165
            ],
            [
                21165,
                21235
            ],
            [
                21235,
                21374
            ],
            [
                21374,
                21503
            ],
            [
                21503,
                21536
            ],
            [
                21536,
                21631
            ],
            [
                21631,
                21670
            ],
            [
                21670,
                21718
            ],
            [
                21718,
                21767
            ],
            [
                21767,
                21832
            ],
            [
                21832,
                21906
            ],
            [
                21906,
                22110
            ],
            [
                22110,
                22194
            ],
            [
                22194,
                22217
            ],
            [
                22217,
                22308
            ],
            [
                22308,
                22341
            ],
            [
                22341,
                22408
            ],
            [
                22408,
                22525
            ],
            [
                22525,
                22587
            ],
            [
                22587,
                22829
            ],
            [
                22829,
                23008
            ],
            [
                23008,
                23345
            ],
            [
                23345,
                23709
            ],
            [
                23709,
                24297
            ],
            [
                24297,
                24737
            ],
            [
                24737,
                25032
            ],
            [
                25032,
                25312
            ],
            [
                25312,
                25413
            ],
            [
                25413,
                25617
            ],
            [
                25617,
                25697
            ],
            [
                25697,
                25950
            ],
            [
                25950,
                26022
            ],
            [
                26022,
                26056
            ],
            [
                26056,
                26241
            ],
            [
                26241,
                26452
            ],
            [
                26452,
                26646
            ],
            [
                26646,
                26719
            ],
            [
                26719,
                27051
            ],
            [
                27051,
                27258
            ],
            [
                27258,
                27469
            ],
            [
                27469,
                27706
            ],
            [
                27706,
                27964
            ],
            [
                27964,
                28080
            ],
            [
                28080,
                28276
            ],
            [
                28276,
                28367
            ],
            [
                28367,
                28474
            ],
            [
                28474,
                28603
            ],
            [
                28603,
                28827
            ],
            [
                28827,
                28968
            ],
            [
                28968,
                29182
            ],
            [
                29182,
                29334
            ],
            [
                29334,
                29517
            ],
            [
                29517,
                30219
            ],
            [
                30219,
                30293
            ],
            [
                30293,
                30371
            ],
            [
                30371,
                30463
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Grandcourt's wish to be introduced was not unexpected; but when Gwendolen came face to face with the real man, there was a little shock which flushed her cheeks. The shock came from the reversal of her expectations: Grandcourt could hardly have been more unlike her imaginary portraits of him.\nHe was slightly taller than herself, and their eyes seemed to be on a level; there was not the faintest smile on his face as he looked at her, not a trace of self-consciousness or anxiety in his bearing: when he raised his hat he showed an extensive baldness surrounded with a fringe of reddish-blonde hair, but he also showed a perfect hand; and his features were decidedly handsome. It was not possible for a face to be freer from grimace: also it was perhaps not possible for a breathing man to look less animated. His bearing was relaxed; his long narrow grey eyes expressed nothing but indifference.\nAttempts at description are stupid: who can all at once describe a human being? Our knowledge of his appearance must be completed by innumerable impressions. We recognize the alphabet; we are not sure of the language. Gwendolen's first impressions were summed up in the words, \"He is not ridiculous.\"\nAs Lord Brackenshaw left, conversation began, while Grandcourt looked at Gwendolen persistently with a slightly exploring gaze, but without change of expression. She only occasionally glanced at him with a flash of observation a little softened by coquetry. After her answers there was a pause before he spoke again.\n\"I used to think archery was a great bore,\" Grandcourt began. He spoke with a fine accent, but with a broken and distinguished drawl.\n\"Are you converted to-day?\" said Gwendolen.\n(Pause, during which she imagined various opinions about herself that Grandcourt might hold.)\n\"Yes, since I saw you shooting. In things of this sort one generally sees people missing and simpering.\"\n\"I suppose you are a first-rate shot with a rifle.\"\n(Pause, during which Gwendolen made a brief graphic description of Grandcourt to an unknown hearer.)\n\"I have left off shooting.\"\n\"Oh, then you are a formidable person. People who have done things once and left them off make one feel very contemptible. I hope you have not left off all follies, because I practice a great many.\"\n(Pause, during which Gwendolen made several interpretations of her own speech.)\n\"What do you call follies?\"\n\"Well, in general, I think whatever is agreeable is called a folly. But you have not left off hunting, I hear.\"\n(Pause, wherein Gwendolen recalled Grandcourt's position, and decided that he was the most aristocratic-looking man she had ever seen.)\n\"One must do something.\"\n\"And do you care about the turf? - or is that among the things you have left off?\"\n(Pause, during which Gwendolen thought that a man of extremely calm, cold manners might be less disagreeable as a husband than other men, and not likely to interfere with his wife's preferences.)\n\"I run a horse now and then. Are you fond of horses?\"\n\"Yes, indeed: I never like my life so well as when I am on horseback, having a great gallop. I think of nothing. I only feel myself strong and happy.\"\n(Pause, wherein Gwendolen wondered whether Grandcourt would like what she said, but assured herself that she was not going to disguise her tastes.)\n\"Do you like danger?\"\n\"I don't know. When I am on horseback I never think of danger. It seems to me that if I broke my bones I should not feel it. I should go at anything that came in my way.\"\n(Pause, during which Gwendolen had run through a whole hunting season with two chosen hunters to ride at will.)\n\"You would perhaps like tiger-hunting or pig-sticking. I saw some of that for a season or two in the East. Everything here is poor stuff after that.\"\n\"You are fond of danger, then?\"\n(Pause, wherein Gwendolen speculated that men of coldest manners were probably the most adventurous, and felt the strength of her own insight.)\n\"One must have something or other. But one gets used to it.\"\n\"I begin to think I am very fortunate, because everything is new to me: I am not used to anything except being dull, which I should like to leave off as you have left off shooting.\"\n(Pause, during which it occurred to Gwendolen that a man of cold and distinguished manners might possibly be a dull companion; but then most persons were dull - and after all she was not going to accept Grandcourt.)\n\"Why are you dull?\"\n\"This is a dreadful neighbourhood. There is nothing to be done in it. That is why I practised my archery.\"\n(Pause, during which Gwendolen reflected that the life of an unmarried woman who could not go about must be dull indeed.)\n\"You have made yourself queen of it. I imagine you will carry the first prize.\"\n\"But I have great rivals. Did you not observe how well Miss Arrowpoint shot?\"\n(Pause, wherein Gwendolen was thinking that men had been known to choose some one else than the woman they most admired, and recalled several experiences of that kind in novels.)\n\"Miss Arrowpoint. No - that is, yes.\"\n\"Shall we go and hear the scoring? Everyone is going to the other end now - shall we join them? I think my uncle is looking toward me. He perhaps wants me.\"\nGwendolen found it a relief to thus change the situation: not that the tte--tte was quite disagreeable; but while it lasted she could not get rid of the unwonted flush in her cheeks and the sense of surprise which made her feel less mistress of herself than usual. And this Mr. Grandcourt must not take for granted that he was of great moment to her, or that because others speculated on him as a desirable match she held herself at his beck and call.\n\"You have just missed the gold arrow, Gwendolen,\" said Mr. Gascoigne. \"Miss Juliet Fenn scores eight above you.\"\n\"I am very glad to hear it. I should have felt that I was taking the best of everything,\" said Gwendolen easily. It was impossible to be jealous of Juliet Fenn, a girl middling in everything but her archery and her plainness, in which she resembled one of the more intelligent fishes.\nThere was now a lively movement of mingling groups. Gwendolen observed that Grandcourt was having Klesmer presented to him by a middle-aged man, with a dark, full face and fat hands, who seemed to be friendly with both. Who this stranger was she did not care to know; but she wished to observe Grandcourt's manner toward others than herself. Precisely the same: except that he did not look much at Miss Arrowpoint, but rather at Klesmer, who was speaking with animation and tossing his mane. Grandcourt listened with an impassive face and narrow eyes, his left fore-finger in his waistcoat-pocket, and his right slightly touching his thin whisker.\n\"I wonder which style Miss Arrowpoint admires most,\" thought Gwendolen, rather mockingly. Then she gave all her animation to those immediately around her, determined not to care whether Mr. Grandcourt came near her again or not.\nHe did not come, however, until it was time to conduct Mrs. Davilow to her carriage.\n\"Shall we meet again in the ball-room tonight?\" she said. His \"yes\" in reply had the usual slight drawl and perfect gravity.\n\"You were wrong about Mr. Grandcourt, Gwendolen,\" said Mrs. Davilow, during their drive to the castle. \"You can't find anything ridiculous in him.\"\n\"I could if I tried, but I don't want to,\" said Gwendolen, rather pettishly; and her mother was afraid to say more.\nIt was the rule on these occasions for the ladies and gentlemen to dine apart. In the ladies' dining-room it was evident that Gwendolen was not a favourite with her own sex: there was no intimacy between her and other girls, perhaps because she was not much interested in them. The exception to this aloofness from her was Miss Arrowpoint, who talked to her with quiet friendliness.\n\"She knows, as I do, that our friends are ready to quarrel over a husband for us,\" thought Gwendolen, \"and she is determined not to enter into the quarrel.\"\n\"I think Miss Arrowpoint has the best manners I ever saw,\" said Mrs. Davilow, when she and Gwendolen had retired to a dressing-room.\n\"I wish I were like her,\" said Gwendolen. \"I am discontented with things. She seems contented.\"\n\"I am sure you ought to be satisfied to-day. You must have enjoyed the shooting.\"\n\"Oh, that is over now, and I don't know what will come next,\" said Gwendolen, stretching and throwing up her arms. They were bare now; it was the fashion to dance in the archery dress, without the jacket; and her simple white cashmere with its border of pale green set off her form. A thin line of gold round her neck, and the gold star on her breast, were her only ornaments.\n\"The dancing will come next,\" said Mrs. Davilow. \"You are sure to enjoy that.\"\n\"I shall only dance in the quadrille. I told Mr. Clintock so. I shall not waltz or polk with anyone. I can't bear having ugly people so near me.\"\n\"Whom do you mean by ugly people?\"\n\"Oh, plenty.\"\n\"Mr. Clintock is not ugly.\" Mrs. Davilow dared not mention Grandcourt.\n\"I hate woollen cloth touching me.\"\nApparently something had changed Gwendolen's mood since the hour of exulting enjoyment in the archery-ground. But she did not look the worse for it under the chandeliers in the ball-room, where the soft splendour of the scene and the pleasant odours from the conservatory soothed her temper, as did the consciousness of being sought after. Almost every man was anxious to have her for a partner, and was in a state of melancholy remonstrance that she would not waltz or polk.\nAmong the remonstrant dancing men, however, Mr. Grandcourt was not numbered. After standing up for a quadrille with Miss Arrowpoint, it seemed that he meant to ask for no other partner. Gwendolen saw him frequently with the Arrowpoints, but he never approached her.\nShe thought that she would probably not have the least trouble about him after all: probably he meant to marry Miss Arrowpoint. Whatever might come, she, Gwendolen, was not going to be disappointed: for she had never committed herself even by a silent confidence in anything Mr. Grandcourt would do. Still, she noticed that he did sometimes quietly and gradually change his position according to hers, so that he could see her whenever she was dancing.\nThis movement for the sake of watching her was more direct than usual late in the evening, when Gwendolen had Klesmer as a partner; and that wide-glancing personage said to her, \"Mr. Grandcourt is a man of taste. He likes to see you dancing.\"\n\"Perhaps he likes to look at what is against his taste,\" said Gwendolen, with a light laugh; she was quite courageous with Klesmer now. \"He may be so tired of admiring that he likes disgust for variety.\"\n\"Those words are not suitable to your lips,\" said Klesmer, quickly, with one of his grand frowns.\n\"Are you as critical of words as of music?\"\n\"Certainly. I should require your words to be as noble as your face and form.\"\n\"That is a compliment as well as a correction. I am obliged for both. Pray, who is that standing near the card-room door?\" she went on, seeing there the same stranger with whom Klesmer had been in animated talk on the archery ground. \"A friend of yours?\"\n\"No, an amateur I have seen in town - too fond of popular operas - a Mr. Lush.\"\nThree minutes afterward, when she was back with her mamma, Grandcourt made his way up to her.\n\"May I ask if you are tired of dancing, Miss Harleth?\" he began.\n\"Not in the least.\"\n\"Will you do me the honour - the next - or another quadrille?\"\n\"I should have been very happy,\" said Gwendolen looking at her card, \"but I am engaged for the next to Mr. Clintock - and indeed I have not one quadrille left to dispose of.\" She was not sorry to punish Mr. Grandcourt's tardiness, yet at the same time she would have liked to dance with him. She gave him a charming smile, and he stood looking down at her with no smile at all.\n\"I am unfortunate in being too late,\" he said, after a moment's pause.\n\"It seemed to me that you did not care for dancing,\" said Gwendolen. \"I thought it might be one of the things you had left off.\"\n\"Yes, but I have not begun to dance with you,\" said Grandcourt. Always there was the same pause before he took up his cue. \"You make dancing a new thing, as you make archery.\"\n\"But once you had danced with me there would be no more novelty in it.\"\n\"On the contrary, there would probably be much more.\"\n\"That is deep. I don't understand.\"\n\"It is difficult to make Miss Harleth understand her power?\" Here Grandcourt had turned to Mrs. Davilow, who, smiling gently at her daughter, said-\n\"I think she does not generally strike people as slow to understand.\"\n\"Mamma,\" said Gwendolen, in a deprecating tone, \"I am adorably stupid, and want everything explained to me - when the meaning is pleasant.\"\n\"If you are stupid, I admit that stupidity is adorable,\" returned Grandcourt, after the usual pause, and without change of tone. But clearly he knew what to say.\n\"I begin to think that Mr Clintock has forgotten me,\" Gwendolen observed, looking round for her partner. \"I see the quadrille is being formed.\"\nBut just then Lady Brackenshaw came up and said, \"Miss Harleth, Mr. Clintock has charged me to express to you his deep regret that he was obliged to leave without having the pleasure of dancing with you again.\"\n\"I am sorry he was called away,\" said Gwendolen, politely.\n\"May I hope that you will let me take his place?\" said Grandcourt.\n\"I shall be very happy.\"\nIt seemed an augury, and as Gwendolen stood up for the quadrille with Grandcourt, her earlier exultation revived. No man could have walked through the dance with more irreproachable ease; and the absence of all eagerness in his attention suited her taste. She was now convinced that he meant to distinguish her; and it began to appear probable that she would have it in her power to reject him. It was agreeable to know that his selecting her to dance with, from all the ladies present, attracted observation; though she studiously avoided seeing this, and at the end of the quadrille walked away on Grandcourt's arm as if she had been the shortest sighted of mortals.\nThey joined Miss Arrowpoint and Lady Brackenshaw amongst a group who were discussing a project: a picnic archery meeting to be held in Cardell Chase.\nGwendolen thought the scheme delightful, and Mr. Grandcourt said it was a thing to be done. Mr. Lush, who stood behind Lady Brackenshaw, said with a familiar tone to Grandcourt, \"Diplow would be a good place for the meeting, and more convenient.\"\nAlthough Grandcourt looked totally unconscious of being addressed, Gwendolen took a new survey of the speaker, deciding, first, that he must be on intimate terms with Grandcourt, and, secondly, that she would never let him come within a yard of her. Mr. Lush's prominent eyes, fat though not clumsy figure, and strong black grey-besprinkled frizzy hair, created in her a strong antipathy. She murmured to Grandcourt, \"I should like to continue walking.\"\nHe obeyed immediately; but spoke no word for several minutes, and she, out of a half-amused inclination for experiment, would not speak first. They turned into the large conservatory, beautifully lit up with Chinese lamps. The other couples were at a distance, but still they walked in silence until they had reached the farther end where there was a second wide opening into the ball-room. Grandcourt paused and said languidly-\n\"Do you like this kind of thing?\"\nHalf an hour before, Gwendolen could only have imagined herself returning a playful, satirical answer. But for some mysterious reason she dared not be satirical: she had begun to feel a wand over her that made her afraid of offending Grandcourt.\n\"Yes,\" she said, quietly, without considering what \"kind of thing\" was meant - whether the flowers, the scents, the ball in general, or walking with Mr. Grandcourt in particular. And they returned along the conservatory without farther interpretation.\nShe proposed to go and sit down in her old place by Mrs. Davilow; but as they approached, she saw, to her shuddering annoyance, that Mr. Lush stood at her mother's elbow. There was no avoiding the confrontation: her mamma said innocently, \"Gwendolen, dear, let me present Mr. Lush to you.\" Having just made the acquaintance of this intimate companion of Mr. Grandcourt's, Mrs. Davilow imagined it altogether desirable that her daughter also should meet him.\nIt was hardly a bow that Gwendolen gave - rather, it was the slightest sweep of the head away from him. She immediately moved toward her seat, saying, \"I want to put on my cloak.\" No sooner had she reached it, than Mr. Lush was there with the cloak in his hand, willing to risk forestalling Grandcourt for the sake of annoying this supercilious young lady. Holding up the garment, he said, \"Pray, permit me?\" But she wheeled away, saying, \"No, thank you.\"\nA man who forgave this would have much Christian feeling, supposing he had intended to be agreeable to the young lady; but Mr. Lush had no such intention. Grandcourt quietly took the cloak from him, and Mr. Lush, with a slight bow, moved away. \"You had perhaps better put it on,\" said Mr. Grandcourt, looking down on her without change of expression.\n\"Thanks; perhaps it would be wise,\" said Gwendolen, rising, and submitting very gracefully.\nIn taking leave, Mr. Grandcourt asked permission to call at Offendene the next day, evidently not offended by the insult to his friend. Certainly Gwendolen's refusal of the cloak from Mr. Lush was open to the interpretation that she wished to receive it from Mr. Grandcourt. But she, poor child, was simply following her antipathy, without any such design. Gwendolen had no sense that these men were dark enigmas to her - Mr. Grandcourt at least. The chief question was, how far he might answer her wishes; and unless she were satisfied about that, she would not accept his offer.",
        "paragraph_chars": [
            [
                0,
                298
            ],
            [
                298,
                903
            ],
            [
                903,
                1204
            ],
            [
                1204,
                1521
            ],
            [
                1521,
                1655
            ],
            [
                1655,
                1699
            ],
            [
                1699,
                1793
            ],
            [
                1793,
                1898
            ],
            [
                1898,
                1950
            ],
            [
                1950,
                2051
            ],
            [
                2051,
                2079
            ],
            [
                2079,
                2278
            ],
            [
                2278,
                2358
            ],
            [
                2358,
                2386
            ],
            [
                2386,
                2498
            ],
            [
                2498,
                2634
            ],
            [
                2634,
                2659
            ],
            [
                2659,
                2742
            ],
            [
                2742,
                2938
            ],
            [
                2938,
                2992
            ],
            [
                2992,
                3143
            ],
            [
                3143,
                3291
            ],
            [
                3291,
                3313
            ],
            [
                3313,
                3484
            ],
            [
                3484,
                3596
            ],
            [
                3596,
                3746
            ],
            [
                3746,
                3778
            ],
            [
                3778,
                3922
            ],
            [
                3922,
                3983
            ],
            [
                3983,
                4165
            ],
            [
                4165,
                4381
            ],
            [
                4381,
                4401
            ],
            [
                4401,
                4508
            ],
            [
                4508,
                4630
            ],
            [
                4630,
                4710
            ],
            [
                4710,
                4788
            ],
            [
                4788,
                4967
            ],
            [
                4967,
                5005
            ],
            [
                5005,
                5162
            ],
            [
                5162,
                5614
            ],
            [
                5614,
                5727
            ],
            [
                5727,
                6012
            ],
            [
                6012,
                6660
            ],
            [
                6660,
                6889
            ],
            [
                6889,
                6974
            ],
            [
                6974,
                7099
            ],
            [
                7099,
                7247
            ],
            [
                7247,
                7363
            ],
            [
                7363,
                7746
            ],
            [
                7746,
                7903
            ],
            [
                7903,
                8036
            ],
            [
                8036,
                8132
            ],
            [
                8132,
                8214
            ],
            [
                8214,
                8591
            ],
            [
                8591,
                8670
            ],
            [
                8670,
                8816
            ],
            [
                8816,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8936
            ],
            [
                8936,
                8972
            ],
            [
                8972,
                9448
            ],
            [
                9448,
                9714
            ],
            [
                9714,
                10167
            ],
            [
                10167,
                10410
            ],
            [
                10410,
                10614
            ],
            [
                10614,
                10712
            ],
            [
                10712,
                10756
            ],
            [
                10756,
                10835
            ],
            [
                10835,
                11090
            ],
            [
                11090,
                11170
            ],
            [
                11170,
                11264
            ],
            [
                11264,
                11329
            ],
            [
                11329,
                11349
            ],
            [
                11349,
                11412
            ],
            [
                11412,
                11790
            ],
            [
                11790,
                11861
            ],
            [
                11861,
                11990
            ],
            [
                11990,
                12166
            ],
            [
                12166,
                12238
            ],
            [
                12238,
                12292
            ],
            [
                12292,
                12328
            ],
            [
                12328,
                12476
            ],
            [
                12476,
                12546
            ],
            [
                12546,
                12686
            ],
            [
                12686,
                12848
            ],
            [
                12848,
                12992
            ],
            [
                12992,
                13203
            ],
            [
                13203,
                13262
            ],
            [
                13262,
                13329
            ],
            [
                13329,
                13354
            ],
            [
                13354,
                14023
            ],
            [
                14023,
                14173
            ],
            [
                14173,
                14420
            ],
            [
                14420,
                14874
            ],
            [
                14874,
                15303
            ],
            [
                15303,
                15337
            ],
            [
                15337,
                15583
            ],
            [
                15583,
                15835
            ],
            [
                15835,
                16293
            ],
            [
                16293,
                16749
            ],
            [
                16749,
                17100
            ],
            [
                17100,
                17192
            ],
            [
                17192,
                17772
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                298
            ],
            [
                298,
                683
            ],
            [
                683,
                816
            ],
            [
                816,
                903
            ],
            [
                903,
                983
            ],
            [
                983,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1204
            ],
            [
                1204,
                1366
            ],
            [
                1366,
                1462
            ],
            [
                1462,
                1521
            ],
            [
                1521,
                1583
            ],
            [
                1583,
                1655
            ],
            [
                1655,
                1683
            ],
            [
                1683,
                1699
            ],
            [
                1699,
                1793
            ],
            [
                1793,
                1825
            ],
            [
                1825,
                1898
            ],
            [
                1898,
                1950
            ],
            [
                1950,
                2051
            ],
            [
                2051,
                2079
            ],
            [
                2079,
                2118
            ],
            [
                2118,
                2202
            ],
            [
                2202,
                2278
            ],
            [
                2278,
                2358
            ],
            [
                2358,
                2386
            ],
            [
                2386,
                2454
            ],
            [
                2454,
                2498
            ],
            [
                2498,
                2634
            ],
            [
                2634,
                2659
            ],
            [
                2659,
                2692
            ],
            [
                2692,
                2742
            ],
            [
                2742,
                2938
            ],
            [
                2938,
                2967
            ],
            [
                2967,
                2992
            ],
            [
                2992,
                3085
            ],
            [
                3085,
                3105
            ],
            [
                3105,
                3143
            ],
            [
                3143,
                3291
            ],
            [
                3291,
                3313
            ],
            [
                3313,
                3328
            ],
            [
                3328,
                3376
            ],
            [
                3376,
                3438
            ],
            [
                3438,
                3484
            ],
            [
                3484,
                3596
            ],
            [
                3596,
                3651
            ],
            [
                3651,
                3703
            ],
            [
                3703,
                3746
            ],
            [
                3746,
                3778
            ],
            [
                3778,
                3922
            ],
            [
                3922,
                3957
            ],
            [
                3957,
                3983
            ],
            [
                3983,
                4165
            ],
            [
                4165,
                4381
            ],
            [
                4381,
                4401
            ],
            [
                4401,
                4436
            ],
            [
                4436,
                4471
            ],
            [
                4471,
                4508
            ],
            [
                4508,
                4630
            ],
            [
                4630,
                4667
            ],
            [
                4667,
                4710
            ],
            [
                4710,
                4736
            ],
            [
                4736,
                4788
            ],
            [
                4788,
                4967
            ],
            [
                4967,
                4985
            ],
            [
                4985,
                5005
            ],
            [
                5005,
                5040
            ],
            [
                5040,
                5101
            ],
            [
                5101,
                5140
            ],
            [
                5140,
                5162
            ],
            [
                5162,
                5427
            ],
            [
                5427,
                5614
            ],
            [
                5614,
                5684
            ],
            [
                5684,
                5727
            ],
            [
                5727,
                5755
            ],
            [
                5755,
                5840
            ],
            [
                5840,
                6012
            ],
            [
                6012,
                6064
            ],
            [
                6064,
                6232
            ],
            [
                6232,
                6354
            ],
            [
                6354,
                6504
            ],
            [
                6504,
                6660
            ],
            [
                6660,
                6750
            ],
            [
                6750,
                6889
            ],
            [
                6889,
                6974
            ],
            [
                6974,
                7022
            ],
            [
                7022,
                7032
            ],
            [
                7032,
                7099
            ],
            [
                7099,
                7202
            ],
            [
                7202,
                7247
            ],
            [
                7247,
                7363
            ],
            [
                7363,
                7442
            ],
            [
                7442,
                7641
            ],
            [
                7641,
                7746
            ],
            [
                7746,
                7903
            ],
            [
                7903,
                8036
            ],
            [
                8036,
                8078
            ],
            [
                8078,
                8110
            ],
            [
                8110,
                8132
            ],
            [
                8132,
                8177
            ],
            [
                8177,
                8214
            ],
            [
                8214,
                8329
            ],
            [
                8329,
                8497
            ],
            [
                8497,
                8591
            ],
            [
                8591,
                8640
            ],
            [
                8640,
                8670
            ],
            [
                8670,
                8708
            ],
            [
                8708,
                8732
            ],
            [
                8732,
                8771
            ],
            [
                8771,
                8816
            ],
            [
                8816,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8893
            ],
            [
                8893,
                8936
            ],
            [
                8936,
                8972
            ],
            [
                8972,
                9082
            ],
            [
                9082,
                9312
            ],
            [
                9312,
                9448
            ],
            [
                9448,
                9525
            ],
            [
                9525,
                9634
            ],
            [
                9634,
                9714
            ],
            [
                9714,
                9842
            ],
            [
                9842,
                10014
            ],
            [
                10014,
                10167
            ],
            [
                10167,
                10380
            ],
            [
                10380,
                10410
            ],
            [
                10410,
                10546
            ],
            [
                10546,
                10614
            ],
            [
                10614,
                10712
            ],
            [
                10712,
                10756
            ],
            [
                10756,
                10768
            ],
            [
                10768,
                10835
            ],
            [
                10835,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                10958
            ],
            [
                10958,
                11069
            ],
            [
                11069,
                11090
            ],
            [
                11090,
                11170
            ],
            [
                11170,
                11264
            ],
            [
                11264,
                11319
            ],
            [
                11319,
                11329
            ],
            [
                11329,
                11349
            ],
            [
                11349,
                11412
            ],
            [
                11412,
                11587
            ],
            [
                11587,
                11704
            ],
            [
                11704,
                11790
            ],
            [
                11790,
                11861
            ],
            [
                11861,
                11930
            ],
            [
                11930,
                11990
            ],
            [
                11990,
                12054
            ],
            [
                12054,
                12113
            ],
            [
                12113,
                12166
            ],
            [
                12166,
                12238
            ],
            [
                12238,
                12292
            ],
            [
                12292,
                12307
            ],
            [
                12307,
                12328
            ],
            [
                12328,
                12389
            ],
            [
                12389,
                12476
            ],
            [
                12476,
                12546
            ],
            [
                12546,
                12686
            ],
            [
                12686,
                12815
            ],
            [
                12815,
                12848
            ],
            [
                12848,
                12953
            ],
            [
                12953,
                12992
            ],
            [
                12992,
                13203
            ],
            [
                13203,
                13262
            ],
            [
                13262,
                13312
            ],
            [
                13312,
                13329
            ],
            [
                13329,
                13354
            ],
            [
                13354,
                13468
            ],
            [
                13468,
                13610
            ],
            [
                13610,
                13749
            ],
            [
                13749,
                14023
            ],
            [
                14023,
                14173
            ],
            [
                14173,
                14265
            ],
            [
                14265,
                14420
            ],
            [
                14420,
                14670
            ],
            [
                14670,
                14809
            ],
            [
                14809,
                14874
            ],
            [
                14874,
                15017
            ],
            [
                15017,
                15097
            ],
            [
                15097,
                15265
            ],
            [
                15265,
                15303
            ],
            [
                15303,
                15337
            ],
            [
                15337,
                15440
            ],
            [
                15440,
                15583
            ],
            [
                15583,
                15762
            ],
            [
                15762,
                15835
            ],
            [
                15835,
                16006
            ],
            [
                16006,
                16125
            ],
            [
                16125,
                16293
            ],
            [
                16293,
                16397
            ],
            [
                16397,
                16473
            ],
            [
                16473,
                16650
            ],
            [
                16650,
                16702
            ],
            [
                16702,
                16749
            ],
            [
                16749,
                16904
            ],
            [
                16904,
                16993
            ],
            [
                16993,
                17100
            ],
            [
                17100,
                17192
            ],
            [
                17192,
                17328
            ],
            [
                17328,
                17467
            ],
            [
                17467,
                17549
            ],
            [
                17549,
                17639
            ],
            [
                17639,
                17772
            ]
        ],
        "overlap_chars": [
            [
                0,
                38
            ],
            [
                57,
                67
            ],
            [
                68,
                77
            ],
            [
                83,
                164
            ],
            [
                164,
                166
            ],
            [
                166,
                265
            ],
            [
                266,
                297
            ],
            [
                298,
                574
            ],
            [
                575,
                640
            ],
            [
                641,
                644
            ],
            [
                663,
                681
            ],
            [
                681,
                683
            ],
            [
                683,
                708
            ],
            [
                714,
                738
            ],
            [
                738,
                792
            ],
            [
                793,
                816
            ],
            [
                816,
                819
            ],
            [
                820,
                827
            ],
            [
                839,
                856
            ],
            [
                862,
                902
            ],
            [
                903,
                983
            ],
            [
                987,
                1014
            ],
            [
                1015,
                1059
            ],
            [
                1059,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1130
            ],
            [
                1133,
                1138
            ],
            [
                1151,
                1203
            ],
            [
                1207,
                1223
            ],
            [
                1228,
                1229
            ],
            [
                1230,
                1242
            ],
            [
                1248,
                1255
            ],
            [
                1256,
                1364
            ],
            [
                1366,
                1387
            ],
            [
                1396,
                1462
            ],
            [
                1462,
                1491
            ],
            [
                1492,
                1521
            ],
            [
                1521,
                1583
            ],
            [
                1583,
                1622
            ],
            [
                1623,
                1629
            ],
            [
                1634,
                1647
            ],
            [
                1648,
                1653
            ],
            [
                1653,
                1655
            ],
            [
                1655,
                1683
            ],
            [
                1683,
                1699
            ],
            [
                1699,
                1740
            ],
            [
                1750,
                1768
            ],
            [
                1769,
                1779
            ],
            [
                1780,
                1785
            ],
            [
                1790,
                1793
            ],
            [
                1793,
                1825
            ],
            [
                1825,
                1898
            ],
            [
                1898,
                1950
            ],
            [
                1950,
                1980
            ],
            [
                1981,
                2016
            ],
            [
                2017,
                2027
            ],
            [
                2028,
                2033
            ],
            [
                2042,
                2051
            ],
            [
                2051,
                2079
            ],
            [
                2079,
                2088
            ],
            [
                2089,
                2118
            ],
            [
                2118,
                2200
            ],
            [
                2200,
                2202
            ],
            [
                2202,
                2278
            ],
            [
                2278,
                2358
            ],
            [
                2358,
                2386
            ],
            [
                2386,
                2412
            ],
            [
                2413,
                2454
            ],
            [
                2454,
                2498
            ],
            [
                2498,
                2532
            ],
            [
                2533,
                2634
            ],
            [
                2634,
                2659
            ],
            [
                2659,
                2691
            ],
            [
                2694,
                2742
            ],
            [
                2742,
                2938
            ],
            [
                2938,
                2965
            ],
            [
                2965,
                2967
            ],
            [
                2967,
                2992
            ],
            [
                2992,
                3004
            ],
            [
                3006,
                3085
            ],
            [
                3085,
                3105
            ],
            [
                3105,
                3143
            ],
            [
                3143,
                3291
            ],
            [
                3291,
                3313
            ],
            [
                3313,
                3328
            ],
            [
                3328,
                3376
            ],
            [
                3376,
                3438
            ],
            [
                3438,
                3484
            ],
            [
                3484,
                3490
            ],
            [
                3492,
                3596
            ],
            [
                3596,
                3651
            ],
            [
                3651,
                3703
            ],
            [
                3703,
                3746
            ],
            [
                3746,
                3747
            ],
            [
                3747,
                3750
            ],
            [
                3751,
                3778
            ],
            [
                3778,
                3814
            ],
            [
                3815,
                3819
            ],
            [
                3820,
                3847
            ],
            [
                3857,
                3919
            ],
            [
                3919,
                3922
            ],
            [
                3922,
                3957
            ],
            [
                3957,
                3983
            ],
            [
                3983,
                4054
            ],
            [
                4055,
                4165
            ],
            [
                4165,
                4295
            ],
            [
                4301,
                4323
            ],
            [
                4326,
                4329
            ],
            [
                4330,
                4381
            ],
            [
                4381,
                4401
            ],
            [
                4401,
                4420
            ],
            [
                4434,
                4436
            ],
            [
                4436,
                4471
            ],
            [
                4471,
                4484
            ],
            [
                4495,
                4508
            ],
            [
                4508,
                4607
            ],
            [
                4608,
                4612
            ],
            [
                4613,
                4620
            ],
            [
                4627,
                4630
            ],
            [
                4630,
                4667
            ],
            [
                4667,
                4710
            ],
            [
                4710,
                4711
            ],
            [
                4715,
                4736
            ],
            [
                4736,
                4788
            ],
            [
                4788,
                4967
            ],
            [
                4967,
                4985
            ],
            [
                4985,
                4987
            ],
            [
                4990,
                5005
            ],
            [
                5005,
                5017
            ],
            [
                5018,
                5026
            ],
            [
                5027,
                5038
            ],
            [
                5038,
                5040
            ],
            [
                5049,
                5078
            ],
            [
                5081,
                5101
            ],
            [
                5101,
                5140
            ],
            [
                5140,
                5162
            ],
            [
                5162,
                5177
            ],
            [
                5181,
                5189
            ],
            [
                5190,
                5192
            ],
            [
                5193,
                5197
            ],
            [
                5205,
                5232
            ],
            [
                5233,
                5234
            ],
            [
                5236,
                5239
            ],
            [
                5242,
                5264
            ],
            [
                5264,
                5289
            ],
            [
                5290,
                5427
            ],
            [
                5427,
                5450
            ],
            [
                5451,
                5591
            ],
            [
                5592,
                5603
            ],
            [
                5612,
                5613
            ],
            [
                5614,
                5684
            ],
            [
                5684,
                5727
            ],
            [
                5727,
                5755
            ],
            [
                5755,
                5784
            ],
            [
                5785,
                5831
            ],
            [
                5832,
                5839
            ],
            [
                5840,
                5894
            ],
            [
                5895,
                5903
            ],
            [
                5904,
                5937
            ],
            [
                5938,
                5941
            ],
            [
                5942,
                5961
            ],
            [
                5962,
                5965
            ],
            [
                5980,
                6011
            ],
            [
                6012,
                6043
            ],
            [
                6047,
                6062
            ],
            [
                6062,
                6064
            ],
            [
                6064,
                6073
            ],
            [
                6074,
                6137
            ],
            [
                6138,
                6161
            ],
            [
                6164,
                6211
            ],
            [
                6221,
                6230
            ],
            [
                6230,
                6232
            ],
            [
                6232,
                6270
            ],
            [
                6271,
                6305
            ],
            [
                6306,
                6354
            ],
            [
                6354,
                6481
            ],
            [
                6482,
                6502
            ],
            [
                6504,
                6514
            ],
            [
                6515,
                6660
            ],
            [
                6660,
                6712
            ],
            [
                6713,
                6720
            ],
            [
                6721,
                6730
            ],
            [
                6730,
                6731
            ],
            [
                6732,
                6738
            ],
            [
                6748,
                6750
            ],
            [
                6755,
                6889
            ],
            [
                6889,
                6895
            ],
            [
                6900,
                6914
            ],
            [
                6933,
                6972
            ],
            [
                6974,
                7011
            ],
            [
                7019,
                7022
            ],
            [
                7022,
                7030
            ],
            [
                7030,
                7032
            ],
            [
                7036,
                7099
            ],
            [
                7099,
                7114
            ],
            [
                7135,
                7180
            ],
            [
                7181,
                7201
            ],
            [
                7203,
                7247
            ],
            [
                7247,
                7248
            ],
            [
                7248,
                7287
            ],
            [
                7287,
                7363
            ],
            [
                7363,
                7440
            ],
            [
                7440,
                7442
            ],
            [
                7442,
                7508
            ],
            [
                7519,
                7542
            ],
            [
                7543,
                7546
            ],
            [
                7547,
                7549
            ],
            [
                7550,
                7587
            ],
            [
                7588,
                7595
            ],
            [
                7604,
                7639
            ],
            [
                7639,
                7641
            ],
            [
                7641,
                7662
            ],
            [
                7663,
                7706
            ],
            [
                7707,
                7746
            ],
            [
                7746,
                7903
            ],
            [
                7903,
                8003
            ],
            [
                8019,
                8034
            ],
            [
                8034,
                8036
            ],
            [
                8036,
                8077
            ],
            [
                8078,
                8079
            ],
            [
                8079,
                8110
            ],
            [
                8110,
                8132
            ],
            [
                8132,
                8177
            ],
            [
                8177,
                8211
            ],
            [
                8214,
                8302
            ],
            [
                8303,
                8329
            ],
            [
                8329,
                8398
            ],
            [
                8407,
                8422
            ],
            [
                8423,
                8426
            ],
            [
                8434,
                8495
            ],
            [
                8495,
                8497
            ],
            [
                8497,
                8590
            ],
            [
                8591,
                8638
            ],
            [
                8640,
                8670
            ],
            [
                8670,
                8708
            ],
            [
                8708,
                8732
            ],
            [
                8732,
                8762
            ],
            [
                8771,
                8816
            ],
            [
                8816,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8878
            ],
            [
                8879,
                8893
            ],
            [
                8893,
                8936
            ],
            [
                8936,
                8937
            ],
            [
                8937,
                8943
            ],
            [
                8952,
                8972
            ],
            [
                8972,
                9082
            ],
            [
                9082,
                9112
            ],
            [
                9113,
                9116
            ],
            [
                9120,
                9174
            ],
            [
                9185,
                9217
            ],
            [
                9222,
                9243
            ],
            [
                9256,
                9263
            ],
            [
                9271,
                9297
            ],
            [
                9298,
                9304
            ],
            [
                9310,
                9312
            ],
            [
                9325,
                9328
            ],
            [
                9329,
                9371
            ],
            [
                9372,
                9448
            ],
            [
                9448,
                9525
            ],
            [
                9525,
                9634
            ],
            [
                9634,
                9643
            ],
            [
                9648,
                9697
            ],
            [
                9709,
                9713
            ],
            [
                9726,
                9749
            ],
            [
                9750,
                9786
            ],
            [
                9787,
                9796
            ],
            [
                9796,
                9797
            ],
            [
                9798,
                9842
            ],
            [
                9842,
                9912
            ],
            [
                9913,
                10014
            ],
            [
                10014,
                10165
            ],
            [
                10165,
                10167
            ],
            [
                10167,
                10196
            ],
            [
                10206,
                10236
            ],
            [
                10237,
                10276
            ],
            [
                10277,
                10331
            ],
            [
                10332,
                10343
            ],
            [
                10343,
                10380
            ],
            [
                10380,
                10410
            ],
            [
                10410,
                10546
            ],
            [
                10546,
                10614
            ],
            [
                10614,
                10710
            ],
            [
                10710,
                10712
            ],
            [
                10712,
                10756
            ],
            [
                10756,
                10766
            ],
            [
                10766,
                10768
            ],
            [
                10768,
                10801
            ],
            [
                10805,
                10810
            ],
            [
                10814,
                10832
            ],
            [
                10832,
                10835
            ],
            [
                10835,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                10958
            ],
            [
                10958,
                11069
            ],
            [
                11069,
                11070
            ],
            [
                11070,
                11087
            ],
            [
                11090,
                11094
            ],
            [
                11095,
                11125
            ],
            [
                11126,
                11127
            ],
            [
                11128,
                11139
            ],
            [
                11157,
                11167
            ],
            [
                11167,
                11170
            ],
            [
                11170,
                11193
            ],
            [
                11193,
                11194
            ],
            [
                11200,
                11203
            ],
            [
                11218,
                11221
            ],
            [
                11229,
                11239
            ],
            [
                11240,
                11264
            ],
            [
                11264,
                11319
            ],
            [
                11319,
                11327
            ],
            [
                11327,
                11329
            ],
            [
                11329,
                11349
            ],
            [
                11349,
                11368
            ],
            [
                11378,
                11386
            ],
            [
                11389,
                11412
            ],
            [
                11412,
                11527
            ],
            [
                11530,
                11540
            ],
            [
                11541,
                11555
            ],
            [
                11556,
                11565
            ],
            [
                11571,
                11587
            ],
            [
                11587,
                11704
            ],
            [
                11704,
                11733
            ],
            [
                11733,
                11747
            ],
            [
                11748,
                11790
            ],
            [
                11790,
                11861
            ],
            [
                11861,
                11930
            ],
            [
                11930,
                11990
            ],
            [
                11990,
                12054
            ],
            [
                12054,
                12113
            ],
            [
                12113,
                12166
            ],
            [
                12171,
                12175
            ],
            [
                12176,
                12183
            ],
            [
                12184,
                12238
            ],
            [
                12238,
                12292
            ],
            [
                12292,
                12307
            ],
            [
                12307,
                12328
            ],
            [
                12328,
                12389
            ],
            [
                12389,
                12474
            ],
            [
                12476,
                12546
            ],
            [
                12546,
                12652
            ],
            [
                12655,
                12686
            ],
            [
                12686,
                12815
            ],
            [
                12815,
                12848
            ],
            [
                12848,
                12870
            ],
            [
                12883,
                12920
            ],
            [
                12951,
                12953
            ],
            [
                12953,
                12992
            ],
            [
                12992,
                12995
            ],
            [
                13006,
                13200
            ],
            [
                13203,
                13233
            ],
            [
                13262,
                13311
            ],
            [
                13312,
                13328
            ],
            [
                13329,
                13351
            ],
            [
                13351,
                13354
            ],
            [
                13357,
                13435
            ],
            [
                13436,
                13439
            ],
            [
                13440,
                13447
            ],
            [
                13448,
                13458
            ],
            [
                13466,
                13468
            ],
            [
                13468,
                13504
            ],
            [
                13511,
                13540
            ],
            [
                13540,
                13591
            ],
            [
                13592,
                13598
            ],
            [
                13599,
                13602
            ],
            [
                13603,
                13610
            ],
            [
                13610,
                13664
            ],
            [
                13664,
                13747
            ],
            [
                13747,
                13749
            ],
            [
                13749,
                13755
            ],
            [
                13756,
                13768
            ],
            [
                13774,
                13778
            ],
            [
                13793,
                13816
            ],
            [
                13817,
                13824
            ],
            [
                13825,
                13840
            ],
            [
                13851,
                13989
            ],
            [
                13990,
                14002
            ],
            [
                14003,
                14022
            ],
            [
                14023,
                14027
            ],
            [
                14035,
                14050
            ],
            [
                14051,
                14054
            ],
            [
                14055,
                14071
            ],
            [
                14080,
                14087
            ],
            [
                14088,
                14091
            ],
            [
                14108,
                14109
            ],
            [
                14110,
                14117
            ],
            [
                14119,
                14171
            ],
            [
                14171,
                14173
            ],
            [
                14173,
                14212
            ],
            [
                14212,
                14213
            ],
            [
                14214,
                14232
            ],
            [
                14233,
                14263
            ],
            [
                14265,
                14308
            ],
            [
                14308,
                14309
            ],
            [
                14315,
                14330
            ],
            [
                14331,
                14417
            ],
            [
                14417,
                14420
            ],
            [
                14429,
                14439
            ],
            [
                14455,
                14485
            ],
            [
                14485,
                14486
            ],
            [
                14487,
                14566
            ],
            [
                14576,
                14581
            ],
            [
                14582,
                14586
            ],
            [
                14597,
                14634
            ],
            [
                14635,
                14670
            ],
            [
                14672,
                14743
            ],
            [
                14748,
                14760
            ],
            [
                14761,
                14767
            ],
            [
                14768,
                14772
            ],
            [
                14772,
                14781
            ],
            [
                14785,
                14788
            ],
            [
                14798,
                14803
            ],
            [
                14807,
                14809
            ],
            [
                14809,
                14874
            ],
            [
                14874,
                14900
            ],
            [
                14901,
                14965
            ],
            [
                14966,
                15017
            ],
            [
                15017,
                15097
            ],
            [
                15097,
                15114
            ],
            [
                15115,
                15133
            ],
            [
                15133,
                15224
            ],
            [
                15225,
                15265
            ],
            [
                15265,
                15275
            ],
            [
                15276,
                15301
            ],
            [
                15303,
                15337
            ],
            [
                15337,
                15357
            ],
            [
                15358,
                15367
            ],
            [
                15368,
                15440
            ],
            [
                15440,
                15470
            ],
            [
                15471,
                15583
            ],
            [
                15583,
                15659
            ],
            [
                15662,
                15718
            ],
            [
                15719,
                15762
            ],
            [
                15762,
                15834
            ],
            [
                15835,
                15838
            ],
            [
                15839,
                15883
            ],
            [
                15887,
                15899
            ],
            [
                15901,
                15904
            ],
            [
                15905,
                15923
            ],
            [
                15923,
                15924
            ],
            [
                15925,
                15928
            ],
            [
                15932,
                15936
            ],
            [
                15937,
                15940
            ],
            [
                15941,
                15962
            ],
            [
                15968,
                15976
            ],
            [
                15983,
                15989
            ],
            [
                15996,
                15998
            ],
            [
                15999,
                16006
            ],
            [
                16006,
                16056
            ],
            [
                16057,
                16125
            ],
            [
                16125,
                16166
            ],
            [
                16167,
                16175
            ],
            [
                16176,
                16282
            ],
            [
                16291,
                16293
            ],
            [
                16293,
                16332
            ],
            [
                16335,
                16363
            ],
            [
                16364,
                16391
            ],
            [
                16397,
                16464
            ],
            [
                16470,
                16473
            ],
            [
                16473,
                16526
            ],
            [
                16532,
                16535
            ],
            [
                16542,
                16553
            ],
            [
                16553,
                16554
            ],
            [
                16563,
                16565
            ],
            [
                16571,
                16594
            ],
            [
                16599,
                16602
            ],
            [
                16608,
                16610
            ],
            [
                16620,
                16648
            ],
            [
                16650,
                16672
            ],
            [
                16672,
                16702
            ],
            [
                16702,
                16709
            ],
            [
                16710,
                16715
            ],
            [
                16718,
                16722
            ],
            [
                16722,
                16749
            ],
            [
                16749,
                16871
            ],
            [
                16872,
                16884
            ],
            [
                16893,
                16904
            ],
            [
                16904,
                16931
            ],
            [
                16938,
                16993
            ],
            [
                16993,
                17100
            ],
            [
                17100,
                17190
            ],
            [
                17190,
                17192
            ],
            [
                17192,
                17207
            ],
            [
                17207,
                17223
            ],
            [
                17224,
                17274
            ],
            [
                17274,
                17275
            ],
            [
                17276,
                17312
            ],
            [
                17316,
                17328
            ],
            [
                17328,
                17364
            ],
            [
                17371,
                17467
            ],
            [
                17467,
                17487
            ],
            [
                17488,
                17522
            ],
            [
                17522,
                17523
            ],
            [
                17541,
                17547
            ],
            [
                17547,
                17549
            ],
            [
                17549,
                17611
            ],
            [
                17616,
                17639
            ],
            [
                17639,
                17670
            ],
            [
                17674,
                17744
            ],
            [
                17745,
                17772
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                166
            ],
            [
                166,
                298
            ],
            [
                298,
                683
            ],
            [
                683,
                816
            ],
            [
                816,
                903
            ],
            [
                903,
                983
            ],
            [
                983,
                1061
            ],
            [
                1061,
                1121
            ],
            [
                1121,
                1204
            ],
            [
                1204,
                1462
            ],
            [
                1462,
                1521
            ],
            [
                1521,
                1583
            ],
            [
                1583,
                1655
            ],
            [
                1655,
                1683
            ],
            [
                1683,
                1699
            ],
            [
                1699,
                1793
            ],
            [
                1793,
                1825
            ],
            [
                1825,
                1898
            ],
            [
                1898,
                1950
            ],
            [
                1950,
                2051
            ],
            [
                2051,
                2079
            ],
            [
                2079,
                2118
            ],
            [
                2118,
                2202
            ],
            [
                2202,
                2278
            ],
            [
                2278,
                2358
            ],
            [
                2358,
                2386
            ],
            [
                2386,
                2454
            ],
            [
                2454,
                2498
            ],
            [
                2498,
                2634
            ],
            [
                2634,
                2659
            ],
            [
                2659,
                2742
            ],
            [
                2742,
                2938
            ],
            [
                2938,
                2967
            ],
            [
                2967,
                2992
            ],
            [
                2992,
                3085
            ],
            [
                3085,
                3105
            ],
            [
                3105,
                3143
            ],
            [
                3143,
                3291
            ],
            [
                3291,
                3313
            ],
            [
                3313,
                3328
            ],
            [
                3328,
                3376
            ],
            [
                3376,
                3438
            ],
            [
                3438,
                3484
            ],
            [
                3484,
                3596
            ],
            [
                3596,
                3651
            ],
            [
                3651,
                3703
            ],
            [
                3703,
                3746
            ],
            [
                3746,
                3778
            ],
            [
                3778,
                3922
            ],
            [
                3922,
                3957
            ],
            [
                3957,
                3983
            ],
            [
                3983,
                4165
            ],
            [
                4165,
                4381
            ],
            [
                4381,
                4401
            ],
            [
                4401,
                4436
            ],
            [
                4436,
                4471
            ],
            [
                4471,
                4508
            ],
            [
                4508,
                4630
            ],
            [
                4630,
                4667
            ],
            [
                4667,
                4710
            ],
            [
                4710,
                4736
            ],
            [
                4736,
                4788
            ],
            [
                4788,
                4967
            ],
            [
                4967,
                4985
            ],
            [
                4985,
                5005
            ],
            [
                5005,
                5040
            ],
            [
                5040,
                5101
            ],
            [
                5101,
                5140
            ],
            [
                5140,
                5162
            ],
            [
                5162,
                5427
            ],
            [
                5427,
                5614
            ],
            [
                5614,
                5614
            ],
            [
                5614,
                5684
            ],
            [
                5684,
                5727
            ],
            [
                5727,
                5755
            ],
            [
                5755,
                5840
            ],
            [
                5840,
                6012
            ],
            [
                6012,
                6012
            ],
            [
                6012,
                6064
            ],
            [
                6064,
                6232
            ],
            [
                6232,
                6354
            ],
            [
                6354,
                6660
            ],
            [
                6660,
                6750
            ],
            [
                6750,
                6889
            ],
            [
                6889,
                7022
            ],
            [
                7022,
                7032
            ],
            [
                7032,
                7099
            ],
            [
                7099,
                7202
            ],
            [
                7202,
                7202
            ],
            [
                7202,
                7202
            ],
            [
                7202,
                7247
            ],
            [
                7247,
                7363
            ],
            [
                7363,
                7442
            ],
            [
                7442,
                7442
            ],
            [
                7442,
                7641
            ],
            [
                7641,
                7641
            ],
            [
                7641,
                7746
            ],
            [
                7746,
                7903
            ],
            [
                7903,
                8036
            ],
            [
                8036,
                8078
            ],
            [
                8078,
                8078
            ],
            [
                8078,
                8078
            ],
            [
                8078,
                8110
            ],
            [
                8110,
                8132
            ],
            [
                8132,
                8177
            ],
            [
                8177,
                8214
            ],
            [
                8214,
                8214
            ],
            [
                8214,
                8329
            ],
            [
                8329,
                8497
            ],
            [
                8497,
                8591
            ],
            [
                8591,
                8591
            ],
            [
                8591,
                8591
            ],
            [
                8591,
                8670
            ],
            [
                8670,
                8708
            ],
            [
                8708,
                8732
            ],
            [
                8732,
                8771
            ],
            [
                8771,
                8771
            ],
            [
                8771,
                8816
            ],
            [
                8816,
                8851
            ],
            [
                8851,
                8865
            ],
            [
                8865,
                8893
            ],
            [
                8893,
                8936
            ],
            [
                8936,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                8972
            ],
            [
                8972,
                9082
            ],
            [
                9082,
                9312
            ],
            [
                9312,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9448
            ],
            [
                9448,
                9525
            ],
            [
                9525,
                9634
            ],
            [
                9634,
                9714
            ],
            [
                9714,
                9714
            ],
            [
                9714,
                9842
            ],
            [
                9842,
                10014
            ],
            [
                10014,
                10167
            ],
            [
                10167,
                10380
            ],
            [
                10380,
                10410
            ],
            [
                10410,
                10546
            ],
            [
                10546,
                10614
            ],
            [
                10614,
                10712
            ],
            [
                10712,
                10756
            ],
            [
                10756,
                10768
            ],
            [
                10768,
                10835
            ],
            [
                10835,
                10882
            ],
            [
                10882,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10958
            ],
            [
                10958,
                11069
            ],
            [
                11069,
                11090
            ],
            [
                11090,
                11170
            ],
            [
                11170,
                11170
            ],
            [
                11170,
                11170
            ],
            [
                11170,
                11170
            ],
            [
                11170,
                11264
            ],
            [
                11264,
                11319
            ],
            [
                11319,
                11329
            ],
            [
                11329,
                11349
            ],
            [
                11349,
                11412
            ],
            [
                11412,
                11587
            ],
            [
                11587,
                11704
            ],
            [
                11704,
                11790
            ],
            [
                11790,
                11861
            ],
            [
                11861,
                11930
            ],
            [
                11930,
                11990
            ],
            [
                11990,
                12054
            ],
            [
                12054,
                12113
            ],
            [
                12113,
                12166
            ],
            [
                12166,
                12166
            ],
            [
                12166,
                12166
            ],
            [
                12166,
                12166
            ],
            [
                12166,
                12238
            ],
            [
                12238,
                12292
            ],
            [
                12292,
                12307
            ],
            [
                12307,
                12328
            ],
            [
                12328,
                12389
            ],
            [
                12389,
                12476
            ],
            [
                12476,
                12546
            ],
            [
                12546,
                12686
            ],
            [
                12686,
                12815
            ],
            [
                12815,
                12848
            ],
            [
                12848,
                12953
            ],
            [
                12953,
                12992
            ],
            [
                12992,
                12992
            ],
            [
                12992,
                12992
            ],
            [
                12992,
                12992
            ],
            [
                12992,
                12992
            ],
            [
                12992,
                13203
            ],
            [
                13203,
                13203
            ],
            [
                13203,
                13203
            ],
            [
                13203,
                13203
            ],
            [
                13203,
                13262
            ],
            [
                13262,
                13262
            ],
            [
                13262,
                13329
            ],
            [
                13329,
                13354
            ],
            [
                13354,
                13468
            ],
            [
                13468,
                13610
            ],
            [
                13610,
                13749
            ],
            [
                13749,
                14023
            ],
            [
                14023,
                14173
            ],
            [
                14173,
                14420
            ],
            [
                14420,
                14670
            ],
            [
                14670,
                14809
            ],
            [
                14809,
                14874
            ],
            [
                14874,
                15017
            ],
            [
                15017,
                15097
            ],
            [
                15097,
                15265
            ],
            [
                15265,
                15303
            ],
            [
                15303,
                15337
            ],
            [
                15337,
                15440
            ],
            [
                15440,
                15583
            ],
            [
                15583,
                15762
            ],
            [
                15762,
                15835
            ],
            [
                15835,
                16006
            ],
            [
                16006,
                16125
            ],
            [
                16125,
                16293
            ],
            [
                16293,
                16473
            ],
            [
                16473,
                16702
            ],
            [
                16702,
                16749
            ],
            [
                16749,
                16904
            ],
            [
                16904,
                16993
            ],
            [
                16993,
                17100
            ],
            [
                17100,
                17192
            ],
            [
                17192,
                17328
            ],
            [
                17328,
                17467
            ],
            [
                17467,
                17549
            ],
            [
                17549,
                17639
            ],
            [
                17639,
                17772
            ],
            [
                17772,
                17772
            ],
            [
                17772,
                17772
            ],
            [
                17772,
                17772
            ],
            [
                17772,
                17772
            ]
        ]
    }
}