{
    "original": {
        "text": "\"_Festina lente_--celerity should be contempered with cunctation.\"--SIR THOMAS BROWNE.\nGwendolen, we have seen, passed her time abroad in the new excitement of gambling, and in imagining herself an empress of luck, having brought from her late experience a vague impression that in this confused world it signified nothing what any one did, so that they amused themselves. We have seen, too, that certain persons, mysteriously symbolized as Grapnell & Co., having also thought of reigning in the realm of luck, and being also bent on amusing themselves, no matter how, had brought about a painful change in her family circumstances; whence she had returned home--carrying with her, against her inclination, a necklace which she had pawned and some one else had redeemed.\nWhile she was going back to England, Grandcourt was coming to find her; coming, that is, after his own manner--not in haste by express straight from Diplow to Leubronn, where she was understood to be; but so entirely without hurry that he was induced by the presence of some Russian acquaintances to linger at Baden-Baden and make various appointments with them, which, however, his desire to be at Leubronn ultimately caused him to break. Grandcourt's passions were of the intermittent, flickering kind: never flaming out strongly. But a great deal of life goes on without strong passion: myriads of cravats are carefully tied, dinners attended, even speeches made proposing the health of august personages without the zest arising from a strong desire. And a man may make a good appearance in high social positions--may be supposed to know the classics, to have his reserves on science, a strong though repressed opinion on politics, and all the sentiments of the English gentleman, at a small expense of vital energy. Also, he may be obstinate or persistent at the same low rate, and may even show sudden impulses which have a false air of daemonic strength because they seem inexplicable, though perhaps their secret lies merely in the want of regulated channels for the soul to move in--good and sufficient ducts of habit without which our nature easily turns to mere ooze and mud, and at any pressure yields nothing but a spurt or a puddle.\nGrandcourt had not been altogether displeased by Gwendolen's running away from the splendid chance he was holding out to her. The act had some piquancy for him. He liked to think that it was due to resentment of his careless behavior in Cardell Chase, which, when he came to consider it, did appear rather cool. To have brought her so near a tender admission, and then to have walked headlong away from further opportunities of winning the consent which he had made her understand him to be asking for, was enough to provoke a girl of spirit; and to be worth his mastering it was proper that she should have some spirit. Doubtless she meant him to follow her, and it was what he meant too. But for a whole week he took no measures toward starting, and did not even inquire where Miss Harleth was gone. Mr. Lush felt a triumph that was mingled with much distrust; for Grandcourt had said no word to him about her, and looked as neutral as an alligator; there was no telling what might turn up in the slowly-churning chances of his mind. Still, to have put off a decision was to have made room for the waste of Grandcourt's energy.\nThe guests at Diplow felt more curiosity than their host. How was it that nothing more was heard of Miss Harleth? Was it credible that she had refused Mr. Grandcourt? Lady Flora Hollis, a lively middle-aged woman, well endowed with curiosity, felt a sudden interest in making a round of calls with Mrs. Torrington, including the rectory, Offendene, and Quetcham, and thus not only got twice over, but also discussed with the Arrowpoints, the information that Miss Harleth was gone to Leubronn, with some old friends, the Baron and Baroness von Langen; for the immediate agitation and disappointment of Mrs. Davilow and the Gascoignes had resolved itself into a wish that Gwendolen's disappearance should not be interpreted as anything eccentric or needful to be kept secret. The rector's mind, indeed, entertained the possibility that the marriage was only a little deferred, for Mrs. Davilow had not dared to tell him of the bitter determination with which Gwendolen had spoken. And in spite of his practical ability, some of his experience had petrified into maxims and quotations. Amaryllis fleeing desired that her hiding-place should be known; and that love will find out the way \"over the mountain and over the wave\" may be said without hyperbole in this age of steam. Gwendolen, he conceived, was an Amaryllis of excellent sense but coquettish daring; the question was whether she had dared too much.\nLady Flora, coming back charged with news about Miss Harleth, saw no good reason why she should not try whether she could electrify Mr. Grandcourt by mentioning it to him at the table; and in doing so shot a few hints of a notion having got abroad that he was a disappointed adorer. Grandcourt heard with quietude, but with attention; and the next day he ordered Lush to bring about a decent reason for breaking up the party at Diplow by the end of another week, as he meant to go yachting to the Baltic or somewhere--it being impossible to stay at Diplow as if he were a prisoner on parole, with a set of people whom he had never wanted. Lush needed no clearer announcement that Grandcourt was going to Leubronn; but he might go after the manner of a creeping billiard-ball and stick on the way. What Mr. Lush intended was to make himself indispensable so that he might go too, and he succeeded; Gwendolen's repulsion for him being a fact that only amused his patron, and made him none the less willing to have Lush always at hand.\nThis was how it happened that Grandcourt arrived at the _Czarina_ on the fifth day after Gwendolen had left Leubronn, and found there his uncle, Sir Hugo Mallinger, with his family, including Deronda. It is not necessarily a pleasure either to the reigning power or the heir presumptive when their separate affairs--a touch of gout, say, in the one, and a touch of willfulness in the other--happen to bring them to the same spot. Sir Hugo was an easy-tempered man, tolerant both of differences and defects; but a point of view different from his own concerning the settlement of the family estates fretted him rather more than if it had concerned Church discipline or the ballot, and faults were the less venial for belonging to a person whose existence was inconvenient to him. In no case could Grandcourt have been a nephew after his own heart; but as the presumptive heir to the Mallinger estates he was the sign and embodiment of a chief grievance in the baronet's life--the want of a son to inherit the lands, in no portion of which had he himself more than a life-interest. For in the ill-advised settlement which his father, Sir Francis, had chosen to make by will, even Diplow with its modicum of land had been left under the same conditions as the ancient and wide inheritance of the two Toppings--Diplow, where Sir Hugo had lived and hunted through many a season in his younger years, and where his wife and daughters ought to have been able to retire after his death.\nThis grievance had naturally gathered emphasis as the years advanced, and Lady Mallinger, after having had three daughters in quick succession, had remained for eight years till now that she was over forty without producing so much as another girl; while Sir Hugo, almost twenty years older, was at a time of life when, notwithstanding the fashionable retardation of most things from dinners to marriages, a man's hopefulness is apt to show signs of wear, until restored by second childhood.\nIn fact, he had begun to despair of a son, and this confirmation of Grandcourt's interest in the estates certainly tended to make his image and presence the more unwelcome; but, on the other hand, it carried circumstances which disposed Sir Hugo to take care that the relation between them should be kept as friendly as possible. It led him to dwell on a plan which had grown up side by side with his disappointment of an heir; namely, to try and secure Diplow as a future residence for Lady Mallinger and her daughters, and keep this pretty bit of the family inheritance for his own offspring in spite of that disappointment. Such knowledge as he had of his nephew's disposition and affairs encouraged the belief that Grandcourt might consent to a transaction by which he would get a good sum of ready money, as an equivalent for his prospective interest in the domain of Diplow and the moderate amount of land attached to it. If, after all, the unhoped-for son should be born, the money would have been thrown away, and Grandcourt would have been paid for giving up interests that had turned out good for nothing; but Sir Hugo set down this risk as _nil_, and of late years he had husbanded his fortune so well by the working of mines and the sale of leases that he was prepared for an outlay.\nHere was an object that made him careful to avoid any quarrel with Grandcourt. Some years before, when he was making improvements at the Abbey, and needed Grandcourt's concurrence in his felling an obstructive mass of timber on the demesne, he had congratulated himself on finding that there was no active spite against him in his nephew's peculiar mind; and nothing had since occurred to make them hate each other more than was compatible with perfect politeness, or with any accommodation that could be strictly mutual.\nGrandcourt, on his side, thought his uncle a superfluity and a bore, and felt that the list of things in general would be improved whenever Sir Hugo came to be expunged. But he had been made aware through Lush, always a useful medium, of the baronet's inclinations concerning Diplow, and he was gratified to have the alternative of the money in his mind: even if he had not thought it in the least likely that he would choose to accept it, his sense of power would have been flattered by his being able to refuse what Sir Hugo desired. The hinted transaction had told for something among the motives which had made him ask for a year's tenancy of Diplow, which it had rather annoyed Sir Hugo to grant, because the excellent hunting in the neighborhood might decide Grandcourt not to part with his chance of future possession;--a man who has two places, in one of which the hunting is less good, naturally desiring a third where it is better. Also, Lush had thrown out to Sir Hugo the probability that Grandcourt would woo and win Miss Arrowpoint, and in that case ready money might be less of a temptation to him. Hence, on this unexpected meeting at Leubronn, the baronet felt much curiosity to know how things had been going on at Diplow, was bent on being as civil as possible to his nephew, and looked forward to some private chat with Lush.\nBetween Deronda and Grandcourt there was a more faintly-marked but peculiar relation, depending on circumstances which have yet to be made known. But on no side was there any sign of suppressed chagrin on the first meeting at the _table d'hte_, an hour after Grandcourt's arrival; and when the quartette of gentlemen afterward met on the terrace, without Lady Mallinger, they moved off together to saunter through the rooms, Sir Hugo saying as they entered the large _saal_,\n\"Did you play much at Baden, Grandcourt?\"\n\"No; I looked on and betted a little with some Russians there.\"\n\"Had you luck?\"\n\"What did I win, Lush?\"\n\"You brought away about two hundred,\" said Lush.\n\"You are not here for the sake of the play, then?\" said Sir Hugo.\n\"No; I don't care about play now. It's a confounded strain,\" said Grandcourt, whose diamond ring and demeanor, as he moved along playing slightly with his whisker, were being a good deal stared at by rouged foreigners interested in a new milord.\n\"The fact is, somebody should invent a mill to do amusements for you, my dear fellow,\" said Sir Hugo, \"as the Tartars get their praying done. But I agree with you; I never cared for play. It's monotonous--knits the brain up into meshes. And it knocks me up to watch it now. I suppose one gets poisoned with the bad air. I never stay here more than ten minutes. But where's your gambling beauty, Deronda? Have you seen her lately?\"\n\"She's gone,\" said Deronda, curtly.\n\"An uncommonly fine girl, a perfect Diana,\" said Sir Hugo, turning to Grandcourt again. \"Really worth a little straining to look at her. I saw her winning, and she took it as coolly as if she had known it all beforehand. The same day Deronda happened to see her losing like wildfire, and she bore it with immense pluck. I suppose she was cleaned out, or was wise enough to stop in time. How do you know she's gone?\"\n\"Oh, by the Visitor-list,...\" said Deronda, with a scarcely perceptible shrug. \"Vandernoodt told me her name was Harleth, and she was with the Baron and Baroness von Langen. I saw by the list that Miss Harleth was no longer there.\"\nThis held no further information for Lush than that Gwendolen had been gambling. He had already looked at the list, and ascertained that Gwendolen had gone, but he had no intention of thrusting this knowledge on Grandcourt before he asked for it; and he had not asked, finding it enough to believe that the object of search would turn up somewhere or other.\nBut now Grandcourt had heard what was rather piquant, and not a word about Miss Harleth had been missed by him. After a moment's pause he said to Deronda,\n\"Do you know those people--the Langens?\"\n\"I have talked with them a little since Miss Harleth went away. I knew nothing of them before.\"\n\"Where is she gone--do you know?\"\n\"She is gone home,\" said Deronda, coldly, as if he wished to say no more. But then, from a fresh impulse, he turned to look markedly at Grandcourt, and added, \"But it is possible you know her. Her home is not far from Diplow: Offendene, near Winchester.\"\nDeronda, turning to look straight at Grandcourt, who was on his left hand, might have been a subject for those old painters who liked contrasts of temperament. There was a calm intensity of life and richness of tint in his face that on a sudden gaze from him was rather startling, and often made him seem to have spoken, so that servants and officials asked him automatically, \"What did you say, sir?\" when he had been quite silent. Grandcourt himself felt an irritation, which he did not show except by a slight movement of the eyelids, at Deronda's turning round on him when he was not asked to do more than speak. But he answered, with his usual drawl, \"Yes, I know her,\" and paused with his shoulder toward Deronda, to look at the gambling.\n\"What of her, eh?\" asked Sir Hugo of Lush, as the three moved on a little way. \"She must be a new-comer at Offendene. Old Blenny lived there after the dowager died.\"\n\"A little too much of her,\" said Lush, in a low, significant tone; not sorry to let Sir Hugo know the state of affairs.\n\"Why? how?\" said the baronet. They all moved out of the _salon_ into an airy promenade.\n\"He has been on the brink of marrying her,\" Lush went on. \"But I hope it's off now. She's a niece of the clergyman--Gascoigne--at Pennicote. Her mother is a widow with a brood of daughters. This girl will have nothing, and is as dangerous as gunpowder. It would be a foolish marriage. But she has taken a freak against him, for she ran off here without notice, when he had agreed to call the next day. The fact is, he's here after her; but he was in no great hurry, and between his caprice and hers they are likely enough not to get together again. But of course he has lost his chance with the heiress.\"\nGrandcourt joining them said, \"What a beastly den this is!--a worse hole than Baden. I shall go back to the hotel.\"\nWhen Sir Hugo and Deronda were alone, the baronet began,\n\"Rather a pretty story. That girl has something in her. She must be worth running after--has _de l'imprvu_. I think her appearance on the scene has bettered my chance of getting Diplow, whether the marriage comes off or not.\"\n\"I should hope a marriage like that would not come off,\" said Deronda, in a tone of disgust.\n\"What! are you a little touched with the sublime lash?\" said Sir Hugo, putting up his glasses to help his short sight in looking at his companion. \"Are you inclined to run after her?\"\n\"On the contrary,\" said Deronda, \"I should rather be inclined to run away from her.\"\n\"Why, you would easily cut out Grandcourt. A girl with her spirit would think you the finer match of the two,\" said Sir Hugo, who often tried Deronda's patience by finding a joke in impossible advice. (A difference of taste in jokes is a great strain on the affections.)\n\"I suppose pedigree and land belong to a fine match,\" said Deronda, coldly.\n\"The best horse will win in spite of pedigree, my boy. You remember Napoleon's _mot--Je suis un anctre_\" said Sir Hugo, who habitually undervalued birth, as men after dining well often agree that the good of life is distributed with wonderful equality.\n\"I am not sure that I want to be an ancestor,\" said Deronda. \"It doesn't seem to me the rarest sort of origination.\"\n\"You won't run after the pretty gambler, then?\" said Sir Hugo, putting down his glasses.\n\"Decidedly not.\"\nThis answer was perfectly truthful; nevertheless it had passed through Deronda's mind that under other circumstances he should have given way to the interest this girl had raised in him, and tried to know more of her. But his history had given him a stronger bias in another direction. He felt himself in no sense free.",
        "paragraph_chars": [
            [
                0,
                87
            ],
            [
                87,
                771
            ],
            [
                771,
                2218
            ],
            [
                2218,
                3348
            ],
            [
                3348,
                4756
            ],
            [
                4756,
                5789
            ],
            [
                5789,
                7268
            ],
            [
                7268,
                7760
            ],
            [
                7760,
                9056
            ],
            [
                9056,
                9578
            ],
            [
                9578,
                10924
            ],
            [
                10924,
                11399
            ],
            [
                11399,
                11441
            ],
            [
                11441,
                11505
            ],
            [
                11505,
                11521
            ],
            [
                11521,
                11545
            ],
            [
                11545,
                11594
            ],
            [
                11594,
                11660
            ],
            [
                11660,
                11906
            ],
            [
                11906,
                12337
            ],
            [
                12337,
                12373
            ],
            [
                12373,
                12789
            ],
            [
                12789,
                13021
            ],
            [
                13021,
                13379
            ],
            [
                13379,
                13534
            ],
            [
                13534,
                13575
            ],
            [
                13575,
                13671
            ],
            [
                13671,
                13705
            ],
            [
                13705,
                13960
            ],
            [
                13960,
                14705
            ],
            [
                14705,
                14871
            ],
            [
                14871,
                14991
            ],
            [
                14991,
                15079
            ],
            [
                15079,
                15684
            ],
            [
                15684,
                15800
            ],
            [
                15800,
                15857
            ],
            [
                15857,
                16083
            ],
            [
                16083,
                16176
            ],
            [
                16176,
                16360
            ],
            [
                16360,
                16445
            ],
            [
                16445,
                16716
            ],
            [
                16716,
                16792
            ],
            [
                16792,
                17045
            ],
            [
                17045,
                17162
            ],
            [
                17162,
                17251
            ],
            [
                17251,
                17268
            ],
            [
                17268,
                17587
            ]
        ],
        "segment_chars": [
            [
                0,
                66
            ],
            [
                66,
                87
            ],
            [
                87,
                373
            ],
            [
                373,
                771
            ],
            [
                771,
                1211
            ],
            [
                1211,
                1304
            ],
            [
                1304,
                1526
            ],
            [
                1526,
                1792
            ],
            [
                1792,
                2218
            ],
            [
                2218,
                2344
            ],
            [
                2344,
                2379
            ],
            [
                2379,
                2530
            ],
            [
                2530,
                2839
            ],
            [
                2839,
                2908
            ],
            [
                2908,
                3020
            ],
            [
                3020,
                3254
            ],
            [
                3254,
                3348
            ],
            [
                3348,
                3406
            ],
            [
                3406,
                3462
            ],
            [
                3462,
                3515
            ],
            [
                3515,
                4123
            ],
            [
                4123,
                4328
            ],
            [
                4328,
                4432
            ],
            [
                4432,
                4623
            ],
            [
                4623,
                4756
            ],
            [
                4756,
                5039
            ],
            [
                5039,
                5395
            ],
            [
                5395,
                5553
            ],
            [
                5553,
                5789
            ],
            [
                5789,
                5990
            ],
            [
                5990,
                6219
            ],
            [
                6219,
                6568
            ],
            [
                6568,
                6869
            ],
            [
                6869,
                7268
            ],
            [
                7268,
                7760
            ],
            [
                7760,
                8090
            ],
            [
                8090,
                8387
            ],
            [
                8387,
                8688
            ],
            [
                8688,
                9056
            ],
            [
                9056,
                9135
            ],
            [
                9135,
                9578
            ],
            [
                9578,
                9748
            ],
            [
                9748,
                10114
            ],
            [
                10114,
                10520
            ],
            [
                10520,
                10692
            ],
            [
                10692,
                10924
            ],
            [
                10924,
                11070
            ],
            [
                11070,
                11399
            ],
            [
                11399,
                11441
            ],
            [
                11441,
                11505
            ],
            [
                11505,
                11521
            ],
            [
                11521,
                11545
            ],
            [
                11545,
                11594
            ],
            [
                11594,
                11645
            ],
            [
                11645,
                11660
            ],
            [
                11660,
                11694
            ],
            [
                11694,
                11906
            ],
            [
                11906,
                12048
            ],
            [
                12048,
                12094
            ],
            [
                12094,
                12143
            ],
            [
                12143,
                12180
            ],
            [
                12180,
                12226
            ],
            [
                12226,
                12267
            ],
            [
                12267,
                12310
            ],
            [
                12310,
                12337
            ],
            [
                12337,
                12373
            ],
            [
                12373,
                12461
            ],
            [
                12461,
                12510
            ],
            [
                12510,
                12594
            ],
            [
                12594,
                12693
            ],
            [
                12693,
                12760
            ],
            [
                12760,
                12789
            ],
            [
                12789,
                12868
            ],
            [
                12868,
                12963
            ],
            [
                12963,
                13021
            ],
            [
                13021,
                13102
            ],
            [
                13102,
                13379
            ],
            [
                13379,
                13491
            ],
            [
                13491,
                13534
            ],
            [
                13534,
                13575
            ],
            [
                13575,
                13639
            ],
            [
                13639,
                13671
            ],
            [
                13671,
                13705
            ],
            [
                13705,
                13779
            ],
            [
                13779,
                13898
            ],
            [
                13898,
                13960
            ],
            [
                13960,
                14120
            ],
            [
                14120,
                14362
            ],
            [
                14362,
                14393
            ],
            [
                14393,
                14577
            ],
            [
                14577,
                14705
            ],
            [
                14705,
                14724
            ],
            [
                14724,
                14784
            ],
            [
                14784,
                14823
            ],
            [
                14823,
                14871
            ],
            [
                14871,
                14991
            ],
            [
                14991,
                14997
            ],
            [
                14997,
                15003
            ],
            [
                15003,
                15021
            ],
            [
                15021,
                15079
            ],
            [
                15079,
                15137
            ],
            [
                15137,
                15163
            ],
            [
                15163,
                15220
            ],
            [
                15220,
                15269
            ],
            [
                15269,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15364,
                15481
            ],
            [
                15481,
                15628
            ],
            [
                15628,
                15684
            ],
            [
                15684,
                15769
            ],
            [
                15769,
                15800
            ],
            [
                15800,
                15857
            ],
            [
                15857,
                15881
            ],
            [
                15881,
                15913
            ],
            [
                15913,
                15965
            ],
            [
                15965,
                16083
            ],
            [
                16083,
                16176
            ],
            [
                16176,
                16183
            ],
            [
                16183,
                16232
            ],
            [
                16232,
                16323
            ],
            [
                16323,
                16360
            ],
            [
                16360,
                16445
            ],
            [
                16445,
                16488
            ],
            [
                16488,
                16646
            ],
            [
                16646,
                16716
            ],
            [
                16716,
                16792
            ],
            [
                16792,
                16847
            ],
            [
                16847,
                17045
            ],
            [
                17045,
                17106
            ],
            [
                17106,
                17162
            ],
            [
                17162,
                17210
            ],
            [
                17210,
                17251
            ],
            [
                17251,
                17268
            ],
            [
                17268,
                17486
            ],
            [
                17486,
                17554
            ],
            [
                17554,
                17587
            ]
        ],
        "overlap_chars": [
            [
                87,
                254
            ],
            [
                263,
                301
            ],
            [
                315,
                322
            ],
            [
                371,
                373
            ],
            [
                373,
                396
            ],
            [
                441,
                454
            ],
            [
                412,
                413
            ],
            [
                515,
                661
            ],
            [
                672,
                680
            ],
            [
                707,
                742
            ],
            [
                752,
                771
            ],
            [
                771,
                841
            ],
            [
                1167,
                1178
            ],
            [
                841,
                849
            ],
            [
                976,
                1021
            ],
            [
                1068,
                1092
            ],
            [
                1209,
                1211
            ],
            [
                1211,
                1274
            ],
            [
                1276,
                1304
            ],
            [
                1304,
                1359
            ],
            [
                1398,
                1399
            ],
            [
                1526,
                1539
            ],
            [
                1805,
                1817
            ],
            [
                1832,
                1857
            ],
            [
                1862,
                1898
            ],
            [
                1907,
                1962
            ],
            [
                2216,
                2218
            ],
            [
                2218,
                2291
            ],
            [
                2342,
                2344
            ],
            [
                2344,
                2379
            ],
            [
                2379,
                2433
            ],
            [
                2524,
                2528
            ],
            [
                2434,
                2442
            ],
            [
                2452,
                2468
            ],
            [
                2528,
                2530
            ],
            [
                2530,
                2601
            ],
            [
                2611,
                2615
            ],
            [
                2719,
                2839
            ],
            [
                2839,
                2907
            ],
            [
                2908,
                3020
            ],
            [
                3020,
                3043
            ],
            [
                3053,
                3065
            ],
            [
                3071,
                3095
            ],
            [
                3100,
                3253
            ],
            [
                3348,
                3368
            ],
            [
                3404,
                3406
            ],
            [
                3406,
                3462
            ],
            [
                3462,
                3515
            ],
            [
                3515,
                3561
            ],
            [
                3802,
                3840
            ],
            [
                3842,
                3864
            ],
            [
                3697,
                3700
            ],
            [
                4604,
                4608
            ],
            [
                4104,
                4106
            ],
            [
                4888,
                4902
            ],
            [
                5037,
                5039
            ],
            [
                5095,
                5107
            ],
            [
                5039,
                5049
            ],
            [
                5111,
                5126
            ],
            [
                5168,
                5272
            ],
            [
                5393,
                5394
            ],
            [
                5395,
                5485
            ],
            [
                5492,
                5530
            ],
            [
                5531,
                5553
            ],
            [
                5560,
                5575
            ],
            [
                5580,
                5609
            ],
            [
                5627,
                5700
            ],
            [
                5706,
                5789
            ],
            [
                5789,
                5844
            ],
            [
                5846,
                5853
            ],
            [
                5855,
                5990
            ],
            [
                6033,
                6036
            ],
            [
                5996,
                6022
            ],
            [
                6030,
                6032
            ],
            [
                6023,
                6029
            ],
            [
                6217,
                6219
            ],
            [
                6219,
                6248
            ],
            [
                6252,
                6262
            ],
            [
                6249,
                6252
            ],
            [
                6467,
                6468
            ],
            [
                6296,
                6299
            ],
            [
                6585,
                6595
            ],
            [
                6543,
                6546
            ],
            [
                6606,
                6635
            ],
            [
                6283,
                6286
            ],
            [
                6640,
                6699
            ],
            [
                6709,
                6722
            ],
            [
                6755,
                6757
            ],
            [
                6725,
                6740
            ],
            [
                6858,
                6859
            ],
            [
                6350,
                6353
            ],
            [
                6773,
                6781
            ],
            [
                6867,
                6869
            ],
            [
                6869,
                6872
            ],
            [
                6967,
                6973
            ],
            [
                6945,
                6947
            ],
            [
                7194,
                7216
            ],
            [
                7251,
                7268
            ],
            [
                7268,
                7296
            ],
            [
                7315,
                7411
            ],
            [
                7459,
                7462
            ],
            [
                7446,
                7449
            ],
            [
                7463,
                7473
            ],
            [
                7758,
                7759
            ],
            [
                7523,
                7559
            ],
            [
                7772,
                7801
            ],
            [
                7828,
                7840
            ],
            [
                7904,
                7912
            ],
            [
                7560,
                7563
            ],
            [
                7922,
                7936
            ],
            [
                7997,
                8005
            ],
            [
                8024,
                8049
            ],
            [
                7660,
                7662
            ],
            [
                8057,
                8090
            ],
            [
                8126,
                8129
            ],
            [
                8113,
                8119
            ],
            [
                8101,
                8103
            ],
            [
                8207,
                8294
            ],
            [
                8302,
                8353
            ],
            [
                8385,
                8387
            ],
            [
                8405,
                8407
            ],
            [
                8474,
                8506
            ],
            [
                8543,
                8556
            ],
            [
                8563,
                8568
            ],
            [
                8587,
                8594
            ],
            [
                8607,
                8618
            ],
            [
                8633,
                8643
            ],
            [
                8667,
                8671
            ],
            [
                8874,
                8875
            ],
            [
                8440,
                8443
            ],
            [
                8898,
                8902
            ],
            [
                9080,
                9135
            ],
            [
                9455,
                9519
            ],
            [
                9576,
                9578
            ],
            [
                9578,
                9631
            ],
            [
                9641,
                9645
            ],
            [
                9746,
                9748
            ],
            [
                9748,
                9751
            ],
            [
                9783,
                9787
            ],
            [
                9755,
                9758
            ],
            [
                9764,
                9768
            ],
            [
                9769,
                9774
            ],
            [
                9813,
                9829
            ],
            [
                9843,
                9894
            ],
            [
                9907,
                9943
            ],
            [
                9948,
                9951
            ],
            [
                9997,
                10042
            ],
            [
                10053,
                10090
            ],
            [
                10112,
                10113
            ],
            [
                10434,
                10437
            ],
            [
                10137,
                10140
            ],
            [
                10201,
                10238
            ],
            [
                10242,
                10269
            ],
            [
                10278,
                10309
            ],
            [
                10330,
                10335
            ],
            [
                10343,
                10353
            ],
            [
                10336,
                10342
            ],
            [
                10354,
                10370
            ],
            [
                10239,
                10241
            ],
            [
                10518,
                10520
            ],
            [
                10520,
                10534
            ],
            [
                10546,
                10557
            ],
            [
                10574,
                10624
            ],
            [
                10687,
                10690
            ],
            [
                10558,
                10561
            ],
            [
                10642,
                10653
            ],
            [
                10690,
                10692
            ],
            [
                10739,
                10836
            ],
            [
                10840,
                10845
            ],
            [
                10858,
                10924
            ],
            [
                10924,
                10966
            ],
            [
                10991,
                11009
            ],
            [
                11023,
                11070
            ],
            [
                11070,
                11073
            ],
            [
                11077,
                11079
            ],
            [
                11095,
                11106
            ],
            [
                11126,
                11146
            ],
            [
                11214,
                11223
            ],
            [
                11228,
                11240
            ],
            [
                11322,
                11326
            ],
            [
                11330,
                11364
            ],
            [
                11399,
                11441
            ],
            [
                11441,
                11477
            ],
            [
                11502,
                11505
            ],
            [
                11505,
                11521
            ],
            [
                11521,
                11545
            ],
            [
                11545,
                11594
            ],
            [
                11594,
                11619
            ],
            [
                11632,
                11645
            ],
            [
                11645,
                11660
            ],
            [
                11660,
                11694
            ],
            [
                11694,
                11760
            ],
            [
                11824,
                11859
            ],
            [
                11867,
                11906
            ],
            [
                11906,
                11907
            ],
            [
                12052,
                12064
            ],
            [
                11971,
                12006
            ],
            [
                12068,
                12069
            ],
            [
                12008,
                12009
            ],
            [
                12070,
                12094
            ],
            [
                12094,
                12096
            ],
            [
                12111,
                12143
            ],
            [
                12226,
                12267
            ],
            [
                12267,
                12310
            ],
            [
                12310,
                12337
            ],
            [
                12337,
                12373
            ],
            [
                12373,
                12461
            ],
            [
                12510,
                12528
            ],
            [
                12545,
                12568
            ],
            [
                12542,
                12544
            ],
            [
                12592,
                12594
            ],
            [
                12607,
                12693
            ],
            [
                12693,
                12760
            ],
            [
                12760,
                12789
            ],
            [
                12789,
                12813
            ],
            [
                12819,
                12839
            ],
            [
                12861,
                12868
            ],
            [
                12868,
                12961
            ],
            [
                13105,
                13140
            ],
            [
                13153,
                13204
            ],
            [
                13233,
                13259
            ],
            [
                13266,
                13288
            ],
            [
                13377,
                13379
            ],
            [
                13379,
                13431
            ],
            [
                13489,
                13491
            ],
            [
                13491,
                13532
            ],
            [
                13534,
                13546
            ],
            [
                13561,
                13575
            ],
            [
                13575,
                13627
            ],
            [
                13671,
                13689
            ],
            [
                13691,
                13705
            ],
            [
                13705,
                13745
            ],
            [
                13777,
                13779
            ],
            [
                13779,
                13813
            ],
            [
                13857,
                13865
            ],
            [
                13869,
                13898
            ],
            [
                13898,
                13929
            ],
            [
                13940,
                13941
            ],
            [
                13931,
                13940
            ],
            [
                13957,
                13960
            ],
            [
                13960,
                13968
            ],
            [
                13985,
                14007
            ],
            [
                14033,
                14120
            ],
            [
                14179,
                14182
            ],
            [
                14183,
                14187
            ],
            [
                14130,
                14146
            ],
            [
                14188,
                14192
            ],
            [
                14219,
                14297
            ],
            [
                14312,
                14362
            ],
            [
                14362,
                14393
            ],
            [
                14393,
                14403
            ],
            [
                14412,
                14496
            ],
            [
                14575,
                14577
            ],
            [
                14577,
                14645
            ],
            [
                14680,
                14705
            ],
            [
                14705,
                14724
            ],
            [
                14724,
                14754
            ],
            [
                14755,
                14760
            ],
            [
                15030,
                15046
            ],
            [
                14989,
                14991
            ],
            [
                15079,
                15122
            ],
            [
                15123,
                15127
            ],
            [
                15135,
                15137
            ],
            [
                15137,
                15163
            ],
            [
                15163,
                15193
            ],
            [
                15206,
                15220
            ],
            [
                15220,
                15269
            ],
            [
                15269,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15364,
                15438
            ],
            [
                15479,
                15481
            ],
            [
                15481,
                15514
            ],
            [
                15519,
                15548
            ],
            [
                15578,
                15586
            ],
            [
                15601,
                15604
            ],
            [
                15587,
                15593
            ],
            [
                15605,
                15628
            ],
            [
                15628,
                15631
            ],
            [
                15642,
                15684
            ],
            [
                15800,
                15804
            ],
            [
                15814,
                15817
            ],
            [
                15836,
                15837
            ],
            [
                15805,
                15813
            ],
            [
                15850,
                15855
            ],
            [
                15818,
                15825
            ],
            [
                15857,
                15881
            ],
            [
                15881,
                15913
            ],
            [
                15913,
                15944
            ],
            [
                16041,
                16083
            ],
            [
                16083,
                16176
            ],
            [
                16176,
                16183
            ],
            [
                16324,
                16359
            ],
            [
                16232,
                16245
            ],
            [
                16321,
                16322
            ],
            [
                16360,
                16445
            ],
            [
                16445,
                16488
            ],
            [
                16488,
                16553
            ],
            [
                16644,
                16646
            ],
            [
                17163,
                17209
            ],
            [
                17251,
                17268
            ],
            [
                17268,
                17412
            ],
            [
                17417,
                17425
            ],
            [
                17447,
                17449
            ],
            [
                17426,
                17435
            ],
            [
                17453,
                17458
            ],
            [
                17459,
                17486
            ],
            [
                17486,
                17554
            ],
            [
                17554,
                17587
            ]
        ],
        "row_chars": [
            [
                0,
                66
            ],
            [
                66,
                87
            ],
            [
                87,
                373
            ],
            [
                373,
                771
            ],
            [
                771,
                1211
            ],
            [
                1211,
                1304
            ],
            [
                1304,
                2218
            ],
            [
                2218,
                2344
            ],
            [
                2344,
                2379
            ],
            [
                2379,
                2530
            ],
            [
                2530,
                2839
            ],
            [
                2839,
                2908
            ],
            [
                2908,
                3020
            ],
            [
                3020,
                3254
            ],
            [
                3254,
                3348
            ],
            [
                3348,
                3406
            ],
            [
                3406,
                3462
            ],
            [
                3462,
                3515
            ],
            [
                3515,
                5039
            ],
            [
                5039,
                5395
            ],
            [
                5395,
                5553
            ],
            [
                5553,
                5789
            ],
            [
                5789,
                5990
            ],
            [
                5990,
                6219
            ],
            [
                6219,
                6869
            ],
            [
                6869,
                7268
            ],
            [
                7268,
                8090
            ],
            [
                8090,
                8387
            ],
            [
                8387,
                9135
            ],
            [
                9135,
                9578
            ],
            [
                9578,
                9748
            ],
            [
                9748,
                10114
            ],
            [
                10114,
                10520
            ],
            [
                10520,
                10692
            ],
            [
                10692,
                10924
            ],
            [
                10924,
                11070
            ],
            [
                11070,
                11399
            ],
            [
                11399,
                11441
            ],
            [
                11441,
                11505
            ],
            [
                11505,
                11521
            ],
            [
                11521,
                11545
            ],
            [
                11545,
                11594
            ],
            [
                11594,
                11645
            ],
            [
                11645,
                11660
            ],
            [
                11660,
                11694
            ],
            [
                11694,
                11906
            ],
            [
                11906,
                12094
            ],
            [
                12094,
                12143
            ],
            [
                12143,
                12180
            ],
            [
                12180,
                12226
            ],
            [
                12226,
                12267
            ],
            [
                12267,
                12310
            ],
            [
                12310,
                12337
            ],
            [
                12337,
                12373
            ],
            [
                12373,
                12461
            ],
            [
                12461,
                12510
            ],
            [
                12510,
                12594
            ],
            [
                12594,
                12693
            ],
            [
                12693,
                12760
            ],
            [
                12760,
                12789
            ],
            [
                12789,
                12868
            ],
            [
                12868,
                12963
            ],
            [
                12963,
                13021
            ],
            [
                13021,
                13379
            ],
            [
                13379,
                13491
            ],
            [
                13491,
                13534
            ],
            [
                13534,
                13575
            ],
            [
                13575,
                13639
            ],
            [
                13639,
                13671
            ],
            [
                13671,
                13705
            ],
            [
                13705,
                13779
            ],
            [
                13779,
                13898
            ],
            [
                13898,
                13960
            ],
            [
                13960,
                14120
            ],
            [
                14120,
                14362
            ],
            [
                14362,
                14393
            ],
            [
                14393,
                14577
            ],
            [
                14577,
                14705
            ],
            [
                14705,
                14724
            ],
            [
                14724,
                15079
            ],
            [
                15079,
                15137
            ],
            [
                15137,
                15163
            ],
            [
                15163,
                15220
            ],
            [
                15220,
                15269
            ],
            [
                15269,
                15332
            ],
            [
                15332,
                15364
            ],
            [
                15364,
                15481
            ],
            [
                15481,
                15628
            ],
            [
                15628,
                15684
            ],
            [
                15684,
                15769
            ],
            [
                15769,
                15800
            ],
            [
                15800,
                15857
            ],
            [
                15857,
                15881
            ],
            [
                15881,
                15913
            ],
            [
                15913,
                16083
            ],
            [
                16083,
                16176
            ],
            [
                16176,
                16183
            ],
            [
                16183,
                16360
            ],
            [
                16360,
                16445
            ],
            [
                16445,
                16488
            ],
            [
                16488,
                16646
            ],
            [
                16646,
                16716
            ],
            [
                16716,
                16792
            ],
            [
                16792,
                16847
            ],
            [
                16847,
                17045
            ],
            [
                17045,
                17106
            ],
            [
                17106,
                17162
            ],
            [
                17162,
                17210
            ],
            [
                17210,
                17251
            ],
            [
                17251,
                17268
            ],
            [
                17268,
                17486
            ],
            [
                17486,
                17554
            ],
            [
                17554,
                17587
            ]
        ]
    },
    "abridged": {
        "text": "Gwendolen, we have seen, passed her time abroad in the new excitement of gambling, and in imagining herself an empress of luck, having brought from her late experience an impression that in this confused world nothing mattered but to enjoy oneself. We have seen, too, that Grapnell & Co, being also bent on amusing themselves, no matter how, had brought about a painful change in her family circumstances; whence she had returned home - carrying with her a necklace which she had pawned and someone else had redeemed.\nWhile she was going back to England, Grandcourt was coming to find her at Leubronn; coming so entirely without hurry that he was induced to linger at Baden-Baden. Grandcourt's passions were of the intermittent, flickering kind, never flaming out strongly. But a great deal of life goes on without strong passion, and a man may be obstinate at the same low rate, and even show sudden impulses which have an air of daemonic strength because they seem inexplicable.\nGrandcourt had not been altogether displeased by Gwendolen's running away. The act had some piquancy for him. He liked to think that it was due to resentment of his cool and careless behaviour in Cardell Chase. To have brought her so near a tender admission, and then to have walked away, was enough to provoke a girl of spirit; and to be worth his mastering it was proper that she should have some spirit. Doubtless she meant him to follow her, and it was what he meant too.\nBut for a whole week he took no measures toward starting, and did not even inquire where Miss Harleth was gone. Mr. Lush felt a triumph mingled with distrust; for Grandcourt said no word to him about her, and looked as neutral as an alligator; there was no telling what might turn up in the slowly-churning chances of his mind.\nThe guests at Diplow were curious. How was it that nothing more was heard of Miss Harleth? Was it credible that she had refused Mr. Grandcourt? Lady Flora Hollis, a lively middle-aged woman, learnt that Miss Harleth was gone to Leubronn with some old friends, and mentioned this to Mr. Grandcourt. The next day Grandcourt ordered Lush to break up the party at Diplow by the end of another week, as he meant to go yachting to the Baltic or somewhere.\nLush needed no clearer announcement that Grandcourt was going to Leubronn; but he might go in the manner of a creeping billiard-ball, and stick on the way. Mr. Lush intended to make himself indispensable in order to go too, and he succeeded; Gwendolen's repulsion for him being a fact that merely amused his patron, and made him none the less willing to have Lush always at hand.\nThis was how it happened that Grandcourt arrived at the Czarina Hotel on the fifth day after Gwendolen had left Leubronn, and found there his uncle, Sir Hugo Mallinger, with his family, including Deronda. The meeting was not necessarily a pleasure to either. Sir Hugo was an easy-tempered, tolerant man, but Grandcourt was not a nephew after his own heart; and as the presumptive heir to the Mallinger estates he was the embodiment of Sir Hugo's chief grievance - the lack of a son. For Diplow would not go to his wife and daughters after his death.\nThis grievance had naturally grown as the years advanced, and Lady Mallinger, after having had three daughters in quick succession, was now over forty. Sir Hugo, almost twenty years older, had begun to despair of a son. Therefore Grandcourt's presence was unwelcome; but Sir Hugo wanted the relation between them to be kept as friendly as possible. He had a plan to secure Diplow as a future residence for Lady Mallinger and her daughters, and keep this bit of the family inheritance for his own offspring. He hoped that Grandcourt might consent to take a good sum of money in exchange for his interest in Diplow and its land; and this aim made him careful to avoid any quarrel with Grandcourt. They did not hate each other more than was compatible with perfect politeness.\nGrandcourt, on his side, thought his uncle a superfluous bore. But Lush had made him aware of the baronet's plans concerning Diplow, and he was gratified to have the possibility of the money in his mind: even if he did not choose to accept it, his sense of power would be flattered by his being able to refuse.\nThis was one reason why he had asked for a year's tenancy of Diplow, which had rather annoyed Sir Hugo, because the excellent hunting might make Grandcourt decide not to part with it. Also, Lush had hinted to Sir Hugo that Grandcourt would woo and win Miss Arrowpoint, which would free him from the need for ready money. So the baronet felt much curiosity to know how things had been going on at Diplow, was bent on being civil to his nephew, and looked forward to some private chat with Lush.\nBetween Deronda and Grandcourt there was a peculiar relation, due to circumstances which have yet to be made known. But no one showed any sign of annoyance on the first meeting. The quartet of gentlemen sauntered through the rooms, Sir Hugo saying-\n\"Did you play much at Baden, Grandcourt?\"\n\"No; I looked on and betted a little.\"\n\"Had you luck?\"\n\"What did I win, Lush?\"\n\"You brought away about two hundred,\" said Lush.\n\"You are not here for the play, then?\" said Sir Hugo.\n\"No; I don't care about play now. It's a confounded strain,\" said Grandcourt, whose diamond ring and demeanour were being a good deal stared at by foreigners interested in a new milord.\n\"I agree with you, my dear fellow,\" said Sir Hugo; \"I never cared for play. It knits the brain up into meshes. I never stay here more than ten minutes. But where's your gambling beauty, Deronda? Have you seen her lately?\"\n\"She's gone,\" said Deronda, curtly.\n\"An uncommonly fine girl, a perfect Diana,\" said Sir Hugo, turning to Grandcourt again. \"I saw her winning, as coolly as if she had foreseen it. Deronda happened to see her losing like wildfire, and she bore it with immense pluck. I suppose she was cleaned out, or was wise enough to stop in time. How do you know she's gone?\"\n\"Oh, by the Visitor-list,\" said Deronda, with a shrug. \"Vandernoodt told me her name was Harleth, and she was with the Baron and Baroness von Langen.\"\nLush had already looked at the list, and learnt that Gwendolen had gone, but he had no intention of telling Grandcourt before he asked; and he had not asked.\nBut now Grandcourt had heard what was rather piquant. After a moment's pause he said to Deronda-\n\"Do you know the Langens?\"\n\"I have talked with them a little since Miss Harleth left.\"\n\"Where is she gone - do you know?\"\n\"She is gone home,\" said Deronda, coldly. But then, from a fresh impulse, he added, \"It is possible you know her. Her home is not far from Diplow, at Offendene.\"\nDeronda, looking straight at Grandcourt, might have been a subject for those old painters who liked contrasts of temperament. His richly-tinted face had a calm intensity that was rather startling, and often made him seem to have spoken, so that servants asked him automatically, \"What did you say, sir?\" when he had been quite silent. Grandcourt felt an irritation, which he did not show except by a slight movement of the eyelids. But he answered, with his usual drawl, \"Yes, I know her,\" and paused to look at the gambling.\n\"What of her, eh?\" asked Sir Hugo of Lush, as the other three men moved out of the salon.\n\"He has been on the brink of marrying her,\" said Lush. \"But I hope it's off now. She's a niece of the clergyman at Pennicote. Her mother is a widow with a brood of daughters. This girl will have nothing, and is as dangerous as gunpowder. It would be a foolish marriage. But she has taken a freak against him, for she ran off here without notice. The fact is, he's here after her; although he was in no great hurry, and they are not likely to get together again. But he has lost his chance with the heiress.\"\nWhen Lush and Grandcourt had departed, Sir Hugo began to Deronda-\n\"Rather a pretty story. That girl has something in her. She must be worth running after, whether the marriage comes off or not.\"\n\"I should hope a marriage like that would not come off,\" said Deronda, in a tone of disgust.\n\"What! are you inclined to run after her?\" said Sir Hugo.\n\"On the contrary,\" said Deronda, \"I should rather be inclined to run away from her.\"\n\"Why, you would easily cut out Grandcourt. A girl with her spirit would think you the finer match of the two. You won't run after the pretty gambler, then?\"\n\"Decidedly not.\"\nThis answer was perfectly truthful; nevertheless it had passed through Deronda's mind that under other circumstances he should have given way to his interest in this girl, and have tried to know more of her. But his history had given him a stronger bias in another direction. He felt himself in no sense free.",
        "paragraph_chars": [
            [
                0,
                518
            ],
            [
                518,
                981
            ],
            [
                981,
                1457
            ],
            [
                1457,
                1785
            ],
            [
                1785,
                2235
            ],
            [
                2235,
                2615
            ],
            [
                2615,
                3165
            ],
            [
                3165,
                3939
            ],
            [
                3939,
                4250
            ],
            [
                4250,
                4744
            ],
            [
                4744,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5074
            ],
            [
                5074,
                5090
            ],
            [
                5090,
                5114
            ],
            [
                5114,
                5163
            ],
            [
                5163,
                5217
            ],
            [
                5217,
                5403
            ],
            [
                5403,
                5625
            ],
            [
                5625,
                5661
            ],
            [
                5661,
                5988
            ],
            [
                5988,
                6139
            ],
            [
                6139,
                6297
            ],
            [
                6297,
                6394
            ],
            [
                6394,
                6421
            ],
            [
                6421,
                6481
            ],
            [
                6481,
                6516
            ],
            [
                6516,
                6678
            ],
            [
                6678,
                7204
            ],
            [
                7204,
                7294
            ],
            [
                7294,
                7802
            ],
            [
                7802,
                7868
            ],
            [
                7868,
                7997
            ],
            [
                7997,
                8090
            ],
            [
                8090,
                8148
            ],
            [
                8148,
                8233
            ],
            [
                8233,
                8390
            ],
            [
                8390,
                8407
            ],
            [
                8407,
                8716
            ]
        ],
        "segment_chars": [
            [
                0,
                249
            ],
            [
                249,
                518
            ],
            [
                518,
                681
            ],
            [
                681,
                774
            ],
            [
                774,
                981
            ],
            [
                981,
                1056
            ],
            [
                1056,
                1091
            ],
            [
                1091,
                1192
            ],
            [
                1192,
                1388
            ],
            [
                1388,
                1457
            ],
            [
                1457,
                1569
            ],
            [
                1569,
                1785
            ],
            [
                1785,
                1820
            ],
            [
                1820,
                1876
            ],
            [
                1876,
                1929
            ],
            [
                1929,
                2083
            ],
            [
                2083,
                2235
            ],
            [
                2235,
                2391
            ],
            [
                2391,
                2615
            ],
            [
                2615,
                2820
            ],
            [
                2820,
                2874
            ],
            [
                2874,
                3098
            ],
            [
                3098,
                3165
            ],
            [
                3165,
                3317
            ],
            [
                3317,
                3385
            ],
            [
                3385,
                3514
            ],
            [
                3514,
                3672
            ],
            [
                3672,
                3860
            ],
            [
                3860,
                3939
            ],
            [
                3939,
                4002
            ],
            [
                4002,
                4250
            ],
            [
                4250,
                4434
            ],
            [
                4434,
                4571
            ],
            [
                4571,
                4744
            ],
            [
                4744,
                4860
            ],
            [
                4860,
                4922
            ],
            [
                4922,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5074
            ],
            [
                5074,
                5090
            ],
            [
                5090,
                5114
            ],
            [
                5114,
                5163
            ],
            [
                5163,
                5202
            ],
            [
                5202,
                5217
            ],
            [
                5217,
                5251
            ],
            [
                5251,
                5403
            ],
            [
                5403,
                5479
            ],
            [
                5479,
                5514
            ],
            [
                5514,
                5555
            ],
            [
                5555,
                5598
            ],
            [
                5598,
                5625
            ],
            [
                5625,
                5661
            ],
            [
                5661,
                5749
            ],
            [
                5749,
                5806
            ],
            [
                5806,
                5892
            ],
            [
                5892,
                5959
            ],
            [
                5959,
                5988
            ],
            [
                5988,
                6043
            ],
            [
                6043,
                6139
            ],
            [
                6139,
                6297
            ],
            [
                6297,
                6351
            ],
            [
                6351,
                6394
            ],
            [
                6394,
                6421
            ],
            [
                6421,
                6481
            ],
            [
                6481,
                6516
            ],
            [
                6516,
                6558
            ],
            [
                6558,
                6630
            ],
            [
                6630,
                6678
            ],
            [
                6678,
                6804
            ],
            [
                6804,
                6982
            ],
            [
                6982,
                7013
            ],
            [
                7013,
                7110
            ],
            [
                7110,
                7204
            ],
            [
                7204,
                7223
            ],
            [
                7223,
                7294
            ],
            [
                7294,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7420
            ],
            [
                7420,
                7469
            ],
            [
                7469,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7640
            ],
            [
                7640,
                7756
            ],
            [
                7756,
                7802
            ],
            [
                7802,
                7868
            ],
            [
                7868,
                7892
            ],
            [
                7892,
                7924
            ],
            [
                7924,
                7997
            ],
            [
                7997,
                8090
            ],
            [
                8090,
                8097
            ],
            [
                8097,
                8133
            ],
            [
                8133,
                8148
            ],
            [
                8148,
                8233
            ],
            [
                8233,
                8276
            ],
            [
                8276,
                8343
            ],
            [
                8343,
                8390
            ],
            [
                8390,
                8407
            ],
            [
                8407,
                8615
            ],
            [
                8615,
                8683
            ],
            [
                8683,
                8716
            ]
        ],
        "overlap_chars": [
            [
                0,
                167
            ],
            [
                171,
                209
            ],
            [
                210,
                217
            ],
            [
                247,
                249
            ],
            [
                249,
                272
            ],
            [
                273,
                286
            ],
            [
                286,
                287
            ],
            [
                288,
                434
            ],
            [
                446,
                454
            ],
            [
                455,
                490
            ],
            [
                499,
                518
            ],
            [
                518,
                588
            ],
            [
                589,
                600
            ],
            [
                600,
                608
            ],
            [
                609,
                654
            ],
            [
                655,
                679
            ],
            [
                679,
                681
            ],
            [
                681,
                744
            ],
            [
                746,
                774
            ],
            [
                774,
                829
            ],
            [
                829,
                830
            ],
            [
                831,
                844
            ],
            [
                845,
                857
            ],
            [
                858,
                883
            ],
            [
                884,
                920
            ],
            [
                924,
                979
            ],
            [
                979,
                981
            ],
            [
                981,
                1054
            ],
            [
                1054,
                1056
            ],
            [
                1056,
                1091
            ],
            [
                1091,
                1145
            ],
            [
                1146,
                1150
            ],
            [
                1155,
                1163
            ],
            [
                1174,
                1190
            ],
            [
                1190,
                1192
            ],
            [
                1192,
                1263
            ],
            [
                1264,
                1268
            ],
            [
                1268,
                1388
            ],
            [
                1388,
                1456
            ],
            [
                1457,
                1569
            ],
            [
                1569,
                1592
            ],
            [
                1593,
                1605
            ],
            [
                1606,
                1630
            ],
            [
                1631,
                1784
            ],
            [
                1785,
                1805
            ],
            [
                1818,
                1820
            ],
            [
                1820,
                1876
            ],
            [
                1876,
                1929
            ],
            [
                1929,
                1975
            ],
            [
                1983,
                2021
            ],
            [
                2022,
                2044
            ],
            [
                2045,
                2048
            ],
            [
                2059,
                2063
            ],
            [
                2064,
                2066
            ],
            [
                2067,
                2081
            ],
            [
                2081,
                2083
            ],
            [
                2083,
                2095
            ],
            [
                2096,
                2106
            ],
            [
                2107,
                2122
            ],
            [
                2129,
                2233
            ],
            [
                2233,
                2234
            ],
            [
                2235,
                2325
            ],
            [
                2329,
                2367
            ],
            [
                2369,
                2391
            ],
            [
                2393,
                2408
            ],
            [
                2409,
                2438
            ],
            [
                2451,
                2524
            ],
            [
                2532,
                2615
            ],
            [
                2615,
                2670
            ],
            [
                2671,
                2678
            ],
            [
                2685,
                2820
            ],
            [
                2820,
                2823
            ],
            [
                2836,
                2862
            ],
            [
                2863,
                2865
            ],
            [
                2866,
                2872
            ],
            [
                2872,
                2874
            ],
            [
                2874,
                2903
            ],
            [
                2903,
                2913
            ],
            [
                2914,
                2917
            ],
            [
                2917,
                2918
            ],
            [
                2919,
                2922
            ],
            [
                2923,
                2933
            ],
            [
                2934,
                2937
            ],
            [
                2942,
                2971
            ],
            [
                2972,
                2975
            ],
            [
                2976,
                3035
            ],
            [
                3036,
                3049
            ],
            [
                3058,
                3060
            ],
            [
                3061,
                3076
            ],
            [
                3077,
                3078
            ],
            [
                3079,
                3082
            ],
            [
                3088,
                3096
            ],
            [
                3096,
                3098
            ],
            [
                3098,
                3101
            ],
            [
                3102,
                3108
            ],
            [
                3122,
                3124
            ],
            [
                3125,
                3147
            ],
            [
                3148,
                3165
            ],
            [
                3165,
                3193
            ],
            [
                3200,
                3296
            ],
            [
                3297,
                3300
            ],
            [
                3301,
                3304
            ],
            [
                3305,
                3315
            ],
            [
                3315,
                3316
            ],
            [
                3317,
                3353
            ],
            [
                3354,
                3383
            ],
            [
                3395,
                3407
            ],
            [
                3408,
                3416
            ],
            [
                3417,
                3420
            ],
            [
                3421,
                3435
            ],
            [
                3436,
                3444
            ],
            [
                3452,
                3477
            ],
            [
                3478,
                3480
            ],
            [
                3481,
                3514
            ],
            [
                3517,
                3520
            ],
            [
                3521,
                3527
            ],
            [
                3528,
                3530
            ],
            [
                3531,
                3618
            ],
            [
                3619,
                3670
            ],
            [
                3670,
                3672
            ],
            [
                3672,
                3674
            ],
            [
                3681,
                3713
            ],
            [
                3719,
                3732
            ],
            [
                3733,
                3738
            ],
            [
                3751,
                3758
            ],
            [
                3759,
                3770
            ],
            [
                3771,
                3781
            ],
            [
                3786,
                3790
            ],
            [
                3790,
                3791
            ],
            [
                3792,
                3795
            ],
            [
                3796,
                3800
            ],
            [
                3805,
                3860
            ],
            [
                3873,
                3937
            ],
            [
                3937,
                3939
            ],
            [
                3939,
                3992
            ],
            [
                3996,
                4000
            ],
            [
                4000,
                4002
            ],
            [
                4002,
                4005
            ],
            [
                4006,
                4010
            ],
            [
                4011,
                4014
            ],
            [
                4015,
                4019
            ],
            [
                4024,
                4029
            ],
            [
                4030,
                4046
            ],
            [
                4053,
                4104
            ],
            [
                4117,
                4153
            ],
            [
                4158,
                4161
            ],
            [
                4162,
                4207
            ],
            [
                4211,
                4248
            ],
            [
                4248,
                4249
            ],
            [
                4259,
                4262
            ],
            [
                4277,
                4280
            ],
            [
                4287,
                4324
            ],
            [
                4325,
                4352
            ],
            [
                4352,
                4383
            ],
            [
                4384,
                4389
            ],
            [
                4395,
                4405
            ],
            [
                4406,
                4412
            ],
            [
                4413,
                4429
            ],
            [
                4430,
                4432
            ],
            [
                4432,
                4434
            ],
            [
                4434,
                4448
            ],
            [
                4456,
                4467
            ],
            [
                4468,
                4518
            ],
            [
                4536,
                4539
            ],
            [
                4545,
                4548
            ],
            [
                4558,
                4569
            ],
            [
                4569,
                4571
            ],
            [
                4574,
                4671
            ],
            [
                4672,
                4677
            ],
            [
                4678,
                4744
            ],
            [
                4744,
                4786
            ],
            [
                4787,
                4805
            ],
            [
                4813,
                4860
            ],
            [
                4860,
                4863
            ],
            [
                4864,
                4866
            ],
            [
                4878,
                4889
            ],
            [
                4900,
                4920
            ],
            [
                4922,
                4931
            ],
            [
                4934,
                4946
            ],
            [
                4947,
                4951
            ],
            [
                4957,
                4991
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5071
            ],
            [
                5071,
                5074
            ],
            [
                5074,
                5090
            ],
            [
                5090,
                5114
            ],
            [
                5114,
                5163
            ],
            [
                5163,
                5188
            ],
            [
                5189,
                5202
            ],
            [
                5202,
                5217
            ],
            [
                5217,
                5251
            ],
            [
                5251,
                5317
            ],
            [
                5328,
                5363
            ],
            [
                5364,
                5403
            ],
            [
                5403,
                5404
            ],
            [
                5404,
                5416
            ],
            [
                5417,
                5452
            ],
            [
                5452,
                5453
            ],
            [
                5454,
                5455
            ],
            [
                5455,
                5479
            ],
            [
                5479,
                5481
            ],
            [
                5482,
                5514
            ],
            [
                5514,
                5555
            ],
            [
                5555,
                5598
            ],
            [
                5598,
                5625
            ],
            [
                5625,
                5661
            ],
            [
                5661,
                5749
            ],
            [
                5750,
                5768
            ],
            [
                5769,
                5792
            ],
            [
                5802,
                5804
            ],
            [
                5804,
                5806
            ],
            [
                5806,
                5892
            ],
            [
                5892,
                5959
            ],
            [
                5959,
                5988
            ],
            [
                5988,
                6012
            ],
            [
                6015,
                6035
            ],
            [
                6036,
                6043
            ],
            [
                6043,
                6136
            ],
            [
                6144,
                6179
            ],
            [
                6187,
                6238
            ],
            [
                6247,
                6273
            ],
            [
                6273,
                6295
            ],
            [
                6295,
                6297
            ],
            [
                6297,
                6349
            ],
            [
                6349,
                6351
            ],
            [
                6351,
                6392
            ],
            [
                6394,
                6406
            ],
            [
                6407,
                6421
            ],
            [
                6421,
                6473
            ],
            [
                6481,
                6499
            ],
            [
                6502,
                6516
            ],
            [
                6516,
                6556
            ],
            [
                6556,
                6558
            ],
            [
                6558,
                6592
            ],
            [
                6593,
                6601
            ],
            [
                6601,
                6630
            ],
            [
                6630,
                6661
            ],
            [
                6661,
                6662
            ],
            [
                6666,
                6675
            ],
            [
                6675,
                6678
            ],
            [
                6678,
                6686
            ],
            [
                6695,
                6717
            ],
            [
                6717,
                6804
            ],
            [
                6804,
                6807
            ],
            [
                6822,
                6826
            ],
            [
                6831,
                6847
            ],
            [
                6848,
                6852
            ],
            [
                6853,
                6931
            ],
            [
                6932,
                6982
            ],
            [
                6982,
                7013
            ],
            [
                7013,
                7023
            ],
            [
                7024,
                7108
            ],
            [
                7108,
                7110
            ],
            [
                7110,
                7178
            ],
            [
                7179,
                7204
            ],
            [
                7204,
                7223
            ],
            [
                7223,
                7253
            ],
            [
                7260,
                7265
            ],
            [
                7270,
                7286
            ],
            [
                7292,
                7294
            ],
            [
                7294,
                7337
            ],
            [
                7343,
                7347
            ],
            [
                7347,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7405
            ],
            [
                7406,
                7420
            ],
            [
                7420,
                7469
            ],
            [
                7469,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7638
            ],
            [
                7638,
                7640
            ],
            [
                7640,
                7673
            ],
            [
                7683,
                7712
            ],
            [
                7713,
                7721
            ],
            [
                7722,
                7725
            ],
            [
                7726,
                7732
            ],
            [
                7733,
                7756
            ],
            [
                7756,
                7759
            ],
            [
                7760,
                7802
            ],
            [
                7802,
                7806
            ],
            [
                7812,
                7815
            ],
            [
                7839,
                7840
            ],
            [
                7841,
                7849
            ],
            [
                7850,
                7855
            ],
            [
                7859,
                7866
            ],
            [
                7868,
                7892
            ],
            [
                7892,
                7924
            ],
            [
                7924,
                7955
            ],
            [
                7955,
                7997
            ],
            [
                7997,
                8090
            ],
            [
                8090,
                8097
            ],
            [
                8097,
                8132
            ],
            [
                8133,
                8146
            ],
            [
                8146,
                8147
            ],
            [
                8148,
                8233
            ],
            [
                8233,
                8276
            ],
            [
                8276,
                8341
            ],
            [
                8341,
                8343
            ],
            [
                8343,
                8389
            ],
            [
                8390,
                8407
            ],
            [
                8407,
                8551
            ],
            [
                8556,
                8564
            ],
            [
                8565,
                8567
            ],
            [
                8568,
                8577
            ],
            [
                8577,
                8582
            ],
            [
                8588,
                8615
            ],
            [
                8615,
                8683
            ],
            [
                8683,
                8716
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                249
            ],
            [
                249,
                518
            ],
            [
                518,
                681
            ],
            [
                681,
                774
            ],
            [
                774,
                981
            ],
            [
                981,
                1056
            ],
            [
                1056,
                1091
            ],
            [
                1091,
                1192
            ],
            [
                1192,
                1388
            ],
            [
                1388,
                1457
            ],
            [
                1457,
                1569
            ],
            [
                1569,
                1785
            ],
            [
                1785,
                1785
            ],
            [
                1785,
                1820
            ],
            [
                1820,
                1876
            ],
            [
                1876,
                1929
            ],
            [
                1929,
                2083
            ],
            [
                2083,
                2235
            ],
            [
                2235,
                2391
            ],
            [
                2391,
                2615
            ],
            [
                2615,
                2820
            ],
            [
                2820,
                2874
            ],
            [
                2874,
                3098
            ],
            [
                3098,
                3165
            ],
            [
                3165,
                3514
            ],
            [
                3514,
                3672
            ],
            [
                3672,
                3860
            ],
            [
                3860,
                3939
            ],
            [
                3939,
                4002
            ],
            [
                4002,
                4250
            ],
            [
                4250,
                4434
            ],
            [
                4434,
                4571
            ],
            [
                4571,
                4744
            ],
            [
                4744,
                4860
            ],
            [
                4860,
                4993
            ],
            [
                4993,
                5035
            ],
            [
                5035,
                5074
            ],
            [
                5074,
                5090
            ],
            [
                5090,
                5114
            ],
            [
                5114,
                5163
            ],
            [
                5163,
                5202
            ],
            [
                5202,
                5217
            ],
            [
                5217,
                5251
            ],
            [
                5251,
                5403
            ],
            [
                5403,
                5479
            ],
            [
                5479,
                5514
            ],
            [
                5514,
                5514
            ],
            [
                5514,
                5514
            ],
            [
                5514,
                5555
            ],
            [
                5555,
                5598
            ],
            [
                5598,
                5625
            ],
            [
                5625,
                5661
            ],
            [
                5661,
                5749
            ],
            [
                5749,
                5749
            ],
            [
                5749,
                5806
            ],
            [
                5806,
                5892
            ],
            [
                5892,
                5959
            ],
            [
                5959,
                5988
            ],
            [
                5988,
                6043
            ],
            [
                6043,
                6139
            ],
            [
                6139,
                6139
            ],
            [
                6139,
                6297
            ],
            [
                6297,
                6351
            ],
            [
                6351,
                6394
            ],
            [
                6394,
                6421
            ],
            [
                6421,
                6481
            ],
            [
                6481,
                6481
            ],
            [
                6481,
                6516
            ],
            [
                6516,
                6558
            ],
            [
                6558,
                6630
            ],
            [
                6630,
                6678
            ],
            [
                6678,
                6804
            ],
            [
                6804,
                6982
            ],
            [
                6982,
                7013
            ],
            [
                7013,
                7110
            ],
            [
                7110,
                7204
            ],
            [
                7204,
                7223
            ],
            [
                7223,
                7294
            ],
            [
                7294,
                7349
            ],
            [
                7349,
                7375
            ],
            [
                7375,
                7420
            ],
            [
                7420,
                7469
            ],
            [
                7469,
                7532
            ],
            [
                7532,
                7564
            ],
            [
                7564,
                7640
            ],
            [
                7640,
                7756
            ],
            [
                7756,
                7802
            ],
            [
                7802,
                7802
            ],
            [
                7802,
                7802
            ],
            [
                7802,
                7868
            ],
            [
                7868,
                7892
            ],
            [
                7892,
                7924
            ],
            [
                7924,
                7997
            ],
            [
                7997,
                8090
            ],
            [
                8090,
                8097
            ],
            [
                8097,
                8148
            ],
            [
                8148,
                8233
            ],
            [
                8233,
                8276
            ],
            [
                8276,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8390
            ],
            [
                8390,
                8390
            ],
            [
                8390,
                8407
            ],
            [
                8407,
                8615
            ],
            [
                8615,
                8683
            ],
            [
                8683,
                8716
            ]
        ]
    }
}