{
    "original": {
        "text": "\"This is truth the poet sings, That a sorrow's crown of sorrow is remembering happier things.\" --TENNYSON: _Locksley Hall_.\nOn a fine evening near the end of July, Deronda was rowing himself on the Thames. It was already a year or more since he had come back to England, with the understanding that his education was finished, and that he was somehow to take his place in English society; but though, in deference to Sir Hugo's wish, and to fence off idleness, he had begun to read law, this apparent decision had been without other result than to deepen the roots of indecision. His old love of boating had revived with the more force now that he was in town with the Mallingers, because he could nowhere else get the same still seclusion which the river gave him. He had a boat of his own at Putney, and whenever Sir Hugo did not want him, it was his chief holiday to row till past sunset and come in again with the stars. Not that he was in a sentimental stage; but he was in another sort of contemplative mood perhaps more common in the young men of our day--that of questioning whether it were worth while to take part in the battle of the world: I mean, of course, the young men in whom the unproductive labor of questioning is sustained by three or five per cent, on capital which somebody else has battled for. It puzzled Sir Hugo that one who made a splendid contrast with all that was sickly and puling should be hampered with ideas which, since they left an accomplished Whig like himself unobstructed, could be no better than spectral illusions; especially as Deronda set himself against authorship--a vocation which is understood to turn foolish thinking into funds.\nRowing in his dark-blue shirt and skull-cap, his curls closely clipped, his mouth beset with abundant soft waves of beard, he bore only disguised traces of the seraphic boy \"trailing clouds of glory.\" Still, even one who had never seen him since his boyhood might have looked at him with slow recognition, due perhaps to the peculiarity of the gaze which Gwendolen chose to call \"dreadful,\" though it had really a very mild sort of scrutiny. The voice, sometimes audible in subdued snatches of song, had turned out merely a high baritone; indeed, only to look at his lithe, powerful frame and the firm gravity of his face would have been enough for an experienced guess that he had no rare and ravishing tenor such as nature reluctantly makes at some sacrifice. Look at his hands: they are not small and dimpled, with tapering fingers that seem to have only a deprecating touch: they are long, flexible, firmly-grasping hands, such as Titian has painted in a picture where he wanted to show the combination of refinement with force. And there is something of a likeness, too, between the faces belonging to the hands--in both the uniform pale-brown skin, the perpendicular brow, the calmly penetrating eyes. Not seraphic any longer: thoroughly terrestrial and manly; but still of a kind to raise belief in a human dignity which can afford to recognize poor relations.\nSuch types meet us here and there among average conditions; in a workman, for example, whistling over a bit of measurement and lifting his eyes to answer our question about the road. And often the grand meanings of faces as well as of written words may lie chiefly in the impressions that happen just now to be of importance in relation to Deronda, rowing on the Thames in a very ordinary equipment for a young Englishman at leisure, and passing under Kew Bridge with no thought of an adventure in which his appearance was likely to play any part. In fact, he objected very strongly to the notion, which others had not allowed him to escape, that his appearance was of a kind to draw attention; and hints of this, intended to be complimentary, found an angry resonance in him, coming from mingled experiences, to which a clue has already been given. His own face in the glass had during many years associated for him with thoughts of some one whom he must be like--one about whose character and lot he continually wondered, and never dared to ask.\nIn the neighborhood of Kew Bridge, between six and seven o'clock, the river was no solitude. Several persons were sauntering on the towing-path, and here and there a boat was plying. Deronda had been rowing fast to get over this spot, when, becoming aware of a great barge advancing toward him, he guided his boat aside, and rested on his oar within a couple of yards of the river-brink. He was all the while unconsciously continuing the low-toned chant which had haunted his throat all the way up the river--the gondolier's song in the _Otello_, where Rossini has worthily set to music the immortal words of Dante,\n\"Nessun maggior dolore Che ricordarsi del tempo felice Nella miseria\":\n[Footnote: Dante's words are best rendered by our own poet in the lines at the head of the chapter.]\nand, as he rested on his oar, the pianissimo fall of the melodic wail \"nella miseria\" was distinctly audible on the brink of the water. Three or four persons had paused at various spots to watch the barge passing the bridge, and doubtless included in their notice the young gentleman in the boat; but probably it was only to one ear that the low vocal sounds came with more significance than if they had been an insect-murmur amidst the sum of current noises. Deronda, awaiting the barge, now turning his head to the river-side, and saw at a few yards' distant from him a figure which might have been an impersonation of the misery he was unconsciously giving voice to: a girl hardly more than eighteen, of low slim figure, with most delicate little face, her dark curls pushed behind her ears under a large black hat, a long woolen cloak over her shoulders. Her hands were hanging down clasped before her, and her eyes were fixed on the river with a look of immovable, statue-like despair. This strong arrest of his attention made him cease singing: apparently his voice had entered her inner world without her taking any note of whence it came, for when it suddenly ceased she changed her attitude slightly, and, looking round with a frightened glance, met Deronda's face. It was but a couple of moments, but that seemed a long while for two people to look straight at each other. Her look was something like that of a fawn or other gentle animal before it turns to run away: no blush, no special alarm, but only some timidity which yet could not hinder her from a long look before she turned. In fact, it seemed to Deronda that she was only half conscious of her surroundings: was she hungry, or was there some other cause of bewilderment? He felt an outleap of interest and compassion toward her; but the next instant she had turned and walked away to a neighboring bench under a tree. He had no right to linger and watch her: poorly-dressed, melancholy women are common sights; it was only the delicate beauty, picturesque lines and color of the image that was exceptional, and these conditions made it more markedly impossible that he should obtrude his interest upon her. He began to row away and was soon far up the river; but no other thoughts were busy enough quite to expel that pale image of unhappy girlhood. He fell again and again to speculating on the probable romance that lay behind that loneliness and look of desolation; then to smile at his own share in the prejudice that interesting faces must have interesting adventures; then to justify himself for feeling that sorrow was the more tragic when it befell delicate, childlike beauty.\n\"I should not have forgotten the look of misery if she had been ugly and vulgar,\" he said to himself. But there was no denying that the attractiveness of the image made it likelier to last. It was clear to him as an onyx cameo; the brown-black drapery, the white face with small, small features and dark, long-lashed eyes. His mind glanced over the girl-tragedies that are going on in the world, hidden, unheeded, as if they were but tragedies of the copse or hedgerow, where the helpless drag wounded wings forsakenly, and streak the shadowed moss with the red moment-hand of their own death. Deronda of late, in his solitary excursions, had been occupied chiefly with uncertainties about his own course; but those uncertainties, being much at their leisure, were wont to have such wide-sweeping connections with all life and history that the new image of helpless sorrow easily blent itself with what seemed to him the strong array of reasons why he should shrink from getting into that routine of the world which makes men apologize for all its wrong-doing, and take opinions as mere professional equipment--why he should not draw strongly at any thread in the hopelessly-entangled scheme of things.\nHe used his oars little, satisfied to go with the tide and be taken back by it. It was his habit to indulge himself in that solemn passivity which easily comes with the lengthening shadows and mellow light, when thinking and desiring melt together imperceptibly, and what in other hours may have seemed argument takes the quality of passionate vision. By the time he had come back again with the tide past Richmond Bridge the sun was near setting: and the approach of his favorite hour--with its deepening stillness and darkening masses of tree and building between the double glow of the sky and the river--disposed him to linger as if they had been an unfinished strain of music. He looked out for a perfectly solitary spot where he could lodge his boat against the bank, and, throwing himself on his back with his head propped on the cushions, could watch out the light of sunset and the opening of that bead-roll which some oriental poet describes as God's call to the little stars, who each answer, \"Here am I.\" He chose a spot in the bend of the river just opposite Kew Gardens, where he had a great breadth of water before him reflecting the glory of the sky, while he himself was in shadow. He lay with his hands behind his head, propped on a level with the boat's edge, so that he could see all round him, but could not be seen by any one at a few yards' distance; and for a long while he never turned his eyes from the view right in front of him. He was forgetting everything else in a half-speculative, half-involuntary identification of himself with the objects he was looking at, thinking how far it might be possible habitually to shift his centre till his own personality would be no less outside him than the landscape--when the sense of something moving on the bank opposite him where it was bordered by a line of willow bushes, made him turn his glance thitherward. In the first moment he had a darting presentiment about the moving figure; and now he could see the small face with the strange dying sunlight upon it. He feared to frighten her by a sudden movement, and watched her with motionless attention. She looked round, but seemed only to gather security from the apparent solitude, hid her hat among the willows, and immediately took off her woolen cloak. Presently she seated herself and deliberately dipped the cloak in the water, holding it there a little while, then taking it out with effort, rising from her seat as she did so. By this time Deronda felt sure that she meant to wrap the wet cloak round her as a drowning shroud; there was no longer time to hesitate about frightening her. He rose and seized his oar to ply across; happily her position lay a little below him. The poor thing, overcome with terror at this sign of discovery from the opposite bank, sank down on the brink again, holding her cloak half out of the water. She crouched and covered her face as if she kept a faint hope that she had not been seen, and that the boatman was accidentally coming toward her. But soon he was within brief space of her, steadying his boat against the bank, and speaking, but very gently,\n\"Don't be afraid. You are unhappy. Pray, trust me. Tell me what I can do to help you.\"\nShe raised her head and looked up at him. His face now was toward the light, and she knew it again. But she did not speak for a few moments which were a renewal of their former gaze at each other. At last she said in a low sweet voice, with an accent so distinct that it suggested foreignness and yet was not foreign, \"I saw you before,\" and then added dreamily, after a like pause, \"nella miseria.\"\nDeronda, not understanding the connection of her thoughts, supposed that her mind was weakened by distress and hunger.\n\"It was you, singing?\" she went on, hesitatingly--\"Nessun maggior dolore.\" The mere words themselves uttered in her sweet undertones seemed to give the melody to Deronda's ear.\n\"Ah, yes,\" he said, understanding now, \"I am often singing them. But I fear you will injure yourself staying here. Pray let me take you in my boat to some place of safety. And that wet cloak--let me take it.\"\nHe would not attempt to take it without her leave, dreading lest he should scare her. Even at his words, he fancied that she shrank and clutched the cloak more tenaciously. But her eyes were fixed on him with a question in them as she said, \"You look good. Perhaps it is God's command.\"\n\"Do trust me. Let me help you. I will die before I will let any harm come to you.\"\nShe rose from her sitting posture, first dragging the saturated cloak and then letting it fall on the ground--it was too heavy for her tired arms. Her little woman's figure as she laid her delicate chilled hands together one over the other against her waist, and went a step backward while she leaned her head forward as if not to lose sight of his face, was unspeakably touching.\n\"Great God!\" the words escaped Deronda in a tone so low and solemn that they seemed like a prayer become unconsciously vocal. The agitating impression this forsaken girl was making on him stirred a fibre that lay close to his deepest interest in the fates of women--\"perhaps my mother was like this one.\" The old thought had come now with a new impetus of mingled feeling, and urged that exclamation in which both East and West have for ages concentrated their awe in the presence of inexorable calamity.\nThe low-toned words seemed to have some reassurance in them for the hearer: she stepped forward close to the boat's side, and Deronda put out his hand, hoping now that she would let him help her in. She had already put her tiny hand into his which closed around it, when some new thought struck her, and drawing back she said,\n\"I have nowhere to go--nobody belonging to me in all this land.\"\n\"I will take you to a lady who has daughters,\" said Deronda, immediately. He felt a sort of relief in gathering that the wretched home and cruel friends he imagined her to be fleeing from were not in the near background. Still she hesitated, and said more timidly than ever,\n\"Do you belong to the theatre?\"\n\"No; I have nothing to do with the theatre,\" said Deronda, in a decided tone. Then beseechingly, \"I will put you in perfect safety at once; with a lady, a good woman; I am sure she will be kind. Let us lose no time: you will make yourself ill. Life may still become sweet to you. There are good people--there are good women who will take care of you.\"\nShe drew backward no more, but stepped in easily, as if she were used to such action, and sat down on the cushions.\n\"You had a covering for your head,\" said Deronda.\n\"My hat?\" (She lifted up her hands to her head.) \"It is quite hidden in the bush.\"\n\"I will find it,\" said Deronda, putting out his hand deprecatingly as she attempted to rise. \"The boat is fixed.\"\nHe jumped out, found the hat, and lifted up the saturated cloak, wringing it and throwing it into the bottom of the boat.\n\"We must carry the cloak away, to prevent any one who may have noticed you from thinking you have been drowned,\" he said, cheerfully, as he got in again and presented the old hat to her. \"I wish I had any other garment than my coat to offer you. But shall you mind throwing it over your shoulders while we are on the water? It is quite an ordinary thing to do, when people return late and are not enough provided with wraps.\" He held out the coat toward her with a smile, and there came a faint melancholy smile in answer, as she took it and put it on very cleverly.\n\"I have some biscuits--should you like them?\" said Deronda.\n\"No; I cannot eat. I had still some money left to buy bread.\"\nHe began to ply his oar without further remark, and they went along swiftly for many minutes without speaking. She did not look at him, but was watching the oar, leaning forward in an attitude of repose, as if she were beginning to feel the comfort of returning warmth and the prospect of life instead of death. The twilight was deepening; the red flush was all gone and the little stars were giving their answer one after another. The moon was rising, but was still entangled among the trees and buildings. The light was not such that he could distinctly discern the expression of her features or her glance, but they were distinctly before him nevertheless--features and a glance which seemed to have given a fuller meaning for him to the human face. Among his anxieties one was dominant: his first impression about her, that her mind might be disordered, had not been quite dissipated: the project of suicide was unmistakable, and given a deeper color to every other suspicious sign. He longed to begin a conversation, but abstained, wishing to encourage the confidence that might induce her to speak first. At last she did speak.\n\"I like to listen to the oar.\"\n\"So do I.\"\n\"If you had not come, I should have been dead now.\"\n\"I cannot bear you to speak of that. I hope you will never be sorry that I came.\"\n\"I cannot see how I shall be glad to live. The _maggior dolore_ and the _miseria_ have lasted longer than the _tempo felice_.\" She paused and then went on dreamily,--\"_Dolore--miseria_--I think those words are alive.\"\nDeronda was mute: to question her seemed an unwarrantable freedom; he shrank from appearing to claim the authority of a benefactor, or to treat her with the less reverence because she was in distress. She went on musingly,\n\"I thought it was not wicked. Death and life are one before the Eternal. I know our fathers slew their children and then slew themselves, to keep their souls pure. I meant it so. But now I am commanded to live. I cannot see how I shall live.\"\n\"You will find friends. I will find them for you.\"\nShe shook her head and said mournfully, \"Not my mother and brother. I cannot find them.\"\n\"You are English? You must be--speaking English so perfectly.\"\nShe did not answer immediately, but looked at Deronda again, straining to see him in the double light. Until now she had been watching the oar. It seemed as if she were half roused, and wondered which part of her impression was dreaming and which waking. Sorrowful isolation had benumbed her sense of reality, and the power of distinguishing outward and inward was continually slipping away from her. Her look was full of wondering timidity such as the forsaken one in the desert might have lifted to the angelic vision before she knew whether his message was in anger or in pity.\n\"You want to know if I am English?\" she said at last, while Deronda was reddening nervously under a gaze which he felt more fully than he saw.\n\"I want to know nothing except what you like to tell me,\" he said, still uneasy in the fear that her mind was wandering. \"Perhaps it is not good for you to talk.\"\n\"Yes, I will tell you. I am English-born. But I am a Jewess.\"\nDeronda was silent, inwardly wondering that he had not said this to himself before, though any one who had seen delicate-faced Spanish girls might simply have guessed her to be Spanish.\n\"Do you despise me for it?\" she said presently in low tones, which had a sadness that pierced like a cry from a small dumb creature in fear.\n\"Why should I?\" said Deronda. \"I am not so foolish.\"\n\"I know many Jews are bad.\"\n\"So are many Christians. But I should not think it fair for you to despise me because of that.\"\n\"My mother and brother were good. But I shall never find them. I am come a long way--from abroad. I ran away; but I cannot tell you--I cannot speak of it. I thought I might find my mother again--God would guide me. But then I despaired. This morning when the light came, I felt as if one word kept sounding within me--Never! never! But now--I begin--to think--\" her words were broken by rising sobs--\"I am commanded to live--perhaps we are going to her.\"\nWith an outburst of weeping she buried her head on her knees. He hoped that this passionate weeping might relieve her excitement. Meanwhile he was inwardly picturing in much embarrassment how he should present himself with her in Park Lane--the course which he had at first unreflectingly determined on. No one kinder and more gentle than Lady Mallinger; but it was hardly probable that she would be at home; and he had a shuddering sense of a lackey staring at this delicate, sorrowful image of womanhood--of glaring lights and fine staircases, and perhaps chilling suspicious manners from lady's maid and housekeeper, that might scare the mind already in a state of dangerous susceptibility. But to take her to any other shelter than a home already known to him was not to be contemplated: he was full of fears about the issue of the adventure which had brought on him a responsibility all the heavier for the strong and agitating impression this childlike creature had made on him. But another resource came to mind: he could venture to take her to Mrs. Meyrick's--to the small house at Chelsea--where he had been often enough since his return from abroad to feel sure that he could appeal there to generous hearts, which had a romantic readiness to believe in innocent need and to help it. Hans Meyrick was safe away in Italy, and Deronda felt the comfort of presenting himself with his charge at a house where he would be met by a motherly figure of quakerish neatness, and three girls who hardly knew of any evil closer to them than what lay in history-books, and dramas, and would at once associate a lovely Jewess with Rebecca in _Ivanhoe_, besides thinking that everything they did at Deronda's request would be done for their idol, Hans. The vision of the Chelsea home once raised, Deronda no longer hesitated.\nThe rumbling thither in the cab after the stillness of the water seemed long. Happily his charge had been quiet since her fit of weeping, and submitted like a tired child. When they were in the cab, she laid down her hat and tried to rest her head, but the jolting movement would not let it rest. Still she dozed, and her sweet head hung helpless, first on one side, then on the other.\n\"They are too good to have any fear about taking her in,\" thought Deronda. Her person, her voice, her exquisite utterance, were one strong appeal to belief and tenderness. Yet what had been the history which had brought her to this desolation? He was going on a strange errand--to ask shelter for this waif. Then there occurred to him the beautiful story Plutarch somewhere tells of the Delphic women: how when the Maenads, outworn with their torch-lit wanderings, lay down to sleep in the market-place, the matrons came and stood silently round them to keep guard over their slumbers; then, when they waked, ministered to them tenderly and saw them safely to their own borders. He could trust the women he was going to for having hearts as good.\nDeronda felt himself growing older this evening and entering on a new phase in finding a life to which his own had come--perhaps as a rescue; but how to make sure that snatching from death was rescue? The moment of finding a fellow-creature is often as full of mingled doubt and exultation as the moment of finding an idea.",
        "paragraph_chars": [
            [
                0,
                124
            ],
            [
                124,
                1680
            ],
            [
                1680,
                3048
            ],
            [
                3048,
                4096
            ],
            [
                4096,
                4712
            ],
            [
                4712,
                4783
            ],
            [
                4783,
                4884
            ],
            [
                4884,
                7541
            ],
            [
                7541,
                8744
            ],
            [
                8744,
                11867
            ],
            [
                11867,
                11954
            ],
            [
                11954,
                12354
            ],
            [
                12354,
                12473
            ],
            [
                12473,
                12650
            ],
            [
                12650,
                12859
            ],
            [
                12859,
                13146
            ],
            [
                13146,
                13229
            ],
            [
                13229,
                13610
            ],
            [
                13610,
                14115
            ],
            [
                14115,
                14442
            ],
            [
                14442,
                14507
            ],
            [
                14507,
                14782
            ],
            [
                14782,
                14814
            ],
            [
                14814,
                15166
            ],
            [
                15166,
                15282
            ],
            [
                15282,
                15332
            ],
            [
                15332,
                15415
            ],
            [
                15415,
                15529
            ],
            [
                15529,
                15651
            ],
            [
                15651,
                16218
            ],
            [
                16218,
                16278
            ],
            [
                16278,
                16340
            ],
            [
                16340,
                17474
            ],
            [
                17474,
                17505
            ],
            [
                17505,
                17516
            ],
            [
                17516,
                17568
            ],
            [
                17568,
                17650
            ],
            [
                17650,
                17868
            ],
            [
                17868,
                18091
            ],
            [
                18091,
                18334
            ],
            [
                18334,
                18385
            ],
            [
                18385,
                18474
            ],
            [
                18474,
                18537
            ],
            [
                18537,
                19118
            ],
            [
                19118,
                19261
            ],
            [
                19261,
                19424
            ],
            [
                19424,
                19486
            ],
            [
                19486,
                19672
            ],
            [
                19672,
                19813
            ],
            [
                19813,
                19866
            ],
            [
                19866,
                19894
            ],
            [
                19894,
                19990
            ],
            [
                19990,
                20445
            ],
            [
                20445,
                22266
            ],
            [
                22266,
                22652
            ],
            [
                22652,
                23399
            ],
            [
                23399,
                23722
            ]
        ],
        "segment_chars": [
            [
                0,
                95
            ],
            [
                95,
                124
            ],
            [
                124,
                206
            ],
            [
                206,
                580
            ],
            [
                580,
                766
            ],
            [
                766,
                925
            ],
            [
                925,
                1319
            ],
            [
                1319,
                1680
            ],
            [
                1680,
                1881
            ],
            [
                1881,
                2122
            ],
            [
                2122,
                2442
            ],
            [
                2442,
                2713
            ],
            [
                2713,
                2888
            ],
            [
                2888,
                3048
            ],
            [
                3048,
                3231
            ],
            [
                3231,
                3596
            ],
            [
                3596,
                3898
            ],
            [
                3898,
                4096
            ],
            [
                4096,
                4189
            ],
            [
                4189,
                4279
            ],
            [
                4279,
                4484
            ],
            [
                4484,
                4712
            ],
            [
                4712,
                4783
            ],
            [
                4783,
                4884
            ],
            [
                4884,
                5020
            ],
            [
                5020,
                5344
            ],
            [
                5344,
                5743
            ],
            [
                5743,
                5875
            ],
            [
                5875,
                6159
            ],
            [
                6159,
                6267
            ],
            [
                6267,
                6480
            ],
            [
                6480,
                6627
            ],
            [
                6627,
                6774
            ],
            [
                6774,
                7063
            ],
            [
                7063,
                7206
            ],
            [
                7206,
                7541
            ],
            [
                7541,
                7643
            ],
            [
                7643,
                7731
            ],
            [
                7731,
                7864
            ],
            [
                7864,
                8135
            ],
            [
                8135,
                8744
            ],
            [
                8744,
                8824
            ],
            [
                8824,
                9096
            ],
            [
                9096,
                9426
            ],
            [
                9426,
                9761
            ],
            [
                9761,
                9943
            ],
            [
                9943,
                10201
            ],
            [
                10201,
                10628
            ],
            [
                10628,
                10780
            ],
            [
                10780,
                10871
            ],
            [
                10871,
                11026
            ],
            [
                11026,
                11204
            ],
            [
                11204,
                11364
            ],
            [
                11364,
                11451
            ],
            [
                11451,
                11609
            ],
            [
                11609,
                11756
            ],
            [
                11756,
                11867
            ],
            [
                11867,
                11885
            ],
            [
                11885,
                11902
            ],
            [
                11902,
                11918
            ],
            [
                11918,
                11954
            ],
            [
                11954,
                11996
            ],
            [
                11996,
                12054
            ],
            [
                12054,
                12151
            ],
            [
                12151,
                12354
            ],
            [
                12354,
                12473
            ],
            [
                12473,
                12496
            ],
            [
                12496,
                12548
            ],
            [
                12548,
                12650
            ],
            [
                12650,
                12715
            ],
            [
                12715,
                12765
            ],
            [
                12765,
                12822
            ],
            [
                12822,
                12859
            ],
            [
                12859,
                12945
            ],
            [
                12945,
                13032
            ],
            [
                13032,
                13116
            ],
            [
                13116,
                13146
            ],
            [
                13146,
                13160
            ],
            [
                13160,
                13177
            ],
            [
                13177,
                13229
            ],
            [
                13229,
                13376
            ],
            [
                13376,
                13610
            ],
            [
                13610,
                13623
            ],
            [
                13623,
                13736
            ],
            [
                13736,
                13915
            ],
            [
                13915,
                14115
            ],
            [
                14115,
                14314
            ],
            [
                14314,
                14442
            ],
            [
                14442,
                14507
            ],
            [
                14507,
                14581
            ],
            [
                14581,
                14728
            ],
            [
                14728,
                14782
            ],
            [
                14782,
                14814
            ],
            [
                14814,
                14892
            ],
            [
                14892,
                15009
            ],
            [
                15009,
                15094
            ],
            [
                15094,
                15166
            ],
            [
                15166,
                15282
            ],
            [
                15282,
                15332
            ],
            [
                15332,
                15342
            ],
            [
                15342,
                15381
            ],
            [
                15381,
                15415
            ],
            [
                15415,
                15508
            ],
            [
                15508,
                15529
            ],
            [
                15529,
                15651
            ],
            [
                15651,
                15838
            ],
            [
                15838,
                15897
            ],
            [
                15897,
                15975
            ],
            [
                15975,
                16077
            ],
            [
                16077,
                16218
            ],
            [
                16218,
                16264
            ],
            [
                16264,
                16278
            ],
            [
                16278,
                16297
            ],
            [
                16297,
                16340
            ],
            [
                16340,
                16451
            ],
            [
                16451,
                16652
            ],
            [
                16652,
                16772
            ],
            [
                16772,
                16848
            ],
            [
                16848,
                17093
            ],
            [
                17093,
                17327
            ],
            [
                17327,
                17451
            ],
            [
                17451,
                17474
            ],
            [
                17474,
                17505
            ],
            [
                17505,
                17516
            ],
            [
                17516,
                17568
            ],
            [
                17568,
                17605
            ],
            [
                17605,
                17650
            ],
            [
                17650,
                17693
            ],
            [
                17693,
                17777
            ],
            [
                17777,
                17868
            ],
            [
                17868,
                18069
            ],
            [
                18069,
                18091
            ],
            [
                18091,
                18121
            ],
            [
                18121,
                18164
            ],
            [
                18164,
                18255
            ],
            [
                18255,
                18270
            ],
            [
                18270,
                18302
            ],
            [
                18302,
                18334
            ],
            [
                18334,
                18358
            ],
            [
                18358,
                18385
            ],
            [
                18385,
                18453
            ],
            [
                18453,
                18474
            ],
            [
                18474,
                18492
            ],
            [
                18492,
                18537
            ],
            [
                18537,
                18640
            ],
            [
                18640,
                18681
            ],
            [
                18681,
                18792
            ],
            [
                18792,
                18938
            ],
            [
                18938,
                19118
            ],
            [
                19118,
                19154
            ],
            [
                19154,
                19261
            ],
            [
                19261,
                19382
            ],
            [
                19382,
                19424
            ],
            [
                19424,
                19447
            ],
            [
                19447,
                19466
            ],
            [
                19466,
                19486
            ],
            [
                19486,
                19672
            ],
            [
                19672,
                19700
            ],
            [
                19700,
                19813
            ],
            [
                19813,
                19829
            ],
            [
                19829,
                19843
            ],
            [
                19843,
                19866
            ],
            [
                19866,
                19894
            ],
            [
                19894,
                19919
            ],
            [
                19919,
                19990
            ],
            [
                19990,
                20024
            ],
            [
                20024,
                20053
            ],
            [
                20053,
                20088
            ],
            [
                20088,
                20145
            ],
            [
                20145,
                20205
            ],
            [
                20205,
                20227
            ],
            [
                20227,
                20315
            ],
            [
                20315,
                20322
            ],
            [
                20322,
                20445
            ],
            [
                20445,
                20507
            ],
            [
                20507,
                20575
            ],
            [
                20575,
                20749
            ],
            [
                20749,
                21139
            ],
            [
                21139,
                21430
            ],
            [
                21430,
                21739
            ],
            [
                21739,
                22193
            ],
            [
                22193,
                22266
            ],
            [
                22266,
                22344
            ],
            [
                22344,
                22438
            ],
            [
                22438,
                22563
            ],
            [
                22563,
                22652
            ],
            [
                22652,
                22727
            ],
            [
                22727,
                22824
            ],
            [
                22824,
                22896
            ],
            [
                22896,
                22960
            ],
            [
                22960,
                23331
            ],
            [
                23331,
                23399
            ],
            [
                23399,
                23600
            ],
            [
                23600,
                23722
            ]
        ],
        "overlap_chars": [
            [
                124,
                182
            ],
            [
                191,
                206
            ],
            [
                206,
                212
            ],
            [
                221,
                227
            ],
            [
                236,
                342
            ],
            [
                351,
                388
            ],
            [
                461,
                486
            ],
            [
                393,
                399
            ],
            [
                401,
                459
            ],
            [
                578,
                580
            ],
            [
                580,
                615
            ],
            [
                766,
                779
            ],
            [
                791,
                805
            ],
            [
                842,
                902
            ],
            [
                909,
                924
            ],
            [
                1680,
                1751
            ],
            [
                1768,
                1772
            ],
            [
                1803,
                1805
            ],
            [
                1801,
                1802
            ],
            [
                1806,
                1815
            ],
            [
                1826,
                1852
            ],
            [
                1881,
                1948
            ],
            [
                1959,
                1962
            ],
            [
                1984,
                2000
            ],
            [
                2020,
                2044
            ],
            [
                2059,
                2122
            ],
            [
                2818,
                2833
            ],
            [
                2713,
                2716
            ],
            [
                2863,
                2886
            ],
            [
                2749,
                2750
            ],
            [
                2892,
                2900
            ],
            [
                2905,
                2912
            ],
            [
                2764,
                2767
            ],
            [
                2736,
                2738
            ],
            [
                2913,
                2985
            ],
            [
                2988,
                3001
            ],
            [
                3046,
                3048
            ],
            [
                3608,
                3644
            ],
            [
                3690,
                3709
            ],
            [
                3727,
                3741
            ],
            [
                3896,
                3898
            ],
            [
                3898,
                3923
            ],
            [
                3946,
                3956
            ],
            [
                3965,
                4011
            ],
            [
                4013,
                4022
            ],
            [
                4047,
                4096
            ],
            [
                4119,
                4189
            ],
            [
                4205,
                4279
            ],
            [
                4279,
                4307
            ],
            [
                4329,
                4354
            ],
            [
                4363,
                4368
            ],
            [
                4389,
                4420
            ],
            [
                4467,
                4477
            ],
            [
                4482,
                4484
            ],
            [
                4484,
                4490
            ],
            [
                4505,
                4555
            ],
            [
                4556,
                4559
            ],
            [
                4579,
                4603
            ],
            [
                4605,
                4628
            ],
            [
                4649,
                4656
            ],
            [
                4634,
                4640
            ],
            [
                4712,
                4734
            ],
            [
                4735,
                4766
            ],
            [
                4773,
                4780
            ],
            [
                4889,
                4917
            ],
            [
                4941,
                4948
            ],
            [
                4929,
                4940
            ],
            [
                4954,
                4999
            ],
            [
                5018,
                5020
            ],
            [
                5020,
                5052
            ],
            [
                5070,
                5108
            ],
            [
                5181,
                5229
            ],
            [
                5243,
                5252
            ],
            [
                5258,
                5270
            ],
            [
                5342,
                5344
            ],
            [
                5344,
                5351
            ],
            [
                5417,
                5420
            ],
            [
                5424,
                5435
            ],
            [
                5454,
                5515
            ],
            [
                5385,
                5388
            ],
            [
                5552,
                5590
            ],
            [
                5351,
                5352
            ],
            [
                5595,
                5612
            ],
            [
                5613,
                5709
            ],
            [
                5717,
                5743
            ],
            [
                5795,
                5874
            ],
            [
                5875,
                5934
            ],
            [
                6059,
                6083
            ],
            [
                6092,
                6159
            ],
            [
                6159,
                6267
            ],
            [
                6267,
                6294
            ],
            [
                6303,
                6309
            ],
            [
                6333,
                6374
            ],
            [
                6383,
                6412
            ],
            [
                6478,
                6480
            ],
            [
                6480,
                6488
            ],
            [
                6502,
                6509
            ],
            [
                6510,
                6609
            ],
            [
                6625,
                6627
            ],
            [
                6627,
                6713
            ],
            [
                6725,
                6741
            ],
            [
                6754,
                6774
            ],
            [
                6774,
                6898
            ],
            [
                6928,
                6961
            ],
            [
                7061,
                7062
            ],
            [
                7063,
                7118
            ],
            [
                7163,
                7206
            ],
            [
                7206,
                7208
            ],
            [
                7233,
                7251
            ],
            [
                7278,
                7284
            ],
            [
                7305,
                7329
            ],
            [
                7339,
                7345
            ],
            [
                7373,
                7428
            ],
            [
                7539,
                7541
            ],
            [
                7541,
                7588
            ],
            [
                7589,
                7625
            ],
            [
                7634,
                7643
            ],
            [
                7643,
                7731
            ],
            [
                7731,
                7737
            ],
            [
                7738,
                7819
            ],
            [
                7827,
                7864
            ],
            [
                7864,
                7953
            ],
            [
                8133,
                8134
            ],
            [
                8744,
                8824
            ],
            [
                8824,
                8949
            ],
            [
                9094,
                9096
            ],
            [
                9096,
                9215
            ],
            [
                9225,
                9229
            ],
            [
                9231,
                9288
            ],
            [
                9302,
                9350
            ],
            [
                9361,
                9374
            ],
            [
                9424,
                9426
            ],
            [
                9426,
                9435
            ],
            [
                9440,
                9445
            ],
            [
                9456,
                9516
            ],
            [
                9710,
                9712
            ],
            [
                9597,
                9602
            ],
            [
                9577,
                9580
            ],
            [
                9620,
                9626
            ],
            [
                9761,
                9771
            ],
            [
                9777,
                9943
            ],
            [
                9950,
                9981
            ],
            [
                10031,
                10083
            ],
            [
                10092,
                10116
            ],
            [
                10199,
                10201
            ],
            [
                10201,
                10229
            ],
            [
                10306,
                10309
            ],
            [
                10235,
                10237
            ],
            [
                10290,
                10292
            ],
            [
                10456,
                10459
            ],
            [
                10256,
                10257
            ],
            [
                10480,
                10521
            ],
            [
                10527,
                10535
            ],
            [
                10522,
                10526
            ],
            [
                10335,
                10336
            ],
            [
                10263,
                10265
            ],
            [
                10465,
                10468
            ],
            [
                10575,
                10598
            ],
            [
                10608,
                10614
            ],
            [
                10626,
                10627
            ],
            [
                10648,
                10747
            ],
            [
                10756,
                10780
            ],
            [
                10790,
                10827
            ],
            [
                10780,
                10782
            ],
            [
                10832,
                10843
            ],
            [
                10849,
                10855
            ],
            [
                10869,
                10871
            ],
            [
                10871,
                10888
            ],
            [
                10905,
                10932
            ],
            [
                10942,
                10986
            ],
            [
                10999,
                11011
            ],
            [
                11019,
                11026
            ],
            [
                11036,
                11119
            ],
            [
                11134,
                11167
            ],
            [
                11168,
                11188
            ],
            [
                11202,
                11204
            ],
            [
                11204,
                11363
            ],
            [
                11364,
                11375
            ],
            [
                11383,
                11390
            ],
            [
                11414,
                11417
            ],
            [
                11449,
                11451
            ],
            [
                11451,
                11513
            ],
            [
                11536,
                11547
            ],
            [
                11561,
                11567
            ],
            [
                11613,
                11617
            ],
            [
                11622,
                11625
            ],
            [
                11634,
                11697
            ],
            [
                11754,
                11756
            ],
            [
                11756,
                11771
            ],
            [
                11794,
                11848
            ],
            [
                11854,
                11865
            ],
            [
                11867,
                11885
            ],
            [
                11885,
                11902
            ],
            [
                11902,
                11918
            ],
            [
                11918,
                11954
            ],
            [
                11954,
                11984
            ],
            [
                11988,
                11996
            ],
            [
                12054,
                12093
            ],
            [
                12118,
                12151
            ],
            [
                12151,
                12204
            ],
            [
                12217,
                12221
            ],
            [
                12225,
                12316
            ],
            [
                12337,
                12351
            ],
            [
                12474,
                12493
            ],
            [
                12524,
                12548
            ],
            [
                12548,
                12562
            ],
            [
                12574,
                12650
            ],
            [
                12650,
                12651
            ],
            [
                12655,
                12669
            ],
            [
                12689,
                12691
            ],
            [
                12695,
                12700
            ],
            [
                12713,
                12715
            ],
            [
                12715,
                12765
            ],
            [
                12765,
                12776
            ],
            [
                12782,
                12822
            ],
            [
                12822,
                12840
            ],
            [
                12842,
                12859
            ],
            [
                12859,
                12871
            ],
            [
                12883,
                12908
            ],
            [
                12943,
                12945
            ],
            [
                12964,
                13013
            ],
            [
                13019,
                13032
            ],
            [
                13032,
                13062
            ],
            [
                13070,
                13078
            ],
            [
                13090,
                13116
            ],
            [
                13116,
                13146
            ],
            [
                13146,
                13160
            ],
            [
                13160,
                13177
            ],
            [
                13177,
                13229
            ],
            [
                13229,
                13337
            ],
            [
                13339,
                13376
            ],
            [
                13376,
                13487
            ],
            [
                13584,
                13610
            ],
            [
                13610,
                13623
            ],
            [
                13623,
                13648
            ],
            [
                13694,
                13698
            ],
            [
                13701,
                13707
            ],
            [
                13734,
                13736
            ],
            [
                13736,
                13805
            ],
            [
                13832,
                13874
            ],
            [
                13876,
                13912
            ],
            [
                14119,
                14144
            ],
            [
                14179,
                14202
            ],
            [
                14211,
                14248
            ],
            [
                14253,
                14273
            ],
            [
                14283,
                14314
            ],
            [
                14314,
                14356
            ],
            [
                14381,
                14440
            ],
            [
                14442,
                14463
            ],
            [
                14472,
                14507
            ],
            [
                14507,
                14566
            ],
            [
                14568,
                14581
            ],
            [
                14581,
                14703
            ],
            [
                14711,
                14715
            ],
            [
                14726,
                14728
            ],
            [
                14728,
                14770
            ],
            [
                14782,
                14814
            ],
            [
                14814,
                14871
            ],
            [
                14890,
                14892
            ],
            [
                14911,
                14918
            ],
            [
                14923,
                14926
            ],
            [
                14930,
                14944
            ],
            [
                14954,
                14958
            ],
            [
                14967,
                15009
            ],
            [
                15009,
                15094
            ],
            [
                15094,
                15115
            ],
            [
                15138,
                15166
            ],
            [
                15166,
                15169
            ],
            [
                15197,
                15207
            ],
            [
                15252,
                15282
            ],
            [
                15282,
                15292
            ],
            [
                15336,
                15339
            ],
            [
                15315,
                15331
            ],
            [
                15415,
                15430
            ],
            [
                15529,
                15651
            ],
            [
                15651,
                15692
            ],
            [
                15701,
                15748
            ],
            [
                15754,
                15803
            ],
            [
                15836,
                15838
            ],
            [
                15838,
                15897
            ],
            [
                15897,
                15975
            ],
            [
                15975,
                16043
            ],
            [
                16074,
                16077
            ],
            [
                16077,
                16097
            ],
            [
                16109,
                16180
            ],
            [
                16193,
                16202
            ],
            [
                16216,
                16218
            ],
            [
                16218,
                16239
            ],
            [
                16241,
                16264
            ],
            [
                16264,
                16278
            ],
            [
                16278,
                16297
            ],
            [
                16297,
                16340
            ],
            [
                16340,
                16451
            ],
            [
                16451,
                16454
            ],
            [
                16480,
                16651
            ],
            [
                16652,
                16697
            ],
            [
                16702,
                16772
            ],
            [
                16772,
                16848
            ],
            [
                16848,
                16903
            ],
            [
                16922,
                16934
            ],
            [
                16948,
                16998
            ],
            [
                17091,
                17093
            ],
            [
                17093,
                17151
            ],
            [
                17163,
                17268
            ],
            [
                17325,
                17327
            ],
            [
                17327,
                17365
            ],
            [
                17438,
                17451
            ],
            [
                17451,
                17474
            ],
            [
                17474,
                17505
            ],
            [
                17505,
                17516
            ],
            [
                17516,
                17568
            ],
            [
                17568,
                17605
            ],
            [
                17605,
                17650
            ],
            [
                17650,
                17693
            ],
            [
                17693,
                17696
            ],
            [
                17702,
                17712
            ],
            [
                17714,
                17721
            ],
            [
                17723,
                17730
            ],
            [
                17732,
                17759
            ],
            [
                17767,
                17773
            ],
            [
                17774,
                17776
            ],
            [
                17868,
                17962
            ],
            [
                18006,
                18020
            ],
            [
                18025,
                18029
            ],
            [
                18040,
                18069
            ],
            [
                18069,
                18089
            ],
            [
                18091,
                18121
            ],
            [
                18121,
                18164
            ],
            [
                18164,
                18255
            ],
            [
                18270,
                18302
            ],
            [
                18302,
                18334
            ],
            [
                18334,
                18358
            ],
            [
                18358,
                18385
            ],
            [
                18385,
                18453
            ],
            [
                18453,
                18474
            ],
            [
                18474,
                18492
            ],
            [
                18492,
                18495
            ],
            [
                18514,
                18521
            ],
            [
                18525,
                18537
            ],
            [
                18537,
                18597
            ],
            [
                18717,
                18718
            ],
            [
                18691,
                18705
            ],
            [
                18650,
                18653
            ],
            [
                18761,
                18773
            ],
            [
                18638,
                18639
            ],
            [
                19118,
                19154
            ],
            [
                19154,
                19170
            ],
            [
                19259,
                19261
            ],
            [
                19261,
                19382
            ],
            [
                19382,
                19424
            ],
            [
                19447,
                19466
            ],
            [
                19466,
                19486
            ],
            [
                19486,
                19505
            ],
            [
                19525,
                19532
            ],
            [
                19627,
                19632
            ],
            [
                19546,
                19550
            ],
            [
                19568,
                19569
            ],
            [
                19640,
                19672
            ],
            [
                19672,
                19700
            ],
            [
                19700,
                19725
            ],
            [
                19731,
                19732
            ],
            [
                19726,
                19731
            ],
            [
                19811,
                19813
            ],
            [
                19813,
                19826
            ],
            [
                19844,
                19866
            ],
            [
                19866,
                19894
            ],
            [
                19894,
                19919
            ],
            [
                19919,
                19990
            ],
            [
                19990,
                20024
            ],
            [
                20024,
                20053
            ],
            [
                20053,
                20073
            ],
            [
                20075,
                20088
            ],
            [
                20088,
                20112
            ],
            [
                20132,
                20145
            ],
            [
                20145,
                20183
            ],
            [
                20185,
                20205
            ],
            [
                20205,
                20227
            ],
            [
                20227,
                20239
            ],
            [
                20261,
                20306
            ],
            [
                20308,
                20315
            ],
            [
                20315,
                20322
            ],
            [
                20322,
                20329
            ],
            [
                20331,
                20338
            ],
            [
                20340,
                20348
            ],
            [
                20352,
                20388
            ],
            [
                20390,
                20413
            ],
            [
                20415,
                20445
            ],
            [
                20445,
                20507
            ],
            [
                20507,
                20562
            ],
            [
                20573,
                20575
            ],
            [
                20575,
                20684
            ],
            [
                20747,
                20749
            ],
            [
                20749,
                20803
            ],
            [
                20832,
                20835
            ],
            [
                21070,
                21075
            ],
            [
                20842,
                20931
            ],
            [
                20989,
                21011
            ],
            [
                21031,
                21063
            ],
            [
                21137,
                21138
            ],
            [
                21139,
                21235
            ],
            [
                21428,
                21430
            ],
            [
                21434,
                21473
            ],
            [
                21485,
                21511
            ],
            [
                21513,
                21542
            ],
            [
                21662,
                21663
            ],
            [
                21544,
                21552
            ],
            [
                21612,
                21637
            ],
            [
                21644,
                21662
            ],
            [
                21737,
                21739
            ],
            [
                21739,
                21963
            ],
            [
                21984,
                22009
            ],
            [
                22021,
                22082
            ],
            [
                22084,
                22091
            ],
            [
                22237,
                22266
            ],
            [
                22266,
                22344
            ],
            [
                22352,
                22438
            ],
            [
                22453,
                22468
            ],
            [
                22573,
                22579
            ],
            [
                22584,
                22598
            ],
            [
                22604,
                22637
            ],
            [
                22641,
                22652
            ],
            [
                22652,
                22727
            ],
            [
                22824,
                22832
            ],
            [
                22860,
                22896
            ],
            [
                22896,
                22928
            ],
            [
                22930,
                22960
            ],
            [
                23399,
                23446
            ],
            [
                23447,
                23518
            ],
            [
                23520,
                23530
            ],
            [
                23533,
                23561
            ],
            [
                23562,
                23566
            ],
            [
                23598,
                23600
            ],
            [
                23600,
                23722
            ]
        ],
        "row_chars": [
            [
                0,
                95
            ],
            [
                95,
                124
            ],
            [
                124,
                206
            ],
            [
                206,
                580
            ],
            [
                580,
                925
            ],
            [
                925,
                1319
            ],
            [
                1319,
                1680
            ],
            [
                1680,
                1881
            ],
            [
                1881,
                2122
            ],
            [
                2122,
                2442
            ],
            [
                2442,
                2713
            ],
            [
                2713,
                3048
            ],
            [
                3048,
                3231
            ],
            [
                3231,
                3596
            ],
            [
                3596,
                3898
            ],
            [
                3898,
                4096
            ],
            [
                4096,
                4189
            ],
            [
                4189,
                4279
            ],
            [
                4279,
                4484
            ],
            [
                4484,
                4712
            ],
            [
                4712,
                4783
            ],
            [
                4783,
                4884
            ],
            [
                4884,
                5020
            ],
            [
                5020,
                5344
            ],
            [
                5344,
                5743
            ],
            [
                5743,
                5875
            ],
            [
                5875,
                6159
            ],
            [
                6159,
                6267
            ],
            [
                6267,
                6480
            ],
            [
                6480,
                6627
            ],
            [
                6627,
                6774
            ],
            [
                6774,
                7063
            ],
            [
                7063,
                7206
            ],
            [
                7206,
                7541
            ],
            [
                7541,
                7643
            ],
            [
                7643,
                7731
            ],
            [
                7731,
                7864
            ],
            [
                7864,
                8135
            ],
            [
                8135,
                8744
            ],
            [
                8744,
                8824
            ],
            [
                8824,
                9096
            ],
            [
                9096,
                9426
            ],
            [
                9426,
                9761
            ],
            [
                9761,
                9943
            ],
            [
                9943,
                10201
            ],
            [
                10201,
                10628
            ],
            [
                10628,
                10780
            ],
            [
                10780,
                10871
            ],
            [
                10871,
                11026
            ],
            [
                11026,
                11204
            ],
            [
                11204,
                11364
            ],
            [
                11364,
                11451
            ],
            [
                11451,
                11756
            ],
            [
                11756,
                11867
            ],
            [
                11867,
                11885
            ],
            [
                11885,
                11902
            ],
            [
                11902,
                11918
            ],
            [
                11918,
                11954
            ],
            [
                11954,
                11996
            ],
            [
                11996,
                12054
            ],
            [
                12054,
                12151
            ],
            [
                12151,
                12354
            ],
            [
                12354,
                12473
            ],
            [
                12473,
                12496
            ],
            [
                12496,
                12548
            ],
            [
                12548,
                12650
            ],
            [
                12650,
                12715
            ],
            [
                12715,
                12765
            ],
            [
                12765,
                12822
            ],
            [
                12822,
                12859
            ],
            [
                12859,
                12945
            ],
            [
                12945,
                13032
            ],
            [
                13032,
                13116
            ],
            [
                13116,
                13146
            ],
            [
                13146,
                13160
            ],
            [
                13160,
                13177
            ],
            [
                13177,
                13229
            ],
            [
                13229,
                13376
            ],
            [
                13376,
                13610
            ],
            [
                13610,
                13623
            ],
            [
                13623,
                13736
            ],
            [
                13736,
                13915
            ],
            [
                13915,
                14115
            ],
            [
                14115,
                14314
            ],
            [
                14314,
                14442
            ],
            [
                14442,
                14507
            ],
            [
                14507,
                14581
            ],
            [
                14581,
                14728
            ],
            [
                14728,
                14782
            ],
            [
                14782,
                14814
            ],
            [
                14814,
                14892
            ],
            [
                14892,
                15009
            ],
            [
                15009,
                15094
            ],
            [
                15094,
                15166
            ],
            [
                15166,
                15282
            ],
            [
                15282,
                15342
            ],
            [
                15342,
                15381
            ],
            [
                15381,
                15415
            ],
            [
                15415,
                15508
            ],
            [
                15508,
                15529
            ],
            [
                15529,
                15651
            ],
            [
                15651,
                15838
            ],
            [
                15838,
                15897
            ],
            [
                15897,
                15975
            ],
            [
                15975,
                16077
            ],
            [
                16077,
                16218
            ],
            [
                16218,
                16264
            ],
            [
                16264,
                16278
            ],
            [
                16278,
                16297
            ],
            [
                16297,
                16340
            ],
            [
                16340,
                16451
            ],
            [
                16451,
                16652
            ],
            [
                16652,
                16772
            ],
            [
                16772,
                16848
            ],
            [
                16848,
                17093
            ],
            [
                17093,
                17327
            ],
            [
                17327,
                17451
            ],
            [
                17451,
                17474
            ],
            [
                17474,
                17505
            ],
            [
                17505,
                17516
            ],
            [
                17516,
                17568
            ],
            [
                17568,
                17605
            ],
            [
                17605,
                17650
            ],
            [
                17650,
                17693
            ],
            [
                17693,
                17777
            ],
            [
                17777,
                17868
            ],
            [
                17868,
                18069
            ],
            [
                18069,
                18091
            ],
            [
                18091,
                18121
            ],
            [
                18121,
                18164
            ],
            [
                18164,
                18255
            ],
            [
                18255,
                18270
            ],
            [
                18270,
                18302
            ],
            [
                18302,
                18334
            ],
            [
                18334,
                18358
            ],
            [
                18358,
                18385
            ],
            [
                18385,
                18453
            ],
            [
                18453,
                18474
            ],
            [
                18474,
                18492
            ],
            [
                18492,
                18537
            ],
            [
                18537,
                18792
            ],
            [
                18792,
                18938
            ],
            [
                18938,
                19118
            ],
            [
                19118,
                19154
            ],
            [
                19154,
                19261
            ],
            [
                19261,
                19382
            ],
            [
                19382,
                19424
            ],
            [
                19424,
                19447
            ],
            [
                19447,
                19466
            ],
            [
                19466,
                19486
            ],
            [
                19486,
                19672
            ],
            [
                19672,
                19700
            ],
            [
                19700,
                19813
            ],
            [
                19813,
                19829
            ],
            [
                19829,
                19843
            ],
            [
                19843,
                19866
            ],
            [
                19866,
                19894
            ],
            [
                19894,
                19919
            ],
            [
                19919,
                19990
            ],
            [
                19990,
                20024
            ],
            [
                20024,
                20053
            ],
            [
                20053,
                20088
            ],
            [
                20088,
                20145
            ],
            [
                20145,
                20205
            ],
            [
                20205,
                20227
            ],
            [
                20227,
                20315
            ],
            [
                20315,
                20322
            ],
            [
                20322,
                20445
            ],
            [
                20445,
                20507
            ],
            [
                20507,
                20575
            ],
            [
                20575,
                20749
            ],
            [
                20749,
                21139
            ],
            [
                21139,
                21430
            ],
            [
                21430,
                21739
            ],
            [
                21739,
                22193
            ],
            [
                22193,
                22266
            ],
            [
                22266,
                22344
            ],
            [
                22344,
                22438
            ],
            [
                22438,
                22652
            ],
            [
                22652,
                22727
            ],
            [
                22727,
                22824
            ],
            [
                22824,
                22896
            ],
            [
                22896,
                22960
            ],
            [
                22960,
                23331
            ],
            [
                23331,
                23399
            ],
            [
                23399,
                23600
            ],
            [
                23600,
                23722
            ]
        ]
    },
    "abridged": {
        "text": "On a fine evening near the end of July, Deronda was rowing on the Thames. It was over a year since he had come back to England, with the understanding that his education was finished, and that he was to take his place in English society; and he had begun to read law, though only in deference to Sir Hugo's wish, and to fence off idleness. His old love of boating had revived; he had a boat at Putney, and it was his chief holiday to row till past sunset and come in with the stars.\nRowing in his dark-blue shirt and skull-cap, his curls closely clipped, the bearded man with the lithe, powerful frame bore only traces of the seraphic boy. Still, even one who had never seen him since his boyhood might have recognised him, due perhaps to the gaze which Gwendolen called \"dreadful,\" though it had really a very mild sort of scrutiny. With his pale-brown skin and calmly penetrating eyes, he was seraphic no longer: the firm gravity of his face was thoroughly terrestrial and manly; but still of a kind to raise belief in human dignity.\nDeronda objected very strongly to the notion that his appearance might draw attention. His own face in the glass was associated with thoughts of some one whom he must be like - one about whom he continually wondered, and never dared to ask.\nNear Kew Bridge, between six and seven o'clock, the river was no solitude. People were sauntering on the towing-path, and here and there a boat was plying. Deronda had been rowing fast, when, becoming aware of an approaching barge, he guided his boat aside, and paused near the river-bank. He was unconsciously continuing the low-toned chant which he had been singing all the way up the river - the gondolier's song in Rossini's \"Otello\":-\n\"Nessun maggior dolore\nChe ricordarsi del tempo felice\nNella miseria.\"\n\"There is no greater sorrow\nThan to be reminded of the happy time\nIn misery.\"\nAs he rested on his oar, the melodic fall of the \"nella miseria\" was distinctly audible on the bank. Three or four persons had paused to watch the barge passing the bridge, but probably it was only to one ear that the low singing came with any significance. Deronda saw a few yards away a figure which might have been an impersonation of the misery in his song: a girl hardly more than eighteen, of small, slim figure, with a most delicate little face, her dark curls pushed behind her ears under a large black hat, a long woollen cloak over her shoulders. Her eyes were fixed on the river with a look of immovable, statue-like despair.\nThis strong arrest of his attention made him cease singing: at which she changed her attitude, and, looking round with a frightened glance, met Deronda's face. It was but a couple of moments, but that seemed a long while for two people to look straight at each other. Her look was something like a fawn's before it turns to run away: no blush, no alarm, but only some timidity. In fact, Deronda thought that she was only half conscious of her surroundings: was she hungry, or was there some other cause? He felt an outleap of interest and compassion toward her; but the next instant she had walked away to a bench under a tree. He had no right to linger and watch her: poorly-dressed, melancholy women are common sights; it was only the delicate beauty of the image that was exceptional.\nHe began to row away and was soon far up the river; but he could not expel that pale image of unhappy girlhood. He began speculating on the tale behind her look of desolation; then smiled at his idea that interesting faces must have interesting adventures.\n\"I should not have forgotten the look of misery even if she had been ugly and vulgar,\" he told himself. But there was no denying that the attractiveness of the image made it likelier to last. It was as clear to him as an onyx cameo; the brown-black drapery, the white face with small features and dark, long-lashed eyes. His mind glanced over the girl-tragedies that are going on in the world, hidden, unheeded.\nHe used his oars little, satisfied to go with the tide and be taken back by it. It was his habit to indulge himself in that solemn passivity which easily comes with the lengthening shadows and mellow light. By the time he had come back again with the tide past Richmond Bridge the sun was near setting: and the approach of his favourite hour - with its deepening stillness and darkening masses of tree between the double glow of the sky and the river - disposed him to linger. He looked for a solitary spot where he could lodge his boat against the bank to watch the sunset.\nHe chose a place in the bend of the river just opposite Kew Gardens, where he had a great breadth of water before him reflecting the glory of the sky, while he himself was in shadow. Lying with his hands behind his head, he could see all round him, but could not be seen by anyone at a few yards' distance. He was forgetting everything but the view in front of him, when the sense of something moving on the opposite bank, in the willow bushes, made him glance that way.\nAt once he had a darting presentiment about the moving figure; and now he could see the small face with the dying sunlight upon it. Fearing to frighten her by a sudden movement, he watched her motionlessly. She looked round, and seeming to gather security from the solitude, hid her hat among the willows, and took off her woollen cloak. She seated herself and deliberately dipped the cloak in the water, holding it there, then taking it out with effort, and rising from her seat. By this time Deronda felt sure that she meant to wrap the wet cloak round her as a drowning shroud; there was no longer time to hesitate about frightening her.\nHe rose and plied his oar towards her. The poor thing, overcome with terror at this sign of discovery, sank down again, crouching and covering her face as if she kept a faint hope that she had not been seen. But soon he was close to her, steadying his boat against the bank, and speaking very gently-\n\"Don't be afraid. You are unhappy. Pray, trust me. Tell me what I can do to help you.\"\nShe raised her head and looked at him. But she did not speak for a few moments, while they renewed their former gaze at each other. At last she said in a low sweet voice, with an accent that suggested foreignness and yet was not foreign, \"I saw you before,\" and then added dreamily, \"nella miseria. It was you, singing? Nessun maggior dolore.\" The mere words uttered in her sweet undertones seemed to give the melody to Deronda's ear.\n\"Yes,\" he said, \"I often sing that. But I fear you will injure yourself staying here. Pray let me carry you in my boat to some place of safety. And that wet cloak - let me take it.\"\nHe would not take it without her leave. He fancied that she shrank and clutched the cloak tenaciously. But her eyes were fixed on him questioningly: she said, \"You look good. Perhaps it is God's command.\"\n\"Do trust me. Let me help you. I will die before I will let any harm come to you.\"\nShe rose from her sitting posture, first dragging the saturated cloak and then letting it fall on the ground - it was too heavy for her tired arms. Her little woman's figure as she laid her delicate chilled hands together one over the other against her waist, was unspeakably touching.\n\"Great God!\" the words escaped Deronda like an unconscious prayer. The agitating impression this forsaken girl was making on him stirred his deepest interest in the fates of women- \"perhaps my mother was like this one,\" he thought.\nHis low-toned words seemed to reassure the hearer: she stepped close to the boat's side, and Deronda held out his hand, hoping she would let him help her in. She had already put her tiny hand into his when some new thought struck her, and drawing back she said-\n\"I have nowhere to go - nobody belonging to me in all this land.\"\n\"I will take you to a lady who has daughters,\" said Deronda immediately. He felt a sort of relief in gathering that the wretched home and cruel friends he imagined her to be fleeing from were not near. Still she hesitated, and said more timidly-\n\"Do you belong to the theatre?\"\n\"No; I have nothing to do with the theatre,\" said Deronda decidedly. \"I will take you to perfect safety with a good woman; I am sure she will be kind. Let us lose no time: you will make yourself ill. Life may still become sweet to you. There are good people who will take care of you.\"\nShe stepped in and sat down on the cushions.\n\"You had a hat,\" said Deronda. \"I will find it.\"\nHe jumped out, found the hat, and lifted up the saturated cloak, wringing it and throwing it into the bottom of the boat.\n\"We must carry the cloak away, to prevent anyone who may have noticed you from thinking you have drowned,\" he said, cheerfully, as he got in again. \"I wish I had any other garment than my coat to offer you. But shall you mind throwing it over your shoulders while we are on the water? It is quite an ordinary thing to do, when people return late and are chilly.\" He held out the coat with a smile, and there came a faint melancholy smile in answer, as she put it on.\n\"I have some biscuits - should you like them?\" said Deronda.\n\"No; I cannot eat. I had still some money left to buy bread.\"\nHe began to ply his oar without further remark, and they went along swiftly for many minutes without speaking. She was watching the oar, leaning forward in an attitude of repose, as if she were beginning to feel the comfort of returning warmth and the prospect of life instead of death.\nThe twilight was deepening; the red flush was gone and the little stars were giving their answer one after another. The moon was rising, but was still entangled among the trees and buildings. The light was not such that he could distinctly discern her features, but they were distinctly before him nevertheless. Among his anxieties one was dominant: his first impression that her mind might be disordered, had not been quite dissipated: the project of suicide was unmistakable. He longed to begin a conversation, but hoped she would speak first. At last she did speak.\n\"I like to listen to the oar.\"\n\"So do I.\"\n\"If you had not come, I should have been dead now.\"\n\"I cannot bear you to speak of that. I hope you will never be sorry that I came.\"\n\"I cannot see how I shall be glad to live. The maggior dolore and the miseria have lasted longer than the tempo felice.\"\nDeronda was mute: to question her seemed an unwarrantable freedom; he shrank from appearing to treat her with less respect because she was in distress. She went on musingly-\n\"I thought it was not wicked. Death and life are one before the Eternal. I know our fathers slew their children and then slew themselves, to keep their souls pure. But now I am commanded to live. I cannot see how I shall live.\"\n\"You will find friends. I will find them for you.\"\nShe shook her head and said mournfully, \"Not my mother and brother. I cannot find them.\"\n\"You are English? You speak English perfectly.\"\nShe did not answer immediately, but looked at Deronda again, with wondering timidity, as if she were unsure whether she was dreaming or awake.\n\"You want to know if I am English?\" she said at last.\n\"I want to know nothing except what you like to tell me,\" he said, still uneasy in the fear that her mind was wandering. \"Perhaps it is not good for you to talk.\"\n\"I am English-born. But I am a Jewess.\"\nDeronda was silent, thinking that he might have guessed this, although he could equally have guessed her to be Spanish.\n\"Do you despise me for it?\" she said presently in low, sad tones.\n\"Why should I? I am not so foolish.\"\n\"I know many Jews are bad.\"\n\"So are many Christians. But I should not think it fair for you to despise me because of that.\"\n\"My mother and brother were good. But I shall never find them. I am come a long way - from abroad. I ran away; but I cannot speak of it. I thought I might find my mother again - God would guide me. But then I despaired. This morning I felt as if one word kept sounding within me - Never! never! But now - I begin - to think-\" her words were broken by rising sobs - \"I am commanded to live - perhaps we are going to her.\"\nWith an outburst of weeping she buried her head on her knees. He hoped that this passionate weeping might relieve her agitation. Meanwhile he was inwardly picturing in much embarrassment how he should present himself with her in Park Lane. No one kinder and more gentle than Lady Mallinger; but she might not be at home; and he had a shuddering sense of a lackey staring at this delicate, sorrowful girl, and perhaps chilling suspicion from lady's maid and housekeeper.\nBut to take her to any other shelter than a home already known to him was not to be contemplated. Another resource came to mind: he could take her to Mrs. Meyrick's - to the small house at Chelsea, where he felt sure that he could appeal to generous hearts. Hans Meyrick was safe away in Italy, and Deronda felt the comfort of presenting himself with his charge at a house where he would be met by a motherly figure of quakerish neatness, and three girls who hardly knew of any evil beyond what lay in history-books, and would at once associate a lovely Jewess with Rebecca in \"Ivanhoe.\" Deronda no longer hesitated.\nThe rumbling thither in the cab after the stillness of the water seemed long. His charge had been quiet since her fit of weeping, and submitted like a tired child. In the cab, she dozed, her sweet head hanging helpless, first on one side, then the other.\n\"They are too good to have any fear about taking her in,\" thought Deronda. Yet what had brought her to this desolation? He was going on a strange errand, to ask shelter for this waif. Deronda felt himself growing older this evening, and entering on a new phase in finding a life to which his own had come: perhaps as rescue; but how to make sure of that? The moment of finding a fellow-creature is often as full of mingled doubt and exultation as the moment of finding an idea.",
        "paragraph_chars": [
            [
                0,
                483
            ],
            [
                483,
                1036
            ],
            [
                1036,
                1277
            ],
            [
                1277,
                1717
            ],
            [
                1717,
                1740
            ],
            [
                1740,
                1772
            ],
            [
                1772,
                1788
            ],
            [
                1788,
                1816
            ],
            [
                1816,
                1854
            ],
            [
                1854,
                1866
            ],
            [
                1866,
                2503
            ],
            [
                2503,
                3291
            ],
            [
                3291,
                3548
            ],
            [
                3548,
                3960
            ],
            [
                3960,
                4535
            ],
            [
                4535,
                5006
            ],
            [
                5006,
                5647
            ],
            [
                5647,
                5948
            ],
            [
                5948,
                6035
            ],
            [
                6035,
                6470
            ],
            [
                6470,
                6652
            ],
            [
                6652,
                6857
            ],
            [
                6857,
                6940
            ],
            [
                6940,
                7226
            ],
            [
                7226,
                7458
            ],
            [
                7458,
                7720
            ],
            [
                7720,
                7786
            ],
            [
                7786,
                8032
            ],
            [
                8032,
                8064
            ],
            [
                8064,
                8350
            ],
            [
                8350,
                8395
            ],
            [
                8395,
                8444
            ],
            [
                8444,
                8566
            ],
            [
                8566,
                9033
            ],
            [
                9033,
                9094
            ],
            [
                9094,
                9156
            ],
            [
                9156,
                9443
            ],
            [
                9443,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10054
            ],
            [
                10054,
                10106
            ],
            [
                10106,
                10188
            ],
            [
                10188,
                10309
            ],
            [
                10309,
                10483
            ],
            [
                10483,
                10711
            ],
            [
                10711,
                10762
            ],
            [
                10762,
                10851
            ],
            [
                10851,
                10899
            ],
            [
                10899,
                11042
            ],
            [
                11042,
                11096
            ],
            [
                11096,
                11259
            ],
            [
                11259,
                11299
            ],
            [
                11299,
                11419
            ],
            [
                11419,
                11485
            ],
            [
                11485,
                11522
            ],
            [
                11522,
                11550
            ],
            [
                11550,
                11646
            ],
            [
                11646,
                12067
            ],
            [
                12067,
                12537
            ],
            [
                12537,
                13154
            ],
            [
                13154,
                13409
            ],
            [
                13409,
                13886
            ]
        ],
        "segment_chars": [
            [
                0,
                74
            ],
            [
                74,
                340
            ],
            [
                340,
                483
            ],
            [
                483,
                640
            ],
            [
                640,
                834
            ],
            [
                834,
                1036
            ],
            [
                1036,
                1123
            ],
            [
                1123,
                1277
            ],
            [
                1277,
                1352
            ],
            [
                1352,
                1433
            ],
            [
                1433,
                1567
            ],
            [
                1567,
                1717
            ],
            [
                1717,
                1740
            ],
            [
                1740,
                1772
            ],
            [
                1772,
                1788
            ],
            [
                1788,
                1816
            ],
            [
                1816,
                1854
            ],
            [
                1854,
                1866
            ],
            [
                1866,
                1967
            ],
            [
                1967,
                2124
            ],
            [
                2124,
                2423
            ],
            [
                2423,
                2503
            ],
            [
                2503,
                2663
            ],
            [
                2663,
                2771
            ],
            [
                2771,
                2881
            ],
            [
                2881,
                3007
            ],
            [
                3007,
                3131
            ],
            [
                3131,
                3291
            ],
            [
                3291,
                3403
            ],
            [
                3403,
                3548
            ],
            [
                3548,
                3652
            ],
            [
                3652,
                3740
            ],
            [
                3740,
                3869
            ],
            [
                3869,
                3960
            ],
            [
                3960,
                4040
            ],
            [
                4040,
                4167
            ],
            [
                4167,
                4437
            ],
            [
                4437,
                4535
            ],
            [
                4535,
                4718
            ],
            [
                4718,
                4842
            ],
            [
                4842,
                5006
            ],
            [
                5006,
                5138
            ],
            [
                5138,
                5213
            ],
            [
                5213,
                5344
            ],
            [
                5344,
                5487
            ],
            [
                5487,
                5647
            ],
            [
                5647,
                5686
            ],
            [
                5686,
                5855
            ],
            [
                5855,
                5948
            ],
            [
                5948,
                5966
            ],
            [
                5966,
                5983
            ],
            [
                5983,
                5999
            ],
            [
                5999,
                6035
            ],
            [
                6035,
                6074
            ],
            [
                6074,
                6167
            ],
            [
                6167,
                6334
            ],
            [
                6334,
                6355
            ],
            [
                6355,
                6379
            ],
            [
                6379,
                6470
            ],
            [
                6470,
                6506
            ],
            [
                6506,
                6556
            ],
            [
                6556,
                6614
            ],
            [
                6614,
                6652
            ],
            [
                6652,
                6692
            ],
            [
                6692,
                6755
            ],
            [
                6755,
                6827
            ],
            [
                6827,
                6857
            ],
            [
                6857,
                6871
            ],
            [
                6871,
                6888
            ],
            [
                6888,
                6940
            ],
            [
                6940,
                7088
            ],
            [
                7088,
                7226
            ],
            [
                7226,
                7239
            ],
            [
                7239,
                7293
            ],
            [
                7293,
                7458
            ],
            [
                7458,
                7616
            ],
            [
                7616,
                7720
            ],
            [
                7720,
                7786
            ],
            [
                7786,
                7859
            ],
            [
                7859,
                7988
            ],
            [
                7988,
                8032
            ],
            [
                8032,
                8064
            ],
            [
                8064,
                8133
            ],
            [
                8133,
                8215
            ],
            [
                8215,
                8300
            ],
            [
                8300,
                8350
            ],
            [
                8350,
                8395
            ],
            [
                8395,
                8426
            ],
            [
                8426,
                8444
            ],
            [
                8444,
                8566
            ],
            [
                8566,
                8714
            ],
            [
                8714,
                8773
            ],
            [
                8773,
                8851
            ],
            [
                8851,
                8929
            ],
            [
                8929,
                9033
            ],
            [
                9033,
                9080
            ],
            [
                9080,
                9094
            ],
            [
                9094,
                9113
            ],
            [
                9113,
                9156
            ],
            [
                9156,
                9267
            ],
            [
                9267,
                9443
            ],
            [
                9443,
                9559
            ],
            [
                9559,
                9635
            ],
            [
                9635,
                9755
            ],
            [
                9755,
                9921
            ],
            [
                9921,
                9989
            ],
            [
                9989,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10054
            ],
            [
                10054,
                10106
            ],
            [
                10106,
                10143
            ],
            [
                10143,
                10188
            ],
            [
                10188,
                10231
            ],
            [
                10231,
                10309
            ],
            [
                10309,
                10461
            ],
            [
                10461,
                10483
            ],
            [
                10483,
                10513
            ],
            [
                10513,
                10556
            ],
            [
                10556,
                10647
            ],
            [
                10647,
                10679
            ],
            [
                10679,
                10711
            ],
            [
                10711,
                10735
            ],
            [
                10735,
                10762
            ],
            [
                10762,
                10830
            ],
            [
                10830,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10899
            ],
            [
                10899,
                11042
            ],
            [
                11042,
                11078
            ],
            [
                11078,
                11096
            ],
            [
                11096,
                11217
            ],
            [
                11217,
                11259
            ],
            [
                11259,
                11279
            ],
            [
                11279,
                11299
            ],
            [
                11299,
                11419
            ],
            [
                11419,
                11447
            ],
            [
                11447,
                11485
            ],
            [
                11485,
                11500
            ],
            [
                11500,
                11522
            ],
            [
                11522,
                11550
            ],
            [
                11550,
                11575
            ],
            [
                11575,
                11646
            ],
            [
                11646,
                11680
            ],
            [
                11680,
                11709
            ],
            [
                11709,
                11745
            ],
            [
                11745,
                11783
            ],
            [
                11783,
                11844
            ],
            [
                11844,
                11866
            ],
            [
                11866,
                11934
            ],
            [
                11934,
                11941
            ],
            [
                11941,
                12067
            ],
            [
                12067,
                12129
            ],
            [
                12129,
                12196
            ],
            [
                12196,
                12307
            ],
            [
                12307,
                12537
            ],
            [
                12537,
                12635
            ],
            [
                12635,
                12795
            ],
            [
                12795,
                13125
            ],
            [
                13125,
                13154
            ],
            [
                13154,
                13232
            ],
            [
                13232,
                13318
            ],
            [
                13318,
                13409
            ],
            [
                13409,
                13484
            ],
            [
                13484,
                13529
            ],
            [
                13529,
                13593
            ],
            [
                13593,
                13764
            ],
            [
                13764,
                13886
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                59,
                74
            ],
            [
                74,
                80
            ],
            [
                86,
                92
            ],
            [
                93,
                199
            ],
            [
                200,
                237
            ],
            [
                242,
                267
            ],
            [
                268,
                274
            ],
            [
                280,
                338
            ],
            [
                338,
                340
            ],
            [
                340,
                375
            ],
            [
                377,
                390
            ],
            [
                391,
                405
            ],
            [
                406,
                466
            ],
            [
                467,
                482
            ],
            [
                483,
                554
            ],
            [
                571,
                575
            ],
            [
                583,
                585
            ],
            [
                585,
                586
            ],
            [
                602,
                611
            ],
            [
                612,
                638
            ],
            [
                640,
                707
            ],
            [
                719,
                722
            ],
            [
                722,
                738
            ],
            [
                739,
                763
            ],
            [
                771,
                834
            ],
            [
                843,
                858
            ],
            [
                859,
                862
            ],
            [
                863,
                886
            ],
            [
                886,
                887
            ],
            [
                895,
                903
            ],
            [
                907,
                914
            ],
            [
                915,
                918
            ],
            [
                932,
                934
            ],
            [
                948,
                1020
            ],
            [
                1021,
                1034
            ],
            [
                1034,
                1036
            ],
            [
                1044,
                1080
            ],
            [
                1081,
                1100
            ],
            [
                1107,
                1121
            ],
            [
                1121,
                1123
            ],
            [
                1123,
                1148
            ],
            [
                1153,
                1163
            ],
            [
                1164,
                1210
            ],
            [
                1213,
                1222
            ],
            [
                1228,
                1277
            ],
            [
                1282,
                1352
            ],
            [
                1359,
                1433
            ],
            [
                1433,
                1461
            ],
            [
                1461,
                1486
            ],
            [
                1502,
                1507
            ],
            [
                1507,
                1538
            ],
            [
                1551,
                1561
            ],
            [
                1565,
                1567
            ],
            [
                1567,
                1573
            ],
            [
                1574,
                1624
            ],
            [
                1628,
                1631
            ],
            [
                1645,
                1669
            ],
            [
                1672,
                1695
            ],
            [
                1696,
                1703
            ],
            [
                1707,
                1713
            ],
            [
                1717,
                1739
            ],
            [
                1740,
                1771
            ],
            [
                1778,
                1785
            ],
            [
                1866,
                1894
            ],
            [
                1895,
                1902
            ],
            [
                1903,
                1914
            ],
            [
                1915,
                1960
            ],
            [
                1965,
                1967
            ],
            [
                1967,
                1999
            ],
            [
                2000,
                2038
            ],
            [
                2039,
                2087
            ],
            [
                2096,
                2105
            ],
            [
                2110,
                2122
            ],
            [
                2122,
                2124
            ],
            [
                2124,
                2131
            ],
            [
                2132,
                2135
            ],
            [
                2136,
                2147
            ],
            [
                2153,
                2214
            ],
            [
                2218,
                2221
            ],
            [
                2226,
                2264
            ],
            [
                2270,
                2271
            ],
            [
                2272,
                2289
            ],
            [
                2292,
                2388
            ],
            [
                2397,
                2423
            ],
            [
                2423,
                2502
            ],
            [
                2503,
                2562
            ],
            [
                2572,
                2596
            ],
            [
                2596,
                2663
            ],
            [
                2663,
                2771
            ],
            [
                2771,
                2798
            ],
            [
                2799,
                2805
            ],
            [
                2808,
                2849
            ],
            [
                2850,
                2879
            ],
            [
                2879,
                2881
            ],
            [
                2881,
                2889
            ],
            [
                2890,
                2897
            ],
            [
                2906,
                3005
            ],
            [
                3005,
                3007
            ],
            [
                3007,
                3093
            ],
            [
                3094,
                3110
            ],
            [
                3111,
                3131
            ],
            [
                3131,
                3255
            ],
            [
                3256,
                3289
            ],
            [
                3289,
                3290
            ],
            [
                3291,
                3346
            ],
            [
                3360,
                3403
            ],
            [
                3403,
                3405
            ],
            [
                3412,
                3430
            ],
            [
                3436,
                3442
            ],
            [
                3447,
                3471
            ],
            [
                3479,
                3485
            ],
            [
                3491,
                3546
            ],
            [
                3546,
                3548
            ],
            [
                3548,
                3595
            ],
            [
                3601,
                3637
            ],
            [
                3643,
                3652
            ],
            [
                3652,
                3740
            ],
            [
                3740,
                3746
            ],
            [
                3750,
                3831
            ],
            [
                3832,
                3869
            ],
            [
                3869,
                3958
            ],
            [
                3958,
                3959
            ],
            [
                3960,
                4040
            ],
            [
                4040,
                4165
            ],
            [
                4165,
                4167
            ],
            [
                4167,
                4286
            ],
            [
                4297,
                4301
            ],
            [
                4304,
                4361
            ],
            [
                4362,
                4410
            ],
            [
                4422,
                4435
            ],
            [
                4435,
                4437
            ],
            [
                4437,
                4446
            ],
            [
                4447,
                4452
            ],
            [
                4453,
                4513
            ],
            [
                4514,
                4516
            ],
            [
                4517,
                4522
            ],
            [
                4523,
                4526
            ],
            [
                4527,
                4533
            ],
            [
                4535,
                4545
            ],
            [
                4552,
                4718
            ],
            [
                4724,
                4755
            ],
            [
                4756,
                4808
            ],
            [
                4816,
                4840
            ],
            [
                4840,
                4842
            ],
            [
                4842,
                4870
            ],
            [
                4875,
                4878
            ],
            [
                4884,
                4886
            ],
            [
                4893,
                4895
            ],
            [
                4896,
                4899
            ],
            [
                4899,
                4900
            ],
            [
                4901,
                4942
            ],
            [
                4943,
                4951
            ],
            [
                4952,
                4956
            ],
            [
                4956,
                4957
            ],
            [
                4958,
                4960
            ],
            [
                4961,
                4964
            ],
            [
                4965,
                4988
            ],
            [
                4989,
                4995
            ],
            [
                5004,
                5005
            ],
            [
                5014,
                5113
            ],
            [
                5114,
                5138
            ],
            [
                5146,
                5183
            ],
            [
                5184,
                5186
            ],
            [
                5187,
                5198
            ],
            [
                5199,
                5205
            ],
            [
                5211,
                5213
            ],
            [
                5213,
                5230
            ],
            [
                5243,
                5270
            ],
            [
                5271,
                5315
            ],
            [
                5316,
                5328
            ],
            [
                5337,
                5344
            ],
            [
                5344,
                5427
            ],
            [
                5427,
                5460
            ],
            [
                5465,
                5485
            ],
            [
                5485,
                5487
            ],
            [
                5487,
                5646
            ],
            [
                5647,
                5658
            ],
            [
                5665,
                5672
            ],
            [
                5681,
                5684
            ],
            [
                5684,
                5686
            ],
            [
                5686,
                5748
            ],
            [
                5748,
                5759
            ],
            [
                5760,
                5766
            ],
            [
                5767,
                5771
            ],
            [
                5777,
                5780
            ],
            [
                5790,
                5853
            ],
            [
                5853,
                5855
            ],
            [
                5855,
                5870
            ],
            [
                5880,
                5934
            ],
            [
                5935,
                5946
            ],
            [
                5948,
                5966
            ],
            [
                5966,
                5983
            ],
            [
                5983,
                5999
            ],
            [
                5999,
                6035
            ],
            [
                6035,
                6065
            ],
            [
                6066,
                6074
            ],
            [
                6074,
                6113
            ],
            [
                6134,
                6167
            ],
            [
                6167,
                6220
            ],
            [
                6221,
                6225
            ],
            [
                6226,
                6317
            ],
            [
                6318,
                6332
            ],
            [
                6334,
                6353
            ],
            [
                6355,
                6379
            ],
            [
                6379,
                6393
            ],
            [
                6394,
                6470
            ],
            [
                6470,
                6471
            ],
            [
                6471,
                6485
            ],
            [
                6486,
                6488
            ],
            [
                6489,
                6494
            ],
            [
                6504,
                6506
            ],
            [
                6506,
                6556
            ],
            [
                6556,
                6567
            ],
            [
                6574,
                6614
            ],
            [
                6614,
                6632
            ],
            [
                6635,
                6652
            ],
            [
                6652,
                6664
            ],
            [
                6665,
                6690
            ],
            [
                6690,
                6692
            ],
            [
                6692,
                6741
            ],
            [
                6742,
                6755
            ],
            [
                6755,
                6785
            ],
            [
                6786,
                6794
            ],
            [
                6801,
                6827
            ],
            [
                6827,
                6857
            ],
            [
                6857,
                6871
            ],
            [
                6871,
                6888
            ],
            [
                6888,
                6940
            ],
            [
                6940,
                7048
            ],
            [
                7051,
                7088
            ],
            [
                7088,
                7199
            ],
            [
                7200,
                7226
            ],
            [
                7226,
                7239
            ],
            [
                7239,
                7264
            ],
            [
                7265,
                7269
            ],
            [
                7285,
                7291
            ],
            [
                7291,
                7293
            ],
            [
                7293,
                7362
            ],
            [
                7363,
                7405
            ],
            [
                7407,
                7443
            ],
            [
                7462,
                7487
            ],
            [
                7497,
                7520
            ],
            [
                7521,
                7558
            ],
            [
                7564,
                7584
            ],
            [
                7585,
                7616
            ],
            [
                7616,
                7658
            ],
            [
                7659,
                7718
            ],
            [
                7720,
                7741
            ],
            [
                7751,
                7786
            ],
            [
                7786,
                7845
            ],
            [
                7846,
                7859
            ],
            [
                7859,
                7981
            ],
            [
                7982,
                7986
            ],
            [
                7986,
                7988
            ],
            [
                7988,
                8030
            ],
            [
                8032,
                8064
            ],
            [
                8064,
                8121
            ],
            [
                8131,
                8133
            ],
            [
                8133,
                8140
            ],
            [
                8146,
                8149
            ],
            [
                8153,
                8167
            ],
            [
                8168,
                8172
            ],
            [
                8173,
                8215
            ],
            [
                8215,
                8300
            ],
            [
                8300,
                8321
            ],
            [
                8322,
                8350
            ],
            [
                8350,
                8353
            ],
            [
                8354,
                8364
            ],
            [
                8365,
                8395
            ],
            [
                8395,
                8405
            ],
            [
                8406,
                8409
            ],
            [
                8409,
                8425
            ],
            [
                8426,
                8441
            ],
            [
                8444,
                8566
            ],
            [
                8566,
                8607
            ],
            [
                8615,
                8662
            ],
            [
                8663,
                8712
            ],
            [
                8712,
                8714
            ],
            [
                8714,
                8773
            ],
            [
                8773,
                8851
            ],
            [
                8851,
                8919
            ],
            [
                8926,
                8929
            ],
            [
                8929,
                8949
            ],
            [
                8950,
                9021
            ],
            [
                9022,
                9031
            ],
            [
                9031,
                9033
            ],
            [
                9033,
                9054
            ],
            [
                9057,
                9080
            ],
            [
                9080,
                9094
            ],
            [
                9094,
                9113
            ],
            [
                9113,
                9156
            ],
            [
                9156,
                9267
            ],
            [
                9267,
                9270
            ],
            [
                9271,
                9442
            ],
            [
                9443,
                9488
            ],
            [
                9489,
                9559
            ],
            [
                9559,
                9635
            ],
            [
                9635,
                9690
            ],
            [
                9691,
                9703
            ],
            [
                9703,
                9753
            ],
            [
                9753,
                9755
            ],
            [
                9755,
                9813
            ],
            [
                9814,
                9919
            ],
            [
                9919,
                9921
            ],
            [
                9921,
                9959
            ],
            [
                9976,
                9989
            ],
            [
                9989,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10054
            ],
            [
                10054,
                10106
            ],
            [
                10106,
                10143
            ],
            [
                10143,
                10188
            ],
            [
                10188,
                10231
            ],
            [
                10231,
                10234
            ],
            [
                10239,
                10249
            ],
            [
                10250,
                10257
            ],
            [
                10258,
                10265
            ],
            [
                10266,
                10293
            ],
            [
                10300,
                10306
            ],
            [
                10306,
                10308
            ],
            [
                10309,
                10403
            ],
            [
                10404,
                10418
            ],
            [
                10419,
                10423
            ],
            [
                10432,
                10461
            ],
            [
                10461,
                10481
            ],
            [
                10483,
                10513
            ],
            [
                10513,
                10556
            ],
            [
                10556,
                10647
            ],
            [
                10647,
                10679
            ],
            [
                10679,
                10711
            ],
            [
                10711,
                10735
            ],
            [
                10735,
                10762
            ],
            [
                10762,
                10830
            ],
            [
                10830,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10872
            ],
            [
                10879,
                10886
            ],
            [
                10887,
                10899
            ],
            [
                10899,
                10959
            ],
            [
                10983,
                10984
            ],
            [
                10985,
                10999
            ],
            [
                11015,
                11018
            ],
            [
                11019,
                11031
            ],
            [
                11040,
                11041
            ],
            [
                11042,
                11078
            ],
            [
                11078,
                11094
            ],
            [
                11094,
                11096
            ],
            [
                11096,
                11217
            ],
            [
                11217,
                11259
            ],
            [
                11260,
                11279
            ],
            [
                11279,
                11299
            ],
            [
                11299,
                11318
            ],
            [
                11328,
                11335
            ],
            [
                11336,
                11341
            ],
            [
                11355,
                11359
            ],
            [
                11359,
                11360
            ],
            [
                11387,
                11419
            ],
            [
                11419,
                11447
            ],
            [
                11447,
                11472
            ],
            [
                11472,
                11473
            ],
            [
                11478,
                11483
            ],
            [
                11483,
                11485
            ],
            [
                11485,
                11498
            ],
            [
                11500,
                11522
            ],
            [
                11522,
                11550
            ],
            [
                11550,
                11575
            ],
            [
                11575,
                11646
            ],
            [
                11646,
                11680
            ],
            [
                11680,
                11709
            ],
            [
                11709,
                11729
            ],
            [
                11732,
                11745
            ],
            [
                11745,
                11769
            ],
            [
                11770,
                11783
            ],
            [
                11783,
                11821
            ],
            [
                11824,
                11844
            ],
            [
                11844,
                11866
            ],
            [
                11866,
                11878
            ],
            [
                11879,
                11924
            ],
            [
                11927,
                11934
            ],
            [
                11934,
                11941
            ],
            [
                11941,
                11948
            ],
            [
                11951,
                11958
            ],
            [
                11961,
                11969
            ],
            [
                11972,
                12008
            ],
            [
                12011,
                12034
            ],
            [
                12037,
                12067
            ],
            [
                12067,
                12129
            ],
            [
                12129,
                12184
            ],
            [
                12194,
                12196
            ],
            [
                12196,
                12305
            ],
            [
                12305,
                12307
            ],
            [
                12307,
                12361
            ],
            [
                12362,
                12365
            ],
            [
                12366,
                12371
            ],
            [
                12376,
                12465
            ],
            [
                12470,
                12492
            ],
            [
                12503,
                12535
            ],
            [
                12535,
                12536
            ],
            [
                12537,
                12633
            ],
            [
                12633,
                12635
            ],
            [
                12635,
                12674
            ],
            [
                12675,
                12701
            ],
            [
                12704,
                12733
            ],
            [
                12733,
                12734
            ],
            [
                12735,
                12743
            ],
            [
                12749,
                12774
            ],
            [
                12775,
                12793
            ],
            [
                12793,
                12795
            ],
            [
                12795,
                13019
            ],
            [
                13027,
                13052
            ],
            [
                13052,
                13113
            ],
            [
                13115,
                13122
            ],
            [
                13125,
                13154
            ],
            [
                13154,
                13232
            ],
            [
                13232,
                13318
            ],
            [
                13318,
                13333
            ],
            [
                13334,
                13340
            ],
            [
                13341,
                13355
            ],
            [
                13364,
                13397
            ],
            [
                13398,
                13409
            ],
            [
                13409,
                13484
            ],
            [
                13484,
                13492
            ],
            [
                13493,
                13529
            ],
            [
                13529,
                13561
            ],
            [
                13563,
                13593
            ],
            [
                13593,
                13640
            ],
            [
                13642,
                13713
            ],
            [
                13715,
                13725
            ],
            [
                13726,
                13754
            ],
            [
                13758,
                13762
            ],
            [
                13762,
                13764
            ],
            [
                13764,
                13886
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                74
            ],
            [
                74,
                340
            ],
            [
                340,
                483
            ],
            [
                483,
                483
            ],
            [
                483,
                483
            ],
            [
                483,
                640
            ],
            [
                640,
                834
            ],
            [
                834,
                834
            ],
            [
                834,
                834
            ],
            [
                834,
                1036
            ],
            [
                1036,
                1036
            ],
            [
                1036,
                1036
            ],
            [
                1036,
                1123
            ],
            [
                1123,
                1277
            ],
            [
                1277,
                1352
            ],
            [
                1352,
                1433
            ],
            [
                1433,
                1567
            ],
            [
                1567,
                1717
            ],
            [
                1717,
                1866
            ],
            [
                1866,
                1866
            ],
            [
                1866,
                1967
            ],
            [
                1967,
                2124
            ],
            [
                2124,
                2423
            ],
            [
                2423,
                2503
            ],
            [
                2503,
                2663
            ],
            [
                2663,
                2771
            ],
            [
                2771,
                2881
            ],
            [
                2881,
                3007
            ],
            [
                3007,
                3131
            ],
            [
                3131,
                3291
            ],
            [
                3291,
                3403
            ],
            [
                3403,
                3548
            ],
            [
                3548,
                3652
            ],
            [
                3652,
                3740
            ],
            [
                3740,
                3869
            ],
            [
                3869,
                3960
            ],
            [
                3960,
                3960
            ],
            [
                3960,
                4040
            ],
            [
                4040,
                4167
            ],
            [
                4167,
                4437
            ],
            [
                4437,
                4535
            ],
            [
                4535,
                4718
            ],
            [
                4718,
                4842
            ],
            [
                4842,
                5006
            ],
            [
                5006,
                5138
            ],
            [
                5138,
                5213
            ],
            [
                5213,
                5344
            ],
            [
                5344,
                5487
            ],
            [
                5487,
                5647
            ],
            [
                5647,
                5686
            ],
            [
                5686,
                5855
            ],
            [
                5855,
                5948
            ],
            [
                5948,
                5966
            ],
            [
                5966,
                5983
            ],
            [
                5983,
                5999
            ],
            [
                5999,
                6035
            ],
            [
                6035,
                6074
            ],
            [
                6074,
                6074
            ],
            [
                6074,
                6167
            ],
            [
                6167,
                6334
            ],
            [
                6334,
                6334
            ],
            [
                6334,
                6355
            ],
            [
                6355,
                6379
            ],
            [
                6379,
                6470
            ],
            [
                6470,
                6506
            ],
            [
                6506,
                6556
            ],
            [
                6556,
                6614
            ],
            [
                6614,
                6652
            ],
            [
                6652,
                6692
            ],
            [
                6692,
                6755
            ],
            [
                6755,
                6827
            ],
            [
                6827,
                6857
            ],
            [
                6857,
                6871
            ],
            [
                6871,
                6888
            ],
            [
                6888,
                6940
            ],
            [
                6940,
                7088
            ],
            [
                7088,
                7226
            ],
            [
                7226,
                7239
            ],
            [
                7239,
                7293
            ],
            [
                7293,
                7458
            ],
            [
                7458,
                7458
            ],
            [
                7458,
                7616
            ],
            [
                7616,
                7720
            ],
            [
                7720,
                7786
            ],
            [
                7786,
                7859
            ],
            [
                7859,
                7988
            ],
            [
                7988,
                8032
            ],
            [
                8032,
                8064
            ],
            [
                8064,
                8133
            ],
            [
                8133,
                8215
            ],
            [
                8215,
                8300
            ],
            [
                8300,
                8350
            ],
            [
                8350,
                8395
            ],
            [
                8395,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8426
            ],
            [
                8426,
                8444
            ],
            [
                8444,
                8444
            ],
            [
                8444,
                8566
            ],
            [
                8566,
                8714
            ],
            [
                8714,
                8773
            ],
            [
                8773,
                8851
            ],
            [
                8851,
                8929
            ],
            [
                8929,
                9033
            ],
            [
                9033,
                9080
            ],
            [
                9080,
                9094
            ],
            [
                9094,
                9113
            ],
            [
                9113,
                9156
            ],
            [
                9156,
                9267
            ],
            [
                9267,
                9443
            ],
            [
                9443,
                9559
            ],
            [
                9559,
                9635
            ],
            [
                9635,
                9755
            ],
            [
                9755,
                9921
            ],
            [
                9921,
                9989
            ],
            [
                9989,
                10012
            ],
            [
                10012,
                10043
            ],
            [
                10043,
                10054
            ],
            [
                10054,
                10106
            ],
            [
                10106,
                10143
            ],
            [
                10143,
                10188
            ],
            [
                10188,
                10231
            ],
            [
                10231,
                10309
            ],
            [
                10309,
                10309
            ],
            [
                10309,
                10461
            ],
            [
                10461,
                10483
            ],
            [
                10483,
                10513
            ],
            [
                10513,
                10556
            ],
            [
                10556,
                10647
            ],
            [
                10647,
                10647
            ],
            [
                10647,
                10679
            ],
            [
                10679,
                10711
            ],
            [
                10711,
                10735
            ],
            [
                10735,
                10762
            ],
            [
                10762,
                10830
            ],
            [
                10830,
                10851
            ],
            [
                10851,
                10869
            ],
            [
                10869,
                10899
            ],
            [
                10899,
                11042
            ],
            [
                11042,
                11042
            ],
            [
                11042,
                11042
            ],
            [
                11042,
                11078
            ],
            [
                11078,
                11096
            ],
            [
                11096,
                11217
            ],
            [
                11217,
                11259
            ],
            [
                11259,
                11259
            ],
            [
                11259,
                11279
            ],
            [
                11279,
                11299
            ],
            [
                11299,
                11419
            ],
            [
                11419,
                11447
            ],
            [
                11447,
                11485
            ],
            [
                11485,
                11500
            ],
            [
                11500,
                11500
            ],
            [
                11500,
                11522
            ],
            [
                11522,
                11550
            ],
            [
                11550,
                11575
            ],
            [
                11575,
                11646
            ],
            [
                11646,
                11680
            ],
            [
                11680,
                11709
            ],
            [
                11709,
                11745
            ],
            [
                11745,
                11783
            ],
            [
                11783,
                11844
            ],
            [
                11844,
                11866
            ],
            [
                11866,
                11934
            ],
            [
                11934,
                11941
            ],
            [
                11941,
                12067
            ],
            [
                12067,
                12129
            ],
            [
                12129,
                12196
            ],
            [
                12196,
                12307
            ],
            [
                12307,
                12537
            ],
            [
                12537,
                12635
            ],
            [
                12635,
                12795
            ],
            [
                12795,
                13125
            ],
            [
                13125,
                13154
            ],
            [
                13154,
                13232
            ],
            [
                13232,
                13318
            ],
            [
                13318,
                13409
            ],
            [
                13409,
                13484
            ],
            [
                13484,
                13484
            ],
            [
                13484,
                13529
            ],
            [
                13529,
                13593
            ],
            [
                13593,
                13593
            ],
            [
                13593,
                13593
            ],
            [
                13593,
                13764
            ],
            [
                13764,
                13886
            ]
        ]
    }
}