{
    "original": {
        "text": "Life is a various mother: now she dons Her plumes and brilliants, climbs the marble stairs With head aloft, nor ever turns her eyes On lackeys who attend her; now she dwells Grim-clad, up darksome alleys, breathes hot gin, And screams in pauper riot.\nBut to these She came a frugal matron, neat and deft, With cheerful morning thoughts and quick device To find the much in little.\nMrs. Meyrick's house was not noisy: the front parlor looked on the river, and the back on gardens, so that though she was reading aloud to her daughters, the window could be left open to freshen the air of the small double room where a lamp and two candles were burning. The candles were on a table apart for Kate, who was drawing illustrations for a publisher; the lamp was not only for the reader but for Amy and Mab, who were embroidering satin cushions for \"the great world.\"\nOutside, the house looked very narrow and shabby, the bright light through the holland blind showing the heavy old-fashioned window-frame; but it is pleasant to know that many such grim-walled slices of space in our foggy London have been and still are the homes of a culture the more spotlessly free from vulgarity, because poverty has rendered everything like display an impersonal question, and all the grand shows of the world simply a spectacle which rouses petty rivalry or vain effort after possession.\nThe Meyricks' was a home of that kind: and they all clung to this particular house in a row because its interior was filled with objects always in the same places, which, for the mother held memories of her marriage time, and for the young ones seemed as necessary and uncriticised a part of their world as the stars of the Great Bear seen from the back windows. Mrs. Meyrick had borne much stint of other matters that she might be able to keep some engravings specially cherished by her husband; and the narrow spaces of wall held a world history in scenes and heads which the children had early learned by heart. The chairs and tables were also old friends preferred to new. But in these two little parlors with no furniture that a broker would have cared to cheapen except the prints and piano, there was space and apparatus for a wide-glancing, nicely-select life, opened to the highest things in music, painting and poetry. I am not sure that in the times of greatest scarcity, before Kate could get paid-work, these ladies had always had a servant to light their fires and sweep their rooms; yet they were fastidious in some points, and could not believe that the manners of ladies in the fashionable world were so full of coarse selfishness, petty quarreling, and slang as they are represented to be in what are called literary photographs. The Meyricks had their little oddities, streaks of eccentricity from the mother's blood as well as the father's, their minds being like medival houses with unexpected recesses and openings from this into that, flights of steps and sudden outlooks.\nBut mother and daughters were all united by a triple bond--family love; admiration for the finest work, the best action; and habitual industry. Hans' desire to spend some of his money in making their lives more luxurious had been resisted by all of them, and both they and he had been thus saved from regrets at the threatened triumphs of his yearning for art over the attractions of secured income--a triumph that would by-and-by oblige him to give up his fellowship. They could all afford to laugh at his Gavarni-caricatures and to hold him blameless in following a natural bent which their unselfishness and independence had left without obstacle. It was enough for them to go on in their old way, only having a grand treat of opera-going (to the gallery) when Hans came home on a visit.\nSeeing the group they made this evening, one could hardly wish them to change their way of life. They were all alike small, and so in due proportion to their miniature rooms. Mrs. Meyrick was reading aloud from a French book; she was a lively little woman, half French, half Scotch, with a pretty articulateness of speech that seemed to make daylight in her hearer's understanding. Though she was not yet fifty, her rippling hair, covered by a quakerish net cap, was chiefly gray, but her eyebrows were brown as the bright eyes below them; her black dress, almost like a priest's cassock with its rows of buttons, suited a neat figure hardly five feet high. The daughters were to match the mother, except that Mab had Hans' light hair and complexion, with a bossy, irregular brow, and other quaintnesses that reminded one of him. Everything about them was compact, from the firm coils of their hair, fastened back _ la Chinoise_, to their gray skirts in Puritan nonconformity with the fashion, which at that time would have demanded that four feminine circumferences should fill all the free space in the front parlor. All four, if they had been wax-work, might have been packed easily in a fashionable lady's traveling trunk. Their faces seemed full of speech, as if their minds had been shelled, after the manner of horse-chestnuts, and become brightly visible. The only large thing of its kind in the room was Hafiz, the Persian cat, comfortably poised on the brown leather back of a chair, and opening his large eyes now and then to see that the lower animals were not in any mischief.\nThe book Mrs. Meyrick had before her was Erckmann-Chatrian's _Historie d'un Conscrit_. She had just finished reading it aloud, and Mab, who had let her work fall on the ground while she stretched her head forward and fixed her eyes on the reader, exclaimed,\n\"I think that is the finest story in the world.\"\n\"Of course, Mab!\" said Amy, \"it is the last you have heard. Everything that pleases you is the best in its turn.\"\n\"It is hardly to be called a story,\" said Kate. \"It is a bit of history brought near us with a strong telescope. We can see the soldiers' faces: no, it is more than that--we can hear everything--we can almost hear their hearts beat.\"\n\"I don't care what you call it,\" said Mab, flirting away her thimble. \"Call it a chapter in Revelations. It makes me want to do something good, something grand. It makes me so sorry for everybody. It makes me like Schiller--I want to take the world in my arms and kiss it. I must kiss you instead, little mother!\" She threw her arms round her mother's neck.\n\"Whenever you are in that mood, Mab, down goes your work,\" said Amy. \"It would be doing something good to finish your cushion without soiling it.\"\n\"Oh--oh--oh!\" groaned Mab, as she stooped to pick up her work and thimble. \"I wish I had three wounded conscripts to take care of.\"\n\"You would spill their beef tea while you were talking,\" said Amy.\n\"Poor Mab! don't be hard on her,\" said the mother. \"Give me the embroidery now, child. You go on with your enthusiasm, and I will go on with the pink and white poppy.\"\n\"Well, ma, I think you are more caustic than Amy,\" said Kate, while she drew her head back to look at her drawing.\n\"Oh--oh--oh!\" cried Mab again, rising and stretching her arms. \"I wish something wonderful would happen. I feel like the deluge. The waters of the great deep are broken up, and the windows of heaven are opened. I must sit down and play the scales.\"\nMab was opening the piano while the others were laughing at this climax, when a cab stopped before the house, and there forthwith came a quick rap of the knocker.\n\"Dear me!\" said Mrs. Meyrick, starting up, \"it is after ten, and Phoebe is gone to bed.\" She hastened out, leaving the parlor door open.\n\"Mr. Deronda!\" The girls could hear this exclamation from their mamma. Mab clasped her hands, saying in a loud whisper, \"There now! something _is_ going to happen.\" Kate and Amy gave up their work in amazement. But Deronda's tone in reply was so low that they could not hear his words, and Mrs. Meyrick immediately closed the parlor door.\n\"I know I am trusting to your goodness in a most extraordinary way,\" Deronda went on, after giving his brief narrative; \"but you can imagine how helpless I feel with a young creature like this on my hands. I could not go with her among strangers, and in her nervous state I should dread taking her into a house full of servants. I have trusted to your mercy. I hope you will not think my act unwarrantable.\"\n\"On the contrary. You have honored me by trusting me. I see your difficulty. Pray bring her in. I will go and prepare the girls.\"\nWhile Deronda went back to the cab, Mrs. Meyrick turned into the parlor again and said: \"Here is somebody to take care of instead of your wounded conscripts, Mab: a poor girl who was going to drown herself in despair. Mr. Deronda found her only just in time to save her. He brought her along in his boat, and did not know what else it would be safe to do with her, so he has trusted us and brought her here. It seems she is a Jewess, but quite refined, he says--knowing Italian and music.\"\nThe three girls, wondering and expectant, came forward and stood near each other in mute confidence that they were all feeling alike under this appeal to their compassion. Mab looked rather awe-stricken, as if this answer to her wish were something preternatural.\nMeanwhile Deronda going to the door of the cab where the pale face was now gazing out with roused observation, said, \"I have brought you to some of the kindest people in the world: there are daughters like you. It is a happy home. Will you let me take you to them?\"\nShe stepped out obediently, putting her hand in his and forgetting her hat; and when Deronda led her into the full light of the parlor where the four little women stood awaiting her, she made a picture that would have stirred much duller sensibilities than theirs. At first she was a little dazed by the sudden light, and before she had concentrated her glance he had put her hand into the mother's. He was inwardly rejoicing that the Meyricks were so small: the dark-curled head was the highest among them. The poor wanderer could not be afraid of these gentle faces so near hers: and now she was looking at each of them in turn while the mother said, \"You must be weary, poor child.\"\n\"We will take care of you--we will comfort you--we will love you,\" cried Mab, no longer able to restrain herself, and taking the small right hand caressingly between both her own. This gentle welcoming warmth was penetrating the bewildered one: she hung back just enough to see better the four faces in front of her, whose good will was being reflected in hers, not in any smile, but in that undefinable change which tells us that anxiety is passing in contentment. For an instant she looked up at Deronda, as if she were referring all this mercy to him, and then again turning to Mrs. Meyrick, said with more collectedness in her sweet tones than he had heard before,\n\"I am a stranger. I am a Jewess. You might have thought I was wicked.\"\n\"No, we are sure you are good,\" burst out Mab.\n\"We think no evil of you, poor child. You shall be safe with us,\" said Mrs. Meyrick. \"Come now and sit down. You must have some food, and then you must go to rest.\"\nThe stranger looked up again at Deronda, who said,\n\"You will have no more fears with these friends? You will rest to-night?\"\n\"Oh, I should not fear. I should rest. I think these are the ministering angels.\"\nMrs. Meyrick wanted to lead her to seat, but again hanging back gently, the poor weary thing spoke as if with a scruple at being received without a further account of herself.\n\"My name is Mirah Lapidoth. I am come a long way, all the way from Prague by myself. I made my escape. I ran away from dreadful things. I came to find my mother and brother in London. I had been taken from my mother when I was little, but I thought I could find her again. I had trouble--the houses were all gone--I could not find her. It has been a long while, and I had not much money. That is why I am in distress.\"\n\"Our mother will be good to you,\" cried Mab. \"See what a nice little mother she is!\"\n\"Do sit down now,\" said Kate, moving a chair forward, while Amy ran to get some tea.\nMirah resisted no longer, but seated herself with perfect grace, crossing her little feet, laying her hands one over the other on her lap, and looking at her friends with placid reverence; whereupon Hafiz, who had been watching the scene restlessly came forward with tail erect and rubbed himself against her ankles. Deronda felt it time to go.\n\"Will you allow me to come again and inquire--perhaps at five to-morrow?\" he said to Mrs. Meyrick.\n\"Yes, pray; we shall have had time to make acquaintance then.\"\n\"Good-bye,\" said Deronda, looking down at Mirah, and putting out his hand. She rose as she took it, and the moment brought back to them both strongly the other moment when she had first taken that outstretched hand. She lifted her eyes to his and said with reverential fervor, \"The God of our fathers bless you and deliver you from all evil as you have delivered me. I did not believe there was any man so good. None before have thought me worthy of the best. You found me poor and miserable, yet you have given me the best.\"\nDeronda could not speak, but with silent adieux to the Meyricks, hurried away.",
        "paragraph_chars": [
            [
                0,
                251
            ],
            [
                251,
                381
            ],
            [
                381,
                861
            ],
            [
                861,
                1371
            ],
            [
                1371,
                2967
            ],
            [
                2967,
                3758
            ],
            [
                3758,
                5348
            ],
            [
                5348,
                5606
            ],
            [
                5606,
                5655
            ],
            [
                5655,
                5769
            ],
            [
                5769,
                6003
            ],
            [
                6003,
                6361
            ],
            [
                6361,
                6508
            ],
            [
                6508,
                6640
            ],
            [
                6640,
                6707
            ],
            [
                6707,
                6875
            ],
            [
                6875,
                6990
            ],
            [
                6990,
                7239
            ],
            [
                7239,
                7402
            ],
            [
                7402,
                7539
            ],
            [
                7539,
                7878
            ],
            [
                7878,
                8286
            ],
            [
                8286,
                8416
            ],
            [
                8416,
                8906
            ],
            [
                8906,
                9170
            ],
            [
                9170,
                9436
            ],
            [
                9436,
                10122
            ],
            [
                10122,
                10791
            ],
            [
                10791,
                10862
            ],
            [
                10862,
                10909
            ],
            [
                10909,
                11074
            ],
            [
                11074,
                11125
            ],
            [
                11125,
                11199
            ],
            [
                11199,
                11281
            ],
            [
                11281,
                11457
            ],
            [
                11457,
                11876
            ],
            [
                11876,
                11961
            ],
            [
                11961,
                12046
            ],
            [
                12046,
                12391
            ],
            [
                12391,
                12490
            ],
            [
                12490,
                12553
            ],
            [
                12553,
                13079
            ],
            [
                13079,
                13157
            ]
        ],
        "segment_chars": [
            [
                0,
                251
            ],
            [
                251,
                381
            ],
            [
                381,
                652
            ],
            [
                652,
                861
            ],
            [
                861,
                1371
            ],
            [
                1371,
                1734
            ],
            [
                1734,
                1986
            ],
            [
                1986,
                2048
            ],
            [
                2048,
                2300
            ],
            [
                2300,
                2719
            ],
            [
                2719,
                2967
            ],
            [
                2967,
                3111
            ],
            [
                3111,
                3436
            ],
            [
                3436,
                3618
            ],
            [
                3618,
                3758
            ],
            [
                3758,
                3855
            ],
            [
                3855,
                3933
            ],
            [
                3933,
                4140
            ],
            [
                4140,
                4416
            ],
            [
                4416,
                4588
            ],
            [
                4588,
                4877
            ],
            [
                4877,
                4985
            ],
            [
                4985,
                5122
            ],
            [
                5122,
                5348
            ],
            [
                5348,
                5435
            ],
            [
                5435,
                5606
            ],
            [
                5606,
                5655
            ],
            [
                5655,
                5673
            ],
            [
                5673,
                5715
            ],
            [
                5715,
                5769
            ],
            [
                5769,
                5817
            ],
            [
                5817,
                5882
            ],
            [
                5882,
                6003
            ],
            [
                6003,
                6073
            ],
            [
                6073,
                6108
            ],
            [
                6108,
                6164
            ],
            [
                6164,
                6200
            ],
            [
                6200,
                6276
            ],
            [
                6276,
                6317
            ],
            [
                6317,
                6361
            ],
            [
                6361,
                6430
            ],
            [
                6430,
                6508
            ],
            [
                6508,
                6522
            ],
            [
                6522,
                6583
            ],
            [
                6583,
                6640
            ],
            [
                6640,
                6707
            ],
            [
                6707,
                6718
            ],
            [
                6718,
                6758
            ],
            [
                6758,
                6794
            ],
            [
                6794,
                6875
            ],
            [
                6875,
                6990
            ],
            [
                6990,
                7004
            ],
            [
                7004,
                7053
            ],
            [
                7053,
                7095
            ],
            [
                7095,
                7119
            ],
            [
                7119,
                7201
            ],
            [
                7201,
                7239
            ],
            [
                7239,
                7402
            ],
            [
                7402,
                7413
            ],
            [
                7413,
                7491
            ],
            [
                7491,
                7539
            ],
            [
                7539,
                7544
            ],
            [
                7544,
                7554
            ],
            [
                7554,
                7610
            ],
            [
                7610,
                7671
            ],
            [
                7671,
                7704
            ],
            [
                7704,
                7750
            ],
            [
                7750,
                7878
            ],
            [
                7878,
                8084
            ],
            [
                8084,
                8207
            ],
            [
                8207,
                8237
            ],
            [
                8237,
                8286
            ],
            [
                8286,
                8304
            ],
            [
                8304,
                8340
            ],
            [
                8340,
                8363
            ],
            [
                8363,
                8382
            ],
            [
                8382,
                8416
            ],
            [
                8416,
                8634
            ],
            [
                8634,
                8687
            ],
            [
                8687,
                8824
            ],
            [
                8824,
                8906
            ],
            [
                8906,
                9078
            ],
            [
                9078,
                9170
            ],
            [
                9170,
                9381
            ],
            [
                9381,
                9401
            ],
            [
                9401,
                9436
            ],
            [
                9436,
                9701
            ],
            [
                9701,
                9836
            ],
            [
                9836,
                9944
            ],
            [
                9944,
                10122
            ],
            [
                10122,
                10302
            ],
            [
                10302,
                10588
            ],
            [
                10588,
                10791
            ],
            [
                10791,
                10809
            ],
            [
                10809,
                10824
            ],
            [
                10824,
                10862
            ],
            [
                10862,
                10909
            ],
            [
                10909,
                10947
            ],
            [
                10947,
                10994
            ],
            [
                10994,
                11018
            ],
            [
                11018,
                11074
            ],
            [
                11074,
                11125
            ],
            [
                11125,
                11174
            ],
            [
                11174,
                11199
            ],
            [
                11199,
                11223
            ],
            [
                11223,
                11238
            ],
            [
                11238,
                11281
            ],
            [
                11281,
                11457
            ],
            [
                11457,
                11485
            ],
            [
                11485,
                11542
            ],
            [
                11542,
                11560
            ],
            [
                11560,
                11593
            ],
            [
                11593,
                11641
            ],
            [
                11641,
                11730
            ],
            [
                11730,
                11793
            ],
            [
                11793,
                11845
            ],
            [
                11845,
                11876
            ],
            [
                11876,
                11921
            ],
            [
                11921,
                11961
            ],
            [
                11961,
                12046
            ],
            [
                12046,
                12363
            ],
            [
                12363,
                12391
            ],
            [
                12391,
                12465
            ],
            [
                12465,
                12490
            ],
            [
                12490,
                12553
            ],
            [
                12553,
                12628
            ],
            [
                12628,
                12769
            ],
            [
                12769,
                12920
            ],
            [
                12920,
                12965
            ],
            [
                12965,
                13013
            ],
            [
                13013,
                13079
            ],
            [
                13079,
                13157
            ]
        ],
        "overlap_chars": [
            [
                381,
                430
            ],
            [
                434,
                652
            ],
            [
                652,
                679
            ],
            [
                686,
                742
            ],
            [
                788,
                799
            ],
            [
                805,
                861
            ],
            [
                861,
                910
            ],
            [
                1000,
                1003
            ],
            [
                1032,
                1063
            ],
            [
                1073,
                1089
            ],
            [
                1110,
                1136
            ],
            [
                1186,
                1197
            ],
            [
                1218,
                1222
            ],
            [
                1167,
                1173
            ],
            [
                1223,
                1230
            ],
            [
                1279,
                1285
            ],
            [
                1245,
                1253
            ],
            [
                1369,
                1371
            ],
            [
                1371,
                1409
            ],
            [
                1471,
                1507
            ],
            [
                1535,
                1556
            ],
            [
                1533,
                1534
            ],
            [
                1557,
                1586
            ],
            [
                1591,
                1687
            ],
            [
                1732,
                1734
            ],
            [
                1734,
                1750
            ],
            [
                1762,
                1767
            ],
            [
                1771,
                1776
            ],
            [
                1785,
                1799
            ],
            [
                1811,
                1918
            ],
            [
                1939,
                1986
            ],
            [
                1986,
                2029
            ],
            [
                2046,
                2048
            ],
            [
                2048,
                2076
            ],
            [
                2080,
                2084
            ],
            [
                2132,
                2137
            ],
            [
                2088,
                2097
            ],
            [
                2167,
                2184
            ],
            [
                2199,
                2218
            ],
            [
                2234,
                2299
            ],
            [
                2719,
                2854
            ],
            [
                2863,
                2907
            ],
            [
                2965,
                2966
            ],
            [
                2967,
                3024
            ],
            [
                3026,
                3069
            ],
            [
                3086,
                3091
            ],
            [
                3101,
                3111
            ],
            [
                3111,
                3115
            ],
            [
                3117,
                3132
            ],
            [
                3141,
                3221
            ],
            [
                3263,
                3275
            ],
            [
                3327,
                3331
            ],
            [
                3306,
                3326
            ],
            [
                3377,
                3436
            ],
            [
                3618,
                3643
            ],
            [
                3668,
                3672
            ],
            [
                3680,
                3758
            ],
            [
                3855,
                3868
            ],
            [
                3875,
                3933
            ],
            [
                3933,
                4079
            ],
            [
                4138,
                4140
            ],
            [
                4140,
                4224
            ],
            [
                4296,
                4313
            ],
            [
                4372,
                4415
            ],
            [
                4416,
                4429
            ],
            [
                4444,
                4454
            ],
            [
                4586,
                4588
            ],
            [
                4588,
                4657
            ],
            [
                4688,
                4696
            ],
            [
                4702,
                4872
            ],
            [
                4875,
                4877
            ],
            [
                5122,
                5216
            ],
            [
                5243,
                5267
            ],
            [
                5274,
                5348
            ],
            [
                5348,
                5408
            ],
            [
                5419,
                5432
            ],
            [
                5435,
                5464
            ],
            [
                5468,
                5482
            ],
            [
                5595,
                5604
            ],
            [
                5606,
                5655
            ],
            [
                5655,
                5673
            ],
            [
                5673,
                5715
            ],
            [
                5715,
                5769
            ],
            [
                5769,
                5817
            ],
            [
                5817,
                5880
            ],
            [
                5916,
                5917
            ],
            [
                5934,
                5938
            ],
            [
                5882,
                5912
            ],
            [
                6000,
                6003
            ],
            [
                6003,
                6044
            ],
            [
                6071,
                6073
            ],
            [
                6108,
                6164
            ],
            [
                6227,
                6276
            ],
            [
                6276,
                6317
            ],
            [
                6317,
                6361
            ],
            [
                6361,
                6429
            ],
            [
                6508,
                6509
            ],
            [
                6517,
                6522
            ],
            [
                6522,
                6534
            ],
            [
                6542,
                6545
            ],
            [
                6550,
                6557
            ],
            [
                6558,
                6560
            ],
            [
                6581,
                6583
            ],
            [
                6583,
                6640
            ],
            [
                6640,
                6667
            ],
            [
                6672,
                6707
            ],
            [
                6707,
                6718
            ],
            [
                6718,
                6758
            ],
            [
                6758,
                6792
            ],
            [
                6990,
                6991
            ],
            [
                6999,
                7004
            ],
            [
                7004,
                7053
            ],
            [
                7053,
                7095
            ],
            [
                7095,
                7119
            ],
            [
                7119,
                7201
            ],
            [
                7201,
                7239
            ],
            [
                7239,
                7264
            ],
            [
                7312,
                7358
            ],
            [
                7369,
                7375
            ],
            [
                7382,
                7402
            ],
            [
                7402,
                7413
            ],
            [
                7413,
                7431
            ],
            [
                7445,
                7461
            ],
            [
                7491,
                7524
            ],
            [
                7528,
                7539
            ],
            [
                7539,
                7544
            ],
            [
                7544,
                7554
            ],
            [
                7554,
                7563
            ],
            [
                7608,
                7610
            ],
            [
                7610,
                7644
            ],
            [
                7650,
                7671
            ],
            [
                7671,
                7680
            ],
            [
                7682,
                7684
            ],
            [
                7686,
                7704
            ],
            [
                7750,
                7753
            ],
            [
                7794,
                7813
            ],
            [
                7754,
                7763
            ],
            [
                7785,
                7788
            ],
            [
                7772,
                7777
            ],
            [
                7823,
                7868
            ],
            [
                7872,
                7878
            ],
            [
                7878,
                7919
            ],
            [
                7927,
                7954
            ],
            [
                7962,
                8043
            ],
            [
                8066,
                8070
            ],
            [
                8046,
                8060
            ],
            [
                8071,
                8084
            ],
            [
                8084,
                8095
            ],
            [
                8104,
                8207
            ],
            [
                8207,
                8235
            ],
            [
                8304,
                8312
            ],
            [
                8321,
                8340
            ],
            [
                8340,
                8363
            ],
            [
                8363,
                8380
            ],
            [
                8416,
                8484
            ],
            [
                8494,
                8634
            ],
            [
                8634,
                8655
            ],
            [
                8661,
                8687
            ],
            [
                8687,
                8689
            ],
            [
                8725,
                8824
            ],
            [
                8824,
                8876
            ],
            [
                8886,
                8906
            ],
            [
                8906,
                8921
            ],
            [
                9016,
                9020
            ],
            [
                8923,
                8946
            ],
            [
                9078,
                9108
            ],
            [
                9116,
                9139
            ],
            [
                9168,
                9170
            ],
            [
                9170,
                9187
            ],
            [
                9194,
                9196
            ],
            [
                9209,
                9240
            ],
            [
                9245,
                9255
            ],
            [
                9279,
                9381
            ],
            [
                9381,
                9401
            ],
            [
                9401,
                9436
            ],
            [
                9436,
                9545
            ],
            [
                9551,
                9567
            ],
            [
                9617,
                9692
            ],
            [
                9577,
                9580
            ],
            [
                9797,
                9799
            ],
            [
                9804,
                9834
            ],
            [
                9752,
                9753
            ],
            [
                9843,
                9944
            ],
            [
                9944,
                10003
            ],
            [
                10016,
                10122
            ],
            [
                10122,
                10147
            ],
            [
                10149,
                10164
            ],
            [
                10183,
                10199
            ],
            [
                10268,
                10270
            ],
            [
                10247,
                10256
            ],
            [
                10263,
                10267
            ],
            [
                10288,
                10302
            ],
            [
                10302,
                10306
            ],
            [
                10314,
                10370
            ],
            [
                10717,
                10721
            ],
            [
                10700,
                10716
            ],
            [
                10722,
                10789
            ],
            [
                10791,
                10809
            ],
            [
                10809,
                10824
            ],
            [
                10824,
                10862
            ],
            [
                10862,
                10909
            ],
            [
                10909,
                10947
            ],
            [
                10947,
                10994
            ],
            [
                10994,
                11018
            ],
            [
                11018,
                11060
            ],
            [
                11067,
                11074
            ],
            [
                11074,
                11123
            ],
            [
                11125,
                11172
            ],
            [
                11199,
                11223
            ],
            [
                11238,
                11281
            ],
            [
                11281,
                11315
            ],
            [
                11391,
                11392
            ],
            [
                11316,
                11325
            ],
            [
                11332,
                11385
            ],
            [
                11427,
                11457
            ],
            [
                11457,
                11485
            ],
            [
                11485,
                11542
            ],
            [
                11560,
                11593
            ],
            [
                11593,
                11641
            ],
            [
                11641,
                11730
            ],
            [
                11745,
                11769
            ],
            [
                11771,
                11793
            ],
            [
                11793,
                11845
            ],
            [
                11845,
                11876
            ],
            [
                11876,
                11921
            ],
            [
                11921,
                11961
            ],
            [
                11961,
                12046
            ],
            [
                12046,
                12109
            ],
            [
                12233,
                12250
            ],
            [
                12295,
                12363
            ],
            [
                12363,
                12378
            ],
            [
                12379,
                12391
            ],
            [
                12391,
                12417
            ],
            [
                12424,
                12435
            ],
            [
                12455,
                12456
            ],
            [
                12437,
                12452
            ],
            [
                12462,
                12465
            ],
            [
                12465,
                12467
            ],
            [
                12476,
                12490
            ],
            [
                12490,
                12494
            ],
            [
                12500,
                12553
            ],
            [
                12553,
                12628
            ],
            [
                12628,
                12769
            ],
            [
                12769,
                12772
            ],
            [
                12800,
                12826
            ],
            [
                12828,
                12829
            ],
            [
                12830,
                12920
            ],
            [
                12920,
                12965
            ],
            [
                12965,
                13013
            ],
            [
                13013,
                13079
            ],
            [
                13079,
                13157
            ]
        ],
        "row_chars": [
            [
                0,
                251
            ],
            [
                251,
                381
            ],
            [
                381,
                652
            ],
            [
                652,
                861
            ],
            [
                861,
                1371
            ],
            [
                1371,
                1734
            ],
            [
                1734,
                1986
            ],
            [
                1986,
                2048
            ],
            [
                2048,
                2300
            ],
            [
                2300,
                2719
            ],
            [
                2719,
                2967
            ],
            [
                2967,
                3111
            ],
            [
                3111,
                3436
            ],
            [
                3436,
                3618
            ],
            [
                3618,
                3758
            ],
            [
                3758,
                3855
            ],
            [
                3855,
                3933
            ],
            [
                3933,
                4140
            ],
            [
                4140,
                4416
            ],
            [
                4416,
                4588
            ],
            [
                4588,
                4877
            ],
            [
                4877,
                4985
            ],
            [
                4985,
                5122
            ],
            [
                5122,
                5348
            ],
            [
                5348,
                5435
            ],
            [
                5435,
                5606
            ],
            [
                5606,
                5655
            ],
            [
                5655,
                5673
            ],
            [
                5673,
                5715
            ],
            [
                5715,
                5769
            ],
            [
                5769,
                5817
            ],
            [
                5817,
                6003
            ],
            [
                6003,
                6073
            ],
            [
                6073,
                6108
            ],
            [
                6108,
                6164
            ],
            [
                6164,
                6200
            ],
            [
                6200,
                6276
            ],
            [
                6276,
                6317
            ],
            [
                6317,
                6361
            ],
            [
                6361,
                6430
            ],
            [
                6430,
                6508
            ],
            [
                6508,
                6522
            ],
            [
                6522,
                6583
            ],
            [
                6583,
                6640
            ],
            [
                6640,
                6707
            ],
            [
                6707,
                6718
            ],
            [
                6718,
                6758
            ],
            [
                6758,
                6794
            ],
            [
                6794,
                6875
            ],
            [
                6875,
                6990
            ],
            [
                6990,
                7004
            ],
            [
                7004,
                7053
            ],
            [
                7053,
                7095
            ],
            [
                7095,
                7119
            ],
            [
                7119,
                7201
            ],
            [
                7201,
                7239
            ],
            [
                7239,
                7402
            ],
            [
                7402,
                7413
            ],
            [
                7413,
                7491
            ],
            [
                7491,
                7539
            ],
            [
                7539,
                7544
            ],
            [
                7544,
                7554
            ],
            [
                7554,
                7610
            ],
            [
                7610,
                7671
            ],
            [
                7671,
                7704
            ],
            [
                7704,
                7750
            ],
            [
                7750,
                7878
            ],
            [
                7878,
                8084
            ],
            [
                8084,
                8207
            ],
            [
                8207,
                8237
            ],
            [
                8237,
                8286
            ],
            [
                8286,
                8304
            ],
            [
                8304,
                8340
            ],
            [
                8340,
                8363
            ],
            [
                8363,
                8382
            ],
            [
                8382,
                8416
            ],
            [
                8416,
                8634
            ],
            [
                8634,
                8687
            ],
            [
                8687,
                8824
            ],
            [
                8824,
                8906
            ],
            [
                8906,
                9170
            ],
            [
                9170,
                9381
            ],
            [
                9381,
                9401
            ],
            [
                9401,
                9436
            ],
            [
                9436,
                9701
            ],
            [
                9701,
                9944
            ],
            [
                9944,
                10122
            ],
            [
                10122,
                10302
            ],
            [
                10302,
                10791
            ],
            [
                10791,
                10809
            ],
            [
                10809,
                10824
            ],
            [
                10824,
                10862
            ],
            [
                10862,
                10909
            ],
            [
                10909,
                10947
            ],
            [
                10947,
                10994
            ],
            [
                10994,
                11018
            ],
            [
                11018,
                11074
            ],
            [
                11074,
                11125
            ],
            [
                11125,
                11174
            ],
            [
                11174,
                11199
            ],
            [
                11199,
                11223
            ],
            [
                11223,
                11238
            ],
            [
                11238,
                11281
            ],
            [
                11281,
                11457
            ],
            [
                11457,
                11485
            ],
            [
                11485,
                11542
            ],
            [
                11542,
                11560
            ],
            [
                11560,
                11593
            ],
            [
                11593,
                11641
            ],
            [
                11641,
                11730
            ],
            [
                11730,
                11793
            ],
            [
                11793,
                11845
            ],
            [
                11845,
                11876
            ],
            [
                11876,
                11921
            ],
            [
                11921,
                11961
            ],
            [
                11961,
                12046
            ],
            [
                12046,
                12363
            ],
            [
                12363,
                12391
            ],
            [
                12391,
                12465
            ],
            [
                12465,
                12490
            ],
            [
                12490,
                12553
            ],
            [
                12553,
                12628
            ],
            [
                12628,
                12769
            ],
            [
                12769,
                12920
            ],
            [
                12920,
                12965
            ],
            [
                12965,
                13013
            ],
            [
                13013,
                13079
            ],
            [
                13079,
                13157
            ]
        ]
    },
    "abridged": {
        "text": "Mrs. Meyrick's house was not noisy: the front parlour looked on the river, and the back on gardens, so that though she was reading aloud to her daughters, the window could be left open to freshen the air of the small double room where a lamp and two candles were burning. The candles were on a table for Kate, who was drawing illustrations for a publisher; Amy and Mab were embroidering satin cushions for \"the great world.\"\nOutside, the house looked very narrow and shabby, but many such grim-walled slices of our foggy London are the homes of a culture where poverty has put anything like vulgar display out of the question.\nThe Meyricks' was a home of that kind: its interior was filled with objects which, for the mother, held memories of her marriage, and for the young ones seemed as necessary and uncriticised a part of their world as the stars. Mrs. Meyrick had stinted on other things so that she might keep some engravings specially cherished by her husband; and the narrow spaces of wall held a world history which the children had early learned by heart. The chairs and tables were also old friends. But in these two little parlours with cheap furniture, there was space for a wide-glancing life, opened to the highest things in music, painting and poetry.\nThe Meyricks had their little oddities, streaks of eccentricity from the mother's blood as well as the father's, their minds being like mediaeval houses with unexpected recesses and openings. But mother and daughters were all united by a triple bond - family love; admiration for the finest work; and industry. Hans's desire to spend his money in making their lives more luxurious had been resisted by all of them, saving him from regrets over his yearning for art that would by-and-by oblige him to give up his fellowship. It was enough for them to have only a grand treat of opera-going (to the gallery) when Hans came home on a visit.\nThey were all small, and so in due proportion to their miniature rooms. Mrs. Meyrick was reading aloud from a French book; she was a lively little woman, half French, half Scotch, with a pretty articulateness of speech. Though she was not yet fifty, her rippling hair, covered by a quakerish net cap, was grey; her black dress suited a neat figure hardly five feet high.\nThe daughters matched the mother. Everything about them was compact, from the firm coils of their hair, to their grey skirts in Puritan nonconformity with the fashion, which at that time would have demanded that four feminine circumferences should fill all the free space in the front parlour. The only large thing of its kind in the room was Hafiz, the Persian cat, comfortably poised on a chair, and opening his eyes now and then to see that the lower animals were not in any mischief.\nThe book Mrs. Meyrick had before her was Erckmann-Chatrian's Historie d'un Conscrit. She had just finished reading aloud, and Mab exclaimed-\n\"I think that is the finest story in the world.\"\n\"Of course, Mab!\" said Amy, \"it is the last you have heard. Everything that pleases you is the best in its turn.\"\n\"It is hardly to be called a story,\" said Kate. \"It is a bit of history brought near us with a strong telescope, so that we can see the soldiers' faces.\"\n\"I don't care what you call it,\" said Mab. \"It makes me want to do something good, something grand. I want to take the world in my arms and kiss it. I must kiss you instead, little mother!\" She threw her arms round her mother's neck.\n\"Whenever you are in that mood, Mab, down goes your work,\" said Amy.\n\"Oh!\" groaned Mab, stooping to pick it up. \"I wish I had three wounded conscripts to take care of.\"\n\"You would spill their beef-tea while you were talking,\" said Amy.\n\"Poor Mab! don't be hard on her,\" said the mother. \"Give me the embroidery now, child.\"\n\"Oh!\" cried Mab again, rising and stretching her arms. \"I wish something wonderful would happen. I feel like the deluge. The waters of the great deep are broken up, and the windows of heaven are opened. I must sit down and play the scales.\"\nMab was opening the piano when a cab stopped before the house, and there came a rap of the knocker.\n\"Dear me!\" said Mrs. Meyrick, \"it is after ten!\" She hastened out, leaving the parlour door open.\n\"Mr. Deronda!\" the girls heard her exclaim. Mab clasped her hands, saying in a whisper, \"There now! Something is going to happen.\" But they could not hear Deronda's low reply, and Mrs. Meyrick immediately closed the parlour door.\n\"I know I am trusting to your goodness in an extraordinary way,\" Deronda was saying, after giving his brief narrative; \"but you can imagine how helpless I feel with this young creature on my hands. I could not take her among strangers, and in her nervous state I should dread taking her into a house full of servants. I have trusted to your mercy.\"\n\"You have honoured me by trusting me. I see your difficulty. Pray bring her in.\"\nWhile Deronda went back to the cab, Mrs. Meyrick turned into the parlour and said: \"Here is somebody to take care of instead of your wounded conscripts, Mab: a poor girl who was going to drown herself in despair. Mr. Deronda found her just in time to save her. He did not know what else it would be safe to do with her, so he has trusted us and brought her here. It seems she is a Jewess, but quite refined, he says - knowing Italian and music.\"\nThe three girls were wondering and expectant: Mab looked rather awe-stricken at this answer to her wish.\nMeanwhile Deronda, returning to the cab where the pale face was gazing out, said, \"I have brought you to some of the kindest people in the world: there are daughters like you. It is a happy home. Will you let me take you to them?\"\nShe stepped out obediently, putting her hand in his and forgetting her hat; and when Deronda led her into the light of the parlour, she made a picture that would have stirred much duller sensibilities than the Meyricks'. He put her hand into the mother's, inwardly rejoicing that the Meyricks were so small: the dark-curled head was the highest among them. The poor wanderer could not be afraid of these gentle faces: and now she was looking at each of them in turn while the mother said, \"You must be weary, poor child.\"\n\"We will take care of you - we will comfort you,\" cried Mab, caressing the small hand with both her own. This welcoming warmth was penetrating the bewildered one: she said to Mrs. Meyrick, with more collectedness in her sweet tones than he had heard before-\n\"I am a stranger. I am a Jewess. You might have thought I was wicked.\"\n\"No, we are sure you are good,\" burst out Mab.\n\"We think no evil of you, poor child. You shall be safe with us,\" said Mrs. Meyrick. \"Come now and sit down. You must have some food, and then you must rest.\"\nThe stranger looked up again at Deronda, who said-\n\"You will have no more fears with these friends?\"\n\"Oh, I should not fear. I think these are the ministering angels.\"\nMrs. Meyrick wanted to lead her to a seat, but hanging back gently, the poor weary thing spoke as if needing to give a further account of herself.\n\"My name is Mirah Lapidoth. I am come a long way, all the way from Prague by myself. I ran away from dreadful things. I came to find my mother and brother in London. I had been taken from my mother when I was little, but I thought I could find her again. But the houses were all gone - I could not find her. It has been a long while, and I had not much money. That is why I am in distress.\"\n\"Our mother will be good to you,\" cried Mab. \"See what a nice little mother she is!\"\n\"Do sit down now,\" said Kate, moving a chair forward, while Amy ran to get some tea.\nMirah resisted no longer, but seated herself with perfect grace; whereupon Hafiz came forward with tail erect and rubbed himself against her ankles. Deronda felt it was time to go.\n\"Will you allow me to come and inquire - perhaps at five tomorrow?\" he asked Mrs. Meyrick.\n\"Yes; we shall have had time to make acquaintance then.\"\n\"Good-bye,\" said Deronda, looking down at Mirah, and putting out his hand. She rose as she took it, and the moment brought back to them both strongly the other moment when she had first taken that outstretched hand. She said with reverential fervour,\n\"The God of our fathers bless you and deliver you from all evil as you have delivered me. I did not believe there was any man so good. None before have thought me worthy of the best. You found me poor and miserable, yet you have given me the best.\"\nDeronda could not speak, but with silent adieux to the Meyricks, hurried away.",
        "paragraph_chars": [
            [
                0,
                425
            ],
            [
                425,
                627
            ],
            [
                627,
                1269
            ],
            [
                1269,
                1907
            ],
            [
                1907,
                2278
            ],
            [
                2278,
                2766
            ],
            [
                2766,
                2907
            ],
            [
                2907,
                2956
            ],
            [
                2956,
                3070
            ],
            [
                3070,
                3224
            ],
            [
                3224,
                3458
            ],
            [
                3458,
                3527
            ],
            [
                3527,
                3627
            ],
            [
                3627,
                3694
            ],
            [
                3694,
                3782
            ],
            [
                3782,
                4023
            ],
            [
                4023,
                4123
            ],
            [
                4123,
                4221
            ],
            [
                4221,
                4451
            ],
            [
                4451,
                4800
            ],
            [
                4800,
                4881
            ],
            [
                4881,
                5327
            ],
            [
                5327,
                5432
            ],
            [
                5432,
                5663
            ],
            [
                5663,
                6185
            ],
            [
                6185,
                6443
            ],
            [
                6443,
                6514
            ],
            [
                6514,
                6561
            ],
            [
                6561,
                6720
            ],
            [
                6720,
                6771
            ],
            [
                6771,
                6821
            ],
            [
                6821,
                6888
            ],
            [
                6888,
                7035
            ],
            [
                7035,
                7426
            ],
            [
                7426,
                7511
            ],
            [
                7511,
                7596
            ],
            [
                7596,
                7777
            ],
            [
                7777,
                7868
            ],
            [
                7868,
                7925
            ],
            [
                7925,
                8176
            ],
            [
                8176,
                8425
            ],
            [
                8425,
                8503
            ]
        ],
        "segment_chars": [
            [
                0,
                272
            ],
            [
                272,
                425
            ],
            [
                425,
                627
            ],
            [
                627,
                853
            ],
            [
                853,
                1067
            ],
            [
                1067,
                1112
            ],
            [
                1112,
                1269
            ],
            [
                1269,
                1461
            ],
            [
                1461,
                1580
            ],
            [
                1580,
                1793
            ],
            [
                1793,
                1907
            ],
            [
                1907,
                1979
            ],
            [
                1979,
                2127
            ],
            [
                2127,
                2278
            ],
            [
                2278,
                2312
            ],
            [
                2312,
                2572
            ],
            [
                2572,
                2766
            ],
            [
                2766,
                2851
            ],
            [
                2851,
                2907
            ],
            [
                2907,
                2956
            ],
            [
                2956,
                2974
            ],
            [
                2974,
                3016
            ],
            [
                3016,
                3070
            ],
            [
                3070,
                3118
            ],
            [
                3118,
                3224
            ],
            [
                3224,
                3267
            ],
            [
                3267,
                3324
            ],
            [
                3324,
                3373
            ],
            [
                3373,
                3414
            ],
            [
                3414,
                3458
            ],
            [
                3458,
                3527
            ],
            [
                3527,
                3533
            ],
            [
                3533,
                3570
            ],
            [
                3570,
                3627
            ],
            [
                3627,
                3694
            ],
            [
                3694,
                3705
            ],
            [
                3705,
                3745
            ],
            [
                3745,
                3782
            ],
            [
                3782,
                3788
            ],
            [
                3788,
                3837
            ],
            [
                3837,
                3879
            ],
            [
                3879,
                3903
            ],
            [
                3903,
                3985
            ],
            [
                3985,
                4023
            ],
            [
                4023,
                4123
            ],
            [
                4123,
                4134
            ],
            [
                4134,
                4172
            ],
            [
                4172,
                4221
            ],
            [
                4221,
                4226
            ],
            [
                4226,
                4236
            ],
            [
                4236,
                4265
            ],
            [
                4265,
                4321
            ],
            [
                4321,
                4352
            ],
            [
                4352,
                4451
            ],
            [
                4451,
                4649
            ],
            [
                4649,
                4769
            ],
            [
                4769,
                4800
            ],
            [
                4800,
                4838
            ],
            [
                4838,
                4861
            ],
            [
                4861,
                4881
            ],
            [
                4881,
                5094
            ],
            [
                5094,
                5142
            ],
            [
                5142,
                5244
            ],
            [
                5244,
                5327
            ],
            [
                5327,
                5432
            ],
            [
                5432,
                5608
            ],
            [
                5608,
                5628
            ],
            [
                5628,
                5663
            ],
            [
                5663,
                5884
            ],
            [
                5884,
                6020
            ],
            [
                6020,
                6185
            ],
            [
                6185,
                6290
            ],
            [
                6290,
                6443
            ],
            [
                6443,
                6461
            ],
            [
                6461,
                6476
            ],
            [
                6476,
                6514
            ],
            [
                6514,
                6561
            ],
            [
                6561,
                6599
            ],
            [
                6599,
                6646
            ],
            [
                6646,
                6670
            ],
            [
                6670,
                6720
            ],
            [
                6720,
                6771
            ],
            [
                6771,
                6821
            ],
            [
                6821,
                6845
            ],
            [
                6845,
                6888
            ],
            [
                6888,
                7035
            ],
            [
                7035,
                7063
            ],
            [
                7063,
                7120
            ],
            [
                7120,
                7153
            ],
            [
                7153,
                7201
            ],
            [
                7201,
                7290
            ],
            [
                7290,
                7343
            ],
            [
                7343,
                7395
            ],
            [
                7395,
                7426
            ],
            [
                7426,
                7471
            ],
            [
                7471,
                7511
            ],
            [
                7511,
                7596
            ],
            [
                7596,
                7745
            ],
            [
                7745,
                7777
            ],
            [
                7777,
                7845
            ],
            [
                7845,
                7868
            ],
            [
                7868,
                7925
            ],
            [
                7925,
                8000
            ],
            [
                8000,
                8141
            ],
            [
                8141,
                8176
            ],
            [
                8176,
                8266
            ],
            [
                8266,
                8311
            ],
            [
                8311,
                8359
            ],
            [
                8359,
                8425
            ],
            [
                8425,
                8503
            ]
        ],
        "overlap_chars": [
            [
                0,
                49
            ],
            [
                54,
                272
            ],
            [
                272,
                299
            ],
            [
                300,
                356
            ],
            [
                357,
                368
            ],
            [
                369,
                425
            ],
            [
                425,
                474
            ],
            [
                475,
                478
            ],
            [
                479,
                510
            ],
            [
                511,
                527
            ],
            [
                528,
                554
            ],
            [
                561,
                572
            ],
            [
                586,
                590
            ],
            [
                591,
                597
            ],
            [
                598,
                605
            ],
            [
                610,
                616
            ],
            [
                617,
                625
            ],
            [
                625,
                627
            ],
            [
                627,
                665
            ],
            [
                666,
                702
            ],
            [
                703,
                724
            ],
            [
                724,
                725
            ],
            [
                726,
                755
            ],
            [
                755,
                851
            ],
            [
                851,
                853
            ],
            [
                853,
                869
            ],
            [
                870,
                875
            ],
            [
                881,
                886
            ],
            [
                897,
                911
            ],
            [
                912,
                1019
            ],
            [
                1020,
                1067
            ],
            [
                1067,
                1110
            ],
            [
                1110,
                1112
            ],
            [
                1112,
                1140
            ],
            [
                1145,
                1149
            ],
            [
                1150,
                1155
            ],
            [
                1156,
                1165
            ],
            [
                1165,
                1182
            ],
            [
                1183,
                1202
            ],
            [
                1203,
                1268
            ],
            [
                1269,
                1404
            ],
            [
                1415,
                1459
            ],
            [
                1459,
                1460
            ],
            [
                1461,
                1518
            ],
            [
                1521,
                1564
            ],
            [
                1564,
                1569
            ],
            [
                1570,
                1580
            ],
            [
                1580,
                1584
            ],
            [
                1587,
                1602
            ],
            [
                1603,
                1683
            ],
            [
                1695,
                1707
            ],
            [
                1708,
                1712
            ],
            [
                1713,
                1733
            ],
            [
                1734,
                1793
            ],
            [
                1793,
                1818
            ],
            [
                1824,
                1828
            ],
            [
                1829,
                1907
            ],
            [
                1907,
                1920
            ],
            [
                1921,
                1979
            ],
            [
                1979,
                2125
            ],
            [
                2125,
                2127
            ],
            [
                2127,
                2211
            ],
            [
                2216,
                2233
            ],
            [
                2234,
                2277
            ],
            [
                2278,
                2291
            ],
            [
                2300,
                2310
            ],
            [
                2310,
                2312
            ],
            [
                2312,
                2381
            ],
            [
                2382,
                2390
            ],
            [
                2396,
                2566
            ],
            [
                2570,
                2572
            ],
            [
                2572,
                2666
            ],
            [
                2667,
                2691
            ],
            [
                2692,
                2766
            ],
            [
                2766,
                2826
            ],
            [
                2836,
                2849
            ],
            [
                2851,
                2880
            ],
            [
                2881,
                2895
            ],
            [
                2896,
                2905
            ],
            [
                2907,
                2956
            ],
            [
                2956,
                2974
            ],
            [
                2974,
                3016
            ],
            [
                3016,
                3070
            ],
            [
                3070,
                3118
            ],
            [
                3118,
                3181
            ],
            [
                3181,
                3182
            ],
            [
                3186,
                3190
            ],
            [
                3191,
                3221
            ],
            [
                3221,
                3224
            ],
            [
                3224,
                3265
            ],
            [
                3265,
                3267
            ],
            [
                3268,
                3324
            ],
            [
                3324,
                3373
            ],
            [
                3373,
                3414
            ],
            [
                3414,
                3458
            ],
            [
                3458,
                3526
            ],
            [
                3527,
                3528
            ],
            [
                3528,
                3533
            ],
            [
                3533,
                3545
            ],
            [
                3546,
                3549
            ],
            [
                3555,
                3562
            ],
            [
                3566,
                3568
            ],
            [
                3568,
                3570
            ],
            [
                3570,
                3627
            ],
            [
                3627,
                3654
            ],
            [
                3659,
                3694
            ],
            [
                3694,
                3705
            ],
            [
                3705,
                3745
            ],
            [
                3745,
                3779
            ],
            [
                3782,
                3783
            ],
            [
                3783,
                3788
            ],
            [
                3788,
                3837
            ],
            [
                3837,
                3879
            ],
            [
                3879,
                3903
            ],
            [
                3903,
                3985
            ],
            [
                3985,
                4023
            ],
            [
                4023,
                4048
            ],
            [
                4049,
                4095
            ],
            [
                4096,
                4102
            ],
            [
                4103,
                4123
            ],
            [
                4123,
                4134
            ],
            [
                4134,
                4152
            ],
            [
                4153,
                4169
            ],
            [
                4172,
                4205
            ],
            [
                4210,
                4221
            ],
            [
                4221,
                4226
            ],
            [
                4226,
                4236
            ],
            [
                4236,
                4245
            ],
            [
                4263,
                4265
            ],
            [
                4265,
                4299
            ],
            [
                4300,
                4321
            ],
            [
                4321,
                4330
            ],
            [
                4331,
                4333
            ],
            [
                4334,
                4352
            ],
            [
                4352,
                4355
            ],
            [
                4356,
                4375
            ],
            [
                4376,
                4385
            ],
            [
                4386,
                4389
            ],
            [
                4390,
                4395
            ],
            [
                4395,
                4440
            ],
            [
                4445,
                4451
            ],
            [
                4451,
                4492
            ],
            [
                4496,
                4523
            ],
            [
                4534,
                4615
            ],
            [
                4616,
                4620
            ],
            [
                4621,
                4635
            ],
            [
                4636,
                4649
            ],
            [
                4649,
                4660
            ],
            [
                4666,
                4769
            ],
            [
                4769,
                4797
            ],
            [
                4801,
                4809
            ],
            [
                4819,
                4838
            ],
            [
                4838,
                4861
            ],
            [
                4861,
                4878
            ],
            [
                4881,
                4949
            ],
            [
                4954,
                5094
            ],
            [
                5094,
                5115
            ],
            [
                5116,
                5142
            ],
            [
                5142,
                5144
            ],
            [
                5145,
                5244
            ],
            [
                5244,
                5296
            ],
            [
                5307,
                5327
            ],
            [
                5327,
                5342
            ],
            [
                5343,
                5347
            ],
            [
                5348,
                5371
            ],
            [
                5373,
                5403
            ],
            [
                5407,
                5430
            ],
            [
                5430,
                5432
            ],
            [
                5432,
                5449
            ],
            [
                5461,
                5463
            ],
            [
                5464,
                5495
            ],
            [
                5496,
                5506
            ],
            [
                5506,
                5608
            ],
            [
                5608,
                5628
            ],
            [
                5628,
                5663
            ],
            [
                5663,
                5772
            ],
            [
                5773,
                5789
            ],
            [
                5793,
                5868
            ],
            [
                5869,
                5872
            ],
            [
                5884,
                5886
            ],
            [
                5887,
                5917
            ],
            [
                5917,
                5918
            ],
            [
                5919,
                6020
            ],
            [
                6020,
                6079
            ],
            [
                6079,
                6185
            ],
            [
                6185,
                6210
            ],
            [
                6213,
                6228
            ],
            [
                6229,
                6245
            ],
            [
                6246,
                6248
            ],
            [
                6256,
                6265
            ],
            [
                6266,
                6270
            ],
            [
                6276,
                6290
            ],
            [
                6290,
                6294
            ],
            [
                6295,
                6351
            ],
            [
                6352,
                6356
            ],
            [
                6357,
                6373
            ],
            [
                6374,
                6441
            ],
            [
                6443,
                6461
            ],
            [
                6461,
                6476
            ],
            [
                6476,
                6514
            ],
            [
                6514,
                6561
            ],
            [
                6561,
                6599
            ],
            [
                6599,
                6646
            ],
            [
                6646,
                6670
            ],
            [
                6670,
                6712
            ],
            [
                6713,
                6720
            ],
            [
                6720,
                6769
            ],
            [
                6771,
                6818
            ],
            [
                6821,
                6845
            ],
            [
                6845,
                6888
            ],
            [
                6888,
                6922
            ],
            [
                6923,
                6924
            ],
            [
                6925,
                6934
            ],
            [
                6935,
                6988
            ],
            [
                7005,
                7035
            ],
            [
                7035,
                7063
            ],
            [
                7063,
                7120
            ],
            [
                7120,
                7153
            ],
            [
                7153,
                7201
            ],
            [
                7201,
                7290
            ],
            [
                7294,
                7318
            ],
            [
                7321,
                7343
            ],
            [
                7343,
                7395
            ],
            [
                7395,
                7426
            ],
            [
                7426,
                7471
            ],
            [
                7471,
                7511
            ],
            [
                7511,
                7596
            ],
            [
                7596,
                7659
            ],
            [
                7659,
                7676
            ],
            [
                7677,
                7745
            ],
            [
                7745,
                7760
            ],
            [
                7765,
                7777
            ],
            [
                7777,
                7803
            ],
            [
                7804,
                7815
            ],
            [
                7816,
                7817
            ],
            [
                7818,
                7833
            ],
            [
                7842,
                7845
            ],
            [
                7845,
                7847
            ],
            [
                7854,
                7868
            ],
            [
                7868,
                7872
            ],
            [
                7872,
                7925
            ],
            [
                7925,
                8000
            ],
            [
                8000,
                8141
            ],
            [
                8141,
                8144
            ],
            [
                8145,
                8171
            ],
            [
                8174,
                8175
            ],
            [
                8176,
                8266
            ],
            [
                8266,
                8311
            ],
            [
                8311,
                8359
            ],
            [
                8359,
                8425
            ],
            [
                8425,
                8503
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                272
            ],
            [
                272,
                425
            ],
            [
                425,
                627
            ],
            [
                627,
                853
            ],
            [
                853,
                1067
            ],
            [
                1067,
                1112
            ],
            [
                1112,
                1269
            ],
            [
                1269,
                1269
            ],
            [
                1269,
                1461
            ],
            [
                1461,
                1580
            ],
            [
                1580,
                1793
            ],
            [
                1793,
                1793
            ],
            [
                1793,
                1907
            ],
            [
                1907,
                1907
            ],
            [
                1907,
                1979
            ],
            [
                1979,
                2127
            ],
            [
                2127,
                2278
            ],
            [
                2278,
                2312
            ],
            [
                2312,
                2572
            ],
            [
                2572,
                2572
            ],
            [
                2572,
                2572
            ],
            [
                2572,
                2766
            ],
            [
                2766,
                2851
            ],
            [
                2851,
                2907
            ],
            [
                2907,
                2956
            ],
            [
                2956,
                2974
            ],
            [
                2974,
                3016
            ],
            [
                3016,
                3070
            ],
            [
                3070,
                3118
            ],
            [
                3118,
                3224
            ],
            [
                3224,
                3267
            ],
            [
                3267,
                3267
            ],
            [
                3267,
                3324
            ],
            [
                3324,
                3324
            ],
            [
                3324,
                3373
            ],
            [
                3373,
                3414
            ],
            [
                3414,
                3458
            ],
            [
                3458,
                3527
            ],
            [
                3527,
                3527
            ],
            [
                3527,
                3533
            ],
            [
                3533,
                3570
            ],
            [
                3570,
                3627
            ],
            [
                3627,
                3694
            ],
            [
                3694,
                3705
            ],
            [
                3705,
                3745
            ],
            [
                3745,
                3782
            ],
            [
                3782,
                3782
            ],
            [
                3782,
                3782
            ],
            [
                3782,
                3788
            ],
            [
                3788,
                3837
            ],
            [
                3837,
                3879
            ],
            [
                3879,
                3903
            ],
            [
                3903,
                3985
            ],
            [
                3985,
                4023
            ],
            [
                4023,
                4123
            ],
            [
                4123,
                4134
            ],
            [
                4134,
                4172
            ],
            [
                4172,
                4221
            ],
            [
                4221,
                4226
            ],
            [
                4226,
                4236
            ],
            [
                4236,
                4265
            ],
            [
                4265,
                4321
            ],
            [
                4321,
                4352
            ],
            [
                4352,
                4352
            ],
            [
                4352,
                4451
            ],
            [
                4451,
                4649
            ],
            [
                4649,
                4769
            ],
            [
                4769,
                4800
            ],
            [
                4800,
                4800
            ],
            [
                4800,
                4800
            ],
            [
                4800,
                4838
            ],
            [
                4838,
                4861
            ],
            [
                4861,
                4881
            ],
            [
                4881,
                4881
            ],
            [
                4881,
                5094
            ],
            [
                5094,
                5142
            ],
            [
                5142,
                5244
            ],
            [
                5244,
                5327
            ],
            [
                5327,
                5432
            ],
            [
                5432,
                5608
            ],
            [
                5608,
                5628
            ],
            [
                5628,
                5663
            ],
            [
                5663,
                5884
            ],
            [
                5884,
                6020
            ],
            [
                6020,
                6185
            ],
            [
                6185,
                6290
            ],
            [
                6290,
                6443
            ],
            [
                6443,
                6461
            ],
            [
                6461,
                6476
            ],
            [
                6476,
                6514
            ],
            [
                6514,
                6561
            ],
            [
                6561,
                6599
            ],
            [
                6599,
                6646
            ],
            [
                6646,
                6670
            ],
            [
                6670,
                6720
            ],
            [
                6720,
                6771
            ],
            [
                6771,
                6821
            ],
            [
                6821,
                6821
            ],
            [
                6821,
                6845
            ],
            [
                6845,
                6845
            ],
            [
                6845,
                6888
            ],
            [
                6888,
                7035
            ],
            [
                7035,
                7063
            ],
            [
                7063,
                7120
            ],
            [
                7120,
                7120
            ],
            [
                7120,
                7153
            ],
            [
                7153,
                7201
            ],
            [
                7201,
                7290
            ],
            [
                7290,
                7343
            ],
            [
                7343,
                7395
            ],
            [
                7395,
                7426
            ],
            [
                7426,
                7471
            ],
            [
                7471,
                7511
            ],
            [
                7511,
                7596
            ],
            [
                7596,
                7745
            ],
            [
                7745,
                7777
            ],
            [
                7777,
                7845
            ],
            [
                7845,
                7868
            ],
            [
                7868,
                7925
            ],
            [
                7925,
                8000
            ],
            [
                8000,
                8141
            ],
            [
                8141,
                8266
            ],
            [
                8266,
                8311
            ],
            [
                8311,
                8359
            ],
            [
                8359,
                8425
            ],
            [
                8425,
                8503
            ]
        ]
    }
}