{
    "original": {
        "text": "\"Let no flower of the spring pass by us; let us crown ourselves with rosebuds before they be withered.\"--BOOK OF WISDOM.\nPity that Offendene was not the home of Miss Harleth's childhood, or endeared to her by family memories! A human life, I think, should be well rooted in some spot of a native land, where it may get the love of tender kinship for the face of earth, for the labors men go forth to, for the sounds and accents that haunt it, for whatever will give that early home a familiar unmistakable difference amid the future widening of knowledge: a spot where the definiteness of early memories may be inwrought with affection, and--kindly acquaintance with all neighbors, even to the dogs and donkeys, may spread not by sentimental effort and reflection, but as a sweet habit of the blood. At five years old, mortals are not prepared to be citizens of the world, to be stimulated by abstract nouns, to soar above preference into impartiality; and that prejudice in favor of milk with which we blindly begin, is a type of the way body and soul must get nourished at least for a time. The best introduction to astronomy is to think of the nightly heavens as a little lot of stars belonging to one's own homestead.\nBut this blessed persistence in which affection can take root had been wanting in Gwendolen's life. It was only a year before her recall from Leubronn that Offendene had been chosen as her mamma's home, simply for its nearness to Pennicote Rectory, and that Mrs. Davilow, Gwendolen, and her four half-sisters (the governess and the maid following in another vehicle) had been driven along the avenue for the first time, on a late October afternoon when the rooks were crawing loudly above them, and the yellow elm-leaves were whirling.\nThe season suited the aspect of the old oblong red-brick house, rather too anxiously ornamented with stone at every line, not excepting the double row of narrow windows and the large square portico. The stone encouraged a greenish lichen, the brick a powdery gray, so that though the building was rigidly rectangular there was no harshness in the physiognomy which it turned to the three avenues cut east, west and south in the hundred yards' breadth of old plantation encircling the immediate grounds. One would have liked the house to have been lifted on a knoll, so as to look beyond its own little domain to the long thatched roofs of the distant villages, the church towers, the scattered homesteads, the gradual rise of surging woods, and the green breadths of undulating park which made the beautiful face of the earth in that part of Wessex. But though standing thus behind a screen amid flat pastures, it had on one side a glimpse of the wider world in the lofty curves of the chalk downs, grand steadfast forms played over by the changing days.\nThe house was but just large enough to be called a mansion, and was moderately rented, having no manor attached to it, and being rather difficult to let with its sombre furniture and faded upholstery. But inside and outside it was what no beholder could suppose to be inhabited by retired trades-people: a certainty which was worth many conveniences to tenants who not only had the taste that shrinks from new finery, but also were in that border-territory of rank where annexation is a burning topic: and to take up her abode in a house which had once sufficed for dowager countesses gave a perceptible tinge to Mrs. Davilow's satisfaction in having an establishment of her own. This, rather mysteriously to Gwendolen, appeared suddenly possible on the death of her step-father, Captain Davilow, who had for the last nine years joined his family only in a brief and fitful manner, enough to reconcile them to his long absences; but she cared much more for the fact than for the explanation. All her prospects had become more agreeable in consequence. She had disliked their former way of life, roving from one foreign watering-place or Parisian apartment to another, always feeling new antipathies to new suites of hired furniture, and meeting new people under conditions which made her appear of little importance; and the variation of having passed two years at a showy school, where, on all occasions of display, she had been put foremost, had only deepened her sense that so exceptional a person as herself could hardly remain in ordinary circumstances or in a social position less than advantageous. Any fear of this latter evil was banished now that her mamma was to have an establishment; for on the point of birth Gwendolen was quite easy. She had no notion how her maternal grandfather got the fortune inherited by his two daughters; but he had been a West Indian--which seemed to exclude further question; and she knew that her father's family was so high as to take no notice of her mamma, who nevertheless preserved with much pride the miniature of a Lady Molly in that connection. She would probably have known much more about her father but for a little incident which happened when she was twelve years old. Mrs. Davilow had brought out, as she did only at wide intervals, various memorials of her first husband, and while showing his miniature to Gwendolen recalled with a fervor which seemed to count on a peculiar filial sympathy, the fact that dear papa had died when his little daughter was in long clothes. Gwendolen, immediately thinking of the unlovable step-father whom she had been acquainted with the greater part of her life while her frocks were short, said,\n\"Why did you marry again, mamma? It would have been nicer if you had not.\"\nMrs. Davilow colored deeply, a slight convulsive movement passed over her face, and straightway shutting up the memorials she said, with a violence quite unusual in her,\n\"You have no feeling, child!\"\nGwendolen, who was fond of her mamma, felt hurt and ashamed, and had never since dared to ask a question about her father.\nThis was not the only instance in which she had brought on herself the pain of some filial compunction. It was always arranged, when possible, that she should have a small bed in her mamma's room; for Mrs. Davilow's motherly tenderness clung chiefly to her eldest girl, who had been born in her happier time. One night under an attack of pain she found that the specific regularly placed by her bedside had been forgotten, and begged Gwendolen to get out of bed and reach it for her. That healthy young lady, snug and warm as a rosy infant in her little couch, objected to step out into the cold, and lying perfectly still, grumbling a refusal. Mrs. Davilow went without the medicine and never reproached her daughter; but the next day Gwendolen was keenly conscious of what must be in her mamma's mind, and tried to make amends by caresses which cost her no effort. Having always been the pet and pride of the household, waited on by mother, sisters, governess and maids, as if she had been a princess in exile, she naturally found it difficult to think her own pleasure less important than others made it, and when it was positively thwarted felt an astonished resentment apt, in her cruder days, to vent itself in one of those passionate acts which look like a contradiction of habitual tendencies. Though never even as a child thoughtlessly cruel, nay delighting to rescue drowning insects and watch their recovery, there was a disagreeable silent remembrance of her having strangled her sister's canary-bird in a final fit of exasperation at its shrill singing which had again and again jarringly interrupted her own. She had taken pains to buy a white mouse for her sister in retribution, and though inwardly excusing herself on the ground of a peculiar sensitiveness which was a mark of her general superiority, the thought of that infelonious murder had always made her wince. Gwendolen's nature was not remorseless, but she liked to make her penances easy, and now that she was twenty and more, some of her native force had turned into a self-control by which she guarded herself from penitential humiliation. There was more show of fire and will in her than ever, but there was more calculation underneath it.\nOn this day of arrival at Offendene, which not even Mrs. Davilow had seen before--the place having been taken for her by her brother-in-law, Mr. Gascoigne--when all had got down from the carriage, and were standing under the porch in front of the open door, so that they could have a general view of the place and a glimpse of the stone hall and staircase hung with sombre pictures, but enlivened by a bright wood fire, no one spoke; mamma, the four sisters and the governess all looked at Gwendolen, as if their feelings depended entirely on her decision. Of the girls, from Alice in her sixteenth year to Isabel in her tenth, hardly anything could be said on a first view, but that they were girlish, and that their black dresses were getting shabby. Miss Merry was elderly and altogether neutral in expression. Mrs. Davilow's worn beauty seemed the more pathetic for the look of entire appeal which she cast at Gwendolen, who was glancing round at the house, the landscape and the entrance hall with an air of rapid judgment. Imagine a young race-horse in the paddock among untrimmed ponies and patient hacks.\n\"Well, dear, what do you think of the place,\" said Mrs. Davilow at last, in a gentle, deprecatory tone.\n\"I think it is charming,\" said Gwendolen, quickly. \"A romantic place; anything delightful may happen in it; it would be a good background for anything. No one need be ashamed of living here.\"\n\"There is certainly nothing common about it.\"\n\"Oh, it would do for fallen royalty or any sort of grand poverty. We ought properly to have been living in splendor, and have come down to this. It would have been as romantic as could be. But I thought my uncle and aunt Gascoigne would be here to meet us, and my cousin Anna,\" added Gwendolen, her tone changed to sharp surprise.\n\"We are early,\" said Mrs. Davilow, and entering the hall, she said to the housekeeper who came forward, \"You expect Mr. and Mrs. Gascoigne?\"\n\"Yes, madam; they were here yesterday to give particular orders about the fires and the dinner. But as to fires, I've had 'em in all the rooms for the last week, and everything is well aired. I could wish some of the furniture paid better for all the cleaning it's had, but I _think_ you'll see the brasses have been done justice to. I _think_ when Mr. and Mrs. Gascoigne come, they'll tell you nothing has been neglected. They'll be here at five, for certain.\"\nThis satisfied Gwendolen, who was not prepared to have their arrival treated with indifference; and after tripping a little way up the matted stone staircase to take a survey there, she tripped down again, and followed by all the girls looked into each of the rooms opening from the hall--the dining-room all dark oak and worn red satin damask, with a copy of snarling, worrying dogs from Snyders over the side-board, and a Christ breaking bread over the mantel-piece; the library with a general aspect and smell of old brown-leather; and lastly, the drawing-room, which was entered through a small antechamber crowded with venerable knick-knacks.\n\"Mamma, mamma, pray come here!\" said Gwendolen, Mrs. Davilow having followed slowly in talk with the housekeeper. \"Here is an organ. I will be Saint Cecilia: some one shall paint me as Saint Cecilia. Jocosa (this was her name for Miss Merry), let down my hair. See, mamma?\"\nShe had thrown off her hat and gloves, and seated herself before the organ in an admirable pose, looking upward; while the submissive and sad Jocosa took out the one comb which fastened the coil of hair, and then shook out the mass till it fell in a smooth light-brown stream far below its owner's slim waist.\nMrs. Davilow smiled and said, \"A charming picture, my dear!\" not indifferent to the display of her pet, even in the presence of a housekeeper. Gwendolen rose and laughed with delight. All this seemed quite to the purpose on entering a new house which was so excellent a background.\n\"What a queer, quaint, picturesque room!\" she went on, looking about her. \"I like these old embroidered chairs, and the garlands on the wainscot, and the pictures that may be anything. That one with the ribs--nothing but ribs and darkness--I should think that is Spanish, mamma.\"\n\"Oh, Gwendolen!\" said the small Isabel, in a tone of astonishment, while she held open a hinged panel of the wainscot at the other end of the room.\nEvery one, Gwendolen first, went to look. The opened panel had disclosed the picture of an upturned dead face, from which an obscure figure seemed to be fleeing with outstretched arms. \"How horrible!\" said Mrs. Davilow, with a look of mere disgust; but Gwendolen shuddered silently, and Isabel, a plain and altogether inconvenient child with an alarming memory, said,\n\"You will never stay in this room by yourself, Gwendolen.\"\n\"How dare you open things which were meant to be shut up, you perverse little creature?\" said Gwendolen, in her angriest tone. Then snatching the panel out of the hand of the culprit, she closed it hastily, saying, \"There is a lock--where is the key? Let the key be found, or else let one be made, and let nobody open it again; or rather, let the key be brought to me.\"\nAt this command to everybody in general Gwendolen turned with a face which was flushed in reaction from her chill shudder, and said, \"Let us go up to our own room, mamma.\"\nThe housekeeper on searching found the key in the drawer of the cabinet close by the panel, and presently handed it to Bugle, the lady's-maid, telling her significantly to give it to her Royal Highness.\n\"I don't know what you mean, Mrs. Startin,\" said Bugle, who had been busy up-stairs during the scene in the drawing-room, and was rather offended at this irony in a new servant.\n\"I mean the young lady that's to command us all--and well worthy for looks and figure,\" replied Mrs. Startin in propitiation. \"She'll know what key it is.\"\n\"If you have laid out what we want, go and see to the others, Bugle,\" Gwendolen had said, when she and Mrs. Davilow entered their black and yellow bedroom, where a pretty little white couch was prepared by the side of the black and yellow catafalque known as the best bed. \"I will help mamma.\"\nBut her first movement was to go to the tall mirror between the windows, which reflected herself and the room completely, while her mamma sat down and also looked at the reflection.\n\"That is a becoming glass, Gwendolen; or is it the black and gold color that sets you off?\" said Mrs. Davilow, as Gwendolen stood obliquely with her three-quarter face turned toward the mirror, and her left hand brushing back the stream of hair.\n\"I should make a tolerable St. Cecilia with some white roses on my head,\" said Gwendolen,--\"only how about my nose, mamma? I think saint's noses never in the least turn up. I wish you had given me your perfectly straight nose; it would have done for any sort of character--a nose of all work. Mine is only a happy nose; it would not do so well for tragedy.\"\n\"Oh, my dear, any nose will do to be miserable with in this world,\" said Mrs. Davilow, with a deep, weary sigh, throwing her black bonnet on the table, and resting her elbow near it.\n\"Now, mamma,\" said Gwendolen, in a strongly remonstrant tone, turning away from the glass with an air of vexation, \"don't begin to be dull here. It spoils all my pleasure, and everything may be so happy now. What have you to be gloomy about _now_?\"\n\"Nothing, dear,\" said Mrs. Davilow, seeming to rouse herself, and beginning to take off her dress. \"It is always enough for me to see you happy.\"\n\"But you should be happy yourself,\" said Gwendolen, still discontentedly, though going to help her mamma with caressing touches. \"Can nobody be happy after they are quite young? You have made me feel sometimes as if nothing were of any use. With the girls so troublesome, and Jocosa so dreadfully wooden and ugly, and everything make-shift about us, and you looking so dull--what was the use of my being anything? But now you _might_ be happy.\"\n\"So I shall, dear,\" said Mrs. Davilow, patting the cheek that was bending near her.\n\"Yes, but really. Not with a sort of make-believe,\" said Gwendolen, with resolute perseverance. \"See what a hand and arm!--much more beautiful than mine. Any one can see you were altogether more beautiful.\"\n\"No, no, dear; I was always heavier. Never half so charming as you are.\"\n\"Well, but what is the use of my being charming, if it is to end in my being dull and not minding anything? Is that what marriage always comes to?\"\n\"No, child, certainly not. Marriage is the only happy state for a woman, as I trust you will prove.\"\n\"I will not put up with it if it is not a happy state. I am determined to be happy--at least not to go on muddling away my life as other people do, being and doing nothing remarkable. I have made up my mind not to let other people interfere with me as they have done. Here is some warm water ready for you, mamma,\" Gwendolen ended, proceeding to take off her own dress and then waiting to have her hair wound up by her mamma.\nThere was silence for a minute or two, till Mrs. Davilow said, while coiling the daughter's hair, \"I am sure I have never crossed you, Gwendolen.\"\n\"You often want me to do what I don't like.\"\n\"You mean, to give Alice lessons?\"\n\"Yes. And I have done it because you asked me. But I don't see why I should, else. It bores me to death, she is so slow. She has no ear for music, or language, or anything else. It would be much better for her to be ignorant, mamma: it is her _rle_, she would do it well.\"\n\"That is a hard thing to say of your poor sister, Gwendolen, who is so good to you, and waits on you hand and foot.\"\n\"I don't see why it is hard to call things by their right names, and put them in their proper places. The hardship is for me to have to waste my time on her. Now let me fasten up your hair, mamma.\"\n\"We must make haste; your uncle and aunt will be here soon. For heaven's sake, don't be scornful to _them_, my dear child! or to your cousin Anna, whom you will always be going out with. Do promise me, Gwendolen. You know, you can't expect Anna to be equal to you.\"\n\"I don't want her to be equal,\" said Gwendolen, with a toss of her head and a smile, and the discussion ended there.\nWhen Mr. and Mrs. Gascoigne and their daughter came, Gwendolen, far from being scornful, behaved as prettily as possible to them. She was introducing herself anew to relatives who had not seen her since the comparatively unfinished age of sixteen, and she was anxious--no, not anxious, but resolved that they should admire her.\nMrs. Gascoigne bore a family likeness to her sister. But she was darker and slighter, her face was unworn by grief, her movements were less languid, her expression more alert and critical as that of a rector's wife bound to exert a beneficent authority. Their closest resemblance lay in a non-resistant disposition, inclined to imitation and obedience; but this, owing to the difference in their circumstances, had led them to very different issues. The younger sister had been indiscreet, or at least unfortunate in her marriages; the elder believed herself the most enviable of wives, and her pliancy had ended in her sometimes taking shapes of surprising definiteness. Many of her opinions, such as those on church government and the character of Archbishop Laud, seemed too decided under every alteration to have been arrived at otherwise than by a wifely receptiveness. And there was much to encourage trust in her husband's authority. He had some agreeable virtues, some striking advantages, and the failings that were imputed to him all leaned toward the side of success.\nOne of his advantages was a fine person, which perhaps was even more impressive at fifty-seven than it had been earlier in life. There were no distinctively clerical lines in the face, no tricks of starchiness or of affected ease: in his Inverness cape he could not have been identified except as a gentleman with handsome dark features, a nose which began with an intention to be aquiline but suddenly became straight, and iron-gray hair. Perhaps he owed this freedom from the sort of professional make-up which penetrates skin, tones and gestures and defies all drapery, to the fact that he had once been Captain Gaskin, having taken orders and a diphthong but shortly before his engagement to Miss Armyn. If any one had objected that his preparation for the clerical function was inadequate, his friends might have asked who made a better figure in it, who preached better or had more authority in his parish? He had a native gift for administration, being tolerant both of opinions and conduct, because he felt himself able to overrule them, and was free from the irritations of conscious feebleness. He smiled pleasantly at the foible of a taste which he did not share--at floriculture or antiquarianism for example, which were much in vogue among his fellow-clergyman in the diocese: for himself, he preferred following the history of a campaign, or divining from his knowledge of Nesselrode's motives what would have been his conduct if our cabinet had taken a different course. Mr. Gascoigne's tone of thinking after some long-quieted fluctuations had become ecclesiastical rather than theological; not the modern Anglican, but what he would have called sound English, free from nonsense; such as became a man who looked at a national religion by daylight, and saw it in its relation to other things. No clerical magistrate had greater weight at sessions, or less of mischievous impracticableness in relation to worldly affairs. Indeed, the worst imputation thrown out against him was worldliness: it could not be proved that he forsook the less fortunate, but it was not to be denied that the friendships he cultivated were of a kind likely to be useful to the father of six sons and two daughters; and bitter observers--for in Wessex, say ten years ago, there were persons whose bitterness may now seem incredible--remarked that the color of his opinions had changed in consistency with this principle of action. But cheerful, successful worldliness has a false air of being more selfish than the acrid, unsuccessful kind, whose secret history is summed up in the terrible words, \"Sold, but not paid for.\"\nGwendolen wondered that she had not better remembered how very fine a man her uncle was; but at the age of sixteen she was a less capable and more indifferent judge. At present it was a matter of extreme interest to her that she was to have the near countenance of a dignified male relative, and that the family life would cease to be entirely, insipidly feminine. She did not intend that her uncle should control her, but she saw at once that it would be altogether agreeable to her that he should be proud of introducing her as his niece. And there was every sign of his being likely to feel that pride. He certainly looked at her with admiration as he said,\n\"You have outgrown Anna, my dear,\" putting his arm tenderly round his daughter, whose shy face was a tiny copy of his own, and drawing her forward. \"She is not so old as you by a year, but her growing days are certainly over. I hope you will be excellent companions.\"\nHe did give a comparing glance at his daughter, but if he saw her inferiority, he might also see that Anna's timid appearance and miniature figure must appeal to a different taste from that which was attracted by Gwendolen, and that the girls could hardly be rivals. Gwendolen at least, was aware of this, and kissed her cousin with real cordiality as well as grace, saying, \"A companion is just what I want. I am so glad we are come to live here. And mamma will be much happier now she is near you, aunt.\"\nThe aunt trusted indeed that it would be so, and felt it a blessing that a suitable home had been vacant in their uncle's parish. Then, of course, notice had to be taken of the four other girls, whom Gwendolen had always felt to be superfluous: all of a girlish average that made four units utterly unimportant, and yet from her earliest days an obtrusive influential fact in her life. She was conscious of having been much kinder to them than could have been expected. And it was evident to her that her uncle and aunt also felt it a pity there were so many girls:--what rational person could feel otherwise, except poor mamma, who never would see how Alice set up her shoulders and lifted her eyebrows till she had no forehead left, how Bertha and Fanny whispered and tittered together about everything, or how Isabel was always listening and staring and forgetting where she was, and treading on the toes of her suffering elders?\n\"You have brothers, Anna,\" said Gwendolen, while the sisters were being noticed. \"I think you are enviable there.\"\n\"Yes,\" said Anna, simply. \"I am very fond of them; but of course their education is a great anxiety to papa. He used to say they made me a tomboy. I really was a great romp with Rex. I think you will like Rex. He will come home before Christmas.\"\n\"I remember I used to think you rather wild and shy; but it is difficult now to imagine you a romp,\" said Gwendolen, smiling.\n\"Of course, I am altered now; I am come out, and all that. But in reality I like to go blackberrying with Edwy and Lotta as well as ever. I am not very fond of going out; but I dare say I shall like it better now you will be often with me. I am not at all clever, and I never know what to say. It seems so useless to say what everybody knows, and I can think of nothing else, except what papa says.\"\n\"I shall like going out with you very much,\" said Gwendolen, well disposed toward this _nave_ cousin. \"Are you fond of riding?\"\n\"Yes, but we have only one Shetland pony amongst us. Papa says he can't afford more, besides the carriage-horses and his own nag; he has so many expenses.\"\n\"I intend to have a horse and ride a great deal now,\" said Gwendolen, in a tone of decision. \"Is the society pleasant in this neighborhood?\"\n\"Papa says it is, very. There are the clergymen all about, you know; and the Quallons, and the Arrowpoints, and Lord Brackenshaw, and Sir Hugo Mallinger's place, where there is nobody--that's very nice, because we make picnics there--and two or three families at Wanchester: oh, and old Mrs. Vulcany, at Nuttingwood, and--\"\nBut Anna was relieved of this tax on her descriptive powers by the announcement of dinner, and Gwendolen's question was soon indirectly answered by her uncle, who dwelt much on the advantages he had secured for them in getting a place like Offendene. Except the rent, it involved no more expense than an ordinary house at Wanchester would have done.\n\"And it is always worth while to make a little sacrifice for a good style of house,\" said Mr. Gascoigne, in his easy, pleasantly confident tone, which made the world in general seem a very manageable place of residence: \"especially where there is only a lady at the head. All the best people will call upon you; and you need give no expensive dinners. Of course, I have to spend a good deal in that way; it is a large item. But then I get my house for nothing. If I had to pay three hundred a year for my house I could not keep a table. My boys are too great a drain on me. You are better off than we are, in proportion; there is no great drain on you now, after your house and carriage.\"\n\"I assure you, Fanny, now that the children are growing up, I am obliged to cut and contrive,\" said Mrs. Gascoigne. \"I am not a good manager by nature, but Henry has taught me. He is wonderful for making the best of everything; he allows himself no extras, and gets his curates for nothing. It is rather hard that he has not been made a prebendary or something, as others have been, considering the friends he has made and the need there is for men of moderate opinions in all respects. If the Church is to keep its position, ability and character ought to tell.\"\n\"Oh, my dear Nancy, you forget the old story--thank Heaven, there are three hundred as good as I. And ultimately, we shall have no reason to complain, I am pretty sure. There could hardly be a more thorough friend than Lord Brackenshaw--your landlord, you know, Fanny. Lady Brackenshaw will call upon you. And I have spoken for Gwendolen to be a member of our Archery Club--the Brackenshaw Archery Club--the most select thing anywhere. That is, if she has no objection,\" added Mr. Gascoigne, looking at Gwendolen with pleasant irony.\n\"I should like it of all things,\" said Gwendolen. \"There is nothing I enjoy more than taking aim--and hitting,\" she ended, with a pretty nod and smile.\n\"Our Anna, poor child, is too short-sighted for archery. But I consider myself a first-rate shot, and you shall practice with me. I must make you an accomplished archer before our great meeting in July. In fact, as to neighborhood, you could hardly be better placed. There are the Arrowpoints--they are some of our best people. Miss Arrowpoint is a delightful girl--she has been presented at Court. They have a magnificent place--Quetcham Hall--worth seeing in point of art; and their parties, to which you are sure to be invited, are the best things of the sort we have. The archdeacon is intimate there, and they have always a good kind of people staying in the house. Mrs. Arrowpoint is peculiar, certainly; something of a caricature, in fact; but well-meaning. And Miss Arrowpoint is as nice as possible. It is not all young ladies who have mothers as handsome and graceful as yours and Anna's.\"\nMrs. Davilow smiled faintly at this little compliment, but the husband and wife looked affectionately at each other, and Gwendolen thought, \"My uncle and aunt, at least, are happy: they are not dull and dismal.\" Altogether, she felt satisfied with her prospects at Offendene, as a great improvement on anything she had known. Even the cheap curates, she incidentally learned, were almost always young men of family, and Mr. Middleton, the actual curate, was said to be quite an acquisition: it was only a pity he was so soon to leave.\nBut there was one point which she was so anxious to gain that she could not allow the evening to pass without taking her measures toward securing it. Her mamma, she knew, intended to submit entirely to her uncle's judgment with regard to expenditure; and the submission was not merely prudential, for Mrs. Davilow, conscious that she had always been seen under a cloud as poor dear Fanny, who had made a sad blunder with her second marriage, felt a hearty satisfaction in being frankly and cordially identified with her sister's family, and in having her affairs canvassed and managed with an authority which presupposed a genuine interest. Thus the question of a suitable saddle-horse, which had been sufficiently discussed with mamma, had to be referred to Mr. Gascoigne; and after Gwendolen had played on the piano, which had been provided from Wanchester, had sung to her hearers' admiration, and had induced her uncle to join her in a duet--what more softening influence than this on any uncle who would have sung finely if his time had not been too much taken up by graver matters?--she seized the opportune moment for saying, \"Mamma, you have not spoken to my uncle about my riding.\"\n\"Gwendolen desires above all things to have a horse to ride--a pretty, light, lady's horse,\" said Mrs. Davilow, looking at Mr. Gascoigne. \"Do you think we can manage it?\"\nMr. Gascoigne projected his lower lip and lifted his handsome eyebrows sarcastically at Gwendolen, who had seated herself with much grace on the elbow of her mamma's chair.\n\"We could lend her the pony sometimes,\" said Mrs. Gascoigne, watching her husband's face, and feeling quite ready to disapprove if he did.\n\"That might be inconveniencing others, aunt, and would be no pleasure to me. I cannot endure ponies,\" said Gwendolen. \"I would rather give up some other indulgence and have a horse.\" (Was there ever a young lady or gentleman not ready to give up an unspecified indulgence for the sake of the favorite one specified?)\n\"She rides so well. She has had lessons, and the riding-master said she had so good a seat and hand she might be trusted with any mount,\" said Mrs. Davilow, who, even if she had not wished her darling to have the horse, would not have dared to be lukewarm in trying to get it for her.\n\"There is the price of the horse--a good sixty with the best chance, and then his keep,\" said Mr. Gascoigne, in a tone which, though demurring, betrayed the inward presence of something that favored the demand. \"There are the carriage-horses--already a heavy item. And remember what you ladies cost in toilet now.\"\n\"I really wear nothing but two black dresses,\" said Mrs. Davilow, hastily. \"And the younger girls, of course, require no toilet at present. Besides, Gwendolen will save me so much by giving her sisters lessons.\" Here Mrs. Davilow's delicate cheek showed a rapid blush. \"If it were not for that, I must really have a more expensive governess, and masters besides.\"\nGwendolen felt some anger with her mamma, but carefully concealed it.\n\"That is good--that is decidedly good,\" said Mr. Gascoigne, heartily, looking at his wife. And Gwendolen, who, it must be owned, was a deep young lady, suddenly moved away to the other end of the long drawing-room, and busied herself with arranging pieces of music.\n\"The dear child has had no indulgences, no pleasures,\" said Mrs. Davilow, in a pleading undertone. \"I feel the expense is rather imprudent in this first year of our settling. But she really needs the exercise--she needs cheering. And if you were to see her on horseback, it is something splendid.\"\n\"It is what we could not afford for Anna,\" said Mrs. Gascoigne. \"But she, dear child, would ride Lotta's donkey and think it good enough.\" (Anna was absorbed in a game with Isabel, who had hunted out an old back-gammon-board, and had begged to sit up an extra hour.)\n\"Certainly, a fine woman never looks better than on horseback,\" said Mr. Gascoigne. \"And Gwendolen has the figure for it. I don't say the thing should not be considered.\"\n\"We might try it for a time, at all events. It can be given up, if necessary,\" said Mrs. Davilow.\n\"Well, I will consult Lord Brackenshaw's head groom. He is my _fidus Achates_ in the horsey way.\"\n\"Thanks,\" said Mrs. Davilow, much relieved. \"You are very kind.\"\n\"That he always is,\" said Mrs. Gascoigne. And later that night, when she and her husband were in private, she said,\n\"I thought you were almost too indulgent about the horse for Gwendolen. She ought not to claim so much more than your own daughter would think of. Especially before we see how Fanny manages on her income. And you really have enough to do without taking all this trouble on yourself.\"\n\"My dear Nancy, one must look at things from every point of view. This girl is really worth some expense: you don't often see her equal. She ought to make a first-rate marriage, and I should not be doing my duty if I spared my trouble in helping her forward. You know yourself she has been under a disadvantage with such a father-in-law, and a second family, keeping her always in the shade. I feel for the girl, And I should like your sister and her family now to have the benefit of your having married rather a better specimen of our kind than she did.\"\n\"Rather better! I should think so. However, it is for me to be grateful that you will take so much on your shoulders for the sake of my sister and her children. I am sure I would not grudge anything to poor Fanny. But there is one thing I have been thinking of, though you have never mentioned it.\"\n\"What is that?\"\n\"The boys. I hope they will not be falling in love with Gwendolen.\"\n\"Don't presuppose anything of the kind, my dear, and there will be no danger. Rex will never be at home for long together, and Warham is going to India. It is the wiser plan to take it for granted that cousins will not fall in love. If you begin with precautions, the affair will come in spite of them. One must not undertake to act for Providence in these matters, which can no more be held under the hand than a brood of chickens. The boys will have nothing, and Gwendolen will have nothing. They can't marry. At the worst there would only be a little crying, and you can't save boys and girls from that.\"\nMrs. Gascoigne's mind was satisfied: if anything did happen, there was the comfort of feeling that her husband would know what was to be done, and would have the energy to do it.",
        "paragraph_chars": [
            [
                0,
                121
            ],
            [
                121,
                1222
            ],
            [
                1222,
                1758
            ],
            [
                1758,
                2813
            ],
            [
                2813,
                5501
            ],
            [
                5501,
                5576
            ],
            [
                5576,
                5746
            ],
            [
                5746,
                5776
            ],
            [
                5776,
                5899
            ],
            [
                5899,
                8119
            ],
            [
                8119,
                9232
            ],
            [
                9232,
                9336
            ],
            [
                9336,
                9528
            ],
            [
                9528,
                9574
            ],
            [
                9574,
                9905
            ],
            [
                9905,
                10046
            ],
            [
                10046,
                10508
            ],
            [
                10508,
                11156
            ],
            [
                11156,
                11430
            ],
            [
                11430,
                11740
            ],
            [
                11740,
                12022
            ],
            [
                12022,
                12302
            ],
            [
                12302,
                12450
            ],
            [
                12450,
                12818
            ],
            [
                12818,
                12877
            ],
            [
                12877,
                13247
            ],
            [
                13247,
                13419
            ],
            [
                13419,
                13622
            ],
            [
                13622,
                13800
            ],
            [
                13800,
                13956
            ],
            [
                13956,
                14250
            ],
            [
                14250,
                14432
            ],
            [
                14432,
                14678
            ],
            [
                14678,
                15036
            ],
            [
                15036,
                15219
            ],
            [
                15219,
                15468
            ],
            [
                15468,
                15614
            ],
            [
                15614,
                16059
            ],
            [
                16059,
                16143
            ],
            [
                16143,
                16350
            ],
            [
                16350,
                16423
            ],
            [
                16423,
                16571
            ],
            [
                16571,
                16672
            ],
            [
                16672,
                17098
            ],
            [
                17098,
                17245
            ],
            [
                17245,
                17290
            ],
            [
                17290,
                17325
            ],
            [
                17325,
                17598
            ],
            [
                17598,
                17715
            ],
            [
                17715,
                17913
            ],
            [
                17913,
                18179
            ],
            [
                18179,
                18296
            ],
            [
                18296,
                18624
            ],
            [
                18624,
                19703
            ],
            [
                19703,
                22319
            ],
            [
                22319,
                22980
            ],
            [
                22980,
                23248
            ],
            [
                23248,
                23755
            ],
            [
                23755,
                24688
            ],
            [
                24688,
                24803
            ],
            [
                24803,
                25050
            ],
            [
                25050,
                25176
            ],
            [
                25176,
                25576
            ],
            [
                25576,
                25704
            ],
            [
                25704,
                25860
            ],
            [
                25860,
                26001
            ],
            [
                26001,
                26325
            ],
            [
                26325,
                26675
            ],
            [
                26675,
                27364
            ],
            [
                27364,
                27928
            ],
            [
                27928,
                28462
            ],
            [
                28462,
                28614
            ],
            [
                28614,
                29514
            ],
            [
                29514,
                30049
            ],
            [
                30049,
                31240
            ],
            [
                31240,
                31411
            ],
            [
                31411,
                31584
            ],
            [
                31584,
                31723
            ],
            [
                31723,
                32040
            ],
            [
                32040,
                32325
            ],
            [
                32325,
                32640
            ],
            [
                32640,
                33004
            ],
            [
                33004,
                33074
            ],
            [
                33074,
                33340
            ],
            [
                33340,
                33638
            ],
            [
                33638,
                33905
            ],
            [
                33905,
                34076
            ],
            [
                34076,
                34174
            ],
            [
                34174,
                34272
            ],
            [
                34272,
                34337
            ],
            [
                34337,
                34453
            ],
            [
                34453,
                34737
            ],
            [
                34737,
                35294
            ],
            [
                35294,
                35593
            ],
            [
                35593,
                35609
            ],
            [
                35609,
                35677
            ],
            [
                35677,
                36285
            ],
            [
                36285,
                36463
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                121
            ],
            [
                121,
                226
            ],
            [
                226,
                800
            ],
            [
                800,
                1093
            ],
            [
                1093,
                1222
            ],
            [
                1222,
                1322
            ],
            [
                1322,
                1758
            ],
            [
                1758,
                1957
            ],
            [
                1957,
                2261
            ],
            [
                2261,
                2608
            ],
            [
                2608,
                2813
            ],
            [
                2813,
                3014
            ],
            [
                3014,
                3493
            ],
            [
                3493,
                3805
            ],
            [
                3805,
                3865
            ],
            [
                3865,
                4419
            ],
            [
                4419,
                4562
            ],
            [
                4562,
                4908
            ],
            [
                4908,
                5037
            ],
            [
                5037,
                5342
            ],
            [
                5342,
                5501
            ],
            [
                5501,
                5534
            ],
            [
                5534,
                5576
            ],
            [
                5576,
                5746
            ],
            [
                5746,
                5776
            ],
            [
                5776,
                5899
            ],
            [
                5899,
                6003
            ],
            [
                6003,
                6208
            ],
            [
                6208,
                6383
            ],
            [
                6383,
                6544
            ],
            [
                6544,
                6766
            ],
            [
                6766,
                7201
            ],
            [
                7201,
                7522
            ],
            [
                7522,
                7784
            ],
            [
                7784,
                8018
            ],
            [
                8018,
                8119
            ],
            [
                8119,
                8676
            ],
            [
                8676,
                8872
            ],
            [
                8872,
                8933
            ],
            [
                8933,
                9148
            ],
            [
                9148,
                9232
            ],
            [
                9232,
                9336
            ],
            [
                9336,
                9387
            ],
            [
                9387,
                9488
            ],
            [
                9488,
                9528
            ],
            [
                9528,
                9574
            ],
            [
                9574,
                9640
            ],
            [
                9640,
                9719
            ],
            [
                9719,
                9763
            ],
            [
                9763,
                9905
            ],
            [
                9905,
                10046
            ],
            [
                10046,
                10142
            ],
            [
                10142,
                10238
            ],
            [
                10238,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10508
            ],
            [
                10508,
                11156
            ],
            [
                11156,
                11188
            ],
            [
                11188,
                11270
            ],
            [
                11270,
                11289
            ],
            [
                11289,
                11356
            ],
            [
                11356,
                11417
            ],
            [
                11417,
                11430
            ],
            [
                11430,
                11740
            ],
            [
                11740,
                11801
            ],
            [
                11801,
                11883
            ],
            [
                11883,
                11924
            ],
            [
                11924,
                12022
            ],
            [
                12022,
                12064
            ],
            [
                12064,
                12096
            ],
            [
                12096,
                12207
            ],
            [
                12207,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12450
            ],
            [
                12450,
                12492
            ],
            [
                12492,
                12635
            ],
            [
                12635,
                12651
            ],
            [
                12651,
                12818
            ],
            [
                12818,
                12877
            ],
            [
                12877,
                12966
            ],
            [
                12966,
                13004
            ],
            [
                13004,
                13128
            ],
            [
                13128,
                13247
            ],
            [
                13247,
                13419
            ],
            [
                13419,
                13622
            ],
            [
                13622,
                13800
            ],
            [
                13800,
                13926
            ],
            [
                13926,
                13956
            ],
            [
                13956,
                14229
            ],
            [
                14229,
                14250
            ],
            [
                14250,
                14432
            ],
            [
                14432,
                14524
            ],
            [
                14524,
                14678
            ],
            [
                14678,
                14801
            ],
            [
                14801,
                14851
            ],
            [
                14851,
                14971
            ],
            [
                14971,
                15036
            ],
            [
                15036,
                15219
            ],
            [
                15219,
                15364
            ],
            [
                15364,
                15427
            ],
            [
                15427,
                15468
            ],
            [
                15468,
                15567
            ],
            [
                15567,
                15614
            ],
            [
                15614,
                15743
            ],
            [
                15743,
                15792
            ],
            [
                15792,
                15855
            ],
            [
                15855,
                16028
            ],
            [
                16028,
                16059
            ],
            [
                16059,
                16143
            ],
            [
                16143,
                16161
            ],
            [
                16161,
                16239
            ],
            [
                16239,
                16297
            ],
            [
                16297,
                16350
            ],
            [
                16350,
                16387
            ],
            [
                16387,
                16423
            ],
            [
                16423,
                16531
            ],
            [
                16531,
                16571
            ],
            [
                16571,
                16598
            ],
            [
                16598,
                16672
            ],
            [
                16672,
                16727
            ],
            [
                16727,
                16856
            ],
            [
                16856,
                16940
            ],
            [
                16940,
                17098
            ],
            [
                17098,
                17245
            ],
            [
                17245,
                17290
            ],
            [
                17290,
                17325
            ],
            [
                17325,
                17331
            ],
            [
                17331,
                17372
            ],
            [
                17372,
                17408
            ],
            [
                17408,
                17446
            ],
            [
                17446,
                17503
            ],
            [
                17503,
                17598
            ],
            [
                17598,
                17715
            ],
            [
                17715,
                17817
            ],
            [
                17817,
                17873
            ],
            [
                17873,
                17913
            ],
            [
                17913,
                17973
            ],
            [
                17973,
                18036
            ],
            [
                18036,
                18100
            ],
            [
                18100,
                18126
            ],
            [
                18126,
                18179
            ],
            [
                18179,
                18296
            ],
            [
                18296,
                18426
            ],
            [
                18426,
                18624
            ],
            [
                18624,
                18677
            ],
            [
                18677,
                18878
            ],
            [
                18878,
                19074
            ],
            [
                19074,
                19296
            ],
            [
                19296,
                19499
            ],
            [
                19499,
                19565
            ],
            [
                19565,
                19703
            ],
            [
                19703,
                19832
            ],
            [
                19832,
                20143
            ],
            [
                20143,
                20411
            ],
            [
                20411,
                20616
            ],
            [
                20616,
                20808
            ],
            [
                20808,
                21189
            ],
            [
                21189,
                21512
            ],
            [
                21512,
                21640
            ],
            [
                21640,
                22126
            ],
            [
                22126,
                22319
            ],
            [
                22319,
                22485
            ],
            [
                22485,
                22684
            ],
            [
                22684,
                22860
            ],
            [
                22860,
                22925
            ],
            [
                22925,
                22980
            ],
            [
                22980,
                23128
            ],
            [
                23128,
                23206
            ],
            [
                23206,
                23248
            ],
            [
                23248,
                23515
            ],
            [
                23515,
                23657
            ],
            [
                23657,
                23696
            ],
            [
                23696,
                23755
            ],
            [
                23755,
                23885
            ],
            [
                23885,
                24141
            ],
            [
                24141,
                24225
            ],
            [
                24225,
                24688
            ],
            [
                24688,
                24769
            ],
            [
                24769,
                24803
            ],
            [
                24803,
                24829
            ],
            [
                24829,
                24912
            ],
            [
                24912,
                24950
            ],
            [
                24950,
                24986
            ],
            [
                24986,
                25013
            ],
            [
                25013,
                25050
            ],
            [
                25050,
                25176
            ],
            [
                25176,
                25235
            ],
            [
                25235,
                25314
            ],
            [
                25314,
                25416
            ],
            [
                25416,
                25470
            ],
            [
                25470,
                25576
            ],
            [
                25576,
                25678
            ],
            [
                25678,
                25704
            ],
            [
                25704,
                25757
            ],
            [
                25757,
                25860
            ],
            [
                25860,
                25953
            ],
            [
                25953,
                26001
            ],
            [
                26001,
                26025
            ],
            [
                26025,
                26325
            ],
            [
                26325,
                26576
            ],
            [
                26576,
                26675
            ],
            [
                26675,
                26947
            ],
            [
                26947,
                27027
            ],
            [
                27027,
                27099
            ],
            [
                27099,
                27136
            ],
            [
                27136,
                27212
            ],
            [
                27212,
                27249
            ],
            [
                27249,
                27364
            ],
            [
                27364,
                27480
            ],
            [
                27480,
                27541
            ],
            [
                27541,
                27655
            ],
            [
                27655,
                27851
            ],
            [
                27851,
                27928
            ],
            [
                27928,
                28026
            ],
            [
                28026,
                28097
            ],
            [
                28097,
                28197
            ],
            [
                28197,
                28234
            ],
            [
                28234,
                28364
            ],
            [
                28364,
                28462
            ],
            [
                28462,
                28512
            ],
            [
                28512,
                28614
            ],
            [
                28614,
                28671
            ],
            [
                28671,
                28744
            ],
            [
                28744,
                28817
            ],
            [
                28817,
                28881
            ],
            [
                28881,
                28942
            ],
            [
                28942,
                29013
            ],
            [
                29013,
                29186
            ],
            [
                29186,
                29285
            ],
            [
                29285,
                29379
            ],
            [
                29379,
                29423
            ],
            [
                29423,
                29514
            ],
            [
                29514,
                29726
            ],
            [
                29726,
                29840
            ],
            [
                29840,
                30049
            ],
            [
                30049,
                30199
            ],
            [
                30199,
                30690
            ],
            [
                30690,
                31240
            ],
            [
                31240,
                31378
            ],
            [
                31378,
                31411
            ],
            [
                31411,
                31584
            ],
            [
                31584,
                31723
            ],
            [
                31723,
                31800
            ],
            [
                31800,
                31841
            ],
            [
                31841,
                31906
            ],
            [
                31906,
                32040
            ],
            [
                32040,
                32060
            ],
            [
                32060,
                32325
            ],
            [
                32325,
                32536
            ],
            [
                32536,
                32590
            ],
            [
                32590,
                32640
            ],
            [
                32640,
                32715
            ],
            [
                32715,
                32780
            ],
            [
                32780,
                32852
            ],
            [
                32852,
                32909
            ],
            [
                32909,
                33004
            ],
            [
                33004,
                33074
            ],
            [
                33074,
                33165
            ],
            [
                33165,
                33340
            ],
            [
                33340,
                33439
            ],
            [
                33439,
                33515
            ],
            [
                33515,
                33570
            ],
            [
                33570,
                33638
            ],
            [
                33638,
                33702
            ],
            [
                33702,
                33777
            ],
            [
                33777,
                33905
            ],
            [
                33905,
                33989
            ],
            [
                33989,
                34027
            ],
            [
                34027,
                34076
            ],
            [
                34076,
                34120
            ],
            [
                34120,
                34174
            ],
            [
                34174,
                34227
            ],
            [
                34227,
                34272
            ],
            [
                34272,
                34316
            ],
            [
                34316,
                34337
            ],
            [
                34337,
                34379
            ],
            [
                34379,
                34453
            ],
            [
                34453,
                34525
            ],
            [
                34525,
                34600
            ],
            [
                34600,
                34658
            ],
            [
                34658,
                34737
            ],
            [
                34737,
                34803
            ],
            [
                34803,
                34874
            ],
            [
                34874,
                34996
            ],
            [
                34996,
                35129
            ],
            [
                35129,
                35294
            ],
            [
                35294,
                35310
            ],
            [
                35310,
                35329
            ],
            [
                35329,
                35455
            ],
            [
                35455,
                35508
            ],
            [
                35508,
                35593
            ],
            [
                35593,
                35609
            ],
            [
                35609,
                35620
            ],
            [
                35620,
                35677
            ],
            [
                35677,
                35755
            ],
            [
                35755,
                35830
            ],
            [
                35830,
                35910
            ],
            [
                35910,
                35980
            ],
            [
                35980,
                36110
            ],
            [
                36110,
                36171
            ],
            [
                36171,
                36189
            ],
            [
                36189,
                36285
            ],
            [
                36285,
                36463
            ]
        ],
        "overlap_chars": [
            [
                121,
                226
            ],
            [
                226,
                300
            ],
            [
                556,
                568
            ],
            [
                589,
                610
            ],
            [
                613,
                614
            ],
            [
                621,
                635
            ],
            [
                769,
                800
            ],
            [
                1093,
                1222
            ],
            [
                1222,
                1292
            ],
            [
                1301,
                1322
            ],
            [
                1329,
                1372
            ],
            [
                1423,
                1424
            ],
            [
                1378,
                1387
            ],
            [
                1325,
                1328
            ],
            [
                1397,
                1423
            ],
            [
                1425,
                1469
            ],
            [
                1471,
                1474
            ],
            [
                1480,
                1530
            ],
            [
                1598,
                1640
            ],
            [
                1642,
                1689
            ],
            [
                1694,
                1704
            ],
            [
                1715,
                1758
            ],
            [
                1758,
                1878
            ],
            [
                1955,
                1957
            ],
            [
                2038,
                2054
            ],
            [
                1980,
                1985
            ],
            [
                2169,
                2172
            ],
            [
                1989,
                1996
            ],
            [
                2023,
                2030
            ],
            [
                2075,
                2104
            ],
            [
                2117,
                2153
            ],
            [
                2154,
                2157
            ],
            [
                1957,
                1960
            ],
            [
                2252,
                2261
            ],
            [
                2261,
                2316
            ],
            [
                2322,
                2337
            ],
            [
                2367,
                2462
            ],
            [
                2499,
                2502
            ],
            [
                2464,
                2497
            ],
            [
                2584,
                2591
            ],
            [
                2556,
                2565
            ],
            [
                2592,
                2607
            ],
            [
                2813,
                2826
            ],
            [
                2831,
                2876
            ],
            [
                2962,
                2970
            ],
            [
                2975,
                3014
            ],
            [
                3014,
                3017
            ],
            [
                3061,
                3074
            ],
            [
                3037,
                3039
            ],
            [
                3075,
                3093
            ],
            [
                3102,
                3116
            ],
            [
                3315,
                3321
            ],
            [
                3340,
                3397
            ],
            [
                3423,
                3463
            ],
            [
                3484,
                3491
            ],
            [
                3467,
                3480
            ],
            [
                3491,
                3493
            ],
            [
                3493,
                3497
            ],
            [
                3542,
                3575
            ],
            [
                3522,
                3531
            ],
            [
                3580,
                3693
            ],
            [
                3740,
                3745
            ],
            [
                3750,
                3755
            ],
            [
                3497,
                3498
            ],
            [
                3809,
                3864
            ],
            [
                3865,
                3946
            ],
            [
                3969,
                3999
            ],
            [
                4015,
                4128
            ],
            [
                4134,
                4137
            ],
            [
                4165,
                4174
            ],
            [
                4158,
                4164
            ],
            [
                4175,
                4199
            ],
            [
                4230,
                4246
            ],
            [
                4374,
                4378
            ],
            [
                4247,
                4255
            ],
            [
                4386,
                4394
            ],
            [
                4255,
                4284
            ],
            [
                4148,
                4150
            ],
            [
                4317,
                4324
            ],
            [
                4314,
                4316
            ],
            [
                4293,
                4304
            ],
            [
                4307,
                4313
            ],
            [
                4325,
                4330
            ],
            [
                4338,
                4370
            ],
            [
                4417,
                4419
            ],
            [
                4419,
                4435
            ],
            [
                4443,
                4508
            ],
            [
                4560,
                4561
            ],
            [
                4908,
                4937
            ],
            [
                4943,
                4972
            ],
            [
                4982,
                5037
            ],
            [
                5037,
                5101
            ],
            [
                5120,
                5195
            ],
            [
                5263,
                5327
            ],
            [
                5340,
                5342
            ],
            [
                5342,
                5415
            ],
            [
                5466,
                5471
            ],
            [
                5488,
                5493
            ],
            [
                5476,
                5482
            ],
            [
                5493,
                5499
            ],
            [
                5501,
                5534
            ],
            [
                5534,
                5576
            ],
            [
                5576,
                5588
            ],
            [
                5597,
                5659
            ],
            [
                5698,
                5744
            ],
            [
                5746,
                5776
            ],
            [
                5776,
                5899
            ],
            [
                5899,
                5920
            ],
            [
                5939,
                5946
            ],
            [
                6001,
                6003
            ],
            [
                6003,
                6167
            ],
            [
                6206,
                6208
            ],
            [
                6208,
                6260
            ],
            [
                6270,
                6383
            ],
            [
                6383,
                6438
            ],
            [
                6458,
                6525
            ],
            [
                6533,
                6544
            ],
            [
                6544,
                6765
            ],
            [
                6766,
                6833
            ],
            [
                6910,
                6970
            ],
            [
                6976,
                6985
            ],
            [
                7005,
                7022
            ],
            [
                7034,
                7061
            ],
            [
                6861,
                6864
            ],
            [
                7129,
                7139
            ],
            [
                7062,
                7072
            ],
            [
                7199,
                7201
            ],
            [
                7201,
                7213
            ],
            [
                7219,
                7292
            ],
            [
                7317,
                7416
            ],
            [
                7423,
                7522
            ],
            [
                7522,
                7529
            ],
            [
                7549,
                7637
            ],
            [
                7645,
                7658
            ],
            [
                7673,
                7696
            ],
            [
                7705,
                7737
            ],
            [
                7750,
                7783
            ],
            [
                7784,
                7793
            ],
            [
                7803,
                7810
            ],
            [
                7822,
                7892
            ],
            [
                7901,
                7902
            ],
            [
                7968,
                7992
            ],
            [
                8005,
                8016
            ],
            [
                7908,
                7910
            ],
            [
                7993,
                7996
            ],
            [
                8016,
                8018
            ],
            [
                8018,
                8119
            ],
            [
                8119,
                8155
            ],
            [
                8519,
                8520
            ],
            [
                8205,
                8210
            ],
            [
                8156,
                8199
            ],
            [
                8258,
                8259
            ],
            [
                8240,
                8258
            ],
            [
                8260,
                8273
            ],
            [
                8211,
                8217
            ],
            [
                8229,
                8236
            ],
            [
                8280,
                8283
            ],
            [
                8288,
                8333
            ],
            [
                8350,
                8376
            ],
            [
                8396,
                8500
            ],
            [
                8539,
                8675
            ],
            [
                8676,
                8776
            ],
            [
                8794,
                8872
            ],
            [
                8872,
                8882
            ],
            [
                8887,
                8894
            ],
            [
                8883,
                8886
            ],
            [
                8899,
                8933
            ],
            [
                8933,
                9000
            ],
            [
                9008,
                9069
            ],
            [
                9117,
                9148
            ],
            [
                9148,
                9195
            ],
            [
                9206,
                9232
            ],
            [
                9232,
                9275
            ],
            [
                9278,
                9295
            ],
            [
                9334,
                9336
            ],
            [
                9336,
                9387
            ],
            [
                9387,
                9442
            ],
            [
                9486,
                9488
            ],
            [
                9488,
                9528
            ],
            [
                9528,
                9574
            ],
            [
                9574,
                9609
            ],
            [
                9638,
                9640
            ],
            [
                9763,
                9905
            ],
            [
                9905,
                9990
            ],
            [
                10007,
                10046
            ],
            [
                10046,
                10091
            ],
            [
                10103,
                10142
            ],
            [
                10212,
                10236
            ],
            [
                10208,
                10211
            ],
            [
                10378,
                10380
            ],
            [
                10390,
                10469
            ],
            [
                10469,
                10508
            ],
            [
                10508,
                10532
            ],
            [
                10602,
                10642
            ],
            [
                10650,
                10795
            ],
            [
                10918,
                10919
            ],
            [
                10797,
                10852
            ],
            [
                10977,
                10995
            ],
            [
                11015,
                11053
            ],
            [
                11055,
                11071
            ],
            [
                11154,
                11156
            ],
            [
                11156,
                11188
            ],
            [
                11188,
                11202
            ],
            [
                11268,
                11270
            ],
            [
                11270,
                11289
            ],
            [
                11289,
                11356
            ],
            [
                11356,
                11417
            ],
            [
                11417,
                11430
            ],
            [
                11430,
                11563
            ],
            [
                11572,
                11591
            ],
            [
                11596,
                11615
            ],
            [
                11628,
                11633
            ],
            [
                11662,
                11740
            ],
            [
                11740,
                11801
            ],
            [
                11883,
                11923
            ],
            [
                12022,
                12064
            ],
            [
                12064,
                12067
            ],
            [
                12094,
                12096
            ],
            [
                12096,
                12205
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12450
            ],
            [
                12478,
                12492
            ],
            [
                12492,
                12502
            ],
            [
                12503,
                12571
            ],
            [
                12583,
                12634
            ],
            [
                12635,
                12651
            ],
            [
                12651,
                12668
            ],
            [
                12697,
                12756
            ],
            [
                12768,
                12818
            ],
            [
                12818,
                12877
            ],
            [
                12877,
                12966
            ],
            [
                12966,
                12980
            ],
            [
                13002,
                13004
            ],
            [
                13061,
                13071
            ],
            [
                13019,
                13028
            ],
            [
                13075,
                13108
            ],
            [
                13110,
                13128
            ],
            [
                13179,
                13194
            ],
            [
                13198,
                13204
            ],
            [
                13175,
                13178
            ],
            [
                13132,
                13139
            ],
            [
                13239,
                13247
            ],
            [
                13304,
                13310
            ],
            [
                13326,
                13333
            ],
            [
                13311,
                13315
            ],
            [
                13368,
                13369
            ],
            [
                13374,
                13390
            ],
            [
                13394,
                13419
            ],
            [
                13419,
                13434
            ],
            [
                13448,
                13478
            ],
            [
                13483,
                13490
            ],
            [
                13509,
                13514
            ],
            [
                13525,
                13622
            ],
            [
                13622,
                13635
            ],
            [
                13678,
                13681
            ],
            [
                13641,
                13677
            ],
            [
                13752,
                13800
            ],
            [
                13800,
                13847
            ],
            [
                13885,
                13908
            ],
            [
                13924,
                13925
            ],
            [
                14046,
                14050
            ],
            [
                14026,
                14035
            ],
            [
                14055,
                14145
            ],
            [
                14159,
                14177
            ],
            [
                14224,
                14227
            ],
            [
                13990,
                13991
            ],
            [
                14258,
                14301
            ],
            [
                14370,
                14400
            ],
            [
                14406,
                14430
            ],
            [
                14254,
                14257
            ],
            [
                14347,
                14359
            ],
            [
                14430,
                14432
            ],
            [
                14432,
                14497
            ],
            [
                14504,
                14524
            ],
            [
                14524,
                14561
            ],
            [
                14644,
                14657
            ],
            [
                14577,
                14580
            ],
            [
                14672,
                14678
            ],
            [
                14678,
                14767
            ],
            [
                14769,
                14801
            ],
            [
                14817,
                14828
            ],
            [
                14842,
                14851
            ],
            [
                14851,
                14879
            ],
            [
                14890,
                14903
            ],
            [
                14969,
                14971
            ],
            [
                15220,
                15232
            ],
            [
                15233,
                15237
            ],
            [
                15247,
                15248
            ],
            [
                15695,
                15718
            ],
            [
                15719,
                15741
            ],
            [
                15332,
                15335
            ],
            [
                15619,
                15638
            ],
            [
                15741,
                15743
            ],
            [
                15744,
                15792
            ],
            [
                15792,
                15855
            ],
            [
                16028,
                16039
            ],
            [
                16041,
                16046
            ],
            [
                16048,
                16059
            ],
            [
                16059,
                16105
            ],
            [
                16138,
                16141
            ],
            [
                16110,
                16115
            ],
            [
                16141,
                16143
            ],
            [
                16143,
                16161
            ],
            [
                16161,
                16209
            ],
            [
                16216,
                16219
            ],
            [
                16237,
                16239
            ],
            [
                16239,
                16243
            ],
            [
                16251,
                16263
            ],
            [
                16266,
                16297
            ],
            [
                16297,
                16321
            ],
            [
                16333,
                16350
            ],
            [
                16350,
                16351
            ],
            [
                16355,
                16387
            ],
            [
                16387,
                16423
            ],
            [
                16423,
                16429
            ],
            [
                16434,
                16531
            ],
            [
                16531,
                16571
            ],
            [
                16571,
                16598
            ],
            [
                16598,
                16672
            ],
            [
                16672,
                16727
            ],
            [
                16727,
                16754
            ],
            [
                16756,
                16771
            ],
            [
                16778,
                16779
            ],
            [
                16787,
                16825
            ],
            [
                16836,
                16856
            ],
            [
                16856,
                16857
            ],
            [
                16879,
                16882
            ],
            [
                16886,
                16938
            ],
            [
                16987,
                16996
            ],
            [
                17015,
                17040
            ],
            [
                16977,
                16978
            ],
            [
                17050,
                17098
            ],
            [
                17098,
                17128
            ],
            [
                17135,
                17154
            ],
            [
                17159,
                17160
            ],
            [
                17167,
                17174
            ],
            [
                17179,
                17194
            ],
            [
                17155,
                17159
            ],
            [
                17194,
                17245
            ],
            [
                17245,
                17290
            ],
            [
                17290,
                17300
            ],
            [
                17309,
                17325
            ],
            [
                17325,
                17331
            ],
            [
                17335,
                17372
            ],
            [
                17372,
                17400
            ],
            [
                17406,
                17408
            ],
            [
                17408,
                17446
            ],
            [
                17503,
                17556
            ],
            [
                17575,
                17598
            ],
            [
                17598,
                17715
            ],
            [
                17715,
                17817
            ],
            [
                17817,
                17873
            ],
            [
                17873,
                17883
            ],
            [
                17894,
                17913
            ],
            [
                17913,
                17914
            ],
            [
                17922,
                17973
            ],
            [
                17973,
                18012
            ],
            [
                18014,
                18018
            ],
            [
                18019,
                18036
            ],
            [
                18036,
                18058
            ],
            [
                18098,
                18100
            ],
            [
                18100,
                18126
            ],
            [
                18136,
                18179
            ],
            [
                18179,
                18262
            ],
            [
                18294,
                18296
            ],
            [
                18296,
                18416
            ],
            [
                18424,
                18426
            ],
            [
                18462,
                18471
            ],
            [
                18476,
                18498
            ],
            [
                18426,
                18433
            ],
            [
                18535,
                18563
            ],
            [
                18565,
                18624
            ],
            [
                18624,
                18668
            ],
            [
                18669,
                18677
            ],
            [
                18677,
                18708
            ],
            [
                18708,
                18811
            ],
            [
                18812,
                18814
            ],
            [
                18823,
                18838
            ],
            [
                18876,
                18878
            ],
            [
                19035,
                19038
            ],
            [
                18940,
                18951
            ],
            [
                18966,
                18980
            ],
            [
                18908,
                18910
            ],
            [
                19051,
                19065
            ],
            [
                19072,
                19074
            ],
            [
                19074,
                19101
            ],
            [
                19126,
                19214
            ],
            [
                19215,
                19218
            ],
            [
                19402,
                19409
            ],
            [
                19308,
                19316
            ],
            [
                19332,
                19334
            ],
            [
                19240,
                19243
            ],
            [
                19497,
                19499
            ],
            [
                19499,
                19536
            ],
            [
                19563,
                19565
            ],
            [
                19568,
                19571
            ],
            [
                19577,
                19625
            ],
            [
                19630,
                19638
            ],
            [
                19668,
                19703
            ],
            [
                19703,
                19735
            ],
            [
                19742,
                19743
            ],
            [
                19762,
                19832
            ],
            [
                19956,
                19958
            ],
            [
                20000,
                20016
            ],
            [
                19937,
                19940
            ],
            [
                20017,
                20039
            ],
            [
                20123,
                20132
            ],
            [
                20137,
                20143
            ],
            [
                20143,
                20163
            ],
            [
                20276,
                20361
            ],
            [
                20366,
                20395
            ],
            [
                20409,
                20411
            ],
            [
                20616,
                20622
            ],
            [
                20591,
                20614
            ],
            [
                20747,
                20752
            ],
            [
                20536,
                20537
            ],
            [
                20632,
                20662
            ],
            [
                20623,
                20624
            ],
            [
                20663,
                20671
            ],
            [
                20806,
                20808
            ],
            [
                20808,
                20835
            ],
            [
                20843,
                20845
            ],
            [
                20956,
                20976
            ],
            [
                20991,
                21054
            ],
            [
                21187,
                21189
            ],
            [
                21189,
                21202
            ],
            [
                21347,
                21357
            ],
            [
                21210,
                21212
            ],
            [
                21405,
                21407
            ],
            [
                21380,
                21398
            ],
            [
                21333,
                21334
            ],
            [
                21415,
                21434
            ],
            [
                21446,
                21512
            ],
            [
                21640,
                21657
            ],
            [
                22052,
                22054
            ],
            [
                21688,
                21708
            ],
            [
                21718,
                21721
            ],
            [
                21732,
                21739
            ],
            [
                21933,
                21936
            ],
            [
                21748,
                21751
            ],
            [
                21766,
                21909
            ],
            [
                22124,
                22125
            ],
            [
                22319,
                22354
            ],
            [
                22362,
                22406
            ],
            [
                22483,
                22485
            ],
            [
                22496,
                22547
            ],
            [
                22555,
                22559
            ],
            [
                22584,
                22609
            ],
            [
                22609,
                22619
            ],
            [
                22624,
                22684
            ],
            [
                22684,
                22762
            ],
            [
                22766,
                22771
            ],
            [
                22796,
                22798
            ],
            [
                22818,
                22860
            ],
            [
                22860,
                22863
            ],
            [
                22898,
                22925
            ],
            [
                22925,
                22978
            ],
            [
                22980,
                23101
            ],
            [
                23126,
                23128
            ],
            [
                23128,
                23135
            ],
            [
                23157,
                23163
            ],
            [
                23150,
                23153
            ],
            [
                23163,
                23206
            ],
            [
                23206,
                23248
            ],
            [
                23248,
                23294
            ],
            [
                23296,
                23299
            ],
            [
                23345,
                23515
            ],
            [
                23515,
                23524
            ],
            [
                23525,
                23596
            ],
            [
                23613,
                23622
            ],
            [
                23623,
                23657
            ],
            [
                23657,
                23696
            ],
            [
                23696,
                23755
            ],
            [
                23755,
                23771
            ],
            [
                23779,
                23885
            ],
            [
                23885,
                23998
            ],
            [
                24054,
                24110
            ],
            [
                24123,
                24141
            ],
            [
                24141,
                24225
            ],
            [
                24464,
                24467
            ],
            [
                24251,
                24319
            ],
            [
                24322,
                24413
            ],
            [
                24421,
                24434
            ],
            [
                24488,
                24636
            ],
            [
                24686,
                24688
            ],
            [
                24688,
                24729
            ],
            [
                24767,
                24769
            ],
            [
                24769,
                24803
            ],
            [
                24803,
                24829
            ],
            [
                24829,
                24912
            ],
            [
                24912,
                24950
            ],
            [
                24950,
                24986
            ],
            [
                24986,
                25013
            ],
            [
                25013,
                25050
            ],
            [
                25050,
                25122
            ],
            [
                25127,
                25176
            ],
            [
                25176,
                25235
            ],
            [
                25235,
                25238
            ],
            [
                25250,
                25314
            ],
            [
                25314,
                25335
            ],
            [
                25345,
                25416
            ],
            [
                25416,
                25468
            ],
            [
                25576,
                25662
            ],
            [
                25664,
                25668
            ],
            [
                25670,
                25678
            ],
            [
                25678,
                25704
            ],
            [
                25704,
                25744
            ],
            [
                25755,
                25757
            ],
            [
                25757,
                25761
            ],
            [
                25770,
                25787
            ],
            [
                25832,
                25860
            ],
            [
                25860,
                25907
            ],
            [
                25911,
                25928
            ],
            [
                25951,
                25953
            ],
            [
                25953,
                25985
            ],
            [
                25998,
                26001
            ],
            [
                26001,
                26025
            ],
            [
                26025,
                26034
            ],
            [
                26039,
                26184
            ],
            [
                26186,
                26233
            ],
            [
                26408,
                26414
            ],
            [
                26334,
                26337
            ],
            [
                26414,
                26449
            ],
            [
                26461,
                26516
            ],
            [
                26347,
                26349
            ],
            [
                26544,
                26575
            ],
            [
                26675,
                26676
            ],
            [
                26680,
                26818
            ],
            [
                26895,
                26896
            ],
            [
                26947,
                27027
            ],
            [
                27027,
                27078
            ],
            [
                27099,
                27136
            ],
            [
                27136,
                27212
            ],
            [
                27212,
                27249
            ],
            [
                27249,
                27364
            ],
            [
                27364,
                27463
            ],
            [
                27478,
                27480
            ],
            [
                27480,
                27481
            ],
            [
                27520,
                27539
            ],
            [
                27539,
                27541
            ],
            [
                27541,
                27655
            ],
            [
                27655,
                27711
            ],
            [
                27928,
                27947
            ],
            [
                27974,
                28026
            ],
            [
                28026,
                28097
            ],
            [
                28097,
                28120
            ],
            [
                28135,
                28163
            ],
            [
                28165,
                28197
            ],
            [
                28197,
                28234
            ],
            [
                28234,
                28283
            ],
            [
                28302,
                28330
            ],
            [
                28332,
                28364
            ],
            [
                28364,
                28418
            ],
            [
                28460,
                28462
            ],
            [
                28462,
                28512
            ],
            [
                28512,
                28558
            ],
            [
                28560,
                28598
            ],
            [
                28607,
                28614
            ],
            [
                28614,
                28615
            ],
            [
                28623,
                28671
            ],
            [
                28671,
                28674
            ],
            [
                28716,
                28725
            ],
            [
                28735,
                28744
            ],
            [
                28744,
                28817
            ],
            [
                28817,
                28831
            ],
            [
                28844,
                28881
            ],
            [
                28881,
                28906
            ],
            [
                28908,
                28942
            ],
            [
                28942,
                28978
            ],
            [
                28980,
                29013
            ],
            [
                29013,
                29042
            ],
            [
                29044,
                29057
            ],
            [
                29087,
                29106
            ],
            [
                29145,
                29186
            ],
            [
                29285,
                29324
            ],
            [
                29361,
                29377
            ],
            [
                29350,
                29351
            ],
            [
                29379,
                29423
            ],
            [
                29423,
                29514
            ],
            [
                29514,
                29687
            ],
            [
                29704,
                29725
            ],
            [
                29726,
                29788
            ],
            [
                29838,
                29840
            ],
            [
                29840,
                29848
            ],
            [
                29855,
                29862
            ],
            [
                29890,
                29952
            ],
            [
                29960,
                30030
            ],
            [
                30034,
                30049
            ],
            [
                30049,
                30072
            ],
            [
                30073,
                30086
            ],
            [
                30090,
                30097
            ],
            [
                30197,
                30199
            ],
            [
                30199,
                30238
            ],
            [
                30248,
                30271
            ],
            [
                30287,
                30298
            ],
            [
                30304,
                30307
            ],
            [
                30410,
                30411
            ],
            [
                30383,
                30386
            ],
            [
                30284,
                30286
            ],
            [
                30350,
                30351
            ],
            [
                30353,
                30354
            ],
            [
                30688,
                30690
            ],
            [
                30827,
                30866
            ],
            [
                30907,
                30953
            ],
            [
                30962,
                30971
            ],
            [
                30984,
                30993
            ],
            [
                30734,
                30735
            ],
            [
                31138,
                31240
            ],
            [
                31240,
                31299
            ],
            [
                31301,
                31378
            ],
            [
                31378,
                31408
            ],
            [
                32041,
                32059
            ],
            [
                32060,
                32111
            ],
            [
                32144,
                32175
            ],
            [
                32202,
                32209
            ],
            [
                32183,
                32195
            ],
            [
                32214,
                32248
            ],
            [
                32124,
                32125
            ],
            [
                32253,
                32259
            ],
            [
                32140,
                32143
            ],
            [
                32260,
                32325
            ],
            [
                31584,
                31677
            ],
            [
                31686,
                31723
            ],
            [
                31723,
                31724
            ],
            [
                31800,
                31840
            ],
            [
                31841,
                31905
            ],
            [
                31906,
                31929
            ],
            [
                31948,
                32010
            ],
            [
                32024,
                32027
            ],
            [
                32037,
                32040
            ],
            [
                32325,
                32357
            ],
            [
                32392,
                32433
            ],
            [
                32534,
                32536
            ],
            [
                32536,
                32537
            ],
            [
                32547,
                32566
            ],
            [
                32543,
                32546
            ],
            [
                32576,
                32590
            ],
            [
                32590,
                32626
            ],
            [
                32634,
                32640
            ],
            [
                32640,
                32704
            ],
            [
                32706,
                32715
            ],
            [
                32715,
                32737
            ],
            [
                32778,
                32780
            ],
            [
                32780,
                32852
            ],
            [
                32852,
                32869
            ],
            [
                32907,
                32909
            ],
            [
                32909,
                32941
            ],
            [
                32949,
                33004
            ],
            [
                33074,
                33075
            ],
            [
                33089,
                33142
            ],
            [
                33163,
                33165
            ],
            [
                33165,
                33183
            ],
            [
                33203,
                33312
            ],
            [
                33323,
                33340
            ],
            [
                33340,
                33363
            ],
            [
                33380,
                33412
            ],
            [
                33437,
                33439
            ],
            [
                33519,
                33548
            ],
            [
                33550,
                33570
            ],
            [
                33570,
                33638
            ],
            [
                33905,
                33989
            ],
            [
                33989,
                34027
            ],
            [
                34181,
                34225
            ],
            [
                34316,
                34337
            ],
            [
                34337,
                34379
            ],
            [
                34379,
                34453
            ],
            [
                34453,
                34525
            ],
            [
                34525,
                34583
            ],
            [
                34600,
                34658
            ],
            [
                34662,
                34665
            ],
            [
                34673,
                34705
            ],
            [
                34710,
                34737
            ],
            [
                34737,
                34752
            ],
            [
                34803,
                34815
            ],
            [
                34823,
                34874
            ],
            [
                34874,
                34953
            ],
            [
                34983,
                34996
            ],
            [
                35014,
                35059
            ],
            [
                35060,
                35066
            ],
            [
                35127,
                35129
            ],
            [
                35129,
                35148
            ],
            [
                35150,
                35179
            ],
            [
                35199,
                35294
            ],
            [
                35294,
                35310
            ],
            [
                35310,
                35329
            ],
            [
                35465,
                35508
            ],
            [
                35508,
                35511
            ],
            [
                35531,
                35554
            ],
            [
                35521,
                35530
            ],
            [
                35563,
                35587
            ],
            [
                35590,
                35593
            ],
            [
                35593,
                35609
            ],
            [
                35609,
                35620
            ],
            [
                35620,
                35677
            ],
            [
                35677,
                35755
            ],
            [
                35755,
                35789
            ],
            [
                35798,
                35830
            ],
            [
                35830,
                35835
            ],
            [
                35840,
                35845
            ],
            [
                35851,
                35910
            ],
            [
                36110,
                36171
            ],
            [
                36171,
                36189
            ],
            [
                36189,
                36285
            ],
            [
                36285,
                36463
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                121
            ],
            [
                121,
                226
            ],
            [
                226,
                800
            ],
            [
                800,
                1093
            ],
            [
                1093,
                1222
            ],
            [
                1222,
                1322
            ],
            [
                1322,
                1758
            ],
            [
                1758,
                1957
            ],
            [
                1957,
                2261
            ],
            [
                2261,
                2608
            ],
            [
                2608,
                2813
            ],
            [
                2813,
                3014
            ],
            [
                3014,
                3493
            ],
            [
                3493,
                3865
            ],
            [
                3865,
                4419
            ],
            [
                4419,
                4562
            ],
            [
                4562,
                4908
            ],
            [
                4908,
                5037
            ],
            [
                5037,
                5342
            ],
            [
                5342,
                5501
            ],
            [
                5501,
                5534
            ],
            [
                5534,
                5576
            ],
            [
                5576,
                5746
            ],
            [
                5746,
                5776
            ],
            [
                5776,
                5899
            ],
            [
                5899,
                6003
            ],
            [
                6003,
                6208
            ],
            [
                6208,
                6383
            ],
            [
                6383,
                6544
            ],
            [
                6544,
                6766
            ],
            [
                6766,
                7201
            ],
            [
                7201,
                7522
            ],
            [
                7522,
                7784
            ],
            [
                7784,
                8018
            ],
            [
                8018,
                8119
            ],
            [
                8119,
                8676
            ],
            [
                8676,
                8872
            ],
            [
                8872,
                8933
            ],
            [
                8933,
                9148
            ],
            [
                9148,
                9232
            ],
            [
                9232,
                9336
            ],
            [
                9336,
                9387
            ],
            [
                9387,
                9488
            ],
            [
                9488,
                9528
            ],
            [
                9528,
                9574
            ],
            [
                9574,
                9640
            ],
            [
                9640,
                9719
            ],
            [
                9719,
                9763
            ],
            [
                9763,
                9905
            ],
            [
                9905,
                10046
            ],
            [
                10046,
                10142
            ],
            [
                10142,
                10380
            ],
            [
                10380,
                10469
            ],
            [
                10469,
                10508
            ],
            [
                10508,
                11156
            ],
            [
                11156,
                11188
            ],
            [
                11188,
                11270
            ],
            [
                11270,
                11289
            ],
            [
                11289,
                11356
            ],
            [
                11356,
                11417
            ],
            [
                11417,
                11430
            ],
            [
                11430,
                11740
            ],
            [
                11740,
                11801
            ],
            [
                11801,
                11883
            ],
            [
                11883,
                11924
            ],
            [
                11924,
                12022
            ],
            [
                12022,
                12064
            ],
            [
                12064,
                12096
            ],
            [
                12096,
                12207
            ],
            [
                12207,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12450
            ],
            [
                12450,
                12492
            ],
            [
                12492,
                12635
            ],
            [
                12635,
                12651
            ],
            [
                12651,
                12818
            ],
            [
                12818,
                12877
            ],
            [
                12877,
                12966
            ],
            [
                12966,
                13004
            ],
            [
                13004,
                13128
            ],
            [
                13128,
                13247
            ],
            [
                13247,
                13419
            ],
            [
                13419,
                13622
            ],
            [
                13622,
                13800
            ],
            [
                13800,
                13926
            ],
            [
                13926,
                13956
            ],
            [
                13956,
                14432
            ],
            [
                14432,
                14524
            ],
            [
                14524,
                14678
            ],
            [
                14678,
                14801
            ],
            [
                14801,
                14851
            ],
            [
                14851,
                14971
            ],
            [
                14971,
                15036
            ],
            [
                15036,
                15219
            ],
            [
                15219,
                15743
            ],
            [
                15743,
                15792
            ],
            [
                15792,
                15855
            ],
            [
                15855,
                16028
            ],
            [
                16028,
                16059
            ],
            [
                16059,
                16143
            ],
            [
                16143,
                16161
            ],
            [
                16161,
                16239
            ],
            [
                16239,
                16297
            ],
            [
                16297,
                16350
            ],
            [
                16350,
                16387
            ],
            [
                16387,
                16423
            ],
            [
                16423,
                16531
            ],
            [
                16531,
                16571
            ],
            [
                16571,
                16598
            ],
            [
                16598,
                16672
            ],
            [
                16672,
                16727
            ],
            [
                16727,
                16856
            ],
            [
                16856,
                16940
            ],
            [
                16940,
                17098
            ],
            [
                17098,
                17245
            ],
            [
                17245,
                17290
            ],
            [
                17290,
                17325
            ],
            [
                17325,
                17331
            ],
            [
                17331,
                17372
            ],
            [
                17372,
                17408
            ],
            [
                17408,
                17446
            ],
            [
                17446,
                17503
            ],
            [
                17503,
                17598
            ],
            [
                17598,
                17715
            ],
            [
                17715,
                17817
            ],
            [
                17817,
                17873
            ],
            [
                17873,
                17913
            ],
            [
                17913,
                17973
            ],
            [
                17973,
                18036
            ],
            [
                18036,
                18100
            ],
            [
                18100,
                18126
            ],
            [
                18126,
                18179
            ],
            [
                18179,
                18296
            ],
            [
                18296,
                18426
            ],
            [
                18426,
                18624
            ],
            [
                18624,
                18677
            ],
            [
                18677,
                18878
            ],
            [
                18878,
                19074
            ],
            [
                19074,
                19499
            ],
            [
                19499,
                19565
            ],
            [
                19565,
                19703
            ],
            [
                19703,
                19832
            ],
            [
                19832,
                20143
            ],
            [
                20143,
                20411
            ],
            [
                20411,
                20808
            ],
            [
                20808,
                21189
            ],
            [
                21189,
                21512
            ],
            [
                21512,
                21640
            ],
            [
                21640,
                22126
            ],
            [
                22126,
                22319
            ],
            [
                22319,
                22485
            ],
            [
                22485,
                22684
            ],
            [
                22684,
                22860
            ],
            [
                22860,
                22925
            ],
            [
                22925,
                22980
            ],
            [
                22980,
                23128
            ],
            [
                23128,
                23206
            ],
            [
                23206,
                23248
            ],
            [
                23248,
                23515
            ],
            [
                23515,
                23657
            ],
            [
                23657,
                23696
            ],
            [
                23696,
                23755
            ],
            [
                23755,
                23885
            ],
            [
                23885,
                24141
            ],
            [
                24141,
                24225
            ],
            [
                24225,
                24688
            ],
            [
                24688,
                24769
            ],
            [
                24769,
                24803
            ],
            [
                24803,
                24829
            ],
            [
                24829,
                24912
            ],
            [
                24912,
                24950
            ],
            [
                24950,
                24986
            ],
            [
                24986,
                25013
            ],
            [
                25013,
                25050
            ],
            [
                25050,
                25176
            ],
            [
                25176,
                25235
            ],
            [
                25235,
                25314
            ],
            [
                25314,
                25416
            ],
            [
                25416,
                25470
            ],
            [
                25470,
                25576
            ],
            [
                25576,
                25678
            ],
            [
                25678,
                25704
            ],
            [
                25704,
                25757
            ],
            [
                25757,
                25860
            ],
            [
                25860,
                25953
            ],
            [
                25953,
                26001
            ],
            [
                26001,
                26025
            ],
            [
                26025,
                26325
            ],
            [
                26325,
                26576
            ],
            [
                26576,
                26675
            ],
            [
                26675,
                27027
            ],
            [
                27027,
                27136
            ],
            [
                27136,
                27212
            ],
            [
                27212,
                27249
            ],
            [
                27249,
                27364
            ],
            [
                27364,
                27480
            ],
            [
                27480,
                27541
            ],
            [
                27541,
                27655
            ],
            [
                27655,
                27851
            ],
            [
                27851,
                27928
            ],
            [
                27928,
                28026
            ],
            [
                28026,
                28097
            ],
            [
                28097,
                28197
            ],
            [
                28197,
                28234
            ],
            [
                28234,
                28364
            ],
            [
                28364,
                28462
            ],
            [
                28462,
                28512
            ],
            [
                28512,
                28614
            ],
            [
                28614,
                28671
            ],
            [
                28671,
                28744
            ],
            [
                28744,
                28817
            ],
            [
                28817,
                28881
            ],
            [
                28881,
                28942
            ],
            [
                28942,
                29013
            ],
            [
                29013,
                29186
            ],
            [
                29186,
                29285
            ],
            [
                29285,
                29423
            ],
            [
                29423,
                29514
            ],
            [
                29514,
                29726
            ],
            [
                29726,
                29840
            ],
            [
                29840,
                30049
            ],
            [
                30049,
                30199
            ],
            [
                30199,
                30690
            ],
            [
                30690,
                31240
            ],
            [
                31240,
                31378
            ],
            [
                31378,
                31411
            ],
            [
                31411,
                31584
            ],
            [
                31584,
                32325
            ],
            [
                32325,
                32536
            ],
            [
                32536,
                32590
            ],
            [
                32590,
                32640
            ],
            [
                32640,
                32715
            ],
            [
                32715,
                32780
            ],
            [
                32780,
                32852
            ],
            [
                32852,
                32909
            ],
            [
                32909,
                33004
            ],
            [
                33004,
                33074
            ],
            [
                33074,
                33165
            ],
            [
                33165,
                33340
            ],
            [
                33340,
                33439
            ],
            [
                33439,
                33515
            ],
            [
                33515,
                33570
            ],
            [
                33570,
                33638
            ],
            [
                33638,
                33702
            ],
            [
                33702,
                33777
            ],
            [
                33777,
                33905
            ],
            [
                33905,
                33989
            ],
            [
                33989,
                34027
            ],
            [
                34027,
                34076
            ],
            [
                34076,
                34120
            ],
            [
                34120,
                34174
            ],
            [
                34174,
                34227
            ],
            [
                34227,
                34272
            ],
            [
                34272,
                34316
            ],
            [
                34316,
                34337
            ],
            [
                34337,
                34379
            ],
            [
                34379,
                34453
            ],
            [
                34453,
                34525
            ],
            [
                34525,
                34658
            ],
            [
                34658,
                34737
            ],
            [
                34737,
                34874
            ],
            [
                34874,
                34996
            ],
            [
                34996,
                35129
            ],
            [
                35129,
                35294
            ],
            [
                35294,
                35310
            ],
            [
                35310,
                35329
            ],
            [
                35329,
                35455
            ],
            [
                35455,
                35508
            ],
            [
                35508,
                35593
            ],
            [
                35593,
                35609
            ],
            [
                35609,
                35620
            ],
            [
                35620,
                35677
            ],
            [
                35677,
                35755
            ],
            [
                35755,
                35830
            ],
            [
                35830,
                35910
            ],
            [
                35910,
                35980
            ],
            [
                35980,
                36110
            ],
            [
                36110,
                36171
            ],
            [
                36171,
                36189
            ],
            [
                36189,
                36285
            ],
            [
                36285,
                36463
            ]
        ]
    },
    "abridged": {
        "text": "Pity that Offendene was not the home of Miss Harleth's childhood, or endeared to her by family memories! A human life, I think, should be well rooted in some spot of a native land; a spot where early memories may be entwined with affection as a sweet habit of the blood. The best introduction to astronomy is to think of the nightly heavens as a little lot of stars belonging to one's own homestead.\nBut this blessed persistence in which affection can take root had been lacking in Gwendolen's life. Only a year before her recall from Leubronn, Offendene was chosen as her mamma's home simply for its nearness to Pennicote Rectory; and Mrs. Davilow, Gwendolen, and her four half-sisters were driven along the avenue for the first time on a late October afternoon when the rooks were cawing loudly, and the yellow elm-leaves were whirling.\nThe season suited the aspect of the old oblong red-brick house, rather too anxiously ornamented with stone at every line. The building was softened with green and grey lichen, so that there was no harshness in the face which it turned to the three avenues that cut through the grounds. One would have liked the house to have been lifted on a hill, so as to look over to the long thatched roofs of the distant villages, the church towers, the scattered homesteads and the gradual rise of surging woods in that beautiful part of Wessex.\nThe house was just large enough to be called a mansion, and had been let with sombre furniture and faded upholstery. But nobody could suppose it to be inhabited by trades-people: and to live in a house which had once sufficed for dowager countesses added to Mrs. Davilow's satisfaction in having her own establishment. This was suddenly possible on the death of Gwendolen's step-father, Captain Davilow, who had for the last nine years joined his family only in a brief and fitful manner; but Gwendolen cared not why, only that her prospects had become more agreeable in consequence.\nShe had disliked their former way of life, roving from one foreign watering-place to another, always feeling new dislike for new suites of hired furniture, and meeting new people under conditions which made her appear of little importance. The two years she had passed at a showy school, where she had been put in a foremost position, had only deepened her sense of herself as an exceptional person who could not remain in ordinary circumstances. Any fear of this evil was banished now that her mamma was to have an establishment.\nShe would probably have known more about her father but for an incident which happened when she was twelve years old. Mrs. Davilow had brought out, as she did only at wide intervals, mementos of her first husband, and while showing his miniature to Gwendolen recalled the fact that dear papa had died when his little daughter was in baby-clothes. Gwendolen, immediately thinking of the unlovable step-father whom she had known while she was in short frocks, said-\n\"Why did you marry again, mamma? It would have been nicer if you had not.\"\nMrs. Davilow coloured deeply, a slight convulsive movement passed over her face, and she said, with a violence quite unusual in her-\n\"You have no feeling, child!\"\nGwendolen, who was fond of her mamma, felt hurt and ashamed, and had never since dared to ask a question about her father.\nThis was not the only time she had felt a painful guilt towards her mother. It was always arranged, when possible, that she should have a small bed in her mamma's room; for Mrs. Davilow's motherly tenderness clung chiefly to her eldest girl. One night under an attack of pain she found that the medicine regularly placed by her bedside had been forgotten, and begged Gwendolen to get out of bed and reach it for her. That healthy young lady, snug and warm as a rosy infant, objected to step out into the cold, and lying perfectly still, grumbled a refusal. Mrs. Davilow went without the medicine and never reproached her daughter; but the next day Gwendolen was keenly conscious of what must be in her mamma's mind, and tried to make amends by caresses which cost her no effort.\nHaving always been the pet and pride of the household, waited on by all, she naturally found it difficult to think her own pleasure unimportant, and when it was thwarted felt an astonished and passionate resentment. Though never as a child thoughtlessly cruel, nay delighting to rescue drowning insects, there was a disagreeable silent remembrance of her having strangled her sister's canary-bird in a fit of exasperation at its shrill singing which had again and again jarringly interrupted her own. She had bought a white mouse for her sister in retribution, and though inwardly excusing herself on the grounds of a peculiar sensitivity which was a mark of her superiority, the thought of that understandable murder had always made her wince.\nGwendolen was not without remorse, but she liked to make her penances easy, and now that she was twenty, she guarded herself from the humiliation of penance. There was more show of fire and will in her than ever, but there was more calculation underneath it.\nOn this day of arrival at Offendene, a place which not even Mrs. Davilow had seen before, her brother-in-law Mr. Gascoigne having rented it for her - all four got down from the carriage, and were standing in front of the open door, to have a general view of the place and a glimpse of the stone hall and staircase hung with sombre pictures. No one spoke; mamma, the four sisters and the governess all looked at Gwendolen, as if their feelings depended entirely on her decision.\nOf the girls, from Alice in her sixteenth year to Isabel in her tenth, hardly anything could be said but that they were girlish, and that their black dresses were getting shabby. Miss Merry, the elderly governess, was altogether neutral in expression. Mrs. Davilow's worn beauty seemed the more pathetic for the look of appeal which she cast at Gwendolen, who was glancing round at her surroundings with an air of rapid judgment. Imagine a young race-horse in the paddock among ponies and patient hacks.\n\"Well, dear, what do you think of the place?\" said Mrs. Davilow.\n\"I think it is charming,\" said Gwendolen, quickly. \"A romantic place; anything delightful may happen in it. No one need be ashamed of living here.\"\n\"There is certainly nothing common about it.\"\n\"Oh, it would do for fallen royalty. But I thought my uncle and aunt Gascoigne would be here to meet us, and my cousin Anna,\" added Gwendolen, her tone changed to sharp surprise.\n\"We are early,\" said Mrs. Davilow, and entering the hall, she said to the housekeeper, \"You expect Mr. and Mrs. Gascoigne?\"\n\"Yes, madam; they were here yesterday to give orders about the fires and the dinner. Everything is well aired and cleaned. When Mr. and Mrs. Gascoigne come, they'll tell you nothing has been neglected. They'll be here at five, for certain.\"\nThis satisfied Gwendolen; and after tripping a little way up the stone staircase to take a survey there, she tripped down again, and followed by all the girls looked into each of the rooms opening from the hall - the dining-room all dark oak and worn red satin damask, the library with a smell of old brown-leather; and lastly the drawing-room.\n\"Mamma, mamma, pray come here!\" said Gwendolen. \"Here is an organ. I will be Saint Cecilia: some one shall paint me as Saint Cecilia. Jocosa (this was her name for Miss Merry), let down my hair. See, mamma?\"\nShe had thrown off her hat and gloves, and seated herself before the organ in an admirable pose, looking upward; while the submissive Jocosa took out the comb which fastened her hair, till it fell in a smooth light-brown stream far below its owner's slim waist.\nMrs. Davilow smiled and said, \"A charming picture, my dear!\" Gwendolen rose and laughed with delight.\n\"What a queer, quaint, picturesque room!\" she said. \"I like these old embroidered chairs, and the garlands on the wainscot, and the pictures that may be anything.\"\n\"Oh, Gwendolen!\" said the small Isabel, in a tone of astonishment, while she held open a hinged panel of the wainscot at the other end of the room.\nEveryone went to look. The opened wall-panel had disclosed the picture of an upturned dead face, from which a figure seemed to be fleeing with outstretched arms.\n\"How horrible!\" said Mrs. Davilow; but Gwendolen shuddered silently, and Isabel, a plain and inconvenient child with an alarming memory, said,\n\"You will never stay in this room by yourself, Gwendolen.\"\n\"How dare you open things which were meant to be shut up, you perverse little creature?\" said Gwendolen angrily. She closed the panel hastily, saying, \"There is a lock - where is the key? Let nobody open this again; and bring the key to me.\"\nThen turning with a flushed face, she said, \"Let us go to our own room, mamma.\"\nThe housekeeper found the key in the drawer of a cabinet, and later handed it to Bugle, the lady's-maid, telling her significantly to give it to her Royal Highness.\n\"I don't know who you mean, Mrs. Startin,\" said Bugle, rather offended at this irony in a new servant.\n\"I mean the young lady that's to command us all,\" replied Mrs. Startin.\nWhen Gwendolen and Mrs. Davilow entered their black and yellow bedroom, where a pretty little white couch sat by the side of the bed, Gwendolen's first movement was to go to the tall mirror, while her mamma sat down and looked at the reflection of her daughter and the room.\n\"That is a becoming glass, Gwendolen; or is it the black and gold colour that sets you off?\" said Mrs. Davilow, as Gwendolen stood brushing back her hair.\n\"I should make a tolerable St. Cecilia with some white roses on my head,\" said Gwendolen, \"only how about my nose, mamma? Saints' noses never turn up. I wish you had given me your straight nose. Now, mamma,\" she said, going to help her mamma undress with caressing touches, \"you should be happy. Can nobody be happy after they are quite young? You have made me feel sometimes as if nothing were of any use. But now you might be happy.\"\n\"So I shall, dear,\" said Mrs. Davilow, patting her cheek.\n\"Yes, but really. Not with a sort of make-believe,\" said Gwendolen resolutely. \"See your hand and arm!- much more beautiful than mine. Anyone can see you were more beautiful.\"\n\"No, dear; I was always heavier. Never half so charming as you are.\"\n\"Well, what is the use of my being charming, if it is to end in my being dull and not minding anything? Is that what marriage always comes to?\"\n\"No, child, certainly not. Marriage is the only happy state for a woman, as I trust you will prove.\"\n\"I will not put up with it if it is not a happy state. I am determined to be happy - at least not to muddle away my life as other people do, being nothing remarkable. I shall not let other people interfere with me as they have done.\" Gwendolen proceeded to take off her own dress, waiting to have her hair wound up by her mamma.\nThere was silence for a minute, till Mrs. Davilow, coiling up her daughter's hair, said, \"I am sure I have never crossed you, Gwendolen.\"\n\"You often want me to do what I don't like.\"\n\"You mean, giving Alice lessons?\"\n\"Yes. I have done it because you asked me. But I don't see why I should. It bores me to death, she is so slow. It would be much better for her to be ignorant, mamma; she would do it well.\"\n\"That is a hard thing to say of your poor sister, Gwendolen, who is so good to you, and waits on you hand and foot.\"\n\"I don't see why it is hard to call things by their right names, and put them in their proper places. The hardship is for me to have to waste my time on her. Now let me do your hair, mamma.\"\n\"Make haste; your uncle and aunt will be here soon. For heaven's sake, don't be scornful to them, my dear child! or to your cousin Anna. Do promise me, Gwendolen. You can't expect Anna to be equal to you.\"\n\"I don't want her to be equal,\" said Gwendolen, with a toss of her head and a smile.\nWhen Mr. and Mrs. Gascoigne and their daughter came, Gwendolen, far from being scornful, behaved as prettily as possible. Her relatives had not seen her since she was sixteen, and she was anxious - no, not anxious, but resolved that they should admire her.\nMrs. Gascoigne bore a family likeness to her younger sister. But she was darker and slighter than Gwendolen's mother, her face was unworn by grief, her movements were less languid, her expression more alert and critical, as suited a rector's wife. They both had natures inclined to obedience; but had ended up in very different places. The younger sister had been unfortunate in her marriages; the elder believed herself the most enviable of wives, and based her decided opinions on her husband's authority. And there was much to encourage trust there. Mr Gascoigne had agreeable virtues, some striking advantages, and his failings leaned toward the side of success.\nOne of his advantages was a fine appearance, even more impressive at fifty-seven than it had been earlier in life. He looked a gentleman with his handsome dark features and iron-grey hair. Perhaps he owed this unclerical aspect to the fact that he had once been Captain Gaskin, having taken orders and a diphthong only shortly before his engagement. He had authority in his parish, and a gift for administration, being a tolerant man. He smiled pleasantly at the flower-growing interests of his fellow-clergyman: for himself, he preferred following the history of a campaign. Mr. Gascoigne would have thought of himself as free from nonsense, a man who looked at religion by daylight, and saw it in its relation to other things. Indeed, the worst criticism of him was worldliness: not that he did not care for the poor, but it was not to be denied that the friendships he cultivated were of a kind likely to be useful to the father of six sons and two daughters.\nGwendolen wondered that she had not remembered how very fine a man her uncle was. It was a matter of extreme interest to her that she should have a dignified male relative nearby, and that her family life would cease to be entirely, insipidly feminine. She did not intend that her uncle should control her, but she saw at once that she would like him to be proud of introducing her as his niece. And he appeared likely to feel that pride. He certainly looked at her with admiration as he said-\n\"You have outgrown Anna, my dear,\" putting his arm tenderly round his daughter, whose shy face was a tiny copy of his own. \"She is a year younger than you, but her growing days are certainly over. I hope you will be excellent companions.\"\nHe did give a comparing glance at his daughter; but it was clear that Anna's timid appearance and miniature figure must appeal to a different taste from that which was attracted by Gwendolen, and that the girls could hardly be rivals. Gwendolen, at least, was aware of this, and kissed her cousin with real cordiality, saying,\n\"A companion is just what I want. I am so glad we are come to live here. And mamma will be much happier now she is near you, aunt.\"\nThe aunt trusted that it would be so, and felt it a blessing that a suitable home had been vacant in their uncle's parish. Then, of course, notice had to be taken of the four other girls, whom Gwendolen had always felt to be superfluous and unimportant, and yet from her earliest days an obtrusive fact in her life. She was conscious of having been much kinder to them than could have been expected. She could tell that her uncle and aunt also felt it a pity there were so many girls:- what rational person could feel otherwise, except poor mamma, who never would see how Alice hunched her shoulders, how Bertha and Fanny whispered and tittered together about everything, or how Isabel was always listening and staring and forgetting where she was?\n\"You have brothers, Anna,\" said Gwendolen. \"I think you are enviable there.\"\n\"Yes,\" said Anna, simply. \"I am very fond of them; but of course their education is a great anxiety to papa. He used to say they made me a tomboy. I really was a great romp with Rex. I think you will like Rex. He will come home before Christmas.\"\n\"I remember I used to think you rather wild and shy; but it is difficult to imagine you a romp,\" said Gwendolen, smiling.\n\"Of course, I am altered now; I am come out, and all that. But I like to go blackberrying with Edwy and Lotta as well as ever. I am not very fond of society; but I dare say I shall like it better now you will be often with me. I am not at all clever, and I never know what to say.\"\n\"I shall like going out with you very much,\" said Gwendolen, well disposed toward this nave cousin. \"Are you fond of riding?\"\n\"Yes, but we have only one Shetland pony. Papa can't afford more; he has so many expenses.\"\n\"I intend to have a horse and ride a great deal,\" said Gwendolen decisively. \"Is the society pleasant in this neighbourhood?\"\n\"Papa says it is, very. There are clergymen all about, you know; and the Quallons, and the Arrowpoints, and Lord Brackenshaw, and Sir Hugo Mallinger's place, where there is nobody- that's very nice, because we make picnics there.\"\nJust then dinner was announced, and Gwendolen's question was soon answered by her uncle, who dwelt much on the advantages of their getting a place like Offendene.\n\"It is always worth while to make a little sacrifice for a good style of house,\" said Mr. Gascoigne, in his easy, pleasantly confident tone; \"all the best people will call upon you; and you need give no expensive dinners. Of course, I have to spend a good deal in that way; but then I get my house for nothing. If I had to pay three hundred a year for my house I could not keep a table. My boys are too great a drain on me. You are better off than we are, in proportion; there is no great drain on you now, after your house and carriage.\"\n\"I assure you, Fanny, now that the children are growing up, I am obliged to cut and contrive,\" said his wife. \"Henry has taught me how to manage. He is wonderful for making the best of everything; he allows himself no extras, and gets his curates for nothing. It is rather hard that he has not been made a prebendary.\"\n\"Oh, my dear Nancy, thank Heaven, there are three hundred as good as I. And ultimately, we shall have no reason to complain, I am pretty sure. There could hardly be a better friend than Lord Brackenshaw - your landlord, you know, Fanny. Lady Brackenshaw will call upon you. And I have spoken for Gwendolen to be a member of the Brackenshaw Archery Club - the most select thing anywhere. That is, if she has no objection,\" added Mr. Gascoigne.\n\"I should like it of all things,\" said Gwendolen. \"There is nothing I enjoy more than taking aim - and hitting,\" she ended, with a pretty smile.\n\"Anna, poor child, is too short-sighted for archery. But you shall practise with me. I must make you an accomplished archer before our great meeting in July. In fact, as to neighbourhood, you could hardly be better placed. There are the Arrowpoints - they are some of our best people. Miss Arrowpoint is a delightful girl - she has been presented at Court. They have a magnificent place at Quetcham Hall; and their parties are the best things of the sort we have. Mrs. Arrowpoint is peculiar, certainly; but well-meaning, and Miss Arrowpoint is as nice as possible. It is not all young ladies who have mothers as handsome and graceful as yours and Anna's.\"\nMrs. Davilow smiled faintly at this little compliment, but the husband and wife looked affectionately at each other, and Gwendolen thought, \"My uncle and aunt, at least, are not dull and dismal.\"\nAltogether, she felt satisfied with her prospects at Offendene. Even the curates were almost always young men of family, and Mr. Middleton, the present curate, was said to be quite an acquisition: it was only a pity he was soon to leave.\nBut there was one point about which she was anxious. Her mamma, she knew, intended to submit to her uncle's judgment about expenditure: so the question of a saddle-horse had to be referred to Mr. Gascoigne. After Gwendolen had played on the piano, had sung to her hearers' admiration, and had joined her uncle in a duet, she seized the opportune moment for saying, \"Mamma, you have not spoken to my uncle about my riding.\"\n\"Gwendolen desires above all things to have a horse to ride - a pretty, light, lady's horse,\" said Mrs. Davilow, looking at Mr. Gascoigne. \"Do you think we can manage it? She rides so well. She has had lessons, and the riding-master said she might be trusted with any mount.\" Even if Mrs. Davilow had not wished her darling to have a horse, she would not have dared to be lukewarm in trying to get it for her.\n\"We could lend her the pony sometimes,\" said Mrs. Gascoigne, watching her husband's face, and quite ready to disapprove if he did.\n\"I cannot endure ponies,\" said Gwendolen. \"I would rather give up some other indulgence and have a horse.\" (Was there ever a young person not ready to give up an unspecified indulgence for the sake of a favourite one?)\n\"There is the price of the horse, and then his keep,\" said Mr. Gascoigne, considering. \"The carriage-horses are already a heavy item. And remember what you ladies cost in clothes now.\"\n\"I really wear nothing but two black dresses,\" said Mrs. Davilow hastily. \"And the younger girls need nothing yet. Besides, Gwendolen will save me so much by giving her sisters lessons.\" Here Mrs. Davilow blushed. \"If it were not for that, I must have a more expensive governess, and masters besides.\"\n\"That is decidedly good,\" said Mr. Gascoigne, heartily. And Gwendolen, who was a deep young lady, suddenly moved away to the other end of the long drawing-room, and busied herself with pieces of music.\n\"The dear child has had no pleasures,\" said Mrs. Davilow pleadingly. \"She really needs the exercise - she needs cheering. And if you were to see her on horseback, it is something splendid.\"\n\"Certainly, a fine woman never looks better than on horseback,\" said Mr. Gascoigne. \"And Gwendolen has the figure for it. I will consult Lord Brackenshaw's head groom.\"\n\"You are very kind.\"\n\"That he always is,\" said Mrs. Gascoigne. And later that night, when she and her husband were in private, she said,\n\"I thought you were almost too indulgent about the horse for Gwendolen. She ought not to claim so much more than your own daughter; especially before we see how Fanny manages on her income. You have enough to do without taking this trouble on yourself.\"\n\"My dear Nancy, this girl is worth some expense: you don't often see her equal. She ought to make a first-rate marriage, and I should not be doing my duty if I did not help her forward. She has been under a disadvantage with such a stepfather. I feel for the girl. And I should like your sister to have the benefit of your having married rather a better specimen of our kind than she did.\"\n\"Rather better! I should think so. I would not grudge anything to poor Fanny. But I have been thinking of one thing you have never mentioned.\"\n\"What is that?\"\n\"The boys. I hope they will not be falling in love with Gwendolen.\"\n\"Don't presuppose anything of the kind, my dear, and there will be no danger. Rex will never be at home for long, and Warham is going to India. It is wiser to take it for granted that cousins will not fall in love. The boys will have nothing, and Gwendolen will have nothing. They can't marry. At the worst there would only be a little crying, and you can't save boys and girls from that.\"\nMrs. Gascoigne's mind was satisfied: if anything did happen, there was the comfort of feeling that her husband would know what was to be done, and would have the energy to do it.",
        "paragraph_chars": [
            [
                0,
                400
            ],
            [
                400,
                839
            ],
            [
                839,
                1374
            ],
            [
                1374,
                1958
            ],
            [
                1958,
                2489
            ],
            [
                2489,
                2953
            ],
            [
                2953,
                3028
            ],
            [
                3028,
                3161
            ],
            [
                3161,
                3191
            ],
            [
                3191,
                3314
            ],
            [
                3314,
                4093
            ],
            [
                4093,
                4838
            ],
            [
                4838,
                5097
            ],
            [
                5097,
                5575
            ],
            [
                5575,
                6079
            ],
            [
                6079,
                6144
            ],
            [
                6144,
                6292
            ],
            [
                6292,
                6338
            ],
            [
                6338,
                6517
            ],
            [
                6517,
                6641
            ],
            [
                6641,
                6882
            ],
            [
                6882,
                7227
            ],
            [
                7227,
                7435
            ],
            [
                7435,
                7697
            ],
            [
                7697,
                7799
            ],
            [
                7799,
                7963
            ],
            [
                7963,
                8111
            ],
            [
                8111,
                8273
            ],
            [
                8273,
                8416
            ],
            [
                8416,
                8475
            ],
            [
                8475,
                8717
            ],
            [
                8717,
                8797
            ],
            [
                8797,
                8962
            ],
            [
                8962,
                9065
            ],
            [
                9065,
                9137
            ],
            [
                9137,
                9412
            ],
            [
                9412,
                9567
            ],
            [
                9567,
                10003
            ],
            [
                10003,
                10061
            ],
            [
                10061,
                10237
            ],
            [
                10237,
                10306
            ],
            [
                10306,
                10450
            ],
            [
                10450,
                10551
            ],
            [
                10551,
                10880
            ],
            [
                10880,
                11018
            ],
            [
                11018,
                11063
            ],
            [
                11063,
                11097
            ],
            [
                11097,
                11286
            ],
            [
                11286,
                11403
            ],
            [
                11403,
                11594
            ],
            [
                11594,
                11800
            ],
            [
                11800,
                11885
            ],
            [
                11885,
                12142
            ],
            [
                12142,
                12809
            ],
            [
                12809,
                13772
            ],
            [
                13772,
                14266
            ],
            [
                14266,
                14505
            ],
            [
                14505,
                14832
            ],
            [
                14832,
                14964
            ],
            [
                14964,
                15713
            ],
            [
                15713,
                15790
            ],
            [
                15790,
                16037
            ],
            [
                16037,
                16159
            ],
            [
                16159,
                16441
            ],
            [
                16441,
                16567
            ],
            [
                16567,
                16659
            ],
            [
                16659,
                16785
            ],
            [
                16785,
                17016
            ],
            [
                17016,
                17179
            ],
            [
                17179,
                17718
            ],
            [
                17718,
                18037
            ],
            [
                18037,
                18480
            ],
            [
                18480,
                18625
            ],
            [
                18625,
                19282
            ],
            [
                19282,
                19478
            ],
            [
                19478,
                19716
            ],
            [
                19716,
                20139
            ],
            [
                20139,
                20549
            ],
            [
                20549,
                20680
            ],
            [
                20680,
                20899
            ],
            [
                20899,
                21084
            ],
            [
                21084,
                21386
            ],
            [
                21386,
                21588
            ],
            [
                21588,
                21778
            ],
            [
                21778,
                21947
            ],
            [
                21947,
                21968
            ],
            [
                21968,
                22084
            ],
            [
                22084,
                22338
            ],
            [
                22338,
                22728
            ],
            [
                22728,
                22871
            ],
            [
                22871,
                22887
            ],
            [
                22887,
                22955
            ],
            [
                22955,
                23345
            ],
            [
                23345,
                23523
            ]
        ],
        "segment_chars": [
            [
                0,
                105
            ],
            [
                105,
                271
            ],
            [
                271,
                400
            ],
            [
                400,
                500
            ],
            [
                500,
                839
            ],
            [
                839,
                961
            ],
            [
                961,
                1125
            ],
            [
                1125,
                1374
            ],
            [
                1374,
                1491
            ],
            [
                1491,
                1693
            ],
            [
                1693,
                1958
            ],
            [
                1958,
                2198
            ],
            [
                2198,
                2405
            ],
            [
                2405,
                2489
            ],
            [
                2489,
                2607
            ],
            [
                2607,
                2836
            ],
            [
                2836,
                2953
            ],
            [
                2953,
                2986
            ],
            [
                2986,
                3028
            ],
            [
                3028,
                3161
            ],
            [
                3161,
                3191
            ],
            [
                3191,
                3314
            ],
            [
                3314,
                3390
            ],
            [
                3390,
                3556
            ],
            [
                3556,
                3731
            ],
            [
                3731,
                3871
            ],
            [
                3871,
                4093
            ],
            [
                4093,
                4309
            ],
            [
                4309,
                4594
            ],
            [
                4594,
                4838
            ],
            [
                4838,
                4996
            ],
            [
                4996,
                5097
            ],
            [
                5097,
                5438
            ],
            [
                5438,
                5575
            ],
            [
                5575,
                5754
            ],
            [
                5754,
                5827
            ],
            [
                5827,
                6005
            ],
            [
                6005,
                6079
            ],
            [
                6079,
                6125
            ],
            [
                6125,
                6144
            ],
            [
                6144,
                6195
            ],
            [
                6195,
                6252
            ],
            [
                6252,
                6292
            ],
            [
                6292,
                6338
            ],
            [
                6338,
                6375
            ],
            [
                6375,
                6517
            ],
            [
                6517,
                6641
            ],
            [
                6641,
                6726
            ],
            [
                6726,
                6764
            ],
            [
                6764,
                6843
            ],
            [
                6843,
                6882
            ],
            [
                6882,
                7227
            ],
            [
                7227,
                7259
            ],
            [
                7259,
                7275
            ],
            [
                7275,
                7294
            ],
            [
                7294,
                7361
            ],
            [
                7361,
                7422
            ],
            [
                7422,
                7435
            ],
            [
                7435,
                7697
            ],
            [
                7697,
                7758
            ],
            [
                7758,
                7799
            ],
            [
                7799,
                7841
            ],
            [
                7841,
                7851
            ],
            [
                7851,
                7963
            ],
            [
                7963,
                7980
            ],
            [
                7980,
                8111
            ],
            [
                8111,
                8134
            ],
            [
                8134,
                8273
            ],
            [
                8273,
                8289
            ],
            [
                8289,
                8416
            ],
            [
                8416,
                8475
            ],
            [
                8475,
                8564
            ],
            [
                8564,
                8588
            ],
            [
                8588,
                8663
            ],
            [
                8663,
                8717
            ],
            [
                8717,
                8797
            ],
            [
                8797,
                8962
            ],
            [
                8962,
                9065
            ],
            [
                9065,
                9137
            ],
            [
                9137,
                9412
            ],
            [
                9412,
                9505
            ],
            [
                9505,
                9567
            ],
            [
                9567,
                9689
            ],
            [
                9689,
                9718
            ],
            [
                9718,
                9762
            ],
            [
                9762,
                9863
            ],
            [
                9863,
                9911
            ],
            [
                9911,
                9974
            ],
            [
                9974,
                10003
            ],
            [
                10003,
                10061
            ],
            [
                10061,
                10079
            ],
            [
                10079,
                10140
            ],
            [
                10140,
                10196
            ],
            [
                10196,
                10237
            ],
            [
                10237,
                10270
            ],
            [
                10270,
                10306
            ],
            [
                10306,
                10410
            ],
            [
                10410,
                10450
            ],
            [
                10450,
                10477
            ],
            [
                10477,
                10551
            ],
            [
                10551,
                10606
            ],
            [
                10606,
                10718
            ],
            [
                10718,
                10785
            ],
            [
                10785,
                10880
            ],
            [
                10880,
                11018
            ],
            [
                11018,
                11063
            ],
            [
                11063,
                11097
            ],
            [
                11097,
                11103
            ],
            [
                11103,
                11140
            ],
            [
                11140,
                11170
            ],
            [
                11170,
                11208
            ],
            [
                11208,
                11286
            ],
            [
                11286,
                11403
            ],
            [
                11403,
                11505
            ],
            [
                11505,
                11561
            ],
            [
                11561,
                11594
            ],
            [
                11594,
                11646
            ],
            [
                11646,
                11707
            ],
            [
                11707,
                11731
            ],
            [
                11731,
                11757
            ],
            [
                11757,
                11800
            ],
            [
                11800,
                11885
            ],
            [
                11885,
                12007
            ],
            [
                12007,
                12142
            ],
            [
                12142,
                12203
            ],
            [
                12203,
                12390
            ],
            [
                12390,
                12478
            ],
            [
                12478,
                12650
            ],
            [
                12650,
                12695
            ],
            [
                12695,
                12809
            ],
            [
                12809,
                12924
            ],
            [
                12924,
                12998
            ],
            [
                12998,
                13159
            ],
            [
                13159,
                13244
            ],
            [
                13244,
                13385
            ],
            [
                13385,
                13538
            ],
            [
                13538,
                13772
            ],
            [
                13772,
                13854
            ],
            [
                13854,
                14025
            ],
            [
                14025,
                14168
            ],
            [
                14168,
                14211
            ],
            [
                14211,
                14266
            ],
            [
                14266,
                14389
            ],
            [
                14389,
                14463
            ],
            [
                14463,
                14505
            ],
            [
                14505,
                14740
            ],
            [
                14740,
                14832
            ],
            [
                14832,
                14866
            ],
            [
                14866,
                14905
            ],
            [
                14905,
                14964
            ],
            [
                14964,
                15087
            ],
            [
                15087,
                15280
            ],
            [
                15280,
                15364
            ],
            [
                15364,
                15713
            ],
            [
                15713,
                15756
            ],
            [
                15756,
                15790
            ],
            [
                15790,
                15816
            ],
            [
                15816,
                15899
            ],
            [
                15899,
                15937
            ],
            [
                15937,
                15973
            ],
            [
                15973,
                16000
            ],
            [
                16000,
                16037
            ],
            [
                16037,
                16159
            ],
            [
                16159,
                16218
            ],
            [
                16218,
                16286
            ],
            [
                16286,
                16386
            ],
            [
                16386,
                16441
            ],
            [
                16441,
                16541
            ],
            [
                16541,
                16567
            ],
            [
                16567,
                16609
            ],
            [
                16609,
                16659
            ],
            [
                16659,
                16736
            ],
            [
                16736,
                16785
            ],
            [
                16785,
                16809
            ],
            [
                16809,
                17016
            ],
            [
                17016,
                17179
            ],
            [
                17179,
                17401
            ],
            [
                17401,
                17490
            ],
            [
                17490,
                17566
            ],
            [
                17566,
                17603
            ],
            [
                17603,
                17718
            ],
            [
                17718,
                17828
            ],
            [
                17828,
                17864
            ],
            [
                17864,
                17978
            ],
            [
                17978,
                18037
            ],
            [
                18037,
                18109
            ],
            [
                18109,
                18180
            ],
            [
                18180,
                18274
            ],
            [
                18274,
                18311
            ],
            [
                18311,
                18424
            ],
            [
                18424,
                18480
            ],
            [
                18480,
                18530
            ],
            [
                18530,
                18625
            ],
            [
                18625,
                18678
            ],
            [
                18678,
                18710
            ],
            [
                18710,
                18783
            ],
            [
                18783,
                18848
            ],
            [
                18848,
                18910
            ],
            [
                18910,
                18982
            ],
            [
                18982,
                19089
            ],
            [
                19089,
                19191
            ],
            [
                19191,
                19282
            ],
            [
                19282,
                19478
            ],
            [
                19478,
                19542
            ],
            [
                19542,
                19716
            ],
            [
                19716,
                19769
            ],
            [
                19769,
                19923
            ],
            [
                19923,
                20139
            ],
            [
                20139,
                20278
            ],
            [
                20278,
                20310
            ],
            [
                20310,
                20329
            ],
            [
                20329,
                20415
            ],
            [
                20415,
                20549
            ],
            [
                20549,
                20680
            ],
            [
                20680,
                20722
            ],
            [
                20722,
                20787
            ],
            [
                20787,
                20899
            ],
            [
                20899,
                20986
            ],
            [
                20986,
                21033
            ],
            [
                21033,
                21084
            ],
            [
                21084,
                21158
            ],
            [
                21158,
                21199
            ],
            [
                21199,
                21271
            ],
            [
                21271,
                21298
            ],
            [
                21298,
                21386
            ],
            [
                21386,
                21442
            ],
            [
                21442,
                21588
            ],
            [
                21588,
                21657
            ],
            [
                21657,
                21710
            ],
            [
                21710,
                21778
            ],
            [
                21778,
                21862
            ],
            [
                21862,
                21900
            ],
            [
                21900,
                21947
            ],
            [
                21947,
                21968
            ],
            [
                21968,
                22010
            ],
            [
                22010,
                22084
            ],
            [
                22084,
                22156
            ],
            [
                22156,
                22274
            ],
            [
                22274,
                22338
            ],
            [
                22338,
                22418
            ],
            [
                22418,
                22524
            ],
            [
                22524,
                22582
            ],
            [
                22582,
                22603
            ],
            [
                22603,
                22728
            ],
            [
                22728,
                22744
            ],
            [
                22744,
                22763
            ],
            [
                22763,
                22806
            ],
            [
                22806,
                22871
            ],
            [
                22871,
                22887
            ],
            [
                22887,
                22898
            ],
            [
                22898,
                22955
            ],
            [
                22955,
                23033
            ],
            [
                23033,
                23099
            ],
            [
                23099,
                23170
            ],
            [
                23170,
                23231
            ],
            [
                23231,
                23249
            ],
            [
                23249,
                23345
            ],
            [
                23345,
                23523
            ]
        ],
        "overlap_chars": [
            [
                0,
                105
            ],
            [
                105,
                179
            ],
            [
                181,
                193
            ],
            [
                194,
                215
            ],
            [
                219,
                220
            ],
            [
                225,
                239
            ],
            [
                240,
                271
            ],
            [
                271,
                400
            ],
            [
                400,
                470
            ],
            [
                479,
                500
            ],
            [
                500,
                543
            ],
            [
                543,
                544
            ],
            [
                545,
                554
            ],
            [
                555,
                558
            ],
            [
                559,
                585
            ],
            [
                586,
                630
            ],
            [
                632,
                635
            ],
            [
                636,
                686
            ],
            [
                692,
                734
            ],
            [
                735,
                782
            ],
            [
                786,
                796
            ],
            [
                796,
                839
            ],
            [
                839,
                959
            ],
            [
                959,
                961
            ],
            [
                961,
                977
            ],
            [
                992,
                997
            ],
            [
                998,
                1001
            ],
            [
                1007,
                1014
            ],
            [
                1015,
                1022
            ],
            [
                1023,
                1052
            ],
            [
                1058,
                1094
            ],
            [
                1100,
                1103
            ],
            [
                1112,
                1115
            ],
            [
                1116,
                1125
            ],
            [
                1125,
                1180
            ],
            [
                1185,
                1200
            ],
            [
                1206,
                1301
            ],
            [
                1302,
                1305
            ],
            [
                1306,
                1339
            ],
            [
                1340,
                1347
            ],
            [
                1348,
                1357
            ],
            [
                1358,
                1373
            ],
            [
                1374,
                1387
            ],
            [
                1388,
                1433
            ],
            [
                1443,
                1451
            ],
            [
                1452,
                1491
            ],
            [
                1491,
                1494
            ],
            [
                1502,
                1515
            ],
            [
                1516,
                1518
            ],
            [
                1519,
                1537
            ],
            [
                1538,
                1552
            ],
            [
                1553,
                1559
            ],
            [
                1565,
                1622
            ],
            [
                1629,
                1669
            ],
            [
                1670,
                1677
            ],
            [
                1678,
                1691
            ],
            [
                1691,
                1693
            ],
            [
                1693,
                1697
            ],
            [
                1702,
                1735
            ],
            [
                1736,
                1745
            ],
            [
                1748,
                1861
            ],
            [
                1861,
                1866
            ],
            [
                1877,
                1882
            ],
            [
                1890,
                1891
            ],
            [
                1902,
                1957
            ],
            [
                1958,
                2039
            ],
            [
                2040,
                2070
            ],
            [
                2083,
                2196
            ],
            [
                2198,
                2201
            ],
            [
                2202,
                2211
            ],
            [
                2220,
                2226
            ],
            [
                2227,
                2251
            ],
            [
                2252,
                2268
            ],
            [
                2269,
                2273
            ],
            [
                2274,
                2282
            ],
            [
                2283,
                2291
            ],
            [
                2291,
                2320
            ],
            [
                2321,
                2323
            ],
            [
                2324,
                2331
            ],
            [
                2332,
                2334
            ],
            [
                2338,
                2349
            ],
            [
                2350,
                2356
            ],
            [
                2361,
                2366
            ],
            [
                2371,
                2403
            ],
            [
                2403,
                2405
            ],
            [
                2405,
                2421
            ],
            [
                2422,
                2487
            ],
            [
                2487,
                2488
            ],
            [
                2489,
                2518
            ],
            [
                2519,
                2548
            ],
            [
                2552,
                2607
            ],
            [
                2607,
                2671
            ],
            [
                2681,
                2756
            ],
            [
                2757,
                2821
            ],
            [
                2834,
                2836
            ],
            [
                2836,
                2909
            ],
            [
                2916,
                2921
            ],
            [
                2933,
                2938
            ],
            [
                2939,
                2945
            ],
            [
                2945,
                2951
            ],
            [
                2953,
                2986
            ],
            [
                2986,
                3028
            ],
            [
                3028,
                3040
            ],
            [
                3050,
                3112
            ],
            [
                3113,
                3159
            ],
            [
                3161,
                3191
            ],
            [
                3191,
                3314
            ],
            [
                3314,
                3335
            ],
            [
                3341,
                3348
            ],
            [
                3388,
                3390
            ],
            [
                3390,
                3554
            ],
            [
                3554,
                3556
            ],
            [
                3556,
                3608
            ],
            [
                3618,
                3731
            ],
            [
                3731,
                3786
            ],
            [
                3786,
                3853
            ],
            [
                3860,
                3871
            ],
            [
                3871,
                4092
            ],
            [
                4093,
                4160
            ],
            [
                4164,
                4224
            ],
            [
                4227,
                4236
            ],
            [
                4236,
                4253
            ],
            [
                4254,
                4281
            ],
            [
                4282,
                4285
            ],
            [
                4286,
                4296
            ],
            [
                4297,
                4307
            ],
            [
                4307,
                4309
            ],
            [
                4309,
                4321
            ],
            [
                4322,
                4395
            ],
            [
                4395,
                4494
            ],
            [
                4495,
                4594
            ],
            [
                4594,
                4601
            ],
            [
                4609,
                4697
            ],
            [
                4706,
                4719
            ],
            [
                4732,
                4755
            ],
            [
                4756,
                4788
            ],
            [
                4804,
                4837
            ],
            [
                4838,
                4847
            ],
            [
                4848,
                4855
            ],
            [
                4871,
                4941
            ],
            [
                4941,
                4942
            ],
            [
                4943,
                4967
            ],
            [
                4972,
                4983
            ],
            [
                4984,
                4986
            ],
            [
                4987,
                4990
            ],
            [
                4994,
                4996
            ],
            [
                4996,
                5097
            ],
            [
                5097,
                5133
            ],
            [
                5134,
                5135
            ],
            [
                5136,
                5141
            ],
            [
                5142,
                5185
            ],
            [
                5185,
                5186
            ],
            [
                5187,
                5205
            ],
            [
                5206,
                5219
            ],
            [
                5220,
                5226
            ],
            [
                5237,
                5244
            ],
            [
                5247,
                5250
            ],
            [
                5256,
                5301
            ],
            [
                5302,
                5328
            ],
            [
                5332,
                5436
            ],
            [
                5438,
                5574
            ],
            [
                5575,
                5675
            ],
            [
                5676,
                5754
            ],
            [
                5754,
                5764
            ],
            [
                5770,
                5777
            ],
            [
                5789,
                5792
            ],
            [
                5793,
                5827
            ],
            [
                5827,
                5894
            ],
            [
                5895,
                5956
            ],
            [
                5974,
                6005
            ],
            [
                6005,
                6052
            ],
            [
                6053,
                6079
            ],
            [
                6079,
                6122
            ],
            [
                6125,
                6142
            ],
            [
                6142,
                6144
            ],
            [
                6144,
                6195
            ],
            [
                6195,
                6250
            ],
            [
                6250,
                6252
            ],
            [
                6252,
                6292
            ],
            [
                6292,
                6338
            ],
            [
                6338,
                6373
            ],
            [
                6373,
                6375
            ],
            [
                6375,
                6517
            ],
            [
                6517,
                6602
            ],
            [
                6602,
                6641
            ],
            [
                6641,
                6686
            ],
            [
                6687,
                6726
            ],
            [
                6726,
                6750
            ],
            [
                6751,
                6754
            ],
            [
                6762,
                6764
            ],
            [
                6764,
                6843
            ],
            [
                6843,
                6882
            ],
            [
                6882,
                6906
            ],
            [
                6906,
                6946
            ],
            [
                6947,
                7092
            ],
            [
                7093,
                7094
            ],
            [
                7095,
                7150
            ],
            [
                7151,
                7169
            ],
            [
                7170,
                7208
            ],
            [
                7209,
                7225
            ],
            [
                7225,
                7227
            ],
            [
                7227,
                7259
            ],
            [
                7259,
                7273
            ],
            [
                7273,
                7275
            ],
            [
                7275,
                7294
            ],
            [
                7294,
                7361
            ],
            [
                7361,
                7422
            ],
            [
                7422,
                7435
            ],
            [
                7435,
                7568
            ],
            [
                7569,
                7588
            ],
            [
                7589,
                7608
            ],
            [
                7613,
                7618
            ],
            [
                7619,
                7697
            ],
            [
                7697,
                7758
            ],
            [
                7758,
                7798
            ],
            [
                7799,
                7841
            ],
            [
                7841,
                7844
            ],
            [
                7849,
                7851
            ],
            [
                7851,
                7960
            ],
            [
                7963,
                7980
            ],
            [
                7980,
                8111
            ],
            [
                8120,
                8134
            ],
            [
                8134,
                8144
            ],
            [
                8150,
                8218
            ],
            [
                8221,
                8272
            ],
            [
                8273,
                8289
            ],
            [
                8289,
                8306
            ],
            [
                8306,
                8365
            ],
            [
                8366,
                8416
            ],
            [
                8416,
                8475
            ],
            [
                8475,
                8564
            ],
            [
                8564,
                8578
            ],
            [
                8586,
                8588
            ],
            [
                8588,
                8598
            ],
            [
                8599,
                8608
            ],
            [
                8609,
                8642
            ],
            [
                8645,
                8663
            ],
            [
                8663,
                8678
            ],
            [
                8684,
                8690
            ],
            [
                8691,
                8694
            ],
            [
                8701,
                8708
            ],
            [
                8709,
                8717
            ],
            [
                8730,
                8736
            ],
            [
                8737,
                8744
            ],
            [
                8745,
                8749
            ],
            [
                8749,
                8750
            ],
            [
                8755,
                8771
            ],
            [
                8772,
                8797
            ],
            [
                8797,
                8812
            ],
            [
                8813,
                8843
            ],
            [
                8846,
                8853
            ],
            [
                8853,
                8858
            ],
            [
                8865,
                8962
            ],
            [
                8962,
                8975
            ],
            [
                8976,
                8979
            ],
            [
                8980,
                9016
            ],
            [
                9017,
                9065
            ],
            [
                9065,
                9112
            ],
            [
                9112,
                9135
            ],
            [
                9135,
                9136
            ],
            [
                9137,
                9141
            ],
            [
                9142,
                9151
            ],
            [
                9152,
                9242
            ],
            [
                9247,
                9265
            ],
            [
                9266,
                9269
            ],
            [
                9269,
                9270
            ],
            [
                9283,
                9326
            ],
            [
                9326,
                9356
            ],
            [
                9357,
                9381
            ],
            [
                9385,
                9388
            ],
            [
                9398,
                9410
            ],
            [
                9410,
                9412
            ],
            [
                9412,
                9477
            ],
            [
                9485,
                9505
            ],
            [
                9505,
                9542
            ],
            [
                9543,
                9556
            ],
            [
                9557,
                9560
            ],
            [
                9561,
                9567
            ],
            [
                9567,
                9656
            ],
            [
                9657,
                9689
            ],
            [
                9697,
                9708
            ],
            [
                9709,
                9718
            ],
            [
                9718,
                9746
            ],
            [
                9747,
                9760
            ],
            [
                9760,
                9762
            ],
            [
                9762,
                9774
            ],
            [
                9779,
                9783
            ],
            [
                9783,
                9784
            ],
            [
                9785,
                9808
            ],
            [
                9817,
                9839
            ],
            [
                9839,
                9842
            ],
            [
                9842,
                9861
            ],
            [
                9861,
                9863
            ],
            [
                9863,
                9911
            ],
            [
                9911,
                9974
            ],
            [
                9974,
                9985
            ],
            [
                9986,
                9991
            ],
            [
                9992,
                10003
            ],
            [
                10003,
                10049
            ],
            [
                10050,
                10053
            ],
            [
                10054,
                10059
            ],
            [
                10059,
                10061
            ],
            [
                10061,
                10079
            ],
            [
                10079,
                10127
            ],
            [
                10128,
                10131
            ],
            [
                10138,
                10140
            ],
            [
                10140,
                10144
            ],
            [
                10150,
                10162
            ],
            [
                10165,
                10196
            ],
            [
                10196,
                10219
            ],
            [
                10220,
                10237
            ],
            [
                10237,
                10238
            ],
            [
                10238,
                10270
            ],
            [
                10270,
                10306
            ],
            [
                10306,
                10312
            ],
            [
                10313,
                10410
            ],
            [
                10410,
                10450
            ],
            [
                10450,
                10477
            ],
            [
                10477,
                10551
            ],
            [
                10551,
                10606
            ],
            [
                10606,
                10633
            ],
            [
                10636,
                10651
            ],
            [
                10652,
                10653
            ],
            [
                10659,
                10697
            ],
            [
                10698,
                10718
            ],
            [
                10718,
                10719
            ],
            [
                10726,
                10729
            ],
            [
                10730,
                10782
            ],
            [
                10785,
                10794
            ],
            [
                10805,
                10830
            ],
            [
                10830,
                10831
            ],
            [
                10832,
                10880
            ],
            [
                10880,
                10910
            ],
            [
                10910,
                10929
            ],
            [
                10929,
                10930
            ],
            [
                10931,
                10938
            ],
            [
                10946,
                10961
            ],
            [
                10963,
                10967
            ],
            [
                10967,
                11018
            ],
            [
                11018,
                11063
            ],
            [
                11063,
                11073
            ],
            [
                11081,
                11097
            ],
            [
                11097,
                11103
            ],
            [
                11103,
                11140
            ],
            [
                11140,
                11168
            ],
            [
                11168,
                11170
            ],
            [
                11170,
                11208
            ],
            [
                11208,
                11261
            ],
            [
                11263,
                11286
            ],
            [
                11286,
                11403
            ],
            [
                11403,
                11505
            ],
            [
                11505,
                11561
            ],
            [
                11561,
                11571
            ],
            [
                11575,
                11594
            ],
            [
                11594,
                11595
            ],
            [
                11595,
                11646
            ],
            [
                11646,
                11685
            ],
            [
                11686,
                11690
            ],
            [
                11690,
                11707
            ],
            [
                11707,
                11729
            ],
            [
                11729,
                11731
            ],
            [
                11731,
                11757
            ],
            [
                11757,
                11800
            ],
            [
                11800,
                11883
            ],
            [
                11883,
                11885
            ],
            [
                11885,
                12005
            ],
            [
                12005,
                12007
            ],
            [
                12011,
                12020
            ],
            [
                12021,
                12043
            ],
            [
                12044,
                12051
            ],
            [
                12052,
                12080
            ],
            [
                12083,
                12142
            ],
            [
                12142,
                12186
            ],
            [
                12195,
                12203
            ],
            [
                12203,
                12234
            ],
            [
                12258,
                12361
            ],
            [
                12363,
                12365
            ],
            [
                12373,
                12388
            ],
            [
                12388,
                12390
            ],
            [
                12400,
                12403
            ],
            [
                12412,
                12423
            ],
            [
                12424,
                12438
            ],
            [
                12452,
                12454
            ],
            [
                12455,
                12469
            ],
            [
                12476,
                12478
            ],
            [
                12478,
                12505
            ],
            [
                12506,
                12594
            ],
            [
                12601,
                12604
            ],
            [
                12605,
                12612
            ],
            [
                12613,
                12621
            ],
            [
                12622,
                12624
            ],
            [
                12625,
                12628
            ],
            [
                12648,
                12650
            ],
            [
                12650,
                12687
            ],
            [
                12693,
                12695
            ],
            [
                12708,
                12711
            ],
            [
                12712,
                12760
            ],
            [
                12765,
                12773
            ],
            [
                12774,
                12809
            ],
            [
                12809,
                12841
            ],
            [
                12852,
                12853
            ],
            [
                12854,
                12924
            ],
            [
                12924,
                12926
            ],
            [
                12934,
                12950
            ],
            [
                12951,
                12954
            ],
            [
                12955,
                12977
            ],
            [
                12978,
                12987
            ],
            [
                12992,
                12998
            ],
            [
                12998,
                13018
            ],
            [
                13037,
                13122
            ],
            [
                13128,
                13157
            ],
            [
                13157,
                13159
            ],
            [
                13159,
                13165
            ],
            [
                13166,
                13189
            ],
            [
                13189,
                13194
            ],
            [
                13195,
                13196
            ],
            [
                13197,
                13227
            ],
            [
                13228,
                13229
            ],
            [
                13230,
                13238
            ],
            [
                13242,
                13244
            ],
            [
                13244,
                13271
            ],
            [
                13297,
                13299
            ],
            [
                13300,
                13320
            ],
            [
                13320,
                13383
            ],
            [
                13383,
                13385
            ],
            [
                13385,
                13398
            ],
            [
                13399,
                13409
            ],
            [
                13418,
                13420
            ],
            [
                13429,
                13431
            ],
            [
                13432,
                13450
            ],
            [
                13450,
                13451
            ],
            [
                13452,
                13471
            ],
            [
                13472,
                13538
            ],
            [
                13538,
                13555
            ],
            [
                13566,
                13568
            ],
            [
                13569,
                13589
            ],
            [
                13590,
                13593
            ],
            [
                13594,
                13601
            ],
            [
                13615,
                13618
            ],
            [
                13619,
                13622
            ],
            [
                13627,
                13770
            ],
            [
                13770,
                13771
            ],
            [
                13772,
                13807
            ],
            [
                13808,
                13852
            ],
            [
                13852,
                13854
            ],
            [
                13854,
                13905
            ],
            [
                13913,
                13917
            ],
            [
                13918,
                13943
            ],
            [
                13950,
                13960
            ],
            [
                13965,
                14025
            ],
            [
                14025,
                14103
            ],
            [
                14108,
                14113
            ],
            [
                14123,
                14125
            ],
            [
                14126,
                14168
            ],
            [
                14168,
                14171
            ],
            [
                14184,
                14211
            ],
            [
                14211,
                14264
            ],
            [
                14266,
                14387
            ],
            [
                14387,
                14389
            ],
            [
                14389,
                14396
            ],
            [
                14397,
                14403
            ],
            [
                14417,
                14420
            ],
            [
                14420,
                14463
            ],
            [
                14463,
                14505
            ],
            [
                14505,
                14551
            ],
            [
                14553,
                14556
            ],
            [
                14570,
                14740
            ],
            [
                14740,
                14749
            ],
            [
                14751,
                14822
            ],
            [
                14822,
                14831
            ],
            [
                14832,
                14866
            ],
            [
                14866,
                14905
            ],
            [
                14905,
                14964
            ],
            [
                14964,
                14980
            ],
            [
                14981,
                15087
            ],
            [
                15087,
                15200
            ],
            [
                15205,
                15261
            ],
            [
                15262,
                15280
            ],
            [
                15280,
                15364
            ],
            [
                15364,
                15367
            ],
            [
                15379,
                15447
            ],
            [
                15450,
                15541
            ],
            [
                15550,
                15563
            ],
            [
                15563,
                15711
            ],
            [
                15711,
                15713
            ],
            [
                15713,
                15754
            ],
            [
                15754,
                15756
            ],
            [
                15756,
                15790
            ],
            [
                15790,
                15816
            ],
            [
                15816,
                15899
            ],
            [
                15899,
                15937
            ],
            [
                15937,
                15973
            ],
            [
                15973,
                16000
            ],
            [
                16000,
                16037
            ],
            [
                16037,
                16109
            ],
            [
                16110,
                16159
            ],
            [
                16159,
                16218
            ],
            [
                16218,
                16221
            ],
            [
                16222,
                16286
            ],
            [
                16286,
                16307
            ],
            [
                16315,
                16386
            ],
            [
                16386,
                16438
            ],
            [
                16441,
                16527
            ],
            [
                16528,
                16532
            ],
            [
                16533,
                16541
            ],
            [
                16541,
                16567
            ],
            [
                16567,
                16607
            ],
            [
                16607,
                16609
            ],
            [
                16609,
                16613
            ],
            [
                16614,
                16631
            ],
            [
                16631,
                16659
            ],
            [
                16659,
                16706
            ],
            [
                16706,
                16723
            ],
            [
                16734,
                16736
            ],
            [
                16736,
                16768
            ],
            [
                16782,
                16785
            ],
            [
                16785,
                16809
            ],
            [
                16809,
                16818
            ],
            [
                16819,
                16964
            ],
            [
                16966,
                17013
            ],
            [
                17026,
                17032
            ],
            [
                17033,
                17036
            ],
            [
                17046,
                17081
            ],
            [
                17082,
                17137
            ],
            [
                17138,
                17140
            ],
            [
                17147,
                17178
            ],
            [
                17179,
                17180
            ],
            [
                17180,
                17318
            ],
            [
                17320,
                17321
            ],
            [
                17321,
                17401
            ],
            [
                17401,
                17452
            ],
            [
                17453,
                17490
            ],
            [
                17490,
                17566
            ],
            [
                17566,
                17603
            ],
            [
                17603,
                17718
            ],
            [
                17718,
                17817
            ],
            [
                17826,
                17828
            ],
            [
                17828,
                17829
            ],
            [
                17829,
                17848
            ],
            [
                17862,
                17864
            ],
            [
                17864,
                17978
            ],
            [
                17978,
                18034
            ],
            [
                18037,
                18056
            ],
            [
                18057,
                18109
            ],
            [
                18109,
                18180
            ],
            [
                18180,
                18203
            ],
            [
                18211,
                18239
            ],
            [
                18242,
                18274
            ],
            [
                18274,
                18311
            ],
            [
                18311,
                18360
            ],
            [
                18361,
                18389
            ],
            [
                18392,
                18424
            ],
            [
                18424,
                18478
            ],
            [
                18478,
                18480
            ],
            [
                18480,
                18530
            ],
            [
                18530,
                18576
            ],
            [
                18579,
                18617
            ],
            [
                18618,
                18625
            ],
            [
                18625,
                18626
            ],
            [
                18630,
                18678
            ],
            [
                18678,
                18681
            ],
            [
                18682,
                18691
            ],
            [
                18701,
                18710
            ],
            [
                18710,
                18783
            ],
            [
                18783,
                18797
            ],
            [
                18811,
                18848
            ],
            [
                18848,
                18873
            ],
            [
                18876,
                18910
            ],
            [
                18910,
                18946
            ],
            [
                18949,
                18982
            ],
            [
                18982,
                19011
            ],
            [
                19015,
                19028
            ],
            [
                19028,
                19047
            ],
            [
                19048,
                19089
            ],
            [
                19089,
                19128
            ],
            [
                19129,
                19145
            ],
            [
                19145,
                19146
            ],
            [
                19147,
                19191
            ],
            [
                19191,
                19282
            ],
            [
                19282,
                19455
            ],
            [
                19456,
                19477
            ],
            [
                19478,
                19540
            ],
            [
                19540,
                19542
            ],
            [
                19542,
                19550
            ],
            [
                19551,
                19558
            ],
            [
                19559,
                19621
            ],
            [
                19630,
                19700
            ],
            [
                19701,
                19716
            ],
            [
                19716,
                19739
            ],
            [
                19746,
                19759
            ],
            [
                19760,
                19767
            ],
            [
                19767,
                19769
            ],
            [
                19769,
                19808
            ],
            [
                19809,
                19832
            ],
            [
                19839,
                19850
            ],
            [
                19855,
                19858
            ],
            [
                19871,
                19872
            ],
            [
                19886,
                19889
            ],
            [
                19890,
                19892
            ],
            [
                19908,
                19909
            ],
            [
                19910,
                19911
            ],
            [
                19921,
                19923
            ],
            [
                19923,
                19962
            ],
            [
                19962,
                20008
            ],
            [
                20016,
                20025
            ],
            [
                20026,
                20035
            ],
            [
                20035,
                20036
            ],
            [
                20037,
                20139
            ],
            [
                20139,
                20198
            ],
            [
                20201,
                20278
            ],
            [
                20278,
                20308
            ],
            [
                20310,
                20328
            ],
            [
                20329,
                20380
            ],
            [
                20381,
                20412
            ],
            [
                20415,
                20422
            ],
            [
                20423,
                20435
            ],
            [
                20436,
                20470
            ],
            [
                20471,
                20472
            ],
            [
                20473,
                20479
            ],
            [
                20480,
                20483
            ],
            [
                20484,
                20549
            ],
            [
                20549,
                20642
            ],
            [
                20643,
                20680
            ],
            [
                20680,
                20681
            ],
            [
                20681,
                20721
            ],
            [
                20722,
                20786
            ],
            [
                20787,
                20810
            ],
            [
                20818,
                20880
            ],
            [
                20893,
                20896
            ],
            [
                20896,
                20899
            ],
            [
                20899,
                20931
            ],
            [
                20931,
                20972
            ],
            [
                20984,
                20986
            ],
            [
                20986,
                20987
            ],
            [
                20987,
                21006
            ],
            [
                21007,
                21010
            ],
            [
                21019,
                21033
            ],
            [
                21033,
                21069
            ],
            [
                21078,
                21084
            ],
            [
                21084,
                21148
            ],
            [
                21149,
                21158
            ],
            [
                21158,
                21180
            ],
            [
                21197,
                21199
            ],
            [
                21199,
                21271
            ],
            [
                21271,
                21288
            ],
            [
                21296,
                21298
            ],
            [
                21298,
                21330
            ],
            [
                21331,
                21386
            ],
            [
                21386,
                21387
            ],
            [
                21387,
                21440
            ],
            [
                21440,
                21442
            ],
            [
                21442,
                21460
            ],
            [
                21461,
                21570
            ],
            [
                21571,
                21588
            ],
            [
                21588,
                21611
            ],
            [
                21612,
                21644
            ],
            [
                21655,
                21657
            ],
            [
                21658,
                21687
            ],
            [
                21690,
                21710
            ],
            [
                21710,
                21778
            ],
            [
                21778,
                21862
            ],
            [
                21862,
                21900
            ],
            [
                21900,
                21944
            ],
            [
                21947,
                21968
            ],
            [
                21968,
                22010
            ],
            [
                22010,
                22084
            ],
            [
                22084,
                22156
            ],
            [
                22156,
                22214
            ],
            [
                22216,
                22274
            ],
            [
                22274,
                22277
            ],
            [
                22278,
                22310
            ],
            [
                22311,
                22338
            ],
            [
                22338,
                22353
            ],
            [
                22354,
                22366
            ],
            [
                22367,
                22418
            ],
            [
                22418,
                22497
            ],
            [
                22511,
                22524
            ],
            [
                22524,
                22569
            ],
            [
                22574,
                22580
            ],
            [
                22580,
                22582
            ],
            [
                22582,
                22601
            ],
            [
                22603,
                22632
            ],
            [
                22633,
                22728
            ],
            [
                22728,
                22744
            ],
            [
                22744,
                22763
            ],
            [
                22763,
                22806
            ],
            [
                22806,
                22809
            ],
            [
                22810,
                22833
            ],
            [
                22834,
                22843
            ],
            [
                22844,
                22868
            ],
            [
                22868,
                22871
            ],
            [
                22871,
                22887
            ],
            [
                22887,
                22898
            ],
            [
                22898,
                22955
            ],
            [
                22955,
                23033
            ],
            [
                23033,
                23067
            ],
            [
                23067,
                23099
            ],
            [
                23099,
                23104
            ],
            [
                23105,
                23110
            ],
            [
                23111,
                23170
            ],
            [
                23170,
                23231
            ],
            [
                23231,
                23249
            ],
            [
                23249,
                23345
            ],
            [
                23345,
                23523
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                105
            ],
            [
                105,
                271
            ],
            [
                271,
                271
            ],
            [
                271,
                400
            ],
            [
                400,
                500
            ],
            [
                500,
                839
            ],
            [
                839,
                961
            ],
            [
                961,
                1125
            ],
            [
                1125,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1491
            ],
            [
                1491,
                1693
            ],
            [
                1693,
                1958
            ],
            [
                1958,
                2405
            ],
            [
                2405,
                2489
            ],
            [
                2489,
                2489
            ],
            [
                2489,
                2607
            ],
            [
                2607,
                2836
            ],
            [
                2836,
                2953
            ],
            [
                2953,
                2986
            ],
            [
                2986,
                3028
            ],
            [
                3028,
                3161
            ],
            [
                3161,
                3191
            ],
            [
                3191,
                3314
            ],
            [
                3314,
                3390
            ],
            [
                3390,
                3556
            ],
            [
                3556,
                3731
            ],
            [
                3731,
                3871
            ],
            [
                3871,
                4093
            ],
            [
                4093,
                4309
            ],
            [
                4309,
                4594
            ],
            [
                4594,
                4838
            ],
            [
                4838,
                4996
            ],
            [
                4996,
                5097
            ],
            [
                5097,
                5575
            ],
            [
                5575,
                5754
            ],
            [
                5754,
                5827
            ],
            [
                5827,
                6005
            ],
            [
                6005,
                6079
            ],
            [
                6079,
                6144
            ],
            [
                6144,
                6195
            ],
            [
                6195,
                6252
            ],
            [
                6252,
                6292
            ],
            [
                6292,
                6338
            ],
            [
                6338,
                6375
            ],
            [
                6375,
                6375
            ],
            [
                6375,
                6375
            ],
            [
                6375,
                6517
            ],
            [
                6517,
                6641
            ],
            [
                6641,
                6726
            ],
            [
                6726,
                6764
            ],
            [
                6764,
                6843
            ],
            [
                6843,
                6882
            ],
            [
                6882,
                7227
            ],
            [
                7227,
                7259
            ],
            [
                7259,
                7275
            ],
            [
                7275,
                7294
            ],
            [
                7294,
                7361
            ],
            [
                7361,
                7422
            ],
            [
                7422,
                7435
            ],
            [
                7435,
                7697
            ],
            [
                7697,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7799
            ],
            [
                7799,
                7799
            ],
            [
                7799,
                7841
            ],
            [
                7841,
                7851
            ],
            [
                7851,
                7963
            ],
            [
                7963,
                7963
            ],
            [
                7963,
                7980
            ],
            [
                7980,
                8111
            ],
            [
                8111,
                8134
            ],
            [
                8134,
                8273
            ],
            [
                8273,
                8289
            ],
            [
                8289,
                8416
            ],
            [
                8416,
                8475
            ],
            [
                8475,
                8564
            ],
            [
                8564,
                8588
            ],
            [
                8588,
                8663
            ],
            [
                8663,
                8717
            ],
            [
                8717,
                8797
            ],
            [
                8797,
                8962
            ],
            [
                8962,
                9065
            ],
            [
                9065,
                9137
            ],
            [
                9137,
                9137
            ],
            [
                9137,
                9412
            ],
            [
                9412,
                9505
            ],
            [
                9505,
                9567
            ],
            [
                9567,
                9689
            ],
            [
                9689,
                9718
            ],
            [
                9718,
                9762
            ],
            [
                9762,
                9762
            ],
            [
                9762,
                9762
            ],
            [
                9762,
                9863
            ],
            [
                9863,
                9911
            ],
            [
                9911,
                9974
            ],
            [
                9974,
                9974
            ],
            [
                9974,
                10003
            ],
            [
                10003,
                10061
            ],
            [
                10061,
                10079
            ],
            [
                10079,
                10140
            ],
            [
                10140,
                10196
            ],
            [
                10196,
                10237
            ],
            [
                10237,
                10270
            ],
            [
                10270,
                10306
            ],
            [
                10306,
                10410
            ],
            [
                10410,
                10450
            ],
            [
                10450,
                10477
            ],
            [
                10477,
                10551
            ],
            [
                10551,
                10606
            ],
            [
                10606,
                10718
            ],
            [
                10718,
                10785
            ],
            [
                10785,
                10880
            ],
            [
                10880,
                11018
            ],
            [
                11018,
                11063
            ],
            [
                11063,
                11097
            ],
            [
                11097,
                11103
            ],
            [
                11103,
                11140
            ],
            [
                11140,
                11170
            ],
            [
                11170,
                11208
            ],
            [
                11208,
                11208
            ],
            [
                11208,
                11286
            ],
            [
                11286,
                11403
            ],
            [
                11403,
                11505
            ],
            [
                11505,
                11561
            ],
            [
                11561,
                11594
            ],
            [
                11594,
                11646
            ],
            [
                11646,
                11707
            ],
            [
                11707,
                11731
            ],
            [
                11731,
                11757
            ],
            [
                11757,
                11800
            ],
            [
                11800,
                11885
            ],
            [
                11885,
                12007
            ],
            [
                12007,
                12142
            ],
            [
                12142,
                12203
            ],
            [
                12203,
                12390
            ],
            [
                12390,
                12478
            ],
            [
                12478,
                12650
            ],
            [
                12650,
                12695
            ],
            [
                12695,
                12809
            ],
            [
                12809,
                12924
            ],
            [
                12924,
                12998
            ],
            [
                12998,
                13159
            ],
            [
                13159,
                13244
            ],
            [
                13244,
                13385
            ],
            [
                13385,
                13538
            ],
            [
                13538,
                13538
            ],
            [
                13538,
                13772
            ],
            [
                13772,
                13772
            ],
            [
                13772,
                13854
            ],
            [
                13854,
                14025
            ],
            [
                14025,
                14168
            ],
            [
                14168,
                14211
            ],
            [
                14211,
                14266
            ],
            [
                14266,
                14389
            ],
            [
                14389,
                14463
            ],
            [
                14463,
                14505
            ],
            [
                14505,
                14740
            ],
            [
                14740,
                14866
            ],
            [
                14866,
                14905
            ],
            [
                14905,
                14964
            ],
            [
                14964,
                15087
            ],
            [
                15087,
                15280
            ],
            [
                15280,
                15364
            ],
            [
                15364,
                15713
            ],
            [
                15713,
                15756
            ],
            [
                15756,
                15790
            ],
            [
                15790,
                15816
            ],
            [
                15816,
                15899
            ],
            [
                15899,
                15937
            ],
            [
                15937,
                15973
            ],
            [
                15973,
                16000
            ],
            [
                16000,
                16037
            ],
            [
                16037,
                16159
            ],
            [
                16159,
                16218
            ],
            [
                16218,
                16286
            ],
            [
                16286,
                16386
            ],
            [
                16386,
                16441
            ],
            [
                16441,
                16441
            ],
            [
                16441,
                16541
            ],
            [
                16541,
                16567
            ],
            [
                16567,
                16609
            ],
            [
                16609,
                16659
            ],
            [
                16659,
                16736
            ],
            [
                16736,
                16785
            ],
            [
                16785,
                16809
            ],
            [
                16809,
                17016
            ],
            [
                17016,
                17179
            ],
            [
                17179,
                17179
            ],
            [
                17179,
                17401
            ],
            [
                17401,
                17490
            ],
            [
                17490,
                17566
            ],
            [
                17566,
                17603
            ],
            [
                17603,
                17718
            ],
            [
                17718,
                17828
            ],
            [
                17828,
                17864
            ],
            [
                17864,
                17978
            ],
            [
                17978,
                18037
            ],
            [
                18037,
                18037
            ],
            [
                18037,
                18109
            ],
            [
                18109,
                18180
            ],
            [
                18180,
                18274
            ],
            [
                18274,
                18311
            ],
            [
                18311,
                18424
            ],
            [
                18424,
                18480
            ],
            [
                18480,
                18530
            ],
            [
                18530,
                18625
            ],
            [
                18625,
                18678
            ],
            [
                18678,
                18710
            ],
            [
                18710,
                18783
            ],
            [
                18783,
                18848
            ],
            [
                18848,
                18910
            ],
            [
                18910,
                18982
            ],
            [
                18982,
                19089
            ],
            [
                19089,
                19089
            ],
            [
                19089,
                19191
            ],
            [
                19191,
                19282
            ],
            [
                19282,
                19478
            ],
            [
                19478,
                19542
            ],
            [
                19542,
                19716
            ],
            [
                19716,
                19769
            ],
            [
                19769,
                19923
            ],
            [
                19923,
                20139
            ],
            [
                20139,
                20278
            ],
            [
                20278,
                20310
            ],
            [
                20310,
                20310
            ],
            [
                20310,
                20899
            ],
            [
                20899,
                20986
            ],
            [
                20986,
                21033
            ],
            [
                21033,
                21084
            ],
            [
                21084,
                21158
            ],
            [
                21158,
                21199
            ],
            [
                21199,
                21271
            ],
            [
                21271,
                21298
            ],
            [
                21298,
                21386
            ],
            [
                21386,
                21386
            ],
            [
                21386,
                21442
            ],
            [
                21442,
                21588
            ],
            [
                21588,
                21657
            ],
            [
                21657,
                21657
            ],
            [
                21657,
                21710
            ],
            [
                21710,
                21778
            ],
            [
                21778,
                21778
            ],
            [
                21778,
                21778
            ],
            [
                21778,
                21778
            ],
            [
                21778,
                21862
            ],
            [
                21862,
                21900
            ],
            [
                21900,
                21900
            ],
            [
                21900,
                21900
            ],
            [
                21900,
                21900
            ],
            [
                21900,
                21947
            ],
            [
                21947,
                21947
            ],
            [
                21947,
                21947
            ],
            [
                21947,
                21968
            ],
            [
                21968,
                22010
            ],
            [
                22010,
                22084
            ],
            [
                22084,
                22156
            ],
            [
                22156,
                22274
            ],
            [
                22274,
                22338
            ],
            [
                22338,
                22418
            ],
            [
                22418,
                22524
            ],
            [
                22524,
                22582
            ],
            [
                22582,
                22728
            ],
            [
                22728,
                22744
            ],
            [
                22744,
                22763
            ],
            [
                22763,
                22763
            ],
            [
                22763,
                22806
            ],
            [
                22806,
                22871
            ],
            [
                22871,
                22887
            ],
            [
                22887,
                22898
            ],
            [
                22898,
                22955
            ],
            [
                22955,
                23033
            ],
            [
                23033,
                23099
            ],
            [
                23099,
                23170
            ],
            [
                23170,
                23170
            ],
            [
                23170,
                23170
            ],
            [
                23170,
                23231
            ],
            [
                23231,
                23249
            ],
            [
                23249,
                23345
            ],
            [
                23345,
                23523
            ]
        ]
    }
}