{
    "original": {
        "text": "How trace the why and wherefore in a mind reduced to the barrenness of a fastidious egoism, in which all direct desires are dulled, and have dwindled from motives into a vacillating expectation of motives: a mind made up of moods, where a fitful impulse springs here and there conspicuously rank amid the general weediness? 'Tis a condition apt to befall a life too much at large, unmoulded by the pressure of obligation. _Nam deteriores omnes sumus licentiae_, or, as a more familiar tongue might deliver it, _\"As you like\" is a bad finger-post._\nPotentates make known their intentions and affect the funds at a small expense of words. So when Grandcourt, after learning that Gwendolen had left Leubronn, incidentally pronounced that resort of fashion a beastly hole, worse than Baden, the remark was conclusive to Mr. Lush that his patron intended straightway to return to Diplow. The execution was sure to be slower than the intention, and, in fact, Grandcourt did loiter through the next day without giving any distinct orders about departure--perhaps because he discerned that Lush was expecting them: he lingered over his toilet, and certainly came down with a faded aspect of perfect distinction which made fresh complexions and hands with the blood in them, seem signs of raw vulgarity; he lingered on the terrace, in the gambling-rooms, in the reading-room, occupying himself in being indifferent to everybody and everything around him. When he met Lady Mallinger, however, he took some trouble--raised his hat, paused, and proved that he listened to her recommendation of the waters by replying, \"Yes; I heard somebody say how providential it was that there always happened to be springs at gambling places.\"\n\"Oh, that was a joke,\" said innocent Lady Mallinger, misled by Grandcourt's languid seriousness, \"in imitation of the old one about the towns and the rivers, you know.\"\n\"Ah, perhaps,\" said Grandcourt, without change of expression. Lady Mallinger thought this worth telling to Sir Hugo, who said, \"Oh, my dear, he is not a fool. You must not suppose that he can't see a joke. He can play his cards as well as most of us.\"\n\"He has never seemed to me a very sensible man,\" said Lady Mallinger, in excuse of herself. She had a secret objection to meeting Grandcourt, who was little else to her than a large living sign of what she felt to be her failure as a wife--the not having presented Sir Hugo with a son. Her constant reflection was that her husband might fairly regret his choice, and if he had not been very good might have treated her with some roughness in consequence, gentlemen naturally disliking to be disappointed.\nDeronda, too, had a recognition from Grandcourt, for which he was not grateful, though he took care to return it with perfect civility. No reasoning as to the foundations of custom could do away with the early-rooted feeling that his birth had been attended with injury for which his father was to blame; and seeing that but for this injury Grandcourt's prospects might have been his, he was proudly resolute not to behave in any way that might be interpreted into irritation on that score. He saw a very easy descent into mean unreasoning rancor and triumph in others' frustration; and being determined not to go down that ugly pit, he turned his back on it, clinging to the kindlier affections within him as a possession. Pride certainly helped him well--the pride of not recognizing a disadvantage for one's self which vulgar minds are disposed to exaggerate, such as the shabby equipage of poverty: he would not have a man like Grandcourt suppose himself envied by him. But there is no guarding against interpretation. Grandcourt did believe that Deronda, poor devil, who he had no doubt was his cousin by the father's side, inwardly winced under their mutual position; wherefore the presence of that less lucky person was more agreeable to him than it would otherwise have been. An imaginary envy, the idea that others feel their comparative deficiency, is the ordinary _cortge_ of egoism; and his pet dogs were not the only beings that Grandcourt liked to feel his power over in making them jealous. Hence he was civil enough to exchange several words with Deronda on the terrace about the hunting round Diplow, and even said, \"You had better come over for a run or two when the season begins.\"\nLush, not displeased with delay, amused himself very well, partly in gossiping with Sir Hugo and in answering his questions about Grandcourt's affairs so far as they might affect his willingness to part with his interest in Diplow. Also about Grandcourt's personal entanglements, the baronet knew enough already for Lush to feel released from silence on a sunny autumn day, when there was nothing more agreeable to do in lounging promenades than to speak freely of a tyrannous patron behind his back. Sir Hugo willingly inclined his ear to a little good-humored scandal, which he was fond of calling _traits de moeurs_; but he was strict in keeping such communications from hearers who might take them too seriously. Whatever knowledge he had of his nephew's secrets, he had never spoken of it to Deronda, who considered Grandcourt a pale-blooded mortal, but was far from wishing to hear how the red corpuscles had been washed out of him. It was Lush's policy and inclination to gratify everybody when he had no reason to the contrary; and the baronet always treated him well, as one of those easy-handled personages who, frequenting the society of gentlemen, without being exactly gentlemen themselves, can be the more serviceable, like the second-best articles of our wardrobe, which we use with a comfortable freedom from anxiety.\n\"Well, you will let me know the turn of events,\" said Sir Hugo, \"if this marriage seems likely to come off after all, or if anything else happens to make the want of money pressing. My plan would be much better for him than burdening Ryelands.\"\n\"That's true,\" said Lush, \"only it must not be urged on him--just placed in his way that the scent may tickle him. Grandcourt is not a man to be always led by what makes for his own interest; especially if you let him see that it makes for your interest too. I'm attached to him, of course. I've given up everything else for the sake of keeping by him, and it has lasted a good fifteen years now. He would not easily get any one else to fill my place. He's a peculiar character, is Henleigh Grandcourt, and it has been growing on him of late years. However, I'm of a constant disposition, and I've been a sort of guardian to him since he was twenty; an uncommonly fascinating fellow he was then, to be sure--and could be now, if he liked. I'm attached to him; and it would be a good deal worse for him if he missed me at his elbow.\"\nSir Hugo did not think it needful to express his sympathy or even assent, and perhaps Lush himself did not expect this sketch of his motives to be taken as exact. But how can a man avoid himself as a subject in conversation? And he must make some sort of decent toilet in words, as in cloth and linen. Lush's listener was not severe: a member of Parliament could allow for the necessities of verbal toilet; and the dialogue went on without any change of mutual estimate.\nHowever, Lush's easy prospect of indefinite procrastination was cut off the next morning by Grandcourt's saluting him with the question,\n\"Are you making all the arrangements for our starting by the Paris train?\"\n\"I didn't know you meant to start,\" said Lush, not exactly taken by surprise.\n\"You might have known,\" said Grandcourt, looking at the burned length of his cigar, and speaking in that lowered tone which was usual with him when he meant to express disgust and be peremptory. \"Just see to everything, will you? and mind no brute gets into the same carriage with us. And leave my P. P. C. at the Mallingers'.\"\nIn consequence they were at Paris the next day; but here Lush was gratified by the proposal or command that he should go straight on to Diplow and see that everything was right, while Grandcourt and the valet remained behind; and it was not until several days later that Lush received the telegram ordering the carriage to the Wanchester station.\nHe had used the interim actively, not only in carrying out Grandcourt's orders about the stud and household, but in learning all he could of Gwendolen, and how things were going on at Offendene. What was the probable effect that the news of the family misfortunes would have on Grandcourt's fitful obstinacy he felt to be quite incalculable. So far as the girl's poverty might be an argument that she would accept an offer from him now in spite of any previous coyness, it might remove that bitter objection to risk a repulse which Lush divined to be one of Grandcourt's deterring motives; on the other hand, the certainty of acceptance was just \"the sort of thing\" to make him lapse hither and thither with no more apparent will than a moth. Lush had had his patron under close observation for many years, and knew him perhaps better than he knew any other subject; but to know Grandcourt was to doubt what he would do in any particular case. It might happen that he would behave with an apparent magnanimity, like the hero of a modern French drama, whose sudden start into moral splendor after much lying and meanness, leaves you little confidence as to any part of his career that may follow the fall of the curtain. Indeed, what attitude would have been more honorable for a final scene than that of declining to seek an heiress for her money, and determining to marry the attractive girl who had none? But Lush had some general certainties about Grandcourt, and one was that of all inward movements those of generosity were least likely to occur in him. Of what use, however, is a general certainty that an insect will not walk with his head hindmost, when what you need to know is the play of inward stimulus that sends him hither and thither in a network of possible paths? Thus Lush was much at fault as to the probable issue between Grandcourt and Gwendolen, when what he desired was a perfect confidence that they would never be married. He would have consented willingly that Grandcourt should marry an heiress, or that he should marry Mrs. Glasher: in the one match there would have been the immediate abundance that prospective heirship could not supply, in the other there would have been the security of the wife's gratitude, for Lush had always been Mrs. Glasher's friend; and that the future Mrs. Grandcourt should not be socially received could not affect his private comfort. He would not have minded, either, that there should be no marriage in question at all; but he felt himself justified in doing his utmost to hinder a marriage with a girl who was likely to bring nothing but trouble to her husband--not to speak of annoyance if not ultimate injury to her husband's old companion, whose future Mr. Lush earnestly wished to make as easy as possible, considering that he had well deserved such compensation for leading a dog's life, though that of a dog who enjoyed many tastes undisturbed, and who profited by a large establishment. He wished for himself what he felt to be good, and was not conscious of wishing harm to any one else; unless perhaps it were just now a little harm to the inconvenient and impertinent Gwendolen. But the easiest-humored of luxury and music, the toad-eater the least liable to nausea, must be expected to have his susceptibilities. And Mr. Lush was accustomed to be treated by the world in general as an apt, agreeable fellow: he had not made up his mind to be insulted by more than one person.\nWith this imperfect preparation of a war policy, Lush was awaiting Grandcourt's arrival, doing little more than wondering how the campaign would begin. The first day Grandcourt was much occupied with the stables, and amongst other things he ordered a groom to put a side-saddle on Criterion and let him review the horse's paces. This marked indication of purpose set Lush on considering over again whether he should incur the ticklish consequences of speaking first, while he was still sure that no compromising step had been taken; and he rose the next morning almost resolved that if Grandcourt seemed in as good a humor as yesterday and entered at all into talk, he would let drop the interesting facts about Gwendolen and her family, just to see how they would work, and to get some guidance. But Grandcourt did not enter into talk, and in answer to a question even about his own convenience, no fish could have maintained a more unwinking silence. After he had read his letters he gave various orders to be executed or transmitted by Lush, and then thrust his shoulder toward that useful person, who accordingly rose to leave the room. But before he was out of the door Grandcourt turned his head slightly and gave a broken, languid \"Oh.\"\n\"What is it?\" said Lush, who, it must have been observed, did not take his dusty puddings with a respectful air.\n\"Shut the door, will you? I can't speak into the corridor.\"\nLush closed the door, came forward, and chose to sit down.\nAfter a little pause Grandcourt said, \"Is Miss Harleth at Offendene?\" He was quite certain that Lush had made it his business to inquire about her, and he had some pleasure in thinking that Lush did not want _him_ to inquire.\n\"Well, I hardly know,\" said Lush, carelessly. \"The family's utterly done up. They and the Gascoignes too have lost all their money. It's owing to some rascally banking business. The poor mother hasn't a _sou_, it seems. She and the girls have to huddle themselves into a little cottage like a laborer's.\"\n\"Don't lie to me, if you please,\" said Grandcourt, in his lowest audible tone. \"It's not amusing, and it answers no other purpose.\"\n\"What do you mean?\" said Lush, more nettled than was common with him--the prospect before him being more than commonly disturbing.\n\"Just tell me the truth, will you?\"\n\"It's no invention of mine. I have heard the story from several--Bazley, Brackenshaw's man, for one. He is getting a new tenant for Offendene.\"\n\"I don't mean that. Is Miss Harleth there, or is she not?\" said Grandcourt, in his former tone.\n\"Upon my soul, I can't tell,\" said Lush, rather sulkily. \"She may have left yesterday. I heard she had taken a situation as governess; she may be gone to it for what I know. But if you wanted to see her no doubt the mother would send for her back.\" This sneer slipped off his tongue without strict intention.\n\"Send Hutchins to inquire whether she will be there tomorrow.\" Lush did not move. Like many persons who have thought over beforehand what they shall say in given cases, he was impelled by an unexpected irritation to say some of those prearranged things before the cases were given. Grandcourt, in fact, was likely to get into a scrape so tremendous that it was impossible to let him take the first step toward it without remonstrance. Lush retained enough caution to use a tone of rational friendliness, still he felt his own value to his patron, and was prepared to be daring.\n\"It would be as well for you to remember, Grandcourt, that you are coming under closer fire now. There can be none of the ordinary flirting done, which may mean everything or nothing. You must make up your mind whether you wish to be accepted; and more than that, how you would like being refused. Either one or the other. You can't be philandering after her again for six weeks.\"\nGrandcourt said nothing, but pressed the newspaper down on his knees and began to light another cigar. Lush took this as a sign that he was willing to listen, and was the more bent on using the opportunity; he wanted, if possible, to find out which would be the more potent cause of hesitation--probable acceptance or probable refusal.\n\"Everything has a more serious look now than it had before. There is her family to be provided for. You could not let your wife's mother live in beggary. It will be a confoundedly hampering affair. Marriage will pin you down in a way you haven't been used to; and in point of money you have not too much elbow-room. And after all, what will you get by it? You are master over your estates, present or future, as far as choosing your heir goes; it's a pity to go on encumbering them for a mere whim, which you may repent of in a twelvemonth. I should be sorry to see you making a mess of your life in that way. If there were anything solid to be gained by the marriage, that would be a different affair.\"\nLush's tone had gradually become more and more unctuous in its friendliness of remonstrance, and he was almost in danger of forgetting that he was merely gambling in argument. When he left off, Grandcourt took his cigar out of his mouth, and looking steadily at the moist end while he adjusted the leaf with his delicate finger-tips, said,\n\"I knew before that you had an objection to my marrying Miss Harleth.\" Here he made a little pause before he continued. \"But I never considered that a reason against it.\"\n\"I never supposed you did,\" answered Lush, not unctuously but dryly. \"It was not _that_ I urged as a reason. I should have thought it might have been a reason against it, after all your experience, that you would be acting like the hero of a ballad, and making yourself absurd--and all for what? You know you couldn't make up your mind before. It's impossible you can care much about her. And as for the tricks she is likely to play, you may judge of that from what you heard at Leubronn. However, what I wished to point out to you was, that there can be no shilly-shally now.\"\n\"Perfectly,\" said Grandcourt, looking round at Lush and fixing him with narrow eyes; \"I don't intend that there should be. I dare say it's disagreeable to you. But if you suppose I care a damn for that you are most stupendously mistaken.\"\n\"Oh, well,\" said Lush, rising with his hands in his pockets, and feeling some latent venom still within him, \"if you have made up your mind!--only there's another aspect of the affair. I have been speaking on the supposition that it was absolutely certain she would accept you, and that destitution would have no choice. But I am not so sure that the young lady is to be counted on. She is kittle cattle to shoe, I think. And she had her reasons for running away before.\" Lush had moved a step or two till he stood nearly in front of Grandcourt, though at some distance from him. He did not feel himself much restrained by consequences, being aware that the only strong hold he had on his present position was his serviceableness; and even after a quarrel the want of him was likely sooner or later to recur. He foresaw that Gwendolen would cause him to be ousted for a time, and his temper at this moment urged him to risk a quarrel.\n\"She had her reasons,\" he repeated more significantly.\n\"I had come to that conclusion before,\" said Grandcourt, with contemptuous irony.\n\"Yes, but I hardly think you know what her reasons were.\"\n\"You do, apparently,\" said Grandcourt, not betraying by so much as an eyelash that he cared for the reasons.\n\"Yes, and you had better know too, that you may judge of the influence you have over her if she swallows her reasons and accepts you. For my own part I would take odds against it. She saw Lydia in Cardell Chase and heard the whole story.\"\nGrandcourt made no immediate answer, and only went on smoking. He was so long before he spoke that Lush moved about and looked out of the windows, unwilling to go away without seeing some effect of his daring move. He had expected that Grandcourt would tax him with having contrived the affair, since Mrs. Glasher was then living at Gadsmere, a hundred miles off, and he was prepared to admit the fact: what he cared about was that Grandcourt should be staggered by the sense that his intended advances must be made to a girl who had that knowledge in her mind and had been scared by it. At length Grandcourt, seeing Lush turn toward him, looked at him again and said, contemptuously, \"What follows?\"\nHere certainly was a \"mate\" in answer to Lush's \"check\"; and though his exasperation with Grandcourt was perhaps stronger than it had ever been before, it would have been idiocy to act as if any further move could be useful. He gave a slight shrug with one shoulder, and was going to walk away, when Grandcourt, turning on his seat toward the table, said, as quietly as if nothing had occurred, \"Oblige me by pushing that pen and paper here, will you?\"\nNo thunderous, bullying superior could have exercised the imperious spell that Grandcourt did. Why, instead of being obeyed, he had never been told to go to a warmer place, was perhaps a mystery to those who found themselves obeying him. The pen and paper were pushed to him, and as he took them he said, \"Just wait for this letter.\"\nHe scrawled with ease, and the brief note was quickly addressed. \"Let Hutchins go with it at once, will you?\" said Grandcourt, pushing the letter away from him.\nAs Lush had expected, it was addressed to Miss Harleth, Offendene. When his irritation had cooled down he was glad there had been no explosive quarrel; but he felt sure that there was a notch made against him, and that somehow or other he was intended to pay. It was also clear to him that the immediate effect of his revelation had been to harden Grandcourt's previous determination. But as to the particular movements that made this process in his baffling mind, Lush could only toss up his chin in despair of a theory.",
        "paragraph_chars": [
            [
                0,
                548
            ],
            [
                548,
                1719
            ],
            [
                1719,
                1888
            ],
            [
                1888,
                2140
            ],
            [
                2140,
                2645
            ],
            [
                2645,
                4346
            ],
            [
                4346,
                5680
            ],
            [
                5680,
                5925
            ],
            [
                5925,
                6758
            ],
            [
                6758,
                7229
            ],
            [
                7229,
                7366
            ],
            [
                7366,
                7441
            ],
            [
                7441,
                7519
            ],
            [
                7519,
                7847
            ],
            [
                7847,
                8194
            ],
            [
                8194,
                11644
            ],
            [
                11644,
                12888
            ],
            [
                12888,
                13001
            ],
            [
                13001,
                13061
            ],
            [
                13061,
                13120
            ],
            [
                13120,
                13346
            ],
            [
                13346,
                13651
            ],
            [
                13651,
                13783
            ],
            [
                13783,
                13914
            ],
            [
                13914,
                13950
            ],
            [
                13950,
                14094
            ],
            [
                14094,
                14190
            ],
            [
                14190,
                14499
            ],
            [
                14499,
                15077
            ],
            [
                15077,
                15458
            ],
            [
                15458,
                15794
            ],
            [
                15794,
                16498
            ],
            [
                16498,
                16838
            ],
            [
                16838,
                17009
            ],
            [
                17009,
                17587
            ],
            [
                17587,
                17826
            ],
            [
                17826,
                18761
            ],
            [
                18761,
                18816
            ],
            [
                18816,
                18898
            ],
            [
                18898,
                18956
            ],
            [
                18956,
                19065
            ],
            [
                19065,
                19304
            ],
            [
                19304,
                20005
            ],
            [
                20005,
                20458
            ],
            [
                20458,
                20792
            ],
            [
                20792,
                20953
            ],
            [
                20953,
                21474
            ]
        ],
        "segment_chars": [
            [
                0,
                324
            ],
            [
                324,
                422
            ],
            [
                422,
                548
            ],
            [
                548,
                637
            ],
            [
                637,
                883
            ],
            [
                883,
                1446
            ],
            [
                1446,
                1719
            ],
            [
                1719,
                1888
            ],
            [
                1888,
                1950
            ],
            [
                1950,
                2047
            ],
            [
                2047,
                2094
            ],
            [
                2094,
                2140
            ],
            [
                2140,
                2232
            ],
            [
                2232,
                2426
            ],
            [
                2426,
                2645
            ],
            [
                2645,
                2781
            ],
            [
                2781,
                3136
            ],
            [
                3136,
                3369
            ],
            [
                3369,
                3619
            ],
            [
                3619,
                3668
            ],
            [
                3668,
                3929
            ],
            [
                3929,
                4151
            ],
            [
                4151,
                4346
            ],
            [
                4346,
                4578
            ],
            [
                4578,
                4847
            ],
            [
                4847,
                5063
            ],
            [
                5063,
                5285
            ],
            [
                5285,
                5680
            ],
            [
                5680,
                5862
            ],
            [
                5862,
                5925
            ],
            [
                5925,
                6040
            ],
            [
                6040,
                6184
            ],
            [
                6184,
                6216
            ],
            [
                6216,
                6322
            ],
            [
                6322,
                6377
            ],
            [
                6377,
                6474
            ],
            [
                6474,
                6664
            ],
            [
                6664,
                6758
            ],
            [
                6758,
                6921
            ],
            [
                6921,
                6983
            ],
            [
                6983,
                7060
            ],
            [
                7060,
                7229
            ],
            [
                7229,
                7366
            ],
            [
                7366,
                7441
            ],
            [
                7441,
                7519
            ],
            [
                7519,
                7714
            ],
            [
                7714,
                7749
            ],
            [
                7749,
                7804
            ],
            [
                7804,
                7847
            ],
            [
                7847,
                8194
            ],
            [
                8194,
                8389
            ],
            [
                8389,
                8536
            ],
            [
                8536,
                8937
            ],
            [
                8937,
                9138
            ],
            [
                9138,
                9414
            ],
            [
                9414,
                9601
            ],
            [
                9601,
                9753
            ],
            [
                9753,
                9975
            ],
            [
                9975,
                10142
            ],
            [
                10142,
                10589
            ],
            [
                10589,
                11151
            ],
            [
                11151,
                11346
            ],
            [
                11346,
                11481
            ],
            [
                11481,
                11644
            ],
            [
                11644,
                11796
            ],
            [
                11796,
                11973
            ],
            [
                11973,
                12441
            ],
            [
                12441,
                12597
            ],
            [
                12597,
                12785
            ],
            [
                12785,
                12888
            ],
            [
                12888,
                12902
            ],
            [
                12902,
                13001
            ],
            [
                13001,
                13027
            ],
            [
                13027,
                13061
            ],
            [
                13061,
                13120
            ],
            [
                13120,
                13190
            ],
            [
                13190,
                13346
            ],
            [
                13346,
                13392
            ],
            [
                13392,
                13423
            ],
            [
                13423,
                13478
            ],
            [
                13478,
                13524
            ],
            [
                13524,
                13566
            ],
            [
                13566,
                13651
            ],
            [
                13651,
                13730
            ],
            [
                13730,
                13783
            ],
            [
                13783,
                13803
            ],
            [
                13803,
                13914
            ],
            [
                13914,
                13950
            ],
            [
                13950,
                13978
            ],
            [
                13978,
                14051
            ],
            [
                14051,
                14094
            ],
            [
                14094,
                14114
            ],
            [
                14114,
                14153
            ],
            [
                14153,
                14190
            ],
            [
                14190,
                14247
            ],
            [
                14247,
                14277
            ],
            [
                14277,
                14364
            ],
            [
                14364,
                14439
            ],
            [
                14439,
                14499
            ],
            [
                14499,
                14562
            ],
            [
                14562,
                14581
            ],
            [
                14581,
                14781
            ],
            [
                14781,
                14934
            ],
            [
                14934,
                15077
            ],
            [
                15077,
                15174
            ],
            [
                15174,
                15261
            ],
            [
                15261,
                15375
            ],
            [
                15375,
                15400
            ],
            [
                15400,
                15458
            ],
            [
                15458,
                15561
            ],
            [
                15561,
                15794
            ],
            [
                15794,
                15854
            ],
            [
                15854,
                15894
            ],
            [
                15894,
                15948
            ],
            [
                15948,
                15992
            ],
            [
                15992,
                16110
            ],
            [
                16110,
                16150
            ],
            [
                16150,
                16335
            ],
            [
                16335,
                16404
            ],
            [
                16404,
                16498
            ],
            [
                16498,
                16674
            ],
            [
                16674,
                16838
            ],
            [
                16838,
                16909
            ],
            [
                16909,
                16958
            ],
            [
                16958,
                17009
            ],
            [
                17009,
                17078
            ],
            [
                17078,
                17118
            ],
            [
                17118,
                17305
            ],
            [
                17305,
                17353
            ],
            [
                17353,
                17398
            ],
            [
                17398,
                17498
            ],
            [
                17498,
                17587
            ],
            [
                17587,
                17710
            ],
            [
                17710,
                17747
            ],
            [
                17747,
                17826
            ],
            [
                17826,
                18011
            ],
            [
                18011,
                18147
            ],
            [
                18147,
                18209
            ],
            [
                18209,
                18248
            ],
            [
                18248,
                18298
            ],
            [
                18298,
                18406
            ],
            [
                18406,
                18635
            ],
            [
                18635,
                18761
            ],
            [
                18761,
                18816
            ],
            [
                18816,
                18898
            ],
            [
                18898,
                18956
            ],
            [
                18956,
                19065
            ],
            [
                19065,
                19199
            ],
            [
                19199,
                19245
            ],
            [
                19245,
                19304
            ],
            [
                19304,
                19367
            ],
            [
                19367,
                19519
            ],
            [
                19519,
                19892
            ],
            [
                19892,
                20005
            ],
            [
                20005,
                20230
            ],
            [
                20230,
                20458
            ],
            [
                20458,
                20553
            ],
            [
                20553,
                20696
            ],
            [
                20696,
                20792
            ],
            [
                20792,
                20857
            ],
            [
                20857,
                20902
            ],
            [
                20902,
                20953
            ],
            [
                20953,
                21020
            ],
            [
                21020,
                21213
            ],
            [
                21213,
                21338
            ],
            [
                21338,
                21474
            ]
        ],
        "overlap_chars": [
            [
                640,
                655
            ],
            [
                672,
                705
            ],
            [
                719,
                741
            ],
            [
                753,
                767
            ],
            [
                816,
                824
            ],
            [
                813,
                815
            ],
            [
                825,
                883
            ],
            [
                951,
                963
            ],
            [
                968,
                970
            ],
            [
                975,
                1014
            ],
            [
                1024,
                1036
            ],
            [
                1293,
                1445
            ],
            [
                1446,
                1490
            ],
            [
                1582,
                1585
            ],
            [
                1496,
                1503
            ],
            [
                1557,
                1559
            ],
            [
                1512,
                1519
            ],
            [
                1529,
                1532
            ],
            [
                2236,
                2261
            ],
            [
                2270,
                2285
            ],
            [
                2342,
                2350
            ],
            [
                2286,
                2289
            ],
            [
                2314,
                2336
            ],
            [
                2357,
                2378
            ],
            [
                2384,
                2425
            ],
            [
                2645,
                2664
            ],
            [
                2677,
                2781
            ],
            [
                2961,
                2973
            ],
            [
                2925,
                2935
            ],
            [
                2986,
                3104
            ],
            [
                2794,
                2796
            ],
            [
                3110,
                3136
            ],
            [
                3136,
                3138
            ],
            [
                3238,
                3255
            ],
            [
                3163,
                3167
            ],
            [
                3185,
                3189
            ],
            [
                3277,
                3278
            ],
            [
                3314,
                3316
            ],
            [
                3321,
                3340
            ],
            [
                3367,
                3368
            ],
            [
                3668,
                3751
            ],
            [
                3772,
                3818
            ],
            [
                3765,
                3767
            ],
            [
                3833,
                3841
            ],
            [
                3877,
                3893
            ],
            [
                3927,
                3929
            ],
            [
                4044,
                4126
            ],
            [
                4130,
                4151
            ],
            [
                4151,
                4159
            ],
            [
                4164,
                4169
            ],
            [
                4197,
                4303
            ],
            [
                4321,
                4346
            ],
            [
                4346,
                4350
            ],
            [
                4379,
                4393
            ],
            [
                4412,
                4496
            ],
            [
                4350,
                4351
            ],
            [
                4801,
                4847
            ],
            [
                4847,
                4903
            ],
            [
                4908,
                4916
            ],
            [
                4966,
                4969
            ],
            [
                5061,
                5063
            ],
            [
                5063,
                5126
            ],
            [
                5143,
                5150
            ],
            [
                5283,
                5284
            ],
            [
                5680,
                5686
            ],
            [
                5696,
                5742
            ],
            [
                5742,
                5833
            ],
            [
                5838,
                5842
            ],
            [
                5846,
                5851
            ],
            [
                5860,
                5862
            ],
            [
                5862,
                5869
            ],
            [
                5891,
                5898
            ],
            [
                5870,
                5878
            ],
            [
                5884,
                5890
            ],
            [
                5899,
                5925
            ],
            [
                5925,
                5984
            ],
            [
                5986,
                6040
            ],
            [
                6040,
                6069
            ],
            [
                6077,
                6106
            ],
            [
                6115,
                6154
            ],
            [
                6179,
                6184
            ],
            [
                6216,
                6220
            ],
            [
                6270,
                6276
            ],
            [
                6246,
                6249
            ],
            [
                6296,
                6322
            ],
            [
                6322,
                6345
            ],
            [
                6354,
                6377
            ],
            [
                6377,
                6426
            ],
            [
                6573,
                6574
            ],
            [
                6474,
                6482
            ],
            [
                6664,
                6726
            ],
            [
                6740,
                6742
            ],
            [
                6755,
                6758
            ],
            [
                7321,
                7333
            ],
            [
                7273,
                7288
            ],
            [
                7301,
                7317
            ],
            [
                7347,
                7351
            ],
            [
                7356,
                7364
            ],
            [
                7366,
                7381
            ],
            [
                7386,
                7441
            ],
            [
                7441,
                7486
            ],
            [
                7517,
                7519
            ],
            [
                7519,
                7570
            ],
            [
                7592,
                7642
            ],
            [
                7667,
                7669
            ],
            [
                7676,
                7694
            ],
            [
                7712,
                7714
            ],
            [
                7714,
                7749
            ],
            [
                7749,
                7802
            ],
            [
                7847,
                7929
            ],
            [
                7942,
                8041
            ],
            [
                8056,
                8071
            ],
            [
                8094,
                8106
            ],
            [
                8192,
                8194
            ],
            [
                8201,
                8282
            ],
            [
                8292,
                8389
            ],
            [
                8502,
                8509
            ],
            [
                8418,
                8422
            ],
            [
                8398,
                8401
            ],
            [
                8411,
                8417
            ],
            [
                8423,
                8457
            ],
            [
                8469,
                8482
            ],
            [
                8394,
                8397
            ],
            [
                8516,
                8536
            ],
            [
                8546,
                8570
            ],
            [
                8905,
                8909
            ],
            [
                8739,
                8741
            ],
            [
                8601,
                8607
            ],
            [
                8622,
                8625
            ],
            [
                8662,
                8663
            ],
            [
                8885,
                8888
            ],
            [
                8673,
                8679
            ],
            [
                8692,
                8704
            ],
            [
                8710,
                8719
            ],
            [
                8782,
                8839
            ],
            [
                8841,
                8858
            ],
            [
                8860,
                8877
            ],
            [
                8935,
                8936
            ],
            [
                8937,
                8945
            ],
            [
                8950,
                8960
            ],
            [
                8985,
                9013
            ],
            [
                9059,
                9064
            ],
            [
                9034,
                9036
            ],
            [
                9084,
                9087
            ],
            [
                9136,
                9138
            ],
            [
                9159,
                9161
            ],
            [
                9141,
                9146
            ],
            [
                9168,
                9179
            ],
            [
                9183,
                9204
            ],
            [
                9546,
                9570
            ],
            [
                9582,
                9586
            ],
            [
                9601,
                9673
            ],
            [
                9707,
                9717
            ],
            [
                9736,
                9753
            ],
            [
                9753,
                9797
            ],
            [
                9849,
                9884
            ],
            [
                9798,
                9802
            ],
            [
                9946,
                9947
            ],
            [
                9813,
                9817
            ],
            [
                9973,
                9975
            ],
            [
                10278,
                10293
            ],
            [
                10181,
                10191
            ],
            [
                10199,
                10219
            ],
            [
                10241,
                10254
            ],
            [
                10262,
                10271
            ],
            [
                10145,
                10155
            ],
            [
                10298,
                10317
            ],
            [
                10360,
                10361
            ],
            [
                10483,
                10486
            ],
            [
                10365,
                10374
            ],
            [
                10413,
                10481
            ],
            [
                10587,
                10589
            ],
            [
                10680,
                10817
            ],
            [
                11106,
                11111
            ],
            [
                10835,
                10844
            ],
            [
                10868,
                10966
            ],
            [
                11149,
                11150
            ],
            [
                11800,
                11809
            ],
            [
                11810,
                11824
            ],
            [
                11830,
                11860
            ],
            [
                11885,
                11934
            ],
            [
                11971,
                11973
            ],
            [
                11973,
                11977
            ],
            [
                12011,
                12015
            ],
            [
                12042,
                12103
            ],
            [
                12175,
                12180
            ],
            [
                12189,
                12205
            ],
            [
                12117,
                12119
            ],
            [
                12161,
                12164
            ],
            [
                12206,
                12221
            ],
            [
                12419,
                12421
            ],
            [
                12319,
                12381
            ],
            [
                12227,
                12240
            ],
            [
                12120,
                12123
            ],
            [
                12248,
                12250
            ],
            [
                12259,
                12260
            ],
            [
                12254,
                12258
            ],
            [
                12109,
                12110
            ],
            [
                12382,
                12413
            ],
            [
                12439,
                12440
            ],
            [
                12441,
                12479
            ],
            [
                12541,
                12597
            ],
            [
                12597,
                12602
            ],
            [
                12615,
                12664
            ],
            [
                12680,
                12687
            ],
            [
                12743,
                12785
            ],
            [
                12789,
                12865
            ],
            [
                12874,
                12888
            ],
            [
                12888,
                12902
            ],
            [
                12902,
                12916
            ],
            [
                12946,
                13001
            ],
            [
                13001,
                13027
            ],
            [
                13027,
                13061
            ],
            [
                13061,
                13081
            ],
            [
                13118,
                13120
            ],
            [
                13120,
                13190
            ],
            [
                13190,
                13220
            ],
            [
                13257,
                13266
            ],
            [
                13344,
                13346
            ],
            [
                13346,
                13347
            ],
            [
                13353,
                13392
            ],
            [
                13392,
                13423
            ],
            [
                13423,
                13427
            ],
            [
                13456,
                13478
            ],
            [
                13524,
                13548
            ],
            [
                13554,
                13566
            ],
            [
                13566,
                13598
            ],
            [
                13615,
                13638
            ],
            [
                13646,
                13651
            ],
            [
                13651,
                13730
            ],
            [
                13730,
                13783
            ],
            [
                13783,
                13803
            ],
            [
                13803,
                13813
            ],
            [
                13819,
                13826
            ],
            [
                13912,
                13913
            ],
            [
                13950,
                13978
            ],
            [
                13978,
                14013
            ],
            [
                14094,
                14114
            ],
            [
                14114,
                14152
            ],
            [
                14190,
                14191
            ],
            [
                14205,
                14247
            ],
            [
                14247,
                14265
            ],
            [
                14323,
                14324
            ],
            [
                14277,
                14323
            ],
            [
                14499,
                14561
            ],
            [
                14562,
                14581
            ],
            [
                14581,
                14683
            ],
            [
                14712,
                14781
            ],
            [
                14781,
                14791
            ],
            [
                14802,
                14870
            ],
            [
                14871,
                14873
            ],
            [
                14920,
                14925
            ],
            [
                14934,
                15001
            ],
            [
                15075,
                15077
            ],
            [
                15077,
                15097
            ],
            [
                15106,
                15135
            ],
            [
                15174,
                15216
            ],
            [
                15169,
                15173
            ],
            [
                15261,
                15375
            ],
            [
                15400,
                15458
            ],
            [
                15458,
                15486
            ],
            [
                15531,
                15561
            ],
            [
                15561,
                15580
            ],
            [
                15581,
                15585
            ],
            [
                15615,
                15620
            ],
            [
                15792,
                15794
            ],
            [
                15794,
                15838
            ],
            [
                15846,
                15854
            ],
            [
                15854,
                15894
            ],
            [
                15948,
                15992
            ],
            [
                15992,
                16018
            ],
            [
                16052,
                16088
            ],
            [
                16093,
                16110
            ],
            [
                16404,
                16426
            ],
            [
                16433,
                16476
            ],
            [
                16479,
                16488
            ],
            [
                16495,
                16498
            ],
            [
                16692,
                16763
            ],
            [
                16770,
                16773
            ],
            [
                16830,
                16836
            ],
            [
                16825,
                16826
            ],
            [
                16838,
                16845
            ],
            [
                16853,
                16861
            ],
            [
                16879,
                16906
            ],
            [
                16959,
                17009
            ],
            [
                17009,
                17034
            ],
            [
                17076,
                17078
            ],
            [
                17314,
                17353
            ],
            [
                17353,
                17398
            ],
            [
                17498,
                17587
            ],
            [
                17672,
                17708
            ],
            [
                17597,
                17616
            ],
            [
                17643,
                17670
            ],
            [
                17708,
                17710
            ],
            [
                17710,
                17747
            ],
            [
                17747,
                17826
            ],
            [
                17826,
                17886
            ],
            [
                17935,
                17965
            ],
            [
                17968,
                18011
            ],
            [
                18151,
                18152
            ],
            [
                18156,
                18167
            ],
            [
                18173,
                18187
            ],
            [
                18194,
                18209
            ],
            [
                18252,
                18298
            ],
            [
                18710,
                18760
            ],
            [
                18761,
                18816
            ],
            [
                18816,
                18846
            ],
            [
                18853,
                18871
            ],
            [
                18873,
                18877
            ],
            [
                18891,
                18898
            ],
            [
                18898,
                18956
            ],
            [
                18956,
                19065
            ],
            [
                19065,
                19098
            ],
            [
                19197,
                19199
            ],
            [
                19215,
                19222
            ],
            [
                19228,
                19240
            ],
            [
                19243,
                19245
            ],
            [
                19245,
                19304
            ],
            [
                19304,
                19367
            ],
            [
                19892,
                19901
            ],
            [
                19943,
                19952
            ],
            [
                19921,
                19925
            ],
            [
                19957,
                19971
            ],
            [
                19973,
                20005
            ],
            [
                20005,
                20027
            ],
            [
                20027,
                20059
            ],
            [
                20230,
                20232
            ],
            [
                20272,
                20315
            ],
            [
                20355,
                20401
            ],
            [
                20422,
                20440
            ],
            [
                20441,
                20458
            ],
            [
                20458,
                20471
            ],
            [
                20482,
                20553
            ],
            [
                20696,
                20737
            ],
            [
                20792,
                20803
            ],
            [
                20823,
                20833
            ],
            [
                20855,
                20856
            ],
            [
                20857,
                20870
            ],
            [
                20879,
                20902
            ],
            [
                20902,
                20917
            ],
            [
                20951,
                20953
            ],
            [
                20953,
                20974
            ],
            [
                20978,
                21020
            ],
            [
                21020,
                21050
            ],
            [
                21161,
                21162
            ],
            [
                21056,
                21104
            ],
            [
                21109,
                21121
            ],
            [
                21167,
                21213
            ],
            [
                21213,
                21219
            ],
            [
                21225,
                21230
            ],
            [
                21238,
                21242
            ],
            [
                21282,
                21285
            ],
            [
                21301,
                21313
            ],
            [
                21323,
                21338
            ],
            [
                21338,
                21422
            ],
            [
                21462,
                21474
            ]
        ],
        "row_chars": [
            [
                0,
                324
            ],
            [
                324,
                422
            ],
            [
                422,
                548
            ],
            [
                548,
                637
            ],
            [
                637,
                883
            ],
            [
                883,
                1446
            ],
            [
                1446,
                1719
            ],
            [
                1719,
                1888
            ],
            [
                1888,
                1950
            ],
            [
                1950,
                2047
            ],
            [
                2047,
                2094
            ],
            [
                2094,
                2140
            ],
            [
                2140,
                2232
            ],
            [
                2232,
                2426
            ],
            [
                2426,
                2645
            ],
            [
                2645,
                2781
            ],
            [
                2781,
                3136
            ],
            [
                3136,
                3369
            ],
            [
                3369,
                3619
            ],
            [
                3619,
                3929
            ],
            [
                3929,
                4151
            ],
            [
                4151,
                4346
            ],
            [
                4346,
                4847
            ],
            [
                4847,
                5063
            ],
            [
                5063,
                5285
            ],
            [
                5285,
                5680
            ],
            [
                5680,
                5862
            ],
            [
                5862,
                5925
            ],
            [
                5925,
                6040
            ],
            [
                6040,
                6184
            ],
            [
                6184,
                6216
            ],
            [
                6216,
                6322
            ],
            [
                6322,
                6377
            ],
            [
                6377,
                6758
            ],
            [
                6758,
                6921
            ],
            [
                6921,
                6983
            ],
            [
                6983,
                7060
            ],
            [
                7060,
                7229
            ],
            [
                7229,
                7366
            ],
            [
                7366,
                7441
            ],
            [
                7441,
                7519
            ],
            [
                7519,
                7714
            ],
            [
                7714,
                7749
            ],
            [
                7749,
                7804
            ],
            [
                7804,
                7847
            ],
            [
                7847,
                8194
            ],
            [
                8194,
                8389
            ],
            [
                8389,
                8536
            ],
            [
                8536,
                8937
            ],
            [
                8937,
                9138
            ],
            [
                9138,
                9753
            ],
            [
                9753,
                9975
            ],
            [
                9975,
                10142
            ],
            [
                10142,
                10589
            ],
            [
                10589,
                11151
            ],
            [
                11151,
                11346
            ],
            [
                11346,
                11481
            ],
            [
                11481,
                11644
            ],
            [
                11644,
                11796
            ],
            [
                11796,
                11973
            ],
            [
                11973,
                12441
            ],
            [
                12441,
                12597
            ],
            [
                12597,
                12785
            ],
            [
                12785,
                12888
            ],
            [
                12888,
                12902
            ],
            [
                12902,
                13001
            ],
            [
                13001,
                13027
            ],
            [
                13027,
                13061
            ],
            [
                13061,
                13120
            ],
            [
                13120,
                13190
            ],
            [
                13190,
                13346
            ],
            [
                13346,
                13392
            ],
            [
                13392,
                13423
            ],
            [
                13423,
                13478
            ],
            [
                13478,
                13524
            ],
            [
                13524,
                13566
            ],
            [
                13566,
                13651
            ],
            [
                13651,
                13730
            ],
            [
                13730,
                13783
            ],
            [
                13783,
                13803
            ],
            [
                13803,
                13914
            ],
            [
                13914,
                13950
            ],
            [
                13950,
                13978
            ],
            [
                13978,
                14051
            ],
            [
                14051,
                14094
            ],
            [
                14094,
                14114
            ],
            [
                14114,
                14153
            ],
            [
                14153,
                14190
            ],
            [
                14190,
                14247
            ],
            [
                14247,
                14364
            ],
            [
                14364,
                14439
            ],
            [
                14439,
                14499
            ],
            [
                14499,
                14562
            ],
            [
                14562,
                14581
            ],
            [
                14581,
                14781
            ],
            [
                14781,
                15077
            ],
            [
                15077,
                15261
            ],
            [
                15261,
                15375
            ],
            [
                15375,
                15400
            ],
            [
                15400,
                15458
            ],
            [
                15458,
                15561
            ],
            [
                15561,
                15794
            ],
            [
                15794,
                15854
            ],
            [
                15854,
                15894
            ],
            [
                15894,
                15948
            ],
            [
                15948,
                15992
            ],
            [
                15992,
                16110
            ],
            [
                16110,
                16150
            ],
            [
                16150,
                16335
            ],
            [
                16335,
                16404
            ],
            [
                16404,
                16498
            ],
            [
                16498,
                16674
            ],
            [
                16674,
                16838
            ],
            [
                16838,
                16909
            ],
            [
                16909,
                16958
            ],
            [
                16958,
                17009
            ],
            [
                17009,
                17078
            ],
            [
                17078,
                17118
            ],
            [
                17118,
                17305
            ],
            [
                17305,
                17353
            ],
            [
                17353,
                17398
            ],
            [
                17398,
                17498
            ],
            [
                17498,
                17587
            ],
            [
                17587,
                17710
            ],
            [
                17710,
                17747
            ],
            [
                17747,
                17826
            ],
            [
                17826,
                18011
            ],
            [
                18011,
                18147
            ],
            [
                18147,
                18209
            ],
            [
                18209,
                18248
            ],
            [
                18248,
                18298
            ],
            [
                18298,
                18406
            ],
            [
                18406,
                18635
            ],
            [
                18635,
                18761
            ],
            [
                18761,
                18816
            ],
            [
                18816,
                18898
            ],
            [
                18898,
                18956
            ],
            [
                18956,
                19065
            ],
            [
                19065,
                19199
            ],
            [
                19199,
                19245
            ],
            [
                19245,
                19304
            ],
            [
                19304,
                19367
            ],
            [
                19367,
                19519
            ],
            [
                19519,
                19892
            ],
            [
                19892,
                20005
            ],
            [
                20005,
                20230
            ],
            [
                20230,
                20458
            ],
            [
                20458,
                20553
            ],
            [
                20553,
                20696
            ],
            [
                20696,
                20857
            ],
            [
                20857,
                20902
            ],
            [
                20902,
                20953
            ],
            [
                20953,
                21020
            ],
            [
                21020,
                21213
            ],
            [
                21213,
                21338
            ],
            [
                21338,
                21474
            ]
        ]
    },
    "abridged": {
        "text": "When Grandcourt learnt that Gwendolen had left Leubronn, he pronounced that resort a beastly hole: which Mr. Lush understood to mean that his patron intended straightway to return to Diplow. Still, Grandcourt loitered through the next day without giving any orders about leaving; he lingered on the terrace, in the gambling-rooms, in the reading-room, occupying himself in being indifferent to everybody and everything around him.\nWhen he met Lady Mallinger, however, he took the trouble to raise his hat and make conversation. Lady Mallinger had a secret objection to Grandcourt, who she felt was a large living sign of her failure as a wife in not having presented Sir Hugo with a son.\nDeronda, too, had a greeting from Grandcourt, for which he was not grateful, though he took care to return it with perfect civility. Thinking that but for his father's fault, Grandcourt's prospects might have been his, he was proudly resolute not to behave in any way that might be interpreted as irritation on that score. He was determined not to descend into rancour, but to cling to kindlier affections.\nNonetheless Grandcourt did believe that Deronda, poor devil, who he had no doubt was his cousin, inwardly winced under their mutual position; which made Deronda's presence agreeable to him. His pet dogs were not the only beings that Grandcourt liked to feel his power over by making them jealous. Hence he exchanged civil words with Deronda on the terrace about the hunting round Diplow, and even said, \"You had better come over when the season begins.\"\nLush amused himself in gossiping with Sir Hugo and in answering his questions about Grandcourt's affairs, enjoying speaking freely of a tyrannous patron behind his back. Sir Hugo willingly inclined his ear to a little good-humoured scandal, but kept any gossip to himself. Whatever knowledge he had of his nephew's secrets, he had never told Deronda.\n\"Well, let me know the turn of events,\" said Sir Hugo to Lush, \"if this marriage seems likely to come off after all, or if anything else happens to make him want money. My plan for him to rent Diplow to me would be better than burdening Ryelands.\"\n\"That's true,\" said Lush, \"only it must not be urged on him - just placed in his way that the scent may tickle him. Grandcourt is not a man to be led by what makes for his own benefit; especially if you let him see that it benefits you too. I've kept by him for a good fifteen years now. He would not easily get anyone else to fill my place. He's a peculiar character, is Henleigh Grandcourt; however, I'm attached to him; and it would be a good deal worse for him without me.\"\nGrandcourt's procrastination ended the next morning with his question-\n\"Are you making the arrangements for our starting by the Paris train?\"\n\"I didn't know you meant to start,\" said Lush.\n\"You might have known,\" said Grandcourt, looking at his cigar, and speaking in that lowered tone which he used to express disgust. \"Just see to everything, will you? and mind no brute gets into the same carriage with us.\"\nIn consequence they were at Paris the next day; but here Lush was gratified by the command that he should go straight on to Diplow and see that everything was right, while Grandcourt remained behind for several days.\nLush used the interim actively, not only in carrying out Grandcourt's orders about the household, but in learning all he could of Gwendolen, and how things were going on at Offendene. He felt that the effect of the news of the family misfortunes on Grandcourt was quite incalculable. The girl's poverty might make her more likely to accept him, and remove his objection to risking a repulse; on the other hand, the certainty of acceptance was just the sort of thing to make him lapse.\nLush had observed his patron for many years, and knew him well; but he was unpredictable. He might behave with apparent magnanimity, in determining to marry the penniless girl; but Lush had some general certainties about Grandcourt, and one was that generosity was most unlikely to occur in him. Of what use, however, is a general certainty, when what you need to know is the particular path that a man will take? Lush would have been happy for Grandcourt to marry an heiress, or Mrs. Glasher: one match would have brought immediate abundance, and the other the wife's gratitude, for Lush had always been Mrs. Glasher's friend. He felt himself justified in doing his utmost to hinder a marriage with a girl who was likely to bring nothing but trouble to her husband, and annoyance to her husband's old companion, whose future Mr. Lush earnestly wished to make as easy as possible.\nOn his first day at Diplow, Grandcourt was occupied with the stables, and ordered a groom to put a side-saddle on Criterion. This made Lush consider whether he should incur the ticklish consequences of speaking; and the next morning he had almost resolved to let drop the interesting facts about Gwendolen and her family, if Grandcourt was in a good mood, just to see how they would work.\nBut Grandcourt did not enter into talk: no fish could have maintained a more unwinking silence. After reading his letters he gave various orders to be executed by Lush, who accordingly rose to leave the room. Before he was out of the door Grandcourt turned his head slightly and gave a languid \"Oh.\"\n\"What is it?\" said Lush, who did not take his dusty puddings with a respectful air.\n\"Shut the door, will you? I can't speak into the corridor.\"\nLush closed the door.\nAfter a little pause Grandcourt said, \"Is Miss Harleth at Offendene?\" He was quite certain that Lush would have inquired about her.\n\"I hardly know,\" said Lush, carelessly. \"The family's utterly done up. They've lost all their money. The poor mother hasn't a penny, it seems. She and the girls have to huddle in a little cottage like a labourer's.\"\n\"Don't lie to me, if you please,\" said Grandcourt, in his lowest audible tone. \"It's not amusing, and it answers no other purpose.\"\n\"What do you mean?\" said Lush, nettled. \"It's no invention of mine. I have heard the story from several.\"\n\"I don't mean that. Is Miss Harleth there, or is she not?\"\n\"I can't tell,\" said Lush, rather sulkily. \"She may have left; I heard she had taken a situation as governess.\"\n\"Send Hutchins to inquire whether she will be there tomorrow.\"\nLush did not move. Like many persons who have thought over beforehand what they shall say in given cases, he was impelled to say some of those prearranged things before the cases were given. Grandcourt was likely to get into a scrape so tremendous that it was impossible not to remonstrate; but Lush retained enough caution to use a tone of rational friendliness.\n\"It would be as well to remember, Grandcourt, that there can be none of the ordinary flirting now. You must make up your mind whether you wish to be accepted; and more than that, how you would like being refused. You can't be philandering after her again for six weeks.\"\nGrandcourt said nothing, but began to light another cigar. Lush took this as a good sign, and continued.\n\"Everything has a more serious look now than before. There is her family to be provided for. It will be a confoundedly hampering affair. Marriage will pin you down; and in point of money you have not much elbow-room. If there were anything to be gained by the marriage, that would be different.\"\nGrandcourt took his cigar out of his mouth, and looking steadily at the end, said-\n\"I knew that you objected to my marrying Miss Harleth. But I never considered that a reason against it.\"\n\"I never supposed you did. But you couldn't make up your mind before. It's impossible you can care much about her. However, what I wished to point out to you was, that there can be no shilly-shally now.\"\n\"I don't intend that there should be,\" said Grandcourt, fixing him with narrow eyes. \"I dare say it's disagreeable to you. But if you suppose I care a damn for that you are most stupendously mistaken.\"\n\"Oh, well,\" said Lush, rising with his hands in his pockets, \"if you have made up your mind! only there's another aspect of the affair. I'm not so sure the young lady can be counted on. She had her reasons for running away before.\" Lush's temper at this moment urged him to risk a quarrel. \"She had her reasons,\" he repeated more significantly.\n\"I had come to that conclusion,\" said Grandcourt with irony.\n\"Yes, but I hardly think you know what her reasons were.\"\n\"You do, apparently,\" said Grandcourt, not betraying by so much as an eyelash that he cared for the reasons.\n\"Yes, and you had better know too. I would lay odds against her accepting you. She saw Lydia in Cardell Chase and heard the whole story.\"\nGrandcourt made no immediate answer, and only went on smoking. At length he looked at Lush again and said contemptuously, \"What follows?\"\nHere certainly was a \"checkmate\" in answer to Lush's \"check.\" He shrugged slightly and was going to walk away, when Grandcourt said, as quietly as if nothing had occurred, \"Push that pen and paper over here, will you?\"\nNo thunderous superior could have exercised the imperious spell that Grandcourt did. The pen and paper were pushed to him, and he scrawled a brief note.\n\"Let Hutchins take it at once, will you?\" said Grandcourt.\nAs Lush had expected, the letter was addressed to Miss Harleth, Offendene. When his irritation had cooled, he was glad there had been no explosive quarrel; though he felt sure that somehow or other he was intended to pay. It was clear that he had only hardened Grandcourt's determination. But as to the particular movements that made this process in his baffling mind, Lush despaired of a theory.",
        "paragraph_chars": [
            [
                0,
                431
            ],
            [
                431,
                688
            ],
            [
                688,
                1095
            ],
            [
                1095,
                1549
            ],
            [
                1549,
                1900
            ],
            [
                1900,
                2148
            ],
            [
                2148,
                2626
            ],
            [
                2626,
                2697
            ],
            [
                2697,
                2768
            ],
            [
                2768,
                2815
            ],
            [
                2815,
                3037
            ],
            [
                3037,
                3254
            ],
            [
                3254,
                3739
            ],
            [
                3739,
                4620
            ],
            [
                4620,
                5009
            ],
            [
                5009,
                5309
            ],
            [
                5309,
                5393
            ],
            [
                5393,
                5453
            ],
            [
                5453,
                5475
            ],
            [
                5475,
                5607
            ],
            [
                5607,
                5823
            ],
            [
                5823,
                5955
            ],
            [
                5955,
                6061
            ],
            [
                6061,
                6120
            ],
            [
                6120,
                6232
            ],
            [
                6232,
                6295
            ],
            [
                6295,
                6659
            ],
            [
                6659,
                6930
            ],
            [
                6930,
                7035
            ],
            [
                7035,
                7331
            ],
            [
                7331,
                7414
            ],
            [
                7414,
                7519
            ],
            [
                7519,
                7723
            ],
            [
                7723,
                7925
            ],
            [
                7925,
                8270
            ],
            [
                8270,
                8331
            ],
            [
                8331,
                8389
            ],
            [
                8389,
                8498
            ],
            [
                8498,
                8636
            ],
            [
                8636,
                8774
            ],
            [
                8774,
                8993
            ],
            [
                8993,
                9146
            ],
            [
                9146,
                9205
            ],
            [
                9205,
                9601
            ]
        ],
        "segment_chars": [
            [
                0,
                191
            ],
            [
                191,
                431
            ],
            [
                431,
                528
            ],
            [
                528,
                688
            ],
            [
                688,
                821
            ],
            [
                821,
                1011
            ],
            [
                1011,
                1095
            ],
            [
                1095,
                1285
            ],
            [
                1285,
                1392
            ],
            [
                1392,
                1549
            ],
            [
                1549,
                1719
            ],
            [
                1719,
                1822
            ],
            [
                1822,
                1900
            ],
            [
                1900,
                2069
            ],
            [
                2069,
                2148
            ],
            [
                2148,
                2264
            ],
            [
                2264,
                2389
            ],
            [
                2389,
                2436
            ],
            [
                2436,
                2490
            ],
            [
                2490,
                2626
            ],
            [
                2626,
                2697
            ],
            [
                2697,
                2768
            ],
            [
                2768,
                2815
            ],
            [
                2815,
                2946
            ],
            [
                2946,
                2981
            ],
            [
                2981,
                3037
            ],
            [
                3037,
                3254
            ],
            [
                3254,
                3438
            ],
            [
                3438,
                3538
            ],
            [
                3538,
                3739
            ],
            [
                3739,
                3829
            ],
            [
                3829,
                4035
            ],
            [
                4035,
                4153
            ],
            [
                4153,
                4367
            ],
            [
                4367,
                4620
            ],
            [
                4620,
                4745
            ],
            [
                4745,
                5009
            ],
            [
                5009,
                5105
            ],
            [
                5105,
                5218
            ],
            [
                5218,
                5309
            ],
            [
                5309,
                5323
            ],
            [
                5323,
                5393
            ],
            [
                5393,
                5419
            ],
            [
                5419,
                5453
            ],
            [
                5453,
                5475
            ],
            [
                5475,
                5545
            ],
            [
                5545,
                5607
            ],
            [
                5607,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5708
            ],
            [
                5708,
                5750
            ],
            [
                5750,
                5823
            ],
            [
                5823,
                5902
            ],
            [
                5902,
                5955
            ],
            [
                5955,
                5975
            ],
            [
                5975,
                5995
            ],
            [
                5995,
                6023
            ],
            [
                6023,
                6061
            ],
            [
                6061,
                6081
            ],
            [
                6081,
                6120
            ],
            [
                6120,
                6163
            ],
            [
                6163,
                6232
            ],
            [
                6232,
                6295
            ],
            [
                6295,
                6314
            ],
            [
                6314,
                6486
            ],
            [
                6486,
                6659
            ],
            [
                6659,
                6758
            ],
            [
                6758,
                6872
            ],
            [
                6872,
                6930
            ],
            [
                6930,
                6989
            ],
            [
                6989,
                7035
            ],
            [
                7035,
                7088
            ],
            [
                7088,
                7128
            ],
            [
                7128,
                7172
            ],
            [
                7172,
                7252
            ],
            [
                7252,
                7331
            ],
            [
                7331,
                7414
            ],
            [
                7414,
                7469
            ],
            [
                7469,
                7519
            ],
            [
                7519,
                7546
            ],
            [
                7546,
                7589
            ],
            [
                7589,
                7634
            ],
            [
                7634,
                7723
            ],
            [
                7723,
                7808
            ],
            [
                7808,
                7846
            ],
            [
                7846,
                7925
            ],
            [
                7925,
                8018
            ],
            [
                8018,
                8061
            ],
            [
                8061,
                8111
            ],
            [
                8111,
                8157
            ],
            [
                8157,
                8215
            ],
            [
                8215,
                8270
            ],
            [
                8270,
                8331
            ],
            [
                8331,
                8389
            ],
            [
                8389,
                8498
            ],
            [
                8498,
                8533
            ],
            [
                8533,
                8577
            ],
            [
                8577,
                8636
            ],
            [
                8636,
                8699
            ],
            [
                8699,
                8774
            ],
            [
                8774,
                8836
            ],
            [
                8836,
                8993
            ],
            [
                8993,
                9078
            ],
            [
                9078,
                9146
            ],
            [
                9146,
                9188
            ],
            [
                9188,
                9205
            ],
            [
                9205,
                9280
            ],
            [
                9280,
                9427
            ],
            [
                9427,
                9494
            ],
            [
                9494,
                9601
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                23,
                56
            ],
            [
                60,
                82
            ],
            [
                83,
                97
            ],
            [
                105,
                113
            ],
            [
                125,
                127
            ],
            [
                133,
                191
            ],
            [
                196,
                208
            ],
            [
                209,
                211
            ],
            [
                218,
                257
            ],
            [
                258,
                270
            ],
            [
                278,
                430
            ],
            [
                431,
                475
            ],
            [
                476,
                479
            ],
            [
                480,
                487
            ],
            [
                488,
                490
            ],
            [
                497,
                504
            ],
            [
                505,
                508
            ],
            [
                543,
                568
            ],
            [
                569,
                584
            ],
            [
                585,
                593
            ],
            [
                594,
                597
            ],
            [
                598,
                620
            ],
            [
                621,
                642
            ],
            [
                646,
                687
            ],
            [
                688,
                707
            ],
            [
                717,
                821
            ],
            [
                830,
                842
            ],
            [
                843,
                853
            ],
            [
                863,
                981
            ],
            [
                982,
                984
            ],
            [
                985,
                1011
            ],
            [
                1011,
                1013
            ],
            [
                1018,
                1035
            ],
            [
                1044,
                1048
            ],
            [
                1049,
                1053
            ],
            [
                1056,
                1057
            ],
            [
                1062,
                1064
            ],
            [
                1074,
                1093
            ],
            [
                1093,
                1094
            ],
            [
                1107,
                1190
            ],
            [
                1190,
                1236
            ],
            [
                1255,
                1257
            ],
            [
                1258,
                1266
            ],
            [
                1267,
                1283
            ],
            [
                1283,
                1285
            ],
            [
                1285,
                1367
            ],
            [
                1371,
                1392
            ],
            [
                1392,
                1400
            ],
            [
                1411,
                1416
            ],
            [
                1417,
                1523
            ],
            [
                1524,
                1549
            ],
            [
                1549,
                1553
            ],
            [
                1554,
                1568
            ],
            [
                1569,
                1653
            ],
            [
                1653,
                1654
            ],
            [
                1673,
                1719
            ],
            [
                1719,
                1775
            ],
            [
                1781,
                1789
            ],
            [
                1790,
                1793
            ],
            [
                1820,
                1822
            ],
            [
                1822,
                1885
            ],
            [
                1891,
                1898
            ],
            [
                1898,
                1899
            ],
            [
                1900,
                1906
            ],
            [
                1907,
                1953
            ],
            [
                1961,
                2052
            ],
            [
                2057,
                2061
            ],
            [
                2062,
                2067
            ],
            [
                2067,
                2069
            ],
            [
                2069,
                2076
            ],
            [
                2077,
                2084
            ],
            [
                2106,
                2114
            ],
            [
                2115,
                2121
            ],
            [
                2122,
                2148
            ],
            [
                2148,
                2207
            ],
            [
                2210,
                2264
            ],
            [
                2264,
                2293
            ],
            [
                2294,
                2323
            ],
            [
                2331,
                2370
            ],
            [
                2384,
                2389
            ],
            [
                2389,
                2393
            ],
            [
                2399,
                2405
            ],
            [
                2406,
                2409
            ],
            [
                2410,
                2436
            ],
            [
                2436,
                2459
            ],
            [
                2467,
                2490
            ],
            [
                2490,
                2539
            ],
            [
                2539,
                2540
            ],
            [
                2541,
                2549
            ],
            [
                2550,
                2612
            ],
            [
                2621,
                2623
            ],
            [
                2623,
                2626
            ],
            [
                2626,
                2638
            ],
            [
                2639,
                2654
            ],
            [
                2661,
                2677
            ],
            [
                2678,
                2682
            ],
            [
                2687,
                2695
            ],
            [
                2697,
                2712
            ],
            [
                2713,
                2768
            ],
            [
                2768,
                2813
            ],
            [
                2813,
                2815
            ],
            [
                2815,
                2866
            ],
            [
                2867,
                2917
            ],
            [
                2918,
                2920
            ],
            [
                2926,
                2944
            ],
            [
                2944,
                2946
            ],
            [
                2946,
                2981
            ],
            [
                2981,
                3034
            ],
            [
                3037,
                3119
            ],
            [
                3120,
                3219
            ],
            [
                3220,
                3235
            ],
            [
                3240,
                3252
            ],
            [
                3252,
                3254
            ],
            [
                3259,
                3340
            ],
            [
                3341,
                3438
            ],
            [
                3438,
                3445
            ],
            [
                3446,
                3450
            ],
            [
                3451,
                3454
            ],
            [
                3455,
                3461
            ],
            [
                3465,
                3499
            ],
            [
                3500,
                3513
            ],
            [
                3514,
                3517
            ],
            [
                3518,
                3538
            ],
            [
                3538,
                3562
            ],
            [
                3572,
                3576
            ],
            [
                3584,
                3586
            ],
            [
                3587,
                3593
            ],
            [
                3594,
                3597
            ],
            [
                3597,
                3598
            ],
            [
                3599,
                3602
            ],
            [
                3603,
                3609
            ],
            [
                3614,
                3626
            ],
            [
                3635,
                3644
            ],
            [
                3644,
                3701
            ],
            [
                3702,
                3719
            ],
            [
                3720,
                3737
            ],
            [
                3737,
                3738
            ],
            [
                3739,
                3747
            ],
            [
                3757,
                3767
            ],
            [
                3768,
                3796
            ],
            [
                3801,
                3806
            ],
            [
                3807,
                3809
            ],
            [
                3810,
                3813
            ],
            [
                3827,
                3829
            ],
            [
                3829,
                3831
            ],
            [
                3832,
                3837
            ],
            [
                3838,
                3849
            ],
            [
                3850,
                3871
            ],
            [
                3875,
                3899
            ],
            [
                3910,
                3914
            ],
            [
                3916,
                3988
            ],
            [
                3989,
                3999
            ],
            [
                4018,
                4035
            ],
            [
                4035,
                4079
            ],
            [
                4079,
                4114
            ],
            [
                4131,
                4135
            ],
            [
                4136,
                4137
            ],
            [
                4142,
                4146
            ],
            [
                4151,
                4153
            ],
            [
                4158,
                4173
            ],
            [
                4184,
                4194
            ],
            [
                4198,
                4218
            ],
            [
                4219,
                4232
            ],
            [
                4233,
                4242
            ],
            [
                4243,
                4253
            ],
            [
                4262,
                4281
            ],
            [
                4281,
                4282
            ],
            [
                4283,
                4286
            ],
            [
                4287,
                4296
            ],
            [
                4297,
                4365
            ],
            [
                4365,
                4367
            ],
            [
                4367,
                4504
            ],
            [
                4504,
                4509
            ],
            [
                4510,
                4519
            ],
            [
                4520,
                4618
            ],
            [
                4618,
                4619
            ],
            [
                4627,
                4636
            ],
            [
                4648,
                4662
            ],
            [
                4663,
                4693
            ],
            [
                4694,
                4743
            ],
            [
                4743,
                4745
            ],
            [
                4745,
                4749
            ],
            [
                4755,
                4759
            ],
            [
                4769,
                4830
            ],
            [
                4830,
                4835
            ],
            [
                4836,
                4852
            ],
            [
                4853,
                4855
            ],
            [
                4856,
                4859
            ],
            [
                4860,
                4875
            ],
            [
                4876,
                4878
            ],
            [
                4879,
                4941
            ],
            [
                4942,
                4955
            ],
            [
                4956,
                4959
            ],
            [
                4960,
                4962
            ],
            [
                4963,
                4964
            ],
            [
                4965,
                4969
            ],
            [
                4974,
                4975
            ],
            [
                4976,
                5007
            ],
            [
                5007,
                5008
            ],
            [
                5009,
                5047
            ],
            [
                5049,
                5105
            ],
            [
                5105,
                5110
            ],
            [
                5119,
                5168
            ],
            [
                5169,
                5176
            ],
            [
                5176,
                5218
            ],
            [
                5218,
                5294
            ],
            [
                5295,
                5309
            ],
            [
                5309,
                5323
            ],
            [
                5323,
                5337
            ],
            [
                5338,
                5393
            ],
            [
                5393,
                5419
            ],
            [
                5419,
                5453
            ],
            [
                5453,
                5473
            ],
            [
                5473,
                5475
            ],
            [
                5475,
                5545
            ],
            [
                5545,
                5575
            ],
            [
                5596,
                5605
            ],
            [
                5605,
                5607
            ],
            [
                5607,
                5608
            ],
            [
                5608,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5682
            ],
            [
                5686,
                5708
            ],
            [
                5708,
                5732
            ],
            [
                5738,
                5750
            ],
            [
                5750,
                5782
            ],
            [
                5786,
                5809
            ],
            [
                5818,
                5823
            ],
            [
                5823,
                5902
            ],
            [
                5902,
                5955
            ],
            [
                5955,
                5975
            ],
            [
                5975,
                5985
            ],
            [
                5986,
                5993
            ],
            [
                5993,
                5994
            ],
            [
                5995,
                6023
            ],
            [
                6023,
                6058
            ],
            [
                6061,
                6081
            ],
            [
                6081,
                6119
            ],
            [
                6120,
                6121
            ],
            [
                6121,
                6163
            ],
            [
                6163,
                6181
            ],
            [
                6181,
                6182
            ],
            [
                6183,
                6229
            ],
            [
                6232,
                6294
            ],
            [
                6295,
                6314
            ],
            [
                6314,
                6416
            ],
            [
                6417,
                6486
            ],
            [
                6486,
                6496
            ],
            [
                6497,
                6565
            ],
            [
                6570,
                6572
            ],
            [
                6573,
                6578
            ],
            [
                6590,
                6657
            ],
            [
                6657,
                6659
            ],
            [
                6659,
                6679
            ],
            [
                6680,
                6709
            ],
            [
                6710,
                6752
            ],
            [
                6753,
                6757
            ],
            [
                6758,
                6872
            ],
            [
                6872,
                6930
            ],
            [
                6930,
                6958
            ],
            [
                6959,
                6989
            ],
            [
                6989,
                7008
            ],
            [
                7014,
                7018
            ],
            [
                7018,
                7023
            ],
            [
                7033,
                7035
            ],
            [
                7035,
                7079
            ],
            [
                7080,
                7088
            ],
            [
                7088,
                7128
            ],
            [
                7128,
                7172
            ],
            [
                7172,
                7198
            ],
            [
                7198,
                7234
            ],
            [
                7235,
                7252
            ],
            [
                7252,
                7274
            ],
            [
                7275,
                7318
            ],
            [
                7319,
                7328
            ],
            [
                7328,
                7331
            ],
            [
                7331,
                7402
            ],
            [
                7403,
                7406
            ],
            [
                7406,
                7412
            ],
            [
                7412,
                7413
            ],
            [
                7414,
                7421
            ],
            [
                7422,
                7430
            ],
            [
                7440,
                7467
            ],
            [
                7469,
                7519
            ],
            [
                7519,
                7544
            ],
            [
                7544,
                7546
            ],
            [
                7550,
                7589
            ],
            [
                7589,
                7634
            ],
            [
                7634,
                7723
            ],
            [
                7723,
                7759
            ],
            [
                7759,
                7778
            ],
            [
                7779,
                7806
            ],
            [
                7806,
                7808
            ],
            [
                7809,
                7846
            ],
            [
                7846,
                7925
            ],
            [
                7925,
                7985
            ],
            [
                7986,
                8016
            ],
            [
                8018,
                8061
            ],
            [
                8061,
                8062
            ],
            [
                8065,
                8076
            ],
            [
                8077,
                8091
            ],
            [
                8096,
                8111
            ],
            [
                8111,
                8157
            ],
            [
                8164,
                8214
            ],
            [
                8215,
                8270
            ],
            [
                8270,
                8300
            ],
            [
                8300,
                8318
            ],
            [
                8319,
                8323
            ],
            [
                8324,
                8331
            ],
            [
                8331,
                8389
            ],
            [
                8389,
                8498
            ],
            [
                8498,
                8531
            ],
            [
                8531,
                8533
            ],
            [
                8533,
                8540
            ],
            [
                8545,
                8557
            ],
            [
                8575,
                8577
            ],
            [
                8577,
                8636
            ],
            [
                8636,
                8699
            ],
            [
                8699,
                8708
            ],
            [
                8712,
                8721
            ],
            [
                8722,
                8726
            ],
            [
                8727,
                8741
            ],
            [
                8742,
                8774
            ],
            [
                8774,
                8796
            ],
            [
                8801,
                8833
            ],
            [
                8836,
                8838
            ],
            [
                8857,
                8900
            ],
            [
                8901,
                8947
            ],
            [
                8952,
                8970
            ],
            [
                8976,
                8993
            ],
            [
                8993,
                9006
            ],
            [
                9007,
                9078
            ],
            [
                9078,
                9119
            ],
            [
                9120,
                9131
            ],
            [
                9134,
                9144
            ],
            [
                9144,
                9145
            ],
            [
                9146,
                9159
            ],
            [
                9165,
                9188
            ],
            [
                9188,
                9203
            ],
            [
                9203,
                9205
            ],
            [
                9205,
                9226
            ],
            [
                9238,
                9280
            ],
            [
                9280,
                9310
            ],
            [
                9310,
                9311
            ],
            [
                9312,
                9360
            ],
            [
                9368,
                9380
            ],
            [
                9381,
                9427
            ],
            [
                9427,
                9433
            ],
            [
                9434,
                9439
            ],
            [
                9440,
                9444
            ],
            [
                9448,
                9451
            ],
            [
                9466,
                9478
            ],
            [
                9479,
                9494
            ],
            [
                9494,
                9578
            ],
            [
                9589,
                9601
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                191
            ],
            [
                191,
                431
            ],
            [
                431,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                528
            ],
            [
                528,
                688
            ],
            [
                688,
                688
            ],
            [
                688,
                821
            ],
            [
                821,
                1011
            ],
            [
                1011,
                1095
            ],
            [
                1095,
                1095
            ],
            [
                1095,
                1285
            ],
            [
                1285,
                1392
            ],
            [
                1392,
                1549
            ],
            [
                1549,
                1719
            ],
            [
                1719,
                1822
            ],
            [
                1822,
                1900
            ],
            [
                1900,
                1900
            ],
            [
                1900,
                2069
            ],
            [
                2069,
                2148
            ],
            [
                2148,
                2264
            ],
            [
                2264,
                2389
            ],
            [
                2389,
                2389
            ],
            [
                2389,
                2436
            ],
            [
                2436,
                2490
            ],
            [
                2490,
                2626
            ],
            [
                2626,
                2626
            ],
            [
                2626,
                2626
            ],
            [
                2626,
                2626
            ],
            [
                2626,
                2626
            ],
            [
                2626,
                2697
            ],
            [
                2697,
                2768
            ],
            [
                2768,
                2815
            ],
            [
                2815,
                2946
            ],
            [
                2946,
                2981
            ],
            [
                2981,
                3037
            ],
            [
                3037,
                3037
            ],
            [
                3037,
                3254
            ],
            [
                3254,
                3438
            ],
            [
                3438,
                3538
            ],
            [
                3538,
                3739
            ],
            [
                3739,
                3829
            ],
            [
                3829,
                4035
            ],
            [
                4035,
                4153
            ],
            [
                4153,
                4153
            ],
            [
                4153,
                4367
            ],
            [
                4367,
                4620
            ],
            [
                4620,
                4620
            ],
            [
                4620,
                4620
            ],
            [
                4620,
                4620
            ],
            [
                4620,
                4620
            ],
            [
                4620,
                4745
            ],
            [
                4745,
                5009
            ],
            [
                5009,
                5105
            ],
            [
                5105,
                5218
            ],
            [
                5218,
                5309
            ],
            [
                5309,
                5323
            ],
            [
                5323,
                5393
            ],
            [
                5393,
                5419
            ],
            [
                5419,
                5453
            ],
            [
                5453,
                5475
            ],
            [
                5475,
                5545
            ],
            [
                5545,
                5607
            ],
            [
                5607,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5708
            ],
            [
                5708,
                5708
            ],
            [
                5708,
                5750
            ],
            [
                5750,
                5823
            ],
            [
                5823,
                5902
            ],
            [
                5902,
                5955
            ],
            [
                5955,
                5975
            ],
            [
                5975,
                5995
            ],
            [
                5995,
                5995
            ],
            [
                5995,
                6023
            ],
            [
                6023,
                6061
            ],
            [
                6061,
                6061
            ],
            [
                6061,
                6081
            ],
            [
                6081,
                6120
            ],
            [
                6120,
                6120
            ],
            [
                6120,
                6163
            ],
            [
                6163,
                6232
            ],
            [
                6232,
                6232
            ],
            [
                6232,
                6232
            ],
            [
                6232,
                6295
            ],
            [
                6295,
                6314
            ],
            [
                6314,
                6486
            ],
            [
                6486,
                6659
            ],
            [
                6659,
                6758
            ],
            [
                6758,
                6872
            ],
            [
                6872,
                6872
            ],
            [
                6872,
                6930
            ],
            [
                6930,
                6989
            ],
            [
                6989,
                7035
            ],
            [
                7035,
                7088
            ],
            [
                7088,
                7128
            ],
            [
                7128,
                7128
            ],
            [
                7128,
                7172
            ],
            [
                7172,
                7252
            ],
            [
                7252,
                7252
            ],
            [
                7252,
                7252
            ],
            [
                7252,
                7252
            ],
            [
                7252,
                7331
            ],
            [
                7331,
                7331
            ],
            [
                7331,
                7414
            ],
            [
                7414,
                7469
            ],
            [
                7469,
                7469
            ],
            [
                7469,
                7519
            ],
            [
                7519,
                7546
            ],
            [
                7546,
                7546
            ],
            [
                7546,
                7546
            ],
            [
                7546,
                7589
            ],
            [
                7589,
                7634
            ],
            [
                7634,
                7634
            ],
            [
                7634,
                7723
            ],
            [
                7723,
                7808
            ],
            [
                7808,
                7846
            ],
            [
                7846,
                7925
            ],
            [
                7925,
                8061
            ],
            [
                8061,
                8061
            ],
            [
                8061,
                8111
            ],
            [
                8111,
                8111
            ],
            [
                8111,
                8157
            ],
            [
                8157,
                8157
            ],
            [
                8157,
                8157
            ],
            [
                8157,
                8215
            ],
            [
                8215,
                8270
            ],
            [
                8270,
                8331
            ],
            [
                8331,
                8389
            ],
            [
                8389,
                8498
            ],
            [
                8498,
                8533
            ],
            [
                8533,
                8577
            ],
            [
                8577,
                8636
            ],
            [
                8636,
                8699
            ],
            [
                8699,
                8699
            ],
            [
                8699,
                8699
            ],
            [
                8699,
                8774
            ],
            [
                8774,
                8836
            ],
            [
                8836,
                8993
            ],
            [
                8993,
                9078
            ],
            [
                9078,
                9078
            ],
            [
                9078,
                9146
            ],
            [
                9146,
                9188
            ],
            [
                9188,
                9205
            ],
            [
                9205,
                9280
            ],
            [
                9280,
                9427
            ],
            [
                9427,
                9494
            ],
            [
                9494,
                9601
            ]
        ]
    }
}