{
    "original": {
        "text": "He brings white asses laden with the freight Of Tyrian vessels, purple, gold and balm, To bribe my will: I'll bid them chase him forth, Nor let him breathe the taint of his surmise On my secure resolve. Ay, 'tis secure: And therefore let him come to spread his freight. For firmness hath its appetite and craves The stronger lure, more strongly to resist; Would know the touch of gold to fling it off; Scent wine to feel its lip the soberer; Behold soft byssus, ivory, and plumes To say, \"They're fair, but I will none of them,\" And flout Enticement in the very face.\nMr. Gascoigne one day came to Offendene with what he felt to be the satisfactory news that Mrs. Mompert had fixed Tuesday in the following week for her interview with Gwendolen at Wanchester. He said nothing of his having incidentally heard that Mr. Grandcourt had returned to Diplow; knowing no more than she did that Leubronn had been the goal of her admirer's journeying, and feeling that it would be unkind uselessly to revive the memory of a brilliant prospect under the present reverses. In his secret soul he thought of his niece's unintelligible caprice with regret, but he vindicated her to himself by considering that Grandcourt had been the first to behave oddly, in suddenly walking away when there had the best opportunity for crowning his marked attentions. The rector's practical judgment told him that his chief duty to his niece now was to encourage her resolutely to face the change in her lot, since there was no manifest promise of any event that would avert it.\n\"You will find an interest in varied experience, my dear, and I have no doubt you will be a more valuable woman for having sustained such a part as you are called to.\"\n\"I cannot pretend to believe that I shall like it,\" said Gwendolen, for the first time showing her uncle some petulance. \"But I am quite aware that I am obliged to bear it.\"\nShe remembered having submitted to his admonition on a different occasion when she was expected to like a very different prospect.\n\"And your good sense will teach you to behave suitably under it,\" said Mr. Gascoigne, with a shade more gravity. \"I feel sure that Mrs. Mompert will be pleased with you. You will know how to conduct yourself to a woman who holds in all senses the relation of a superior to you. This trouble has come on you young, but that makes it in some respects easier, and there is a benefit in all chastisement if we adjust our minds to it.\"\nThis was precisely what Gwendolen was unable to do; and after her uncle was gone, the bitter tears, which had rarely come during the late trouble, rose and fell slowly as she sat alone. Her heart denied that the trouble was easier because she was young. When was she to have any happiness, if it did not come while she was young? Not that her visions of possible happiness for herself were as unmixed with necessary evil as they used to be--not that she could still imagine herself plucking the fruits of life without suspicion of their core. But this general disenchantment with the world--nay, with herself, since it appeared that she was not made for easy pre-eminence--only intensified her sense of forlornness; it was a visibly sterile distance enclosing the dreary path at her feet, in which she had no courage to tread. She was in that first crisis of passionate youthful rebellion against what is not fitly called pain, but rather the absence of joy--that first rage of disappointment in life's morning, which we whom the years have subdued are apt to remember but dimly as part of our own experience, and so to be intolerant of its self-enclosed unreasonableness and impiety. What passion seems more absurd, when we have got outside it and looked at calamity as a collective risk, than this amazed anguish that I and not Thou, He or She, should be just the smitten one? Yet perhaps some who have afterward made themselves a willing fence before the breast of another, and have carried their own heart-wound in heroic silence--some who have made their deeds great, nevertheless began with this angry amazement at their own smart, and on the mere denial of their fantastic desires raged as if under the sting of wasps which reduced the universe for them to an unjust infliction of pain. This was nearly poor Gwendolen's condition. What though such a reverse as hers had often happened to other girls? The one point she had been all her life learning to care for was that it had happened to _her_: it was what _she_ felt under Klesmer's demonstration that she was not remarkable enough to command fortune by force of will and merit; it was what _she_ would feel under the rigors of Mrs. Mompert's constant expectation, under the dull demand that she should be cheerful with three Miss Momperts, under the necessity of showing herself entirely submissive, and keeping her thoughts to herself. To be a queen disthroned is not so hard as some other down-stepping: imagine one who had been made to believe in his own divinity finding all homage withdrawn, and himself unable to perform a miracle that would recall the homage and restore his own confidence. Something akin to this illusion and this helplessness had befallen the poor spoiled child, with the lovely lips and eyes and the majestic figure--which seemed now to have no magic in them.\nShe rose from the low ottoman where she had been sitting purposeless, and walked up and down the drawing-room, resting her elbow on one palm while she leaned down her cheek on the other, and a slow tear fell. She thought, \"I have always, ever since I was little, felt that mamma was not a happy woman; and now I dare say I shall be more unhappy than she has been.\"\nHer mind dwelt for a few moments on the picture of herself losing her youth and ceasing to enjoy--not minding whether she did this or that: but such picturing inevitably brought back the image of her mother.\n\"Poor mamma! it will be still worse for her now. I can get a little money for her--that is all I shall care about now.\" And then with an entirely new movement of her imagination, she saw her mother getting quite old and white, and herself no longer young but faded, and their two faces meeting still with memory and love, and she knowing what was in her mother's mind--\"Poor Gwen too is sad and faded now\"--and then, for the first time, she sobbed, not in anger, but with a sort of tender misery.\nHer face was toward the door, and she saw her mother enter. She barely saw that; for her eyes were large with tears, and she pressed her handkerchief against them hurriedly. Before she took it away she felt her mother's arms round her, and this sensation, which seemed a prolongation of her inward vision, overcame her will to be reticent; she sobbed anew in spite of herself, as they pressed their cheeks together.\nMrs. Davilow had brought something in her hand which had already caused her an agitating anxiety, and she dared not speak until her darling had become calmer. But Gwendolen, with whom weeping had always been a painful manifestation to be resisted, if possible, again pressed her handkerchief against her eyes, and, with a deep breath, drew her head backward and looked at her mother, who was pale and tremulous.\n\"It was nothing, mamma,\" said Gwendolen, thinking that her mother had been moved in this way simply by finding her in distress. \"It is all over now.\"\nBut Mrs. Davilow had withdrawn her arms, and Gwendolen perceived a letter in her hand.\n\"What is that letter?--worse news still?\" she asked, with a touch of bitterness.\n\"I don't know what you will think it, dear,\" said Mrs. Davilow, keeping the letter in her hand. \"You will hardly guess where it comes from.\"\n\"Don't ask me to guess anything,\" said Gwendolen, rather impatiently, as if a bruise were being pressed.\n\"It is addressed to you, dear.\"\nGwendolen gave the slightest perceptible toss of the head.\n\"It comes from Diplow,\" said Mrs. Davilow, giving her the letter.\nShe knew Grandcourt's indistinct handwriting, and her mother was not surprised to see her blush deeply; but watching her as she read, and wondering much what was the purport of the letter, she saw the color die out. Gwendolen's lips even were pale as she turned the open note toward her mother. The words were few and formal:\nMr. Grandcourt presents his compliments to Miss Harleth, and begs to know whether he may be permitted to call at Offendene tomorrow after two and to see her alone. Mr. Grandcourt has just returned from Leubronn, where he had hoped to find Miss Harleth.\nMrs. Davilow read, and then looked at her daughter inquiringly, leaving the note in her hand. Gwendolen let it fall to the floor, and turned away.\n\"It must be answered, darling,\" said Mrs. Davilow, timidly. \"The man waits.\"\nGwendolen sank on the settee, clasped her hands, and looked straight before her, not at her mother. She had the expression of one who had been startled by a sound and was listening to know what would come of it. The sudden change of the situation was bewildering. A few minutes before she was looking along an inescapable path of repulsive monotony, with hopeless inward rebellion against the imperious lot which left her no choice: and lo, now, a moment of choice was come. Yet--was it triumph she felt most or terror? Impossible for Gwendolen not to feel some triumph in a tribute to her power at a time when she was first tasting the bitterness of insignificance: again she seemed to be getting a sort of empire over her own life. But how to use it? Here came the terror. Quick, quick, like pictures in a book beaten open with a sense of hurry, came back vividly, yet in fragments, all that she had gone through in relation to Grandcourt--the allurements, the vacillations, the resolve to accede, the final repulsion; the incisive face of that dark-eyed lady with the lovely boy: her own pledge (was it a pledge not to marry him?)--the new disbelief in the worth of men and things for which that scene of disclosure had become a symbol. That unalterable experience made a vision at which in the first agitated moment, before tempering reflections could suggest themselves, her native terror shrank.\nWhere was the good of choice coming again? What did she wish? Anything different? No! And yet in the dark seed-growths of consciousness a new wish was forming itself--\"I wish I had never known it!\" Something, anything she wished for that would have saved her from the dread to let Grandcourt come.\nIt was no long while--yet it seemed long to Mrs. Davilow, before she thought it well to say, gently,\n\"It will be necessary for you to write, dear. Or shall I write an answer for you--which you will dictate?\"\n\"No, mamma,\" said Gwendolen, drawing a deep breath. \"But please lay me out the pen and paper.\"\nThat was gaining time. Was she to decline Grandcourt's visit--close the shutters--not even look out on what would happen?--though with the assurance that she should remain just where she was? The young activity within her made a warm current through her terror and stirred toward something that would be an event--toward an opportunity in which she could look and speak with the former effectiveness. The interest of the morrow was no longer at a deadlock.\n\"There is really no reason on earth why you should be so alarmed at the man's waiting a few minutes, mamma,\" said Gwendolen, remonstrantly, as Mrs. Davilow, having prepared the writing materials, looked toward her expectantly. \"Servants expect nothing else than to wait. It is not to be supposed that I must write on the instant.\"\n\"No, dear,\" said Mrs. Davilow, in the tone of one corrected, turning to sit down and take up a bit of work that lay at hand; \"he can wait another quarter of an hour, if you like.\"\nIt was very simple speech and action on her part, but it was what might have been subtly calculated. Gwendolen felt a contradictory desire to be hastened: hurry would save her from deliberate choice.\n\"I did not mean him to wait long enough for that needlework to be finished,\" she said, lifting her hands to stroke the backward curves of her hair, while she rose from her seat and stood still.\n\"But if you don't feel able to decide?\" said Mrs. Davilow, sympathizingly.\n\"I _must_ decide,\" said Gwendolen, walking to the writing-table and seating herself. All the while there was a busy undercurrent in her, like the thought of a man who keeps up a dialogue while he is considering how he can slip away. Why should she not let him come? It bound her to nothing. He had been to Leubronn after her: of course he meant a direct unmistakable renewal of the suit which before had been only implied. What then? She could reject him. Why was she to deny herself the freedom of doing this--which she would like to do?\n\"If Mr. Grandcourt has only just returned from Leubronn,\" said Mrs. Davilow, observing that Gwendolen leaned back in her chair after taking the pen in her hand--\"I wonder whether he has heard of our misfortunes?\"\n\"That could make no difference to a man in his position,\" said Gwendolen, rather contemptuously,\n\"It would to some men,\" said Mrs. Davilow. \"They would not like to take a wife from a family in a state of beggary almost, as we are. Here we are at Offendene with a great shell over us, as usual. But just imagine his finding us at Sawyer's Cottage. Most men are afraid of being bored or taxed by a wife's family. If Mr. Grandcourt did know, I think it a strong proof of his attachment to you.\"\nMrs. Davilow spoke with unusual emphasis: it was the first time she had ventured to say anything about Grandcourt which would necessarily seem intended as an argument in favor of him, her habitual impression being that such arguments would certainly be useless and might be worse. The effect of her words now was stronger than she could imagine: they raised a new set of possibilities in Gwendolen's mind--a vision of what Grandcourt might do for her mother if she, Gwendolen, did--what she was not going to do. She was so moved by a new rush of ideas that, like one conscious of being urgently called away, she felt that the immediate task must be hastened: the letter must be written, else it might be endlessly deferred. After all, she acted in a hurry, as she had wished to do. To act in a hurry was to have a reason for keeping away from an absolute decision, and to leave open as many issues as possible.\nShe wrote: \"Miss Harleth presents her compliments to Mr. Grandcourt. She will be at home after two o'clock to-morrow.\"\nBefore addressing the note she said, \"Pray ring the bell, mamma, if there is any one to answer it.\" She really did not know who did the work of the house.\nIt was not till after the letter had been taken away and Gwendolen had risen again, stretching out one arm and then resting it on her head, with a low moan which had a sound of relief in it, that Mrs. Davilow ventured to ask,\n\"What did you say, Gwen?\"\n\"I said that I should be at home,\" answered Gwendolen, rather loftily. Then after a pause, \"You must not expect, because Mr. Grandcourt is coming, that anything is going to happen, mamma.\"\n\"I don't allow myself to expect anything, dear. I desire you to follow your own feeling. You have never told me what that was.\"\n\"What is the use of telling?\" said Gwendolen, hearing a reproach in that true statement. \"When I have anything pleasant to tell, you may be sure I will tell you.\"\n\"But Mr. Grandcourt will consider that you have already accepted him, in allowing him to come. His note tells you plainly enough that he is coming to make you an offer.\"\n\"Very well; and I wish to have the pleasure of refusing him.\"\nMrs. Davilow looked up in wonderment, but Gwendolen implied her wish not to be questioned further by saying,\n\"Put down that detestable needle-work, and let us walk in the avenue. I am stifled.\"",
        "paragraph_chars": [
            [
                0,
                568
            ],
            [
                568,
                1551
            ],
            [
                1551,
                1719
            ],
            [
                1719,
                1893
            ],
            [
                1893,
                2024
            ],
            [
                2024,
                2455
            ],
            [
                2455,
                5303
            ],
            [
                5303,
                5668
            ],
            [
                5668,
                5876
            ],
            [
                5876,
                6373
            ],
            [
                6373,
                6789
            ],
            [
                6789,
                7201
            ],
            [
                7201,
                7351
            ],
            [
                7351,
                7438
            ],
            [
                7438,
                7519
            ],
            [
                7519,
                7660
            ],
            [
                7660,
                7765
            ],
            [
                7765,
                7797
            ],
            [
                7797,
                7856
            ],
            [
                7856,
                7922
            ],
            [
                7922,
                8248
            ],
            [
                8248,
                8501
            ],
            [
                8501,
                8648
            ],
            [
                8648,
                8725
            ],
            [
                8725,
                10127
            ],
            [
                10127,
                10425
            ],
            [
                10425,
                10526
            ],
            [
                10526,
                10633
            ],
            [
                10633,
                10728
            ],
            [
                10728,
                11185
            ],
            [
                11185,
                11516
            ],
            [
                11516,
                11696
            ],
            [
                11696,
                11896
            ],
            [
                11896,
                12090
            ],
            [
                12090,
                12165
            ],
            [
                12165,
                12704
            ],
            [
                12704,
                12917
            ],
            [
                12917,
                13014
            ],
            [
                13014,
                13409
            ],
            [
                13409,
                14320
            ],
            [
                14320,
                14439
            ],
            [
                14439,
                14594
            ],
            [
                14594,
                14820
            ],
            [
                14820,
                14846
            ],
            [
                14846,
                15035
            ],
            [
                15035,
                15163
            ],
            [
                15163,
                15326
            ],
            [
                15326,
                15496
            ],
            [
                15496,
                15558
            ],
            [
                15558,
                15667
            ],
            [
                15667,
                15751
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                270
            ],
            [
                270,
                568
            ],
            [
                568,
                760
            ],
            [
                760,
                1062
            ],
            [
                1062,
                1340
            ],
            [
                1340,
                1551
            ],
            [
                1551,
                1719
            ],
            [
                1719,
                1840
            ],
            [
                1840,
                1893
            ],
            [
                1893,
                2024
            ],
            [
                2024,
                2137
            ],
            [
                2137,
                2194
            ],
            [
                2194,
                2302
            ],
            [
                2302,
                2455
            ],
            [
                2455,
                2641
            ],
            [
                2641,
                2709
            ],
            [
                2709,
                2785
            ],
            [
                2785,
                2998
            ],
            [
                2998,
                3282
            ],
            [
                3282,
                3640
            ],
            [
                3640,
                3834
            ],
            [
                3834,
                4249
            ],
            [
                4249,
                4293
            ],
            [
                4293,
                4363
            ],
            [
                4363,
                4853
            ],
            [
                4853,
                5114
            ],
            [
                5114,
                5303
            ],
            [
                5303,
                5512
            ],
            [
                5512,
                5668
            ],
            [
                5668,
                5876
            ],
            [
                5876,
                5889
            ],
            [
                5889,
                5925
            ],
            [
                5925,
                5996
            ],
            [
                5996,
                6373
            ],
            [
                6373,
                6433
            ],
            [
                6433,
                6547
            ],
            [
                6547,
                6789
            ],
            [
                6789,
                6948
            ],
            [
                6948,
                7201
            ],
            [
                7201,
                7329
            ],
            [
                7329,
                7351
            ],
            [
                7351,
                7438
            ],
            [
                7438,
                7480
            ],
            [
                7480,
                7519
            ],
            [
                7519,
                7615
            ],
            [
                7615,
                7660
            ],
            [
                7660,
                7765
            ],
            [
                7765,
                7797
            ],
            [
                7797,
                7856
            ],
            [
                7856,
                7922
            ],
            [
                7922,
                8138
            ],
            [
                8138,
                8217
            ],
            [
                8217,
                8248
            ],
            [
                8248,
                8412
            ],
            [
                8412,
                8501
            ],
            [
                8501,
                8595
            ],
            [
                8595,
                8648
            ],
            [
                8648,
                8708
            ],
            [
                8708,
                8725
            ],
            [
                8725,
                8825
            ],
            [
                8825,
                8937
            ],
            [
                8937,
                8989
            ],
            [
                8989,
                9200
            ],
            [
                9200,
                9245
            ],
            [
                9245,
                9459
            ],
            [
                9459,
                9478
            ],
            [
                9478,
                9500
            ],
            [
                9500,
                9858
            ],
            [
                9858,
                9965
            ],
            [
                9965,
                10127
            ],
            [
                10127,
                10170
            ],
            [
                10170,
                10189
            ],
            [
                10189,
                10209
            ],
            [
                10209,
                10213
            ],
            [
                10213,
                10325
            ],
            [
                10325,
                10425
            ],
            [
                10425,
                10526
            ],
            [
                10526,
                10572
            ],
            [
                10572,
                10633
            ],
            [
                10633,
                10685
            ],
            [
                10685,
                10728
            ],
            [
                10728,
                10751
            ],
            [
                10751,
                10920
            ],
            [
                10920,
                11129
            ],
            [
                11129,
                11185
            ],
            [
                11185,
                11412
            ],
            [
                11412,
                11456
            ],
            [
                11456,
                11516
            ],
            [
                11516,
                11696
            ],
            [
                11696,
                11797
            ],
            [
                11797,
                11896
            ],
            [
                11896,
                12090
            ],
            [
                12090,
                12130
            ],
            [
                12130,
                12165
            ],
            [
                12165,
                12250
            ],
            [
                12250,
                12398
            ],
            [
                12398,
                12431
            ],
            [
                12431,
                12456
            ],
            [
                12456,
                12588
            ],
            [
                12588,
                12599
            ],
            [
                12599,
                12621
            ],
            [
                12621,
                12704
            ],
            [
                12704,
                12917
            ],
            [
                12917,
                13014
            ],
            [
                13014,
                13057
            ],
            [
                13057,
                13148
            ],
            [
                13148,
                13211
            ],
            [
                13211,
                13264
            ],
            [
                13264,
                13328
            ],
            [
                13328,
                13409
            ],
            [
                13409,
                13690
            ],
            [
                13690,
                13921
            ],
            [
                13921,
                14133
            ],
            [
                14133,
                14191
            ],
            [
                14191,
                14320
            ],
            [
                14320,
                14389
            ],
            [
                14389,
                14439
            ],
            [
                14439,
                14539
            ],
            [
                14539,
                14594
            ],
            [
                14594,
                14820
            ],
            [
                14820,
                14846
            ],
            [
                14846,
                14917
            ],
            [
                14917,
                15035
            ],
            [
                15035,
                15083
            ],
            [
                15083,
                15124
            ],
            [
                15124,
                15163
            ],
            [
                15163,
                15193
            ],
            [
                15193,
                15252
            ],
            [
                15252,
                15326
            ],
            [
                15326,
                15421
            ],
            [
                15421,
                15496
            ],
            [
                15496,
                15558
            ],
            [
                15558,
                15667
            ],
            [
                15667,
                15737
            ],
            [
                15737,
                15751
            ]
        ],
        "overlap_chars": [
            [
                568,
                581
            ],
            [
                632,
                635
            ],
            [
                649,
                681
            ],
            [
                693,
                706
            ],
            [
                682,
                689
            ],
            [
                712,
                744
            ],
            [
                758,
                760
            ],
            [
                760,
                789
            ],
            [
                803,
                851
            ],
            [
                941,
                942
            ],
            [
                947,
                978
            ],
            [
                1034,
                1062
            ],
            [
                1081,
                1106
            ],
            [
                1122,
                1146
            ],
            [
                1191,
                1267
            ],
            [
                1338,
                1340
            ],
            [
                1340,
                1350
            ],
            [
                1381,
                1385
            ],
            [
                1414,
                1417
            ],
            [
                1425,
                1434
            ],
            [
                1404,
                1413
            ],
            [
                1401,
                1403
            ],
            [
                1472,
                1479
            ],
            [
                1549,
                1551
            ],
            [
                2137,
                2192
            ],
            [
                2087,
                2089
            ],
            [
                2090,
                2094
            ],
            [
                2192,
                2194
            ],
            [
                2194,
                2231
            ],
            [
                2235,
                2302
            ],
            [
                2302,
                2384
            ],
            [
                2427,
                2429
            ],
            [
                2396,
                2403
            ],
            [
                2437,
                2455
            ],
            [
                2455,
                2553
            ],
            [
                2611,
                2641
            ],
            [
                2641,
                2709
            ],
            [
                2709,
                2747
            ],
            [
                2755,
                2758
            ],
            [
                2764,
                2785
            ],
            [
                3088,
                3091
            ],
            [
                3178,
                3179
            ],
            [
                3188,
                3195
            ],
            [
                3049,
                3050
            ],
            [
                3219,
                3243
            ],
            [
                3247,
                3282
            ],
            [
                3282,
                3292
            ],
            [
                3414,
                3472
            ],
            [
                3504,
                3523
            ],
            [
                3528,
                3533
            ],
            [
                3381,
                3382
            ],
            [
                3578,
                3626
            ],
            [
                3638,
                3640
            ],
            [
                3640,
                3670
            ],
            [
                3745,
                3776
            ],
            [
                3670,
                3671
            ],
            [
                3700,
                3703
            ],
            [
                3800,
                3811
            ],
            [
                3817,
                3834
            ],
            [
                5185,
                5189
            ],
            [
                5190,
                5204
            ],
            [
                5168,
                5171
            ],
            [
                5137,
                5145
            ],
            [
                5210,
                5220
            ],
            [
                5230,
                5258
            ],
            [
                5266,
                5303
            ],
            [
                5303,
                5306
            ],
            [
                5377,
                5413
            ],
            [
                5444,
                5449
            ],
            [
                5494,
                5512
            ],
            [
                5512,
                5539
            ],
            [
                5566,
                5604
            ],
            [
                5613,
                5665
            ],
            [
                5877,
                5889
            ],
            [
                5925,
                5957
            ],
            [
                5959,
                5995
            ],
            [
                5996,
                6081
            ],
            [
                6088,
                6130
            ],
            [
                6140,
                6201
            ],
            [
                6226,
                6236
            ],
            [
                6245,
                6280
            ],
            [
                6287,
                6372
            ],
            [
                6750,
                6752
            ],
            [
                6415,
                6425
            ],
            [
                6403,
                6406
            ],
            [
                6373,
                6376
            ],
            [
                6593,
                6597
            ],
            [
                6604,
                6608
            ],
            [
                6713,
                6748
            ],
            [
                6787,
                6789
            ],
            [
                6789,
                6805
            ],
            [
                6814,
                6841
            ],
            [
                6861,
                6864
            ],
            [
                6878,
                6948
            ],
            [
                6948,
                6967
            ],
            [
                7109,
                7128
            ],
            [
                7147,
                7164
            ],
            [
                7190,
                7199
            ],
            [
                7165,
                7171
            ],
            [
                7199,
                7201
            ],
            [
                7201,
                7225
            ],
            [
                7226,
                7230
            ],
            [
                7240,
                7241
            ],
            [
                7406,
                7431
            ],
            [
                7260,
                7266
            ],
            [
                7432,
                7437
            ],
            [
                7438,
                7451
            ],
            [
                7458,
                7459
            ],
            [
                7467,
                7480
            ],
            [
                7480,
                7489
            ],
            [
                7517,
                7519
            ],
            [
                7615,
                7657
            ],
            [
                7555,
                7572
            ],
            [
                7574,
                7581
            ],
            [
                7572,
                7573
            ],
            [
                7660,
                7728
            ],
            [
                7763,
                7765
            ],
            [
                7765,
                7794
            ],
            [
                7857,
                7922
            ],
            [
                7926,
                7971
            ],
            [
                8018,
                8029
            ],
            [
                8043,
                8055
            ],
            [
                8084,
                8087
            ],
            [
                7972,
                7975
            ],
            [
                8136,
                8138
            ],
            [
                8173,
                8217
            ],
            [
                8217,
                8248
            ],
            [
                8250,
                8336
            ],
            [
                8353,
                8393
            ],
            [
                8397,
                8412
            ],
            [
                8412,
                8499
            ],
            [
                8501,
                8535
            ],
            [
                8552,
                8563
            ],
            [
                8536,
                8538
            ],
            [
                8595,
                8604
            ],
            [
                8563,
                8564
            ],
            [
                8635,
                8648
            ],
            [
                8648,
                8708
            ],
            [
                8708,
                8725
            ],
            [
                8725,
                8734
            ],
            [
                8755,
                8773
            ],
            [
                8785,
                8804
            ],
            [
                8823,
                8825
            ],
            [
                8937,
                8989
            ],
            [
                8989,
                9002
            ],
            [
                9010,
                9054
            ],
            [
                9065,
                9073
            ],
            [
                9158,
                9200
            ],
            [
                9200,
                9203
            ],
            [
                9205,
                9228
            ],
            [
                9234,
                9245
            ],
            [
                9245,
                9255
            ],
            [
                9270,
                9297
            ],
            [
                9311,
                9320
            ],
            [
                9459,
                9462
            ],
            [
                9483,
                9500
            ],
            [
                9500,
                9537
            ],
            [
                9608,
                9665
            ],
            [
                9667,
                9716
            ],
            [
                9723,
                9749
            ],
            [
                9759,
                9858
            ],
            [
                9860,
                9897
            ],
            [
                9963,
                9964
            ],
            [
                10133,
                10155
            ],
            [
                10168,
                10170
            ],
            [
                10170,
                10189
            ],
            [
                10189,
                10209
            ],
            [
                10209,
                10213
            ],
            [
                10213,
                10292
            ],
            [
                10294,
                10325
            ],
            [
                10345,
                10359
            ],
            [
                10336,
                10344
            ],
            [
                10401,
                10403
            ],
            [
                10382,
                10400
            ],
            [
                10408,
                10425
            ],
            [
                10469,
                10481
            ],
            [
                10518,
                10524
            ],
            [
                10526,
                10527
            ],
            [
                10552,
                10555
            ],
            [
                10556,
                10558
            ],
            [
                10583,
                10598
            ],
            [
                10564,
                10570
            ],
            [
                10651,
                10660
            ],
            [
                10670,
                10685
            ],
            [
                10685,
                10686
            ],
            [
                10690,
                10728
            ],
            [
                10728,
                10751
            ],
            [
                10751,
                10788
            ],
            [
                10918,
                10920
            ],
            [
                10955,
                10988
            ],
            [
                10920,
                10923
            ],
            [
                11018,
                11022
            ],
            [
                11023,
                11040
            ],
            [
                11049,
                11063
            ],
            [
                10946,
                10949
            ],
            [
                11083,
                11102
            ],
            [
                11107,
                11129
            ],
            [
                11129,
                11185
            ],
            [
                11185,
                11211
            ],
            [
                11221,
                11293
            ],
            [
                11294,
                11298
            ],
            [
                11331,
                11332
            ],
            [
                11516,
                11576
            ],
            [
                11641,
                11696
            ],
            [
                11797,
                11896
            ],
            [
                12165,
                12167
            ],
            [
                12169,
                12173
            ],
            [
                12175,
                12183
            ],
            [
                12184,
                12188
            ],
            [
                12198,
                12228
            ],
            [
                12248,
                12250
            ],
            [
                12264,
                12293
            ],
            [
                12319,
                12321
            ],
            [
                12311,
                12318
            ],
            [
                12294,
                12300
            ],
            [
                12396,
                12398
            ],
            [
                12398,
                12431
            ],
            [
                12431,
                12456
            ],
            [
                12456,
                12462
            ],
            [
                12486,
                12489
            ],
            [
                12468,
                12479
            ],
            [
                12489,
                12490
            ],
            [
                12501,
                12511
            ],
            [
                12532,
                12542
            ],
            [
                12547,
                12551
            ],
            [
                12586,
                12588
            ],
            [
                12588,
                12599
            ],
            [
                12599,
                12621
            ],
            [
                12621,
                12624
            ],
            [
                12636,
                12674
            ],
            [
                12702,
                12704
            ],
            [
                12865,
                12882
            ],
            [
                12708,
                12722
            ],
            [
                12886,
                12916
            ],
            [
                12762,
                12779
            ],
            [
                12917,
                13014
            ],
            [
                13014,
                13035
            ],
            [
                13055,
                13057
            ],
            [
                13328,
                13409
            ],
            [
                13409,
                13528
            ],
            [
                13674,
                13679
            ],
            [
                13547,
                13551
            ],
            [
                13659,
                13661
            ],
            [
                13576,
                13578
            ],
            [
                13688,
                13690
            ],
            [
                13690,
                13713
            ],
            [
                13718,
                13753
            ],
            [
                13755,
                13772
            ],
            [
                13794,
                13813
            ],
            [
                13815,
                13889
            ],
            [
                13891,
                13921
            ],
            [
                13965,
                13966
            ],
            [
                14154,
                14165
            ],
            [
                13921,
                13924
            ],
            [
                14184,
                14186
            ],
            [
                14189,
                14191
            ],
            [
                14191,
                14215
            ],
            [
                14242,
                14320
            ],
            [
                14320,
                14330
            ],
            [
                14337,
                14389
            ],
            [
                14389,
                14426
            ],
            [
                14466,
                14515
            ],
            [
                14524,
                14539
            ],
            [
                14539,
                14594
            ],
            [
                14594,
                14646
            ],
            [
                14785,
                14818
            ],
            [
                14820,
                14833
            ],
            [
                14837,
                14846
            ],
            [
                14846,
                14917
            ],
            [
                14937,
                14957
            ],
            [
                14998,
                15006
            ],
            [
                15016,
                15035
            ],
            [
                15326,
                15421
            ],
            [
                15421,
                15429
            ],
            [
                15440,
                15447
            ],
            [
                15455,
                15496
            ],
            [
                15496,
                15557
            ],
            [
                15600,
                15647
            ],
            [
                15656,
                15665
            ],
            [
                15667,
                15737
            ],
            [
                15737,
                15751
            ]
        ],
        "row_chars": [
            [
                0,
                203
            ],
            [
                203,
                270
            ],
            [
                270,
                568
            ],
            [
                568,
                760
            ],
            [
                760,
                1062
            ],
            [
                1062,
                1340
            ],
            [
                1340,
                1551
            ],
            [
                1551,
                1719
            ],
            [
                1719,
                1840
            ],
            [
                1840,
                1893
            ],
            [
                1893,
                2024
            ],
            [
                2024,
                2194
            ],
            [
                2194,
                2302
            ],
            [
                2302,
                2455
            ],
            [
                2455,
                2641
            ],
            [
                2641,
                2709
            ],
            [
                2709,
                2785
            ],
            [
                2785,
                2998
            ],
            [
                2998,
                3282
            ],
            [
                3282,
                3640
            ],
            [
                3640,
                3834
            ],
            [
                3834,
                4249
            ],
            [
                4249,
                4293
            ],
            [
                4293,
                4363
            ],
            [
                4363,
                4853
            ],
            [
                4853,
                5114
            ],
            [
                5114,
                5303
            ],
            [
                5303,
                5512
            ],
            [
                5512,
                5668
            ],
            [
                5668,
                5876
            ],
            [
                5876,
                5889
            ],
            [
                5889,
                5925
            ],
            [
                5925,
                5996
            ],
            [
                5996,
                6373
            ],
            [
                6373,
                6789
            ],
            [
                6789,
                6948
            ],
            [
                6948,
                7201
            ],
            [
                7201,
                7438
            ],
            [
                7438,
                7480
            ],
            [
                7480,
                7519
            ],
            [
                7519,
                7660
            ],
            [
                7660,
                7765
            ],
            [
                7765,
                7797
            ],
            [
                7797,
                7856
            ],
            [
                7856,
                7922
            ],
            [
                7922,
                8138
            ],
            [
                8138,
                8217
            ],
            [
                8217,
                8248
            ],
            [
                8248,
                8412
            ],
            [
                8412,
                8501
            ],
            [
                8501,
                8648
            ],
            [
                8648,
                8708
            ],
            [
                8708,
                8725
            ],
            [
                8725,
                8825
            ],
            [
                8825,
                8937
            ],
            [
                8937,
                8989
            ],
            [
                8989,
                9200
            ],
            [
                9200,
                9245
            ],
            [
                9245,
                9500
            ],
            [
                9500,
                9858
            ],
            [
                9858,
                9965
            ],
            [
                9965,
                10127
            ],
            [
                10127,
                10170
            ],
            [
                10170,
                10189
            ],
            [
                10189,
                10209
            ],
            [
                10209,
                10213
            ],
            [
                10213,
                10325
            ],
            [
                10325,
                10425
            ],
            [
                10425,
                10526
            ],
            [
                10526,
                10633
            ],
            [
                10633,
                10685
            ],
            [
                10685,
                10728
            ],
            [
                10728,
                10751
            ],
            [
                10751,
                10920
            ],
            [
                10920,
                11129
            ],
            [
                11129,
                11185
            ],
            [
                11185,
                11412
            ],
            [
                11412,
                11456
            ],
            [
                11456,
                11516
            ],
            [
                11516,
                11696
            ],
            [
                11696,
                11797
            ],
            [
                11797,
                11896
            ],
            [
                11896,
                12090
            ],
            [
                12090,
                12130
            ],
            [
                12130,
                12165
            ],
            [
                12165,
                12250
            ],
            [
                12250,
                12398
            ],
            [
                12398,
                12431
            ],
            [
                12431,
                12456
            ],
            [
                12456,
                12588
            ],
            [
                12588,
                12599
            ],
            [
                12599,
                12621
            ],
            [
                12621,
                12704
            ],
            [
                12704,
                12917
            ],
            [
                12917,
                13014
            ],
            [
                13014,
                13057
            ],
            [
                13057,
                13148
            ],
            [
                13148,
                13211
            ],
            [
                13211,
                13264
            ],
            [
                13264,
                13328
            ],
            [
                13328,
                13409
            ],
            [
                13409,
                13690
            ],
            [
                13690,
                13921
            ],
            [
                13921,
                14191
            ],
            [
                14191,
                14320
            ],
            [
                14320,
                14389
            ],
            [
                14389,
                14439
            ],
            [
                14439,
                14539
            ],
            [
                14539,
                14594
            ],
            [
                14594,
                14820
            ],
            [
                14820,
                14846
            ],
            [
                14846,
                14917
            ],
            [
                14917,
                15035
            ],
            [
                15035,
                15083
            ],
            [
                15083,
                15124
            ],
            [
                15124,
                15163
            ],
            [
                15163,
                15193
            ],
            [
                15193,
                15252
            ],
            [
                15252,
                15326
            ],
            [
                15326,
                15421
            ],
            [
                15421,
                15496
            ],
            [
                15496,
                15558
            ],
            [
                15558,
                15737
            ],
            [
                15737,
                15751
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Gascoigne brought the news that Mrs. Mompert had fixed the following Tuesday for her interview with Gwendolen. He said nothing of his having heard that Mr. Grandcourt had returned to Diplow, feeling that it would be unkind under the present reverses. He thought of his niece's caprice with regret, but considered that Grandcourt had been the first to behave oddly, in suddenly walking away. The rector felt that he should now encourage his niece to accept her lot.\n\"I feel sure that Mrs. Mompert will be pleased with you,\" he said. \"You will know how to conduct yourself with a woman who holds in all senses the relation of a superior to you. This trouble has come on you young, but that makes it in some respects easier, and we will benefit from adjusting our minds to it.\"\nThis was precisely what Gwendolen was unable to do; and after her uncle was gone, the bitter tears fell slowly as she sat alone. Her heart denied that the trouble was easier because she was young. When was she to have any happiness, if not while she was young? She saw a sterile, dreary path at her feet, which she had no courage to tread. She was in that first rage of disappointment in life's morning, which older people are apt to remember dimly, intolerant of its self-enclosed unreasonableness. What passion seems more absurd than this amazed anguish that I, and no other, should be the smitten one? Gwendolen, poor, spoiled child, had lost all her illusion of her own high destiny; the lovely eyes and the majestic figure seemed now to have no magic in them.\nShe walked up and down the drawing-room, while a slow tear fell. She thought, \"I have always felt that mamma was not a happy woman; I dare say I shall be more unhappy than she has been. Poor mamma! I can get a little money for her - that is all I shall care about now.\"\nAnd then with an entirely new movement of her imagination, she saw her mother getting old and white, and herself no longer young, and their two faces meeting still with memory and love, and her mother thinking- \"Poor Gwen too is sad and faded now.\"\nThen, for the first time, she sobbed, not in anger, but with a sort of tender misery. As her mother entered and put her arms around her, she sobbed anew in spite of herself.\nMrs. Davilow had something in her hand which was causing her anxiety, and she dared not speak until her darling had become calmer. But Gwendolen, with a deep breath, drew back and looked at her tremulous mother.\n\"It was nothing, mamma,\" she said, before she perceived a letter in her mother's hand. \"What is that? - worse news still?\" she asked bitterly.\n\"You will hardly guess where it comes from, dear,\" said Mrs Davilow.\n\"Don't ask me to guess anything,\" said Gwendolen, rather impatiently.\n\"It is addressed to you, dear. It comes from Diplow,\" said Mrs. Davilow, giving her the letter.\nGwendolen knew Grandcourt's indistinct handwriting, and blushed deeply; but as she read, the colour died from her face. She turned the open note toward her mother. The words were few and formal:\n'Mr. Grandcourt presents his compliments to Miss Harleth, and begs to know whether he may call at Offendene tomorrow after two and see her alone. Mr. Grandcourt has just returned from Leubronn, where he had hoped to find Miss Harleth.'\nMrs. Davilow read, and then looked inquiringly at Gwendolen, who turned away.\n\"It must be answered, darling,\" said Mrs. Davilow, timidly. \"The man waits.\"\nGwendolen clasped her hands, gazing straight before her. The sudden change of the situation was bewildering. A few minutes earlier she was looking along an inescapable path of monotony; and lo, now, a moment of choice was come. Yet was it triumph she felt or terror? Impossible not to feel some triumph in her power; but then came the terror. Quick, quick, like pictures in a book, all that she had gone through in relation to Grandcourt - the allurements, the vacillations, the resolve to accept, the final repulsion; the face of that dark-eyed lady with the lovely boy: her own pledge (was it a pledge not to marry him?) - the new disbelief in the worth of men.\nWhat was the good of choice? What did she wish? Anything different? No! And yet in the dark seed-growths of consciousness a new wish was forming itself - \"I wish I had never known it!\" She wished for anything to save her from the dread of letting Grandcourt come.\nAt last Mrs. Davilow said gently-\n\"You need to write an answer, dear.\"\nGwendolen drew a deep breath. \"Please lay me out the pen and paper.\"\nThat was gaining time. Was she to decline Grandcourt's visit? Like a warm current through her terror was the notion that this would be an event - an opportunity for her to look and speak with her former effectiveness. The interest of the morrow was no longer at a deadlock.\n\"There is really no reason why you should be so alarmed at the man's waiting a few minutes, mamma,\" she said.\n\"No, dear,\" said Mrs. Davilow, in the tone of one corrected, \"he can wait another quarter of an hour, if you like.\"\nAt once Gwendolen felt a contradictory desire to be hastened: hurry would save her from deliberate choice.\n\"I must decide,\" she said, walking to the writing-table. There was a busy undercurrent of thought in her. Why should she not let him come? It bound her to nothing. He had followed her to Leubronn: he meant a renewal of his suit. What then? She could reject him. Why deny herself the freedom of doing this?\n\"I wonder whether Mr. Grandcourt has heard of our misfortunes?\" said Mrs. Davilow.\n\"That could make no difference to a man in his position,\" said Gwendolen, rather contemptuously,\n\"It would to some men. If Mr. Grandcourt did know, I think it a strong proof of his attachment to you.\"\nMrs. Davilow spoke with unusual emphasis: it was the first time she had ventured to say anything about Grandcourt which might seem to be in his favour. The effect of her words was stronger than she could imagine. They raised a new vision in Gwendolen's mind - a vision of what Grandcourt might do for her mother if she, Gwendolen, did what she was not going to do. At once, in a hurry, she began to write. To act in a hurry was to keep away from an absolute decision, and to leave open as many issues as possible.\nShe wrote:\n'Miss Harleth presents her compliments to Mr. Grandcourt. She will be at home after two o'clock tomorrow.'\nThen she said, \"Pray ring the bell, mamma, if there is anyone to answer it.\" She really did not know who did the work of the house.\nIt was not till after the letter had been taken away that Mrs. Davilow ventured to ask-\n\"What did you write, Gwen?\"\n\"I said that I should be at home,\" answered Gwendolen, rather loftily. \"You must not expect anything to happen, mamma.\"\n\"But Mr. Grandcourt will consider that you have already accepted him, in allowing him to come. His note plainly means that he is coming to make you an offer.\"\n\"Very well; and I wish to have the pleasure of refusing him.\" And Gwendolen implied her wish not to be questioned by saying- \"Put down that detestable needle-work, and let us walk in the avenue. I am stifled.\"",
        "paragraph_chars": [
            [
                0,
                469
            ],
            [
                469,
                779
            ],
            [
                779,
                1544
            ],
            [
                1544,
                1814
            ],
            [
                1814,
                2063
            ],
            [
                2063,
                2237
            ],
            [
                2237,
                2449
            ],
            [
                2449,
                2592
            ],
            [
                2592,
                2661
            ],
            [
                2661,
                2731
            ],
            [
                2731,
                2827
            ],
            [
                2827,
                3022
            ],
            [
                3022,
                3258
            ],
            [
                3258,
                3336
            ],
            [
                3336,
                3413
            ],
            [
                3413,
                4077
            ],
            [
                4077,
                4341
            ],
            [
                4341,
                4375
            ],
            [
                4375,
                4412
            ],
            [
                4412,
                4481
            ],
            [
                4481,
                4755
            ],
            [
                4755,
                4865
            ],
            [
                4865,
                4981
            ],
            [
                4981,
                5088
            ],
            [
                5088,
                5394
            ],
            [
                5394,
                5477
            ],
            [
                5477,
                5574
            ],
            [
                5574,
                5678
            ],
            [
                5678,
                6192
            ],
            [
                6192,
                6203
            ],
            [
                6203,
                6310
            ],
            [
                6310,
                6442
            ],
            [
                6442,
                6530
            ],
            [
                6530,
                6558
            ],
            [
                6558,
                6678
            ],
            [
                6678,
                6837
            ],
            [
                6837,
                7046
            ]
        ],
        "segment_chars": [
            [
                0,
                115
            ],
            [
                115,
                255
            ],
            [
                255,
                395
            ],
            [
                395,
                469
            ],
            [
                469,
                536
            ],
            [
                536,
                647
            ],
            [
                647,
                779
            ],
            [
                779,
                908
            ],
            [
                908,
                976
            ],
            [
                976,
                1040
            ],
            [
                1040,
                1119
            ],
            [
                1119,
                1279
            ],
            [
                1279,
                1384
            ],
            [
                1384,
                1544
            ],
            [
                1544,
                1609
            ],
            [
                1609,
                1730
            ],
            [
                1730,
                1742
            ],
            [
                1742,
                1814
            ],
            [
                1814,
                2063
            ],
            [
                2063,
                2149
            ],
            [
                2149,
                2237
            ],
            [
                2237,
                2368
            ],
            [
                2368,
                2449
            ],
            [
                2449,
                2536
            ],
            [
                2536,
                2551
            ],
            [
                2551,
                2572
            ],
            [
                2572,
                2592
            ],
            [
                2592,
                2661
            ],
            [
                2661,
                2731
            ],
            [
                2731,
                2762
            ],
            [
                2762,
                2827
            ],
            [
                2827,
                2947
            ],
            [
                2947,
                2991
            ],
            [
                2991,
                3022
            ],
            [
                3022,
                3168
            ],
            [
                3168,
                3258
            ],
            [
                3258,
                3336
            ],
            [
                3336,
                3396
            ],
            [
                3396,
                3413
            ],
            [
                3413,
                3470
            ],
            [
                3470,
                3522
            ],
            [
                3522,
                3641
            ],
            [
                3641,
                3680
            ],
            [
                3680,
                3756
            ],
            [
                3756,
                4036
            ],
            [
                4036,
                4077
            ],
            [
                4077,
                4106
            ],
            [
                4106,
                4125
            ],
            [
                4125,
                4145
            ],
            [
                4145,
                4149
            ],
            [
                4149,
                4262
            ],
            [
                4262,
                4341
            ],
            [
                4341,
                4375
            ],
            [
                4375,
                4412
            ],
            [
                4412,
                4442
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4504
            ],
            [
                4504,
                4543
            ],
            [
                4543,
                4699
            ],
            [
                4699,
                4755
            ],
            [
                4755,
                4865
            ],
            [
                4865,
                4981
            ],
            [
                4981,
                5088
            ],
            [
                5088,
                5145
            ],
            [
                5145,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5252
            ],
            [
                5252,
                5317
            ],
            [
                5317,
                5328
            ],
            [
                5328,
                5350
            ],
            [
                5350,
                5394
            ],
            [
                5394,
                5458
            ],
            [
                5458,
                5477
            ],
            [
                5477,
                5574
            ],
            [
                5574,
                5597
            ],
            [
                5597,
                5678
            ],
            [
                5678,
                5830
            ],
            [
                5830,
                5891
            ],
            [
                5891,
                6043
            ],
            [
                6043,
                6084
            ],
            [
                6084,
                6192
            ],
            [
                6192,
                6203
            ],
            [
                6203,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6387
            ],
            [
                6387,
                6442
            ],
            [
                6442,
                6530
            ],
            [
                6530,
                6558
            ],
            [
                6558,
                6629
            ],
            [
                6629,
                6678
            ],
            [
                6678,
                6773
            ],
            [
                6773,
                6837
            ],
            [
                6837,
                6899
            ],
            [
                6899,
                7032
            ],
            [
                7032,
                7046
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                22,
                25
            ],
            [
                26,
                58
            ],
            [
                59,
                72
            ],
            [
                73,
                80
            ],
            [
                81,
                113
            ],
            [
                113,
                115
            ],
            [
                115,
                144
            ],
            [
                145,
                193
            ],
            [
                193,
                194
            ],
            [
                195,
                226
            ],
            [
                227,
                255
            ],
            [
                255,
                280
            ],
            [
                281,
                305
            ],
            [
                317,
                393
            ],
            [
                393,
                395
            ],
            [
                395,
                405
            ],
            [
                411,
                415
            ],
            [
                426,
                429
            ],
            [
                430,
                439
            ],
            [
                440,
                449
            ],
            [
                450,
                452
            ],
            [
                460,
                467
            ],
            [
                467,
                469
            ],
            [
                469,
                524
            ],
            [
                524,
                526
            ],
            [
                530,
                534
            ],
            [
                534,
                536
            ],
            [
                537,
                574
            ],
            [
                580,
                647
            ],
            [
                647,
                729
            ],
            [
                730,
                732
            ],
            [
                738,
                745
            ],
            [
                761,
                779
            ],
            [
                779,
                877
            ],
            [
                878,
                908
            ],
            [
                908,
                976
            ],
            [
                976,
                1014
            ],
            [
                1015,
                1018
            ],
            [
                1019,
                1040
            ],
            [
                1040,
                1043
            ],
            [
                1048,
                1049
            ],
            [
                1050,
                1057
            ],
            [
                1057,
                1058
            ],
            [
                1059,
                1083
            ],
            [
                1084,
                1119
            ],
            [
                1119,
                1129
            ],
            [
                1130,
                1188
            ],
            [
                1202,
                1221
            ],
            [
                1222,
                1227
            ],
            [
                1227,
                1228
            ],
            [
                1229,
                1277
            ],
            [
                1277,
                1279
            ],
            [
                1279,
                1309
            ],
            [
                1310,
                1341
            ],
            [
                1341,
                1342
            ],
            [
                1343,
                1346
            ],
            [
                1355,
                1366
            ],
            [
                1367,
                1384
            ],
            [
                1395,
                1399
            ],
            [
                1401,
                1415
            ],
            [
                1416,
                1419
            ],
            [
                1433,
                1441
            ],
            [
                1467,
                1477
            ],
            [
                1478,
                1506
            ],
            [
                1507,
                1544
            ],
            [
                1544,
                1547
            ],
            [
                1548,
                1584
            ],
            [
                1585,
                1590
            ],
            [
                1591,
                1609
            ],
            [
                1609,
                1636
            ],
            [
                1637,
                1675
            ],
            [
                1676,
                1728
            ],
            [
                1730,
                1742
            ],
            [
                1742,
                1774
            ],
            [
                1777,
                1813
            ],
            [
                1814,
                1899
            ],
            [
                1900,
                1942
            ],
            [
                1942,
                2003
            ],
            [
                2004,
                2014
            ],
            [
                2025,
                2060
            ],
            [
                2063,
                2148
            ],
            [
                2149,
                2151
            ],
            [
                2152,
                2162
            ],
            [
                2171,
                2174
            ],
            [
                2179,
                2182
            ],
            [
                2183,
                2187
            ],
            [
                2195,
                2199
            ],
            [
                2200,
                2235
            ],
            [
                2235,
                2237
            ],
            [
                2237,
                2253
            ],
            [
                2254,
                2281
            ],
            [
                2294,
                2297
            ],
            [
                2298,
                2368
            ],
            [
                2368,
                2387
            ],
            [
                2388,
                2407
            ],
            [
                2413,
                2430
            ],
            [
                2431,
                2440
            ],
            [
                2441,
                2447
            ],
            [
                2447,
                2449
            ],
            [
                2449,
                2473
            ],
            [
                2478,
                2482
            ],
            [
                2482,
                2483
            ],
            [
                2495,
                2520
            ],
            [
                2521,
                2527
            ],
            [
                2530,
                2535
            ],
            [
                2536,
                2549
            ],
            [
                2549,
                2550
            ],
            [
                2559,
                2572
            ],
            [
                2572,
                2581
            ],
            [
                2590,
                2592
            ],
            [
                2592,
                2634
            ],
            [
                2634,
                2651
            ],
            [
                2652,
                2659
            ],
            [
                2659,
                2660
            ],
            [
                2661,
                2729
            ],
            [
                2729,
                2731
            ],
            [
                2731,
                2760
            ],
            [
                2762,
                2827
            ],
            [
                2837,
                2882
            ],
            [
                2891,
                2902
            ],
            [
                2903,
                2915
            ],
            [
                2916,
                2919
            ],
            [
                2937,
                2940
            ],
            [
                2945,
                2947
            ],
            [
                2947,
                2991
            ],
            [
                2991,
                3022
            ],
            [
                3025,
                3111
            ],
            [
                3112,
                3152
            ],
            [
                3153,
                3168
            ],
            [
                3168,
                3255
            ],
            [
                3258,
                3292
            ],
            [
                3293,
                3304
            ],
            [
                3305,
                3307
            ],
            [
                3308,
                3317
            ],
            [
                3317,
                3318
            ],
            [
                3323,
                3336
            ],
            [
                3336,
                3396
            ],
            [
                3396,
                3413
            ],
            [
                3413,
                3422
            ],
            [
                3423,
                3441
            ],
            [
                3449,
                3468
            ],
            [
                3468,
                3470
            ],
            [
                3470,
                3522
            ],
            [
                3522,
                3535
            ],
            [
                3544,
                3588
            ],
            [
                3589,
                3597
            ],
            [
                3599,
                3641
            ],
            [
                3641,
                3644
            ],
            [
                3645,
                3668
            ],
            [
                3669,
                3680
            ],
            [
                3680,
                3690
            ],
            [
                3691,
                3718
            ],
            [
                3719,
                3728
            ],
            [
                3730,
                3733
            ],
            [
                3739,
                3756
            ],
            [
                3756,
                3793
            ],
            [
                3793,
                3850
            ],
            [
                3853,
                3902
            ],
            [
                3909,
                3935
            ],
            [
                3936,
                4035
            ],
            [
                4038,
                4075
            ],
            [
                4075,
                4076
            ],
            [
                4082,
                4104
            ],
            [
                4104,
                4106
            ],
            [
                4106,
                4125
            ],
            [
                4125,
                4145
            ],
            [
                4145,
                4149
            ],
            [
                4149,
                4228
            ],
            [
                4231,
                4262
            ],
            [
                4262,
                4276
            ],
            [
                4277,
                4285
            ],
            [
                4286,
                4288
            ],
            [
                4294,
                4312
            ],
            [
                4324,
                4341
            ],
            [
                4349,
                4361
            ],
            [
                4367,
                4373
            ],
            [
                4375,
                4376
            ],
            [
                4376,
                4379
            ],
            [
                4385,
                4387
            ],
            [
                4388,
                4403
            ],
            [
                4403,
                4409
            ],
            [
                4412,
                4421
            ],
            [
                4427,
                4442
            ],
            [
                4442,
                4443
            ],
            [
                4443,
                4481
            ],
            [
                4481,
                4504
            ],
            [
                4504,
                4541
            ],
            [
                4541,
                4543
            ],
            [
                4548,
                4581
            ],
            [
                4586,
                4589
            ],
            [
                4597,
                4601
            ],
            [
                4607,
                4624
            ],
            [
                4627,
                4641
            ],
            [
                4646,
                4649
            ],
            [
                4653,
                4672
            ],
            [
                4677,
                4699
            ],
            [
                4699,
                4755
            ],
            [
                4755,
                4781
            ],
            [
                4782,
                4854
            ],
            [
                4859,
                4863
            ],
            [
                4863,
                4864
            ],
            [
                4865,
                4925
            ],
            [
                4926,
                4981
            ],
            [
                4989,
                5088
            ],
            [
                5088,
                5090
            ],
            [
                5091,
                5095
            ],
            [
                5096,
                5104
            ],
            [
                5109,
                5113
            ],
            [
                5113,
                5143
            ],
            [
                5143,
                5145
            ],
            [
                5145,
                5174
            ],
            [
                5175,
                5177
            ],
            [
                5178,
                5185
            ],
            [
                5186,
                5192
            ],
            [
                5192,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5252
            ],
            [
                5252,
                5258
            ],
            [
                5268,
                5271
            ],
            [
                5272,
                5283
            ],
            [
                5283,
                5284
            ],
            [
                5285,
                5295
            ],
            [
                5296,
                5306
            ],
            [
                5311,
                5315
            ],
            [
                5315,
                5317
            ],
            [
                5317,
                5328
            ],
            [
                5328,
                5350
            ],
            [
                5350,
                5353
            ],
            [
                5354,
                5392
            ],
            [
                5392,
                5394
            ],
            [
                5394,
                5411
            ],
            [
                5412,
                5426
            ],
            [
                5427,
                5457
            ],
            [
                5458,
                5475
            ],
            [
                5477,
                5574
            ],
            [
                5574,
                5595
            ],
            [
                5595,
                5597
            ],
            [
                5597,
                5678
            ],
            [
                5678,
                5797
            ],
            [
                5798,
                5803
            ],
            [
                5804,
                5808
            ],
            [
                5812,
                5814
            ],
            [
                5815,
                5817
            ],
            [
                5828,
                5830
            ],
            [
                5830,
                5853
            ],
            [
                5854,
                5889
            ],
            [
                5891,
                5908
            ],
            [
                5916,
                5935
            ],
            [
                5938,
                6012
            ],
            [
                6013,
                6043
            ],
            [
                6050,
                6051
            ],
            [
                6052,
                6063
            ],
            [
                6064,
                6067
            ],
            [
                6074,
                6076
            ],
            [
                6082,
                6084
            ],
            [
                6084,
                6108
            ],
            [
                6114,
                6192
            ],
            [
                6192,
                6202
            ],
            [
                6209,
                6261
            ],
            [
                6261,
                6298
            ],
            [
                6315,
                6364
            ],
            [
                6372,
                6387
            ],
            [
                6387,
                6442
            ],
            [
                6442,
                6494
            ],
            [
                6495,
                6528
            ],
            [
                6530,
                6543
            ],
            [
                6549,
                6558
            ],
            [
                6558,
                6629
            ],
            [
                6629,
                6649
            ],
            [
                6650,
                6658
            ],
            [
                6659,
                6678
            ],
            [
                6678,
                6773
            ],
            [
                6773,
                6781
            ],
            [
                6782,
                6789
            ],
            [
                6796,
                6837
            ],
            [
                6837,
                6898
            ],
            [
                6903,
                6950
            ],
            [
                6951,
                6960
            ],
            [
                6962,
                7032
            ],
            [
                7032,
                7046
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                115
            ],
            [
                115,
                255
            ],
            [
                255,
                395
            ],
            [
                395,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                469
            ],
            [
                469,
                536
            ],
            [
                536,
                647
            ],
            [
                647,
                779
            ],
            [
                779,
                908
            ],
            [
                908,
                976
            ],
            [
                976,
                1040
            ],
            [
                1040,
                1040
            ],
            [
                1040,
                1119
            ],
            [
                1119,
                1279
            ],
            [
                1279,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1544
            ],
            [
                1544,
                1609
            ],
            [
                1609,
                1730
            ],
            [
                1730,
                1730
            ],
            [
                1730,
                1742
            ],
            [
                1742,
                1742
            ],
            [
                1742,
                1814
            ],
            [
                1814,
                2149
            ],
            [
                2149,
                2237
            ],
            [
                2237,
                2368
            ],
            [
                2368,
                2449
            ],
            [
                2449,
                2536
            ],
            [
                2536,
                2572
            ],
            [
                2572,
                2592
            ],
            [
                2592,
                2661
            ],
            [
                2661,
                2731
            ],
            [
                2731,
                2762
            ],
            [
                2762,
                2762
            ],
            [
                2762,
                2827
            ],
            [
                2827,
                2947
            ],
            [
                2947,
                2991
            ],
            [
                2991,
                3022
            ],
            [
                3022,
                3168
            ],
            [
                3168,
                3258
            ],
            [
                3258,
                3336
            ],
            [
                3336,
                3396
            ],
            [
                3396,
                3413
            ],
            [
                3413,
                3470
            ],
            [
                3470,
                3470
            ],
            [
                3470,
                3522
            ],
            [
                3522,
                3641
            ],
            [
                3641,
                3680
            ],
            [
                3680,
                3756
            ],
            [
                3756,
                4036
            ],
            [
                4036,
                4077
            ],
            [
                4077,
                4077
            ],
            [
                4077,
                4106
            ],
            [
                4106,
                4125
            ],
            [
                4125,
                4145
            ],
            [
                4145,
                4149
            ],
            [
                4149,
                4262
            ],
            [
                4262,
                4341
            ],
            [
                4341,
                4375
            ],
            [
                4375,
                4412
            ],
            [
                4412,
                4442
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4504
            ],
            [
                4504,
                4543
            ],
            [
                4543,
                4699
            ],
            [
                4699,
                4755
            ],
            [
                4755,
                4865
            ],
            [
                4865,
                4865
            ],
            [
                4865,
                4865
            ],
            [
                4865,
                4981
            ],
            [
                4981,
                4981
            ],
            [
                4981,
                5088
            ],
            [
                5088,
                5088
            ],
            [
                5088,
                5088
            ],
            [
                5088,
                5088
            ],
            [
                5088,
                5145
            ],
            [
                5145,
                5194
            ],
            [
                5194,
                5227
            ],
            [
                5227,
                5252
            ],
            [
                5252,
                5317
            ],
            [
                5317,
                5328
            ],
            [
                5328,
                5350
            ],
            [
                5350,
                5394
            ],
            [
                5394,
                5477
            ],
            [
                5477,
                5574
            ],
            [
                5574,
                5597
            ],
            [
                5597,
                5597
            ],
            [
                5597,
                5597
            ],
            [
                5597,
                5597
            ],
            [
                5597,
                5597
            ],
            [
                5597,
                5678
            ],
            [
                5678,
                5830
            ],
            [
                5830,
                6043
            ],
            [
                6043,
                6084
            ],
            [
                6084,
                6192
            ],
            [
                6192,
                6261
            ],
            [
                6261,
                6310
            ],
            [
                6310,
                6387
            ],
            [
                6387,
                6442
            ],
            [
                6442,
                6530
            ],
            [
                6530,
                6558
            ],
            [
                6558,
                6629
            ],
            [
                6629,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6678
            ],
            [
                6678,
                6773
            ],
            [
                6773,
                6837
            ],
            [
                6837,
                6899
            ],
            [
                6899,
                7032
            ],
            [
                7032,
                7046
            ]
        ]
    }
}