{
    "original": {
        "text": "\"Il est plus ais de connotre l'homme en gnral que de connotre un homme en particulier.\"--LA ROCHEFOUCAULD.\nAn hour after Grandcourt had left, the important news of Gwendolen's engagement was known at the rectory, and Mr. and Mrs. Gascoigne, with Anna, spent the evening at Offendene.\n\"My dear, let me congratulate you on having created a strong attachment,\" said the rector. \"You look serious, and I don't wonder at it: a lifelong union is a solemn thing. But from the way Mr. Grandcourt has acted and spoken I think we may already see some good arising out of our adversity. It has given you an opportunity of observing your future husband's delicate liberality.\"\nMr. Gascoigne referred to Grandcourt's mode of implying that he would provide for Mrs. Davilow--a part of the love-making which Gwendolen had remembered to cite to her mother with perfect accuracy.\n\"But I have no doubt that Mr. Grandcourt would have behaved quite as handsomely if you had not gone away to Germany, Gwendolen, and had been engaged to him, as you no doubt might have been, more than a month ago,\" said Mrs. Gascoigne, feeling that she had to discharge a duty on this occasion. \"But now there is no more room for caprice; indeed, I trust you have no inclination to any. A woman has a great debt of gratitude to a man who perseveres in making her such an offer. But no doubt you feel properly.\"\n\"I am not at all sure that I do, aunt,\" said Gwendolen, with saucy gravity. \"I don't know everything it is proper to feel on being engaged.\"\nThe rector patted her shoulder and smiled as at a bit of innocent naughtiness, and his wife took his behavior as an indication that she was not to be displeased. As for Anna, she kissed Gwendolen and said, \"I do hope you will be happy,\" but then sank into the background and tried to keep the tears back too. In the late days she had been imagining a little romance about Rex--how if he still longed for Gwendolen her heart might be softened by trouble into love, so that they could by-and-by be married. And the romance had turned to a prayer that she, Anna, might be able to rejoice like a good sister, and only think of being useful in working for Gwendolen, as long as Rex was not rich. But now she wanted grace to rejoice in something else. Miss Merry and the four girls, Alice with the high shoulders, Bertha and Fanny the whisperers, and Isabel the listener, were all present on this family occasion, when everything seemed appropriately turning to the honor and glory of Gwendolen, and real life was as interesting as \"Sir Charles Grandison.\" The evening passed chiefly in decisive remarks from the rector, in answer to conjectures from the two elder ladies. According to him, the case was not one in which he could think it his duty to mention settlements: everything must, and doubtless would safely be left to Mr. Grandcourt.\n\"I should like to know exactly what sort of places Ryelands and Gadsmere are,\" said Mrs. Davilow.\n\"Gadsmere, I believe, is a secondary place,\" said Mr. Gascoigne; \"But Ryelands I know to be one of our finest seats. The park is extensive and the woods of a very valuable order. The house was built by Inigo Jones, and the ceilings are painted in the Italian style. The estate is said to be worth twelve thousand a year, and there are two livings, one a rectory, in the gift of the Grandcourts. There may be some burdens on the land. Still, Mr. Grandcourt was an only child.\"\n\"It would be most remarkable,\" said Mrs. Gascoigne, \"if he were to become Lord Stannery in addition to everything else. Only think: there is the Grandcourt estate, the Mallinger estate, _and_ the baronetcy, _and_ the peerage,\"--she was marking off the items on her fingers, and paused on the fourth while she added, \"but they say there will be no land coming to him with the peerage.\" It seemed a pity there was nothing for the fifth finger.\n\"The peerage,\" said the rector, judiciously, \"must be regarded as a remote chance. There are two cousins between the present peer and Mr. Grandcourt. It is certainly a serious reflection how death and other causes do sometimes concentrate inheritances on one man. But an excess of that kind is to be deprecated. To be Sir Mallinger Grandcourt Mallinger--I suppose that will be his style--with corresponding properties, is a valuable talent enough for any man to have committed to him. Let us hope it will be well used.\"\n\"And what a position for the wife, Gwendolen!\" said Mrs. Gascoigne; \"a great responsibility indeed. But you must lose no time in writing to Mrs. Mompert, Henry. It is a good thing that you have an engagement of marriage to offer as an excuse, else she might feel offended. She is rather a high woman.\"\n\"I am rid of that horror,\" thought Gwendolen, to whom the name of Mompert had become a sort of Mumbo-jumbo. She was very silent through the evening, and that night could hardly sleep at all in her little white bed. It was a rarity in her strong youth to be wakeful: and perhaps a still greater rarity for her to be careful that her mother should not know of her restlessness. But her state of mind was altogether new: she who had been used to feel sure of herself, and ready to manage others, had just taken a decisive step which she had beforehand thought that she would not take--nay, perhaps, was bound not to take. She could not go backward now; she liked a great deal of what lay before her; and there was nothing for her to like if she went back. But her resolution was dogged by the shadow of that previous resolve which had at first come as the undoubting movement of her whole being. While she lay on her pillow with wide-open eyes, \"looking on darkness which the blind do see,\" she was appalled by the idea that she was going to do what she had once started away from with repugnance. It was new to her that a question of right or wrong in her conduct should rouse her terror; she had known no compunction that atoning caresses and presents could not lay to rest. But here had come a moment when something like a new consciousness was awaked. She seemed on the edge of adopting deliberately, as a notion for all the rest of her life, what she had rashly said in her bitterness, when her discovery had driven her away to Leubronn:--that it did not signify what she did; she had only to amuse herself as best she could. That lawlessness, that casting away of all care for justification, suddenly frightened her: it came to her with the shadowy array of possible calamity behind it--calamity which had ceased to be a mere name for her; and all the infiltrated influences of disregarded religious teaching, as well as the deeper impressions of something awful and inexorable enveloping her, seemed to concentrate themselves in the vague conception of avenging power. The brilliant position she had longed for, the imagined freedom she would create for herself in marriage, the deliverance from the dull insignificance of her girlhood--all immediately before her; and yet they had come to her hunger like food with the taint of sacrilege upon it, which she must snatch with terror. In the darkness and loneliness of her little bed, her more resistant self could not act against the first onslaught of dread after her irrevocable decision. That unhappy-faced woman and her children--Grandcourt and his relations with her--kept repeating themselves in her imagination like the clinging memory of a disgrace, and gradually obliterated all other thought, leaving only the consciousness that she had taken those scenes into her life. Her long wakefulness seemed a delirium; a faint, faint light penetrated beside the window-curtain; the chillness increased. She could bear it no longer, and cried \"Mamma!\"\n\"Yes, dear,\" said Mrs. Davilow, immediately, in a wakeful voice.\n\"Let me come to you.\"\nShe soon went to sleep on her mother's shoulder, and slept on till late, when, dreaming of a lit-up ball-room, she opened her eyes on her mother standing by the bedside with a small packet in her hand.\n\"I am sorry to wake you, darling, but I thought it better to give you this at once. The groom has brought Criterion; he has come on another horse, and says he is to stay here.\"\nGwendolen sat up in bed and opened the packet. It was a delicate enameled casket, and inside was a splendid diamond ring with a letter which contained a folded bit of colored paper and these words:\nPray wear this ring when I come at twelve in sign of our betrothal. I enclose a check drawn in the name of Mr. Gascoigne, for immediate expenses. Of course Mrs. Davilow will remain at Offendene, at least for some time. I hope, when I come, you will have granted me an early day, when you may begin to command me at a shorter distance.\nYours devotedly,\nH. M. GRANDCOURT.\nThe check was for five hundred pounds, and Gwendolen turned it toward her mother, with the letter.\n\"How very kind and delicate!\" said Mrs. Davilow, with much feeling. \"But I really should like better not to be dependent on a son-in-law. I and the girls could get along very well.\"\n\"Mamma, if you say that again, I will not marry him,\" said Gwendolen, angrily.\n\"My dear child, I trust you are not going to marry only for my sake,\" said Mrs. Davilow, deprecatingly.\nGwendolen tossed her head on the pillow away from her mother, and let the ring lie. She was irritated at this attempt to take away a motive. Perhaps the deeper cause of her irritation was the consciousness that she was not going to marry solely for her mamma's sake--that she was drawn toward the marriage in ways against which stronger reasons than her mother's renunciation were yet not strong enough to hinder her. She had waked up to the signs that she was irrevocably engaged, and all the ugly visions, the alarms, the arguments of the night, must be met by daylight, in which probably they would show themselves weak. \"What I long for is your happiness, dear,\" continued Mrs. Davilow, pleadingly. \"I will not say anything to vex you. Will you not put on the ring?\"\nFor a few moments Gwendolen did not answer, but her thoughts were active. At last she raised herself with a determination to do as she would do if she had started on horseback, and go on with spirit, whatever ideas might be running in her head.\n\"I thought the lover always put on the betrothal ring himself,\" she said laughingly, slipping the ring on her finger, and looking at it with a charming movement of her head. \"I know why he has sent it,\" she added, nodding at her mamma.\n\"Why?\"\n\"He would rather make me put it on than ask me to let him do it. Aha! he is very proud. But so am I. We shall match each other. I should hate a man who went down on his knees, and came fawning on me. He really is not disgusting.\"\n\"That is very moderate praise, Gwen.\"\n\"No, it is not, for a man,\" said Gwendolen gaily. \"But now I must get up and dress. Will you come and do my hair, mamma, dear,\" she went on, drawing down her mamma's face to caress it with her own cheeks, \"and not be so naughty any more as to talk of living in poverty? You must bear to be made comfortable, even if you don't like it. And Mr. Grandcourt behaves perfectly, now, does he not?\"\n\"Certainly he does,\" said Mrs. Davilow, encouraged, and persuaded that after all Gwendolen was fond of her betrothed. She herself thought him a man whose attentions were likely to tell on a girl's feeling. Suitors must often be judged as words are, by the standing and the figure they make in polite society: it is difficult to know much else of them. And all the mother's anxiety turned not on Grandcourt's character, but on Gwendolen's mood in accepting him.\nThe mood was necessarily passing through a new phase this morning. Even in the hour of making her toilet, she had drawn on all the knowledge she had for grounds to justify her marriage. And what she most dwelt on was the determination, that when she was Grandcourt's wife, she would urge him to the most liberal conduct toward Mrs. Glasher's children.\n\"Of what use would it be to her that I should not marry him? He could have married her if he liked; but he did _not_ like. Perhaps she is to blame for that. There must be a great deal about her that I know nothing of. And he must have been good to her in many ways, else she would not have wanted to marry him.\"\nBut that last argument at once began to appear doubtful. Mrs. Glasher naturally wished to exclude other children who would stand between Grandcourt and her own: and Gwendolen's comprehension of this feeling prompted another way of reconciling claims.\n\"Perhaps we shall have no children. I hope we shall not. And he might leave the estate to the pretty little boy. My uncle said that Mr. Grandcourt could do as he liked with the estates. Only when Sir Hugo Mallinger dies there will be enough for two.\"\nThis made Mrs. Glasher appear quite unreasonable in demanding that her boy should be sole heir; and the double property was a security that Grandcourt's marriage would do her no wrong, when the wife was Gwendolen Harleth with all her proud resolution not to be fairly accused. This maiden had been accustomed to think herself blameless; other persons only were faulty.\nIt was striking, that in the hold which this argument of her doing no wrong to Mrs. Glasher had taken on her mind, her repugnance to the idea of Grandcourt's past had sunk into a subordinate feeling. The terror she had felt in the night-watches at overstepping the border of wickedness by doing what she had at first felt to be wrong, had dulled any emotions about his conduct. She was thinking of him, whatever he might be, as a man over whom she was going to have indefinite power; and her loving him having never been a question with her, any agreeableness he had was so much gain. Poor Gwendolen had no awe of unmanageable forces in the state of matrimony, but regarded it as altogether a matter of management, in which she would know how to act. In relation to Grandcourt's past she encouraged new doubts whether he were likely to have differed much from other men; and she devised little schemes for learning what was expected of men in general.\nBut whatever else might be true in the world, her hair was dressed suitably for riding, and she went down in her riding-habit, to avoid delay before getting on horseback. She wanted to have her blood stirred once more with the intoxication of youth, and to recover the daring with which she had been used to think of her course in life. Already a load was lifted off her; for in daylight and activity it was less oppressive to have doubts about her choice, than to feel that she had no choice but to endure insignificance and servitude.\n\"Go back and make yourself look like a duchess, mamma,\" she said, turning suddenly as she was going down-stairs. \"Put your point-lace over your head. I must have you look like a duchess. You must not take things humbly.\"\nWhen Grandcourt raised her left hand gently and looked at the ring, she said gravely, \"It was very good of you to think of everything and send me that packet.\"\n\"You will tell me if there is anything I forget?\" he said, keeping the hand softly within his own. \"I will do anything you wish.\"\n\"But I am very unreasonable in my wishes,\" said Gwendolen, smiling.\n\"Yes, I expect that. Women always are.\"\n\"Then I will not be unreasonable,\" said Gwendolen, taking away her hand and tossing her head saucily. \"I will not be told that I am what women always are.\"\n\"I did not say that,\" said Grandcourt, looking at her with his usual gravity. \"You are what no other woman is.\"\n\"And what is that, pray?\" said Gwendolen, moving to a distance with a little air of menace.\nGrandcourt made his pause before he answered. \"You are the woman I love.\"\n\"Oh, what nice speeches!\" said Gwendolen, laughing. The sense of that love which he must once have given to another woman under strange circumstances was getting familiar.\n\"Give me a nice speech in return. Say when we are to be married.\"\n\"Not yet. Not till we have had a gallop over the downs. I am so thirsty for that, I can think of nothing else. I wish the hunting had begun. Sunday the twentieth, twenty-seventh, Monday, Tuesday.\" Gwendolen was counting on her fingers with the prettiest nod while she looked at Grandcourt, and at last swept one palm over the other while she said triumphantly, \"It will begin in ten days!\"\n\"Let us be married in ten days, then,\" said Grandcourt, \"and we shall not be bored about the stables.\"\n\"What do women always say in answer to that?\" said Gwendolen, mischievously.\n\"They agree to it,\" said the lover, rather off his guard.\n\"Then I will not!\" said Gwendolen, taking up her gauntlets and putting them on, while she kept her eyes on him with gathering fun in them.\nThe scene was pleasant on both sides. A cruder lover would have lost the view of her pretty ways and attitudes, and spoiled all by stupid attempts at caresses, utterly destructive of drama. Grandcourt preferred the drama; and Gwendolen, left at ease, found her spirits rising continually as she played at reigning. Perhaps if Klesmer had seen more of her in this unconscious kind of acting, instead of when she was trying to be theatrical, he might have rated her chance higher.\nWhen they had had a glorious gallop, however, she was in a state of exhilaration that disposed her to think well of hastening the marriage which would make her life all of apiece with this splendid kind of enjoyment. She would not debate any more about an act to which she had committed herself; and she consented to fix the wedding on that day three weeks, notwithstanding the difficulty of fulfilling the customary laws of the _trousseau_.\nLush, of course, was made aware of the engagement by abundant signs, without being formally told. But he expected some communication as a consequence of it, and after a few days he became rather impatient under Grandcourt's silence, feeling sure that the change would affect his personal prospects, and wishing to know exactly how. His tactics no longer included any opposition--which he did not love for its own sake. He might easily cause Grandcourt a great deal of annoyance, but it would be to his own injury, and to create annoyance was not a motive with him. Miss Gwendolen he would certainly not have been sorry to frustrate a little, but--after all there was no knowing what would come. It was nothing new that Grandcourt should show a perverse wilfulness; yet in his freak about this girl he struck Lush rather newly as something like a man who was _fey_--led on by an ominous fatality; and that one born to his fortune should make a worse business of his life than was necessary, seemed really pitiable. Having protested against the marriage, Lush had a second-sight for its evil consequences. Grandcourt had been taking the pains to write letters and give orders himself instead of employing Lush, and appeared to be ignoring his usefulness, even choosing, against the habit of years, to breakfast alone in his dressing-room. But a _tete--tete_ was not to be avoided in a house empty of guests; and Lush hastened to use an opportunity of saying--it was one day after dinner, for there were difficulties in Grandcourt's dining at Offendene,\n\"And when is the marriage to take place?\"\nGrandcourt, who drank little wine, had left the table and was lounging, while he smoked, in an easy chair near the hearth, where a fire of oak boughs was gaping to its glowing depths, and edging them with a delicate tint of ashes delightful to behold. The chair of red-brown velvet brocade was a becoming back-ground for his pale-tinted, well-cut features and exquisite long hands. Omitting the cigar, you might have imagined him a portrait by Moroni, who would have rendered wonderfully the impenetrable gaze and air of distinction; and a portrait by that great master would have been quite as lively a companion as Grandcourt was disposed to be. But he answered without unusual delay.\n\"On the tenth.\"\n\"I suppose you intend to remain here.\"\n\"We shall go to Ryelands for a little while; but we shall return here for the sake of the hunting.\"\nAfter this word there was the languid inarticulate sound frequent with Grandcourt when he meant to continue speaking, and Lush waited for something more. Nothing came, and he was going to put another question, when the inarticulate sound began again and introduced the mildly uttered suggestion,\n\"You had better make some new arrangement for yourself.\"\n\"What! I am to cut and run?\" said Lush, prepared to be good-tempered on the occasion.\n\"Something of that kind.\"\n\"The bride objects to me. I hope she will make up to you for the want of my services.\"\n\"I can't help your being so damnably disagreeable to women,\" said Grandcourt, in soothing apology.\n\"To one woman, if you please.\"\n\"It makes no difference since she is the one in question.\"\n\"I suppose I am not to be turned adrift after fifteen years without some provision.\"\n\"You must have saved something out of me.\"\n\"Deuced little. I have often saved something for you.\"\n\"You can have three hundred a year. But you must live in town and be ready to look after things when I want you. I shall be rather hard up.\"\n\"If you are not going to be at Ryelands this winter, I might run down there and let you know how Swinton goes on.\"\n\"If you like. I don't care a toss where you are, so that you keep out of sight.\"\n\"Much obliged,\" said Lush, able to take the affair more easily than he had expected. He was supported by the secret belief that he should by-and-by be wanted as much as ever.\n\"Perhaps you will not object to packing up as soon as possible,\" said Grandcourt. \"The Torringtons are coming, and Miss Harleth will be riding over here.\"\n\"With all my heart. Can't I be of use in going to Gadsmere?\"\n\"No. I am going myself.\"\n\"About your being rather hard up. Have you thought of that plan--\"\n\"Just leave me alone, will you?\" said Grandcourt, in his lowest audible tone, tossing his cigar into the fire, and rising to walk away.\nHe spent the evening in the solitude of the smaller drawing-room, where, with various new publications on the table of the kind a gentleman may like to have on hand without touching, he employed himself (as a philosopher might have done) in sitting meditatively on the sofa and abstaining from literature--political, comic, cynical, or romantic. In this way hours may pass surprisingly soon, without the arduous invisible chase of philosophy; not from love of thought, but from hatred of effort--from a state of the inward world, something like premature age, where the need for action lapses into a mere image of what has been, is, and may or might be; where impulse is born and dies in a phantasmal world, pausing in rejection of even a shadowy fulfillment. That is a condition which often comes with whitening hair; and sometimes, too, an intense obstinacy and tenacity of rule, like the main trunk of an exorbitant egoism, conspicuous in proportion as the varied susceptibilities of younger years are stripped away.\nBut Grandcourt's hair, though he had not much of it, was of a fine, sunny blonde, and his moods were not entirely to be explained as ebbing energy. We mortals have a strange spiritual chemistry going on within us, so that a lazy stagnation or even a cottony milkiness may be preparing one knows not what biting or explosive material. The navvy waking from sleep and without malice heaving a stone to crush the life out of his still sleeping comrade, is understood to lack the trained motive which makes a character fairly calculable in its actions; but by a roundabout course even a gentleman may make of himself a chancy personage, raising an uncertainty as to what he may do next, that sadly spoils companionship.\nGrandcourt's thoughts this evening were like the circlets one sees in a dark pool, continually dying out and continually started again by some impulse from below the surface. The deeper central impulse came from the image of Gwendolen; but the thoughts it stirred would be imperfectly illustrated by a reference to the amatory poets of all ages. It was characteristic that he got none of his satisfaction from the belief that Gwendolen was in love with him; and that love had overcome the jealous resentment which had made her run away from him. On the contrary, he believed that this girl was rather exceptional in the fact that, in spite of his assiduous attention to her, she was not in love with him; and it seemed to him very likely that if it had not been for the sudden poverty which had come over her family, she would not have accepted him. From the very first there had been an exasperating fascination in the tricksiness with which she had--not met his advances, but--wheeled away from them. She had been brought to accept him in spite of everything--brought to kneel down like a horse under training for the arena, though she might have an objection to it all the while. On the whole, Grandcourt got more pleasure out of this notion than he could have done out of winning a girl of whom he was sure that she had a strong inclination for him personally. And yet this pleasure in mastering reluctance flourished along with the habitual persuasion that no woman whom he favored could be quite indifferent to his personal influence; and it seemed to him not unlikely that by-and-by Gwendolen might be more enamored of him than he of her. In any case, she would have to submit; and he enjoyed thinking of her as his future wife, whose pride and spirit were suited to command every one but himself. He had no taste for a woman who was all tenderness to him, full of petitioning solicitude and willing obedience. He meant to be master of a woman who would have liked to master him, and who perhaps would have been capable of mastering another man.\nLush, having failed in his attempted reminder to Grandcourt, thought it well to communicate with Sir Hugo, in whom, as a man having perhaps interest enough to command the bestowal of some place where the work was light, gentlemanly, and not ill-paid, he was anxious to cultivate a sense of friendly obligation, not feeling at all secure against the future need of such a place. He wrote the following letter, and addressed it to Park Lane, whither he knew the family had returned from Leubronn:\nMY DEAR SIR HUGO--Since we came home the marriage has been absolutely decided on, and is to take place in less than three weeks. It is so far the worse for him that her mother has lately lost all her fortune, and he will have to find supplies. Grandcourt, I know, is feeling the want of cash; and unless some other plan is resorted to, he will be raising money in a foolish way. I am going to leave Diplow immediately, and I shall not be able to start the topic. What I should advise is, that Mr. Deronda, who I know has your confidence, should propose to come and pay a short visit here, according to invitation (there are going to be other people in the house), and that you should put him fully in possession of your wishes and the possible extent of your offer. Then, that he should introduce the subject to Grandcourt so as not to imply that you suspect any particular want of money on his part, but only that there is a strong wish on yours. What I have formerly said to him has been in the way of a conjecture that you might be willing to give a good sum for his chance of Diplow; but if Mr. Deronda came armed with a definite offer, that would take another sort of hold. Ten to one he will not close for some time to come; but the proposal will have got a stronger lodgment in his mind; and though at present he has a great notion of the hunting here, I see a likelihood, under the circumstances, that he will get a distaste for the neighborhood, and there will be the notion of the money sticking by him without being urged. I would bet on your ultimate success. As I am not to be exiled to Siberia, but am to be within call, it is possible that, by and by, I may be of more service to you. But at present I can think of no medium so good as Mr. Deronda. Nothing puts Grandcourt in worse humor than having the lawyers thrust their paper under his nose uninvited.\nTrusting that your visit to Leubronn has put you in excellent condition for the winter, I remain, my dear Sir Hugo,\nYours very faithfully,\nTHOMAS CRANMER LUSH.\nSir Hugo, having received this letter at breakfast, handed it to Deronda, who, though he had chambers in town, was somehow hardly ever in them, Sir Hugo not being contented without him. The chatty baronet would have liked a young companion even if there had been no peculiar reasons for attachment between them: one with a fine harmonious unspoiled face fitted to keep up a cheerful view of posterity and inheritance generally, notwithstanding particular disappointments; and his affection for Deronda was not diminished by the deep-lying though not obtrusive difference in their notions and tastes. Perhaps it was all the stronger; acting as the same sort of difference does between a man and a woman in giving a piquancy to the attachment which subsists in spite of it. Sir Hugo did not think unapprovingly of himself; but he looked at men and society from a liberal-menagerie point of view, and he had a certain pride in Deronda's differing from him, which, if it had found voice, might have said--\"You see this fine young fellow--not such as you see every day, is he?--he belongs to me in a sort of way. I brought him up from a child; but you would not ticket him off easily, he has notions of his own, and he's as far as the poles asunder from what I was at his age.\" This state of feeling was kept up by the mental balance in Deronda, who was moved by an affectionateness such as we are apt to call feminine, disposing him to yield in ordinary details, while he had a certain inflexibility of judgment, and independence of opinion, held to be rightfully masculine.\nWhen he had read the letter, he returned it without speaking, inwardly wincing under Lush's mode of attributing a neutral usefulness to him in the family affairs.\n\"What do you say, Dan? It would be pleasant enough for you. You have not seen the place for a good many years now, and you might have a famous run with the harriers if you went down next week,\" said Sir Hugo.\n\"I should not go on that account,\" said Deronda, buttering his bread attentively. He had an objection to this transparent kind of persuasiveness, which all intelligent animals are seen to treat with indifference. If he went to Diplow he should be doing something disagreeable to oblige Sir Hugo.\n\"I think Lush's notion is a good one. And it would be a pity to lose the occasion.\"\n\"That is a different matter--if you think my going of importance to your object,\" said Deronda, still with that aloofness of manner which implied some suppression. He knew that the baronet had set his heart on the affair.\n\"Why, you will see the fair gambler, the Leubronn Diana, I shouldn't wonder,\" said Sir Hugo, gaily. \"We shall have to invite her to the Abbey, when they are married,\" he added, turning to Lady Mallinger, as if she too had read the letter.\n\"I cannot conceive whom you mean,\" said Lady Mallinger, who in fact had not been listening, her mind having been taken up with her first sips of coffee, the objectionable cuff of her sleeve, and the necessity of carrying Theresa to the dentist--innocent and partly laudable preoccupations, as the gentle lady's usually were. Should her appearance be inquired after, let it be said that she had reddish blonde hair (the hair of the period), a small Roman nose, rather prominent blue eyes and delicate eyelids, with a figure which her thinner friends called fat, her hands showing curves and dimples like a magnified baby's.\n\"I mean that Grandcourt is going to marry the girl you saw at Leubronn--don't you remember her--the Miss Harleth who used to play at roulette.\"\n\"Dear me! Is that a good match for him?\"\n\"That depends on the sort of goodness he wants,\" said Sir Hugo, smiling. \"However, she and her friends have nothing, and she will bring him expenses. It's a good match for my purposes, because if I am willing to fork out a sum of money, he may be willing to give up his chance of Diplow, so that we shall have it out and out, and when I die you will have the consolation of going to the place you would like to go to--wherever I may go.\"\n\"I wish you would not talk of dying in that light way, dear.\"\n\"It's rather a heavy way, Lou, for I shall have to pay a heavy sum--forty thousand, at least.\"\n\"But why are we to invite them to the Abbey?\" said Lady Mallinger. \"I do _not_ like women who gamble, like Lady Cragstone.\"\n\"Oh, you will not mind her for a week. Besides, she is not like Lady Cragstone because she gambled a little, any more than I am like a broker because I'm a Whig. I want to keep Grandcourt in good humor, and to let him see plenty of this place, that he may think the less of Diplow. I don't know yet whether I shall get him to meet me in this matter. And if Dan were to go over on a visit there, he might hold out the bait to him. It would be doing me a great service.\" This was meant for Deronda.\n\"Daniel is not fond of Mr. Grandcourt, I think, is he?\" said Lady Mallinger, looking at Deronda inquiringly.\n\"There is no avoiding everybody one doesn't happen to be fond of,\" said Deronda. \"I will go to Diplow--I don't know that I have anything better to do--since Sir Hugo wishes it.\"\n\"That's a trump!\" said Sir Hugo, well pleased. \"And if you don't find it very pleasant, it's so much experience. Nothing used to come amiss to me when I was young. You must see men and manners.\"\n\"Yes; but I have seen that man, and something of his manners too,\" said Deronda.\n\"Not nice manners, I think,\" said Lady Mallinger.\n\"Well, you see they succeed with your sex,\" said Sir Hugo, provokingly. \"And he was an uncommonly good-looking fellow when he was two or three and twenty--like his father. He doesn't take after his father in marrying the heiress, though. If he had got Miss Arrowpoint and my land too, confound him, he would have had a fine principality.\"\nDeronda, in anticipating the projected visit, felt less disinclination than when consenting to it. The story of that girl's marriage did interest him: what he had heard through Lush of her having run away from the suit of the man she was now going to take as a husband, had thrown a new sort of light on her gambling; and it was probably the transition from that fevered worldliness into poverty which had urged her acceptance where she must in some way have felt repulsion. All this implied a nature liable to difficulty and struggle--elements of life which had a predominant attraction for his sympathy, due perhaps to his early pain in dwelling on the conjectured story of his own existence. Persons attracted him, as Hans Meyrick had done, in proportion to the possibility of his defending them, rescuing them, telling upon their lives with some sort of redeeming influence; and he had to resist an inclination, easily accounted for, to withdraw coldly from the fortunate. But in the movement which had led him to repurchase Gwendolen's necklace for her, and which was at work in him still, there was something beyond his habitual compassionate fervor--something due to the fascination of her womanhood. He was very open to that sort of charm, and mingled it with the consciously Utopian pictures of his own future; yet any one able to trace the folds of his character might have conceived that he would be more likely than many less passionate men to love a woman without telling her of it. Sprinkle food before a delicate-eared bird: there is nothing he would more willingly take, yet he keeps aloof, because of his sensibility to checks which to you are imperceptible. And one man differs from another, as we all differ from the Bosjesman, in a sensibility to checks, that come from variety of needs, spiritual or other. It seemed to foreshadow that capability of reticence in Deronda that his imagination was much occupied with two women, to neither of whom would he have held it possible that he should ever make love. Hans Meyrick had laughed at him for having something of the knight-errant in his disposition; and he would have found his proof if he had known what was just now going on in Deronda's mind about Mirah and Gwendolen.\nDeronda wrote without delay to announce his visit to Diplow, and received in reply a polite assurance that his coming would give great pleasure. That was not altogether untrue. Grandcourt thought it probable that the visit was prompted by Sir Hugo's desire to court him for a purpose which he did not make up his mind to resist; and it was not a disagreeable idea to him that this fine fellow, whom he believed to be his cousin under the rose, would witness, perhaps with some jealousy, Henleigh Mallinger Grandcourt play the commanding part of betrothed lover to a splendid girl whom the cousin had already looked at with admiration.\nGrandcourt himself was not jealous of anything unless it threatened his mastery--which he did not think himself likely to lose.",
        "paragraph_chars": [
            [
                0,
                107
            ],
            [
                107,
                284
            ],
            [
                284,
                665
            ],
            [
                665,
                863
            ],
            [
                863,
                1373
            ],
            [
                1373,
                1514
            ],
            [
                1514,
                2851
            ],
            [
                2851,
                2949
            ],
            [
                2949,
                3425
            ],
            [
                3425,
                3867
            ],
            [
                3867,
                4387
            ],
            [
                4387,
                4689
            ],
            [
                4689,
                7695
            ],
            [
                7695,
                7760
            ],
            [
                7760,
                7782
            ],
            [
                7782,
                7984
            ],
            [
                7984,
                8161
            ],
            [
                8161,
                8359
            ],
            [
                8359,
                8694
            ],
            [
                8694,
                8711
            ],
            [
                8711,
                8729
            ],
            [
                8729,
                8828
            ],
            [
                8828,
                9010
            ],
            [
                9010,
                9089
            ],
            [
                9089,
                9193
            ],
            [
                9193,
                9964
            ],
            [
                9964,
                10209
            ],
            [
                10209,
                10445
            ],
            [
                10445,
                10452
            ],
            [
                10452,
                10682
            ],
            [
                10682,
                10720
            ],
            [
                10720,
                11112
            ],
            [
                11112,
                11573
            ],
            [
                11573,
                11925
            ],
            [
                11925,
                12237
            ],
            [
                12237,
                12488
            ],
            [
                12488,
                12739
            ],
            [
                12739,
                13108
            ],
            [
                13108,
                14060
            ],
            [
                14060,
                14597
            ],
            [
                14597,
                14818
            ],
            [
                14818,
                14978
            ],
            [
                14978,
                15108
            ],
            [
                15108,
                15176
            ],
            [
                15176,
                15216
            ],
            [
                15216,
                15372
            ],
            [
                15372,
                15484
            ],
            [
                15484,
                15576
            ],
            [
                15576,
                15650
            ],
            [
                15650,
                15822
            ],
            [
                15822,
                15888
            ],
            [
                15888,
                16278
            ],
            [
                16278,
                16381
            ],
            [
                16381,
                16458
            ],
            [
                16458,
                16516
            ],
            [
                16516,
                16655
            ],
            [
                16655,
                17134
            ],
            [
                17134,
                17576
            ],
            [
                17576,
                19127
            ],
            [
                19127,
                19169
            ],
            [
                19169,
                19856
            ],
            [
                19856,
                19872
            ],
            [
                19872,
                19911
            ],
            [
                19911,
                20011
            ],
            [
                20011,
                20307
            ],
            [
                20307,
                20364
            ],
            [
                20364,
                20450
            ],
            [
                20450,
                20476
            ],
            [
                20476,
                20563
            ],
            [
                20563,
                20662
            ],
            [
                20662,
                20693
            ],
            [
                20693,
                20752
            ],
            [
                20752,
                20837
            ],
            [
                20837,
                20880
            ],
            [
                20880,
                20935
            ],
            [
                20935,
                21076
            ],
            [
                21076,
                21191
            ],
            [
                21191,
                21272
            ],
            [
                21272,
                21447
            ],
            [
                21447,
                21602
            ],
            [
                21602,
                21663
            ],
            [
                21663,
                21688
            ],
            [
                21688,
                21755
            ],
            [
                21755,
                21891
            ],
            [
                21891,
                22911
            ],
            [
                22911,
                23627
            ],
            [
                23627,
                25680
            ],
            [
                25680,
                26175
            ],
            [
                26175,
                28047
            ],
            [
                28047,
                28163
            ],
            [
                28163,
                28186
            ],
            [
                28186,
                28207
            ],
            [
                28207,
                29778
            ],
            [
                29778,
                29941
            ],
            [
                29941,
                30150
            ],
            [
                30150,
                30446
            ],
            [
                30446,
                30530
            ],
            [
                30530,
                30752
            ],
            [
                30752,
                30991
            ],
            [
                30991,
                31614
            ],
            [
                31614,
                31758
            ],
            [
                31758,
                31799
            ],
            [
                31799,
                32237
            ],
            [
                32237,
                32299
            ],
            [
                32299,
                32394
            ],
            [
                32394,
                32518
            ],
            [
                32518,
                33015
            ],
            [
                33015,
                33124
            ],
            [
                33124,
                33302
            ],
            [
                33302,
                33497
            ],
            [
                33497,
                33578
            ],
            [
                33578,
                33628
            ],
            [
                33628,
                33967
            ],
            [
                33967,
                36211
            ],
            [
                36211,
                36846
            ],
            [
                36846,
                36973
            ]
        ],
        "segment_chars": [
            [
                0,
                87
            ],
            [
                87,
                107
            ],
            [
                107,
                284
            ],
            [
                284,
                375
            ],
            [
                375,
                456
            ],
            [
                456,
                576
            ],
            [
                576,
                665
            ],
            [
                665,
                863
            ],
            [
                863,
                1157
            ],
            [
                1157,
                1249
            ],
            [
                1249,
                1340
            ],
            [
                1340,
                1373
            ],
            [
                1373,
                1449
            ],
            [
                1449,
                1514
            ],
            [
                1514,
                1676
            ],
            [
                1676,
                1823
            ],
            [
                1823,
                2019
            ],
            [
                2019,
                2205
            ],
            [
                2205,
                2260
            ],
            [
                2260,
                2565
            ],
            [
                2565,
                2681
            ],
            [
                2681,
                2851
            ],
            [
                2851,
                2949
            ],
            [
                2949,
                3066
            ],
            [
                3066,
                3128
            ],
            [
                3128,
                3215
            ],
            [
                3215,
                3344
            ],
            [
                3344,
                3383
            ],
            [
                3383,
                3425
            ],
            [
                3425,
                3545
            ],
            [
                3545,
                3810
            ],
            [
                3810,
                3867
            ],
            [
                3867,
                3950
            ],
            [
                3950,
                4017
            ],
            [
                4017,
                4131
            ],
            [
                4131,
                4179
            ],
            [
                4179,
                4352
            ],
            [
                4352,
                4387
            ],
            [
                4387,
                4434
            ],
            [
                4434,
                4487
            ],
            [
                4487,
                4548
            ],
            [
                4548,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4797
            ],
            [
                4797,
                4904
            ],
            [
                4904,
                5065
            ],
            [
                5065,
                5308
            ],
            [
                5308,
                5442
            ],
            [
                5442,
                5582
            ],
            [
                5582,
                5784
            ],
            [
                5784,
                5963
            ],
            [
                5963,
                6042
            ],
            [
                6042,
                6317
            ],
            [
                6317,
                6762
            ],
            [
                6762,
                7076
            ],
            [
                7076,
                7233
            ],
            [
                7233,
                7523
            ],
            [
                7523,
                7647
            ],
            [
                7647,
                7695
            ],
            [
                7695,
                7760
            ],
            [
                7760,
                7782
            ],
            [
                7782,
                7984
            ],
            [
                7984,
                8068
            ],
            [
                8068,
                8161
            ],
            [
                8161,
                8208
            ],
            [
                8208,
                8359
            ],
            [
                8359,
                8427
            ],
            [
                8427,
                8505
            ],
            [
                8505,
                8578
            ],
            [
                8578,
                8694
            ],
            [
                8694,
                8711
            ],
            [
                8711,
                8729
            ],
            [
                8729,
                8828
            ],
            [
                8828,
                8858
            ],
            [
                8858,
                8896
            ],
            [
                8896,
                8966
            ],
            [
                8966,
                9010
            ],
            [
                9010,
                9089
            ],
            [
                9089,
                9193
            ],
            [
                9193,
                9277
            ],
            [
                9277,
                9334
            ],
            [
                9334,
                9611
            ],
            [
                9611,
                9817
            ],
            [
                9817,
                9896
            ],
            [
                9896,
                9933
            ],
            [
                9933,
                9964
            ],
            [
                9964,
                10038
            ],
            [
                10038,
                10209
            ],
            [
                10209,
                10383
            ],
            [
                10383,
                10445
            ],
            [
                10445,
                10452
            ],
            [
                10452,
                10517
            ],
            [
                10517,
                10522
            ],
            [
                10522,
                10540
            ],
            [
                10540,
                10553
            ],
            [
                10553,
                10580
            ],
            [
                10580,
                10652
            ],
            [
                10652,
                10682
            ],
            [
                10682,
                10720
            ],
            [
                10720,
                10770
            ],
            [
                10770,
                10804
            ],
            [
                10804,
                10990
            ],
            [
                10990,
                11055
            ],
            [
                11055,
                11112
            ],
            [
                11112,
                11230
            ],
            [
                11230,
                11318
            ],
            [
                11318,
                11464
            ],
            [
                11464,
                11573
            ],
            [
                11573,
                11640
            ],
            [
                11640,
                11759
            ],
            [
                11759,
                11925
            ],
            [
                11925,
                11986
            ],
            [
                11986,
                12048
            ],
            [
                12048,
                12082
            ],
            [
                12082,
                12143
            ],
            [
                12143,
                12237
            ],
            [
                12237,
                12294
            ],
            [
                12294,
                12488
            ],
            [
                12488,
                12524
            ],
            [
                12524,
                12545
            ],
            [
                12545,
                12601
            ],
            [
                12601,
                12674
            ],
            [
                12674,
                12739
            ],
            [
                12739,
                13016
            ],
            [
                13016,
                13108
            ],
            [
                13108,
                13308
            ],
            [
                13308,
                13486
            ],
            [
                13486,
                13693
            ],
            [
                13693,
                13859
            ],
            [
                13859,
                14060
            ],
            [
                14060,
                14231
            ],
            [
                14231,
                14397
            ],
            [
                14397,
                14597
            ],
            [
                14597,
                14710
            ],
            [
                14710,
                14747
            ],
            [
                14747,
                14784
            ],
            [
                14784,
                14818
            ],
            [
                14818,
                14978
            ],
            [
                14978,
                15028
            ],
            [
                15028,
                15077
            ],
            [
                15077,
                15108
            ],
            [
                15108,
                15176
            ],
            [
                15176,
                15197
            ],
            [
                15197,
                15216
            ],
            [
                15216,
                15318
            ],
            [
                15318,
                15372
            ],
            [
                15372,
                15450
            ],
            [
                15450,
                15484
            ],
            [
                15484,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15622
            ],
            [
                15622,
                15650
            ],
            [
                15650,
                15676
            ],
            [
                15676,
                15702
            ],
            [
                15702,
                15822
            ],
            [
                15822,
                15856
            ],
            [
                15856,
                15888
            ],
            [
                15888,
                15898
            ],
            [
                15898,
                15944
            ],
            [
                15944,
                15999
            ],
            [
                15999,
                16029
            ],
            [
                16029,
                16085
            ],
            [
                16085,
                16278
            ],
            [
                16278,
                16381
            ],
            [
                16381,
                16427
            ],
            [
                16427,
                16458
            ],
            [
                16458,
                16516
            ],
            [
                16516,
                16535
            ],
            [
                16535,
                16655
            ],
            [
                16655,
                16693
            ],
            [
                16693,
                16845
            ],
            [
                16845,
                16970
            ],
            [
                16970,
                17134
            ],
            [
                17134,
                17351
            ],
            [
                17351,
                17576
            ],
            [
                17576,
                17674
            ],
            [
                17674,
                17908
            ],
            [
                17908,
                17995
            ],
            [
                17995,
                18141
            ],
            [
                18141,
                18271
            ],
            [
                18271,
                18590
            ],
            [
                18590,
                18680
            ],
            [
                18680,
                18913
            ],
            [
                18913,
                19127
            ],
            [
                19127,
                19169
            ],
            [
                19169,
                19421
            ],
            [
                19421,
                19551
            ],
            [
                19551,
                19817
            ],
            [
                19817,
                19856
            ],
            [
                19856,
                19872
            ],
            [
                19872,
                19911
            ],
            [
                19911,
                20011
            ],
            [
                20011,
                20165
            ],
            [
                20165,
                20307
            ],
            [
                20307,
                20364
            ],
            [
                20364,
                20371
            ],
            [
                20371,
                20393
            ],
            [
                20393,
                20450
            ],
            [
                20450,
                20476
            ],
            [
                20476,
                20502
            ],
            [
                20502,
                20563
            ],
            [
                20563,
                20662
            ],
            [
                20662,
                20693
            ],
            [
                20693,
                20752
            ],
            [
                20752,
                20837
            ],
            [
                20837,
                20880
            ],
            [
                20880,
                20896
            ],
            [
                20896,
                20935
            ],
            [
                20935,
                20971
            ],
            [
                20971,
                21048
            ],
            [
                21048,
                21076
            ],
            [
                21076,
                21191
            ],
            [
                21191,
                21205
            ],
            [
                21205,
                21272
            ],
            [
                21272,
                21357
            ],
            [
                21357,
                21447
            ],
            [
                21447,
                21529
            ],
            [
                21529,
                21602
            ],
            [
                21602,
                21622
            ],
            [
                21622,
                21663
            ],
            [
                21663,
                21668
            ],
            [
                21668,
                21688
            ],
            [
                21688,
                21722
            ],
            [
                21722,
                21755
            ],
            [
                21755,
                21788
            ],
            [
                21788,
                21891
            ],
            [
                21891,
                22237
            ],
            [
                22237,
                22651
            ],
            [
                22651,
                22911
            ],
            [
                22911,
                23059
            ],
            [
                23059,
                23245
            ],
            [
                23245,
                23627
            ],
            [
                23627,
                23802
            ],
            [
                23802,
                23973
            ],
            [
                23973,
                24173
            ],
            [
                24173,
                24477
            ],
            [
                24477,
                24630
            ],
            [
                24630,
                24810
            ],
            [
                24810,
                24992
            ],
            [
                24992,
                25273
            ],
            [
                25273,
                25432
            ],
            [
                25432,
                25545
            ],
            [
                25545,
                25680
            ],
            [
                25680,
                26058
            ],
            [
                26058,
                26175
            ],
            [
                26175,
                26304
            ],
            [
                26304,
                26419
            ],
            [
                26419,
                26554
            ],
            [
                26554,
                26638
            ],
            [
                26638,
                26941
            ],
            [
                26941,
                27123
            ],
            [
                27123,
                27354
            ],
            [
                27354,
                27709
            ],
            [
                27709,
                27747
            ],
            [
                27747,
                27875
            ],
            [
                27875,
                27939
            ],
            [
                27939,
                28047
            ],
            [
                28047,
                28163
            ],
            [
                28163,
                28186
            ],
            [
                28186,
                28207
            ],
            [
                28207,
                28393
            ],
            [
                28393,
                28807
            ],
            [
                28807,
                28979
            ],
            [
                28979,
                29315
            ],
            [
                29315,
                29480
            ],
            [
                29480,
                29778
            ],
            [
                29778,
                29941
            ],
            [
                29941,
                29964
            ],
            [
                29964,
                30001
            ],
            [
                30001,
                30150
            ],
            [
                30150,
                30232
            ],
            [
                30232,
                30363
            ],
            [
                30363,
                30446
            ],
            [
                30446,
                30484
            ],
            [
                30484,
                30530
            ],
            [
                30530,
                30694
            ],
            [
                30694,
                30752
            ],
            [
                30752,
                30852
            ],
            [
                30852,
                30991
            ],
            [
                30991,
                31316
            ],
            [
                31316,
                31614
            ],
            [
                31614,
                31758
            ],
            [
                31758,
                31768
            ],
            [
                31768,
                31799
            ],
            [
                31799,
                31872
            ],
            [
                31872,
                31949
            ],
            [
                31949,
                32237
            ],
            [
                32237,
                32299
            ],
            [
                32299,
                32394
            ],
            [
                32394,
                32440
            ],
            [
                32440,
                32461
            ],
            [
                32461,
                32518
            ],
            [
                32518,
                32557
            ],
            [
                32557,
                32680
            ],
            [
                32680,
                32800
            ],
            [
                32800,
                32868
            ],
            [
                32868,
                32948
            ],
            [
                32948,
                32987
            ],
            [
                32987,
                33015
            ],
            [
                33015,
                33071
            ],
            [
                33071,
                33124
            ],
            [
                33124,
                33205
            ],
            [
                33205,
                33302
            ],
            [
                33302,
                33320
            ],
            [
                33320,
                33349
            ],
            [
                33349,
                33415
            ],
            [
                33415,
                33466
            ],
            [
                33466,
                33497
            ],
            [
                33497,
                33578
            ],
            [
                33578,
                33628
            ],
            [
                33628,
                33700
            ],
            [
                33700,
                33800
            ],
            [
                33800,
                33866
            ],
            [
                33866,
                33967
            ],
            [
                33967,
                34066
            ],
            [
                34066,
                34442
            ],
            [
                34442,
                34662
            ],
            [
                34662,
                34944
            ],
            [
                34944,
                35175
            ],
            [
                35175,
                35463
            ],
            [
                35463,
                35643
            ],
            [
                35643,
                35795
            ],
            [
                35795,
                35995
            ],
            [
                35995,
                36211
            ],
            [
                36211,
                36356
            ],
            [
                36356,
                36388
            ],
            [
                36388,
                36846
            ],
            [
                36846,
                36973
            ]
        ],
        "overlap_chars": [
            [
                142,
                145
            ],
            [
                156,
                190
            ],
            [
                191,
                216
            ],
            [
                230,
                235
            ],
            [
                252,
                284
            ],
            [
                284,
                317
            ],
            [
                355,
                375
            ],
            [
                375,
                412
            ],
            [
                418,
                456
            ],
            [
                456,
                491
            ],
            [
                502,
                508
            ],
            [
                517,
                574
            ],
            [
                589,
                592
            ],
            [
                621,
                664
            ],
            [
                793,
                806
            ],
            [
                829,
                839
            ],
            [
                709,
                711
            ],
            [
                747,
                748
            ],
            [
                667,
                668
            ],
            [
                691,
                703
            ],
            [
                688,
                690
            ],
            [
                735,
                746
            ],
            [
                861,
                863
            ],
            [
                863,
                864
            ],
            [
                875,
                883
            ],
            [
                904,
                922
            ],
            [
                929,
                942
            ],
            [
                950,
                953
            ],
            [
                946,
                949
            ],
            [
                1004,
                1018
            ],
            [
                1063,
                1138
            ],
            [
                1155,
                1157
            ],
            [
                1157,
                1199
            ],
            [
                1247,
                1249
            ],
            [
                1249,
                1340
            ],
            [
                1340,
                1373
            ],
            [
                1373,
                1382
            ],
            [
                1390,
                1449
            ],
            [
                1449,
                1514
            ],
            [
                1514,
                1555
            ],
            [
                1674,
                1676
            ],
            [
                1693,
                1699
            ],
            [
                1687,
                1688
            ],
            [
                1718,
                1759
            ],
            [
                1785,
                1817
            ],
            [
                1821,
                1823
            ],
            [
                1840,
                1889
            ],
            [
                1999,
                2000
            ],
            [
                1891,
                1894
            ],
            [
                1918,
                1927
            ],
            [
                1932,
                1996
            ],
            [
                2017,
                2019
            ],
            [
                2205,
                2259
            ],
            [
                2851,
                2949
            ],
            [
                2949,
                3064
            ],
            [
                3078,
                3087
            ],
            [
                3070,
                3074
            ],
            [
                3126,
                3128
            ],
            [
                3128,
                3162
            ],
            [
                3213,
                3215
            ],
            [
                3215,
                3268
            ],
            [
                3425,
                3480
            ],
            [
                3484,
                3545
            ],
            [
                4392,
                4411
            ],
            [
                4416,
                4420
            ],
            [
                4491,
                4548
            ],
            [
                4548,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4783
            ],
            [
                4795,
                4797
            ],
            [
                4797,
                4804
            ],
            [
                4810,
                4816
            ],
            [
                4875,
                4878
            ],
            [
                4829,
                4871
            ],
            [
                4902,
                4904
            ],
            [
                4904,
                4910
            ],
            [
                4923,
                4926
            ],
            [
                4940,
                4966
            ],
            [
                4969,
                4974
            ],
            [
                4990,
                5046
            ],
            [
                5063,
                5064
            ],
            [
                5065,
                5114
            ],
            [
                5124,
                5152
            ],
            [
                5180,
                5226
            ],
            [
                5238,
                5269
            ],
            [
                5306,
                5308
            ],
            [
                5308,
                5442
            ],
            [
                5442,
                5445
            ],
            [
                5461,
                5502
            ],
            [
                5503,
                5510
            ],
            [
                5580,
                5582
            ],
            [
                5629,
                5630
            ],
            [
                5677,
                5748
            ],
            [
                5762,
                5766
            ],
            [
                5782,
                5784
            ],
            [
                5807,
                5850
            ],
            [
                5868,
                5874
            ],
            [
                5798,
                5801
            ],
            [
                5874,
                5926
            ],
            [
                5940,
                5962
            ],
            [
                5963,
                5966
            ],
            [
                5995,
                6042
            ],
            [
                6042,
                6090
            ],
            [
                6103,
                6106
            ],
            [
                6111,
                6175
            ],
            [
                6230,
                6297
            ],
            [
                6315,
                6317
            ],
            [
                6317,
                6364
            ],
            [
                6369,
                6408
            ],
            [
                6433,
                6440
            ],
            [
                6459,
                6477
            ],
            [
                6536,
                6543
            ],
            [
                6556,
                6569
            ],
            [
                6420,
                6423
            ],
            [
                6570,
                6731
            ],
            [
                6743,
                6762
            ],
            [
                6762,
                6825
            ],
            [
                6913,
                6915
            ],
            [
                6858,
                6888
            ],
            [
                6893,
                6912
            ],
            [
                6930,
                6933
            ],
            [
                6971,
                7076
            ],
            [
                7233,
                7274
            ],
            [
                7315,
                7319
            ],
            [
                7341,
                7359
            ],
            [
                7398,
                7443
            ],
            [
                7521,
                7523
            ],
            [
                7523,
                7570
            ],
            [
                7578,
                7594
            ],
            [
                7602,
                7647
            ],
            [
                7647,
                7695
            ],
            [
                7695,
                7738
            ],
            [
                7745,
                7752
            ],
            [
                7758,
                7760
            ],
            [
                7760,
                7782
            ],
            [
                7782,
                7984
            ],
            [
                7984,
                8068
            ],
            [
                8068,
                8099
            ],
            [
                8158,
                8161
            ],
            [
                8161,
                8208
            ],
            [
                8208,
                8228
            ],
            [
                8235,
                8320
            ],
            [
                8336,
                8359
            ],
            [
                8359,
                8427
            ],
            [
                8427,
                8438
            ],
            [
                8481,
                8505
            ],
            [
                8505,
                8578
            ],
            [
                8578,
                8694
            ],
            [
                8694,
                8711
            ],
            [
                8711,
                8727
            ],
            [
                8729,
                8732
            ],
            [
                8739,
                8766
            ],
            [
                8826,
                8828
            ],
            [
                8828,
                8858
            ],
            [
                8858,
                8881
            ],
            [
                8887,
                8896
            ],
            [
                8896,
                8902
            ],
            [
                8910,
                8916
            ],
            [
                8929,
                8966
            ],
            [
                8966,
                9010
            ],
            [
                9010,
                9089
            ],
            [
                9089,
                9193
            ],
            [
                9193,
                9218
            ],
            [
                9253,
                9254
            ],
            [
                9285,
                9334
            ],
            [
                9334,
                9411
            ],
            [
                9473,
                9498
            ],
            [
                9530,
                9537
            ],
            [
                9438,
                9458
            ],
            [
                9609,
                9611
            ],
            [
                9611,
                9620
            ],
            [
                9628,
                9634
            ],
            [
                9641,
                9678
            ],
            [
                9683,
                9699
            ],
            [
                9727,
                9739
            ],
            [
                9789,
                9794
            ],
            [
                9775,
                9783
            ],
            [
                9795,
                9815
            ],
            [
                9753,
                9755
            ],
            [
                9815,
                9816
            ],
            [
                9817,
                9896
            ],
            [
                9933,
                9964
            ],
            [
                9982,
                10006
            ],
            [
                10036,
                10038
            ],
            [
                10046,
                10049
            ],
            [
                10086,
                10088
            ],
            [
                10092,
                10094
            ],
            [
                10108,
                10114
            ],
            [
                10127,
                10139
            ],
            [
                10095,
                10104
            ],
            [
                10145,
                10209
            ],
            [
                10209,
                10281
            ],
            [
                10345,
                10351
            ],
            [
                10282,
                10287
            ],
            [
                10292,
                10344
            ],
            [
                10381,
                10383
            ],
            [
                10383,
                10409
            ],
            [
                10445,
                10452
            ],
            [
                10452,
                10517
            ],
            [
                10517,
                10522
            ],
            [
                10522,
                10540
            ],
            [
                10540,
                10553
            ],
            [
                10553,
                10580
            ],
            [
                10580,
                10631
            ],
            [
                10637,
                10641
            ],
            [
                10645,
                10652
            ],
            [
                10652,
                10682
            ],
            [
                10682,
                10720
            ],
            [
                10720,
                10770
            ],
            [
                10770,
                10804
            ],
            [
                10804,
                10812
            ],
            [
                10822,
                10845
            ],
            [
                10859,
                10860
            ],
            [
                10926,
                10990
            ],
            [
                10990,
                11055
            ],
            [
                11055,
                11112
            ],
            [
                11112,
                11230
            ],
            [
                11500,
                11503
            ],
            [
                11507,
                11534
            ],
            [
                11538,
                11573
            ],
            [
                11573,
                11585
            ],
            [
                11598,
                11640
            ],
            [
                11640,
                11644
            ],
            [
                11714,
                11717
            ],
            [
                11677,
                11682
            ],
            [
                11693,
                11699
            ],
            [
                11667,
                11670
            ],
            [
                11704,
                11713
            ],
            [
                11734,
                11759
            ],
            [
                11759,
                11807
            ],
            [
                11809,
                11813
            ],
            [
                11807,
                11808
            ],
            [
                11814,
                11867
            ],
            [
                11900,
                11925
            ],
            [
                11925,
                11926
            ],
            [
                11929,
                11956
            ],
            [
                11962,
                11963
            ],
            [
                11971,
                11986
            ],
            [
                11986,
                12035
            ],
            [
                12037,
                12040
            ],
            [
                12042,
                12048
            ],
            [
                12048,
                12082
            ],
            [
                12082,
                12143
            ],
            [
                12143,
                12176
            ],
            [
                12189,
                12209
            ],
            [
                12222,
                12237
            ],
            [
                12237,
                12267
            ],
            [
                12284,
                12294
            ],
            [
                12294,
                12323
            ],
            [
                12389,
                12396
            ],
            [
                12385,
                12388
            ],
            [
                12324,
                12349
            ],
            [
                12486,
                12488
            ],
            [
                12488,
                12522
            ],
            [
                12522,
                12524
            ],
            [
                12524,
                12545
            ],
            [
                12545,
                12601
            ],
            [
                12679,
                12739
            ],
            [
                12739,
                12809
            ],
            [
                12810,
                12833
            ],
            [
                12879,
                12906
            ],
            [
                12910,
                12913
            ],
            [
                12907,
                12909
            ],
            [
                12914,
                12959
            ],
            [
                13014,
                13016
            ],
            [
                13021,
                13027
            ],
            [
                13037,
                13108
            ],
            [
                13108,
                13123
            ],
            [
                13125,
                13129
            ],
            [
                13223,
                13308
            ],
            [
                13486,
                13509
            ],
            [
                13533,
                13595
            ],
            [
                13596,
                13610
            ],
            [
                13618,
                13693
            ],
            [
                13693,
                13707
            ],
            [
                13773,
                13781
            ],
            [
                13758,
                13767
            ],
            [
                13785,
                13858
            ],
            [
                14106,
                14126
            ],
            [
                14146,
                14186
            ],
            [
                14187,
                14189
            ],
            [
                14250,
                14259
            ],
            [
                14092,
                14094
            ],
            [
                14140,
                14146
            ],
            [
                14278,
                14286
            ],
            [
                14329,
                14335
            ],
            [
                14287,
                14308
            ],
            [
                14395,
                14397
            ],
            [
                14397,
                14597
            ],
            [
                14818,
                14951
            ],
            [
                14975,
                14978
            ],
            [
                14978,
                15028
            ],
            [
                15028,
                15077
            ],
            [
                15077,
                15108
            ],
            [
                15108,
                15176
            ],
            [
                15176,
                15197
            ],
            [
                15197,
                15216
            ],
            [
                15216,
                15318
            ],
            [
                15318,
                15372
            ],
            [
                15372,
                15450
            ],
            [
                15450,
                15484
            ],
            [
                15484,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15622
            ],
            [
                15622,
                15650
            ],
            [
                15650,
                15676
            ],
            [
                15676,
                15702
            ],
            [
                15702,
                15822
            ],
            [
                15822,
                15856
            ],
            [
                15856,
                15888
            ],
            [
                15888,
                15898
            ],
            [
                15898,
                15944
            ],
            [
                15944,
                15999
            ],
            [
                15999,
                16017
            ],
            [
                16018,
                16029
            ],
            [
                16250,
                16278
            ],
            [
                16278,
                16381
            ],
            [
                16381,
                16427
            ],
            [
                16427,
                16458
            ],
            [
                16458,
                16516
            ],
            [
                16516,
                16535
            ],
            [
                16535,
                16574
            ],
            [
                16594,
                16655
            ],
            [
                16655,
                16693
            ],
            [
                16693,
                16751
            ],
            [
                16765,
                16845
            ],
            [
                16845,
                16969
            ],
            [
                17134,
                17169
            ],
            [
                17178,
                17219
            ],
            [
                17229,
                17232
            ],
            [
                17236,
                17272
            ],
            [
                17303,
                17305
            ],
            [
                17318,
                17351
            ],
            [
                17351,
                17371
            ],
            [
                17372,
                17375
            ],
            [
                17428,
                17490
            ],
            [
                17576,
                17625
            ],
            [
                17645,
                17674
            ],
            [
                17674,
                17677
            ],
            [
                17731,
                17732
            ],
            [
                17690,
                17708
            ],
            [
                17807,
                17808
            ],
            [
                17737,
                17807
            ],
            [
                17678,
                17680
            ],
            [
                17817,
                17873
            ],
            [
                17906,
                17908
            ],
            [
                17995,
                17997
            ],
            [
                18243,
                18245
            ],
            [
                18071,
                18073
            ],
            [
                18017,
                18027
            ],
            [
                18139,
                18140
            ],
            [
                18141,
                18216
            ],
            [
                18339,
                18340
            ],
            [
                18345,
                18373
            ],
            [
                18295,
                18305
            ],
            [
                18377,
                18388
            ],
            [
                18402,
                18404
            ],
            [
                18420,
                18433
            ],
            [
                18441,
                18470
            ],
            [
                18588,
                18590
            ],
            [
                18590,
                18633
            ],
            [
                18661,
                18679
            ],
            [
                18680,
                18690
            ],
            [
                18789,
                18812
            ],
            [
                18827,
                18913
            ],
            [
                18913,
                18916
            ],
            [
                18986,
                18990
            ],
            [
                19007,
                19031
            ],
            [
                19127,
                19169
            ],
            [
                19169,
                19179
            ],
            [
                19204,
                19216
            ],
            [
                19217,
                19290
            ],
            [
                19419,
                19421
            ],
            [
                19421,
                19424
            ],
            [
                19434,
                19473
            ],
            [
                19486,
                19498
            ],
            [
                19505,
                19551
            ],
            [
                19599,
                19609
            ],
            [
                19661,
                19706
            ],
            [
                19797,
                19800
            ],
            [
                19761,
                19782
            ],
            [
                19815,
                19817
            ],
            [
                19817,
                19856
            ],
            [
                19856,
                19872
            ],
            [
                19872,
                19911
            ],
            [
                19911,
                19988
            ],
            [
                20001,
                20011
            ],
            [
                20011,
                20016
            ],
            [
                20027,
                20164
            ],
            [
                20307,
                20364
            ],
            [
                20364,
                20371
            ],
            [
                20371,
                20393
            ],
            [
                20393,
                20432
            ],
            [
                20448,
                20450
            ],
            [
                20450,
                20476
            ],
            [
                20476,
                20502
            ],
            [
                20502,
                20563
            ],
            [
                20563,
                20662
            ],
            [
                20662,
                20693
            ],
            [
                20693,
                20716
            ],
            [
                20717,
                20752
            ],
            [
                20752,
                20837
            ],
            [
                20935,
                20971
            ],
            [
                20971,
                21048
            ],
            [
                21048,
                21076
            ],
            [
                21076,
                21151
            ],
            [
                21188,
                21191
            ],
            [
                21191,
                21205
            ],
            [
                21205,
                21272
            ],
            [
                21272,
                21357
            ],
            [
                21357,
                21447
            ],
            [
                21447,
                21528
            ],
            [
                21602,
                21603
            ],
            [
                21620,
                21622
            ],
            [
                21622,
                21663
            ],
            [
                21663,
                21668
            ],
            [
                21668,
                21688
            ],
            [
                21688,
                21722
            ],
            [
                21722,
                21751
            ],
            [
                21755,
                21788
            ],
            [
                21788,
                21891
            ],
            [
                21891,
                22063
            ],
            [
                22072,
                22093
            ],
            [
                22129,
                22184
            ],
            [
                22185,
                22195
            ],
            [
                22235,
                22237
            ],
            [
                22237,
                22302
            ],
            [
                22313,
                22385
            ],
            [
                22649,
                22650
            ],
            [
                22911,
                22927
            ],
            [
                23001,
                23015
            ],
            [
                23025,
                23059
            ],
            [
                23059,
                23150
            ],
            [
                23179,
                23214
            ],
            [
                23225,
                23245
            ],
            [
                23627,
                23802
            ],
            [
                23802,
                23890
            ],
            [
                23942,
                23945
            ],
            [
                23960,
                23962
            ],
            [
                23971,
                23973
            ],
            [
                24000,
                24083
            ],
            [
                24171,
                24173
            ],
            [
                24173,
                24293
            ],
            [
                24300,
                24392
            ],
            [
                24432,
                24442
            ],
            [
                24397,
                24411
            ],
            [
                24442,
                24476
            ],
            [
                24477,
                24577
            ],
            [
                24614,
                24623
            ],
            [
                24628,
                24630
            ],
            [
                24630,
                24687
            ],
            [
                24697,
                24770
            ],
            [
                24789,
                24794
            ],
            [
                24808,
                24809
            ],
            [
                24810,
                24917
            ],
            [
                24921,
                24928
            ],
            [
                24929,
                24932
            ],
            [
                24976,
                24992
            ],
            [
                24992,
                24999
            ],
            [
                25049,
                25059
            ],
            [
                25000,
                25037
            ],
            [
                25084,
                25105
            ],
            [
                25114,
                25143
            ],
            [
                25185,
                25188
            ],
            [
                25166,
                25181
            ],
            [
                25202,
                25245
            ],
            [
                25250,
                25273
            ],
            [
                25273,
                25408
            ],
            [
                25419,
                25432
            ],
            [
                25432,
                25482
            ],
            [
                25522,
                25545
            ],
            [
                25545,
                25680
            ],
            [
                25680,
                25684
            ],
            [
                25741,
                25786
            ],
            [
                25931,
                25958
            ],
            [
                25684,
                25685
            ],
            [
                25700,
                25702
            ],
            [
                26036,
                26043
            ],
            [
                26029,
                26035
            ],
            [
                26056,
                26058
            ],
            [
                26058,
                26175
            ],
            [
                26178,
                26191
            ],
            [
                26193,
                26233
            ],
            [
                26245,
                26304
            ],
            [
                26304,
                26309
            ],
            [
                26317,
                26382
            ],
            [
                26417,
                26419
            ],
            [
                26419,
                26467
            ],
            [
                26554,
                26558
            ],
            [
                26574,
                26620
            ],
            [
                26627,
                26636
            ],
            [
                26636,
                26638
            ],
            [
                26643,
                26644
            ],
            [
                26652,
                26658
            ],
            [
                26663,
                26730
            ],
            [
                26740,
                26762
            ],
            [
                26788,
                26794
            ],
            [
                26808,
                26836
            ],
            [
                26941,
                26945
            ],
            [
                26952,
                27033
            ],
            [
                27066,
                27069
            ],
            [
                27054,
                27062
            ],
            [
                27121,
                27123
            ],
            [
                27128,
                27134
            ],
            [
                27152,
                27155
            ],
            [
                27192,
                27236
            ],
            [
                27149,
                27151
            ],
            [
                27255,
                27315
            ],
            [
                27410,
                27427
            ],
            [
                27437,
                27451
            ],
            [
                27457,
                27553
            ],
            [
                27580,
                27615
            ],
            [
                27628,
                27633
            ],
            [
                27368,
                27376
            ],
            [
                27707,
                27709
            ],
            [
                27709,
                27747
            ],
            [
                27747,
                27758
            ],
            [
                27765,
                27829
            ],
            [
                27842,
                27875
            ],
            [
                27875,
                27938
            ],
            [
                28135,
                28163
            ],
            [
                28163,
                28186
            ],
            [
                28186,
                28205
            ],
            [
                28207,
                28321
            ],
            [
                28330,
                28350
            ],
            [
                28351,
                28359
            ],
            [
                28360,
                28363
            ],
            [
                28370,
                28393
            ],
            [
                28393,
                28411
            ],
            [
                28687,
                28734
            ],
            [
                28778,
                28786
            ],
            [
                28795,
                28807
            ],
            [
                28979,
                28987
            ],
            [
                29108,
                29160
            ],
            [
                29049,
                29052
            ],
            [
                29470,
                29473
            ],
            [
                29394,
                29412
            ],
            [
                29313,
                29314
            ],
            [
                29539,
                29547
            ],
            [
                29536,
                29538
            ],
            [
                29664,
                29665
            ],
            [
                29552,
                29577
            ],
            [
                29585,
                29664
            ],
            [
                29666,
                29778
            ],
            [
                29778,
                29838
            ],
            [
                29939,
                29941
            ],
            [
                29941,
                29964
            ],
            [
                29964,
                30001
            ],
            [
                30001,
                30050
            ],
            [
                30054,
                30076
            ],
            [
                30084,
                30150
            ],
            [
                30150,
                30218
            ],
            [
                30230,
                30232
            ],
            [
                30232,
                30234
            ],
            [
                30252,
                30294
            ],
            [
                30361,
                30362
            ],
            [
                30446,
                30484
            ],
            [
                30484,
                30518
            ],
            [
                30527,
                30530
            ],
            [
                30530,
                30557
            ],
            [
                30559,
                30580
            ],
            [
                30595,
                30631
            ],
            [
                30642,
                30647
            ],
            [
                30692,
                30693
            ],
            [
                30752,
                30852
            ],
            [
                30852,
                30954
            ],
            [
                30989,
                30991
            ],
            [
                30991,
                31081
            ],
            [
                31314,
                31315
            ],
            [
                31614,
                31615
            ],
            [
                31627,
                31684
            ],
            [
                31710,
                31730
            ],
            [
                31744,
                31758
            ],
            [
                31758,
                31768
            ],
            [
                31768,
                31799
            ],
            [
                31799,
                31872
            ],
            [
                31872,
                31873
            ],
            [
                31882,
                31885
            ],
            [
                31907,
                31914
            ],
            [
                31949,
                32021
            ],
            [
                32022,
                32064
            ],
            [
                32079,
                32111
            ],
            [
                32234,
                32237
            ],
            [
                32394,
                32440
            ],
            [
                32440,
                32461
            ],
            [
                32461,
                32466
            ],
            [
                32468,
                32471
            ],
            [
                32473,
                32494
            ],
            [
                32515,
                32518
            ],
            [
                32518,
                32557
            ],
            [
                32680,
                32713
            ],
            [
                32719,
                32800
            ],
            [
                32800,
                32843
            ],
            [
                32866,
                32868
            ],
            [
                32872,
                32886
            ],
            [
                32900,
                32948
            ],
            [
                32948,
                32987
            ],
            [
                32987,
                33015
            ],
            [
                33015,
                33053
            ],
            [
                33063,
                33071
            ],
            [
                33071,
                33124
            ],
            [
                33124,
                33205
            ],
            [
                33205,
                33225
            ],
            [
                33275,
                33302
            ],
            [
                33302,
                33311
            ],
            [
                33317,
                33320
            ],
            [
                33320,
                33349
            ],
            [
                33349,
                33415
            ],
            [
                33466,
                33497
            ],
            [
                33497,
                33578
            ],
            [
                33578,
                33628
            ],
            [
                33628,
                33634
            ],
            [
                33643,
                33700
            ],
            [
                33700,
                33781
            ],
            [
                33967,
                33974
            ],
            [
                34013,
                34017
            ],
            [
                34038,
                34042
            ],
            [
                34064,
                34066
            ],
            [
                34066,
                34099
            ],
            [
                34113,
                34148
            ],
            [
                34152,
                34176
            ],
            [
                34189,
                34253
            ],
            [
                34262,
                34283
            ],
            [
                34289,
                34319
            ],
            [
                34350,
                34408
            ],
            [
                34421,
                34441
            ],
            [
                34442,
                34501
            ],
            [
                34512,
                34529
            ],
            [
                34559,
                34605
            ],
            [
                34622,
                34629
            ],
            [
                34643,
                34650
            ],
            [
                34634,
                34639
            ],
            [
                34660,
                34662
            ],
            [
                34670,
                34760
            ],
            [
                34767,
                34780
            ],
            [
                34844,
                34881
            ],
            [
                34905,
                34943
            ],
            [
                34944,
                34947
            ],
            [
                34982,
                35024
            ],
            [
                34970,
                34973
            ],
            [
                35134,
                35137
            ],
            [
                35072,
                35101
            ],
            [
                35138,
                35175
            ],
            [
                35175,
                35213
            ],
            [
                35285,
                35290
            ],
            [
                35366,
                35463
            ],
            [
                35851,
                35858
            ],
            [
                35868,
                35995
            ],
            [
                35995,
                36211
            ],
            [
                36211,
                36224
            ],
            [
                36239,
                36356
            ],
            [
                36356,
                36388
            ],
            [
                36388,
                36398
            ],
            [
                36424,
                36427
            ],
            [
                36450,
                36480
            ],
            [
                36538,
                36554
            ],
            [
                36557,
                36569
            ],
            [
                36575,
                36638
            ],
            [
                36653,
                36668
            ],
            [
                36678,
                36696
            ],
            [
                36698,
                36706
            ],
            [
                36717,
                36790
            ],
            [
                36668,
                36669
            ],
            [
                36791,
                36810
            ],
            [
                36844,
                36846
            ],
            [
                36846,
                36925
            ],
            [
                36927,
                36973
            ]
        ],
        "row_chars": [
            [
                0,
                87
            ],
            [
                87,
                107
            ],
            [
                107,
                284
            ],
            [
                284,
                375
            ],
            [
                375,
                456
            ],
            [
                456,
                665
            ],
            [
                665,
                863
            ],
            [
                863,
                1157
            ],
            [
                1157,
                1249
            ],
            [
                1249,
                1340
            ],
            [
                1340,
                1373
            ],
            [
                1373,
                1449
            ],
            [
                1449,
                1514
            ],
            [
                1514,
                1676
            ],
            [
                1676,
                1823
            ],
            [
                1823,
                2019
            ],
            [
                2019,
                2205
            ],
            [
                2205,
                2260
            ],
            [
                2260,
                2565
            ],
            [
                2565,
                2681
            ],
            [
                2681,
                2851
            ],
            [
                2851,
                2949
            ],
            [
                2949,
                3128
            ],
            [
                3128,
                3215
            ],
            [
                3215,
                3344
            ],
            [
                3344,
                3383
            ],
            [
                3383,
                3425
            ],
            [
                3425,
                3545
            ],
            [
                3545,
                3810
            ],
            [
                3810,
                3867
            ],
            [
                3867,
                3950
            ],
            [
                3950,
                4017
            ],
            [
                4017,
                4131
            ],
            [
                4131,
                4179
            ],
            [
                4179,
                4352
            ],
            [
                4352,
                4387
            ],
            [
                4387,
                4434
            ],
            [
                4434,
                4487
            ],
            [
                4487,
                4548
            ],
            [
                4548,
                4660
            ],
            [
                4660,
                4689
            ],
            [
                4689,
                4797
            ],
            [
                4797,
                4904
            ],
            [
                4904,
                5065
            ],
            [
                5065,
                5308
            ],
            [
                5308,
                5442
            ],
            [
                5442,
                5582
            ],
            [
                5582,
                5784
            ],
            [
                5784,
                5963
            ],
            [
                5963,
                6042
            ],
            [
                6042,
                6317
            ],
            [
                6317,
                6762
            ],
            [
                6762,
                7076
            ],
            [
                7076,
                7233
            ],
            [
                7233,
                7523
            ],
            [
                7523,
                7647
            ],
            [
                7647,
                7695
            ],
            [
                7695,
                7760
            ],
            [
                7760,
                7782
            ],
            [
                7782,
                7984
            ],
            [
                7984,
                8068
            ],
            [
                8068,
                8161
            ],
            [
                8161,
                8208
            ],
            [
                8208,
                8359
            ],
            [
                8359,
                8427
            ],
            [
                8427,
                8505
            ],
            [
                8505,
                8578
            ],
            [
                8578,
                8694
            ],
            [
                8694,
                8711
            ],
            [
                8711,
                8729
            ],
            [
                8729,
                8828
            ],
            [
                8828,
                8858
            ],
            [
                8858,
                8896
            ],
            [
                8896,
                8966
            ],
            [
                8966,
                9010
            ],
            [
                9010,
                9089
            ],
            [
                9089,
                9193
            ],
            [
                9193,
                9334
            ],
            [
                9334,
                9611
            ],
            [
                9611,
                9817
            ],
            [
                9817,
                9896
            ],
            [
                9896,
                9933
            ],
            [
                9933,
                9964
            ],
            [
                9964,
                10038
            ],
            [
                10038,
                10209
            ],
            [
                10209,
                10383
            ],
            [
                10383,
                10445
            ],
            [
                10445,
                10452
            ],
            [
                10452,
                10517
            ],
            [
                10517,
                10522
            ],
            [
                10522,
                10540
            ],
            [
                10540,
                10553
            ],
            [
                10553,
                10580
            ],
            [
                10580,
                10652
            ],
            [
                10652,
                10682
            ],
            [
                10682,
                10720
            ],
            [
                10720,
                10770
            ],
            [
                10770,
                10804
            ],
            [
                10804,
                10990
            ],
            [
                10990,
                11055
            ],
            [
                11055,
                11112
            ],
            [
                11112,
                11230
            ],
            [
                11230,
                11318
            ],
            [
                11318,
                11464
            ],
            [
                11464,
                11573
            ],
            [
                11573,
                11640
            ],
            [
                11640,
                11759
            ],
            [
                11759,
                11925
            ],
            [
                11925,
                11986
            ],
            [
                11986,
                12048
            ],
            [
                12048,
                12082
            ],
            [
                12082,
                12143
            ],
            [
                12143,
                12237
            ],
            [
                12237,
                12294
            ],
            [
                12294,
                12488
            ],
            [
                12488,
                12524
            ],
            [
                12524,
                12545
            ],
            [
                12545,
                12601
            ],
            [
                12601,
                12674
            ],
            [
                12674,
                12739
            ],
            [
                12739,
                13016
            ],
            [
                13016,
                13108
            ],
            [
                13108,
                13308
            ],
            [
                13308,
                13486
            ],
            [
                13486,
                13693
            ],
            [
                13693,
                13859
            ],
            [
                13859,
                14060
            ],
            [
                14060,
                14397
            ],
            [
                14397,
                14597
            ],
            [
                14597,
                14710
            ],
            [
                14710,
                14747
            ],
            [
                14747,
                14784
            ],
            [
                14784,
                14818
            ],
            [
                14818,
                14978
            ],
            [
                14978,
                15028
            ],
            [
                15028,
                15077
            ],
            [
                15077,
                15108
            ],
            [
                15108,
                15176
            ],
            [
                15176,
                15197
            ],
            [
                15197,
                15216
            ],
            [
                15216,
                15318
            ],
            [
                15318,
                15372
            ],
            [
                15372,
                15450
            ],
            [
                15450,
                15484
            ],
            [
                15484,
                15510
            ],
            [
                15510,
                15576
            ],
            [
                15576,
                15622
            ],
            [
                15622,
                15650
            ],
            [
                15650,
                15676
            ],
            [
                15676,
                15702
            ],
            [
                15702,
                15822
            ],
            [
                15822,
                15856
            ],
            [
                15856,
                15888
            ],
            [
                15888,
                15898
            ],
            [
                15898,
                15944
            ],
            [
                15944,
                15999
            ],
            [
                15999,
                16029
            ],
            [
                16029,
                16085
            ],
            [
                16085,
                16278
            ],
            [
                16278,
                16381
            ],
            [
                16381,
                16427
            ],
            [
                16427,
                16458
            ],
            [
                16458,
                16516
            ],
            [
                16516,
                16535
            ],
            [
                16535,
                16655
            ],
            [
                16655,
                16693
            ],
            [
                16693,
                16845
            ],
            [
                16845,
                16970
            ],
            [
                16970,
                17134
            ],
            [
                17134,
                17351
            ],
            [
                17351,
                17576
            ],
            [
                17576,
                17674
            ],
            [
                17674,
                17908
            ],
            [
                17908,
                17995
            ],
            [
                17995,
                18590
            ],
            [
                18590,
                18680
            ],
            [
                18680,
                18913
            ],
            [
                18913,
                19127
            ],
            [
                19127,
                19169
            ],
            [
                19169,
                19421
            ],
            [
                19421,
                19551
            ],
            [
                19551,
                19817
            ],
            [
                19817,
                19856
            ],
            [
                19856,
                19872
            ],
            [
                19872,
                19911
            ],
            [
                19911,
                20011
            ],
            [
                20011,
                20165
            ],
            [
                20165,
                20307
            ],
            [
                20307,
                20364
            ],
            [
                20364,
                20371
            ],
            [
                20371,
                20393
            ],
            [
                20393,
                20450
            ],
            [
                20450,
                20476
            ],
            [
                20476,
                20502
            ],
            [
                20502,
                20563
            ],
            [
                20563,
                20662
            ],
            [
                20662,
                20693
            ],
            [
                20693,
                20752
            ],
            [
                20752,
                20837
            ],
            [
                20837,
                20880
            ],
            [
                20880,
                20896
            ],
            [
                20896,
                20935
            ],
            [
                20935,
                20971
            ],
            [
                20971,
                21048
            ],
            [
                21048,
                21076
            ],
            [
                21076,
                21191
            ],
            [
                21191,
                21205
            ],
            [
                21205,
                21272
            ],
            [
                21272,
                21357
            ],
            [
                21357,
                21447
            ],
            [
                21447,
                21529
            ],
            [
                21529,
                21602
            ],
            [
                21602,
                21622
            ],
            [
                21622,
                21663
            ],
            [
                21663,
                21668
            ],
            [
                21668,
                21688
            ],
            [
                21688,
                21722
            ],
            [
                21722,
                21755
            ],
            [
                21755,
                21788
            ],
            [
                21788,
                21891
            ],
            [
                21891,
                22237
            ],
            [
                22237,
                22651
            ],
            [
                22651,
                22911
            ],
            [
                22911,
                23059
            ],
            [
                23059,
                23245
            ],
            [
                23245,
                23627
            ],
            [
                23627,
                23802
            ],
            [
                23802,
                23973
            ],
            [
                23973,
                24173
            ],
            [
                24173,
                24477
            ],
            [
                24477,
                24630
            ],
            [
                24630,
                24810
            ],
            [
                24810,
                24992
            ],
            [
                24992,
                25273
            ],
            [
                25273,
                25432
            ],
            [
                25432,
                25545
            ],
            [
                25545,
                25680
            ],
            [
                25680,
                26058
            ],
            [
                26058,
                26175
            ],
            [
                26175,
                26304
            ],
            [
                26304,
                26419
            ],
            [
                26419,
                26638
            ],
            [
                26638,
                26941
            ],
            [
                26941,
                27123
            ],
            [
                27123,
                27709
            ],
            [
                27709,
                27747
            ],
            [
                27747,
                27875
            ],
            [
                27875,
                27939
            ],
            [
                27939,
                28047
            ],
            [
                28047,
                28163
            ],
            [
                28163,
                28186
            ],
            [
                28186,
                28207
            ],
            [
                28207,
                28393
            ],
            [
                28393,
                28807
            ],
            [
                28807,
                28979
            ],
            [
                28979,
                29480
            ],
            [
                29480,
                29778
            ],
            [
                29778,
                29941
            ],
            [
                29941,
                29964
            ],
            [
                29964,
                30001
            ],
            [
                30001,
                30150
            ],
            [
                30150,
                30232
            ],
            [
                30232,
                30363
            ],
            [
                30363,
                30446
            ],
            [
                30446,
                30484
            ],
            [
                30484,
                30530
            ],
            [
                30530,
                30694
            ],
            [
                30694,
                30752
            ],
            [
                30752,
                30852
            ],
            [
                30852,
                30991
            ],
            [
                30991,
                31316
            ],
            [
                31316,
                31614
            ],
            [
                31614,
                31758
            ],
            [
                31758,
                31768
            ],
            [
                31768,
                31799
            ],
            [
                31799,
                31872
            ],
            [
                31872,
                32237
            ],
            [
                32237,
                32299
            ],
            [
                32299,
                32394
            ],
            [
                32394,
                32440
            ],
            [
                32440,
                32461
            ],
            [
                32461,
                32518
            ],
            [
                32518,
                32557
            ],
            [
                32557,
                32680
            ],
            [
                32680,
                32800
            ],
            [
                32800,
                32868
            ],
            [
                32868,
                32948
            ],
            [
                32948,
                32987
            ],
            [
                32987,
                33015
            ],
            [
                33015,
                33071
            ],
            [
                33071,
                33124
            ],
            [
                33124,
                33205
            ],
            [
                33205,
                33302
            ],
            [
                33302,
                33320
            ],
            [
                33320,
                33349
            ],
            [
                33349,
                33415
            ],
            [
                33415,
                33466
            ],
            [
                33466,
                33497
            ],
            [
                33497,
                33578
            ],
            [
                33578,
                33628
            ],
            [
                33628,
                33700
            ],
            [
                33700,
                33800
            ],
            [
                33800,
                33866
            ],
            [
                33866,
                33967
            ],
            [
                33967,
                34066
            ],
            [
                34066,
                34442
            ],
            [
                34442,
                34662
            ],
            [
                34662,
                34944
            ],
            [
                34944,
                35175
            ],
            [
                35175,
                35463
            ],
            [
                35463,
                35643
            ],
            [
                35643,
                35795
            ],
            [
                35795,
                35995
            ],
            [
                35995,
                36211
            ],
            [
                36211,
                36356
            ],
            [
                36356,
                36388
            ],
            [
                36388,
                36846
            ],
            [
                36846,
                36973
            ]
        ]
    },
    "abridged": {
        "text": "The news of Gwendolen's engagement was soon known at the rectory, and the Gascoignes spent the evening at Offendene.\n\"My dear, let me congratulate you,\" said the rector. \"You look serious, and I don't wonder: a lifelong union is a solemn thing. But from the way Mr. Grandcourt has spoken we may already see some good arising out of our adversity, in showing you your future husband's delicate liberality.\" For Gwendolen had told her mother of Mr. Grandcourt's offer to provide for her.\n\"No doubt he would have behaved as handsomely had you become engaged to him a month ago,\" said Mrs. Gascoigne, feeling that she had to discharge a duty. \"But now there is no more room for caprice. A woman has a great debt of gratitude to a man who perseveres in making her such an offer. But no doubt you feel properly.\"\n\"I am not sure that I do, aunt,\" said Gwendolen, with saucy gravity. \"I don't know everything it is proper to feel on being engaged.\"\nThe rector patted her shoulder and smiled. Anna kissed her, saying, \"I do hope you will be happy,\" but then moved away and tried to keep the tears back. Lately she had been imagining a little romance about Rex - how Gwendolen's heart might be softened by trouble into love, so that they could marry. But now she wanted grace to rejoice in something else.\n\"I should like to know exactly what sort of places Ryelands and Gadsmere are,\" said Mrs. Davilow.\n\"Gadsmere, I believe, is a secondary place,\" said Mr. Gascoigne; \"But Ryelands I know to be one of our finest seats, with an extensive park. The house was built by Inigo Jones. The estate is said to be worth twelve thousand a year.\"\n\"It would be most remarkable,\" said Mrs. Gascoigne, \"if Mr. Grandcourt were to become Lord Stannery in addition to everything else. What a position for his wife! You must lose no time in writing to Mrs. Mompert, Henry. It is a good thing that you have an engagement of marriage to offer as an excuse, else she might feel offended. She is rather a high woman.\"\n\"I am rid of that horror,\" thought Gwendolen, to whom the name of Mompert had become a sort of evil charm. She was silent all evening, and that night could hardly sleep. It was rare for her to be wakeful: and perhaps still rarer for her to be careful that her mother should not know of it.\nBut her state of mind was altogether new: she who used to feel sure of herself, had just taken a decisive step which she had thought that she would not take. She could not go backward now; she liked a great deal of what lay before her; and there was nothing for her to like if she went back. But she was dogged by the shadow of that previous, instinctive resolve. Lying awake, she was appalled by the idea that she was going to do what she had once recoiled from. A question of right or wrong in her conduct had never raised terror in her before; she had known no compunction that atoning caresses could not lay to rest.\nBut now something like a new consciousness was awaked. She seemed on the edge of adopting deliberately, for the rest of her life, what she had rashly said in her bitterness - that it did not signify what she did; she had only to amuse herself. That lawlessness, that casting away of all care about justification, suddenly frightened her: she glimpsed shadowy calamity behind it.\nAll the influences of her disregarded religious teaching, as well as the deeper impressions of something awful and inexorable enveloping her, seemed to concentrate themselves in the vague idea of avenging power. The brilliant position she had longed for, the imagined freedom of marriage, the deliverance from dull insignificance - all had come to her hunger like food with the taint of sacrilege upon it, which she must snatch with terror. That unhappy-faced woman and her children kept reappearing in her imagination, and gradually obliterated all other thought. Her long wakefulness seemed a delirium; a faint light penetrated the window-curtain; the chillness increased. She could bear it no longer, and cried \"Mamma!\"\n\"Yes, dear,\" said Mrs. Davilow, immediately wakeful.\n\"Let me come to you.\"\nShe soon went to sleep on her mother's shoulder, and slept on till late, when, dreaming of a lit-up ball-room, she opened her eyes on her mother standing by the bedside with a small packet in her hand.\n\"I am sorry to wake you, darling, but I thought it better to give you this at once. The groom has brought Criterion for you.\"\nGwendolen sat up in bed and opened the packet. It was a delicate enamelled casket, and inside was a splendid diamond ring with a letter which contained a folded paper and these words:\n'Pray wear this ring when I come at twelve in sign of our betrothal. I enclose a cheque for immediate expenses. Of course Mrs. Davilow will remain at Offendene, at least for some time. I hope, when I come, you will have granted me an early day, when you may begin to command me at a shorter distance.\n'Yours devotedly,\nH. M. GRANDCOURT.'\nThe cheque was for five hundred pounds.\n\"How very kind and delicate!\" said Mrs. Davilow, with feeling. \"But I should prefer not to be dependent on a son-in-law. I and the girls could get along very well.\"\n\"Mamma, if you say that again, I will not marry him,\" said Gwendolen, angrily.\n\"My dear child, I trust you are not going to marry only for my sake,\" said Mrs. Davilow, deprecatingly.\nGwendolen tossed her head, irritated at this attempt to take away a motive. Perhaps the deeper cause of her irritation was the consciousness that she was drawn toward the marriage for other reasons, as well as for her mamma's sake. She had woken to the knowledge that she was irrevocably engaged, and the ugly visions of the night would probably show themselves weak by day.\n\"What I long for is your happiness, dear,\" continued Mrs. Davilow, pleadingly. \"Will you not put on the ring?\"\nAt first Gwendolen did not answer. Then she decided to act as if she were riding on horseback: she would go on with spirit, whatever ideas might be running in her head.\n\"I thought the lover always put on the betrothal ring himself,\" she said with a laugh, slipping the ring on her finger, and looking at it. \"I know why he has sent it.\"\n\"Why?\"\n\"He would rather make me put it on than ask me to let him do it. Aha! he is very proud. But so am I. We shall match each other. I should hate a man who went down on his knees, and fawned on me. He really is not disgusting.\"\n\"That is very moderate praise, Gwen.\"\n\"No, it is not, for a man,\" said Gwendolen gaily. \"But now I must get up and dress. Will you do my hair, mamma, dear, and not be so naughty any more as to talk of living in poverty? You must bear to be made comfortable, even if you don't like it. And Mr. Grandcourt behaves perfectly, now, does he not?\"\n\"Certainly he does,\" said Mrs. Davilow, encouraged, and persuaded that after all Gwendolen was fond of her betrothed. She was not anxious about Grandcourt's character, but about Gwendolen's mood in accepting him.\nThe mood was passing through a new phase this morning. Even while she dressed, she was drawing on all her knowledge to justify her marriage. And what she most dwelt on was the determination that, when she was Grandcourt's wife, she would urge him to be generous to Mrs. Glasher's children.\n\"What use would it be to her if I did not marry him? He could have married her if he liked; but he did not like. Perhaps she is to blame for that. There must be a great deal about her that I know nothing of. And he must have been good to her, else she would not want to marry him.\"\nBut that last argument at once appeared doubtful. Mrs. Glasher naturally wished her own children to inherit, and to exclude other children.\n\"Perhaps we shall have no children,\" thought Gwendolen. \"I hope we shall not. And he might leave the estate to the pretty little boy. When Sir Hugo Mallinger dies there will be enough for two.\"\nThis made Mrs. Glasher appear quite unreasonable in demanding that her little boy should be sole heir. Grandcourt's marriage would her do no wrong, when the wife was Gwendolen Harleth. That maiden was accustomed to think herself blameless; other persons only were faulty.\nIt was striking that her repugnance to the idea of Grandcourt's past had sunk into a subordinate feeling. She was thinking of him as a man over whom she was going to have indefinite power; and since her loving him had never been a question with her, any agreeableness he had was so much gain. Poor Gwendolen regarded matrimony as altogether a matter of management, in which she would know how to act.\nBy now her hair was dressed, and she went down in her riding-habit, eager to stir her blood again in riding with the daring intoxication of youth. Already a load was lifted off her; for in daylight and activity it was less oppressive to have doubts about her choice, than to feel that she had no choice but to endure insignificance and servitude.\nWhen Grandcourt raised her left hand gently and looked at the ring, she said gravely, \"It was very good of you to think of everything.\"\n\"You will tell me if there is anything I forget?\" he said, keeping the hand softly within his own. \"I will do anything you wish.\"\n\"But I am very unreasonable in my wishes,\" said Gwendolen, smiling.\n\"Yes, I expect that. Women always are.\"\n\"Then I will not be unreasonable,\" said Gwendolen, taking away her hand and tossing her head saucily. \"I will not be told that I am what women always are.\"\n\"I did not say that,\" said Grandcourt, looking at her with his usual gravity. \"You are what no other woman is.\"\n\"And what is that, pray?\" said Gwendolen, moving to a distance with a little air of menace.\nGrandcourt made his pause before he answered. \"You are the woman I love.\"\n\"Oh, what nice speeches!\" said Gwendolen, laughing. The sense of that love which he must once have given to another woman under strange circumstances was getting familiar.\n\"Give me a nice speech in return. Say when we are to be married.\"\n\"Not yet. Not till we have had a gallop over the downs. I am so thirsty for that, I can think of nothing else. I wish the hunting season had begun. It will begin in ten days!\"\n\"Let us be married in ten days, then,\" said Grandcourt, \"and we shall not be bored about the stables.\"\n\"What do women always say in answer to that?\" said Gwendolen, mischievously.\n\"They agree to it,\" said the lover, rather off his guard.\n\"Then I will not!\" said Gwendolen, taking up her gauntlets, while she kept her eyes on him with gathering fun in them.\nThe scene was pleasant on both sides. A cruder lover would have lost the view of her pretty ways, and spoiled all by stupid attempts at caresses, utterly destructive of drama. Grandcourt preferred the drama; and Gwendolen, left at ease, found her spirits rising continually as she played at reigning.\nWhen they had had a glorious gallop, she was in a state of exhilaration that made her think well of hastening the marriage and having more of this splendid kind of enjoyment. She would not debate it any longer; and she consented to fix the wedding on that day three weeks.\nLush, of course, was made aware of the engagement without being formally told. But, expecting some communication, after a few days he became rather impatient under Grandcourt's silence; he was sure that the change would affect his personal prospects. He had no wish to annoy Grandcourt. Miss Gwendolen he would certainly not have been sorry to frustrate a little; in his freak about this girl Grandcourt struck Lush as a man who was fey - led on by an ominous fatality. Having protested against the marriage, Lush foresaw evil consequences.\nGrandcourt appeared to be ignoring him, even choosing, against the habit of years, to breakfast alone in his dressing-room. But Lush found an opportunity of saying-\n\"And when is the marriage to take place?\"\nGrandcourt had left the dinner table and was lounging, while he smoked, in an easy chair near the hearth. The red-brown velvet brocade was a becoming background for his pale, well-cut features and exquisite long hands. He had a portrait's impenetrable gaze and air of distinction; and was just as lively a companion. But he answered without unusual delay.\n\"On the tenth.\"\n\"I suppose you intend to remain here.\"\n\"We shall go to Ryelands for a little while; but we shall return here for the hunting.\"\nAfter these words there was the languid inarticulate sound frequent with Grandcourt when he meant to continue speaking, and Lush waited for something more.\n\"You had better make some new arrangement for yourself.\"\n\"What! I am to cut and run?\" said Lush, prepared to be good-tempered.\n\"Something of that kind.\"\n\"The bride objects to me. I hope she will make up to you for the want of my services.\"\n\"I can't help your being so damnably disagreeable to women,\" said Grandcourt, in soothing apology.\n\"To one woman, if you please.\"\n\"It makes no difference, since she is the one in question.\"\n\"I suppose I am not to be turned adrift after fifteen years without some provision.\"\n\"You can have three hundred a year. But you must live in town and be ready to look after things when I want you. I shall be rather hard up.\"\n\"If you are not going to be at Ryelands this winter, I might run down there.\"\n\"If you like. I don't care a toss where you are, so that you keep out of sight.\"\n\"Much obliged,\" said Lush, able to take the affair more easily than he had expected. He was supported by the secret belief that he should by-and-by be wanted as much as ever.\n\"Perhaps you will not object to packing up as soon as possible,\" said Grandcourt.\n\"Certainly. Can't I be of use in going to Gadsmere?\"\n\"No. I am going myself.\"\n\"About your being rather hard up. Have you thought of that plan-\"\n\"Just leave me alone, will you?\" said Grandcourt, in his lowest audible tone, tossing his cigar into the fire, and rising to walk away.\nHe spent the evening in the solitude of the smaller drawing-room, where, with various new publications on the table of the kind a gentleman may like to have on hand without reading, he employed himself in sitting meditatively on the sofa and abstaining from any literature. In this way hours may pass surprisingly soon, without the arduous chase of philosophy; not from love of thought, but from hatred of effort.\nBut Grandcourt's moods were not to be explained as ebbing energy. We mortals have a strange spiritual chemistry going on within us, so that a lazy stagnation may be preparing one knows not what explosive material. Grandcourt's thoughts this evening were like the circlets one sees in a dark pool, continually dying out and continually started again by some impulse from below the surface. The deeper central impulse came from the image of Gwendolen; but the thoughts it stirred were not the ones of love poetry. He got none of his satisfaction from the belief that Gwendolen was in love with him. On the contrary, he believed that this girl was rather exceptional in the fact that, in spite of his assiduous attention, she was not in love with him; and it seemed to him very likely that if it had not been for her family's sudden poverty, she would not have accepted him.\nFrom the very first there had been an exasperating fascination in the tricksiness with which she had wheeled away from him. She had been brought to accept him in spite of everything - brought to kneel down like a horse under training for the arena, though she might object to it.\nOn the whole, Grandcourt got more pleasure out of this notion than he could have done out of winning a girl whom he thought was attracted to him personally. And yet along with this pleasure in mastering reluctance, he was persuaded that no woman whom he favoured could be quite indifferent to him; and it seemed likely that by-and-by Gwendolen might be more enamoured of him than he of her. In any case, she would have to submit; and he enjoyed thinking of her as his future wife, whose pride and spirit were suited to command everyone but himself. He had no taste for a woman who was all tenderness and willing obedience. He meant to be master of a woman who would have liked to master him, and who perhaps would have been capable of mastering another man.\nLush thought it well to communicate with Sir Hugo, whose friendship he was anxious to cultivate, in case he should have need of future employment. He wrote the following letter, and addressed it to Park Lane, whither he knew the family had returned from Leubronn:\n'MY DEAR SIR HUGO - Since we came home the marriage has been decided on, and is to take place in less than three weeks. It is the worse for him that her mother has lately lost all her fortune. Grandcourt, I know, is feeling the want of cash; but I am leaving Diplow immediately, and I shall not be able to raise the topic with him. Therefore I advise that Mr. Deronda, who I know has your confidence, should propose to pay a short visit here (there will be other people in the house). Then he should introduce the subject to Grandcourt so as not to imply that you suspect his need of money. I have told him that you might be willing to give a good sum to rent Diplow; but if Mr. Deronda came armed with a definite offer, the proposal will get a stronger lodgement in his mind; and though at present he has a great notion of the hunting here, I see a likelihood that he will get a distaste for the neighbourhood, and will not need urging. I would bet on your ultimate success. As I am not exiled to Siberia, but am to be within call, it is possible that I may be of more service to you. But at present I can think of no medium so good as Mr. Deronda.\n'I remain, my dear Sir Hugo,\nYours very faithfully,\nTHOMAS CRANMER LUSH.'\nSir Hugo, having received this letter at breakfast, handed it to Deronda, who, though he had chambers in town, was hardly ever in them, since Sir Hugo was not contented without him. The chatty baronet's affection for Deronda was not diminished by the differences in their ideas and tastes. Sir Hugo had a certain pride in Deronda's differing from him, and his having strong notions of his own.\nDeronda, in turn, was moved by an affectionate nature such as we are apt to call feminine, disposing him to yield in ordinary details; while he had a certain inflexibility of judgment, and independence of opinion, held to be rightfully masculine.\nWhen he had read the letter, he returned it without speaking.\n\"What do you say, Dan? It would be pleasant enough for you. You have not seen the place for a good many years, and you might have a run with the harriers if you went down next week,\" said Sir Hugo.\n\"I should not go on that account,\" said Deronda, buttering his bread. He objected to this transparent kind of persuasiveness.\n\"I think Lush's notion is a good one. And it would be a pity to lose the chance.\"\n\"That is a different matter - if you think my going is important to your object,\" said Deronda, still aloof.\n\"Why, you will see the fair gambler, the Leubronn Diana, I shouldn't wonder,\" said Sir Hugo, gaily. \"We shall have to invite her to the Abbey, when they are married,\" he added, turning to Lady Mallinger.\n\"I cannot conceive whom you mean,\" said Lady Mallinger, who in fact had not been listening.\n\"Grandcourt is going to marry the girl you saw at Leubronn - the Miss Harleth who played at roulette.\"\n\"Dear me! Is that a good match for him?\"\n\"That depends on the sort of goodness he wants,\" said Sir Hugo, smiling. \"She has nothing: so it's a good match for my purposes, because if I am willing to fork out a large enough sum of money, he may be willing to give up Diplow, so that we shall have it.\"\n\"But why are we to invite them to the Abbey?\" said Lady Mallinger. \"I do not like women who gamble.\"\n\"Oh, you will not mind her for a week. I want to keep Grandcourt in good humour, and to let him see plenty of this place, that he may think the less of Diplow. I don't know yet whether I shall get him to agree. If Dan were to visit there, he might hold out the bait to him. It would be doing me a great service.\" This was meant for Deronda.\n\"Daniel is not fond of Mr. Grandcourt, is he?\" said Lady Mallinger, looking at Deronda inquiringly.\n\"There is no avoiding everybody one doesn't happen to be fond of,\" said Deronda. \"I will go to Diplow, since Sir Hugo wishes it.\"\n\"That's a good fellow!\" said Sir Hugo, well pleased. \"And if you don't find it very pleasant, it's so much experience. You must see men and manners.\"\n\"Yes; but I have seen that man, and something of his manners too,\" said Deronda.\n\"Not nice manners, I think,\" said Lady Mallinger.\n\"Well, they succeed with your sex,\" said Sir Hugo, provokingly. \"And he was an uncommonly good-looking fellow when he was two or three and twenty.\"\nDeronda felt more willingness than at first. The story of that girl's marriage interested him: what he had heard through Lush, about her having run away from the man she was now going to take as a husband, had thrown a new light on her gambling. It was probably the transition into poverty which had urged her acceptance where she must have felt repulsion.\nAll this implied a nature liable to difficulty and struggle - elements of life which had attracted his sympathy, due perhaps to his early pain in conjecturing about his own story. People attracted him, as Hans Meyrick had done, in proportion to the possibility of his defending and rescuing them; and he had to resist an inclination to withdraw coldly from the fortunate.\nBut his impulse to repurchase Gwendolen's necklace for her had been due to something beyond his habitual compassion - to the fascination of her womanhood. He was very open to that sort of charm; yet he would be more likely than many less passionate men to love a woman without telling her of it. Deronda's imagination was much occupied with two women, to neither of whom would he have held it possible that he should ever make love. Hans Meyrick had laughed at him for having something of the knight-errant in his disposition; and he would have found his proof if he had known what was just now going on in Deronda's mind about Mirah and Gwendolen.\nDeronda wrote to announce his visit to Diplow, and received in reply a polite assurance that his coming would give great pleasure. That was not altogether untrue. Grandcourt understood the reason behind Sir Hugo's desire to court him; and it was not disagreeable to him that this fine fellow, whom he believed to be his cousin, would witness with some jealousy Henleigh Grandcourt play the commanding part of betrothed lover to a splendid girl, whom the cousin had seen and admired.\nGrandcourt himself was not jealous of anything unless it threatened his mastery - which he did not think himself likely to lose.",
        "paragraph_chars": [
            [
                0,
                117
            ],
            [
                117,
                486
            ],
            [
                486,
                807
            ],
            [
                807,
                941
            ],
            [
                941,
                1296
            ],
            [
                1296,
                1394
            ],
            [
                1394,
                1627
            ],
            [
                1627,
                1987
            ],
            [
                1987,
                2277
            ],
            [
                2277,
                2898
            ],
            [
                2898,
                3277
            ],
            [
                3277,
                4000
            ],
            [
                4000,
                4053
            ],
            [
                4053,
                4075
            ],
            [
                4075,
                4277
            ],
            [
                4277,
                4403
            ],
            [
                4403,
                4587
            ],
            [
                4587,
                4888
            ],
            [
                4888,
                4906
            ],
            [
                4906,
                4925
            ],
            [
                4925,
                4965
            ],
            [
                4965,
                5130
            ],
            [
                5130,
                5209
            ],
            [
                5209,
                5313
            ],
            [
                5313,
                5688
            ],
            [
                5688,
                5799
            ],
            [
                5799,
                5968
            ],
            [
                5968,
                6136
            ],
            [
                6136,
                6143
            ],
            [
                6143,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6709
            ],
            [
                6709,
                6922
            ],
            [
                6922,
                7212
            ],
            [
                7212,
                7494
            ],
            [
                7494,
                7634
            ],
            [
                7634,
                7828
            ],
            [
                7828,
                8100
            ],
            [
                8100,
                8501
            ],
            [
                8501,
                8848
            ],
            [
                8848,
                8984
            ],
            [
                8984,
                9114
            ],
            [
                9114,
                9182
            ],
            [
                9182,
                9222
            ],
            [
                9222,
                9378
            ],
            [
                9378,
                9490
            ],
            [
                9490,
                9582
            ],
            [
                9582,
                9656
            ],
            [
                9656,
                9828
            ],
            [
                9828,
                9894
            ],
            [
                9894,
                10070
            ],
            [
                10070,
                10173
            ],
            [
                10173,
                10250
            ],
            [
                10250,
                10308
            ],
            [
                10308,
                10427
            ],
            [
                10427,
                10728
            ],
            [
                10728,
                11001
            ],
            [
                11001,
                11542
            ],
            [
                11542,
                11707
            ],
            [
                11707,
                11749
            ],
            [
                11749,
                12105
            ],
            [
                12105,
                12121
            ],
            [
                12121,
                12160
            ],
            [
                12160,
                12248
            ],
            [
                12248,
                12404
            ],
            [
                12404,
                12461
            ],
            [
                12461,
                12531
            ],
            [
                12531,
                12557
            ],
            [
                12557,
                12644
            ],
            [
                12644,
                12743
            ],
            [
                12743,
                12774
            ],
            [
                12774,
                12834
            ],
            [
                12834,
                12919
            ],
            [
                12919,
                13060
            ],
            [
                13060,
                13138
            ],
            [
                13138,
                13219
            ],
            [
                13219,
                13394
            ],
            [
                13394,
                13476
            ],
            [
                13476,
                13529
            ],
            [
                13529,
                13554
            ],
            [
                13554,
                13620
            ],
            [
                13620,
                13756
            ],
            [
                13756,
                14170
            ],
            [
                14170,
                15042
            ],
            [
                15042,
                15322
            ],
            [
                15322,
                16080
            ],
            [
                16080,
                16344
            ],
            [
                16344,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17523,
                17546
            ],
            [
                17546,
                17568
            ],
            [
                17568,
                17962
            ],
            [
                17962,
                18209
            ],
            [
                18209,
                18271
            ],
            [
                18271,
                18469
            ],
            [
                18469,
                18595
            ],
            [
                18595,
                18677
            ],
            [
                18677,
                18786
            ],
            [
                18786,
                18990
            ],
            [
                18990,
                19082
            ],
            [
                19082,
                19185
            ],
            [
                19185,
                19226
            ],
            [
                19226,
                19484
            ],
            [
                19484,
                19585
            ],
            [
                19585,
                19926
            ],
            [
                19926,
                20026
            ],
            [
                20026,
                20156
            ],
            [
                20156,
                20306
            ],
            [
                20306,
                20387
            ],
            [
                20387,
                20437
            ],
            [
                20437,
                20585
            ],
            [
                20585,
                20942
            ],
            [
                20942,
                21314
            ],
            [
                21314,
                21963
            ],
            [
                21963,
                22446
            ],
            [
                22446,
                22574
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                170
            ],
            [
                170,
                245
            ],
            [
                245,
                406
            ],
            [
                406,
                486
            ],
            [
                486,
                639
            ],
            [
                639,
                683
            ],
            [
                683,
                774
            ],
            [
                774,
                807
            ],
            [
                807,
                876
            ],
            [
                876,
                941
            ],
            [
                941,
                984
            ],
            [
                984,
                1094
            ],
            [
                1094,
                1241
            ],
            [
                1241,
                1296
            ],
            [
                1296,
                1394
            ],
            [
                1394,
                1535
            ],
            [
                1535,
                1571
            ],
            [
                1571,
                1627
            ],
            [
                1627,
                1759
            ],
            [
                1759,
                1789
            ],
            [
                1789,
                1846
            ],
            [
                1846,
                1958
            ],
            [
                1958,
                1987
            ],
            [
                1987,
                2094
            ],
            [
                2094,
                2157
            ],
            [
                2157,
                2277
            ],
            [
                2277,
                2435
            ],
            [
                2435,
                2569
            ],
            [
                2569,
                2641
            ],
            [
                2641,
                2741
            ],
            [
                2741,
                2898
            ],
            [
                2898,
                2953
            ],
            [
                2953,
                3142
            ],
            [
                3142,
                3277
            ],
            [
                3277,
                3489
            ],
            [
                3489,
                3718
            ],
            [
                3718,
                3842
            ],
            [
                3842,
                3952
            ],
            [
                3952,
                4000
            ],
            [
                4000,
                4053
            ],
            [
                4053,
                4075
            ],
            [
                4075,
                4277
            ],
            [
                4277,
                4361
            ],
            [
                4361,
                4403
            ],
            [
                4403,
                4450
            ],
            [
                4450,
                4587
            ],
            [
                4587,
                4656
            ],
            [
                4656,
                4699
            ],
            [
                4699,
                4772
            ],
            [
                4772,
                4888
            ],
            [
                4888,
                4906
            ],
            [
                4906,
                4925
            ],
            [
                4925,
                4965
            ],
            [
                4965,
                4995
            ],
            [
                4995,
                5028
            ],
            [
                5028,
                5086
            ],
            [
                5086,
                5130
            ],
            [
                5130,
                5209
            ],
            [
                5209,
                5313
            ],
            [
                5313,
                5389
            ],
            [
                5389,
                5545
            ],
            [
                5545,
                5688
            ],
            [
                5688,
                5767
            ],
            [
                5767,
                5799
            ],
            [
                5799,
                5834
            ],
            [
                5834,
                5968
            ],
            [
                5968,
                6107
            ],
            [
                6107,
                6136
            ],
            [
                6136,
                6143
            ],
            [
                6143,
                6208
            ],
            [
                6208,
                6213
            ],
            [
                6213,
                6231
            ],
            [
                6231,
                6244
            ],
            [
                6244,
                6271
            ],
            [
                6271,
                6337
            ],
            [
                6337,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6455
            ],
            [
                6455,
                6489
            ],
            [
                6489,
                6587
            ],
            [
                6587,
                6652
            ],
            [
                6652,
                6709
            ],
            [
                6709,
                6827
            ],
            [
                6827,
                6922
            ],
            [
                6922,
                6977
            ],
            [
                6977,
                7063
            ],
            [
                7063,
                7212
            ],
            [
                7212,
                7265
            ],
            [
                7265,
                7325
            ],
            [
                7325,
                7359
            ],
            [
                7359,
                7420
            ],
            [
                7420,
                7494
            ],
            [
                7494,
                7544
            ],
            [
                7544,
                7634
            ],
            [
                7634,
                7690
            ],
            [
                7690,
                7712
            ],
            [
                7712,
                7768
            ],
            [
                7768,
                7828
            ],
            [
                7828,
                7931
            ],
            [
                7931,
                8013
            ],
            [
                8013,
                8100
            ],
            [
                8100,
                8206
            ],
            [
                8206,
                8393
            ],
            [
                8393,
                8501
            ],
            [
                8501,
                8648
            ],
            [
                8648,
                8848
            ],
            [
                8848,
                8984
            ],
            [
                8984,
                9034
            ],
            [
                9034,
                9083
            ],
            [
                9083,
                9114
            ],
            [
                9114,
                9182
            ],
            [
                9182,
                9203
            ],
            [
                9203,
                9222
            ],
            [
                9222,
                9324
            ],
            [
                9324,
                9378
            ],
            [
                9378,
                9456
            ],
            [
                9456,
                9490
            ],
            [
                9490,
                9516
            ],
            [
                9516,
                9582
            ],
            [
                9582,
                9628
            ],
            [
                9628,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9708
            ],
            [
                9708,
                9828
            ],
            [
                9828,
                9862
            ],
            [
                9862,
                9894
            ],
            [
                9894,
                9904
            ],
            [
                9904,
                9950
            ],
            [
                9950,
                10005
            ],
            [
                10005,
                10042
            ],
            [
                10042,
                10070
            ],
            [
                10070,
                10173
            ],
            [
                10173,
                10219
            ],
            [
                10219,
                10250
            ],
            [
                10250,
                10308
            ],
            [
                10308,
                10327
            ],
            [
                10327,
                10427
            ],
            [
                10427,
                10465
            ],
            [
                10465,
                10603
            ],
            [
                10603,
                10728
            ],
            [
                10728,
                10903
            ],
            [
                10903,
                11001
            ],
            [
                11001,
                11080
            ],
            [
                11080,
                11252
            ],
            [
                11252,
                11288
            ],
            [
                11288,
                11471
            ],
            [
                11471,
                11542
            ],
            [
                11542,
                11666
            ],
            [
                11666,
                11707
            ],
            [
                11707,
                11749
            ],
            [
                11749,
                11855
            ],
            [
                11855,
                11968
            ],
            [
                11968,
                12066
            ],
            [
                12066,
                12105
            ],
            [
                12105,
                12121
            ],
            [
                12121,
                12160
            ],
            [
                12160,
                12248
            ],
            [
                12248,
                12404
            ],
            [
                12404,
                12461
            ],
            [
                12461,
                12468
            ],
            [
                12468,
                12490
            ],
            [
                12490,
                12531
            ],
            [
                12531,
                12557
            ],
            [
                12557,
                12583
            ],
            [
                12583,
                12644
            ],
            [
                12644,
                12743
            ],
            [
                12743,
                12774
            ],
            [
                12774,
                12834
            ],
            [
                12834,
                12919
            ],
            [
                12919,
                12955
            ],
            [
                12955,
                13032
            ],
            [
                13032,
                13060
            ],
            [
                13060,
                13138
            ],
            [
                13138,
                13152
            ],
            [
                13152,
                13219
            ],
            [
                13219,
                13304
            ],
            [
                13304,
                13394
            ],
            [
                13394,
                13476
            ],
            [
                13476,
                13488
            ],
            [
                13488,
                13529
            ],
            [
                13529,
                13534
            ],
            [
                13534,
                13554
            ],
            [
                13554,
                13588
            ],
            [
                13588,
                13620
            ],
            [
                13620,
                13653
            ],
            [
                13653,
                13756
            ],
            [
                13756,
                14030
            ],
            [
                14030,
                14170
            ],
            [
                14170,
                14236
            ],
            [
                14236,
                14384
            ],
            [
                14384,
                14559
            ],
            [
                14559,
                14682
            ],
            [
                14682,
                14767
            ],
            [
                14767,
                15042
            ],
            [
                15042,
                15166
            ],
            [
                15166,
                15322
            ],
            [
                15322,
                15479
            ],
            [
                15479,
                15713
            ],
            [
                15713,
                15871
            ],
            [
                15871,
                15945
            ],
            [
                15945,
                16080
            ],
            [
                16080,
                16227
            ],
            [
                16227,
                16344
            ],
            [
                16344,
                16464
            ],
            [
                16464,
                16537
            ],
            [
                16537,
                16676
            ],
            [
                16676,
                16829
            ],
            [
                16829,
                16935
            ],
            [
                16935,
                17282
            ],
            [
                17282,
                17320
            ],
            [
                17320,
                17430
            ],
            [
                17430,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17523,
                17546
            ],
            [
                17546,
                17568
            ],
            [
                17568,
                17750
            ],
            [
                17750,
                17858
            ],
            [
                17858,
                17962
            ],
            [
                17962,
                18209
            ],
            [
                18209,
                18271
            ],
            [
                18271,
                18294
            ],
            [
                18294,
                18331
            ],
            [
                18331,
                18469
            ],
            [
                18469,
                18539
            ],
            [
                18539,
                18595
            ],
            [
                18595,
                18633
            ],
            [
                18633,
                18677
            ],
            [
                18677,
                18786
            ],
            [
                18786,
                18886
            ],
            [
                18886,
                18990
            ],
            [
                18990,
                19082
            ],
            [
                19082,
                19185
            ],
            [
                19185,
                19195
            ],
            [
                19195,
                19226
            ],
            [
                19226,
                19299
            ],
            [
                19299,
                19484
            ],
            [
                19484,
                19530
            ],
            [
                19530,
                19551
            ],
            [
                19551,
                19585
            ],
            [
                19585,
                19624
            ],
            [
                19624,
                19745
            ],
            [
                19745,
                19796
            ],
            [
                19796,
                19859
            ],
            [
                19859,
                19898
            ],
            [
                19898,
                19926
            ],
            [
                19926,
                19973
            ],
            [
                19973,
                20026
            ],
            [
                20026,
                20107
            ],
            [
                20107,
                20156
            ],
            [
                20156,
                20180
            ],
            [
                20180,
                20209
            ],
            [
                20209,
                20275
            ],
            [
                20275,
                20306
            ],
            [
                20306,
                20387
            ],
            [
                20387,
                20437
            ],
            [
                20437,
                20501
            ],
            [
                20501,
                20585
            ],
            [
                20585,
                20630
            ],
            [
                20630,
                20831
            ],
            [
                20831,
                20942
            ],
            [
                20942,
                21122
            ],
            [
                21122,
                21314
            ],
            [
                21314,
                21469
            ],
            [
                21469,
                21610
            ],
            [
                21610,
                21747
            ],
            [
                21747,
                21963
            ],
            [
                21963,
                22094
            ],
            [
                22094,
                22126
            ],
            [
                22126,
                22446
            ],
            [
                22446,
                22574
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                4,
                38
            ],
            [
                44,
                69
            ],
            [
                74,
                79
            ],
            [
                85,
                117
            ],
            [
                117,
                150
            ],
            [
                150,
                170
            ],
            [
                170,
                207
            ],
            [
                207,
                245
            ],
            [
                245,
                280
            ],
            [
                281,
                287
            ],
            [
                288,
                345
            ],
            [
                358,
                361
            ],
            [
                362,
                405
            ],
            [
                410,
                423
            ],
            [
                429,
                439
            ],
            [
                440,
                442
            ],
            [
                443,
                444
            ],
            [
                445,
                446
            ],
            [
                447,
                459
            ],
            [
                466,
                468
            ],
            [
                469,
                480
            ],
            [
                484,
                486
            ],
            [
                486,
                487
            ],
            [
                487,
                495
            ],
            [
                499,
                517
            ],
            [
                518,
                531
            ],
            [
                532,
                535
            ],
            [
                536,
                539
            ],
            [
                547,
                561
            ],
            [
                562,
                637
            ],
            [
                637,
                639
            ],
            [
                639,
                681
            ],
            [
                681,
                683
            ],
            [
                683,
                774
            ],
            [
                774,
                807
            ],
            [
                807,
                816
            ],
            [
                817,
                876
            ],
            [
                876,
                941
            ],
            [
                941,
                982
            ],
            [
                982,
                984
            ],
            [
                989,
                995
            ],
            [
                999,
                1000
            ],
            [
                1007,
                1048
            ],
            [
                1060,
                1092
            ],
            [
                1092,
                1094
            ],
            [
                1101,
                1150
            ],
            [
                1151,
                1152
            ],
            [
                1153,
                1156
            ],
            [
                1157,
                1166
            ],
            [
                1169,
                1233
            ],
            [
                1239,
                1241
            ],
            [
                1241,
                1295
            ],
            [
                1296,
                1394
            ],
            [
                1394,
                1509
            ],
            [
                1519,
                1528
            ],
            [
                1529,
                1533
            ],
            [
                1533,
                1535
            ],
            [
                1535,
                1569
            ],
            [
                1569,
                1571
            ],
            [
                1571,
                1624
            ],
            [
                1627,
                1682
            ],
            [
                1698,
                1759
            ],
            [
                1759,
                1778
            ],
            [
                1783,
                1787
            ],
            [
                1789,
                1846
            ],
            [
                1846,
                1958
            ],
            [
                1958,
                1987
            ],
            [
                1987,
                2081
            ],
            [
                2092,
                2094
            ],
            [
                2094,
                2101
            ],
            [
                2102,
                2108
            ],
            [
                2109,
                2112
            ],
            [
                2113,
                2155
            ],
            [
                2155,
                2157
            ],
            [
                2157,
                2163
            ],
            [
                2173,
                2176
            ],
            [
                2177,
                2203
            ],
            [
                2204,
                2209
            ],
            [
                2216,
                2272
            ],
            [
                2275,
                2276
            ],
            [
                2277,
                2326
            ],
            [
                2327,
                2355
            ],
            [
                2355,
                2401
            ],
            [
                2402,
                2433
            ],
            [
                2433,
                2435
            ],
            [
                2435,
                2569
            ],
            [
                2569,
                2572
            ],
            [
                2577,
                2618
            ],
            [
                2632,
                2639
            ],
            [
                2639,
                2641
            ],
            [
                2652,
                2653
            ],
            [
                2654,
                2725
            ],
            [
                2735,
                2739
            ],
            [
                2739,
                2741
            ],
            [
                2741,
                2784
            ],
            [
                2802,
                2808
            ],
            [
                2812,
                2815
            ],
            [
                2822,
                2874
            ],
            [
                2875,
                2897
            ],
            [
                2898,
                2901
            ],
            [
                2906,
                2953
            ],
            [
                2953,
                3001
            ],
            [
                3002,
                3005
            ],
            [
                3006,
                3070
            ],
            [
                3073,
                3140
            ],
            [
                3140,
                3142
            ],
            [
                3142,
                3189
            ],
            [
                3196,
                3235
            ],
            [
                3249,
                3256
            ],
            [
                3257,
                3275
            ],
            [
                3277,
                3284
            ],
            [
                3285,
                3298
            ],
            [
                3299,
                3302
            ],
            [
                3303,
                3464
            ],
            [
                3470,
                3489
            ],
            [
                3489,
                3552
            ],
            [
                3553,
                3555
            ],
            [
                3556,
                3586
            ],
            [
                3587,
                3606
            ],
            [
                3609,
                3612
            ],
            [
                3613,
                3718
            ],
            [
                3718,
                3759
            ],
            [
                3760,
                3764
            ],
            [
                3777,
                3795
            ],
            [
                3795,
                3840
            ],
            [
                3840,
                3842
            ],
            [
                3842,
                3889
            ],
            [
                3890,
                3906
            ],
            [
                3907,
                3952
            ],
            [
                3952,
                4000
            ],
            [
                4000,
                4043
            ],
            [
                4044,
                4051
            ],
            [
                4051,
                4053
            ],
            [
                4053,
                4075
            ],
            [
                4075,
                4277
            ],
            [
                4277,
                4361
            ],
            [
                4361,
                4392
            ],
            [
                4400,
                4403
            ],
            [
                4403,
                4450
            ],
            [
                4450,
                4470
            ],
            [
                4478,
                4563
            ],
            [
                4564,
                4587
            ],
            [
                4588,
                4656
            ],
            [
                4656,
                4667
            ],
            [
                4675,
                4699
            ],
            [
                4699,
                4772
            ],
            [
                4772,
                4888
            ],
            [
                4889,
                4906
            ],
            [
                4906,
                4922
            ],
            [
                4925,
                4928
            ],
            [
                4936,
                4963
            ],
            [
                4963,
                4965
            ],
            [
                4965,
                4995
            ],
            [
                4995,
                5018
            ],
            [
                5019,
                5028
            ],
            [
                5028,
                5034
            ],
            [
                5035,
                5041
            ],
            [
                5049,
                5086
            ],
            [
                5086,
                5130
            ],
            [
                5130,
                5209
            ],
            [
                5209,
                5313
            ],
            [
                5313,
                5338
            ],
            [
                5338,
                5339
            ],
            [
                5340,
                5389
            ],
            [
                5389,
                5466
            ],
            [
                5467,
                5492
            ],
            [
                5503,
                5510
            ],
            [
                5523,
                5543
            ],
            [
                5543,
                5545
            ],
            [
                5545,
                5554
            ],
            [
                5559,
                5565
            ],
            [
                5576,
                5613
            ],
            [
                5614,
                5630
            ],
            [
                5631,
                5643
            ],
            [
                5644,
                5649
            ],
            [
                5650,
                5658
            ],
            [
                5659,
                5679
            ],
            [
                5680,
                5682
            ],
            [
                5686,
                5687
            ],
            [
                5688,
                5767
            ],
            [
                5768,
                5799
            ],
            [
                5808,
                5832
            ],
            [
                5832,
                5834
            ],
            [
                5839,
                5842
            ],
            [
                5851,
                5853
            ],
            [
                5858,
                5860
            ],
            [
                5861,
                5867
            ],
            [
                5880,
                5892
            ],
            [
                5894,
                5903
            ],
            [
                5904,
                5968
            ],
            [
                5968,
                6040
            ],
            [
                6041,
                6047
            ],
            [
                6048,
                6053
            ],
            [
                6053,
                6105
            ],
            [
                6105,
                6107
            ],
            [
                6107,
                6133
            ],
            [
                6136,
                6143
            ],
            [
                6143,
                6208
            ],
            [
                6208,
                6213
            ],
            [
                6213,
                6231
            ],
            [
                6231,
                6244
            ],
            [
                6244,
                6271
            ],
            [
                6271,
                6322
            ],
            [
                6323,
                6327
            ],
            [
                6330,
                6337
            ],
            [
                6337,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6455
            ],
            [
                6455,
                6489
            ],
            [
                6489,
                6497
            ],
            [
                6498,
                6521
            ],
            [
                6521,
                6522
            ],
            [
                6523,
                6587
            ],
            [
                6587,
                6652
            ],
            [
                6652,
                6709
            ],
            [
                6709,
                6827
            ],
            [
                6835,
                6838
            ],
            [
                6853,
                6880
            ],
            [
                6887,
                6922
            ],
            [
                6922,
                6934
            ],
            [
                6935,
                6977
            ],
            [
                6977,
                6981
            ],
            [
                6988,
                6991
            ],
            [
                6999,
                7004
            ],
            [
                7017,
                7023
            ],
            [
                7024,
                7027
            ],
            [
                7028,
                7037
            ],
            [
                7038,
                7063
            ],
            [
                7063,
                7111
            ],
            [
                7112,
                7116
            ],
            [
                7116,
                7117
            ],
            [
                7118,
                7171
            ],
            [
                7187,
                7212
            ],
            [
                7212,
                7213
            ],
            [
                7213,
                7240
            ],
            [
                7244,
                7245
            ],
            [
                7250,
                7265
            ],
            [
                7265,
                7314
            ],
            [
                7315,
                7318
            ],
            [
                7319,
                7325
            ],
            [
                7325,
                7359
            ],
            [
                7359,
                7420
            ],
            [
                7420,
                7453
            ],
            [
                7453,
                7473
            ],
            [
                7479,
                7494
            ],
            [
                7494,
                7524
            ],
            [
                7534,
                7544
            ],
            [
                7544,
                7573
            ],
            [
                7574,
                7581
            ],
            [
                7603,
                7606
            ],
            [
                7607,
                7632
            ],
            [
                7632,
                7634
            ],
            [
                7634,
                7668
            ],
            [
                7688,
                7690
            ],
            [
                7691,
                7712
            ],
            [
                7712,
                7768
            ],
            [
                7768,
                7828
            ],
            [
                7828,
                7898
            ],
            [
                7906,
                7929
            ],
            [
                7931,
                7958
            ],
            [
                7959,
                7962
            ],
            [
                7963,
                7965
            ],
            [
                7966,
                8011
            ],
            [
                8011,
                8013
            ],
            [
                8018,
                8024
            ],
            [
                8029,
                8100
            ],
            [
                8100,
                8115
            ],
            [
                8116,
                8120
            ],
            [
                8121,
                8206
            ],
            [
                8206,
                8229
            ],
            [
                8230,
                8292
            ],
            [
                8299,
                8313
            ],
            [
                8318,
                8393
            ],
            [
                8393,
                8407
            ],
            [
                8408,
                8416
            ],
            [
                8417,
                8426
            ],
            [
                8427,
                8500
            ],
            [
                8508,
                8528
            ],
            [
                8528,
                8568
            ],
            [
                8575,
                8577
            ],
            [
                8583,
                8592
            ],
            [
                8599,
                8601
            ],
            [
                8602,
                8608
            ],
            [
                8609,
                8617
            ],
            [
                8618,
                8624
            ],
            [
                8625,
                8646
            ],
            [
                8646,
                8648
            ],
            [
                8648,
                8848
            ],
            [
                8848,
                8981
            ],
            [
                8981,
                8984
            ],
            [
                8984,
                9034
            ],
            [
                9034,
                9083
            ],
            [
                9083,
                9114
            ],
            [
                9114,
                9182
            ],
            [
                9182,
                9203
            ],
            [
                9203,
                9222
            ],
            [
                9222,
                9324
            ],
            [
                9324,
                9378
            ],
            [
                9378,
                9456
            ],
            [
                9456,
                9490
            ],
            [
                9490,
                9516
            ],
            [
                9516,
                9582
            ],
            [
                9582,
                9628
            ],
            [
                9628,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9708
            ],
            [
                9708,
                9828
            ],
            [
                9828,
                9862
            ],
            [
                9862,
                9894
            ],
            [
                9894,
                9904
            ],
            [
                9904,
                9950
            ],
            [
                9950,
                10005
            ],
            [
                10005,
                10023
            ],
            [
                10031,
                10042
            ],
            [
                10042,
                10070
            ],
            [
                10070,
                10173
            ],
            [
                10173,
                10219
            ],
            [
                10219,
                10250
            ],
            [
                10250,
                10308
            ],
            [
                10308,
                10327
            ],
            [
                10327,
                10366
            ],
            [
                10366,
                10427
            ],
            [
                10427,
                10465
            ],
            [
                10465,
                10523
            ],
            [
                10523,
                10603
            ],
            [
                10603,
                10727
            ],
            [
                10728,
                10763
            ],
            [
                10763,
                10804
            ],
            [
                10810,
                10813
            ],
            [
                10814,
                10850
            ],
            [
                10867,
                10869
            ],
            [
                10870,
                10903
            ],
            [
                10903,
                10923
            ],
            [
                10927,
                10930
            ],
            [
                10937,
                10999
            ],
            [
                11001,
                11050
            ],
            [
                11051,
                11080
            ],
            [
                11080,
                11083
            ],
            [
                11083,
                11084
            ],
            [
                11095,
                11113
            ],
            [
                11113,
                11114
            ],
            [
                11115,
                11185
            ],
            [
                11187,
                11189
            ],
            [
                11194,
                11250
            ],
            [
                11250,
                11252
            ],
            [
                11252,
                11254
            ],
            [
                11259,
                11261
            ],
            [
                11267,
                11269
            ],
            [
                11276,
                11286
            ],
            [
                11286,
                11287
            ],
            [
                11288,
                11363
            ],
            [
                11363,
                11364
            ],
            [
                11365,
                11393
            ],
            [
                11394,
                11404
            ],
            [
                11405,
                11416
            ],
            [
                11417,
                11419
            ],
            [
                11420,
                11433
            ],
            [
                11440,
                11469
            ],
            [
                11469,
                11471
            ],
            [
                11471,
                11514
            ],
            [
                11523,
                11541
            ],
            [
                11542,
                11552
            ],
            [
                11553,
                11576
            ],
            [
                11580,
                11666
            ],
            [
                11666,
                11669
            ],
            [
                11670,
                11674
            ],
            [
                11681,
                11705
            ],
            [
                11707,
                11749
            ],
            [
                11749,
                11759
            ],
            [
                11760,
                11772
            ],
            [
                11780,
                11853
            ],
            [
                11853,
                11855
            ],
            [
                11855,
                11858
            ],
            [
                11859,
                11898
            ],
            [
                11910,
                11922
            ],
            [
                11922,
                11968
            ],
            [
                11975,
                11985
            ],
            [
                11988,
                12033
            ],
            [
                12034,
                12037
            ],
            [
                12043,
                12064
            ],
            [
                12064,
                12066
            ],
            [
                12066,
                12105
            ],
            [
                12105,
                12121
            ],
            [
                12121,
                12160
            ],
            [
                12160,
                12237
            ],
            [
                12238,
                12248
            ],
            [
                12248,
                12253
            ],
            [
                12266,
                12403
            ],
            [
                12404,
                12461
            ],
            [
                12461,
                12468
            ],
            [
                12468,
                12490
            ],
            [
                12490,
                12529
            ],
            [
                12529,
                12531
            ],
            [
                12531,
                12557
            ],
            [
                12557,
                12583
            ],
            [
                12583,
                12644
            ],
            [
                12644,
                12743
            ],
            [
                12743,
                12774
            ],
            [
                12774,
                12797
            ],
            [
                12799,
                12834
            ],
            [
                12834,
                12919
            ],
            [
                12919,
                12955
            ],
            [
                12955,
                13032
            ],
            [
                13032,
                13060
            ],
            [
                13060,
                13135
            ],
            [
                13135,
                13138
            ],
            [
                13138,
                13152
            ],
            [
                13152,
                13219
            ],
            [
                13219,
                13304
            ],
            [
                13304,
                13394
            ],
            [
                13394,
                13475
            ],
            [
                13476,
                13477
            ],
            [
                13486,
                13488
            ],
            [
                13488,
                13529
            ],
            [
                13529,
                13534
            ],
            [
                13534,
                13554
            ],
            [
                13554,
                13588
            ],
            [
                13588,
                13617
            ],
            [
                13620,
                13653
            ],
            [
                13653,
                13756
            ],
            [
                13756,
                13928
            ],
            [
                13936,
                13957
            ],
            [
                13958,
                14013
            ],
            [
                14018,
                14028
            ],
            [
                14028,
                14030
            ],
            [
                14030,
                14095
            ],
            [
                14096,
                14168
            ],
            [
                14168,
                14169
            ],
            [
                14170,
                14186
            ],
            [
                14187,
                14201
            ],
            [
                14202,
                14236
            ],
            [
                14236,
                14327
            ],
            [
                14328,
                14363
            ],
            [
                14364,
                14384
            ],
            [
                14384,
                14559
            ],
            [
                14559,
                14647
            ],
            [
                14657,
                14660
            ],
            [
                14666,
                14668
            ],
            [
                14680,
                14682
            ],
            [
                14682,
                14765
            ],
            [
                14765,
                14767
            ],
            [
                14767,
                14887
            ],
            [
                14887,
                14979
            ],
            [
                14980,
                14990
            ],
            [
                14993,
                15007
            ],
            [
                15007,
                15041
            ],
            [
                15042,
                15142
            ],
            [
                15151,
                15160
            ],
            [
                15164,
                15166
            ],
            [
                15166,
                15223
            ],
            [
                15234,
                15307
            ],
            [
                15315,
                15320
            ],
            [
                15320,
                15321
            ],
            [
                15322,
                15429
            ],
            [
                15430,
                15437
            ],
            [
                15446,
                15449
            ],
            [
                15463,
                15479
            ],
            [
                15479,
                15486
            ],
            [
                15487,
                15497
            ],
            [
                15498,
                15535
            ],
            [
                15554,
                15575
            ],
            [
                15585,
                15614
            ],
            [
                15615,
                15618
            ],
            [
                15618,
                15633
            ],
            [
                15641,
                15684
            ],
            [
                15690,
                15713
            ],
            [
                15713,
                15848
            ],
            [
                15858,
                15871
            ],
            [
                15871,
                15921
            ],
            [
                15922,
                15945
            ],
            [
                15945,
                16080
            ],
            [
                16080,
                16084
            ],
            [
                16085,
                16130
            ],
            [
                16148,
                16175
            ],
            [
                16175,
                16176
            ],
            [
                16177,
                16179
            ],
            [
                16200,
                16207
            ],
            [
                16208,
                16214
            ],
            [
                16225,
                16227
            ],
            [
                16227,
                16344
            ],
            [
                16348,
                16361
            ],
            [
                16364,
                16404
            ],
            [
                16405,
                16464
            ],
            [
                16464,
                16469
            ],
            [
                16470,
                16535
            ],
            [
                16535,
                16537
            ],
            [
                16537,
                16585
            ],
            [
                16590,
                16594
            ],
            [
                16603,
                16649
            ],
            [
                16656,
                16665
            ],
            [
                16674,
                16676
            ],
            [
                16686,
                16687
            ],
            [
                16688,
                16694
            ],
            [
                16695,
                16762
            ],
            [
                16763,
                16785
            ],
            [
                16786,
                16792
            ],
            [
                16798,
                16826
            ],
            [
                16829,
                16833
            ],
            [
                16834,
                16915
            ],
            [
                16916,
                16919
            ],
            [
                16925,
                16933
            ],
            [
                16933,
                16935
            ],
            [
                16935,
                16941
            ],
            [
                16947,
                16950
            ],
            [
                16951,
                16995
            ],
            [
                16996,
                16998
            ],
            [
                17004,
                17064
            ],
            [
                17065,
                17082
            ],
            [
                17087,
                17101
            ],
            [
                17108,
                17204
            ],
            [
                17205,
                17240
            ],
            [
                17254,
                17259
            ],
            [
                17260,
                17268
            ],
            [
                17280,
                17282
            ],
            [
                17282,
                17320
            ],
            [
                17320,
                17331
            ],
            [
                17332,
                17396
            ],
            [
                17397,
                17430
            ],
            [
                17430,
                17493
            ],
            [
                17495,
                17523
            ],
            [
                17523,
                17546
            ],
            [
                17546,
                17565
            ],
            [
                17568,
                17682
            ],
            [
                17683,
                17703
            ],
            [
                17710,
                17718
            ],
            [
                17723,
                17726
            ],
            [
                17727,
                17750
            ],
            [
                17750,
                17768
            ],
            [
                17771,
                17818
            ],
            [
                17831,
                17839
            ],
            [
                17846,
                17858
            ],
            [
                17858,
                17866
            ],
            [
                17867,
                17919
            ],
            [
                17920,
                17923
            ],
            [
                17924,
                17927
            ],
            [
                17942,
                17960
            ],
            [
                17960,
                17961
            ],
            [
                17962,
                17970
            ],
            [
                17971,
                17973
            ],
            [
                17978,
                17979
            ],
            [
                17980,
                18005
            ],
            [
                18016,
                18095
            ],
            [
                18097,
                18209
            ],
            [
                18209,
                18269
            ],
            [
                18269,
                18271
            ],
            [
                18271,
                18294
            ],
            [
                18294,
                18331
            ],
            [
                18331,
                18380
            ],
            [
                18380,
                18402
            ],
            [
                18403,
                18469
            ],
            [
                18469,
                18537
            ],
            [
                18537,
                18539
            ],
            [
                18539,
                18541
            ],
            [
                18551,
                18593
            ],
            [
                18593,
                18594
            ],
            [
                18595,
                18633
            ],
            [
                18633,
                18667
            ],
            [
                18674,
                18677
            ],
            [
                18677,
                18704
            ],
            [
                18707,
                18728
            ],
            [
                18742,
                18778
            ],
            [
                18779,
                18784
            ],
            [
                18784,
                18785
            ],
            [
                18786,
                18886
            ],
            [
                18886,
                18988
            ],
            [
                18988,
                18990
            ],
            [
                18990,
                19080
            ],
            [
                19080,
                19081
            ],
            [
                19082,
                19083
            ],
            [
                19083,
                19140
            ],
            [
                19143,
                19163
            ],
            [
                19171,
                19185
            ],
            [
                19185,
                19195
            ],
            [
                19195,
                19226
            ],
            [
                19226,
                19299
            ],
            [
                19299,
                19300
            ],
            [
                19300,
                19303
            ],
            [
                19308,
                19315
            ],
            [
                19320,
                19392
            ],
            [
                19406,
                19448
            ],
            [
                19449,
                19481
            ],
            [
                19481,
                19484
            ],
            [
                19484,
                19530
            ],
            [
                19530,
                19551
            ],
            [
                19551,
                19556
            ],
            [
                19557,
                19560
            ],
            [
                19561,
                19582
            ],
            [
                19582,
                19585
            ],
            [
                19585,
                19624
            ],
            [
                19624,
                19657
            ],
            [
                19664,
                19745
            ],
            [
                19745,
                19788
            ],
            [
                19794,
                19796
            ],
            [
                19796,
                19810
            ],
            [
                19811,
                19859
            ],
            [
                19859,
                19898
            ],
            [
                19898,
                19926
            ],
            [
                19926,
                19964
            ],
            [
                19965,
                19973
            ],
            [
                19973,
                20026
            ],
            [
                20026,
                20107
            ],
            [
                20107,
                20127
            ],
            [
                20129,
                20156
            ],
            [
                20156,
                20165
            ],
            [
                20177,
                20180
            ],
            [
                20180,
                20209
            ],
            [
                20209,
                20275
            ],
            [
                20275,
                20306
            ],
            [
                20306,
                20387
            ],
            [
                20387,
                20437
            ],
            [
                20437,
                20443
            ],
            [
                20444,
                20501
            ],
            [
                20501,
                20582
            ],
            [
                20585,
                20592
            ],
            [
                20593,
                20597
            ],
            [
                20615,
                20619
            ],
            [
                20628,
                20630
            ],
            [
                20630,
                20663
            ],
            [
                20675,
                20710
            ],
            [
                20718,
                20742
            ],
            [
                20743,
                20807
            ],
            [
                20808,
                20829
            ],
            [
                20831,
                20861
            ],
            [
                20862,
                20920
            ],
            [
                20921,
                20941
            ],
            [
                20942,
                21001
            ],
            [
                21013,
                21030
            ],
            [
                21041,
                21087
            ],
            [
                21088,
                21095
            ],
            [
                21107,
                21114
            ],
            [
                21115,
                21120
            ],
            [
                21120,
                21122
            ],
            [
                21129,
                21219
            ],
            [
                21224,
                21237
            ],
            [
                21237,
                21274
            ],
            [
                21275,
                21313
            ],
            [
                21314,
                21317
            ],
            [
                21330,
                21372
            ],
            [
                21373,
                21376
            ],
            [
                21382,
                21385
            ],
            [
                21389,
                21418
            ],
            [
                21432,
                21469
            ],
            [
                21469,
                21507
            ],
            [
                21507,
                21512
            ],
            [
                21513,
                21610
            ],
            [
                21610,
                21617
            ],
            [
                21620,
                21747
            ],
            [
                21747,
                21963
            ],
            [
                21963,
                21976
            ],
            [
                21977,
                22094
            ],
            [
                22094,
                22126
            ],
            [
                22126,
                22136
            ],
            [
                22148,
                22151
            ],
            [
                22166,
                22196
            ],
            [
                22196,
                22212
            ],
            [
                22213,
                22225
            ],
            [
                22226,
                22289
            ],
            [
                22289,
                22304
            ],
            [
                22305,
                22323
            ],
            [
                22324,
                22332
            ],
            [
                22333,
                22406
            ],
            [
                22406,
                22407
            ],
            [
                22408,
                22427
            ],
            [
                22444,
                22446
            ],
            [
                22446,
                22525
            ],
            [
                22528,
                22574
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                117
            ],
            [
                117,
                170
            ],
            [
                170,
                245
            ],
            [
                245,
                406
            ],
            [
                406,
                486
            ],
            [
                486,
                639
            ],
            [
                639,
                683
            ],
            [
                683,
                774
            ],
            [
                774,
                807
            ],
            [
                807,
                876
            ],
            [
                876,
                941
            ],
            [
                941,
                984
            ],
            [
                984,
                1094
            ],
            [
                1094,
                1241
            ],
            [
                1241,
                1241
            ],
            [
                1241,
                1296
            ],
            [
                1296,
                1296
            ],
            [
                1296,
                1296
            ],
            [
                1296,
                1296
            ],
            [
                1296,
                1394
            ],
            [
                1394,
                1535
            ],
            [
                1535,
                1571
            ],
            [
                1571,
                1627
            ],
            [
                1627,
                1627
            ],
            [
                1627,
                1627
            ],
            [
                1627,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1759
            ],
            [
                1759,
                1789
            ],
            [
                1789,
                1789
            ],
            [
                1789,
                1846
            ],
            [
                1846,
                1958
            ],
            [
                1958,
                1987
            ],
            [
                1987,
                2094
            ],
            [
                2094,
                2157
            ],
            [
                2157,
                2277
            ],
            [
                2277,
                2435
            ],
            [
                2435,
                2569
            ],
            [
                2569,
                2641
            ],
            [
                2641,
                2741
            ],
            [
                2741,
                2898
            ],
            [
                2898,
                2953
            ],
            [
                2953,
                3142
            ],
            [
                3142,
                3489
            ],
            [
                3489,
                3718
            ],
            [
                3718,
                3718
            ],
            [
                3718,
                3842
            ],
            [
                3842,
                3952
            ],
            [
                3952,
                4000
            ],
            [
                4000,
                4053
            ],
            [
                4053,
                4075
            ],
            [
                4075,
                4277
            ],
            [
                4277,
                4361
            ],
            [
                4361,
                4403
            ],
            [
                4403,
                4450
            ],
            [
                4450,
                4587
            ],
            [
                4587,
                4656
            ],
            [
                4656,
                4699
            ],
            [
                4699,
                4772
            ],
            [
                4772,
                4888
            ],
            [
                4888,
                4906
            ],
            [
                4906,
                4925
            ],
            [
                4925,
                4965
            ],
            [
                4965,
                4995
            ],
            [
                4995,
                5028
            ],
            [
                5028,
                5086
            ],
            [
                5086,
                5130
            ],
            [
                5130,
                5209
            ],
            [
                5209,
                5313
            ],
            [
                5313,
                5389
            ],
            [
                5389,
                5545
            ],
            [
                5545,
                5688
            ],
            [
                5688,
                5767
            ],
            [
                5767,
                5767
            ],
            [
                5767,
                5799
            ],
            [
                5799,
                5834
            ],
            [
                5834,
                5968
            ],
            [
                5968,
                6107
            ],
            [
                6107,
                6136
            ],
            [
                6136,
                6143
            ],
            [
                6143,
                6208
            ],
            [
                6208,
                6213
            ],
            [
                6213,
                6231
            ],
            [
                6231,
                6244
            ],
            [
                6244,
                6271
            ],
            [
                6271,
                6337
            ],
            [
                6337,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6455
            ],
            [
                6455,
                6489
            ],
            [
                6489,
                6587
            ],
            [
                6587,
                6652
            ],
            [
                6652,
                6709
            ],
            [
                6709,
                6827
            ],
            [
                6827,
                6827
            ],
            [
                6827,
                6827
            ],
            [
                6827,
                6922
            ],
            [
                6922,
                6977
            ],
            [
                6977,
                7063
            ],
            [
                7063,
                7212
            ],
            [
                7212,
                7265
            ],
            [
                7265,
                7325
            ],
            [
                7325,
                7359
            ],
            [
                7359,
                7420
            ],
            [
                7420,
                7494
            ],
            [
                7494,
                7544
            ],
            [
                7544,
                7634
            ],
            [
                7634,
                7690
            ],
            [
                7690,
                7712
            ],
            [
                7712,
                7768
            ],
            [
                7768,
                7768
            ],
            [
                7768,
                7828
            ],
            [
                7828,
                8013
            ],
            [
                8013,
                8100
            ],
            [
                8100,
                8206
            ],
            [
                8206,
                8206
            ],
            [
                8206,
                8393
            ],
            [
                8393,
                8501
            ],
            [
                8501,
                8501
            ],
            [
                8501,
                8648
            ],
            [
                8648,
                8848
            ],
            [
                8848,
                8848
            ],
            [
                8848,
                8848
            ],
            [
                8848,
                8848
            ],
            [
                8848,
                8848
            ],
            [
                8848,
                8984
            ],
            [
                8984,
                9034
            ],
            [
                9034,
                9083
            ],
            [
                9083,
                9114
            ],
            [
                9114,
                9182
            ],
            [
                9182,
                9203
            ],
            [
                9203,
                9222
            ],
            [
                9222,
                9324
            ],
            [
                9324,
                9378
            ],
            [
                9378,
                9456
            ],
            [
                9456,
                9490
            ],
            [
                9490,
                9516
            ],
            [
                9516,
                9582
            ],
            [
                9582,
                9628
            ],
            [
                9628,
                9656
            ],
            [
                9656,
                9682
            ],
            [
                9682,
                9708
            ],
            [
                9708,
                9828
            ],
            [
                9828,
                9862
            ],
            [
                9862,
                9894
            ],
            [
                9894,
                9904
            ],
            [
                9904,
                9950
            ],
            [
                9950,
                10005
            ],
            [
                10005,
                10042
            ],
            [
                10042,
                10042
            ],
            [
                10042,
                10070
            ],
            [
                10070,
                10173
            ],
            [
                10173,
                10219
            ],
            [
                10219,
                10250
            ],
            [
                10250,
                10308
            ],
            [
                10308,
                10327
            ],
            [
                10327,
                10427
            ],
            [
                10427,
                10465
            ],
            [
                10465,
                10603
            ],
            [
                10603,
                10728
            ],
            [
                10728,
                10728
            ],
            [
                10728,
                10903
            ],
            [
                10903,
                11001
            ],
            [
                11001,
                11080
            ],
            [
                11080,
                11252
            ],
            [
                11252,
                11252
            ],
            [
                11252,
                11471
            ],
            [
                11471,
                11542
            ],
            [
                11542,
                11666
            ],
            [
                11666,
                11707
            ],
            [
                11707,
                11749
            ],
            [
                11749,
                11855
            ],
            [
                11855,
                11968
            ],
            [
                11968,
                12066
            ],
            [
                12066,
                12105
            ],
            [
                12105,
                12121
            ],
            [
                12121,
                12160
            ],
            [
                12160,
                12248
            ],
            [
                12248,
                12404
            ],
            [
                12404,
                12404
            ],
            [
                12404,
                12461
            ],
            [
                12461,
                12468
            ],
            [
                12468,
                12490
            ],
            [
                12490,
                12531
            ],
            [
                12531,
                12557
            ],
            [
                12557,
                12583
            ],
            [
                12583,
                12644
            ],
            [
                12644,
                12743
            ],
            [
                12743,
                12774
            ],
            [
                12774,
                12834
            ],
            [
                12834,
                12919
            ],
            [
                12919,
                12919
            ],
            [
                12919,
                12919
            ],
            [
                12919,
                12919
            ],
            [
                12919,
                12955
            ],
            [
                12955,
                13032
            ],
            [
                13032,
                13060
            ],
            [
                13060,
                13138
            ],
            [
                13138,
                13152
            ],
            [
                13152,
                13219
            ],
            [
                13219,
                13304
            ],
            [
                13304,
                13394
            ],
            [
                13394,
                13476
            ],
            [
                13476,
                13476
            ],
            [
                13476,
                13488
            ],
            [
                13488,
                13529
            ],
            [
                13529,
                13534
            ],
            [
                13534,
                13554
            ],
            [
                13554,
                13588
            ],
            [
                13588,
                13620
            ],
            [
                13620,
                13653
            ],
            [
                13653,
                13756
            ],
            [
                13756,
                14030
            ],
            [
                14030,
                14170
            ],
            [
                14170,
                14170
            ],
            [
                14170,
                14236
            ],
            [
                14236,
                14384
            ],
            [
                14384,
                14384
            ],
            [
                14384,
                14559
            ],
            [
                14559,
                14682
            ],
            [
                14682,
                14767
            ],
            [
                14767,
                15042
            ],
            [
                15042,
                15166
            ],
            [
                15166,
                15322
            ],
            [
                15322,
                15479
            ],
            [
                15479,
                15713
            ],
            [
                15713,
                15871
            ],
            [
                15871,
                15945
            ],
            [
                15945,
                16080
            ],
            [
                16080,
                16227
            ],
            [
                16227,
                16344
            ],
            [
                16344,
                16464
            ],
            [
                16464,
                16537
            ],
            [
                16537,
                16676
            ],
            [
                16676,
                16829
            ],
            [
                16829,
                16935
            ],
            [
                16935,
                17282
            ],
            [
                17282,
                17320
            ],
            [
                17320,
                17430
            ],
            [
                17430,
                17494
            ],
            [
                17494,
                17494
            ],
            [
                17494,
                17523
            ],
            [
                17523,
                17546
            ],
            [
                17546,
                17568
            ],
            [
                17568,
                17750
            ],
            [
                17750,
                17858
            ],
            [
                17858,
                17858
            ],
            [
                17858,
                17962
            ],
            [
                17962,
                18209
            ],
            [
                18209,
                18271
            ],
            [
                18271,
                18294
            ],
            [
                18294,
                18331
            ],
            [
                18331,
                18469
            ],
            [
                18469,
                18539
            ],
            [
                18539,
                18595
            ],
            [
                18595,
                18595
            ],
            [
                18595,
                18633
            ],
            [
                18633,
                18677
            ],
            [
                18677,
                18786
            ],
            [
                18786,
                18786
            ],
            [
                18786,
                18886
            ],
            [
                18886,
                18990
            ],
            [
                18990,
                19082
            ],
            [
                19082,
                19082
            ],
            [
                19082,
                19185
            ],
            [
                19185,
                19195
            ],
            [
                19195,
                19226
            ],
            [
                19226,
                19299
            ],
            [
                19299,
                19484
            ],
            [
                19484,
                19484
            ],
            [
                19484,
                19484
            ],
            [
                19484,
                19530
            ],
            [
                19530,
                19551
            ],
            [
                19551,
                19585
            ],
            [
                19585,
                19624
            ],
            [
                19624,
                19624
            ],
            [
                19624,
                19745
            ],
            [
                19745,
                19796
            ],
            [
                19796,
                19859
            ],
            [
                19859,
                19898
            ],
            [
                19898,
                19926
            ],
            [
                19926,
                19973
            ],
            [
                19973,
                20026
            ],
            [
                20026,
                20107
            ],
            [
                20107,
                20156
            ],
            [
                20156,
                20180
            ],
            [
                20180,
                20209
            ],
            [
                20209,
                20275
            ],
            [
                20275,
                20275
            ],
            [
                20275,
                20306
            ],
            [
                20306,
                20387
            ],
            [
                20387,
                20437
            ],
            [
                20437,
                20501
            ],
            [
                20501,
                20585
            ],
            [
                20585,
                20585
            ],
            [
                20585,
                20585
            ],
            [
                20585,
                20630
            ],
            [
                20630,
                20942
            ],
            [
                20942,
                21122
            ],
            [
                21122,
                21314
            ],
            [
                21314,
                21469
            ],
            [
                21469,
                21610
            ],
            [
                21610,
                21610
            ],
            [
                21610,
                21610
            ],
            [
                21610,
                21747
            ],
            [
                21747,
                21963
            ],
            [
                21963,
                22094
            ],
            [
                22094,
                22126
            ],
            [
                22126,
                22446
            ],
            [
                22446,
                22574
            ]
        ]
    }
}