{
    "original": {
        "text": "\"Surely whoever speaks to me in the right voice, him or her I shall follow. As the water follows the moon, silently, with fluid steps anywhere around the globe.\" --WALT WHITMAN.\n\"Now my cousins are at Diplow,\" said Grandcourt, \"will you go there?--to-morrow? The carriage shall come for Mrs. Davilow. You can tell me what you would like done in the rooms. Things must be put in decent order while we are away at Ryelands. And to-morrow is the only day.\"\nHe was sitting sideways on a sofa in the drawing-room at Offendene, one hand and elbow resting on the back, and the other hand thrust between his crossed knees--in the attitude of a man who is much interested in watching the person next to him. Gwendolen, who had always disliked needlework, had taken to it with apparent zeal since her engagement, and now held a piece of white embroidery which, on examination, would have shown many false stitches. During the last eight or nine days their hours had been chiefly spent on horseback, but some margin had always been left for this more difficult sort of companionship, which, however, Gwendolen had not found disagreeable. She was very well satisfied with Grandcourt. His answers to her lively questions about what he had seen and done in his life, bore drawling very well. From the first she had noticed that he knew what to say; and she was constantly feeling not only that he had nothing of the fool in his composition, but that by some subtle means he communicated to her the impression that all the folly lay with other people, who did what he did not care to do. A man who seems to have been able to command the best, has a sovereign power of depreciation. Then Grandcourt's behavior as a lover had hardly at all passed the limit of an amorous homage which was inobtrusive as a wafted odor of roses, and spent all its effects in a gratified vanity. One day, indeed, he had kissed not her cheek but her neck a little below her ear; and Gwendolen, taken by surprise, had started up with a marked agitation which made him rise too and say, \"I beg your pardon--did I annoy you?\" \"Oh, it was nothing,\" said Gwendolen, rather afraid of herself, \"only I cannot bear--to be kissed under my ear.\" She sat down again with a little playful laugh, but all the while she felt her heart beating with a vague fear: she was no longer at liberty to flout him as she had flouted poor Rex. Her agitation seemed not uncomplimentary, and he had been contented not to transgress again.\nTo-day a slight rain hindered riding; but to compensate, a package had come from London, and Mrs. Davilow had just left the room after bringing in for admiration the beautiful things (of Grandcourt's ordering) which lay scattered about on the tables. Gwendolen was just then enjoying the scenery of her life. She let her hands fall on her lap, and said with a pretty air of perversity,\n\"Why is to-morrow the only day?\"\n\"Because the next day is the first with the hounds,\" said Grandcourt.\n\"And after that?\"\n\"After that I must go away for a couple of days--it's a bore--but I shall go one day and come back the next.\" Grandcourt noticed a change in her face, and releasing his hand from under his knees, he laid it on hers, and said, \"You object to my going away?\"\n\"It's no use objecting,\" said Gwendolen, coldly. She was resisting to the utmost her temptation to tell him that she suspected to whom he was going--the temptation to make a clean breast, speaking without restraint.\n\"Yes it is,\" said Grandcourt, enfolding her hand. \"I will put off going. And I will travel at night, so as only to be away one day.\" He thought that he knew the reason of what he inwardly called this bit of temper, and she was particularly fascinating to him at this moment.\n\"Then don't put off going, but travel at night,\" said Gwendolen, feeling that she could command him, and finding in this peremptoriness a small outlet for her irritation.\n\"Then you will go to Diplow to-morrow?\"\n\"Oh, yes, if you wish it,\" said Gwendolen, in a high tone of careless assent. Her concentration in other feelings had really hindered her from taking notice that her hand was being held.\n\"How you treat us poor devils of men!\" said Grandcourt, lowering his tone. \"We are always getting the worst of it.\"\n\"_Are_ you?\" said Gwendolen, in a tone of inquiry, looking at him more navely than usual. She longed to believe this commonplace _badinage_ as the serious truth about her lover: in that case, she too was justified. If she knew everything, Mrs. Glasher would appear more blamable than Grandcourt. \"_Are_ you always getting the worst?\"\n\"Yes. Are you as kind to me as I am to you?\" said Grandcourt, looking into her eyes with his narrow gaze.\nGwendolen felt herself stricken. She was conscious of having received so much, that her sense of command was checked, and sank away in the perception that, look around her as she might, she could not turn back: it was as if she had consented to mount a chariot where another held the reins; and it was not in her nature to leap out in the eyes of the world. She had not consented in ignorance, and all she could say now would be a confession that she had not been ignorant. Her right to explanation was gone. All she had to do now was to adjust herself, so that the spikes of that unwilling penance which conscience imposed should not gall her. With a sort of mental shiver, she resolutely changed her mental attitude. There had been a little pause, during which she had not turned away her eyes; and with a sudden break into a smile, she said,\n\"If I were as kind to you as you are to me, that would spoil your generosity: it would no longer be as great as it could be--and it is that now.\"\n\"Then I am not to ask for one kiss,\" said Grandcourt, contented to pay a large price for this new kind of love-making, which introduced marriage by the finest contrast.\n\"Not one?\" said Gwendolen, getting saucy, and nodding at him defiantly.\nHe lifted her little left hand to his lips, and then released it respectfully. Clearly it was faint praise to say of him that he was not disgusting: he was almost charming; and she felt at this moment that it was not likely she could ever have loved another man better than this one. His reticence gave her some inexplicable, delightful consciousness.\n\"Apropos,\" she said, taking up her work again, \"is there any one besides Captain and Mrs. Torrington at Diplow?--or do you leave them _tete--tete_? I suppose he converses in cigars, and she answers with her chignon.\"\n\"She has a sister with her,\" said Grandcourt, with his shadow of a smile, \"and there are two men besides--one of them you know, I believe.\"\n\"Ah, then, I have a poor opinion of him,\" said Gwendolen, shaking her head.\n\"You saw him at Leubronn--young Deronda--a young fellow with the Mallingers.\"\nGwendolen felt as if her heart were making a sudden gambol, and her fingers, which tried to keep a firm hold on her work, got cold.\n\"I never spoke to him,\" she said, dreading any discernible change in herself. \"Is he not disagreeable?\"\n\"No, not particularly,\" said Grandcourt, in his most languid way. \"He thinks a little too much of himself. I thought he had been introduced to you.\"\n\"No. Some one told me his name the evening before I came away. That was all. What is he?\"\n\"A sort of ward of Sir Hugo Mallinger's. Nothing of any consequence.\"\n\"Oh, poor creature! How very unpleasant for him!\" said Gwendolen, speaking from the lip, and not meaning any sarcasm. \"I wonder if it has left off raining!\" she added, rising and going to look out of the window.\nHappily it did not rain the next day, and Gwendolen rode to Diplow on Criterion as she had done on that former day when she returned with her mother in the carriage. She always felt the more daring for being in her riding-dress; besides having the agreeable belief that she looked as well as possible in it--a sustaining consciousness in any meeting which seems formidable. Her anger toward Deronda had changed into a superstitious dread--due, perhaps, to the coercion he had exercised over her thought--lest the first interference of his in her life might foreshadow some future influence. It is of such stuff that superstitions are commonly made: an intense feeling about ourselves which makes the evening star shine at us with a threat, and the blessing of a beggar encourage us. And superstitions carry consequences which often verify their hope or their foreboding.\nThe time before luncheon was taken up for Gwendolen by going over the rooms with Mrs. Torrington and Mrs. Davilow; and she thought it likely that if she saw Deronda, there would hardly be need for more than a bow between them. She meant to notice him as little as possible.\nAnd after all she found herself under an inward compulsion too strong for her pride. From the first moment of their being in the room together, she seemed to herself to be doing nothing but notice him; everything else was automatic performance of an habitual part.\nWhen he took his place at lunch, Grandcourt had said, \"Deronda, Miss Harleth tells me you were not introduced to her at Leubronn?\"\n\"Miss Harleth hardly remembers me, I imagine,\" said Deronda, looking at her quite simply, as they bowed. \"She was intensely occupied when I saw her.\"\nNow, did he suppose that she had not suspected him of being the person who redeemed her necklace?\n\"On the contrary. I remember you very well,\" said Gwendolen, feeling rather nervous, but governing herself and looking at him in return with new examination. \"You did not approve of my playing at roulette.\"\n\"How did you come to that conclusion?\" said Deronda, gravely.\n\"Oh, you cast an evil eye on my play,\" said Gwendolen, with a turn of her head and a smile. \"I began to lose as soon as you came to look on. I had always been winning till then.\"\n\"Roulette in such a kennel as Leubronn is a horrid bore,\" said Grandcourt.\n\"_I_ found it a bore when I began to lose,\" said Gwendolen. Her face was turned toward Grandcourt as she smiled and spoke, but she gave a sidelong glance at Deronda, and saw his eyes fixed on her with a look so gravely penetrating that it had a keener edge for her than his ironical smile at her losses--a keener edge than Klesmer's judgment. She wheeled her neck round as if she wanted to listen to what was being said by the rest, while she was only thinking of Deronda. His face had that disturbing kind of form and expression which threatens to affect opinion--as if one's standard was somehow wrong. (Who has not seen men with faces of this corrective power till they frustrated it by speech or action?) His voice, heard now for the first time, was to Grandcourt's toneless drawl, which had been in her ears every day, as the deep notes of a violoncello to the broken discourse of poultry and other lazy gentry in the afternoon sunshine. Grandcourt, she inwardly conjectured, was perhaps right in saying that Deronda thought too much of himself:--a favorite way of explaining a superiority that humiliates. However the talk turned on the rinderpest and Jamaica, and no more was said about roulette. Grandcourt held that the Jamaica negro was a beastly sort of baptist Caliban; Deronda said he had always felt a little with Caliban, who naturally had his own point of view and could sing a good song; Mrs. Davilow observed that her father had an estate in Barbadoes, but that she herself had never been in the West Indies; Mrs. Torrington was sure she should never sleep in her bed if she lived among blacks; her husband corrected her by saying that the blacks would be manageable enough if it were not for the half-breeds; and Deronda remarked that the whites had to thank themselves for the half-breeds.\nWhile this polite pea-shooting was going on, Gwendolen trifled with her jelly, and looked at every speaker in turn that she might feel at ease in looking at Deronda.\n\"I wonder what he thinks of me, really? He must have felt interested in me, else he would not have sent me my necklace. I wonder what he thinks of my marriage? What notions has he to make him so grave about things? Why is he come to Diplow?\"\nThese questions ran in her mind as the voice of an uneasy longing to be judged by Deronda with unmixed admiration--a longing which had had its seed in her first resentment at his critical glance. Why did she care so much about the opinion of this man who was \"nothing of any consequence\"? She had no time to find the reason--she was too much engaged in caring. In the drawing-room, when something had called Grandcourt away, she went quite unpremeditatedly up to Deronda, who was standing at a table apart, turning over some prints, and said to him,\n\"Shall you hunt to-morrow, Mr. Deronda?\"\n\"Yes, I believe so.\"\n\"You don't object to hunting, then?\"\n\"I find excuses for it. It is a sin I am inclined to--when I can't get boating or cricketing.\"\n\"Do you object to my hunting?\" said Gwendolen, with a saucy movement of the chin.\n\"I have no right to object to anything you choose to do.\"\n\"You thought you had a right to object to my gambling,\" persisted Gwendolen.\n\"I was sorry for it. I am not aware that I told you of my objection,\" said Deronda, with his usual directness of gaze--a large-eyed gravity, innocent of any intention. His eyes had a peculiarity which has drawn many men into trouble; they were of a dark yet mild intensity which seemed to express a special interest in every one on whom he fixed them, and might easily help to bring on him those claims which ardently sympathetic people are often creating in the minds of those who need help. In mendicant fashion we make the goodness of others a reason for exorbitant demands on them. That sort of effect was penetrating Gwendolen.\n\"You hindered me from gambling again,\" she answered. But she had no sooner spoken than she blushed over face and neck; and Deronda blushed, too, conscious that in the little affair of the necklace he had taken a questionable freedom.\nIt was impossible to speak further; and she turned away to a window, feeling that she had stupidly said what she had not meant to say, and yet being rather happy that she had plunged into this mutual understanding. Deronda also did not dislike it. Gwendolen seemed more decidedly attractive than before; and certainly there had been changes going on within her since that time at Leubronn: the struggle of mind attending a conscious error had wakened something like a new soul, which had better, but also worse, possibilities than her former poise of crude self-confidence: among the forces she had come to dread was something within her that troubled satisfaction.\nThat evening Mrs. Davilow said, \"Was it really so, or only a joke of yours, about Mr. Deronda's spoiling your play, Gwen?\"\nHer curiosity had been excited, and she could venture to ask a question that did not concern Mr. Grandcourt.\n\"Oh, it merely happened that he was looking on when I began to lose,\" said Gwendolen, carelessly. \"I noticed him.\"\n\"I don't wonder at that: he is a striking young man. He puts me in mind of Italian paintings. One would guess, without being told, that there was foreign blood in his veins.\"\n\"Is there?\" said Gwendolen.\n\"Mrs. Torrington says so. I asked particularly who he was, and she told me that his mother was some foreigner of high rank.\"\n\"His mother?\" said Gwendolen, rather sharply. \"Then who was his father?\"\n\"Well--every one says he is the son of Sir Hugo Mallinger, who brought him up; though he passes for a ward. She says, if Sir Hugo Mallinger could have done as he liked with his estates, he would have left them to this Mr. Deronda, since he has no legitimate son.\"\nGwendolen was silent; but her mother observed so marked an effect in her face that she was angry with herself for having repeated Mrs. Torrington's gossip. It seemed, on reflection, unsuited to the ear of her daughter, for whom Mrs. Davilow disliked what is called knowledge of the world; and indeed she wished that she herself had not had any of it thrust upon her.\nAn image which had immediately arisen in Gwendolen's mind was that of the unknown mother--no doubt a dark-eyed woman--probably sad. Hardly any face could be less like Deronda's than that represented as Sir Hugo's in a crayon portrait at Diplow. A dark-eyed woman, no longer young, had become \"stuff o' the conscience\" to Gwendolen.\nThat night when she had got into her little bed, and only a dim light was burning, she said,\n\"Mamma, have men generally children before they are married?\"\n\"No, dear, no,\" said Mrs. Davilow. \"Why do you ask such a question?\" (But she began to think that she saw the why.)\n\"If it were so, I ought to know,\" said Gwendolen, with some indignation.\n\"You are thinking of what I said about Mr. Deronda and Sir Hugo Mallinger. That is a very unusual case, dear.\"\n\"Does Lady Mallinger know?\"\n\"She knows enough to satisfy her. That is quite clear, because Mr. Deronda has lived with them.\"\n\"And people think no worse of him?\"\n\"Well, of course he is under some disadvantage: it is not as if he were Lady Mallinger's son. He does not inherit the property, and he is not of any consequence in the world. But people are not obliged to know anything about his birth; you see, he is very well received.\"\n\"I wonder whether he knows about it; and whether he is angry with his father?\"\n\"My dear child, why should you think of that?\"\n\"Why?\" said Gwendolen, impetuously, sitting up in her bed. \"Haven't children reason to be angry with their parents? How can they help their parents marrying or not marrying?\"\nBut a consciousness rushed upon her, which made her fall back again on her pillow. It was not only what she would have felt months before--that she might seem to be reproaching her mother for that second marriage of hers; what she chiefly felt now was that she had been led on to a condemnation which seemed to make her own marriage a forbidden thing.\nThere was no further talk, and till sleep came over her Gwendolen lay struggling with the reasons against that marriage--reasons which pressed upon her newly now that they were unexpectedly mirrored in the story of a man whose slight relations with her had, by some hidden affinity, bitten themselves into the most permanent layers of feeling. It was characteristic that, with all her debating, she was never troubled by the question whether the indefensibleness of her marriage did not include the fact that she had accepted Grandcourt solely as a man whom it was convenient for her to marry, not in the least as one to whom she would be binding herself in duty. Gwendolen's ideas were pitiably crude; but many grand difficulties of life are apt to force themselves on us in our crudity. And to judge wisely, I suppose we must know how things appear to the unwise; that kind of appearance making the larger part of the world's history.\nIn the morning there was a double excitement for her. She was going to hunt, from which scruples about propriety had threatened to hinder her, until it was found that Mrs. Torrington was horsewoman enough to accompany her--going to hunt for the first time since her escapade with Rex; and she was going again to see Deronda, in whom, since last night, her interest had so gathered that she expected, as people do about revealed celebrities, to see something in his appearance which she had missed before.\nWhat was he going to be? What sort of life had he before him--he being nothing of any consequence? And with only a little difference in events he might have been as important as Grandcourt, nay--her imagination inevitably went into that direction--might have held the very estates which Grandcourt was to have. But now, Deronda would probably some day see her mistress of the Abbey at Topping, see her bearing the title which would have been his own wife's. These obvious, futile thoughts of what might have been, made a new epoch for Gwendolen. She, whose unquestionable habit it had been to take the best that came to her for less than her own claim, had now to see the position which tempted her in a new light, as a hard, unfair exclusion of others. What she had now heard about Deronda seemed to her imagination to throw him into one group with Mrs. Glasher and her children; before whom she felt herself in an attitude of apology--she who had hitherto been surrounded by a group that in her opinion had need be apologetic to her. Perhaps Deronda himself was thinking of these things. Could he know of Mrs. Glasher? If he knew that she knew, he would despise her; but he could have no such knowledge. Would he, without that, despise her for marrying Grandcourt? His possible judgment of her actions was telling on her as importunately as Klesmer's judgment of her powers; but she found larger room for resistance to a disapproval of her marriage, because it is easier to make our conduct seem justifiable to ourselves than to make our ability strike others. \"How can I help it?\" is not our favorite apology for incompetency. But Gwendolen felt some strength in saying,\n\"How can I help what other people have done? Things would not come right if I were to turn round now and declare that I would not marry Mr. Grandcourt.\" And such turning round was out of the question. The horses in the chariot she had mounted were going at full speed.\nThis mood of youthful, elated desperation had a tidal recurrence. She could dare anything that lay before her sooner than she could choose to go backward, into humiliation; and it was even soothing to think that there would now be as much ill-doing in the one as in the other. But the immediate delightful fact was the hunt, where she would see Deronda, and where he would see her; for always lurking ready to obtrude before other thoughts about him was the impression that he was very much interested in her. But to-day she was resolved not to repeat her folly of yesterday, as if she were anxious to say anything to him. Indeed, the hunt would be too absorbing.\nAnd so it was for a long while. Deronda was there, and within her sight very often; but this only added to the stimulus of a pleasure which Gwendolen had only once before tasted, and which seemed likely always to give a delight independent of any crosses, except such as took away the chance of riding. No accident happened to throw them together; the run took them within convenient reach of home, and the agreeable sombreness of the gray November afternoon, with a long stratum of yellow light in the west, Gwendolen was returning with the company from Diplow, who were attending her on the way to Offendene. Now the sense of glorious excitement was over and gone, she was getting irritably disappointed that she had had no opportunity of speaking to Deronda, whom she would not see again, since he was to go away in a couple of days. What was she going to say? That was not quite certain. She wanted to speak to him. Grandcourt was by her side; Mrs. Torrington, her husband, and another gentleman in advance; and Deronda's horse she could hear behind. The wish to speak to him and have him speaking to her was becoming imperious; and there was no chance of it unless she simply asserted her will and defied everything. Where the order of things could give way to Miss Gwendolen, it must be made to do so. They had lately emerged from a wood of pines and beeches, where the twilight stillness had a repressing effect, which increased her impatience. The horse-hoofs again heard behind at some little distance were a growing irritation. She reined in her horse and looked behind her; Grandcourt after a few paces, also paused; but she, waving her whip and nodding sideways with playful imperiousness, said, \"Go on! I want to speak to Mr. Deronda.\"\nGrandcourt hesitated; but that he would have done after any proposition. It was an awkward situation for him. No gentleman, before marriage, could give the emphasis of refusal to a command delivered in this playful way. He rode on slowly, and she waited till Deronda came up. He looked at her with tacit inquiry, and she said at once, letting her horse go alongside of his,\n\"Mr. Deronda, you must enlighten my ignorance. I want to know why you thought it wrong for me to gamble. Is it because I am a woman?\"\n\"Not altogether; but I regretted it the more because you were a woman,\" said Deronda, with an irrepressible smile. Apparently it must be understood between them now that it was he who sent the necklace. \"I think it would be better for men not to gamble. It is a besotting kind of taste, likely to turn into a disease. And, besides, there is something revolting to me in raking a heap of money together, and internally chuckling over it, when others are feeling the loss of it. I should even call it base, if it were more than an exceptional lapse. There are enough inevitable turns of fortune which force us to see that our gain is another's loss:--that is one of the ugly aspects of life. One would like to reduce it as much as one could, not get amusement out of exaggerating it.\" Deronda's voice had gathered some indignation while he was speaking.\n\"But you do admit that we can't help things,\" said Gwendolen, with a drop in her tone. The answer had not been anything like what she had expected. \"I mean that things are so in spite of us; we can't always help it that our gain is another's loss.\"\n\"Clearly. Because of that, we should help it where we can.\"\nGwendolen, biting her lip inside, paused a moment, and then forcing herself to speak with an air of playfulness again, said,\n\"But why should you regret it more because I am a woman?\"\n\"Perhaps because we need that you should be better than we are.\"\n\"But suppose _we_ need that men should be better than we are,\" said Gwendolen with a little air of \"check!\"\n\"That is rather a difficulty,\" said Deronda, smiling. \"I suppose I should have said, we each of us think it would be better for the other to be good.\"\n\"You see, I needed you to be better than I was--and you thought so,\" said Gwendolen, nodding and laughing, while she put her horse forward and joined Grandcourt, who made no observation.\n\"Don't you want to know what I had to say to Mr. Deronda?\" said Gwendolen, whose own pride required her to account for her conduct.\n\"A--no,\" said Grandcourt, coldly.\n\"Now that is the first impolite word you have spoken--that you don't wish to hear what I had to say,\" said Gwendolen, playing at a pout.\n\"I wish to hear what you say to me--not to other men,\" said Grandcourt.\n\"Then you wish to hear this. I wanted to make him tell me why he objected to my gambling, and he gave me a little sermon.\"\n\"Yes--but excuse me the sermon.\" If Gwendolen imagined that Grandcourt cared about her speaking to Deronda, he wished her to understand that she was mistaken. But he was not fond of being told to ride on. She saw he was piqued, but did not mind. She had accomplished her object of speaking again to Deronda before he raised his hat and turned with the rest toward Diplow, while her lover attended her to Offendene, where he was to bid farewell before a whole day's absence on the unspecified journey. Grandcourt had spoken truth in calling the journey a bore: he was going by train to Gadsmere.",
        "paragraph_chars": [
            [
                0,
                178
            ],
            [
                178,
                454
            ],
            [
                454,
                2474
            ],
            [
                2474,
                2860
            ],
            [
                2860,
                2893
            ],
            [
                2893,
                2963
            ],
            [
                2963,
                2981
            ],
            [
                2981,
                3238
            ],
            [
                3238,
                3454
            ],
            [
                3454,
                3729
            ],
            [
                3729,
                3900
            ],
            [
                3900,
                3940
            ],
            [
                3940,
                4127
            ],
            [
                4127,
                4243
            ],
            [
                4243,
                4577
            ],
            [
                4577,
                4683
            ],
            [
                4683,
                5528
            ],
            [
                5528,
                5674
            ],
            [
                5674,
                5843
            ],
            [
                5843,
                5915
            ],
            [
                5915,
                6267
            ],
            [
                6267,
                6484
            ],
            [
                6484,
                6624
            ],
            [
                6624,
                6700
            ],
            [
                6700,
                6778
            ],
            [
                6778,
                6910
            ],
            [
                6910,
                7014
            ],
            [
                7014,
                7163
            ],
            [
                7163,
                7253
            ],
            [
                7253,
                7323
            ],
            [
                7323,
                7535
            ],
            [
                7535,
                8406
            ],
            [
                8406,
                8680
            ],
            [
                8680,
                8945
            ],
            [
                8945,
                9076
            ],
            [
                9076,
                9226
            ],
            [
                9226,
                9324
            ],
            [
                9324,
                9531
            ],
            [
                9531,
                9593
            ],
            [
                9593,
                9772
            ],
            [
                9772,
                9847
            ],
            [
                9847,
                11657
            ],
            [
                11657,
                11823
            ],
            [
                11823,
                12065
            ],
            [
                12065,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12677
            ],
            [
                12677,
                12714
            ],
            [
                12714,
                12809
            ],
            [
                12809,
                12891
            ],
            [
                12891,
                12949
            ],
            [
                12949,
                13026
            ],
            [
                13026,
                13659
            ],
            [
                13659,
                13893
            ],
            [
                13893,
                14559
            ],
            [
                14559,
                14682
            ],
            [
                14682,
                14791
            ],
            [
                14791,
                14906
            ],
            [
                14906,
                15081
            ],
            [
                15081,
                15109
            ],
            [
                15109,
                15234
            ],
            [
                15234,
                15307
            ],
            [
                15307,
                15571
            ],
            [
                15571,
                15938
            ],
            [
                15938,
                16270
            ],
            [
                16270,
                16363
            ],
            [
                16363,
                16425
            ],
            [
                16425,
                16541
            ],
            [
                16541,
                16614
            ],
            [
                16614,
                16725
            ],
            [
                16725,
                16753
            ],
            [
                16753,
                16850
            ],
            [
                16850,
                16886
            ],
            [
                16886,
                17158
            ],
            [
                17158,
                17237
            ],
            [
                17237,
                17284
            ],
            [
                17284,
                17459
            ],
            [
                17459,
                17811
            ],
            [
                17811,
                18748
            ],
            [
                18748,
                19253
            ],
            [
                19253,
                20927
            ],
            [
                20927,
                21196
            ],
            [
                21196,
                21860
            ],
            [
                21860,
                23609
            ],
            [
                23609,
                23983
            ],
            [
                23983,
                24117
            ],
            [
                24117,
                24969
            ],
            [
                24969,
                25218
            ],
            [
                25218,
                25278
            ],
            [
                25278,
                25403
            ],
            [
                25403,
                25461
            ],
            [
                25461,
                25526
            ],
            [
                25526,
                25634
            ],
            [
                25634,
                25785
            ],
            [
                25785,
                25972
            ],
            [
                25972,
                26104
            ],
            [
                26104,
                26138
            ],
            [
                26138,
                26275
            ],
            [
                26275,
                26347
            ],
            [
                26347,
                26470
            ],
            [
                26470,
                27064
            ]
        ],
        "segment_chars": [
            [
                0,
                76
            ],
            [
                76,
                162
            ],
            [
                162,
                178
            ],
            [
                178,
                259
            ],
            [
                259,
                301
            ],
            [
                301,
                356
            ],
            [
                356,
                422
            ],
            [
                422,
                454
            ],
            [
                454,
                699
            ],
            [
                699,
                905
            ],
            [
                905,
                1127
            ],
            [
                1127,
                1172
            ],
            [
                1172,
                1278
            ],
            [
                1278,
                1573
            ],
            [
                1573,
                1667
            ],
            [
                1667,
                1859
            ],
            [
                1859,
                2085
            ],
            [
                2085,
                2198
            ],
            [
                2198,
                2381
            ],
            [
                2381,
                2474
            ],
            [
                2474,
                2725
            ],
            [
                2725,
                2783
            ],
            [
                2783,
                2860
            ],
            [
                2860,
                2893
            ],
            [
                2893,
                2963
            ],
            [
                2963,
                2981
            ],
            [
                2981,
                3091
            ],
            [
                3091,
                3238
            ],
            [
                3238,
                3287
            ],
            [
                3287,
                3454
            ],
            [
                3454,
                3504
            ],
            [
                3504,
                3527
            ],
            [
                3527,
                3587
            ],
            [
                3587,
                3729
            ],
            [
                3729,
                3900
            ],
            [
                3900,
                3940
            ],
            [
                3940,
                4018
            ],
            [
                4018,
                4127
            ],
            [
                4127,
                4166
            ],
            [
                4166,
                4202
            ],
            [
                4202,
                4243
            ],
            [
                4243,
                4256
            ],
            [
                4256,
                4333
            ],
            [
                4333,
                4458
            ],
            [
                4458,
                4539
            ],
            [
                4539,
                4577
            ],
            [
                4577,
                4583
            ],
            [
                4583,
                4622
            ],
            [
                4622,
                4683
            ],
            [
                4683,
                4716
            ],
            [
                4716,
                5041
            ],
            [
                5041,
                5157
            ],
            [
                5157,
                5192
            ],
            [
                5192,
                5328
            ],
            [
                5328,
                5402
            ],
            [
                5402,
                5528
            ],
            [
                5528,
                5674
            ],
            [
                5674,
                5843
            ],
            [
                5843,
                5854
            ],
            [
                5854,
                5915
            ],
            [
                5915,
                5994
            ],
            [
                5994,
                6199
            ],
            [
                6199,
                6267
            ],
            [
                6267,
                6415
            ],
            [
                6415,
                6484
            ],
            [
                6484,
                6624
            ],
            [
                6624,
                6700
            ],
            [
                6700,
                6778
            ],
            [
                6778,
                6910
            ],
            [
                6910,
                6988
            ],
            [
                6988,
                7014
            ],
            [
                7014,
                7080
            ],
            [
                7080,
                7121
            ],
            [
                7121,
                7163
            ],
            [
                7163,
                7168
            ],
            [
                7168,
                7226
            ],
            [
                7226,
                7240
            ],
            [
                7240,
                7253
            ],
            [
                7253,
                7294
            ],
            [
                7294,
                7323
            ],
            [
                7323,
                7343
            ],
            [
                7343,
                7373
            ],
            [
                7373,
                7441
            ],
            [
                7441,
                7480
            ],
            [
                7480,
                7535
            ],
            [
                7535,
                7701
            ],
            [
                7701,
                7909
            ],
            [
                7909,
                8126
            ],
            [
                8126,
                8318
            ],
            [
                8318,
                8406
            ],
            [
                8406,
                8633
            ],
            [
                8633,
                8680
            ],
            [
                8680,
                8765
            ],
            [
                8765,
                8945
            ],
            [
                8945,
                9076
            ],
            [
                9076,
                9181
            ],
            [
                9181,
                9226
            ],
            [
                9226,
                9324
            ],
            [
                9324,
                9342
            ],
            [
                9342,
                9482
            ],
            [
                9482,
                9531
            ],
            [
                9531,
                9570
            ],
            [
                9570,
                9593
            ],
            [
                9593,
                9685
            ],
            [
                9685,
                9734
            ],
            [
                9734,
                9772
            ],
            [
                9772,
                9847
            ],
            [
                9847,
                9907
            ],
            [
                9907,
                10190
            ],
            [
                10190,
                10320
            ],
            [
                10320,
                10452
            ],
            [
                10452,
                10556
            ],
            [
                10556,
                10790
            ],
            [
                10790,
                10959
            ],
            [
                10959,
                11051
            ],
            [
                11051,
                11657
            ],
            [
                11657,
                11823
            ],
            [
                11823,
                11863
            ],
            [
                11863,
                11943
            ],
            [
                11943,
                11983
            ],
            [
                11983,
                12038
            ],
            [
                12038,
                12065
            ],
            [
                12065,
                12261
            ],
            [
                12261,
                12354
            ],
            [
                12354,
                12426
            ],
            [
                12426,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12677
            ],
            [
                12677,
                12714
            ],
            [
                12714,
                12738
            ],
            [
                12738,
                12809
            ],
            [
                12809,
                12840
            ],
            [
                12840,
                12891
            ],
            [
                12891,
                12949
            ],
            [
                12949,
                13026
            ],
            [
                13026,
                13047
            ],
            [
                13047,
                13194
            ],
            [
                13194,
                13519
            ],
            [
                13519,
                13612
            ],
            [
                13612,
                13659
            ],
            [
                13659,
                13712
            ],
            [
                13712,
                13893
            ],
            [
                13893,
                14108
            ],
            [
                14108,
                14141
            ],
            [
                14141,
                14559
            ],
            [
                14559,
                14682
            ],
            [
                14682,
                14791
            ],
            [
                14791,
                14889
            ],
            [
                14889,
                14906
            ],
            [
                14906,
                14959
            ],
            [
                14959,
                15000
            ],
            [
                15000,
                15081
            ],
            [
                15081,
                15093
            ],
            [
                15093,
                15109
            ],
            [
                15109,
                15135
            ],
            [
                15135,
                15234
            ],
            [
                15234,
                15248
            ],
            [
                15248,
                15280
            ],
            [
                15280,
                15307
            ],
            [
                15307,
                15415
            ],
            [
                15415,
                15571
            ],
            [
                15571,
                15727
            ],
            [
                15727,
                15938
            ],
            [
                15938,
                16070
            ],
            [
                16070,
                16183
            ],
            [
                16183,
                16270
            ],
            [
                16270,
                16363
            ],
            [
                16363,
                16425
            ],
            [
                16425,
                16460
            ],
            [
                16460,
                16494
            ],
            [
                16494,
                16541
            ],
            [
                16541,
                16614
            ],
            [
                16614,
                16689
            ],
            [
                16689,
                16725
            ],
            [
                16725,
                16753
            ],
            [
                16753,
                16787
            ],
            [
                16787,
                16850
            ],
            [
                16850,
                16886
            ],
            [
                16886,
                16980
            ],
            [
                16980,
                17061
            ],
            [
                17061,
                17158
            ],
            [
                17158,
                17237
            ],
            [
                17237,
                17284
            ],
            [
                17284,
                17291
            ],
            [
                17291,
                17343
            ],
            [
                17343,
                17400
            ],
            [
                17400,
                17459
            ],
            [
                17459,
                17542
            ],
            [
                17542,
                17811
            ],
            [
                17811,
                18155
            ],
            [
                18155,
                18475
            ],
            [
                18475,
                18600
            ],
            [
                18600,
                18748
            ],
            [
                18748,
                18802
            ],
            [
                18802,
                19253
            ],
            [
                19253,
                19278
            ],
            [
                19278,
                19352
            ],
            [
                19352,
                19564
            ],
            [
                19564,
                19711
            ],
            [
                19711,
                19799
            ],
            [
                19799,
                20007
            ],
            [
                20007,
                20289
            ],
            [
                20289,
                20343
            ],
            [
                20343,
                20374
            ],
            [
                20374,
                20459
            ],
            [
                20459,
                20520
            ],
            [
                20520,
                20816
            ],
            [
                20816,
                20837
            ],
            [
                20837,
                20883
            ],
            [
                20883,
                20927
            ],
            [
                20927,
                20972
            ],
            [
                20972,
                21080
            ],
            [
                21080,
                21128
            ],
            [
                21128,
                21196
            ],
            [
                21196,
                21262
            ],
            [
                21262,
                21473
            ],
            [
                21473,
                21706
            ],
            [
                21706,
                21819
            ],
            [
                21819,
                21860
            ],
            [
                21860,
                21892
            ],
            [
                21892,
                22163
            ],
            [
                22163,
                22471
            ],
            [
                22471,
                22697
            ],
            [
                22697,
                22724
            ],
            [
                22724,
                22752
            ],
            [
                22752,
                22780
            ],
            [
                22780,
                22915
            ],
            [
                22915,
                23082
            ],
            [
                23082,
                23168
            ],
            [
                23168,
                23312
            ],
            [
                23312,
                23398
            ],
            [
                23398,
                23576
            ],
            [
                23576,
                23609
            ],
            [
                23609,
                23682
            ],
            [
                23682,
                23719
            ],
            [
                23719,
                23829
            ],
            [
                23829,
                23885
            ],
            [
                23885,
                23983
            ],
            [
                23983,
                24030
            ],
            [
                24030,
                24088
            ],
            [
                24088,
                24117
            ],
            [
                24117,
                24232
            ],
            [
                24232,
                24320
            ],
            [
                24320,
                24371
            ],
            [
                24371,
                24435
            ],
            [
                24435,
                24594
            ],
            [
                24594,
                24665
            ],
            [
                24665,
                24807
            ],
            [
                24807,
                24900
            ],
            [
                24900,
                24969
            ],
            [
                24969,
                25056
            ],
            [
                25056,
                25117
            ],
            [
                25117,
                25218
            ],
            [
                25218,
                25228
            ],
            [
                25228,
                25278
            ],
            [
                25278,
                25403
            ],
            [
                25403,
                25461
            ],
            [
                25461,
                25526
            ],
            [
                25526,
                25634
            ],
            [
                25634,
                25688
            ],
            [
                25688,
                25785
            ],
            [
                25785,
                25972
            ],
            [
                25972,
                26031
            ],
            [
                26031,
                26104
            ],
            [
                26104,
                26138
            ],
            [
                26138,
                26275
            ],
            [
                26275,
                26347
            ],
            [
                26347,
                26376
            ],
            [
                26376,
                26470
            ],
            [
                26470,
                26503
            ],
            [
                26503,
                26629
            ],
            [
                26629,
                26675
            ],
            [
                26675,
                26716
            ],
            [
                26716,
                26971
            ],
            [
                26971,
                27064
            ]
        ],
        "overlap_chars": [
            [
                178,
                246
            ],
            [
                259,
                301
            ],
            [
                301,
                356
            ],
            [
                356,
                422
            ],
            [
                422,
                425
            ],
            [
                436,
                454
            ],
            [
                454,
                468
            ],
            [
                478,
                525
            ],
            [
                535,
                561
            ],
            [
                615,
                699
            ],
            [
                699,
                905
            ],
            [
                905,
                997
            ],
            [
                1005,
                1008
            ],
            [
                1016,
                1127
            ],
            [
                1127,
                1172
            ],
            [
                1172,
                1278
            ],
            [
                1293,
                1296
            ],
            [
                1366,
                1459
            ],
            [
                1480,
                1535
            ],
            [
                1571,
                1572
            ],
            [
                1810,
                1813
            ],
            [
                1667,
                1684
            ],
            [
                1694,
                1715
            ],
            [
                1723,
                1745
            ],
            [
                1775,
                1782
            ],
            [
                1754,
                1760
            ],
            [
                1857,
                1859
            ],
            [
                1859,
                1889
            ],
            [
                1908,
                1916
            ],
            [
                1926,
                2028
            ],
            [
                2042,
                2065
            ],
            [
                2067,
                2084
            ],
            [
                2085,
                2168
            ],
            [
                2170,
                2198
            ],
            [
                2198,
                2249
            ],
            [
                2268,
                2381
            ],
            [
                2381,
                2401
            ],
            [
                2421,
                2429
            ],
            [
                2439,
                2446
            ],
            [
                2449,
                2474
            ],
            [
                2490,
                2566
            ],
            [
                2640,
                2683
            ],
            [
                2690,
                2723
            ],
            [
                2621,
                2624
            ],
            [
                2725,
                2734
            ],
            [
                2474,
                2476
            ],
            [
                2781,
                2783
            ],
            [
                2783,
                2786
            ],
            [
                2822,
                2858
            ],
            [
                2860,
                2867
            ],
            [
                2878,
                2893
            ],
            [
                2893,
                2962
            ],
            [
                2981,
                2982
            ],
            [
                2982,
                3028
            ],
            [
                3030,
                3041
            ],
            [
                3043,
                3091
            ],
            [
                3177,
                3179
            ],
            [
                3102,
                3135
            ],
            [
                3146,
                3154
            ],
            [
                3188,
                3196
            ],
            [
                3201,
                3238
            ],
            [
                3238,
                3287
            ],
            [
                3287,
                3304
            ],
            [
                3308,
                3311
            ],
            [
                3323,
                3385
            ],
            [
                3452,
                3454
            ],
            [
                3472,
                3482
            ],
            [
                3467,
                3471
            ],
            [
                3482,
                3502
            ],
            [
                3454,
                3455
            ],
            [
                3531,
                3587
            ],
            [
                3587,
                3728
            ],
            [
                3900,
                3901
            ],
            [
                3906,
                3927
            ],
            [
                3937,
                3940
            ],
            [
                3940,
                4018
            ],
            [
                4018,
                4035
            ],
            [
                4039,
                4057
            ],
            [
                4074,
                4082
            ],
            [
                4097,
                4127
            ],
            [
                4127,
                4166
            ],
            [
                4166,
                4181
            ],
            [
                4200,
                4202
            ],
            [
                4202,
                4243
            ],
            [
                4243,
                4244
            ],
            [
                4245,
                4248
            ],
            [
                4250,
                4256
            ],
            [
                4256,
                4270
            ],
            [
                4331,
                4333
            ],
            [
                4333,
                4371
            ],
            [
                4443,
                4446
            ],
            [
                4386,
                4389
            ],
            [
                4398,
                4403
            ],
            [
                4419,
                4433
            ],
            [
                4480,
                4512
            ],
            [
                4517,
                4539
            ],
            [
                4539,
                4540
            ],
            [
                4541,
                4544
            ],
            [
                4546,
                4577
            ],
            [
                4577,
                4583
            ],
            [
                4583,
                4622
            ],
            [
                4622,
                4683
            ],
            [
                4683,
                4716
            ],
            [
                4716,
                4799
            ],
            [
                4869,
                4972
            ],
            [
                5039,
                5041
            ],
            [
                5192,
                5199
            ],
            [
                5207,
                5209
            ],
            [
                5214,
                5328
            ],
            [
                5328,
                5342
            ],
            [
                5350,
                5400
            ],
            [
                5431,
                5432
            ],
            [
                5480,
                5483
            ],
            [
                5516,
                5526
            ],
            [
                5528,
                5642
            ],
            [
                5660,
                5662
            ],
            [
                5671,
                5674
            ],
            [
                5674,
                5843
            ],
            [
                5843,
                5851
            ],
            [
                5854,
                5883
            ],
            [
                5913,
                5915
            ],
            [
                5915,
                5994
            ],
            [
                6064,
                6199
            ],
            [
                6199,
                6267
            ],
            [
                6314,
                6323
            ],
            [
                6332,
                6339
            ],
            [
                6357,
                6360
            ],
            [
                6368,
                6377
            ],
            [
                6453,
                6456
            ],
            [
                6447,
                6448
            ],
            [
                6470,
                6473
            ],
            [
                6484,
                6529
            ],
            [
                6558,
                6580
            ],
            [
                6590,
                6621
            ],
            [
                6701,
                6724
            ],
            [
                6726,
                6739
            ],
            [
                6756,
                6778
            ],
            [
                6778,
                6808
            ],
            [
                6821,
                6829
            ],
            [
                6908,
                6909
            ],
            [
                6910,
                6952
            ],
            [
                6953,
                6956
            ],
            [
                6969,
                6975
            ],
            [
                6986,
                6988
            ],
            [
                6988,
                7014
            ],
            [
                7014,
                7015
            ],
            [
                7019,
                7053
            ],
            [
                7067,
                7074
            ],
            [
                7078,
                7080
            ],
            [
                7080,
                7121
            ],
            [
                7121,
                7163
            ],
            [
                7163,
                7168
            ],
            [
                7168,
                7193
            ],
            [
                7206,
                7224
            ],
            [
                7224,
                7226
            ],
            [
                7240,
                7253
            ],
            [
                7253,
                7255
            ],
            [
                7264,
                7294
            ],
            [
                7294,
                7323
            ],
            [
                7323,
                7343
            ],
            [
                7343,
                7373
            ],
            [
                7373,
                7441
            ],
            [
                7441,
                7480
            ],
            [
                7480,
                7497
            ],
            [
                7508,
                7535
            ],
            [
                7535,
                7614
            ],
            [
                7699,
                7701
            ],
            [
                7701,
                7716
            ],
            [
                7721,
                7732
            ],
            [
                7743,
                7782
            ],
            [
                7793,
                7841
            ],
            [
                7907,
                7909
            ],
            [
                7909,
                7945
            ],
            [
                7988,
                7990
            ],
            [
                7953,
                7972
            ],
            [
                8039,
                8043
            ],
            [
                8070,
                8073
            ],
            [
                8048,
                8066
            ],
            [
                8074,
                8126
            ],
            [
                8126,
                8168
            ],
            [
                8178,
                8182
            ],
            [
                8275,
                8278
            ],
            [
                8336,
                8406
            ],
            [
                8525,
                8528
            ],
            [
                8563,
                8570
            ],
            [
                8410,
                8414
            ],
            [
                8763,
                8765
            ],
            [
                8765,
                8880
            ],
            [
                8943,
                8945
            ],
            [
                8945,
                8988
            ],
            [
                8993,
                9076
            ],
            [
                9076,
                9151
            ],
            [
                9166,
                9181
            ],
            [
                9181,
                9226
            ],
            [
                9226,
                9324
            ],
            [
                9324,
                9342
            ],
            [
                9342,
                9430
            ],
            [
                9480,
                9482
            ],
            [
                9482,
                9531
            ],
            [
                9531,
                9570
            ],
            [
                9570,
                9593
            ],
            [
                9593,
                9685
            ],
            [
                9685,
                9734
            ],
            [
                9734,
                9739
            ],
            [
                9747,
                9772
            ],
            [
                9772,
                9847
            ],
            [
                9847,
                9848
            ],
            [
                9849,
                9850
            ],
            [
                9852,
                9907
            ],
            [
                9907,
                10049
            ],
            [
                10058,
                10077
            ],
            [
                10050,
                10054
            ],
            [
                10188,
                10190
            ],
            [
                10190,
                10320
            ],
            [
                10320,
                10348
            ],
            [
                10366,
                10402
            ],
            [
                10403,
                10410
            ],
            [
                10412,
                10452
            ],
            [
                10556,
                10631
            ],
            [
                10671,
                10693
            ],
            [
                10700,
                10740
            ],
            [
                10788,
                10790
            ],
            [
                10790,
                10805
            ],
            [
                10826,
                10897
            ],
            [
                10899,
                10900
            ],
            [
                10910,
                10958
            ],
            [
                10967,
                10989
            ],
            [
                11012,
                11051
            ],
            [
                11702,
                11823
            ],
            [
                11823,
                11863
            ],
            [
                11863,
                11943
            ],
            [
                11943,
                11983
            ],
            [
                12000,
                12002
            ],
            [
                12015,
                12023
            ],
            [
                12036,
                12038
            ],
            [
                12038,
                12041
            ],
            [
                12045,
                12065
            ],
            [
                12065,
                12096
            ],
            [
                12113,
                12136
            ],
            [
                12144,
                12154
            ],
            [
                12180,
                12195
            ],
            [
                12216,
                12261
            ],
            [
                12261,
                12354
            ],
            [
                12354,
                12388
            ],
            [
                12390,
                12425
            ],
            [
                12426,
                12498
            ],
            [
                12522,
                12536
            ],
            [
                12598,
                12606
            ],
            [
                12615,
                12630
            ],
            [
                12640,
                12656
            ],
            [
                12656,
                12677
            ],
            [
                12677,
                12714
            ],
            [
                12738,
                12766
            ],
            [
                12768,
                12803
            ],
            [
                12806,
                12809
            ],
            [
                12809,
                12840
            ],
            [
                12840,
                12891
            ],
            [
                12891,
                12949
            ],
            [
                12949,
                13026
            ],
            [
                13026,
                13047
            ],
            [
                13047,
                13143
            ],
            [
                13145,
                13194
            ],
            [
                13194,
                13206
            ],
            [
                13289,
                13344
            ],
            [
                13355,
                13381
            ],
            [
                13221,
                13226
            ],
            [
                13382,
                13394
            ],
            [
                13400,
                13402
            ],
            [
                13395,
                13399
            ],
            [
                13517,
                13518
            ],
            [
                13659,
                13712
            ],
            [
                13712,
                13893
            ],
            [
                13893,
                14107
            ],
            [
                14108,
                14141
            ],
            [
                14141,
                14210
            ],
            [
                14484,
                14491
            ],
            [
                14254,
                14259
            ],
            [
                14273,
                14282
            ],
            [
                14283,
                14286
            ],
            [
                14296,
                14298
            ],
            [
                14326,
                14331
            ],
            [
                14419,
                14434
            ],
            [
                14444,
                14465
            ],
            [
                14557,
                14559
            ],
            [
                14559,
                14592
            ],
            [
                14641,
                14652
            ],
            [
                14599,
                14605
            ],
            [
                14664,
                14682
            ],
            [
                14791,
                14889
            ],
            [
                14889,
                14906
            ],
            [
                14906,
                14921
            ],
            [
                14929,
                14959
            ],
            [
                14959,
                15000
            ],
            [
                15000,
                15081
            ],
            [
                15081,
                15092
            ],
            [
                15109,
                15135
            ],
            [
                15172,
                15234
            ],
            [
                15234,
                15248
            ],
            [
                15248,
                15280
            ],
            [
                15280,
                15307
            ],
            [
                15307,
                15312
            ],
            [
                15324,
                15415
            ],
            [
                15415,
                15436
            ],
            [
                15447,
                15571
            ],
            [
                15571,
                15607
            ],
            [
                15617,
                15727
            ],
            [
                15727,
                15764
            ],
            [
                15776,
                15788
            ],
            [
                15769,
                15772
            ],
            [
                15936,
                15938
            ],
            [
                15938,
                15946
            ],
            [
                16005,
                16011
            ],
            [
                16065,
                16068
            ],
            [
                16039,
                16048
            ],
            [
                16012,
                16026
            ],
            [
                15953,
                15995
            ],
            [
                16068,
                16070
            ],
            [
                16183,
                16258
            ],
            [
                16268,
                16270
            ],
            [
                16270,
                16289
            ],
            [
                16303,
                16361
            ],
            [
                16363,
                16425
            ],
            [
                16425,
                16434
            ],
            [
                16438,
                16459
            ],
            [
                16541,
                16589
            ],
            [
                16612,
                16614
            ],
            [
                16614,
                16689
            ],
            [
                16689,
                16725
            ],
            [
                16725,
                16753
            ],
            [
                16753,
                16787
            ],
            [
                16787,
                16850
            ],
            [
                16850,
                16886
            ],
            [
                16886,
                16905
            ],
            [
                16983,
                17012
            ],
            [
                17059,
                17061
            ],
            [
                17061,
                17121
            ],
            [
                17131,
                17158
            ],
            [
                17158,
                17198
            ],
            [
                17210,
                17237
            ],
            [
                17237,
                17284
            ],
            [
                17284,
                17291
            ],
            [
                17291,
                17343
            ],
            [
                17343,
                17400
            ],
            [
                17400,
                17459
            ],
            [
                17459,
                17542
            ],
            [
                17542,
                17557
            ],
            [
                17598,
                17620
            ],
            [
                17636,
                17650
            ],
            [
                17656,
                17671
            ],
            [
                17679,
                17680
            ],
            [
                17716,
                17732
            ],
            [
                17736,
                17759
            ],
            [
                17775,
                17811
            ],
            [
                17811,
                17857
            ],
            [
                17867,
                17930
            ],
            [
                17940,
                17968
            ],
            [
                18067,
                18068
            ],
            [
                17969,
                18025
            ],
            [
                18092,
                18093
            ],
            [
                18032,
                18037
            ],
            [
                18045,
                18067
            ],
            [
                18094,
                18155
            ],
            [
                18387,
                18390
            ],
            [
                18188,
                18252
            ],
            [
                18155,
                18161
            ],
            [
                18274,
                18276
            ],
            [
                18391,
                18403
            ],
            [
                18337,
                18354
            ],
            [
                18181,
                18182
            ],
            [
                18422,
                18440
            ],
            [
                18372,
                18375
            ],
            [
                18458,
                18474
            ],
            [
                18748,
                18802
            ],
            [
                18802,
                18823
            ],
            [
                19031,
                19080
            ],
            [
                19100,
                19116
            ],
            [
                19251,
                19253
            ],
            [
                19278,
                19295
            ],
            [
                19296,
                19313
            ],
            [
                19350,
                19352
            ],
            [
                19356,
                19446
            ],
            [
                19501,
                19564
            ],
            [
                19564,
                19604
            ],
            [
                19647,
                19710
            ],
            [
                19799,
                19802
            ],
            [
                19906,
                19920
            ],
            [
                19873,
                19876
            ],
            [
                19952,
                20007
            ],
            [
                20007,
                20019
            ],
            [
                20024,
                20050
            ],
            [
                20070,
                20132
            ],
            [
                20287,
                20289
            ],
            [
                20289,
                20343
            ],
            [
                20343,
                20374
            ],
            [
                20374,
                20459
            ],
            [
                20459,
                20520
            ],
            [
                20520,
                20578
            ],
            [
                20593,
                20637
            ],
            [
                20897,
                20925
            ],
            [
                20927,
                20972
            ],
            [
                20972,
                21080
            ],
            [
                21080,
                21128
            ],
            [
                21128,
                21196
            ],
            [
                21477,
                21596
            ],
            [
                21627,
                21706
            ],
            [
                21706,
                21709
            ],
            [
                21717,
                21819
            ],
            [
                21819,
                21860
            ],
            [
                21864,
                21892
            ],
            [
                21892,
                21931
            ],
            [
                21942,
                21970
            ],
            [
                21985,
                21993
            ],
            [
                21980,
                21982
            ],
            [
                22141,
                22144
            ],
            [
                22161,
                22163
            ],
            [
                22163,
                22207
            ],
            [
                22427,
                22431
            ],
            [
                22226,
                22232
            ],
            [
                22244,
                22262
            ],
            [
                22369,
                22409
            ],
            [
                22457,
                22469
            ],
            [
                22318,
                22319
            ],
            [
                22208,
                22211
            ],
            [
                22288,
                22290
            ],
            [
                22469,
                22471
            ],
            [
                22527,
                22534
            ],
            [
                22543,
                22696
            ],
            [
                22697,
                22724
            ],
            [
                22724,
                22752
            ],
            [
                22752,
                22780
            ],
            [
                22780,
                22806
            ],
            [
                22823,
                22824
            ],
            [
                22872,
                22915
            ],
            [
                22915,
                22939
            ],
            [
                22969,
                23082
            ],
            [
                23082,
                23167
            ],
            [
                23312,
                23327
            ],
            [
                23334,
                23346
            ],
            [
                23371,
                23398
            ],
            [
                23398,
                23432
            ],
            [
                23443,
                23455
            ],
            [
                23475,
                23512
            ],
            [
                23534,
                23576
            ],
            [
                23576,
                23609
            ],
            [
                23609,
                23630
            ],
            [
                23682,
                23719
            ],
            [
                23719,
                23755
            ],
            [
                23788,
                23829
            ],
            [
                23829,
                23885
            ],
            [
                23885,
                23943
            ],
            [
                23965,
                23974
            ],
            [
                23983,
                24015
            ],
            [
                24028,
                24030
            ],
            [
                24045,
                24048
            ],
            [
                24049,
                24052
            ],
            [
                24061,
                24086
            ],
            [
                24088,
                24117
            ],
            [
                24117,
                24232
            ],
            [
                24232,
                24320
            ],
            [
                24320,
                24371
            ],
            [
                24371,
                24378
            ],
            [
                24397,
                24402
            ],
            [
                24404,
                24435
            ],
            [
                24435,
                24523
            ],
            [
                24535,
                24594
            ],
            [
                24665,
                24681
            ],
            [
                24737,
                24764
            ],
            [
                24766,
                24807
            ],
            [
                24807,
                24810
            ],
            [
                24857,
                24900
            ],
            [
                24900,
                24945
            ],
            [
                24967,
                24969
            ],
            [
                24969,
                25029
            ],
            [
                25054,
                25056
            ],
            [
                25056,
                25117
            ],
            [
                25117,
                25118
            ],
            [
                25160,
                25218
            ],
            [
                25218,
                25228
            ],
            [
                25245,
                25278
            ],
            [
                25278,
                25303
            ],
            [
                25310,
                25318
            ],
            [
                25327,
                25362
            ],
            [
                25378,
                25382
            ],
            [
                25390,
                25401
            ],
            [
                25403,
                25461
            ],
            [
                25461,
                25485
            ],
            [
                25491,
                25494
            ],
            [
                25502,
                25516
            ],
            [
                25523,
                25526
            ],
            [
                25526,
                25538
            ],
            [
                25540,
                25542
            ],
            [
                25544,
                25548
            ],
            [
                25554,
                25557
            ],
            [
                25565,
                25579
            ],
            [
                25586,
                25634
            ],
            [
                25634,
                25688
            ],
            [
                25688,
                25785
            ],
            [
                25785,
                25831
            ],
            [
                25833,
                25869
            ],
            [
                25882,
                25972
            ],
            [
                25972,
                26031
            ],
            [
                26031,
                26052
            ],
            [
                26057,
                26104
            ],
            [
                26104,
                26105
            ],
            [
                26108,
                26138
            ],
            [
                26138,
                26190
            ],
            [
                26192,
                26275
            ],
            [
                26275,
                26309
            ],
            [
                26311,
                26347
            ],
            [
                26376,
                26470
            ],
            [
                26470,
                26471
            ],
            [
                26487,
                26503
            ],
            [
                26503,
                26594
            ],
            [
                26606,
                26629
            ],
            [
                26629,
                26675
            ],
            [
                26675,
                26716
            ],
            [
                26716,
                26786
            ],
            [
                26806,
                26920
            ],
            [
                26794,
                26797
            ],
            [
                26935,
                26971
            ],
            [
                26971,
                26981
            ],
            [
                27033,
                27064
            ]
        ],
        "row_chars": [
            [
                0,
                76
            ],
            [
                76,
                162
            ],
            [
                162,
                178
            ],
            [
                178,
                259
            ],
            [
                259,
                301
            ],
            [
                301,
                356
            ],
            [
                356,
                422
            ],
            [
                422,
                454
            ],
            [
                454,
                699
            ],
            [
                699,
                905
            ],
            [
                905,
                1127
            ],
            [
                1127,
                1172
            ],
            [
                1172,
                1278
            ],
            [
                1278,
                1573
            ],
            [
                1573,
                1667
            ],
            [
                1667,
                1859
            ],
            [
                1859,
                2085
            ],
            [
                2085,
                2198
            ],
            [
                2198,
                2381
            ],
            [
                2381,
                2474
            ],
            [
                2474,
                2783
            ],
            [
                2783,
                2860
            ],
            [
                2860,
                2893
            ],
            [
                2893,
                2963
            ],
            [
                2963,
                2981
            ],
            [
                2981,
                3091
            ],
            [
                3091,
                3238
            ],
            [
                3238,
                3287
            ],
            [
                3287,
                3454
            ],
            [
                3454,
                3587
            ],
            [
                3587,
                3729
            ],
            [
                3729,
                3900
            ],
            [
                3900,
                3940
            ],
            [
                3940,
                4018
            ],
            [
                4018,
                4127
            ],
            [
                4127,
                4166
            ],
            [
                4166,
                4202
            ],
            [
                4202,
                4243
            ],
            [
                4243,
                4256
            ],
            [
                4256,
                4333
            ],
            [
                4333,
                4539
            ],
            [
                4539,
                4577
            ],
            [
                4577,
                4583
            ],
            [
                4583,
                4622
            ],
            [
                4622,
                4683
            ],
            [
                4683,
                4716
            ],
            [
                4716,
                5041
            ],
            [
                5041,
                5157
            ],
            [
                5157,
                5192
            ],
            [
                5192,
                5328
            ],
            [
                5328,
                5528
            ],
            [
                5528,
                5674
            ],
            [
                5674,
                5843
            ],
            [
                5843,
                5854
            ],
            [
                5854,
                5915
            ],
            [
                5915,
                5994
            ],
            [
                5994,
                6199
            ],
            [
                6199,
                6267
            ],
            [
                6267,
                6415
            ],
            [
                6415,
                6484
            ],
            [
                6484,
                6624
            ],
            [
                6624,
                6700
            ],
            [
                6700,
                6778
            ],
            [
                6778,
                6910
            ],
            [
                6910,
                6988
            ],
            [
                6988,
                7014
            ],
            [
                7014,
                7080
            ],
            [
                7080,
                7121
            ],
            [
                7121,
                7163
            ],
            [
                7163,
                7168
            ],
            [
                7168,
                7226
            ],
            [
                7226,
                7240
            ],
            [
                7240,
                7253
            ],
            [
                7253,
                7294
            ],
            [
                7294,
                7323
            ],
            [
                7323,
                7343
            ],
            [
                7343,
                7373
            ],
            [
                7373,
                7441
            ],
            [
                7441,
                7480
            ],
            [
                7480,
                7535
            ],
            [
                7535,
                7701
            ],
            [
                7701,
                7909
            ],
            [
                7909,
                8126
            ],
            [
                8126,
                8406
            ],
            [
                8406,
                8765
            ],
            [
                8765,
                8945
            ],
            [
                8945,
                9076
            ],
            [
                9076,
                9181
            ],
            [
                9181,
                9226
            ],
            [
                9226,
                9324
            ],
            [
                9324,
                9342
            ],
            [
                9342,
                9482
            ],
            [
                9482,
                9531
            ],
            [
                9531,
                9570
            ],
            [
                9570,
                9593
            ],
            [
                9593,
                9685
            ],
            [
                9685,
                9734
            ],
            [
                9734,
                9772
            ],
            [
                9772,
                9847
            ],
            [
                9847,
                9907
            ],
            [
                9907,
                10190
            ],
            [
                10190,
                10320
            ],
            [
                10320,
                10452
            ],
            [
                10452,
                10556
            ],
            [
                10556,
                10790
            ],
            [
                10790,
                10959
            ],
            [
                10959,
                11051
            ],
            [
                11051,
                11657
            ],
            [
                11657,
                11823
            ],
            [
                11823,
                11863
            ],
            [
                11863,
                11943
            ],
            [
                11943,
                11983
            ],
            [
                11983,
                12038
            ],
            [
                12038,
                12065
            ],
            [
                12065,
                12261
            ],
            [
                12261,
                12354
            ],
            [
                12354,
                12426
            ],
            [
                12426,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12677
            ],
            [
                12677,
                12714
            ],
            [
                12714,
                12738
            ],
            [
                12738,
                12809
            ],
            [
                12809,
                12840
            ],
            [
                12840,
                12891
            ],
            [
                12891,
                12949
            ],
            [
                12949,
                13026
            ],
            [
                13026,
                13047
            ],
            [
                13047,
                13194
            ],
            [
                13194,
                13519
            ],
            [
                13519,
                13612
            ],
            [
                13612,
                13659
            ],
            [
                13659,
                13712
            ],
            [
                13712,
                13893
            ],
            [
                13893,
                14108
            ],
            [
                14108,
                14141
            ],
            [
                14141,
                14559
            ],
            [
                14559,
                14682
            ],
            [
                14682,
                14791
            ],
            [
                14791,
                14889
            ],
            [
                14889,
                14906
            ],
            [
                14906,
                14959
            ],
            [
                14959,
                15000
            ],
            [
                15000,
                15081
            ],
            [
                15081,
                15093
            ],
            [
                15093,
                15109
            ],
            [
                15109,
                15135
            ],
            [
                15135,
                15234
            ],
            [
                15234,
                15248
            ],
            [
                15248,
                15280
            ],
            [
                15280,
                15307
            ],
            [
                15307,
                15415
            ],
            [
                15415,
                15571
            ],
            [
                15571,
                15727
            ],
            [
                15727,
                15938
            ],
            [
                15938,
                16070
            ],
            [
                16070,
                16183
            ],
            [
                16183,
                16270
            ],
            [
                16270,
                16363
            ],
            [
                16363,
                16425
            ],
            [
                16425,
                16460
            ],
            [
                16460,
                16494
            ],
            [
                16494,
                16541
            ],
            [
                16541,
                16614
            ],
            [
                16614,
                16689
            ],
            [
                16689,
                16725
            ],
            [
                16725,
                16753
            ],
            [
                16753,
                16787
            ],
            [
                16787,
                16850
            ],
            [
                16850,
                16886
            ],
            [
                16886,
                17061
            ],
            [
                17061,
                17158
            ],
            [
                17158,
                17237
            ],
            [
                17237,
                17284
            ],
            [
                17284,
                17291
            ],
            [
                17291,
                17343
            ],
            [
                17343,
                17400
            ],
            [
                17400,
                17459
            ],
            [
                17459,
                17542
            ],
            [
                17542,
                17811
            ],
            [
                17811,
                18155
            ],
            [
                18155,
                18475
            ],
            [
                18475,
                18600
            ],
            [
                18600,
                18748
            ],
            [
                18748,
                18802
            ],
            [
                18802,
                19253
            ],
            [
                19253,
                19278
            ],
            [
                19278,
                19352
            ],
            [
                19352,
                19564
            ],
            [
                19564,
                19711
            ],
            [
                19711,
                19799
            ],
            [
                19799,
                20007
            ],
            [
                20007,
                20289
            ],
            [
                20289,
                20343
            ],
            [
                20343,
                20374
            ],
            [
                20374,
                20459
            ],
            [
                20459,
                20520
            ],
            [
                20520,
                20927
            ],
            [
                20927,
                20972
            ],
            [
                20972,
                21080
            ],
            [
                21080,
                21128
            ],
            [
                21128,
                21196
            ],
            [
                21196,
                21262
            ],
            [
                21262,
                21473
            ],
            [
                21473,
                21706
            ],
            [
                21706,
                21819
            ],
            [
                21819,
                21860
            ],
            [
                21860,
                21892
            ],
            [
                21892,
                22163
            ],
            [
                22163,
                22471
            ],
            [
                22471,
                22697
            ],
            [
                22697,
                22724
            ],
            [
                22724,
                22752
            ],
            [
                22752,
                22780
            ],
            [
                22780,
                22915
            ],
            [
                22915,
                23082
            ],
            [
                23082,
                23168
            ],
            [
                23168,
                23312
            ],
            [
                23312,
                23398
            ],
            [
                23398,
                23576
            ],
            [
                23576,
                23609
            ],
            [
                23609,
                23719
            ],
            [
                23719,
                23829
            ],
            [
                23829,
                23885
            ],
            [
                23885,
                23983
            ],
            [
                23983,
                24030
            ],
            [
                24030,
                24088
            ],
            [
                24088,
                24117
            ],
            [
                24117,
                24232
            ],
            [
                24232,
                24320
            ],
            [
                24320,
                24371
            ],
            [
                24371,
                24435
            ],
            [
                24435,
                24594
            ],
            [
                24594,
                24665
            ],
            [
                24665,
                24807
            ],
            [
                24807,
                24900
            ],
            [
                24900,
                24969
            ],
            [
                24969,
                25056
            ],
            [
                25056,
                25117
            ],
            [
                25117,
                25218
            ],
            [
                25218,
                25228
            ],
            [
                25228,
                25278
            ],
            [
                25278,
                25403
            ],
            [
                25403,
                25461
            ],
            [
                25461,
                25526
            ],
            [
                25526,
                25634
            ],
            [
                25634,
                25688
            ],
            [
                25688,
                25785
            ],
            [
                25785,
                25972
            ],
            [
                25972,
                26031
            ],
            [
                26031,
                26104
            ],
            [
                26104,
                26138
            ],
            [
                26138,
                26275
            ],
            [
                26275,
                26347
            ],
            [
                26347,
                26376
            ],
            [
                26376,
                26470
            ],
            [
                26470,
                26503
            ],
            [
                26503,
                26629
            ],
            [
                26629,
                26675
            ],
            [
                26675,
                26716
            ],
            [
                26716,
                26971
            ],
            [
                26971,
                27064
            ]
        ]
    },
    "abridged": {
        "text": "\"Now my cousins are at Diplow,\" said Grandcourt, \"will you go there? The carriage shall come for Mrs. Davilow. You can tell me what you would like done in the rooms. Things must be put in decent order while we are away at Ryelands. And tomorrow is the only day.\"\nHe was sitting on a sofa in the drawing-room at Offendene, one elbow resting on the back, in the attitude of a man who is much interested in watching the person next to him. Gwendolen, who had always disliked needlework, had taken to it with apparent zeal since her engagement, and now held a piece of white embroidery which, on examination, would have shown many false stitches. During the last eight or nine days their hours had been chiefly spent on horseback, but some time had been left for this more difficult sort of companionship, which, however, Gwendolen had not found disagreeable. She was very well satisfied with Grandcourt. His answers to her lively questions about what he had seen and done in his life, bore drawling very well. She felt not only that he had nothing of the fool in his composition, but that by some subtle means he gave the impression that all the folly lay with other people.\nAnd then Grandcourt's behaviour as a lover had hardly passed the limit of an unobtrusive homage. One day, indeed, he had kissed her neck, below her ear; and Gwendolen, taken by surprise, had started up with a marked agitation which made him say, \"I beg your pardon - did I annoy you?\"\n\"Oh, it was nothing,\" said Gwendolen, rather afraid of herself, \"only I cannot bear - to be kissed under my ear.\" She sat down again with a little playful laugh, but felt her heart beating with a vague fear: she was no longer at liberty to flout him as she had flouted poor Rex. Her agitation seemed to him to be a compliment, and he was content not to transgress again.\nToday rain hindered riding; but to compensate, a package had come from London, and beautiful things (of Grandcourt's ordering) lay scattered about on the tables for Gwendolen to enjoy. She said with a pretty air of perversity-\n\"Why is tomorrow the only day?\"\n\"Because the next day is the first with the hounds,\" said Grandcourt. \"And after that I must go away for a couple of days - it's a bore - but I shall go one day and come back the next.\" He noticed a change in her face, and laying his hand on hers, he said, \"You object to my going away?\"\n\"It's no use objecting,\" said Gwendolen, coldly. She was resisting the temptation to tell him that she suspected to whom he was going.\nGrandcourt said, enfolding her hand, \"I will travel at night, so as only to be away one day.\" He thought that he knew the reason of what he inwardly called this bit of temper, and she was particularly fascinating to him at this moment. \"You will go to Diplow tomorrow?\"\n\"Oh, yes, if you wish it,\" said Gwendolen, in a high tone of careless assent. Her concentration on other feelings had prevented her from noticing that her hand was being held.\n\"How you treat us poor devils of men!\" said Grandcourt. \"We are always getting the worst of it.\"\n\"Are you?\" said Gwendolen. She longed to believe this commonplace statement was the truth: in that case, Mrs. Glasher would appear more blameable than Grandcourt. \"Are you always getting the worst?\"\n\"Yes. Are you as kind to me as I am to you?\" said Grandcourt, looking into her eyes with his narrow gaze.\nGwendolen felt herself stricken. She was conscious of having received so much, that her sense of command was checked. She could not turn back: it was as if she had consented to mount a chariot where another held the reins. All she could do was to adjust herself, so that the spikes of that unwilling penance which conscience imposed should not gall her. With a sort of inward shiver, she resolutely changed her mental attitude, and smiling suddenly, she said-\n\"If I were as kind to you as you are to me, that would spoil your generosity: it would no longer be as great as it is.\"\n\"Then I am not to ask for one kiss,\" said Grandcourt, contented to pay a large price for this new kind of love-making, which introduced marriage by the finest contrast.\n\"Not one!\" said Gwendolen, getting saucy.\nHe lifted her little left hand to his lips, and then released it respectfully. Indeed, he was almost charming; and she felt at this moment that it was not likely she could ever have loved another man better than this one. His reticence gave her some inexplicable, delightful consciousness.\n\"Is there anyone besides the Torringtons at Diplow?\" she said, taking up her work again.\n\"She has a sister with her,\" said Grandcourt, \"and there are two men - one of them you know, I believe. You saw him at Leubronn - young Deronda - with the Mallingers.\"\nGwendolen felt as if her heart made a sudden jump. \"I never spoke to him,\" she said, dreading to show any change. \"Is he not disagreeable?\"\n\"Not particularly,\" said Grandcourt languidly. \"He thinks a little too much of himself. I thought he had been introduced to you.\"\n\"No. Some one told me his name before I came away, that's all. What is he?\"\n\"A ward of Sir Hugo Mallinger's. Nothing of any consequence.\"\n\"Oh, poor creature! How very unpleasant for him!\" said Gwendolen, speaking from the lip, and not meaning any sarcasm. \"I wonder if it has left off raining!\" she added, rising to look out of the window.\nHappily it did not rain the next day, and Gwendolen rode to Diplow on Criterion. She always felt more daring in her riding-dress; besides having the fortifying belief that she looked as well as possible in it. Her anger toward Deronda had changed to superstitious dread lest his first interference in her life might foreshadow some future influence. It is of such stuff that superstitions are made; and they carry consequences which often verify their hope or their foreboding.\nShe did not see Deronda until lunchtime. But from the first moment of their being in the room together, she seemed to herself to be doing nothing but notice him.\nWhen he took his place at lunch, Grandcourt said, \"Deronda, Miss Harleth tells me you were not introduced to her at Leubronn?\"\n\"Miss Harleth hardly remembers me, I imagine,\" said Deronda, looking at her as they bowed. \"She was intensely occupied when I saw her.\"\nNow, did he suppose that she had not suspected him of being the person who redeemed her necklace?\n\"On the contrary. I remember you very well,\" said Gwendolen, feeling rather nervous, but governing herself. \"You did not approve of my playing at roulette.\"\n\"How did you come to that conclusion?\" said Deronda, gravely.\n\"Oh, you cast an evil eye on my play,\" said Gwendolen, with a turn of her head and a smile. \"I began to lose as soon as you came to look on. I had been winning till then.\"\n\"Roulette in such a kennel as Leubronn is a horrid bore,\" said Grandcourt.\n\"I found it a bore when I began to lose,\" said Gwendolen. Her face was turned toward Grandcourt as she smiled and spoke, but she gave a sidelong glance at Deronda, and saw his eyes fixed on her with a gravely penetrating look. She wheeled her neck round as if she wanted to listen to what was being said by the rest, while she was only thinking of Deronda. His face had that disturbing expression which threatens to affect one's opinion - as if one's standard was somehow wrong. His voice, heard now for the first time, was to Grandcourt's toneless drawl as the deep notes of a cello to the broken discourse of poultry. Grandcourt, she decided, was perhaps right in saying that Deronda thought too much of himself: a favourite way of explaining a superiority that humiliates.\nThe talk turned on the West Indies, and no more was said about roulette. Gwendolen trifled with her jelly, and looked at every speaker in turn that she might feel at ease in looking at Deronda.\n\"I wonder what he thinks of me, really? He must have felt interested in me, else he would not have sent me my necklace. I wonder what he thinks of my marriage? Why is he so grave? Why has he come to Diplow?\"\nThese questions ran in her mind, and she felt an uneasy longing to be admired by Deronda - a longing which sprang from her first resentment at his critical glance. Why did she care so much about the opinion of this man who was \"nothing of any consequence\"? She had no time to find the reason: she was too much engaged in caring.\nIn the drawing-room, when something had called Grandcourt away, she went up to Deronda, and said-\n\"Shall you hunt tomorrow, Mr. Deronda?\"\n\"Yes, I believe so.\"\n\"You don't object to hunting, then?\"\n\"It is a sin I am inclined to, when I can't get boating or cricket.\"\n\"Do you object to my hunting?\" said Gwendolen, with a saucy movement of the chin.\n\"I have no right to object to anything you choose to do.\"\n\"You thought you had a right to object to my gambling,\" persisted Gwendolen.\n\"I was sorry for it. I am not aware that I told you of my objection,\" said Deronda, with his usual directness of gaze - a large-eyed gravity, innocent of any intention. His eyes had an intensity which seemed to express a special interest in everyone on whom he fixed them, and which might easily encourage them to ask for his help and sympathy.\n\"You hindered me from gambling again,\" she answered. But she had no sooner spoken than she blushed over face and neck; and Deronda blushed, too, conscious that in the little affair of the necklace he had taken a questionable freedom.\nIt was impossible to speak further; and she turned away to a window, feeling that she had stupidly said what she had not meant to say, and yet being rather happy that she had plunged into this mutual understanding.\nDeronda also did not dislike it. Gwendolen seemed more decidedly attractive than before; and certainly she had changed since Leubronn: she showed the consciousness of error rather than her former crude self-confidence.\nThat evening Mrs. Davilow said, \"Did Mr. Deronda really spoil your play, Gwen?\"\n\"Oh, it merely happened that he was looking on when I began to lose,\" said Gwendolen, carelessly. \"I noticed him.\"\n\"I don't wonder: he is a striking young man. He puts me in mind of Italian paintings. One would guess, without being told, that there was foreign blood in his veins.\"\n\"Is there?\"\n\"Mrs. Torrington says so. She told me that his mother was some foreigner of high rank.\"\n\"His mother?\" said Gwendolen, rather sharply. \"Then who was his father?\"\n\"Well - everyone says he is the son of Sir Hugo Mallinger, who brought him up; though he passes for a ward. She says, if Sir Hugo could have done as he liked with his estates, he would have left them to this Mr. Deronda, since he has no legitimate son.\"\nGwendolen was silent; but her mother saw so marked an effect in her face that she was angry with herself for having repeated Mrs. Torrington's gossip. It seemed, on reflection, unsuited to her daughter's ear.\nAn image of the sad, dark-eyed, unknown mother had immediately arisen in Gwendolen's mind. A dark-eyed woman, no longer young, had become \"stuff o' the conscience\" to her.\nThat night when she was in her little bed, and only a dim light was burning, she said-\n\"Mamma, have men generally children before they are married?\"\n\"No, dear,\" said Mrs. Davilow.\n\"If it were so, I ought to know,\" said Gwendolen indignantly.\n\"You are thinking of what I said about Mr. Deronda and Sir Hugo Mallinger. That is a very unusual case, dear.\"\n\"Does Lady Mallinger know?\"\n\"She knows enough to satisfy her. That is quite clear, because Mr. Deronda has lived with them.\"\n\"And people think no worse of him?\"\n\"Well, of course he does not inherit the property. But people are not obliged to know anything about his birth; he is very well received.\"\n\"I wonder whether he knows about it; and is angry with his father?\"\n\"My dear child, why should you think of that?\"\n\"Why?\" said Gwendolen, impetuously, sitting up in her bed. \"Haven't children reason to be angry with their parents? How can they help their parents marrying or not marrying?\"\nBut a consciousness rushed upon her, which made her fall back again on her pillow. It was not only that she might seem to reproach her mother for her second marriage; but she had been led to a condemnation which made her own marriage a forbidden thing.\nThere was no further talk, and till sleep came Gwendolen lay struggling with the reasons against that marriage - reasons which pressed upon her newly, now that they were unexpectedly mirrored in the story of Deronda, whose relations with her had bitten themselves into the most permanent layers of feeling. But for all her debating, she was never troubled by the question whether it was defensible of her to marry Grandcourt solely for convenience, without seeing him as one to whom she was to bind herself in duty.\nIn the morning there was a double excitement for her. She was going to hunt; and she was going again to see Deronda, in whom her interest had grown.\nWhat sort of life and career had he before him? With only a little difference in events he might have been as important as Grandcourt, nay, might have held the very estates which Grandcourt was to have. But now, Deronda would probably some day see her bearing the title which would have been his own wife's.\nShe had now to see her marriage in a new light, as a hard, unfair exclusion of others. What she had heard about Deronda seemed to throw him into one group with Mrs. Glasher and her children. Perhaps Deronda himself was thinking of these things. Could he know of Mrs. Glasher? If he knew that she knew, he would despise her; but he could have no such knowledge. Would he, without that, despise her for marrying Grandcourt? His possible judgment of her actions was telling on her as strongly as Klesmer's judgment of her powers; but she felt some strength in saying-\n\"How can I help what other people have done? Things would not come right if I were to turn round now and declare that I would not marry Mr. Grandcourt.\" And such turning round was out of the question. The horses in the chariot she had mounted were going at full speed.\nAnd the immediate delightful fact was the hunt, where she would see Deronda, and where he would see her; for always lurking in her thoughts about him was the impression that he was very much interested in her. But today she was resolved not to repeat her folly of yesterday, as if she were anxious to say anything to him. Indeed, the hunt would be too absorbing.\nSo it was for a long while. Deronda was there, and within her sight; but this only added to the pleasure of the hunt. No accident happened to throw them together; and once they were within reach of home, and Gwendolen was returning with the company to Offendene, the sense of glorious excitement had gone. She was irritably disappointed that she had had no opportunity of speaking to Deronda, whom she would not see again, since he was to go away in a couple of days.\nWhat was she going to say? That was not quite certain. She wanted to speak to him. Grandcourt was by her side, and Deronda's horse she could hear behind. The wish to speak to him was becoming imperious; and there was no chance of it unless she simply asserted her will and defied everything. Where the order of things could give way to Miss Gwendolen, it must be made to do so.\nThe horse-hoofs heard behind her were a growing irritation. She reined in her horse and looked back; Grandcourt also paused; but she, waving her whip with playful imperiousness, said, \"Go on! I want to speak to Mr. Deronda.\"\nGrandcourt hesitated; it was an awkward situation for him. No gentleman, before marriage, could refuse a command delivered in this playful way. He rode on slowly, and she waited till Deronda came up. He looked at her with tacit inquiry, and she said at once, riding alongside him-\n\"Mr. Deronda, you must enlighten me. Why did you think it wrong for me to gamble? Is it because I am a woman?\"\n\"Not altogether; but I regretted it the more because you were a woman,\" said Deronda, with an irrepressible smile. Apparently it must be understood between them now that it was he who sent the necklace. \"I think it would be better for men not to gamble. It is a taste likely to turn into a disease. And, besides, there is something revolting to me in raking a heap of money together, and chuckling over it, when others are feeling the loss of it. There are enough events where our gain is another's loss: that is one of the ugly aspects of life. One should not get amusement out of exaggerating it.\" Deronda's voice had gathered some indignation.\n\"But you do admit that we can't help things,\" said Gwendolen. The answer had not been anything like what she had expected. \"We can't always help it that our gain is another's loss.\"\n\"Clearly. But we should help it where we can.\"\nGwendolen, biting her lip, paused, and then forcing herself to speak playfully again, said-\n\"But why should you regret it more because I am a woman?\"\n\"Perhaps because we need you to be better than us.\"\n\"But suppose we need men to be better than us,\" said Gwendolen with a little air of \"check!\"\n\"That is rather a difficulty,\" said Deronda, smiling. \"I suppose I should have said, we each of us think it would be better for the other to be good.\"\n\"You see, I needed you to be better than I was - and you thought so,\" said Gwendolen, laughing, while she put her horse forward and joined Grandcourt, who made no observation.\n\"Don't you want to know what I had to say to Mr. Deronda?\" said Gwendolen, whose pride required her to account for her conduct.\n\"Ah - no,\" said Grandcourt, coldly.\n\"Now that is the first impolite word you have spoken - that you don't wish to hear what I had to say,\" said Gwendolen, playing at a pout.\n\"I wish to hear what you say to me, not to other men,\" said Grandcourt.\n\"I wanted to make him tell me why he objected to my gambling, and he gave me a little sermon.\"\n\"Excuse me the sermon.\" If Gwendolen imagined that Grandcourt cared about her speaking to Deronda, he wished her to know that she was mistaken. But he was not fond of being told to ride on. She saw he was piqued, but did not mind. She had accomplished her object of speaking again to Deronda before he turned with the rest toward Diplow, while her lover attended her to Offendene, where he was to bid farewell before his absence on the unspecified journey. Grandcourt was going by train to Gadsmere.",
        "paragraph_chars": [
            [
                0,
                263
            ],
            [
                263,
                1172
            ],
            [
                1172,
                1457
            ],
            [
                1457,
                1828
            ],
            [
                1828,
                2055
            ],
            [
                2055,
                2087
            ],
            [
                2087,
                2375
            ],
            [
                2375,
                2510
            ],
            [
                2510,
                2780
            ],
            [
                2780,
                2956
            ],
            [
                2956,
                3053
            ],
            [
                3053,
                3252
            ],
            [
                3252,
                3358
            ],
            [
                3358,
                3818
            ],
            [
                3818,
                3938
            ],
            [
                3938,
                4107
            ],
            [
                4107,
                4149
            ],
            [
                4149,
                4439
            ],
            [
                4439,
                4528
            ],
            [
                4528,
                4696
            ],
            [
                4696,
                4836
            ],
            [
                4836,
                4966
            ],
            [
                4966,
                5042
            ],
            [
                5042,
                5104
            ],
            [
                5104,
                5306
            ],
            [
                5306,
                5784
            ],
            [
                5784,
                5946
            ],
            [
                5946,
                6073
            ],
            [
                6073,
                6209
            ],
            [
                6209,
                6307
            ],
            [
                6307,
                6464
            ],
            [
                6464,
                6526
            ],
            [
                6526,
                6698
            ],
            [
                6698,
                6773
            ],
            [
                6773,
                7549
            ],
            [
                7549,
                7743
            ],
            [
                7743,
                7951
            ],
            [
                7951,
                8280
            ],
            [
                8280,
                8378
            ],
            [
                8378,
                8418
            ],
            [
                8418,
                8439
            ],
            [
                8439,
                8476
            ],
            [
                8476,
                8545
            ],
            [
                8545,
                8627
            ],
            [
                8627,
                8685
            ],
            [
                8685,
                8762
            ],
            [
                8762,
                9107
            ],
            [
                9107,
                9341
            ],
            [
                9341,
                9556
            ],
            [
                9556,
                9775
            ],
            [
                9775,
                9855
            ],
            [
                9855,
                9970
            ],
            [
                9970,
                10137
            ],
            [
                10137,
                10149
            ],
            [
                10149,
                10237
            ],
            [
                10237,
                10310
            ],
            [
                10310,
                10564
            ],
            [
                10564,
                10773
            ],
            [
                10773,
                10945
            ],
            [
                10945,
                11032
            ],
            [
                11032,
                11094
            ],
            [
                11094,
                11125
            ],
            [
                11125,
                11187
            ],
            [
                11187,
                11298
            ],
            [
                11298,
                11326
            ],
            [
                11326,
                11423
            ],
            [
                11423,
                11459
            ],
            [
                11459,
                11598
            ],
            [
                11598,
                11666
            ],
            [
                11666,
                11713
            ],
            [
                11713,
                11888
            ],
            [
                11888,
                12141
            ],
            [
                12141,
                12657
            ],
            [
                12657,
                12806
            ],
            [
                12806,
                13114
            ],
            [
                13114,
                13679
            ],
            [
                13679,
                13948
            ],
            [
                13948,
                14311
            ],
            [
                14311,
                14779
            ],
            [
                14779,
                15157
            ],
            [
                15157,
                15382
            ],
            [
                15382,
                15663
            ],
            [
                15663,
                15774
            ],
            [
                15774,
                16421
            ],
            [
                16421,
                16603
            ],
            [
                16603,
                16650
            ],
            [
                16650,
                16742
            ],
            [
                16742,
                16800
            ],
            [
                16800,
                16852
            ],
            [
                16852,
                16945
            ],
            [
                16945,
                17096
            ],
            [
                17096,
                17272
            ],
            [
                17272,
                17400
            ],
            [
                17400,
                17436
            ],
            [
                17436,
                17574
            ],
            [
                17574,
                17646
            ],
            [
                17646,
                17741
            ],
            [
                17741,
                18240
            ]
        ],
        "segment_chars": [
            [
                0,
                69
            ],
            [
                69,
                111
            ],
            [
                111,
                166
            ],
            [
                166,
                232
            ],
            [
                232,
                263
            ],
            [
                263,
                437
            ],
            [
                437,
                643
            ],
            [
                643,
                856
            ],
            [
                856,
                901
            ],
            [
                901,
                1007
            ],
            [
                1007,
                1172
            ],
            [
                1172,
                1269
            ],
            [
                1269,
                1457
            ],
            [
                1457,
                1571
            ],
            [
                1571,
                1736
            ],
            [
                1736,
                1828
            ],
            [
                1828,
                2013
            ],
            [
                2013,
                2055
            ],
            [
                2055,
                2087
            ],
            [
                2087,
                2157
            ],
            [
                2157,
                2273
            ],
            [
                2273,
                2375
            ],
            [
                2375,
                2424
            ],
            [
                2424,
                2510
            ],
            [
                2510,
                2604
            ],
            [
                2604,
                2746
            ],
            [
                2746,
                2780
            ],
            [
                2780,
                2858
            ],
            [
                2858,
                2956
            ],
            [
                2956,
                2995
            ],
            [
                2995,
                3012
            ],
            [
                3012,
                3053
            ],
            [
                3053,
                3064
            ],
            [
                3064,
                3080
            ],
            [
                3080,
                3216
            ],
            [
                3216,
                3252
            ],
            [
                3252,
                3258
            ],
            [
                3258,
                3297
            ],
            [
                3297,
                3358
            ],
            [
                3358,
                3391
            ],
            [
                3391,
                3476
            ],
            [
                3476,
                3581
            ],
            [
                3581,
                3712
            ],
            [
                3712,
                3818
            ],
            [
                3818,
                3938
            ],
            [
                3938,
                4107
            ],
            [
                4107,
                4118
            ],
            [
                4118,
                4149
            ],
            [
                4149,
                4228
            ],
            [
                4228,
                4371
            ],
            [
                4371,
                4439
            ],
            [
                4439,
                4492
            ],
            [
                4492,
                4528
            ],
            [
                4528,
                4632
            ],
            [
                4632,
                4696
            ],
            [
                4696,
                4747
            ],
            [
                4747,
                4810
            ],
            [
                4810,
                4836
            ],
            [
                4836,
                4883
            ],
            [
                4883,
                4924
            ],
            [
                4924,
                4966
            ],
            [
                4966,
                4971
            ],
            [
                4971,
                5029
            ],
            [
                5029,
                5042
            ],
            [
                5042,
                5075
            ],
            [
                5075,
                5104
            ],
            [
                5104,
                5124
            ],
            [
                5124,
                5154
            ],
            [
                5154,
                5222
            ],
            [
                5222,
                5261
            ],
            [
                5261,
                5306
            ],
            [
                5306,
                5387
            ],
            [
                5387,
                5516
            ],
            [
                5516,
                5656
            ],
            [
                5656,
                5784
            ],
            [
                5784,
                5825
            ],
            [
                5825,
                5946
            ],
            [
                5946,
                6073
            ],
            [
                6073,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6307
            ],
            [
                6307,
                6325
            ],
            [
                6325,
                6415
            ],
            [
                6415,
                6464
            ],
            [
                6464,
                6503
            ],
            [
                6503,
                6526
            ],
            [
                6526,
                6618
            ],
            [
                6618,
                6667
            ],
            [
                6667,
                6698
            ],
            [
                6698,
                6773
            ],
            [
                6773,
                6831
            ],
            [
                6831,
                7000
            ],
            [
                7000,
                7130
            ],
            [
                7130,
                7252
            ],
            [
                7252,
                7393
            ],
            [
                7393,
                7549
            ],
            [
                7549,
                7622
            ],
            [
                7622,
                7743
            ],
            [
                7743,
                7783
            ],
            [
                7783,
                7863
            ],
            [
                7863,
                7903
            ],
            [
                7903,
                7923
            ],
            [
                7923,
                7951
            ],
            [
                7951,
                8115
            ],
            [
                8115,
                8208
            ],
            [
                8208,
                8280
            ],
            [
                8280,
                8378
            ],
            [
                8378,
                8418
            ],
            [
                8418,
                8439
            ],
            [
                8439,
                8476
            ],
            [
                8476,
                8545
            ],
            [
                8545,
                8576
            ],
            [
                8576,
                8627
            ],
            [
                8627,
                8685
            ],
            [
                8685,
                8762
            ],
            [
                8762,
                8783
            ],
            [
                8783,
                8931
            ],
            [
                8931,
                9107
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9341
            ],
            [
                9341,
                9556
            ],
            [
                9556,
                9589
            ],
            [
                9589,
                9775
            ],
            [
                9775,
                9855
            ],
            [
                9855,
                9953
            ],
            [
                9953,
                9970
            ],
            [
                9970,
                10015
            ],
            [
                10015,
                10056
            ],
            [
                10056,
                10137
            ],
            [
                10137,
                10149
            ],
            [
                10149,
                10175
            ],
            [
                10175,
                10237
            ],
            [
                10237,
                10251
            ],
            [
                10251,
                10283
            ],
            [
                10283,
                10310
            ],
            [
                10310,
                10418
            ],
            [
                10418,
                10564
            ],
            [
                10564,
                10715
            ],
            [
                10715,
                10773
            ],
            [
                10773,
                10864
            ],
            [
                10864,
                10945
            ],
            [
                10945,
                11032
            ],
            [
                11032,
                11094
            ],
            [
                11094,
                11125
            ],
            [
                11125,
                11187
            ],
            [
                11187,
                11262
            ],
            [
                11262,
                11298
            ],
            [
                11298,
                11326
            ],
            [
                11326,
                11360
            ],
            [
                11360,
                11423
            ],
            [
                11423,
                11459
            ],
            [
                11459,
                11510
            ],
            [
                11510,
                11598
            ],
            [
                11598,
                11666
            ],
            [
                11666,
                11713
            ],
            [
                11713,
                11720
            ],
            [
                11720,
                11772
            ],
            [
                11772,
                11829
            ],
            [
                11829,
                11888
            ],
            [
                11888,
                11971
            ],
            [
                11971,
                12141
            ],
            [
                12141,
                12448
            ],
            [
                12448,
                12657
            ],
            [
                12657,
                12711
            ],
            [
                12711,
                12806
            ],
            [
                12806,
                12854
            ],
            [
                12854,
                13009
            ],
            [
                13009,
                13114
            ],
            [
                13114,
                13201
            ],
            [
                13201,
                13305
            ],
            [
                13305,
                13359
            ],
            [
                13359,
                13390
            ],
            [
                13390,
                13475
            ],
            [
                13475,
                13536
            ],
            [
                13536,
                13679
            ],
            [
                13679,
                13724
            ],
            [
                13724,
                13832
            ],
            [
                13832,
                13880
            ],
            [
                13880,
                13948
            ],
            [
                13948,
                14158
            ],
            [
                14158,
                14270
            ],
            [
                14270,
                14311
            ],
            [
                14311,
                14339
            ],
            [
                14339,
                14429
            ],
            [
                14429,
                14617
            ],
            [
                14617,
                14779
            ],
            [
                14779,
                14806
            ],
            [
                14806,
                14834
            ],
            [
                14834,
                14862
            ],
            [
                14862,
                14933
            ],
            [
                14933,
                15071
            ],
            [
                15071,
                15157
            ],
            [
                15157,
                15217
            ],
            [
                15217,
                15349
            ],
            [
                15349,
                15382
            ],
            [
                15382,
                15441
            ],
            [
                15441,
                15526
            ],
            [
                15526,
                15582
            ],
            [
                15582,
                15663
            ],
            [
                15663,
                15700
            ],
            [
                15700,
                15745
            ],
            [
                15745,
                15774
            ],
            [
                15774,
                15889
            ],
            [
                15889,
                15977
            ],
            [
                15977,
                16028
            ],
            [
                16028,
                16073
            ],
            [
                16073,
                16221
            ],
            [
                16221,
                16320
            ],
            [
                16320,
                16374
            ],
            [
                16374,
                16421
            ],
            [
                16421,
                16483
            ],
            [
                16483,
                16544
            ],
            [
                16544,
                16603
            ],
            [
                16603,
                16613
            ],
            [
                16613,
                16650
            ],
            [
                16650,
                16742
            ],
            [
                16742,
                16800
            ],
            [
                16800,
                16852
            ],
            [
                16852,
                16945
            ],
            [
                16945,
                16999
            ],
            [
                16999,
                17096
            ],
            [
                17096,
                17272
            ],
            [
                17272,
                17331
            ],
            [
                17331,
                17400
            ],
            [
                17400,
                17436
            ],
            [
                17436,
                17574
            ],
            [
                17574,
                17646
            ],
            [
                17646,
                17741
            ],
            [
                17741,
                17765
            ],
            [
                17765,
                17885
            ],
            [
                17885,
                17931
            ],
            [
                17931,
                17972
            ],
            [
                17972,
                18198
            ],
            [
                18198,
                18240
            ]
        ],
        "overlap_chars": [
            [
                0,
                68
            ],
            [
                69,
                111
            ],
            [
                111,
                166
            ],
            [
                166,
                232
            ],
            [
                232,
                235
            ],
            [
                245,
                263
            ],
            [
                263,
                277
            ],
            [
                278,
                325
            ],
            [
                326,
                352
            ],
            [
                353,
                437
            ],
            [
                437,
                643
            ],
            [
                643,
                735
            ],
            [
                741,
                744
            ],
            [
                745,
                856
            ],
            [
                856,
                901
            ],
            [
                901,
                1007
            ],
            [
                1007,
                1010
            ],
            [
                1016,
                1109
            ],
            [
                1115,
                1170
            ],
            [
                1170,
                1171
            ],
            [
                1172,
                1175
            ],
            [
                1176,
                1193
            ],
            [
                1204,
                1225
            ],
            [
                1226,
                1248
            ],
            [
                1253,
                1260
            ],
            [
                1261,
                1267
            ],
            [
                1267,
                1269
            ],
            [
                1269,
                1299
            ],
            [
                1300,
                1308
            ],
            [
                1310,
                1412
            ],
            [
                1413,
                1436
            ],
            [
                1439,
                1456
            ],
            [
                1457,
                1540
            ],
            [
                1543,
                1571
            ],
            [
                1571,
                1622
            ],
            [
                1623,
                1736
            ],
            [
                1736,
                1756
            ],
            [
                1782,
                1790
            ],
            [
                1795,
                1802
            ],
            [
                1803,
                1828
            ],
            [
                1834,
                1910
            ],
            [
                1911,
                1954
            ],
            [
                1955,
                1988
            ],
            [
                1989,
                1992
            ],
            [
                1993,
                2002
            ],
            [
                2003,
                2005
            ],
            [
                2011,
                2013
            ],
            [
                2013,
                2016
            ],
            [
                2017,
                2053
            ],
            [
                2055,
                2062
            ],
            [
                2072,
                2087
            ],
            [
                2087,
                2156
            ],
            [
                2157,
                2158
            ],
            [
                2162,
                2208
            ],
            [
                2211,
                2222
            ],
            [
                2225,
                2273
            ],
            [
                2273,
                2275
            ],
            [
                2276,
                2309
            ],
            [
                2317,
                2325
            ],
            [
                2326,
                2334
            ],
            [
                2338,
                2375
            ],
            [
                2375,
                2424
            ],
            [
                2424,
                2441
            ],
            [
                2442,
                2445
            ],
            [
                2446,
                2508
            ],
            [
                2508,
                2510
            ],
            [
                2510,
                2520
            ],
            [
                2521,
                2525
            ],
            [
                2525,
                2545
            ],
            [
                2547,
                2548
            ],
            [
                2548,
                2604
            ],
            [
                2604,
                2745
            ],
            [
                2746,
                2747
            ],
            [
                2747,
                2768
            ],
            [
                2777,
                2780
            ],
            [
                2780,
                2858
            ],
            [
                2858,
                2875
            ],
            [
                2879,
                2897
            ],
            [
                2908,
                2916
            ],
            [
                2926,
                2956
            ],
            [
                2956,
                2995
            ],
            [
                2995,
                3010
            ],
            [
                3010,
                3012
            ],
            [
                3012,
                3053
            ],
            [
                3053,
                3054
            ],
            [
                3054,
                3057
            ],
            [
                3058,
                3064
            ],
            [
                3064,
                3078
            ],
            [
                3078,
                3080
            ],
            [
                3080,
                3118
            ],
            [
                3129,
                3132
            ],
            [
                3133,
                3136
            ],
            [
                3137,
                3142
            ],
            [
                3142,
                3156
            ],
            [
                3156,
                3188
            ],
            [
                3194,
                3216
            ],
            [
                3216,
                3217
            ],
            [
                3217,
                3220
            ],
            [
                3221,
                3252
            ],
            [
                3252,
                3258
            ],
            [
                3258,
                3297
            ],
            [
                3297,
                3358
            ],
            [
                3358,
                3391
            ],
            [
                3391,
                3474
            ],
            [
                3476,
                3579
            ],
            [
                3579,
                3581
            ],
            [
                3581,
                3588
            ],
            [
                3595,
                3597
            ],
            [
                3598,
                3712
            ],
            [
                3712,
                3726
            ],
            [
                3734,
                3784
            ],
            [
                3784,
                3785
            ],
            [
                3786,
                3789
            ],
            [
                3806,
                3816
            ],
            [
                3818,
                3932
            ],
            [
                3933,
                3935
            ],
            [
                3935,
                3938
            ],
            [
                3938,
                4107
            ],
            [
                4107,
                4115
            ],
            [
                4118,
                4147
            ],
            [
                4147,
                4149
            ],
            [
                4149,
                4228
            ],
            [
                4236,
                4371
            ],
            [
                4371,
                4439
            ],
            [
                4439,
                4448
            ],
            [
                4456,
                4463
            ],
            [
                4468,
                4471
            ],
            [
                4480,
                4489
            ],
            [
                4492,
                4495
            ],
            [
                4500,
                4501
            ],
            [
                4512,
                4515
            ],
            [
                4528,
                4573
            ],
            [
                4574,
                4596
            ],
            [
                4599,
                4630
            ],
            [
                4632,
                4655
            ],
            [
                4658,
                4671
            ],
            [
                4674,
                4696
            ],
            [
                4696,
                4726
            ],
            [
                4732,
                4740
            ],
            [
                4745,
                4746
            ],
            [
                4747,
                4789
            ],
            [
                4798,
                4801
            ],
            [
                4802,
                4808
            ],
            [
                4808,
                4810
            ],
            [
                4810,
                4836
            ],
            [
                4836,
                4837
            ],
            [
                4837,
                4871
            ],
            [
                4872,
                4879
            ],
            [
                4881,
                4883
            ],
            [
                4883,
                4924
            ],
            [
                4924,
                4966
            ],
            [
                4966,
                4971
            ],
            [
                4971,
                4996
            ],
            [
                4997,
                5015
            ],
            [
                5027,
                5029
            ],
            [
                5029,
                5042
            ],
            [
                5042,
                5044
            ],
            [
                5045,
                5075
            ],
            [
                5075,
                5104
            ],
            [
                5104,
                5124
            ],
            [
                5124,
                5154
            ],
            [
                5154,
                5222
            ],
            [
                5222,
                5261
            ],
            [
                5261,
                5278
            ],
            [
                5279,
                5306
            ],
            [
                5306,
                5385
            ],
            [
                5385,
                5387
            ],
            [
                5387,
                5402
            ],
            [
                5403,
                5414
            ],
            [
                5415,
                5454
            ],
            [
                5466,
                5514
            ],
            [
                5514,
                5516
            ],
            [
                5516,
                5552
            ],
            [
                5553,
                5555
            ],
            [
                5556,
                5575
            ],
            [
                5576,
                5580
            ],
            [
                5581,
                5584
            ],
            [
                5585,
                5603
            ],
            [
                5604,
                5656
            ],
            [
                5656,
                5698
            ],
            [
                5699,
                5703
            ],
            [
                5705,
                5708
            ],
            [
                5714,
                5784
            ],
            [
                5784,
                5787
            ],
            [
                5800,
                5807
            ],
            [
                5819,
                5823
            ],
            [
                5823,
                5825
            ],
            [
                5829,
                5944
            ],
            [
                5944,
                5946
            ],
            [
                5946,
                5989
            ],
            [
                5990,
                6073
            ],
            [
                6073,
                6148
            ],
            [
                6149,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6307
            ],
            [
                6307,
                6325
            ],
            [
                6325,
                6413
            ],
            [
                6413,
                6415
            ],
            [
                6415,
                6464
            ],
            [
                6464,
                6503
            ],
            [
                6503,
                6526
            ],
            [
                6526,
                6618
            ],
            [
                6618,
                6667
            ],
            [
                6667,
                6672
            ],
            [
                6673,
                6698
            ],
            [
                6698,
                6773
            ],
            [
                6773,
                6774
            ],
            [
                6774,
                6775
            ],
            [
                6776,
                6831
            ],
            [
                6831,
                6973
            ],
            [
                6974,
                6993
            ],
            [
                6994,
                6998
            ],
            [
                6998,
                7000
            ],
            [
                7000,
                7130
            ],
            [
                7130,
                7158
            ],
            [
                7159,
                7195
            ],
            [
                7202,
                7209
            ],
            [
                7212,
                7252
            ],
            [
                7252,
                7327
            ],
            [
                7328,
                7350
            ],
            [
                7351,
                7391
            ],
            [
                7391,
                7393
            ],
            [
                7393,
                7408
            ],
            [
                7416,
                7487
            ],
            [
                7488,
                7489
            ],
            [
                7500,
                7548
            ],
            [
                7549,
                7571
            ],
            [
                7583,
                7622
            ],
            [
                7622,
                7743
            ],
            [
                7743,
                7783
            ],
            [
                7783,
                7863
            ],
            [
                7863,
                7903
            ],
            [
                7910,
                7912
            ],
            [
                7913,
                7921
            ],
            [
                7921,
                7923
            ],
            [
                7923,
                7926
            ],
            [
                7931,
                7951
            ],
            [
                7951,
                7982
            ],
            [
                7997,
                8020
            ],
            [
                8029,
                8039
            ],
            [
                8042,
                8057
            ],
            [
                8070,
                8115
            ],
            [
                8115,
                8208
            ],
            [
                8208,
                8242
            ],
            [
                8244,
                8279
            ],
            [
                8280,
                8352
            ],
            [
                8353,
                8367
            ],
            [
                8368,
                8376
            ],
            [
                8378,
                8393
            ],
            [
                8402,
                8418
            ],
            [
                8418,
                8439
            ],
            [
                8439,
                8476
            ],
            [
                8477,
                8505
            ],
            [
                8507,
                8542
            ],
            [
                8542,
                8545
            ],
            [
                8545,
                8576
            ],
            [
                8576,
                8627
            ],
            [
                8627,
                8685
            ],
            [
                8685,
                8762
            ],
            [
                8762,
                8783
            ],
            [
                8783,
                8879
            ],
            [
                8882,
                8931
            ],
            [
                8931,
                8943
            ],
            [
                8947,
                9002
            ],
            [
                9012,
                9038
            ],
            [
                9039,
                9044
            ],
            [
                9045,
                9057
            ],
            [
                9073,
                9075
            ],
            [
                9088,
                9092
            ],
            [
                9105,
                9106
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9341
            ],
            [
                9341,
                9555
            ],
            [
                9556,
                9589
            ],
            [
                9589,
                9658
            ],
            [
                9659,
                9666
            ],
            [
                9675,
                9680
            ],
            [
                9681,
                9690
            ],
            [
                9702,
                9705
            ],
            [
                9720,
                9722
            ],
            [
                9723,
                9728
            ],
            [
                9736,
                9751
            ],
            [
                9752,
                9773
            ],
            [
                9773,
                9775
            ],
            [
                9775,
                9808
            ],
            [
                9812,
                9823
            ],
            [
                9824,
                9830
            ],
            [
                9837,
                9855
            ],
            [
                9855,
                9953
            ],
            [
                9953,
                9970
            ],
            [
                9970,
                9985
            ],
            [
                9985,
                10015
            ],
            [
                10015,
                10056
            ],
            [
                10056,
                10137
            ],
            [
                10137,
                10148
            ],
            [
                10149,
                10175
            ],
            [
                10175,
                10237
            ],
            [
                10237,
                10251
            ],
            [
                10251,
                10283
            ],
            [
                10283,
                10310
            ],
            [
                10310,
                10315
            ],
            [
                10327,
                10418
            ],
            [
                10418,
                10439
            ],
            [
                10440,
                10564
            ],
            [
                10564,
                10600
            ],
            [
                10605,
                10715
            ],
            [
                10715,
                10752
            ],
            [
                10753,
                10765
            ],
            [
                10768,
                10771
            ],
            [
                10771,
                10773
            ],
            [
                10773,
                10781
            ],
            [
                10782,
                10788
            ],
            [
                10789,
                10792
            ],
            [
                10794,
                10803
            ],
            [
                10805,
                10819
            ],
            [
                10820,
                10862
            ],
            [
                10862,
                10864
            ],
            [
                10864,
                10939
            ],
            [
                10943,
                10945
            ],
            [
                10945,
                10964
            ],
            [
                10972,
                11030
            ],
            [
                11032,
                11094
            ],
            [
                11094,
                11103
            ],
            [
                11103,
                11124
            ],
            [
                11125,
                11173
            ],
            [
                11185,
                11187
            ],
            [
                11187,
                11262
            ],
            [
                11262,
                11298
            ],
            [
                11298,
                11326
            ],
            [
                11326,
                11360
            ],
            [
                11360,
                11423
            ],
            [
                11423,
                11459
            ],
            [
                11459,
                11478
            ],
            [
                11479,
                11508
            ],
            [
                11508,
                11510
            ],
            [
                11510,
                11570
            ],
            [
                11571,
                11598
            ],
            [
                11598,
                11638
            ],
            [
                11639,
                11666
            ],
            [
                11666,
                11713
            ],
            [
                11713,
                11720
            ],
            [
                11720,
                11772
            ],
            [
                11772,
                11829
            ],
            [
                11829,
                11888
            ],
            [
                11888,
                11971
            ],
            [
                11971,
                11986
            ],
            [
                11987,
                12009
            ],
            [
                12019,
                12033
            ],
            [
                12038,
                12053
            ],
            [
                12053,
                12054
            ],
            [
                12059,
                12075
            ],
            [
                12076,
                12099
            ],
            [
                12105,
                12141
            ],
            [
                12141,
                12187
            ],
            [
                12188,
                12251
            ],
            [
                12262,
                12290
            ],
            [
                12290,
                12291
            ],
            [
                12292,
                12348
            ],
            [
                12356,
                12357
            ],
            [
                12358,
                12363
            ],
            [
                12364,
                12386
            ],
            [
                12387,
                12448
            ],
            [
                12452,
                12455
            ],
            [
                12456,
                12520
            ],
            [
                12521,
                12527
            ],
            [
                12539,
                12541
            ],
            [
                12542,
                12554
            ],
            [
                12555,
                12572
            ],
            [
                12588,
                12589
            ],
            [
                12609,
                12627
            ],
            [
                12628,
                12631
            ],
            [
                12640,
                12656
            ],
            [
                12657,
                12711
            ],
            [
                12711,
                12732
            ],
            [
                12732,
                12781
            ],
            [
                12782,
                12798
            ],
            [
                12804,
                12806
            ],
            [
                12806,
                12823
            ],
            [
                12835,
                12852
            ],
            [
                12852,
                12854
            ],
            [
                12854,
                12944
            ],
            [
                12946,
                13009
            ],
            [
                13009,
                13049
            ],
            [
                13050,
                13113
            ],
            [
                13114,
                13117
            ],
            [
                13118,
                13132
            ],
            [
                13133,
                13136
            ],
            [
                13146,
                13201
            ],
            [
                13201,
                13213
            ],
            [
                13214,
                13240
            ],
            [
                13241,
                13303
            ],
            [
                13303,
                13305
            ],
            [
                13305,
                13359
            ],
            [
                13359,
                13390
            ],
            [
                13390,
                13475
            ],
            [
                13475,
                13536
            ],
            [
                13536,
                13594
            ],
            [
                13604,
                13648
            ],
            [
                13649,
                13677
            ],
            [
                13679,
                13724
            ],
            [
                13724,
                13832
            ],
            [
                13832,
                13880
            ],
            [
                13880,
                13948
            ],
            [
                13952,
                14071
            ],
            [
                14079,
                14158
            ],
            [
                14158,
                14161
            ],
            [
                14168,
                14270
            ],
            [
                14270,
                14311
            ],
            [
                14311,
                14339
            ],
            [
                14339,
                14378
            ],
            [
                14378,
                14406
            ],
            [
                14407,
                14415
            ],
            [
                14416,
                14418
            ],
            [
                14419,
                14422
            ],
            [
                14427,
                14429
            ],
            [
                14429,
                14473
            ],
            [
                14488,
                14492
            ],
            [
                14493,
                14499
            ],
            [
                14500,
                14518
            ],
            [
                14519,
                14559
            ],
            [
                14560,
                14572
            ],
            [
                14572,
                14573
            ],
            [
                14574,
                14577
            ],
            [
                14584,
                14586
            ],
            [
                14615,
                14617
            ],
            [
                14617,
                14624
            ],
            [
                14625,
                14778
            ],
            [
                14779,
                14806
            ],
            [
                14806,
                14834
            ],
            [
                14834,
                14862
            ],
            [
                14862,
                14888
            ],
            [
                14888,
                14889
            ],
            [
                14890,
                14933
            ],
            [
                14933,
                14957
            ],
            [
                14958,
                15071
            ],
            [
                15071,
                15156
            ],
            [
                15157,
                15172
            ],
            [
                15173,
                15185
            ],
            [
                15190,
                15217
            ],
            [
                15217,
                15251
            ],
            [
                15256,
                15268
            ],
            [
                15269,
                15306
            ],
            [
                15307,
                15349
            ],
            [
                15349,
                15382
            ],
            [
                15382,
                15403
            ],
            [
                15404,
                15441
            ],
            [
                15441,
                15477
            ],
            [
                15485,
                15526
            ],
            [
                15526,
                15582
            ],
            [
                15582,
                15640
            ],
            [
                15648,
                15657
            ],
            [
                15663,
                15695
            ],
            [
                15698,
                15700
            ],
            [
                15700,
                15703
            ],
            [
                15708,
                15711
            ],
            [
                15718,
                15743
            ],
            [
                15745,
                15774
            ],
            [
                15774,
                15889
            ],
            [
                15889,
                15977
            ],
            [
                15977,
                16028
            ],
            [
                16028,
                16035
            ],
            [
                16036,
                16041
            ],
            [
                16042,
                16073
            ],
            [
                16073,
                16161
            ],
            [
                16162,
                16221
            ],
            [
                16221,
                16237
            ],
            [
                16251,
                16278
            ],
            [
                16279,
                16320
            ],
            [
                16320,
                16323
            ],
            [
                16331,
                16374
            ],
            [
                16374,
                16419
            ],
            [
                16419,
                16421
            ],
            [
                16421,
                16481
            ],
            [
                16481,
                16483
            ],
            [
                16483,
                16544
            ],
            [
                16544,
                16545
            ],
            [
                16545,
                16603
            ],
            [
                16603,
                16613
            ],
            [
                16617,
                16650
            ],
            [
                16650,
                16675
            ],
            [
                16675,
                16683
            ],
            [
                16683,
                16718
            ],
            [
                16719,
                16723
            ],
            [
                16729,
                16740
            ],
            [
                16742,
                16800
            ],
            [
                16800,
                16824
            ],
            [
                16825,
                16828
            ],
            [
                16832,
                16846
            ],
            [
                16849,
                16852
            ],
            [
                16852,
                16864
            ],
            [
                16865,
                16867
            ],
            [
                16868,
                16872
            ],
            [
                16873,
                16876
            ],
            [
                16880,
                16894
            ],
            [
                16897,
                16945
            ],
            [
                16945,
                16999
            ],
            [
                16999,
                17096
            ],
            [
                17096,
                17142
            ],
            [
                17145,
                17181
            ],
            [
                17182,
                17272
            ],
            [
                17272,
                17331
            ],
            [
                17331,
                17352
            ],
            [
                17353,
                17400
            ],
            [
                17400,
                17401
            ],
            [
                17406,
                17436
            ],
            [
                17436,
                17488
            ],
            [
                17491,
                17574
            ],
            [
                17574,
                17608
            ],
            [
                17610,
                17646
            ],
            [
                17647,
                17741
            ],
            [
                17741,
                17742
            ],
            [
                17749,
                17765
            ],
            [
                17765,
                17856
            ],
            [
                17862,
                17885
            ],
            [
                17885,
                17931
            ],
            [
                17931,
                17972
            ],
            [
                17972,
                18042
            ],
            [
                18043,
                18157
            ],
            [
                18158,
                18161
            ],
            [
                18162,
                18198
            ],
            [
                18198,
                18208
            ],
            [
                18209,
                18240
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                69
            ],
            [
                69,
                111
            ],
            [
                111,
                166
            ],
            [
                166,
                232
            ],
            [
                232,
                263
            ],
            [
                263,
                437
            ],
            [
                437,
                643
            ],
            [
                643,
                856
            ],
            [
                856,
                901
            ],
            [
                901,
                1007
            ],
            [
                1007,
                1172
            ],
            [
                1172,
                1172
            ],
            [
                1172,
                1269
            ],
            [
                1269,
                1457
            ],
            [
                1457,
                1571
            ],
            [
                1571,
                1736
            ],
            [
                1736,
                1828
            ],
            [
                1828,
                2013
            ],
            [
                2013,
                2055
            ],
            [
                2055,
                2087
            ],
            [
                2087,
                2157
            ],
            [
                2157,
                2157
            ],
            [
                2157,
                2273
            ],
            [
                2273,
                2375
            ],
            [
                2375,
                2424
            ],
            [
                2424,
                2510
            ],
            [
                2510,
                2604
            ],
            [
                2604,
                2746
            ],
            [
                2746,
                2746
            ],
            [
                2746,
                2780
            ],
            [
                2780,
                2858
            ],
            [
                2858,
                2956
            ],
            [
                2956,
                2995
            ],
            [
                2995,
                3012
            ],
            [
                3012,
                3053
            ],
            [
                3053,
                3064
            ],
            [
                3064,
                3080
            ],
            [
                3080,
                3216
            ],
            [
                3216,
                3252
            ],
            [
                3252,
                3258
            ],
            [
                3258,
                3297
            ],
            [
                3297,
                3358
            ],
            [
                3358,
                3391
            ],
            [
                3391,
                3581
            ],
            [
                3581,
                3581
            ],
            [
                3581,
                3581
            ],
            [
                3581,
                3712
            ],
            [
                3712,
                3818
            ],
            [
                3818,
                3938
            ],
            [
                3938,
                4107
            ],
            [
                4107,
                4118
            ],
            [
                4118,
                4149
            ],
            [
                4149,
                4228
            ],
            [
                4228,
                4371
            ],
            [
                4371,
                4439
            ],
            [
                4439,
                4492
            ],
            [
                4492,
                4528
            ],
            [
                4528,
                4632
            ],
            [
                4632,
                4632
            ],
            [
                4632,
                4696
            ],
            [
                4696,
                4747
            ],
            [
                4747,
                4810
            ],
            [
                4810,
                4836
            ],
            [
                4836,
                4883
            ],
            [
                4883,
                4924
            ],
            [
                4924,
                4966
            ],
            [
                4966,
                4971
            ],
            [
                4971,
                5029
            ],
            [
                5029,
                5029
            ],
            [
                5029,
                5042
            ],
            [
                5042,
                5075
            ],
            [
                5075,
                5104
            ],
            [
                5104,
                5124
            ],
            [
                5124,
                5154
            ],
            [
                5154,
                5222
            ],
            [
                5222,
                5261
            ],
            [
                5261,
                5306
            ],
            [
                5306,
                5387
            ],
            [
                5387,
                5516
            ],
            [
                5516,
                5656
            ],
            [
                5656,
                5784
            ],
            [
                5784,
                5825
            ],
            [
                5825,
                5946
            ],
            [
                5946,
                6073
            ],
            [
                6073,
                6164
            ],
            [
                6164,
                6209
            ],
            [
                6209,
                6307
            ],
            [
                6307,
                6325
            ],
            [
                6325,
                6415
            ],
            [
                6415,
                6464
            ],
            [
                6464,
                6503
            ],
            [
                6503,
                6526
            ],
            [
                6526,
                6618
            ],
            [
                6618,
                6667
            ],
            [
                6667,
                6698
            ],
            [
                6698,
                6773
            ],
            [
                6773,
                6831
            ],
            [
                6831,
                7000
            ],
            [
                7000,
                7130
            ],
            [
                7130,
                7252
            ],
            [
                7252,
                7252
            ],
            [
                7252,
                7393
            ],
            [
                7393,
                7549
            ],
            [
                7549,
                7622
            ],
            [
                7622,
                7622
            ],
            [
                7622,
                7743
            ],
            [
                7743,
                7783
            ],
            [
                7783,
                7863
            ],
            [
                7863,
                7903
            ],
            [
                7903,
                7923
            ],
            [
                7923,
                7951
            ],
            [
                7951,
                8115
            ],
            [
                8115,
                8208
            ],
            [
                8208,
                8280
            ],
            [
                8280,
                8378
            ],
            [
                8378,
                8418
            ],
            [
                8418,
                8439
            ],
            [
                8439,
                8476
            ],
            [
                8476,
                8476
            ],
            [
                8476,
                8545
            ],
            [
                8545,
                8576
            ],
            [
                8576,
                8627
            ],
            [
                8627,
                8685
            ],
            [
                8685,
                8762
            ],
            [
                8762,
                8783
            ],
            [
                8783,
                8931
            ],
            [
                8931,
                9107
            ],
            [
                9107,
                9107
            ],
            [
                9107,
                9107
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9341
            ],
            [
                9341,
                9556
            ],
            [
                9556,
                9589
            ],
            [
                9589,
                9775
            ],
            [
                9775,
                9855
            ],
            [
                9855,
                9855
            ],
            [
                9855,
                9953
            ],
            [
                9953,
                9970
            ],
            [
                9970,
                10015
            ],
            [
                10015,
                10056
            ],
            [
                10056,
                10137
            ],
            [
                10137,
                10149
            ],
            [
                10149,
                10149
            ],
            [
                10149,
                10175
            ],
            [
                10175,
                10237
            ],
            [
                10237,
                10251
            ],
            [
                10251,
                10283
            ],
            [
                10283,
                10310
            ],
            [
                10310,
                10418
            ],
            [
                10418,
                10564
            ],
            [
                10564,
                10715
            ],
            [
                10715,
                10773
            ],
            [
                10773,
                10864
            ],
            [
                10864,
                10864
            ],
            [
                10864,
                10945
            ],
            [
                10945,
                11032
            ],
            [
                11032,
                11094
            ],
            [
                11094,
                11125
            ],
            [
                11125,
                11125
            ],
            [
                11125,
                11125
            ],
            [
                11125,
                11187
            ],
            [
                11187,
                11262
            ],
            [
                11262,
                11298
            ],
            [
                11298,
                11326
            ],
            [
                11326,
                11360
            ],
            [
                11360,
                11423
            ],
            [
                11423,
                11459
            ],
            [
                11459,
                11510
            ],
            [
                11510,
                11598
            ],
            [
                11598,
                11666
            ],
            [
                11666,
                11713
            ],
            [
                11713,
                11720
            ],
            [
                11720,
                11772
            ],
            [
                11772,
                11829
            ],
            [
                11829,
                11888
            ],
            [
                11888,
                11971
            ],
            [
                11971,
                12141
            ],
            [
                12141,
                12448
            ],
            [
                12448,
                12657
            ],
            [
                12657,
                12657
            ],
            [
                12657,
                12657
            ],
            [
                12657,
                12711
            ],
            [
                12711,
                12806
            ],
            [
                12806,
                12806
            ],
            [
                12806,
                12854
            ],
            [
                12854,
                13009
            ],
            [
                13009,
                13114
            ],
            [
                13114,
                13114
            ],
            [
                13114,
                13201
            ],
            [
                13201,
                13305
            ],
            [
                13305,
                13359
            ],
            [
                13359,
                13390
            ],
            [
                13390,
                13475
            ],
            [
                13475,
                13536
            ],
            [
                13536,
                13679
            ],
            [
                13679,
                13724
            ],
            [
                13724,
                13832
            ],
            [
                13832,
                13880
            ],
            [
                13880,
                13948
            ],
            [
                13948,
                13948
            ],
            [
                13948,
                13948
            ],
            [
                13948,
                14158
            ],
            [
                14158,
                14270
            ],
            [
                14270,
                14311
            ],
            [
                14311,
                14339
            ],
            [
                14339,
                14429
            ],
            [
                14429,
                14617
            ],
            [
                14617,
                14779
            ],
            [
                14779,
                14806
            ],
            [
                14806,
                14834
            ],
            [
                14834,
                14862
            ],
            [
                14862,
                14933
            ],
            [
                14933,
                15071
            ],
            [
                15071,
                15157
            ],
            [
                15157,
                15157
            ],
            [
                15157,
                15217
            ],
            [
                15217,
                15349
            ],
            [
                15349,
                15382
            ],
            [
                15382,
                15441
            ],
            [
                15441,
                15526
            ],
            [
                15526,
                15582
            ],
            [
                15582,
                15663
            ],
            [
                15663,
                15700
            ],
            [
                15700,
                15745
            ],
            [
                15745,
                15774
            ],
            [
                15774,
                15889
            ],
            [
                15889,
                15977
            ],
            [
                15977,
                16028
            ],
            [
                16028,
                16073
            ],
            [
                16073,
                16221
            ],
            [
                16221,
                16221
            ],
            [
                16221,
                16320
            ],
            [
                16320,
                16374
            ],
            [
                16374,
                16421
            ],
            [
                16421,
                16483
            ],
            [
                16483,
                16544
            ],
            [
                16544,
                16603
            ],
            [
                16603,
                16613
            ],
            [
                16613,
                16650
            ],
            [
                16650,
                16742
            ],
            [
                16742,
                16800
            ],
            [
                16800,
                16852
            ],
            [
                16852,
                16945
            ],
            [
                16945,
                16999
            ],
            [
                16999,
                17096
            ],
            [
                17096,
                17272
            ],
            [
                17272,
                17331
            ],
            [
                17331,
                17400
            ],
            [
                17400,
                17436
            ],
            [
                17436,
                17574
            ],
            [
                17574,
                17646
            ],
            [
                17646,
                17646
            ],
            [
                17646,
                17741
            ],
            [
                17741,
                17765
            ],
            [
                17765,
                17885
            ],
            [
                17885,
                17931
            ],
            [
                17931,
                17972
            ],
            [
                17972,
                18198
            ],
            [
                18198,
                18240
            ]
        ]
    }
}