{
    "original": {
        "text": "No penitence and no confessional, No priest ordains it, yet they're forced to sit Amid deep ashes of their vanished years.\nImagine a rambling, patchy house, the best part built of gray stone, and red-tiled, a round tower jutting at one of the corners, the mellow darkness of its conical roof surmounted by a weather-cock making an agreeable object either amidst the gleams and greenth of summer or the low-hanging clouds and snowy branches of winter: the ground shady with spreading trees: a great tree flourishing on one side, backward some Scotch firs on a broken bank where the roots hung naked, and beyond, a rookery: on the other side a pool overhung with bushes, where the water-fowl fluttered and screamed: all around, a vast meadow which might be called a park, bordered by an old plantation and guarded by stone lodges which looked like little prisons. Outside the gate the country, once entirely rural and lovely, now black with coal mines, was chiefly peopled by men and brethren with candles stuck in their hats, and with a diabolic complexion which laid them peculiarly open to suspicion in the eyes of the children at Gadsmere--Mrs. Glasher's four beautiful children, who had dwelt there for about three years. Now, in November, when the flower-beds were empty, the trees leafless, and the pool blackly shivering, one might have said that the place was sombrely in keeping with the black roads and black mounds which seemed to put the district in mourning;--except when the children were playing on the gravel with the dogs for their companions. But Mrs. Glasher, under her present circumstances, liked Gadsmere as well as she would have liked any other abode. The complete seclusion of the place, which the unattractiveness of the country secured, was exactly to her taste. When she drove her two ponies with a waggonet full of children, there were no gentry in carriages to be met, only men of business in gigs; at church there were no eyes she cared to avoid, for the curate's wife and the curate himself were either ignorant of anything to her disadvantage, or ignored it: to them she was simply a widow lady, the tenant of Gadsmere; and the name of Grandcourt was of little interest in that district compared with the names of Fletcher and Gawcome, the lessees of the collieries.\nIt was full ten years since the elopement of an Irish officer's beautiful wife with young Grandcourt, and a consequent duel where the bullets wounded the air only, had made some little noise. Most of those who remembered the affair now wondered what had become of that Mrs. Glasher, whose beauty and brilliancy had made her rather conspicuous to them in foreign places, where she was known to be living with young Grandcourt.\nThat he should have disentangled himself from that connection seemed only natural and desirable. As to her, it was thought that a woman who was understood to have forsaken her child along with her husband had probably sunk lower. Grandcourt had of course got weary of her. He was much given to the pursuit of women: but a man in his position would by this time desire to make a suitable marriage with the fair young daughter of a noble house. No one talked of Mrs. Glasher now, any more than they talked of the victim in a trial for manslaughter ten years before: she was a lost vessel after whom nobody would send out an expedition of search; but Grandcourt was seen in harbor with his colors flying, registered as seaworthy as ever.\nYet, in fact, Grandcourt had never disentangled himself from Mrs. Glasher. His passion for her had been the strongest and most lasting he had ever known; and though it was now as dead as the music of a cracked flute, it had left a certain dull disposedness, which, on the death of her husband three years before, had prompted in him a vacillating notion of marrying her, in accordance with the understanding often expressed between them during the days of his first ardor. At that early time Grandcourt would willingly have paid for the freedom to be won by a divorce; but the husband would not oblige him, not wanting to be married again himself, and not wishing to have his domestic habits printed in evidence.\nThe altered poise which the years had brought in Mrs. Glasher was just the reverse. At first she was comparatively careless about the possibility of marriage. It was enough that she had escaped from a disagreeable husband and found a sort of bliss with a lover who had completely fascinated her--young, handsome, amorous, and living in the best style, with equipage and conversation of the kind to be expected in young men of fortune who have seen everything. She was an impassioned, vivacious woman, fond of adoration, exasperated by five years of marital rudeness; and the sense of release was so strong upon her that it stilled anxiety for more than she actually enjoyed. An equivocal position was of no importance to her then; she had no envy for the honors of a dull, disregarded wife: the one spot which spoiled her vision of her new pleasant world, was the sense that she left her three-year-old boy, who died two years afterward, and whose first tones saying \"mamma\" retained a difference from those of the children that came after. But now the years had brought many changes besides those in the contour of her cheek and throat; and that Grandcourt should marry her had become her dominant desire. The equivocal position which she had not minded about for herself was now telling upon her through her children, whom she loved with a devotion charged with the added passion of atonement. She had no repentance except in this direction. If Grandcourt married her, the children would be none the worse off for what had passed: they would see their mother in a dignified position, and they would be at no disadvantage with the world: her son could be made his father's heir. It was the yearning for this result which gave the supreme importance to Grandcourt's feeling for her; her love for him had long resolved itself into anxiety that he should give her the unique, permanent claim of a wife, and she expected no other happiness in marriage than the satisfaction of her maternal love and pride--including her pride for herself in the presence of her children. For the sake of that result she was prepared even with a tragic firmness to endure anything quietly in marriage; and she had acuteness enough to cherish Grandcourt's flickering purpose negatively, by not molesting him with passionate appeals and with scene-making. In her, as in every one else who wanted anything of him, his incalculable turns, and his tendency to harden under beseeching, had created a reasonable dread:--a slow discovery, of which no presentiment had been given in the bearing of a youthful lover with a fine line of face and the softest manners. But reticence had necessarily cost something to this impassioned woman, and she was the bitterer for it. There is no quailing--even that forced on the helpless and injured--which has not an ugly obverse: the withheld sting was gathering venom. She was absolutely dependent on Grandcourt; for though he had been always liberal in expenses for her, he had kept everything voluntary on his part; and with the goal of marriage before her, she would ask for nothing less. He had said that he would never settle anything except by will; and when she was thinking of alternatives for the future it often occurred to her that, even if she did not become Grandcourt's wife, he might never have a son who would have a legitimate claim on him, and the end might be that her son would be made heir to the best part of his estates. No son at that early age could promise to have more of his father's physique. But her becoming Grandcourt's wife was so far from being an extravagant notion of possibility, that even Lush had entertained it, and had said that he would as soon bet on it as on any other likelihood with regard to his familiar companion. Lush, indeed, on inferring that Grandcourt had a preconception of using his residence at Diplow in order to win Miss Arrowpoint, had thought it well to fan that project, taking it as a tacit renunciation of the marriage with Mrs. Glasher, which had long been a mark for the hovering and wheeling of Grandcourt's caprice. But both prospects had been negatived by Gwendolen's appearance on the scene; and it was natural enough for Mrs. Glasher to enter with eagerness into Lush's plan of hindering that new danger by setting up a barrier in the mind of the girl who was being sought as a bride. She entered into it with an eagerness which had passion in it as well as purpose, some of the stored-up venom delivering itself in that way.\nAfter that, she had heard from Lush of Gwendolen's departure, and the probability that all danger from her was got rid of; but there had been no letter to tell her that the danger had returned and had become a certainty. She had since then written to Grandcourt, as she did habitually, and he had been longer than usual in answering. She was inferring that he might intend coming to Gadsmere at the time when he was actually on the way; and she was not without hope--what construction of another's mind is not strong wishing equal to?--that a certain sickening from that frustrated courtship might dispose him to slip the more easily into the old track of intention.\nGrandcourt had two grave purposes in coming to Gadsmere: to convey the news of his approaching marriage in person, in order to make this first difficulty final; and to get from Lydia his mother's diamonds, which long ago he had confided to her and wished her to wear. Her person suited diamonds, and made them look as if they were worth some of the money given for them. These particular diamonds were not mountains of light--they were mere peas and haricots for the ears, neck and hair; but they were worth some thousands, and Grandcourt necessarily wished to have them for his wife. Formerly when he had asked Lydia to put them into his keeping again, simply on the ground that they would be safer and ought to be deposited at the bank, she had quietly but absolutely refused, declaring that they were quite safe; and at last had said, \"If you ever marry another woman I will give them up to her: are you going to marry another woman?\" At that time Grandcourt had no motive which urged him to persist, and he had this grace in him, that the disposition to exercise power either by cowing or disappointing others or exciting in them a rage which they dared not express--a disposition which was active in him as other propensities became languid--had always been in abeyance before Lydia. A severe interpreter might say that the mere facts of their relation to each other, the melancholy position of this woman who depended on his will, made a standing banquet for his delight in dominating. But there was something else than this in his forbearance toward her: there was the surviving though metamorphosed effect of the power she had had over him; and it was this effect, the fitful dull lapse toward solicitations that once had the zest now missing from life, which had again and again inclined him to espouse a familiar past rather than rouse himself to the expectation of novelty. But now novelty had taken hold of him and urged him to make the most of it.\nMrs. Glasher was seated in the pleasant room where she habitually passed her mornings with her children round her. It had a square projecting window and looked on broad gravel and grass, sloping toward a little brook that entered the pool. The top of a low, black cabinet, the old oak table, the chairs in tawny leather, were littered with the children's toys, books and garden garments, at which a maternal lady in pastel looked down from the walls with smiling indulgence. The children were all there. The three girls, seated round their mother near the widow, were miniature portraits of her--dark-eyed, delicate-featured brunettes with a rich bloom on their cheeks, their little nostrils and eyebrows singularly finished as if they were tiny women, the eldest being barely nine. The boy was seated on the carpet at some distance, bending his blonde head over the animals from a Noah's ark, admonishing them separately in a voice of threatening command, and occasionally licking the spotted ones to see if the colors would hold. Josephine, the eldest, was having her French lesson; and the others, with their dolls on their laps, sat demurely enough for images of the Madonna. Mrs. Glasher's toilet had been made very carefully--each day now she said to herself that Grandcourt might come in. Her head, which, spite of emaciation, had an ineffaceable beauty in the fine profile, crisp curves of hair, and clearly-marked eyebrows, rose impressively above her bronze-colored silk and velvet, and the gold necklace which Grandcourt had first clasped round her neck years ago. Not that she had any pleasure in her toilet; her chief thought of herself seen in the glass was, \"How changed!\"--but such good in life as remained to her she would keep. If her chief wish were fulfilled, she could imagine herself getting the comeliness of a matron fit for the highest rank. The little faces beside her, almost exact reductions of her own, seemed to tell of the blooming curves which had once been where now was sunken pallor. But the children kissed the pale cheeks and never found them deficient. That love was now the one end of her life.\nSuddenly Mrs. Glasher turned away her head from Josephine's book and listened. \"Hush, dear! I think some one is coming.\"\nHenleigh the boy jumped up and said, \"Mamma, is it the miller with my donkey?\"\nHe got no answer, and going up to his mamma's knee repeated his question in an insistent tone. But the door opened, and the servant announced Mr. Grandcourt. Mrs. Glasher rose in some agitation. Henleigh frowned at him in disgust at his not being the miller, and the three little girls lifted up their dark eyes to him timidly. They had none of them any particular liking for this friend of mamma's--in fact, when he had taken Mrs. Glasher's hand and then turned to put his other hand on Henleigh's head, that energetic scion began to beat the friend's arm away with his fists. The little girls submitted bashfully to be patted under the chin and kissed, but on the whole it seemed better to send them into the garden, where they were presently dancing and chatting with the dogs on the gravel.\n\"How far are you come?\" said Mrs. Glasher, as Grandcourt put away his hat and overcoat.\n\"From Diplow,\" he answered slowly, seating himself opposite her and looking at her with an unnoting gaze which she noted.\n\"You are tired, then.\"\n\"No, I rested at the Junction--a hideous hole. These railway journeys are always a confounded bore. But I had coffee and smoked.\"\nGrandcourt drew out his handkerchief, rubbed his face, and in returning the handkerchief to his pocket looked at his crossed knee and blameless boot, as if any stranger were opposite to him, instead of a woman quivering with a suspense which every word and look of his was to incline toward hope or dread. But he was really occupied with their interview and what it was likely to include. Imagine the difference in rate of emotion between this woman whom the years had worn to a more conscious dependence and sharper eagerness, and this man whom they were dulling into a more neutral obstinacy.\n\"I expected to see you--it was so long since I had heard from you. I suppose the weeks seem longer at Gadsmere than they do at Diplow,\" said Mrs. Glasher. She had a quick, incisive way of speaking that seemed to go with her features, as the tone and _timbre_ of a violin go with its form.\n\"Yes,\" drawled Grandcourt. \"But you found the money paid into the bank.\"\n\"Oh, yes,\" said Mrs. Glasher, curtly, tingling with impatience. Always before--at least she fancied so--Grandcourt had taken more notice of her and the children than he did to-day.\n\"Yes,\" he resumed, playing with his whisker, and at first not looking at her, \"the time has gone on at rather a rattling pace with me; generally it is slow enough. But there has been a good deal happening, as you know\"--here he turned his eyes upon her.\n\"What do I know?\" said she, sharply.\nHe left a pause before he said, without change of manner, \"That I was thinking of marrying. You saw Miss Harleth?\"\n\"_She_ told you that?\"\nThe pale cheeks looked even paler, perhaps from the fierce brightness in the eyes above them.\n\"No. Lush told me,\" was the slow answer. It was as if the thumb-screw and the iron boot were being placed by creeping hands within sight of the expectant victim.\n\"Good God! say at once that you are going to marry her,\" she burst out, passionately, her knees shaking and her hands tightly clasped.\n\"Of course, this kind of thing must happen some time or other, Lydia,\" said he; really, now the thumb-screw was on, not wishing to make the pain worse.\n\"You didn't always see the necessity.\"\n\"Perhaps not. I see it now.\"\nIn those few under-toned words of Grandcourt's she felt as absolute a resistance as if her thin fingers had been pushing at a fast shut iron door. She knew her helplessness, and shrank from testing it by any appeal--shrank from crying in a dead ear and clinging to dead knees, only to see the immovable face and feel the rigid limbs. She did not weep nor speak; she was too hard pressed by the sudden certainty which had as much of chill sickness in it as of thought and emotion. The defeated clutch of struggling hope gave her in these first moments a horrible sensation. At last she rose, with a spasmodic effort, and, unconscious of every thing but her wretchedness, pressed her forehead against the hard, cold glass of the window. The children, playing on the gravel, took this as a sign that she wanted them, and, running forward, stood in front of her with their sweet faces upturned expectantly. This roused her: she shook her head at them, waved them off, and overcome with this painful exertion, sank back in the nearest chair.\nGrandcourt had risen too. He was doubly annoyed--at the scene itself, and at the sense that no imperiousness of his could save him from it; but the task had to be gone through, and there was the administrative necessity of arranging things so that there should be as little annoyance as possible in the future. He was leaning against the corner of the fire-place. She looked up at him and said, bitterly,\n\"All this is of no consequence to you. I and the children are importunate creatures. You wish to get away again and be with Miss Harleth.\"\n\"Don't make the affair more disagreeable than it need be. Lydia. It is of no use to harp on things that can't be altered. Of course, its deucedly disagreeable to me to see you making yourself miserable. I've taken this journey to tell you what you must make up your mind to--you and the children will be provided for as usual--and there's an end of it.\"\nSilence. She dared not answer. This woman with the intense, eager look had had the iron of the mother's anguish in her soul, and it had made her sometimes capable of a repression harder than shrieking and struggle. But underneath the silence there was an outlash of hatred and vindictiveness: she wished that the marriage might make two others wretched, besides herself. Presently he went on,\n\"It will be better for you. You may go on living here. But I think of by-and-by settling a good sum on you and the children, and you can live where you like. There will be nothing for you to complain of then. Whatever happens, you will feel secure. Nothing could be done beforehand. Every thing has gone on in a hurry.\"\nGrandcourt ceased his slow delivery of sentences. He did not expect her to thank him, but he considered that she might reasonably be contented; if it were possible for Lydia to be contented. She showed no change, and after a minute he said,\n\"You have never had any reason to fear that I should be illiberal. I don't care a curse about the money.\"\n\"If you did care about it, I suppose you would not give it us,\" said Lydia. The sarcasm was irrepressible.\n\"That's a devilishly unfair thing to say,\" Grandcourt replied, in a lower tone; \"and I advise you not to say that sort of thing again.\"\n\"Should you punish me by leaving the children in beggary?\" In spite of herself, the one outlet of venom had brought the other.\n\"There is no question about leaving the children in beggary,\" said Grandcourt, still in his low voice. \"I advise you not to say things that you will repent of.\"\n\"I am used to repenting,\" said she, bitterly. \"Perhaps you will repent. You have already repented of loving me.\"\n\"All this will only make it uncommonly difficult for us to meet again. What friend have you besides me?\"\n\"Quite true.\"\nThe words came like a low moan. At the same moment there flashed through her the wish that after promising himself a better happiness than that he had had with her, he might feel a misery and loneliness which would drive him back to her to find some memory of a time when he was young, glad, and hopeful. But no! he would go scathless; it was she that had to suffer.\nWith this the scorching words were ended. Grandcourt had meant to stay till evening; he wished to curtail his visit, but there was no suitable train earlier than the one he had arranged to go by, and he had still to speak to Lydia on the second object of his visit, which like a second surgical operation seemed to require an interval. The hours had to go by; there was eating to be done; the children came in--all this mechanism of life had to be gone through with the dreary sense of constraint which is often felt in domestic quarrels of a commoner kind. To Lydia it was some slight relief for her stifled fury to have the children present: she felt a savage glory in their loveliness, as if it would taunt Grandcourt with his indifference to her and them--a secret darting of venom which was strongly imaginative. He acquitted himself with all the advantage of a man whose grace of bearing has long been moulded on an experience of boredom--nursed the little Antonia, who sat with her hands crossed and eyes upturned to his bald head, which struck her as worthy of observation--and propitiated Henleigh by promising him a beautiful saddle and bridle. It was only the two eldest girls who had known him as a continual presence; and the intervening years had overlaid their infantine memories with a bashfulness which Grandcourt's bearing was not likely to dissipate. He and Lydia occasionally, in the presence of the servants, made a conventional remark; otherwise they never spoke; and the stagnant thought in Grandcourt's mind all the while was of his own infatuation in having given her those diamonds, which obliged him to incur the nuisance of speaking about them. He had an ingrained care for what he held to belong to his caste, and about property he liked to be lordly; also he had a consciousness of indignity to himself in having to ask for anything in the world. But however he might assert his independence of Mrs. Glasher's past, he had made a past for himself which was a stronger yoke than any he could impose. He must ask for the diamonds which he had promised to Gwendolen.\nAt last they were alone again, with the candles above them, face to face with each other. Grandcourt looked at his watch, and then said, in an apparently indifferent drawl, \"There is one thing I had to mention, Lydia. My diamonds--you have them.\"\n\"Yes, I have them,\" she answered promptly, rising and standing with her arms thrust down and her fingers threaded, while Grandcourt sat still. She had expected the topic, and made her resolve about it. But she meant to carry out her resolve, if possible, without exasperating him. During the hours of silence she had longed to recall the words which had only widened the breach between them.\n\"They are in this house, I suppose?\"\n\"No; not in this house.\"\n\"I thought you said you kept them by you.\"\n\"When I said so it was true. They are in the bank at Dudley.\"\n\"Get them away, will you? I must make an arrangement for your delivering them to some one.\"\n\"Make no arrangement. They shall be delivered to the person you intended them for. _I_ will make the arrangement.\"\n\"What do you mean?\"\n\"What I say. I have always told you that I would give them up to your wife. I shall keep my word. She is not your wife yet.\"\n\"This is foolery,\" said Grandcourt, with undertoned disgust. It was too irritating that this indulgence of Lydia had given her a sort of mastery over him in spite of dependent condition.\nShe did not speak. He also rose now, but stood leaning against the mantle-piece with his side-face toward her.\n\"The diamonds must be delivered to me before my marriage,\" he began again.\n\"What is your wedding-day?\"\n\"The tenth. There is no time to be lost.\"\n\"And where do you go after the marriage?\"\nHe did not reply except by looking more sullen. Presently he said, \"You must appoint a day before then, to get them from the bank and meet me--or somebody else I will commission;--it's a great nuisance. Mention a day.\"\n\"No; I shall not do that. They shall be delivered to her safely. I shall keep my word.\"\n\"Do you mean to say,\" said Grandcourt, just audibly, turning to face her, \"that you will not do as I tell you?\"\n\"Yes, I mean that,\" was the answer that leaped out, while her eyes flashed close to him. The poor creature was immediately conscious that if her words had any effect on her own lot, the effect must be mischievous, and might nullify all the remaining advantage of her long patience. But the word had been spoken.\nHe was in a position the most irritating to him. He could not shake her nor touch her hostilely; and if he could, the process would not bring his mother's diamonds. He shrank from the only sort of threat that would frighten her--if she believed it. And in general, there was nothing he hated more than to be forced into anything like violence even in words: his will must impose itself without trouble. After looking at her for a moment, he turned his side-face toward her again, leaning as before, and said,\n\"Infernal idiots that women are!\"\n\"Why will you not tell me where you are going after the marriage? I could be at the wedding if I liked, and learn in that way,\" said Lydia, not shrinking from the one suicidal form of threat within her power.\n\"Of course, if you like, you can play the mad woman,\" said Grandcourt, with _sotto voce_ scorn. \"It is not to be supposed that you will wait to think what good will come of it--or what you owe to me.\"\nHe was in a state of disgust and embitterment quite new in the history of their relation to each other. It was undeniable that this woman, whose life he had allowed to send such deep suckers into his, had a terrible power of annoyance in her; and the rash hurry of his proceedings had left her opportunities open. His pride saw very ugly possibilities threatening it, and he stood for several minutes in silence reviewing the situation--considering how he could act upon her. Unlike himself she was of a direct nature, with certain simple strongly-colored tendencies, and there was one often-experienced effect which he thought he could count upon now. As Sir Hugo had said of him, Grandcourt knew how to play his cards upon occasion.\nHe did not speak again, but looked at his watch, rang the bell, and ordered the vehicle to be brought round immediately. Then he removed farther from her, walked as if in expectation of a summons, and remained silent without turning his eyes upon her.\nShe was suffering the horrible conflict of self-reproach and tenacity. She saw beforehand Grandcourt leaving her without even looking at her again--herself left behind in lonely uncertainty--hearing nothing from him--not knowing whether she had done her children harm--feeling that she had perhaps made him hate her;--all the wretchedness of a creature who had defeated her own motives. And yet she could not bear to give up a purpose which was a sweet morsel to her vindictiveness. If she had not been a mother she would willingly have sacrificed herself to her revenge--to what she felt to be the justice of hindering another from getting happiness by willingly giving her over to misery. The two dominant passions were at struggle. She must satisfy them both.\n\"Don't let us part in anger, Henleigh,\" she began, without changing her voice or attitude: \"it is a very little thing I ask. If I were refusing to give anything up that you call yours it would be different: that would be a reason for treating me as if you hated me. But I ask such a little thing. If you will tell me where you are going on the wedding-day I will take care that the diamonds shall be delivered to her without scandal. Without scandal,\" she repeated entreatingly.\n\"Such preposterous whims make a woman odious,\" said Grandcourt, not giving way in look or movement. \"What is the use of talking to mad people?\"\n\"Yes, I am foolish--loneliness has made me foolish--indulge me.\" Sobs rose as she spoke. \"If you will indulge me in this one folly I will be very meek--I will never trouble you.\" She burst into hysterical crying, and said again almost with a scream--\"I will be very meek after that.\"\nThere was a strange mixture of acting and reality in this passion. She kept hold of her purpose as a child might tighten its hand over a small stolen thing, crying and denying all the while. Even Grandcourt was wrought upon by surprise: this capricious wish, this childish violence, was as unlike Lydia's bearing as it was incongruous with her person. Both had always had a stamp of dignity on them. Yet she seemed more manageable in this state than in her former attitude of defiance. He came close up to her again, and said, in his low imperious tone, \"Be quiet, and hear what I tell you, I will never forgive you if you present yourself again and make a scene.\"\nShe pressed her handkerchief against her face, and when she could speak firmly said, in the muffled voice that follows sobbing, \"I will not--if you will let me have my way--I promise you not to thrust myself forward again. I have never broken my word to you--how many have you broken to me? When you gave me the diamonds to wear you were not thinking of having another wife. And I now give them up--I don't reproach you--I only ask you to let me give them up in my own way. Have I not borne it well? Everything is to be taken away from me, and when I ask for a straw, a chip--you deny it me.\" She had spoken rapidly, but after a little pause she said more slowly, her voice freed from its muffled tone: \"I will not bear to have it denied me.\"\nGrandcourt had a baffling sense that he had to deal with something like madness; he could only govern by giving way. The servant came to say the fly was ready. When the door was shut again Grandcourt said sullenly, \"We are going to Ryelands then.\"\n\"They shall be delivered to her there,\" said Lydia, with decision.\n\"Very well, I am going.\" He felt no inclination even to take her hand: she had annoyed him too sorely. But now that she had gained her point, she was prepared to humble herself that she might propitiate him.\n\"Forgive me; I will never vex you again,\" she said, with beseeching looks. Her inward voice said distinctly--\"It is only I who have to forgive.\" Yet she was obliged to ask forgiveness.\n\"You had better keep that promise. You have made me feel uncommonly ill with your folly,\" said Grandcourt, apparently choosing this statement as the strongest possible use of language.\n\"Poor thing!\" cried Lydia, with a faint smile;--was he aware of the minor fact that he made her feel ill this morning?\nBut with the quick transition natural to her, she was now ready to coax him if he would let her, that they might part in some degree reconciled. She ventured to lay her hand on his shoulder, and he did not move away from her: she had so far succeeded in alarming him, that he was not sorry for these proofs of returned subjection.\n\"Light a cigar,\" she said, soothingly, taking the case from his breast-pocket and opening it.\nAmidst such caressing signs of mutual fear they parted. The effect that clung and gnawed within Grandcourt was a sense of imperfect mastery.",
        "paragraph_chars": [
            [
                0,
                123
            ],
            [
                123,
                2299
            ],
            [
                2299,
                2725
            ],
            [
                2725,
                3460
            ],
            [
                3460,
                4173
            ],
            [
                4173,
                8680
            ],
            [
                8680,
                9347
            ],
            [
                9347,
                11308
            ],
            [
                11308,
                13442
            ],
            [
                13442,
                13563
            ],
            [
                13563,
                13642
            ],
            [
                13642,
                14437
            ],
            [
                14437,
                14525
            ],
            [
                14525,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14800
            ],
            [
                14800,
                15395
            ],
            [
                15395,
                15684
            ],
            [
                15684,
                15757
            ],
            [
                15757,
                15938
            ],
            [
                15938,
                16192
            ],
            [
                16192,
                16229
            ],
            [
                16229,
                16344
            ],
            [
                16344,
                16367
            ],
            [
                16367,
                16461
            ],
            [
                16461,
                16623
            ],
            [
                16623,
                16758
            ],
            [
                16758,
                16910
            ],
            [
                16910,
                16949
            ],
            [
                16949,
                16978
            ],
            [
                16978,
                18015
            ],
            [
                18015,
                18420
            ],
            [
                18420,
                18559
            ],
            [
                18559,
                18913
            ],
            [
                18913,
                19306
            ],
            [
                19306,
                19626
            ],
            [
                19626,
                19867
            ],
            [
                19867,
                19973
            ],
            [
                19973,
                20080
            ],
            [
                20080,
                20216
            ],
            [
                20216,
                20343
            ],
            [
                20343,
                20504
            ],
            [
                20504,
                20617
            ],
            [
                20617,
                20722
            ],
            [
                20722,
                20736
            ],
            [
                20736,
                21103
            ],
            [
                21103,
                23197
            ],
            [
                23197,
                23444
            ],
            [
                23444,
                23836
            ],
            [
                23836,
                23873
            ],
            [
                23873,
                23898
            ],
            [
                23898,
                23941
            ],
            [
                23941,
                24003
            ],
            [
                24003,
                24095
            ],
            [
                24095,
                24210
            ],
            [
                24210,
                24230
            ],
            [
                24230,
                24355
            ],
            [
                24355,
                24542
            ],
            [
                24542,
                24653
            ],
            [
                24653,
                24728
            ],
            [
                24728,
                24756
            ],
            [
                24756,
                24798
            ],
            [
                24798,
                24840
            ],
            [
                24840,
                25059
            ],
            [
                25059,
                25147
            ],
            [
                25147,
                25259
            ],
            [
                25259,
                25571
            ],
            [
                25571,
                26080
            ],
            [
                26080,
                26114
            ],
            [
                26114,
                26323
            ],
            [
                26323,
                26524
            ],
            [
                26524,
                27259
            ],
            [
                27259,
                27511
            ],
            [
                27511,
                28274
            ],
            [
                28274,
                28753
            ],
            [
                28753,
                28897
            ],
            [
                28897,
                29181
            ],
            [
                29181,
                29846
            ],
            [
                29846,
                30589
            ],
            [
                30589,
                30837
            ],
            [
                30837,
                30904
            ],
            [
                30904,
                31112
            ],
            [
                31112,
                31297
            ],
            [
                31297,
                31482
            ],
            [
                31482,
                31601
            ],
            [
                31601,
                31932
            ],
            [
                31932,
                32026
            ],
            [
                32026,
                32166
            ]
        ],
        "segment_chars": [
            [
                0,
                123
            ],
            [
                123,
                862
            ],
            [
                862,
                1225
            ],
            [
                1225,
                1560
            ],
            [
                1560,
                1675
            ],
            [
                1675,
                1789
            ],
            [
                1789,
                2299
            ],
            [
                2299,
                2491
            ],
            [
                2491,
                2725
            ],
            [
                2725,
                2822
            ],
            [
                2822,
                2955
            ],
            [
                2955,
                2998
            ],
            [
                2998,
                3168
            ],
            [
                3168,
                3460
            ],
            [
                3460,
                3535
            ],
            [
                3535,
                3933
            ],
            [
                3933,
                4173
            ],
            [
                4173,
                4257
            ],
            [
                4257,
                4332
            ],
            [
                4332,
                4633
            ],
            [
                4633,
                4848
            ],
            [
                4848,
                5214
            ],
            [
                5214,
                5380
            ],
            [
                5380,
                5569
            ],
            [
                5569,
                5617
            ],
            [
                5617,
                5853
            ],
            [
                5853,
                6241
            ],
            [
                6241,
                6506
            ],
            [
                6506,
                6808
            ],
            [
                6808,
                6913
            ],
            [
                6913,
                7052
            ],
            [
                7052,
                7275
            ],
            [
                7275,
                7627
            ],
            [
                7627,
                7705
            ],
            [
                7705,
                7946
            ],
            [
                7946,
                8267
            ],
            [
                8267,
                8539
            ],
            [
                8539,
                8680
            ],
            [
                8680,
                8901
            ],
            [
                8901,
                9014
            ],
            [
                9014,
                9347
            ],
            [
                9347,
                9615
            ],
            [
                9615,
                9718
            ],
            [
                9718,
                9932
            ],
            [
                9932,
                10285
            ],
            [
                10285,
                10636
            ],
            [
                10636,
                10839
            ],
            [
                10839,
                11232
            ],
            [
                11232,
                11308
            ],
            [
                11308,
                11423
            ],
            [
                11423,
                11548
            ],
            [
                11548,
                11783
            ],
            [
                11783,
                11812
            ],
            [
                11812,
                12091
            ],
            [
                12091,
                12340
            ],
            [
                12340,
                12488
            ],
            [
                12488,
                12604
            ],
            [
                12604,
                12884
            ],
            [
                12884,
                12995
            ],
            [
                12995,
                13054
            ],
            [
                13054,
                13175
            ],
            [
                13175,
                13327
            ],
            [
                13327,
                13399
            ],
            [
                13399,
                13442
            ],
            [
                13442,
                13521
            ],
            [
                13521,
                13534
            ],
            [
                13534,
                13563
            ],
            [
                13563,
                13642
            ],
            [
                13642,
                13737
            ],
            [
                13737,
                13800
            ],
            [
                13800,
                13837
            ],
            [
                13837,
                13970
            ],
            [
                13970,
                14220
            ],
            [
                14220,
                14437
            ],
            [
                14437,
                14461
            ],
            [
                14461,
                14525
            ],
            [
                14525,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14717
            ],
            [
                14717,
                14770
            ],
            [
                14770,
                14800
            ],
            [
                14800,
                15106
            ],
            [
                15106,
                15189
            ],
            [
                15189,
                15395
            ],
            [
                15395,
                15462
            ],
            [
                15462,
                15550
            ],
            [
                15550,
                15684
            ],
            [
                15684,
                15711
            ],
            [
                15711,
                15757
            ],
            [
                15757,
                15821
            ],
            [
                15821,
                15938
            ],
            [
                15938,
                16102
            ],
            [
                16102,
                16192
            ],
            [
                16192,
                16210
            ],
            [
                16210,
                16229
            ],
            [
                16229,
                16321
            ],
            [
                16321,
                16344
            ],
            [
                16344,
                16367
            ],
            [
                16367,
                16461
            ],
            [
                16461,
                16466
            ],
            [
                16466,
                16502
            ],
            [
                16502,
                16623
            ],
            [
                16623,
                16634
            ],
            [
                16634,
                16758
            ],
            [
                16758,
                16910
            ],
            [
                16910,
                16949
            ],
            [
                16949,
                16963
            ],
            [
                16963,
                16978
            ],
            [
                16978,
                17125
            ],
            [
                17125,
                17312
            ],
            [
                17312,
                17458
            ],
            [
                17458,
                17551
            ],
            [
                17551,
                17713
            ],
            [
                17713,
                17881
            ],
            [
                17881,
                18015
            ],
            [
                18015,
                18041
            ],
            [
                18041,
                18326
            ],
            [
                18326,
                18379
            ],
            [
                18379,
                18420
            ],
            [
                18420,
                18459
            ],
            [
                18459,
                18505
            ],
            [
                18505,
                18559
            ],
            [
                18559,
                18617
            ],
            [
                18617,
                18624
            ],
            [
                18624,
                18681
            ],
            [
                18681,
                18762
            ],
            [
                18762,
                18913
            ],
            [
                18913,
                18922
            ],
            [
                18922,
                18944
            ],
            [
                18944,
                19128
            ],
            [
                19128,
                19284
            ],
            [
                19284,
                19306
            ],
            [
                19306,
                19334
            ],
            [
                19334,
                19361
            ],
            [
                19361,
                19464
            ],
            [
                19464,
                19515
            ],
            [
                19515,
                19555
            ],
            [
                19555,
                19589
            ],
            [
                19589,
                19626
            ],
            [
                19626,
                19676
            ],
            [
                19676,
                19817
            ],
            [
                19817,
                19867
            ],
            [
                19867,
                19934
            ],
            [
                19934,
                19973
            ],
            [
                19973,
                20049
            ],
            [
                20049,
                20080
            ],
            [
                20080,
                20216
            ],
            [
                20216,
                20275
            ],
            [
                20275,
                20343
            ],
            [
                20343,
                20446
            ],
            [
                20446,
                20504
            ],
            [
                20504,
                20550
            ],
            [
                20550,
                20576
            ],
            [
                20576,
                20617
            ],
            [
                20617,
                20688
            ],
            [
                20688,
                20722
            ],
            [
                20722,
                20736
            ],
            [
                20736,
                20768
            ],
            [
                20768,
                21041
            ],
            [
                21041,
                21049
            ],
            [
                21049,
                21103
            ],
            [
                21103,
                21145
            ],
            [
                21145,
                21439
            ],
            [
                21439,
                21661
            ],
            [
                21661,
                21921
            ],
            [
                21921,
                22258
            ],
            [
                22258,
                22473
            ],
            [
                22473,
                22776
            ],
            [
                22776,
                22980
            ],
            [
                22980,
                23132
            ],
            [
                23132,
                23197
            ],
            [
                23197,
                23287
            ],
            [
                23287,
                23415
            ],
            [
                23415,
                23444
            ],
            [
                23444,
                23587
            ],
            [
                23587,
                23646
            ],
            [
                23646,
                23725
            ],
            [
                23725,
                23836
            ],
            [
                23836,
                23873
            ],
            [
                23873,
                23898
            ],
            [
                23898,
                23941
            ],
            [
                23941,
                23970
            ],
            [
                23970,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24095
            ],
            [
                24095,
                24117
            ],
            [
                24117,
                24178
            ],
            [
                24178,
                24210
            ],
            [
                24210,
                24230
            ],
            [
                24230,
                24243
            ],
            [
                24243,
                24306
            ],
            [
                24306,
                24328
            ],
            [
                24328,
                24355
            ],
            [
                24355,
                24416
            ],
            [
                24416,
                24542
            ],
            [
                24542,
                24561
            ],
            [
                24561,
                24653
            ],
            [
                24653,
                24728
            ],
            [
                24728,
                24756
            ],
            [
                24756,
                24768
            ],
            [
                24768,
                24798
            ],
            [
                24798,
                24840
            ],
            [
                24840,
                24888
            ],
            [
                24888,
                25043
            ],
            [
                25043,
                25059
            ],
            [
                25059,
                25085
            ],
            [
                25085,
                25124
            ],
            [
                25124,
                25147
            ],
            [
                25147,
                25259
            ],
            [
                25259,
                25348
            ],
            [
                25348,
                25541
            ],
            [
                25541,
                25571
            ],
            [
                25571,
                25620
            ],
            [
                25620,
                25736
            ],
            [
                25736,
                25820
            ],
            [
                25820,
                25974
            ],
            [
                25974,
                26080
            ],
            [
                26080,
                26114
            ],
            [
                26114,
                26180
            ],
            [
                26180,
                26323
            ],
            [
                26323,
                26419
            ],
            [
                26419,
                26524
            ],
            [
                26524,
                26628
            ],
            [
                26628,
                26838
            ],
            [
                26838,
                27000
            ],
            [
                27000,
                27177
            ],
            [
                27177,
                27259
            ],
            [
                27259,
                27380
            ],
            [
                27380,
                27511
            ],
            [
                27511,
                27582
            ],
            [
                27582,
                27898
            ],
            [
                27898,
                27994
            ],
            [
                27994,
                28202
            ],
            [
                28202,
                28246
            ],
            [
                28246,
                28274
            ],
            [
                28274,
                28399
            ],
            [
                28399,
                28540
            ],
            [
                28540,
                28571
            ],
            [
                28571,
                28708
            ],
            [
                28708,
                28753
            ],
            [
                28753,
                28853
            ],
            [
                28853,
                28897
            ],
            [
                28897,
                28962
            ],
            [
                28962,
                28986
            ],
            [
                28986,
                29076
            ],
            [
                29076,
                29181
            ],
            [
                29181,
                29248
            ],
            [
                29248,
                29372
            ],
            [
                29372,
                29533
            ],
            [
                29533,
                29581
            ],
            [
                29581,
                29667
            ],
            [
                29667,
                29846
            ],
            [
                29846,
                30069
            ],
            [
                30069,
                30137
            ],
            [
                30137,
                30221
            ],
            [
                30221,
                30320
            ],
            [
                30320,
                30346
            ],
            [
                30346,
                30439
            ],
            [
                30439,
                30589
            ],
            [
                30589,
                30706
            ],
            [
                30706,
                30749
            ],
            [
                30749,
                30837
            ],
            [
                30837,
                30904
            ],
            [
                30904,
                30929
            ],
            [
                30929,
                31007
            ],
            [
                31007,
                31112
            ],
            [
                31112,
                31187
            ],
            [
                31187,
                31257
            ],
            [
                31257,
                31297
            ],
            [
                31297,
                31332
            ],
            [
                31332,
                31482
            ],
            [
                31482,
                31496
            ],
            [
                31496,
                31601
            ],
            [
                31601,
                31746
            ],
            [
                31746,
                31932
            ],
            [
                31932,
                32026
            ],
            [
                32026,
                32082
            ],
            [
                32082,
                32166
            ]
        ],
        "overlap_chars": [
            [
                123,
                141
            ],
            [
                150,
                156
            ],
            [
                171,
                179
            ],
            [
                185,
                190
            ],
            [
                192,
                231
            ],
            [
                275,
                278
            ],
            [
                488,
                527
            ],
            [
                468,
                472
            ],
            [
                611,
                620
            ],
            [
                622,
                732
            ],
            [
                764,
                799
            ],
            [
                860,
                862
            ],
            [
                862,
                977
            ],
            [
                991,
                1024
            ],
            [
                1116,
                1140
            ],
            [
                1142,
                1205
            ],
            [
                1212,
                1224
            ],
            [
                1225,
                1251
            ],
            [
                1280,
                1285
            ],
            [
                1264,
                1268
            ],
            [
                1286,
                1294
            ],
            [
                1296,
                1327
            ],
            [
                1353,
                1469
            ],
            [
                1558,
                1560
            ],
            [
                1560,
                1576
            ],
            [
                1611,
                1675
            ],
            [
                1679,
                1697
            ],
            [
                1763,
                1766
            ],
            [
                1775,
                1789
            ],
            [
                1789,
                1960
            ],
            [
                1967,
                1980
            ],
            [
                2055,
                2057
            ],
            [
                1981,
                1991
            ],
            [
                2099,
                2121
            ],
            [
                2126,
                2150
            ],
            [
                2297,
                2299
            ],
            [
                2299,
                2461
            ],
            [
                2489,
                2491
            ],
            [
                2491,
                2562
            ],
            [
                2595,
                2598
            ],
            [
                2573,
                2580
            ],
            [
                2675,
                2678
            ],
            [
                2610,
                2613
            ],
            [
                2642,
                2644
            ],
            [
                2702,
                2723
            ],
            [
                2723,
                2725
            ],
            [
                2725,
                2770
            ],
            [
                2787,
                2793
            ],
            [
                2799,
                2822
            ],
            [
                2822,
                2864
            ],
            [
                2888,
                2953
            ],
            [
                2953,
                2955
            ],
            [
                2955,
                2998
            ],
            [
                2998,
                3072
            ],
            [
                3081,
                3120
            ],
            [
                3166,
                3168
            ],
            [
                3168,
                3201
            ],
            [
                3287,
                3343
            ],
            [
                3246,
                3247
            ],
            [
                3361,
                3367
            ],
            [
                3347,
                3357
            ],
            [
                3367,
                3395
            ],
            [
                3403,
                3411
            ],
            [
                3419,
                3426
            ],
            [
                3438,
                3460
            ],
            [
                3460,
                3535
            ],
            [
                3535,
                3776
            ],
            [
                3789,
                3792
            ],
            [
                3817,
                3830
            ],
            [
                3786,
                3788
            ],
            [
                3904,
                3929
            ],
            [
                3931,
                3933
            ],
            [
                3933,
                3951
            ],
            [
                4033,
                4065
            ],
            [
                4015,
                4017
            ],
            [
                4171,
                4173
            ],
            [
                4219,
                4221
            ],
            [
                4222,
                4234
            ],
            [
                4235,
                4238
            ],
            [
                4257,
                4265
            ],
            [
                4288,
                4332
            ],
            [
                4332,
                4404
            ],
            [
                4415,
                4467
            ],
            [
                4469,
                4523
            ],
            [
                4631,
                4633
            ],
            [
                4633,
                4738
            ],
            [
                4846,
                4848
            ],
            [
                4964,
                4971
            ],
            [
                4991,
                5036
            ],
            [
                5043,
                5213
            ],
            [
                5214,
                5221
            ],
            [
                5274,
                5277
            ],
            [
                5249,
                5256
            ],
            [
                5286,
                5288
            ],
            [
                5222,
                5231
            ],
            [
                5372,
                5378
            ],
            [
                5315,
                5358
            ],
            [
                5363,
                5371
            ],
            [
                5378,
                5380
            ],
            [
                5446,
                5449
            ],
            [
                5479,
                5569
            ],
            [
                5569,
                5617
            ],
            [
                5617,
                5716
            ],
            [
                5774,
                5810
            ],
            [
                5812,
                5819
            ],
            [
                5829,
                5853
            ],
            [
                5956,
                5968
            ],
            [
                5926,
                5936
            ],
            [
                5973,
                6025
            ],
            [
                6031,
                6034
            ],
            [
                6072,
                6077
            ],
            [
                5947,
                5954
            ],
            [
                6231,
                6239
            ],
            [
                5936,
                5938
            ],
            [
                6078,
                6081
            ],
            [
                5856,
                5859
            ],
            [
                5923,
                5925
            ],
            [
                6110,
                6121
            ],
            [
                6239,
                6241
            ],
            [
                6269,
                6276
            ],
            [
                6376,
                6425
            ],
            [
                6438,
                6486
            ],
            [
                6492,
                6506
            ],
            [
                6563,
                6643
            ],
            [
                6657,
                6662
            ],
            [
                6506,
                6512
            ],
            [
                6806,
                6808
            ],
            [
                6808,
                6811
            ],
            [
                6812,
                6821
            ],
            [
                7010,
                7051
            ],
            [
                7052,
                7094
            ],
            [
                7273,
                7275
            ],
            [
                7381,
                7384
            ],
            [
                7567,
                7570
            ],
            [
                7539,
                7540
            ],
            [
                7275,
                7342
            ],
            [
                7396,
                7494
            ],
            [
                7516,
                7526
            ],
            [
                7495,
                7498
            ],
            [
                7545,
                7552
            ],
            [
                7553,
                7558
            ],
            [
                7581,
                7596
            ],
            [
                7614,
                7627
            ],
            [
                7627,
                7633
            ],
            [
                7652,
                7704
            ],
            [
                7705,
                7761
            ],
            [
                7798,
                7818
            ],
            [
                7862,
                7864
            ],
            [
                7919,
                7921
            ],
            [
                7880,
                7882
            ],
            [
                7944,
                7946
            ],
            [
                7950,
                7951
            ],
            [
                8079,
                8086
            ],
            [
                7973,
                7992
            ],
            [
                8009,
                8011
            ],
            [
                8051,
                8074
            ],
            [
                8075,
                8078
            ],
            [
                8102,
                8114
            ],
            [
                8265,
                8267
            ],
            [
                8267,
                8294
            ],
            [
                8305,
                8348
            ],
            [
                8375,
                8387
            ],
            [
                8397,
                8484
            ],
            [
                8489,
                8493
            ],
            [
                8537,
                8538
            ],
            [
                8680,
                8745
            ],
            [
                8762,
                8766
            ],
            [
                8746,
                8749
            ],
            [
                8771,
                8777
            ],
            [
                8787,
                8790
            ],
            [
                8801,
                8901
            ],
            [
                8901,
                9014
            ],
            [
                9014,
                9017
            ],
            [
                9032,
                9062
            ],
            [
                9117,
                9124
            ],
            [
                9216,
                9222
            ],
            [
                9251,
                9318
            ],
            [
                9323,
                9332
            ],
            [
                9345,
                9347
            ],
            [
                9347,
                9365
            ],
            [
                9372,
                9460
            ],
            [
                9506,
                9574
            ],
            [
                9584,
                9590
            ],
            [
                9613,
                9615
            ],
            [
                9718,
                9771
            ],
            [
                9773,
                9885
            ],
            [
                9898,
                9932
            ],
            [
                9932,
                10046
            ],
            [
                10084,
                10166
            ],
            [
                10175,
                10244
            ],
            [
                10285,
                10385
            ],
            [
                10505,
                10508
            ],
            [
                10402,
                10413
            ],
            [
                10414,
                10419
            ],
            [
                10430,
                10453
            ],
            [
                10556,
                10558
            ],
            [
                10454,
                10460
            ],
            [
                10634,
                10636
            ],
            [
                10636,
                10839
            ],
            [
                10839,
                10862
            ],
            [
                10907,
                10922
            ],
            [
                10961,
                10977
            ],
            [
                11068,
                11072
            ],
            [
                10982,
                10994
            ],
            [
                11107,
                11114
            ],
            [
                11135,
                11232
            ],
            [
                11232,
                11269
            ],
            [
                11306,
                11308
            ],
            [
                11308,
                11411
            ],
            [
                11421,
                11423
            ],
            [
                11538,
                11541
            ],
            [
                11450,
                11456
            ],
            [
                11461,
                11467
            ],
            [
                11468,
                11493
            ],
            [
                11581,
                11598
            ],
            [
                11634,
                11667
            ],
            [
                11457,
                11460
            ],
            [
                11669,
                11674
            ],
            [
                11781,
                11783
            ],
            [
                11812,
                11854
            ],
            [
                11869,
                11902
            ],
            [
                11904,
                11942
            ],
            [
                12059,
                12091
            ],
            [
                12091,
                12123
            ],
            [
                12140,
                12218
            ],
            [
                12230,
                12289
            ],
            [
                12307,
                12320
            ],
            [
                12328,
                12339
            ],
            [
                12488,
                12500
            ],
            [
                12510,
                12513
            ],
            [
                12529,
                12538
            ],
            [
                12540,
                12599
            ],
            [
                12602,
                12604
            ],
            [
                12604,
                12619
            ],
            [
                12630,
                12634
            ],
            [
                12640,
                12668
            ],
            [
                12739,
                12776
            ],
            [
                12784,
                12884
            ],
            [
                12884,
                12920
            ],
            [
                12927,
                12946
            ],
            [
                12963,
                12995
            ],
            [
                13327,
                13399
            ],
            [
                13399,
                13442
            ],
            [
                13442,
                13470
            ],
            [
                13476,
                13484
            ],
            [
                13507,
                13521
            ],
            [
                13521,
                13534
            ],
            [
                13534,
                13563
            ],
            [
                13563,
                13642
            ],
            [
                13642,
                13714
            ],
            [
                13735,
                13737
            ],
            [
                13737,
                13799
            ],
            [
                13800,
                13837
            ],
            [
                13837,
                13970
            ],
            [
                13970,
                14040
            ],
            [
                14042,
                14058
            ],
            [
                14108,
                14115
            ],
            [
                14122,
                14146
            ],
            [
                14168,
                14185
            ],
            [
                14195,
                14220
            ],
            [
                14220,
                14284
            ],
            [
                14295,
                14437
            ],
            [
                14437,
                14445
            ],
            [
                14450,
                14461
            ],
            [
                14461,
                14478
            ],
            [
                14523,
                14525
            ],
            [
                14525,
                14588
            ],
            [
                14636,
                14645
            ],
            [
                14616,
                14618
            ],
            [
                14625,
                14629
            ],
            [
                14645,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14699
            ],
            [
                14701,
                14717
            ],
            [
                14717,
                14768
            ],
            [
                14800,
                14810
            ],
            [
                14838,
                14858
            ],
            [
                14903,
                14955
            ],
            [
                15025,
                15026
            ],
            [
                14960,
                14968
            ],
            [
                14974,
                14982
            ],
            [
                14986,
                15024
            ],
            [
                15027,
                15035
            ],
            [
                15104,
                15106
            ],
            [
                15189,
                15214
            ],
            [
                15223,
                15276
            ],
            [
                15309,
                15368
            ],
            [
                15384,
                15395
            ],
            [
                15395,
                15417
            ],
            [
                15419,
                15460
            ],
            [
                15528,
                15550
            ],
            [
                15550,
                15591
            ],
            [
                15682,
                15684
            ],
            [
                15684,
                15711
            ],
            [
                15711,
                15757
            ],
            [
                15757,
                15821
            ],
            [
                15821,
                15834
            ],
            [
                15861,
                15938
            ],
            [
                15938,
                15981
            ],
            [
                16014,
                16063
            ],
            [
                16100,
                16102
            ],
            [
                16102,
                16155
            ],
            [
                16158,
                16192
            ],
            [
                16192,
                16210
            ],
            [
                16210,
                16229
            ],
            [
                16229,
                16321
            ],
            [
                16321,
                16344
            ],
            [
                16344,
                16345
            ],
            [
                16346,
                16349
            ],
            [
                16351,
                16366
            ],
            [
                16367,
                16400
            ],
            [
                16459,
                16461
            ],
            [
                16461,
                16466
            ],
            [
                16466,
                16502
            ],
            [
                16502,
                16530
            ],
            [
                16554,
                16623
            ],
            [
                16623,
                16634
            ],
            [
                16634,
                16693
            ],
            [
                16695,
                16708
            ],
            [
                16731,
                16758
            ],
            [
                16758,
                16769
            ],
            [
                16789,
                16910
            ],
            [
                16910,
                16949
            ],
            [
                16949,
                16963
            ],
            [
                16963,
                16978
            ],
            [
                16978,
                16990
            ],
            [
                17003,
                17008
            ],
            [
                17025,
                17101
            ],
            [
                17114,
                17125
            ],
            [
                17125,
                17192
            ],
            [
                17194,
                17312
            ],
            [
                17312,
                17338
            ],
            [
                17456,
                17458
            ],
            [
                17551,
                17613
            ],
            [
                17626,
                17713
            ],
            [
                17713,
                17881
            ],
            [
                17881,
                17954
            ],
            [
                17981,
                18015
            ],
            [
                18015,
                18041
            ],
            [
                18041,
                18062
            ],
            [
                18064,
                18190
            ],
            [
                18324,
                18326
            ],
            [
                18379,
                18408
            ],
            [
                18410,
                18418
            ],
            [
                18420,
                18421
            ],
            [
                18465,
                18477
            ],
            [
                18461,
                18464
            ],
            [
                18459,
                18460
            ],
            [
                18478,
                18481
            ],
            [
                18433,
                18458
            ],
            [
                18505,
                18559
            ],
            [
                18559,
                18615
            ],
            [
                18615,
                18617
            ],
            [
                18696,
                18762
            ],
            [
                18803,
                18816
            ],
            [
                18820,
                18829
            ],
            [
                18817,
                18819
            ],
            [
                18786,
                18788
            ],
            [
                18834,
                18884
            ],
            [
                18886,
                18913
            ],
            [
                18922,
                18944
            ],
            [
                18944,
                18948
            ],
            [
                18964,
                18971
            ],
            [
                18949,
                18954
            ],
            [
                18988,
                19003
            ],
            [
                19008,
                19057
            ],
            [
                19068,
                19128
            ],
            [
                19128,
                19164
            ],
            [
                19190,
                19194
            ],
            [
                19179,
                19185
            ],
            [
                19204,
                19245
            ],
            [
                19257,
                19265
            ],
            [
                19282,
                19284
            ],
            [
                19294,
                19304
            ],
            [
                19334,
                19361
            ],
            [
                19361,
                19464
            ],
            [
                19490,
                19493
            ],
            [
                19470,
                19474
            ],
            [
                19478,
                19485
            ],
            [
                19494,
                19508
            ],
            [
                19513,
                19515
            ],
            [
                19934,
                19973
            ],
            [
                19973,
                20048
            ],
            [
                20080,
                20216
            ],
            [
                20216,
                20275
            ],
            [
                20275,
                20294
            ],
            [
                20341,
                20343
            ],
            [
                20343,
                20446
            ],
            [
                20446,
                20447
            ],
            [
                20460,
                20463
            ],
            [
                20467,
                20504
            ],
            [
                20504,
                20550
            ],
            [
                20550,
                20576
            ],
            [
                20576,
                20617
            ],
            [
                20617,
                20688
            ],
            [
                20688,
                20722
            ],
            [
                20722,
                20736
            ],
            [
                20736,
                20768
            ],
            [
                20801,
                20812
            ],
            [
                20793,
                20800
            ],
            [
                20813,
                20826
            ],
            [
                20901,
                20972
            ],
            [
                21039,
                21041
            ],
            [
                21041,
                21049
            ],
            [
                21049,
                21060
            ],
            [
                21070,
                21103
            ],
            [
                21103,
                21145
            ],
            [
                21145,
                21155
            ],
            [
                21310,
                21315
            ],
            [
                21156,
                21159
            ],
            [
                21316,
                21368
            ],
            [
                21375,
                21407
            ],
            [
                21408,
                21439
            ],
            [
                21439,
                21512
            ],
            [
                21514,
                21579
            ],
            [
                21589,
                21640
            ],
            [
                21659,
                21661
            ],
            [
                21751,
                21773
            ],
            [
                21700,
                21703
            ],
            [
                21729,
                21737
            ],
            [
                21780,
                21845
            ],
            [
                21919,
                21920
            ],
            [
                21921,
                21946
            ],
            [
                21980,
                21985
            ],
            [
                22016,
                22018
            ],
            [
                22055,
                22091
            ],
            [
                22110,
                22140
            ],
            [
                22185,
                22258
            ],
            [
                22258,
                22378
            ],
            [
                22389,
                22402
            ],
            [
                22405,
                22416
            ],
            [
                22471,
                22472
            ],
            [
                22473,
                22596
            ],
            [
                22606,
                22776
            ],
            [
                22776,
                22778
            ],
            [
                22946,
                22965
            ],
            [
                22882,
                22883
            ],
            [
                22980,
                22983
            ],
            [
                23132,
                23197
            ],
            [
                23197,
                23226
            ],
            [
                23285,
                23287
            ],
            [
                23287,
                23322
            ],
            [
                23328,
                23415
            ],
            [
                23415,
                23426
            ],
            [
                23428,
                23444
            ],
            [
                23444,
                23515
            ],
            [
                23541,
                23557
            ],
            [
                23585,
                23587
            ],
            [
                23587,
                23635
            ],
            [
                23646,
                23668
            ],
            [
                23642,
                23644
            ],
            [
                23669,
                23672
            ],
            [
                23684,
                23724
            ],
            [
                23836,
                23873
            ],
            [
                23873,
                23877
            ],
            [
                23970,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24095
            ],
            [
                24095,
                24117
            ],
            [
                24117,
                24176
            ],
            [
                24210,
                24230
            ],
            [
                24230,
                24243
            ],
            [
                24243,
                24306
            ],
            [
                24306,
                24328
            ],
            [
                24328,
                24355
            ],
            [
                24355,
                24416
            ],
            [
                24416,
                24442
            ],
            [
                24462,
                24471
            ],
            [
                24484,
                24520
            ],
            [
                24478,
                24481
            ],
            [
                24540,
                24541
            ],
            [
                24653,
                24709
            ],
            [
                24728,
                24756
            ],
            [
                24756,
                24768
            ],
            [
                24768,
                24798
            ],
            [
                24798,
                24840
            ],
            [
                24840,
                24888
            ],
            [
                24888,
                24916
            ],
            [
                24947,
                24969
            ],
            [
                24931,
                24942
            ],
            [
                24970,
                24981
            ],
            [
                25017,
                25018
            ],
            [
                25020,
                25041
            ],
            [
                25059,
                25085
            ],
            [
                25085,
                25124
            ],
            [
                25124,
                25147
            ],
            [
                25147,
                25259
            ],
            [
                25259,
                25276
            ],
            [
                25348,
                25396
            ],
            [
                25441,
                25451
            ],
            [
                25519,
                25525
            ],
            [
                25404,
                25409
            ],
            [
                25425,
                25435
            ],
            [
                25452,
                25471
            ],
            [
                25539,
                25541
            ],
            [
                25541,
                25548
            ],
            [
                25554,
                25571
            ],
            [
                25571,
                25577
            ],
            [
                25683,
                25684
            ],
            [
                25736,
                25798
            ],
            [
                25800,
                25820
            ],
            [
                25820,
                25823
            ],
            [
                25836,
                25974
            ],
            [
                25974,
                25979
            ],
            [
                25999,
                26011
            ],
            [
                26074,
                26078
            ],
            [
                26027,
                26028
            ],
            [
                26080,
                26114
            ],
            [
                26114,
                26180
            ],
            [
                26180,
                26253
            ],
            [
                26273,
                26323
            ],
            [
                26323,
                26398
            ],
            [
                26400,
                26410
            ],
            [
                26412,
                26419
            ],
            [
                26524,
                26582
            ],
            [
                26598,
                26603
            ],
            [
                26626,
                26628
            ],
            [
                26651,
                26661
            ],
            [
                26725,
                26758
            ],
            [
                26765,
                26813
            ],
            [
                26818,
                26838
            ],
            [
                26896,
                26959
            ],
            [
                26973,
                27000
            ],
            [
                27000,
                27014
            ],
            [
                27041,
                27042
            ],
            [
                27015,
                27041
            ],
            [
                27090,
                27176
            ],
            [
                27259,
                27366
            ],
            [
                27378,
                27380
            ],
            [
                27380,
                27387
            ],
            [
                27414,
                27420
            ],
            [
                27476,
                27511
            ],
            [
                27511,
                27582
            ],
            [
                27582,
                27585
            ],
            [
                27601,
                27657
            ],
            [
                27667,
                27700
            ],
            [
                27710,
                27717
            ],
            [
                27728,
                27778
            ],
            [
                27788,
                27826
            ],
            [
                27872,
                27898
            ],
            [
                27898,
                27937
            ],
            [
                27958,
                27963
            ],
            [
                27992,
                27993
            ],
            [
                28274,
                28323
            ],
            [
                28363,
                28399
            ],
            [
                28571,
                28577
            ],
            [
                28583,
                28708
            ],
            [
                28708,
                28753
            ],
            [
                28753,
                28853
            ],
            [
                28853,
                28897
            ],
            [
                28897,
                28915
            ],
            [
                28928,
                28947
            ],
            [
                28957,
                28962
            ],
            [
                28962,
                28986
            ],
            [
                28986,
                29034
            ],
            [
                29056,
                29076
            ],
            [
                29076,
                29118
            ],
            [
                29125,
                29145
            ],
            [
                29147,
                29167
            ],
            [
                29178,
                29181
            ],
            [
                29181,
                29248
            ],
            [
                29248,
                29372
            ],
            [
                29372,
                29391
            ],
            [
                29416,
                29422
            ],
            [
                29445,
                29453
            ],
            [
                29423,
                29426
            ],
            [
                29464,
                29467
            ],
            [
                29471,
                29477
            ],
            [
                29478,
                29483
            ],
            [
                29579,
                29581
            ],
            [
                29667,
                29690
            ],
            [
                29696,
                29744
            ],
            [
                29772,
                29820
            ],
            [
                29827,
                29846
            ],
            [
                29846,
                29896
            ],
            [
                29925,
                29933
            ],
            [
                29938,
                29951
            ],
            [
                29972,
                29975
            ],
            [
                29987,
                29993
            ],
            [
                29999,
                30017
            ],
            [
                30019,
                30028
            ],
            [
                30033,
                30069
            ],
            [
                30069,
                30103
            ],
            [
                30105,
                30137
            ],
            [
                30245,
                30265
            ],
            [
                30267,
                30296
            ],
            [
                30241,
                30243
            ],
            [
                30305,
                30320
            ],
            [
                30320,
                30346
            ],
            [
                30346,
                30413
            ],
            [
                30422,
                30436
            ],
            [
                30550,
                30589
            ],
            [
                30589,
                30706
            ],
            [
                30789,
                30829
            ],
            [
                30834,
                30837
            ],
            [
                30837,
                30887
            ],
            [
                30902,
                30903
            ],
            [
                31011,
                31080
            ],
            [
                31110,
                31111
            ],
            [
                31112,
                31162
            ],
            [
                31169,
                31174
            ],
            [
                31185,
                31186
            ],
            [
                31297,
                31332
            ],
            [
                31332,
                31482
            ],
            [
                31482,
                31496
            ],
            [
                31496,
                31527
            ],
            [
                31647,
                31697
            ],
            [
                31698,
                31746
            ],
            [
                31746,
                31816
            ],
            [
                31827,
                31932
            ],
            [
                31932,
                32009
            ],
            [
                32024,
                32026
            ],
            [
                32026,
                32082
            ],
            [
                32082,
                32147
            ],
            [
                32148,
                32166
            ]
        ],
        "row_chars": [
            [
                0,
                123
            ],
            [
                123,
                862
            ],
            [
                862,
                1225
            ],
            [
                1225,
                1560
            ],
            [
                1560,
                1675
            ],
            [
                1675,
                1789
            ],
            [
                1789,
                2299
            ],
            [
                2299,
                2491
            ],
            [
                2491,
                2725
            ],
            [
                2725,
                2822
            ],
            [
                2822,
                2955
            ],
            [
                2955,
                2998
            ],
            [
                2998,
                3168
            ],
            [
                3168,
                3460
            ],
            [
                3460,
                3535
            ],
            [
                3535,
                3933
            ],
            [
                3933,
                4173
            ],
            [
                4173,
                4332
            ],
            [
                4332,
                4633
            ],
            [
                4633,
                4848
            ],
            [
                4848,
                5214
            ],
            [
                5214,
                5380
            ],
            [
                5380,
                5569
            ],
            [
                5569,
                5617
            ],
            [
                5617,
                5853
            ],
            [
                5853,
                6241
            ],
            [
                6241,
                6506
            ],
            [
                6506,
                6808
            ],
            [
                6808,
                7052
            ],
            [
                7052,
                7275
            ],
            [
                7275,
                7627
            ],
            [
                7627,
                7705
            ],
            [
                7705,
                7946
            ],
            [
                7946,
                8267
            ],
            [
                8267,
                8539
            ],
            [
                8539,
                8680
            ],
            [
                8680,
                8901
            ],
            [
                8901,
                9014
            ],
            [
                9014,
                9347
            ],
            [
                9347,
                9615
            ],
            [
                9615,
                9718
            ],
            [
                9718,
                9932
            ],
            [
                9932,
                10285
            ],
            [
                10285,
                10636
            ],
            [
                10636,
                10839
            ],
            [
                10839,
                11232
            ],
            [
                11232,
                11308
            ],
            [
                11308,
                11423
            ],
            [
                11423,
                11783
            ],
            [
                11783,
                11812
            ],
            [
                11812,
                12091
            ],
            [
                12091,
                12340
            ],
            [
                12340,
                12488
            ],
            [
                12488,
                12604
            ],
            [
                12604,
                12884
            ],
            [
                12884,
                12995
            ],
            [
                12995,
                13054
            ],
            [
                13054,
                13175
            ],
            [
                13175,
                13327
            ],
            [
                13327,
                13399
            ],
            [
                13399,
                13442
            ],
            [
                13442,
                13521
            ],
            [
                13521,
                13534
            ],
            [
                13534,
                13563
            ],
            [
                13563,
                13642
            ],
            [
                13642,
                13737
            ],
            [
                13737,
                13800
            ],
            [
                13800,
                13837
            ],
            [
                13837,
                13970
            ],
            [
                13970,
                14220
            ],
            [
                14220,
                14437
            ],
            [
                14437,
                14461
            ],
            [
                14461,
                14525
            ],
            [
                14525,
                14647
            ],
            [
                14647,
                14670
            ],
            [
                14670,
                14717
            ],
            [
                14717,
                14770
            ],
            [
                14770,
                14800
            ],
            [
                14800,
                15106
            ],
            [
                15106,
                15189
            ],
            [
                15189,
                15395
            ],
            [
                15395,
                15550
            ],
            [
                15550,
                15684
            ],
            [
                15684,
                15711
            ],
            [
                15711,
                15757
            ],
            [
                15757,
                15821
            ],
            [
                15821,
                15938
            ],
            [
                15938,
                16102
            ],
            [
                16102,
                16192
            ],
            [
                16192,
                16210
            ],
            [
                16210,
                16229
            ],
            [
                16229,
                16321
            ],
            [
                16321,
                16344
            ],
            [
                16344,
                16367
            ],
            [
                16367,
                16461
            ],
            [
                16461,
                16466
            ],
            [
                16466,
                16502
            ],
            [
                16502,
                16623
            ],
            [
                16623,
                16634
            ],
            [
                16634,
                16758
            ],
            [
                16758,
                16910
            ],
            [
                16910,
                16949
            ],
            [
                16949,
                16963
            ],
            [
                16963,
                16978
            ],
            [
                16978,
                17125
            ],
            [
                17125,
                17312
            ],
            [
                17312,
                17458
            ],
            [
                17458,
                17551
            ],
            [
                17551,
                17713
            ],
            [
                17713,
                17881
            ],
            [
                17881,
                18015
            ],
            [
                18015,
                18041
            ],
            [
                18041,
                18326
            ],
            [
                18326,
                18379
            ],
            [
                18379,
                18420
            ],
            [
                18420,
                18505
            ],
            [
                18505,
                18559
            ],
            [
                18559,
                18617
            ],
            [
                18617,
                18624
            ],
            [
                18624,
                18681
            ],
            [
                18681,
                18762
            ],
            [
                18762,
                18913
            ],
            [
                18913,
                18922
            ],
            [
                18922,
                18944
            ],
            [
                18944,
                19128
            ],
            [
                19128,
                19284
            ],
            [
                19284,
                19306
            ],
            [
                19306,
                19334
            ],
            [
                19334,
                19361
            ],
            [
                19361,
                19464
            ],
            [
                19464,
                19515
            ],
            [
                19515,
                19555
            ],
            [
                19555,
                19589
            ],
            [
                19589,
                19626
            ],
            [
                19626,
                19676
            ],
            [
                19676,
                19817
            ],
            [
                19817,
                19867
            ],
            [
                19867,
                19934
            ],
            [
                19934,
                19973
            ],
            [
                19973,
                20049
            ],
            [
                20049,
                20080
            ],
            [
                20080,
                20216
            ],
            [
                20216,
                20275
            ],
            [
                20275,
                20343
            ],
            [
                20343,
                20446
            ],
            [
                20446,
                20504
            ],
            [
                20504,
                20550
            ],
            [
                20550,
                20576
            ],
            [
                20576,
                20617
            ],
            [
                20617,
                20688
            ],
            [
                20688,
                20722
            ],
            [
                20722,
                20736
            ],
            [
                20736,
                20768
            ],
            [
                20768,
                21041
            ],
            [
                21041,
                21049
            ],
            [
                21049,
                21103
            ],
            [
                21103,
                21145
            ],
            [
                21145,
                21439
            ],
            [
                21439,
                21661
            ],
            [
                21661,
                21921
            ],
            [
                21921,
                22258
            ],
            [
                22258,
                22473
            ],
            [
                22473,
                22776
            ],
            [
                22776,
                23197
            ],
            [
                23197,
                23287
            ],
            [
                23287,
                23415
            ],
            [
                23415,
                23444
            ],
            [
                23444,
                23587
            ],
            [
                23587,
                23725
            ],
            [
                23725,
                23836
            ],
            [
                23836,
                23873
            ],
            [
                23873,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24095
            ],
            [
                24095,
                24117
            ],
            [
                24117,
                24178
            ],
            [
                24178,
                24210
            ],
            [
                24210,
                24230
            ],
            [
                24230,
                24243
            ],
            [
                24243,
                24306
            ],
            [
                24306,
                24328
            ],
            [
                24328,
                24355
            ],
            [
                24355,
                24416
            ],
            [
                24416,
                24542
            ],
            [
                24542,
                24561
            ],
            [
                24561,
                24653
            ],
            [
                24653,
                24728
            ],
            [
                24728,
                24756
            ],
            [
                24756,
                24768
            ],
            [
                24768,
                24798
            ],
            [
                24798,
                24840
            ],
            [
                24840,
                24888
            ],
            [
                24888,
                25043
            ],
            [
                25043,
                25059
            ],
            [
                25059,
                25085
            ],
            [
                25085,
                25124
            ],
            [
                25124,
                25147
            ],
            [
                25147,
                25259
            ],
            [
                25259,
                25348
            ],
            [
                25348,
                25541
            ],
            [
                25541,
                25571
            ],
            [
                25571,
                25820
            ],
            [
                25820,
                25974
            ],
            [
                25974,
                26080
            ],
            [
                26080,
                26114
            ],
            [
                26114,
                26180
            ],
            [
                26180,
                26323
            ],
            [
                26323,
                26419
            ],
            [
                26419,
                26524
            ],
            [
                26524,
                26628
            ],
            [
                26628,
                26838
            ],
            [
                26838,
                27000
            ],
            [
                27000,
                27177
            ],
            [
                27177,
                27259
            ],
            [
                27259,
                27380
            ],
            [
                27380,
                27511
            ],
            [
                27511,
                27582
            ],
            [
                27582,
                27898
            ],
            [
                27898,
                27994
            ],
            [
                27994,
                28202
            ],
            [
                28202,
                28246
            ],
            [
                28246,
                28274
            ],
            [
                28274,
                28399
            ],
            [
                28399,
                28540
            ],
            [
                28540,
                28571
            ],
            [
                28571,
                28708
            ],
            [
                28708,
                28753
            ],
            [
                28753,
                28853
            ],
            [
                28853,
                28897
            ],
            [
                28897,
                28962
            ],
            [
                28962,
                28986
            ],
            [
                28986,
                29076
            ],
            [
                29076,
                29181
            ],
            [
                29181,
                29248
            ],
            [
                29248,
                29372
            ],
            [
                29372,
                29581
            ],
            [
                29581,
                29667
            ],
            [
                29667,
                29846
            ],
            [
                29846,
                30069
            ],
            [
                30069,
                30137
            ],
            [
                30137,
                30221
            ],
            [
                30221,
                30320
            ],
            [
                30320,
                30346
            ],
            [
                30346,
                30439
            ],
            [
                30439,
                30589
            ],
            [
                30589,
                30706
            ],
            [
                30706,
                30749
            ],
            [
                30749,
                30837
            ],
            [
                30837,
                30904
            ],
            [
                30904,
                30929
            ],
            [
                30929,
                31007
            ],
            [
                31007,
                31112
            ],
            [
                31112,
                31187
            ],
            [
                31187,
                31257
            ],
            [
                31257,
                31297
            ],
            [
                31297,
                31332
            ],
            [
                31332,
                31482
            ],
            [
                31482,
                31496
            ],
            [
                31496,
                31601
            ],
            [
                31601,
                31746
            ],
            [
                31746,
                31932
            ],
            [
                31932,
                32026
            ],
            [
                32026,
                32082
            ],
            [
                32082,
                32166
            ]
        ]
    },
    "abridged": {
        "text": "Imagine a rambling house, built of grey stone and red-tiled, a round tower jutting at its corner: a great tree flourishing on one side, with a rookery behind it; on the other side a pool overhung with bushes, where the water-fowl fluttered and screamed: all around, a vast park, bordered by an old plantation. Outside the gate the country, once entirely rural and lovely, now black with coal mines, was chiefly peopled by men with candles stuck in their hats, whose dark faces frightened the children at Gadsmere - Mrs. Glasher's four beautiful children, who had dwelt there for three years.\nNow, in November, when the trees were leafless and the pool blackly shivering, the place was sombrely in keeping with the black roads and black mounds which seemed to put the district in mourning. But Mrs. Glasher liked Gadsmere as well as she would have liked any other abode. Its complete seclusion was to her taste. When she drove her two ponies with a waggonet full of children, there were no gentry in carriages to be met, only men of business in gigs; at church there were no eyes she needed to avoid, for to the curate she was simply a widow, the tenant of Gadsmere.\nIt was full ten years since the elopement of an Irish officer's beautiful wife with young Grandcourt, and a consequent duel where the bullets wounded the air only. Most of those who remembered the affair now wondered what had become of the beautiful and brilliant Lydia Glasher after she had gone to live with young Grandcourt abroad.\nThat he should have disentangled himself from her seemed natural and desirable. As to her, it was thought that a woman who had forsaken her child along with her husband had probably sunk lower still. Grandcourt had of course got weary of her. He was much given to the pursuit of women: but a man in his position would in time desire to make a suitable marriage. No one talked of Mrs. Glasher now: she was a lost vessel after whom nobody would send out a search expedition; but Grandcourt was seen in harbour with his colours flying, as seaworthy as ever.\nYet, in fact, Grandcourt had never disentangled himself from Mrs. Glasher. His passion for her had been the strongest and most lasting he had ever known; and though it was now as dead as the music of a cracked flute, it had left a certain dull disposedness, which, on the death of her husband three years before, had made him consider marrying her, as he had wished to in the days of his first ardour. At that early time the husband would not oblige him by divorcing Mrs Glasher.\nIn contrast, Mrs. Glasher herself was at first careless about the possibility of marriage. It was enough that she had escaped from a disagreeable husband and found bliss with a lover who had completely fascinated her - young, handsome, amorous, and living in the best style. She was an impassioned, vivacious woman, fond of adoration, exasperated by five years of marital rudeness as a disregarded wife. The one blot on her vision of her new pleasant world, was the knowledge that she left her three-year-old boy, who died two years afterward, and whose first tones saying \"mamma\" retained a difference from those of the children that came after.\nBut now, over the changes of the years, the desire that Grandcourt should marry her had become dominant. This was on behalf of her children, whom she loved with a devotion charged with the added passion of atonement. She had no repentance except in this direction. If Grandcourt married her, the children would be none the worse off for what had passed: they would be at no disadvantage with the world if her son was made his father's heir. Her love for Grandcourt had long resolved itself into anxiety that he should marry her, and for her children's sake she was prepared to endure anything quietly in marriage. She was acute enough to cherish Grandcourt's flickering purpose by not molesting him with passionate appeals and scene-making. His incalculable turns, and his tendency to harden under beseeching, had created dread in her. But her reticence made her bitter: the withheld sting was gathering venom.\nShe was absolutely dependent on Grandcourt. Though he had always been liberal in expenses for her, he had said that he would never settle anything except by will; and it often occurred to her that, even if she did not become Grandcourt's wife, he might never have a legitimate son; so in the end her boy might be made heir to his estates. No son could promise to have more of his father's physique.\nBut her becoming Grandcourt's wife was so far from being impossible, that even Lush had thought Grandcourt was as likely to marry Mrs. Glasher as anyone else. Indeed, when Lush thought that Grandcourt had an idea of attempting to win Miss Arrowpoint, he had supported that project instead. But both prospects had been eclipsed by Gwendolen's appearance on the scene; and Mrs. Glasher entered with eagerness into Lush's plan of hindering that new danger by setting up a barrier in Gwendolen's mind.\nAfter that, she had heard from Lush of Gwendolen's departure, and that the danger was gone; but there had been no letter to tell her that the danger had returned and had become a certainty. She had since then written to Grandcourt, as she did habitually, and he had been longer than usual in answering. She thought that he might intend coming to see her, and she hoped that a frustrated courtship might dispose him to slip the more easily into his old track.\nGrandcourt had two purposes in coming to Gadsmere: to convey the news of his approaching marriage in person; and to get from Lydia his mother's diamonds, which long ago he had handed to her. These particular diamonds were not mountains of light - they were mere peas and haricots for the ears, neck and hair; but they were worth some thousands, and Grandcourt wished to have them for his wife. Formerly when he had asked Lydia to put them into his keeping again, simply on the ground that they would be safer, she had quietly but absolutely refused, declaring that they were quite safe; and had said, \"If you ever marry another woman I will give them up to her.\"\nAt that time Grandcourt had no motive which urged him to persist, and he had this grace in him, that he did not like to exercise his power of cowing or disappointing her as he did with others. A severe interpreter might say that the mere facts of their relation to each other, the melancholy position of this woman who depended on his will, made a standing banquet for his delight in dominating. But there was something more: there was the memory of the power she once had over him, which inclined him to espouse a familiar past rather than rouse himself to the expectation of novelty. But now novelty had taken hold of him.\nMrs. Glasher was seated in the pleasant room where she habitually passed her mornings with her children. The window looked out on broad gravel and grass; the old oak table was littered with the children's toys and books. The three girls, seated round their mother, were miniature portraits of her - dark-eyed, delicate-featured brunettes, the eldest being barely nine. The boy was seated on the carpet, bending his blonde head over the animals from a Noah's ark, admonishing them in a voice of threatening command, and occasionally licking them to see if the colours would hold.\nMrs. Glasher had dressed carefully, for each day now she said to herself that Grandcourt might come. Her head, which though emaciated, had an ineffaceable beauty, rose impressively above her bronze-coloured silk and velvet, and the gold necklace which Grandcourt had first clasped round her neck years ago. Not that she had any pleasure in her looks; her chief thought when she looked in the glass was, \"How changed!\" But the children kissed the pale cheeks and never found them deficient. That love was now the one end of her life.\nSuddenly Mrs. Glasher turned her head and listened. \"Hush, dear! I think some one is coming.\"\nHenleigh the boy jumped up and said, \"Mamma, is it the miller with my donkey?\"\nHe got no answer, and going up to his mamma's knee repeated his question insistently. But the door opened, and the servant announced Mr. Grandcourt.\nMrs. Glasher rose in some agitation. Henleigh frowned at him in disgust at his not being the miller, and the three little girls lifted up their dark eyes to him timidly. They had none of them any particular liking for this friend of mamma's - in fact, when he put his hand on Henleigh's head, the boy began to beat the arm away with his fists. The little girls submitted bashfully to be patted under the chin, but on the whole it seemed better to send them into the garden, where they were presently dancing and chatting with the dogs on the gravel.\n\"How far have you come?\" said Mrs. Glasher.\n\"From Diplow,\" he answered slowly, seating himself opposite her. She noted his unseeing gaze.\n\"You are tired, then.\"\n\"No, I rested at the Junction - a hideous hole. These railway journeys are always a confounded bore.\"\nGrandcourt rubbed his face, and looked at his crossed knee and blameless boot, as if a stranger sat opposite him, instead of a woman quivering with suspense. Imagine the difference in emotion between this woman whom the years had worn to sharper eagerness, and this man whom they were dulling into obstinacy.\n\"I expected to see you - it was so long since I had heard from you,\" said Mrs. Glasher. She had a quick, incisive way of speaking.\n\"Yes,\" drawled Grandcourt. \"But you found the money paid into the bank.\"\n\"Oh, yes,\" said Mrs. Glasher, curtly, tingling with impatience. Always before, Grandcourt had taken more notice of her and the children than he did to-day.\n\"Yes,\" he resumed, playing with his whisker, \"the time has gone on at rather a rattling pace. But there has been a good deal happening, as you know.\" Here he turned his eyes upon her.\n\"What do I know?\" said she, sharply.\nHe left a pause before he said, without change of manner, \"That I was thinking of marrying. You saw Miss Harleth?\"\n\"She told you that?\" The pale cheeks looked even paler.\n\"No. Lush told me,\" was the slow answer. It was as if the thumb-screw was being placed by creeping hands within sight of the expectant victim.\n\"Good God! say at once that you are going to marry her,\" she burst out passionately, her hands tightly clasped.\n\"Of course, it must happen some time or other, Lydia,\" said he; really, now the thumb-screw was on, not wishing to make the pain worse.\n\"You didn't always see the necessity.\"\n\"Perhaps not. I see it now.\"\nIn those few words she felt as absolute a resistance as if her thin fingers had been pushing at an iron door. She knew her helplessness, and shrank from testing it by any appeal - shrank from crying in a dead ear and clinging to dead knees, only to see the immovable face and feel the rigid limbs. She did not weep nor speak. At last she rose, with a spasmodic effort, and, unconscious of everything but her wretchedness, pressed her forehead against the hard, cold glass of the window. The children, playing on the gravel, took this as a sign that she wanted them, and, running forward, stood in front of her with their sweet faces upturned expectantly. This roused her: she shook her head at them, waved them off, and overcome, sank back in the nearest chair.\nGrandcourt had risen too. He was doubly annoyed - at the scene itself, and at the sense that no imperiousness of his could save him from it; but the task had to be gone through. She looked up at him and said bitterly-\n\"The children and I are of no consequence to you. You wish to get away again and be with Miss Harleth.\"\n\"Don't make the affair more disagreeable than it need be, Lydia. It's deucedly disagreeable to me to see you making yourself miserable. You must make your mind up to it - you and the children will be provided for as usual - and there's an end of it.\"\nShe dared not answer. This intense woman had the iron of a mother's anguish in her soul, and it had made her capable of a repression harder than shrieking and struggle. But underneath the silence there was vindictive hatred: she wished that the marriage might make them wretched. He went on-\n\"You may go on living here. But I think of by-and-by settling a good sum on you and the children, and you can live where you like. You will have nothing to complain of. I don't care a curse about the money.\"\n\"If you did care about it, I suppose you would not give it us,\" said Lydia.\n\"That's a devilishly unfair thing to say,\" Grandcourt replied, in a lower tone; \"and I advise you not to say that sort of thing again.\"\n\"Should you punish me by leaving the children in beggary?\" she said in spite of herself.\n\"There is no question about leaving the children in beggary,\" said Grandcourt, still in his low voice. \"Do not say things that you will repent of.\"\n\"I am used to repenting,\" said she, bitterly. \"Perhaps you will repent. You have already repented of loving me.\"\n\"All this will only make it uncommonly difficult for us to meet again. What friend have you besides me?\"\n\"Quite true.\"\nThe words came like a low moan. Through her mind flashed the wish that he might feel a misery and loneliness which would drive him back to her. But no! he would go unscathed; it was she that had to suffer.\nWith this the scorching words were ended. Although Grandcourt still had to speak to Lydia on the second object of his visit, like a second surgical operation it seemed to require an interval. The hours had to go by; there was eating to be done; the children came in - all this mechanism of life had to be gone through with the dreary constraint which is often felt in domestic quarrels. Lydia felt a savage glory in her children's loveliness, as if it would taunt Grandcourt with his indifference.\nHe acquitted himself with bored grace - nursed the little Antonia, who sat with her eyes upturned to his bald head - and propitiated Henleigh by promising him a beautiful saddle and bridle. It was only the two eldest girls who had known him as a continual presence; and the intervening years had overlaid their memories with bashfulness.\nHe and Lydia occasionally, in the presence of the servants, made a conventional remark; otherwise they never spoke; and the thought in Grandcourt's mind all the while was of his own infatuation in having given her those diamonds, which obliged him to incur the nuisance of speaking about them. He did not like to ask for anything; but he must ask for the diamonds which he had promised to Gwendolen.\nAt last they were alone again. Grandcourt looked at his watch, and said, in an apparently indifferent drawl, \"There is one thing I had to mention, Lydia. My diamonds - you have them.\"\n\"Yes, I have them,\" she answered promptly, rising and standing with her fingers threaded. She had expected the topic, and made her resolve; but she meant to carry it out, if possible, without exasperating him.\n\"They are in this house, I suppose?\"\n\"No; they are in the bank at Dudley.\"\n\"Get them away, will you? I must make an arrangement for your delivering them to some one.\"\n\"Make no arrangement. They shall be delivered to the person you intended them for.\"\n\"What do you mean?\"\n\"What I say. I have always told you that I would give them up to your wife. I shall keep my word. She is not your wife yet.\"\n\"This is foolery,\" said Grandcourt, with undertoned disgust. It was too irritating that Lydia had any sort of mastery over him in spite of her dependence. \"The diamonds must be delivered to me before my marriage.\"\n\"What is your wedding-day?\"\n\"The tenth. There is no time to be lost.\"\n\"And where do you go after the marriage?\"\nHe did not reply except by looking more sullen. Presently he said, \"You must get them from the bank before then and meet me; it's a great nuisance.\"\n\"No; I shall not do that. They shall be delivered to her safely. I shall keep my word.\"\n\"Do you mean to say,\" said Grandcourt, just audibly, turning to face her, \"that you will not do as I tell you?\"\n\"Yes, I mean that.\" The poor creature was immediately conscious that the effect of her words on her own position must be mischievous. But the words had been spoken.\nHe was highly irritated, but he shrank from the only sort of threat that would frighten her - if she believed it. And there was nothing he hated more than to be forced into anything like violence even in words: his will must impose itself without trouble. After a moment, he said-\n\"Infernal idiots that women are!\"\n\"Why will you not tell me where you are going after the marriage? I could be at the wedding if I liked, and learn in that way,\" said Lydia, using the one suicidal form of threat within her power.\n\"Of course, if you like, you can play the mad woman,\" said Grandcourt, with sotto voce scorn. He was in a state of disgust and embitterment quite new in their relationship. This woman had a terrible power of annoyance; and the rash hurry of his proceedings had left opportunities open. He stood for several minutes in silence reviewing the situation - considering how he could act upon her. Unlike himself, she was of a direct nature, and there was one often-experienced effect which he thought he could count upon now.\nHe did not speak again, but looked at his watch, rang the bell, and ordered the vehicle to be brought round. Then he walked away silently without turning his eyes upon her.\nShe was suffering the horrible conflict of self-reproach and tenacity. She imagined Grandcourt leaving her without even looking at her again - herself left behind in lonely uncertainty - hearing nothing - not knowing whether she had done her children harm - feeling that she had perhaps made him hate her, and defeated her own motives. And yet she could not bear to give up a sweet revenge.\n\"Don't let us part in anger, Henleigh,\" she began: \"it is a very little thing I ask. If you tell me where you are going on the wedding-day I will take care that the diamonds shall be delivered to her without scandal. Without scandal,\" she repeated entreatingly.\n\"Such preposterous whims make a woman odious,\" said Grandcourt, not giving way in look or movement. \"What is the use of talking to mad people?\"\n\"Yes, I am foolish - loneliness has made me foolish - indulge me.\" Sobs rose as she spoke. \"If you will indulge me in this one folly I will never trouble you.\" She burst into hysterical crying, and said almost with a scream- \"I will be very meek.\"\nThere was a strange mixture of acting and reality in this passion. She kept hold of her purpose as a child might tighten its hand over a small stolen thing, crying and denying all the while. Even Grandcourt was surprised: this childish caprice was unlike the normally dignified Lydia. He came close up to her, and said, in his low imperious tone, \"Be quiet. I will never forgive you if you present yourself and make a scene.\"\nShe pressed her handkerchief against her face, and said, in a muffled voice, \"If you let me have my way, I promise not to thrust myself forward again. I have never broken my word to you - how many have you broken to me? I don't reproach you - I only ask you to let me give up the diamonds in my own way. Have I not borne it well? Everything is to be taken away from me, and when I ask for a straw, you deny it me. I will not bear to have it denied me.\"\nGrandcourt had a baffling sense that he had to deal with something like madness; he could only govern by giving way. He said sullenly, \"We are going to Ryelands.\"\n\"They shall be delivered to her there,\" said Lydia. Now that she had gained her point, she was prepared to humble herself. \"Forgive me; I will never vex you again,\" she said beseechingly.\n\"You had better keep that promise. You have made me feel uncommonly ill with your folly,\" said Grandcourt, apparently choosing this statement as the strongest possible use of language.\n\"Poor thing!\" cried Lydia, with a faint smile. She was now ready to coax him if he would let her, so that they might part in some degree reconciled. She ventured to lay her hand on his shoulder, and he did not move away. She had so far succeeded in alarming him, that he was not sorry for these proofs of returned subjection.\n\"Light a cigar,\" she said, soothingly, taking the case from his breast-pocket.\nAmidst such caressing signs of mutual fear they parted. The effect that clung and gnawed within Grandcourt was a sense of his imperfect mastery.",
        "paragraph_chars": [
            [
                0,
                592
            ],
            [
                592,
                1166
            ],
            [
                1166,
                1501
            ],
            [
                1501,
                2056
            ],
            [
                2056,
                2536
            ],
            [
                2536,
                3183
            ],
            [
                3183,
                4094
            ],
            [
                4094,
                4493
            ],
            [
                4493,
                4991
            ],
            [
                4991,
                5450
            ],
            [
                5450,
                6113
            ],
            [
                6113,
                6738
            ],
            [
                6738,
                7317
            ],
            [
                7317,
                7850
            ],
            [
                7850,
                7944
            ],
            [
                7944,
                8023
            ],
            [
                8023,
                8172
            ],
            [
                8172,
                8722
            ],
            [
                8722,
                8766
            ],
            [
                8766,
                8860
            ],
            [
                8860,
                8883
            ],
            [
                8883,
                8985
            ],
            [
                8985,
                9294
            ],
            [
                9294,
                9425
            ],
            [
                9425,
                9498
            ],
            [
                9498,
                9654
            ],
            [
                9654,
                9838
            ],
            [
                9838,
                9875
            ],
            [
                9875,
                9990
            ],
            [
                9990,
                10046
            ],
            [
                10046,
                10189
            ],
            [
                10189,
                10301
            ],
            [
                10301,
                10437
            ],
            [
                10437,
                10476
            ],
            [
                10476,
                10505
            ],
            [
                10505,
                11267
            ],
            [
                11267,
                11485
            ],
            [
                11485,
                11589
            ],
            [
                11589,
                11840
            ],
            [
                11840,
                12132
            ],
            [
                12132,
                12340
            ],
            [
                12340,
                12416
            ],
            [
                12416,
                12552
            ],
            [
                12552,
                12641
            ],
            [
                12641,
                12789
            ],
            [
                12789,
                12902
            ],
            [
                12902,
                13007
            ],
            [
                13007,
                13021
            ],
            [
                13021,
                13227
            ],
            [
                13227,
                13725
            ],
            [
                13725,
                14063
            ],
            [
                14063,
                14463
            ],
            [
                14463,
                14647
            ],
            [
                14647,
                14857
            ],
            [
                14857,
                14894
            ],
            [
                14894,
                14932
            ],
            [
                14932,
                15024
            ],
            [
                15024,
                15108
            ],
            [
                15108,
                15128
            ],
            [
                15128,
                15253
            ],
            [
                15253,
                15467
            ],
            [
                15467,
                15495
            ],
            [
                15495,
                15537
            ],
            [
                15537,
                15579
            ],
            [
                15579,
                15728
            ],
            [
                15728,
                15816
            ],
            [
                15816,
                15928
            ],
            [
                15928,
                16093
            ],
            [
                16093,
                16374
            ],
            [
                16374,
                16408
            ],
            [
                16408,
                16604
            ],
            [
                16604,
                17124
            ],
            [
                17124,
                17297
            ],
            [
                17297,
                17688
            ],
            [
                17688,
                17950
            ],
            [
                17950,
                18094
            ],
            [
                18094,
                18342
            ],
            [
                18342,
                18768
            ],
            [
                18768,
                19221
            ],
            [
                19221,
                19384
            ],
            [
                19384,
                19572
            ],
            [
                19572,
                19757
            ],
            [
                19757,
                20083
            ],
            [
                20083,
                20162
            ],
            [
                20162,
                20306
            ]
        ],
        "segment_chars": [
            [
                0,
                310
            ],
            [
                310,
                592
            ],
            [
                592,
                789
            ],
            [
                789,
                870
            ],
            [
                870,
                911
            ],
            [
                911,
                1166
            ],
            [
                1166,
                1330
            ],
            [
                1330,
                1501
            ],
            [
                1501,
                1581
            ],
            [
                1581,
                1701
            ],
            [
                1701,
                1744
            ],
            [
                1744,
                1863
            ],
            [
                1863,
                2056
            ],
            [
                2056,
                2131
            ],
            [
                2131,
                2458
            ],
            [
                2458,
                2536
            ],
            [
                2536,
                2627
            ],
            [
                2627,
                2811
            ],
            [
                2811,
                2940
            ],
            [
                2940,
                3183
            ],
            [
                3183,
                3288
            ],
            [
                3288,
                3400
            ],
            [
                3400,
                3448
            ],
            [
                3448,
                3624
            ],
            [
                3624,
                3797
            ],
            [
                3797,
                3924
            ],
            [
                3924,
                4019
            ],
            [
                4019,
                4094
            ],
            [
                4094,
                4138
            ],
            [
                4138,
                4433
            ],
            [
                4433,
                4493
            ],
            [
                4493,
                4652
            ],
            [
                4652,
                4783
            ],
            [
                4783,
                4991
            ],
            [
                4991,
                5181
            ],
            [
                5181,
                5294
            ],
            [
                5294,
                5450
            ],
            [
                5450,
                5641
            ],
            [
                5641,
                5844
            ],
            [
                5844,
                6113
            ],
            [
                6113,
                6306
            ],
            [
                6306,
                6509
            ],
            [
                6509,
                6699
            ],
            [
                6699,
                6738
            ],
            [
                6738,
                6843
            ],
            [
                6843,
                6959
            ],
            [
                6959,
                7107
            ],
            [
                7107,
                7317
            ],
            [
                7317,
                7418
            ],
            [
                7418,
                7624
            ],
            [
                7624,
                7735
            ],
            [
                7735,
                7807
            ],
            [
                7807,
                7850
            ],
            [
                7850,
                7902
            ],
            [
                7902,
                7915
            ],
            [
                7915,
                7944
            ],
            [
                7944,
                8023
            ],
            [
                8023,
                8109
            ],
            [
                8109,
                8172
            ],
            [
                8172,
                8209
            ],
            [
                8209,
                8342
            ],
            [
                8342,
                8516
            ],
            [
                8516,
                8722
            ],
            [
                8722,
                8747
            ],
            [
                8747,
                8766
            ],
            [
                8766,
                8831
            ],
            [
                8831,
                8860
            ],
            [
                8860,
                8883
            ],
            [
                8883,
                8931
            ],
            [
                8931,
                8985
            ],
            [
                8985,
                9143
            ],
            [
                9143,
                9294
            ],
            [
                9294,
                9382
            ],
            [
                9382,
                9425
            ],
            [
                9425,
                9452
            ],
            [
                9452,
                9498
            ],
            [
                9498,
                9562
            ],
            [
                9562,
                9654
            ],
            [
                9654,
                9748
            ],
            [
                9748,
                9804
            ],
            [
                9804,
                9838
            ],
            [
                9838,
                9856
            ],
            [
                9856,
                9875
            ],
            [
                9875,
                9967
            ],
            [
                9967,
                9990
            ],
            [
                9990,
                10011
            ],
            [
                10011,
                10046
            ],
            [
                10046,
                10051
            ],
            [
                10051,
                10087
            ],
            [
                10087,
                10189
            ],
            [
                10189,
                10200
            ],
            [
                10200,
                10301
            ],
            [
                10301,
                10437
            ],
            [
                10437,
                10476
            ],
            [
                10476,
                10490
            ],
            [
                10490,
                10505
            ],
            [
                10505,
                10615
            ],
            [
                10615,
                10803
            ],
            [
                10803,
                10831
            ],
            [
                10831,
                10992
            ],
            [
                10992,
                11160
            ],
            [
                11160,
                11267
            ],
            [
                11267,
                11293
            ],
            [
                11293,
                11445
            ],
            [
                11445,
                11485
            ],
            [
                11485,
                11535
            ],
            [
                11535,
                11589
            ],
            [
                11589,
                11654
            ],
            [
                11654,
                11725
            ],
            [
                11725,
                11840
            ],
            [
                11840,
                11862
            ],
            [
                11862,
                12009
            ],
            [
                12009,
                12120
            ],
            [
                12120,
                12132
            ],
            [
                12132,
                12160
            ],
            [
                12160,
                12263
            ],
            [
                12263,
                12301
            ],
            [
                12301,
                12340
            ],
            [
                12340,
                12416
            ],
            [
                12416,
                12552
            ],
            [
                12552,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                12744
            ],
            [
                12744,
                12789
            ],
            [
                12789,
                12835
            ],
            [
                12835,
                12861
            ],
            [
                12861,
                12902
            ],
            [
                12902,
                12973
            ],
            [
                12973,
                13007
            ],
            [
                13007,
                13021
            ],
            [
                13021,
                13053
            ],
            [
                13053,
                13165
            ],
            [
                13165,
                13173
            ],
            [
                13173,
                13227
            ],
            [
                13227,
                13269
            ],
            [
                13269,
                13419
            ],
            [
                13419,
                13614
            ],
            [
                13614,
                13725
            ],
            [
                13725,
                13915
            ],
            [
                13915,
                14063
            ],
            [
                14063,
                14357
            ],
            [
                14357,
                14463
            ],
            [
                14463,
                14494
            ],
            [
                14494,
                14617
            ],
            [
                14617,
                14647
            ],
            [
                14647,
                14737
            ],
            [
                14737,
                14857
            ],
            [
                14857,
                14894
            ],
            [
                14894,
                14932
            ],
            [
                14932,
                14958
            ],
            [
                14958,
                15024
            ],
            [
                15024,
                15046
            ],
            [
                15046,
                15108
            ],
            [
                15108,
                15128
            ],
            [
                15128,
                15141
            ],
            [
                15141,
                15204
            ],
            [
                15204,
                15226
            ],
            [
                15226,
                15253
            ],
            [
                15253,
                15314
            ],
            [
                15314,
                15408
            ],
            [
                15408,
                15467
            ],
            [
                15467,
                15495
            ],
            [
                15495,
                15507
            ],
            [
                15507,
                15537
            ],
            [
                15537,
                15579
            ],
            [
                15579,
                15627
            ],
            [
                15627,
                15728
            ],
            [
                15728,
                15754
            ],
            [
                15754,
                15793
            ],
            [
                15793,
                15816
            ],
            [
                15816,
                15928
            ],
            [
                15928,
                15948
            ],
            [
                15948,
                16062
            ],
            [
                16062,
                16093
            ],
            [
                16093,
                16207
            ],
            [
                16207,
                16349
            ],
            [
                16349,
                16374
            ],
            [
                16374,
                16408
            ],
            [
                16408,
                16474
            ],
            [
                16474,
                16604
            ],
            [
                16604,
                16698
            ],
            [
                16698,
                16777
            ],
            [
                16777,
                16890
            ],
            [
                16890,
                16995
            ],
            [
                16995,
                17124
            ],
            [
                17124,
                17233
            ],
            [
                17233,
                17297
            ],
            [
                17297,
                17368
            ],
            [
                17368,
                17633
            ],
            [
                17633,
                17688
            ],
            [
                17688,
                17773
            ],
            [
                17773,
                17905
            ],
            [
                17905,
                17950
            ],
            [
                17950,
                18050
            ],
            [
                18050,
                18094
            ],
            [
                18094,
                18161
            ],
            [
                18161,
                18185
            ],
            [
                18185,
                18254
            ],
            [
                18254,
                18342
            ],
            [
                18342,
                18409
            ],
            [
                18409,
                18533
            ],
            [
                18533,
                18627
            ],
            [
                18627,
                18700
            ],
            [
                18700,
                18768
            ],
            [
                18768,
                18919
            ],
            [
                18919,
                18988
            ],
            [
                18988,
                19072
            ],
            [
                19072,
                19098
            ],
            [
                19098,
                19182
            ],
            [
                19182,
                19221
            ],
            [
                19221,
                19338
            ],
            [
                19338,
                19384
            ],
            [
                19384,
                19436
            ],
            [
                19436,
                19507
            ],
            [
                19507,
                19572
            ],
            [
                19572,
                19607
            ],
            [
                19607,
                19757
            ],
            [
                19757,
                19771
            ],
            [
                19771,
                19804
            ],
            [
                19804,
                19906
            ],
            [
                19906,
                19978
            ],
            [
                19978,
                20083
            ],
            [
                20083,
                20162
            ],
            [
                20162,
                20218
            ],
            [
                20218,
                20306
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                19,
                25
            ],
            [
                26,
                34
            ],
            [
                40,
                45
            ],
            [
                46,
                85
            ],
            [
                86,
                89
            ],
            [
                96,
                135
            ],
            [
                136,
                140
            ],
            [
                141,
                150
            ],
            [
                162,
                272
            ],
            [
                273,
                308
            ],
            [
                308,
                310
            ],
            [
                310,
                425
            ],
            [
                426,
                459
            ],
            [
                488,
                512
            ],
            [
                515,
                578
            ],
            [
                579,
                591
            ],
            [
                592,
                618
            ],
            [
                619,
                624
            ],
            [
                625,
                629
            ],
            [
                630,
                638
            ],
            [
                639,
                670
            ],
            [
                671,
                787
            ],
            [
                787,
                789
            ],
            [
                789,
                805
            ],
            [
                806,
                870
            ],
            [
                874,
                892
            ],
            [
                893,
                896
            ],
            [
                897,
                911
            ],
            [
                911,
                1082
            ],
            [
                1090,
                1103
            ],
            [
                1104,
                1106
            ],
            [
                1107,
                1117
            ],
            [
                1118,
                1140
            ],
            [
                1140,
                1164
            ],
            [
                1164,
                1166
            ],
            [
                1166,
                1328
            ],
            [
                1328,
                1330
            ],
            [
                1330,
                1401
            ],
            [
                1416,
                1419
            ],
            [
                1436,
                1443
            ],
            [
                1450,
                1453
            ],
            [
                1454,
                1457
            ],
            [
                1463,
                1465
            ],
            [
                1471,
                1492
            ],
            [
                1499,
                1501
            ],
            [
                1501,
                1546
            ],
            [
                1551,
                1557
            ],
            [
                1558,
                1581
            ],
            [
                1581,
                1623
            ],
            [
                1628,
                1693
            ],
            [
                1699,
                1701
            ],
            [
                1701,
                1744
            ],
            [
                1744,
                1818
            ],
            [
                1822,
                1861
            ],
            [
                1861,
                1863
            ],
            [
                1863,
                1896
            ],
            [
                1896,
                1952
            ],
            [
                1953,
                1954
            ],
            [
                1955,
                1961
            ],
            [
                1962,
                1972
            ],
            [
                1972,
                2000
            ],
            [
                2009,
                2017
            ],
            [
                2026,
                2033
            ],
            [
                2034,
                2056
            ],
            [
                2056,
                2131
            ],
            [
                2131,
                2372
            ],
            [
                2378,
                2381
            ],
            [
                2391,
                2404
            ],
            [
                2425,
                2427
            ],
            [
                2428,
                2453
            ],
            [
                2456,
                2458
            ],
            [
                2458,
                2476
            ],
            [
                2477,
                2509
            ],
            [
                2510,
                2512
            ],
            [
                2534,
                2536
            ],
            [
                2536,
                2538
            ],
            [
                2549,
                2561
            ],
            [
                2570,
                2573
            ],
            [
                2574,
                2582
            ],
            [
                2583,
                2627
            ],
            [
                2627,
                2699
            ],
            [
                2700,
                2752
            ],
            [
                2755,
                2809
            ],
            [
                2809,
                2811
            ],
            [
                2811,
                2916
            ],
            [
                2938,
                2940
            ],
            [
                2940,
                2947
            ],
            [
                2956,
                3001
            ],
            [
                3012,
                3182
            ],
            [
                3183,
                3190
            ],
            [
                3197,
                3200
            ],
            [
                3201,
                3208
            ],
            [
                3209,
                3211
            ],
            [
                3212,
                3221
            ],
            [
                3227,
                3233
            ],
            [
                3234,
                3277
            ],
            [
                3278,
                3286
            ],
            [
                3286,
                3288
            ],
            [
                3293,
                3296
            ],
            [
                3310,
                3400
            ],
            [
                3400,
                3448
            ],
            [
                3448,
                3547
            ],
            [
                3548,
                3584
            ],
            [
                3588,
                3595
            ],
            [
                3600,
                3624
            ],
            [
                3624,
                3636
            ],
            [
                3637,
                3647
            ],
            [
                3648,
                3700
            ],
            [
                3707,
                3710
            ],
            [
                3710,
                3715
            ],
            [
                3716,
                3723
            ],
            [
                3724,
                3732
            ],
            [
                3732,
                3734
            ],
            [
                3740,
                3743
            ],
            [
                3744,
                3747
            ],
            [
                3757,
                3759
            ],
            [
                3784,
                3795
            ],
            [
                3795,
                3797
            ],
            [
                3797,
                3804
            ],
            [
                3811,
                3860
            ],
            [
                3861,
                3909
            ],
            [
                3910,
                3924
            ],
            [
                3924,
                4004
            ],
            [
                4005,
                4010
            ],
            [
                4011,
                4017
            ],
            [
                4017,
                4019
            ],
            [
                4019,
                4022
            ],
            [
                4027,
                4036
            ],
            [
                4052,
                4093
            ],
            [
                4094,
                4136
            ],
            [
                4136,
                4138
            ],
            [
                4184,
                4187
            ],
            [
                4188,
                4191
            ],
            [
                4191,
                4192
            ],
            [
                4193,
                4260
            ],
            [
                4261,
                4359
            ],
            [
                4360,
                4370
            ],
            [
                4371,
                4374
            ],
            [
                4382,
                4389
            ],
            [
                4398,
                4403
            ],
            [
                4404,
                4419
            ],
            [
                4420,
                4433
            ],
            [
                4433,
                4439
            ],
            [
                4440,
                4492
            ],
            [
                4493,
                4549
            ],
            [
                4560,
                4580
            ],
            [
                4604,
                4606
            ],
            [
                4614,
                4616
            ],
            [
                4636,
                4638
            ],
            [
                4650,
                4652
            ],
            [
                4658,
                4659
            ],
            [
                4670,
                4677
            ],
            [
                4678,
                4697
            ],
            [
                4706,
                4708
            ],
            [
                4720,
                4743
            ],
            [
                4747,
                4750
            ],
            [
                4761,
                4773
            ],
            [
                4781,
                4783
            ],
            [
                4783,
                4810
            ],
            [
                4820,
                4863
            ],
            [
                4864,
                4876
            ],
            [
                4885,
                4972
            ],
            [
                4985,
                4989
            ],
            [
                4989,
                4990
            ],
            [
                4991,
                5056
            ],
            [
                5057,
                5061
            ],
            [
                5062,
                5065
            ],
            [
                5066,
                5072
            ],
            [
                5073,
                5076
            ],
            [
                5081,
                5181
            ],
            [
                5181,
                5294
            ],
            [
                5294,
                5297
            ],
            [
                5306,
                5336
            ],
            [
                5346,
                5353
            ],
            [
                5360,
                5366
            ],
            [
                5367,
                5434
            ],
            [
                5439,
                5448
            ],
            [
                5448,
                5450
            ],
            [
                5450,
                5468
            ],
            [
                5469,
                5557
            ],
            [
                5557,
                5625
            ],
            [
                5633,
                5639
            ],
            [
                5639,
                5641
            ],
            [
                5641,
                5694
            ],
            [
                5697,
                5809
            ],
            [
                5810,
                5844
            ],
            [
                5844,
                5958
            ],
            [
                5958,
                6040
            ],
            [
                6041,
                6110
            ],
            [
                6113,
                6213
            ],
            [
                6221,
                6224
            ],
            [
                6230,
                6241
            ],
            [
                6246,
                6251
            ],
            [
                6255,
                6278
            ],
            [
                6283,
                6285
            ],
            [
                6298,
                6304
            ],
            [
                6304,
                6306
            ],
            [
                6306,
                6509
            ],
            [
                6509,
                6532
            ],
            [
                6537,
                6552
            ],
            [
                6560,
                6576
            ],
            [
                6577,
                6581
            ],
            [
                6582,
                6594
            ],
            [
                6594,
                6601
            ],
            [
                6602,
                6699
            ],
            [
                6699,
                6736
            ],
            [
                6736,
                6738
            ],
            [
                6738,
                6841
            ],
            [
                6841,
                6843
            ],
            [
                6843,
                6846
            ],
            [
                6847,
                6853
            ],
            [
                6854,
                6860
            ],
            [
                6865,
                6890
            ],
            [
                6892,
                6909
            ],
            [
                6914,
                6947
            ],
            [
                6948,
                6951
            ],
            [
                6952,
                6957
            ],
            [
                6957,
                6959
            ],
            [
                6959,
                7001
            ],
            [
                7001,
                7034
            ],
            [
                7037,
                7075
            ],
            [
                7075,
                7107
            ],
            [
                7107,
                7139
            ],
            [
                7139,
                7217
            ],
            [
                7218,
                7277
            ],
            [
                7283,
                7296
            ],
            [
                7305,
                7316
            ],
            [
                7317,
                7329
            ],
            [
                7330,
                7333
            ],
            [
                7342,
                7351
            ],
            [
                7357,
                7416
            ],
            [
                7416,
                7418
            ],
            [
                7418,
                7433
            ],
            [
                7441,
                7445
            ],
            [
                7450,
                7478
            ],
            [
                7478,
                7515
            ],
            [
                7524,
                7624
            ],
            [
                7624,
                7660
            ],
            [
                7666,
                7685
            ],
            [
                7702,
                7734
            ],
            [
                7735,
                7807
            ],
            [
                7807,
                7850
            ],
            [
                7850,
                7878
            ],
            [
                7879,
                7887
            ],
            [
                7888,
                7902
            ],
            [
                7902,
                7915
            ],
            [
                7915,
                7944
            ],
            [
                7944,
                8023
            ],
            [
                8023,
                8095
            ],
            [
                8107,
                8109
            ],
            [
                8109,
                8171
            ],
            [
                8172,
                8209
            ],
            [
                8209,
                8342
            ],
            [
                8342,
                8412
            ],
            [
                8415,
                8431
            ],
            [
                8432,
                8439
            ],
            [
                8440,
                8464
            ],
            [
                8473,
                8490
            ],
            [
                8491,
                8516
            ],
            [
                8516,
                8580
            ],
            [
                8580,
                8722
            ],
            [
                8722,
                8730
            ],
            [
                8736,
                8747
            ],
            [
                8747,
                8764
            ],
            [
                8764,
                8766
            ],
            [
                8766,
                8829
            ],
            [
                8831,
                8840
            ],
            [
                8845,
                8847
            ],
            [
                8854,
                8858
            ],
            [
                8858,
                8860
            ],
            [
                8860,
                8883
            ],
            [
                8883,
                8912
            ],
            [
                8915,
                8931
            ],
            [
                8931,
                8982
            ],
            [
                8985,
                8995
            ],
            [
                8996,
                9016
            ],
            [
                9017,
                9069
            ],
            [
                9070,
                9071
            ],
            [
                9072,
                9080
            ],
            [
                9085,
                9093
            ],
            [
                9094,
                9132
            ],
            [
                9133,
                9141
            ],
            [
                9141,
                9143
            ],
            [
                9143,
                9168
            ],
            [
                9169,
                9222
            ],
            [
                9223,
                9282
            ],
            [
                9283,
                9294
            ],
            [
                9294,
                9316
            ],
            [
                9319,
                9360
            ],
            [
                9360,
                9382
            ],
            [
                9382,
                9423
            ],
            [
                9423,
                9425
            ],
            [
                9425,
                9452
            ],
            [
                9452,
                9498
            ],
            [
                9498,
                9562
            ],
            [
                9562,
                9575
            ],
            [
                9577,
                9654
            ],
            [
                9654,
                9697
            ],
            [
                9697,
                9746
            ],
            [
                9746,
                9748
            ],
            [
                9748,
                9801
            ],
            [
                9804,
                9838
            ],
            [
                9838,
                9856
            ],
            [
                9856,
                9875
            ],
            [
                9875,
                9967
            ],
            [
                9967,
                9990
            ],
            [
                9990,
                9991
            ],
            [
                9991,
                9994
            ],
            [
                9995,
                10010
            ],
            [
                10011,
                10044
            ],
            [
                10044,
                10046
            ],
            [
                10046,
                10051
            ],
            [
                10051,
                10087
            ],
            [
                10087,
                10115
            ],
            [
                10120,
                10189
            ],
            [
                10189,
                10200
            ],
            [
                10200,
                10259
            ],
            [
                10260,
                10273
            ],
            [
                10274,
                10301
            ],
            [
                10301,
                10312
            ],
            [
                10316,
                10437
            ],
            [
                10437,
                10476
            ],
            [
                10476,
                10490
            ],
            [
                10490,
                10505
            ],
            [
                10505,
                10517
            ],
            [
                10518,
                10523
            ],
            [
                10524,
                10600
            ],
            [
                10604,
                10615
            ],
            [
                10615,
                10682
            ],
            [
                10685,
                10803
            ],
            [
                10803,
                10829
            ],
            [
                10829,
                10831
            ],
            [
                10831,
                10893
            ],
            [
                10905,
                10992
            ],
            [
                10992,
                11160
            ],
            [
                11160,
                11233
            ],
            [
                11233,
                11267
            ],
            [
                11267,
                11293
            ],
            [
                11293,
                11314
            ],
            [
                11317,
                11443
            ],
            [
                11443,
                11445
            ],
            [
                11445,
                11474
            ],
            [
                11475,
                11483
            ],
            [
                11485,
                11486
            ],
            [
                11486,
                11498
            ],
            [
                11499,
                11502
            ],
            [
                11503,
                11504
            ],
            [
                11505,
                11508
            ],
            [
                11509,
                11534
            ],
            [
                11535,
                11589
            ],
            [
                11589,
                11645
            ],
            [
                11652,
                11654
            ],
            [
                11659,
                11725
            ],
            [
                11725,
                11738
            ],
            [
                11739,
                11748
            ],
            [
                11749,
                11751
            ],
            [
                11752,
                11754
            ],
            [
                11760,
                11810
            ],
            [
                11813,
                11840
            ],
            [
                11840,
                11862
            ],
            [
                11862,
                11866
            ],
            [
                11867,
                11874
            ],
            [
                11875,
                11880
            ],
            [
                11881,
                11896
            ],
            [
                11899,
                11948
            ],
            [
                11949,
                12009
            ],
            [
                12009,
                12045
            ],
            [
                12046,
                12050
            ],
            [
                12057,
                12063
            ],
            [
                12063,
                12104
            ],
            [
                12110,
                12118
            ],
            [
                12118,
                12120
            ],
            [
                12120,
                12130
            ],
            [
                12133,
                12160
            ],
            [
                12160,
                12263
            ],
            [
                12263,
                12266
            ],
            [
                12267,
                12271
            ],
            [
                12277,
                12284
            ],
            [
                12285,
                12299
            ],
            [
                12299,
                12301
            ],
            [
                12301,
                12340
            ],
            [
                12340,
                12415
            ],
            [
                12416,
                12552
            ],
            [
                12552,
                12611
            ],
            [
                12620,
                12639
            ],
            [
                12639,
                12641
            ],
            [
                12641,
                12744
            ],
            [
                12744,
                12745
            ],
            [
                12748,
                12751
            ],
            [
                12752,
                12789
            ],
            [
                12789,
                12835
            ],
            [
                12835,
                12861
            ],
            [
                12861,
                12902
            ],
            [
                12902,
                12973
            ],
            [
                12973,
                13007
            ],
            [
                13007,
                13021
            ],
            [
                13021,
                13053
            ],
            [
                13053,
                13064
            ],
            [
                13070,
                13077
            ],
            [
                13078,
                13091
            ],
            [
                13092,
                13163
            ],
            [
                13163,
                13165
            ],
            [
                13165,
                13173
            ],
            [
                13173,
                13184
            ],
            [
                13194,
                13227
            ],
            [
                13227,
                13269
            ],
            [
                13278,
                13288
            ],
            [
                13289,
                13294
            ],
            [
                13295,
                13298
            ],
            [
                13299,
                13351
            ],
            [
                13352,
                13384
            ],
            [
                13388,
                13419
            ],
            [
                13419,
                13492
            ],
            [
                13495,
                13560
            ],
            [
                13561,
                13612
            ],
            [
                13612,
                13614
            ],
            [
                13620,
                13642
            ],
            [
                13643,
                13646
            ],
            [
                13647,
                13655
            ],
            [
                13658,
                13723
            ],
            [
                13723,
                13724
            ],
            [
                13725,
                13750
            ],
            [
                13757,
                13762
            ],
            [
                13769,
                13771
            ],
            [
                13772,
                13808
            ],
            [
                13809,
                13839
            ],
            [
                13842,
                13915
            ],
            [
                13915,
                14035
            ],
            [
                14036,
                14049
            ],
            [
                14050,
                14061
            ],
            [
                14061,
                14062
            ],
            [
                14063,
                14186
            ],
            [
                14187,
                14357
            ],
            [
                14357,
                14359
            ],
            [
                14373,
                14392
            ],
            [
                14392,
                14393
            ],
            [
                14394,
                14397
            ],
            [
                14398,
                14463
            ],
            [
                14463,
                14492
            ],
            [
                14492,
                14494
            ],
            [
                14494,
                14529
            ],
            [
                14530,
                14617
            ],
            [
                14617,
                14628
            ],
            [
                14631,
                14647
            ],
            [
                14647,
                14718
            ],
            [
                14719,
                14735
            ],
            [
                14735,
                14737
            ],
            [
                14737,
                14785
            ],
            [
                14787,
                14809
            ],
            [
                14810,
                14812
            ],
            [
                14813,
                14816
            ],
            [
                14816,
                14856
            ],
            [
                14857,
                14894
            ],
            [
                14894,
                14898
            ],
            [
                14899,
                14932
            ],
            [
                14932,
                14958
            ],
            [
                14958,
                15024
            ],
            [
                15024,
                15046
            ],
            [
                15046,
                15105
            ],
            [
                15108,
                15128
            ],
            [
                15128,
                15141
            ],
            [
                15141,
                15204
            ],
            [
                15204,
                15226
            ],
            [
                15226,
                15253
            ],
            [
                15253,
                15314
            ],
            [
                15314,
                15340
            ],
            [
                15341,
                15350
            ],
            [
                15355,
                15391
            ],
            [
                15392,
                15395
            ],
            [
                15406,
                15407
            ],
            [
                15408,
                15464
            ],
            [
                15467,
                15495
            ],
            [
                15495,
                15507
            ],
            [
                15507,
                15537
            ],
            [
                15537,
                15579
            ],
            [
                15579,
                15627
            ],
            [
                15627,
                15655
            ],
            [
                15656,
                15678
            ],
            [
                15679,
                15690
            ],
            [
                15691,
                15702
            ],
            [
                15702,
                15703
            ],
            [
                15704,
                15725
            ],
            [
                15728,
                15754
            ],
            [
                15754,
                15793
            ],
            [
                15793,
                15816
            ],
            [
                15816,
                15928
            ],
            [
                15928,
                15945
            ],
            [
                15948,
                15996
            ],
            [
                15997,
                16007
            ],
            [
                16008,
                16014
            ],
            [
                16015,
                16020
            ],
            [
                16021,
                16031
            ],
            [
                16041,
                16060
            ],
            [
                16060,
                16062
            ],
            [
                16062,
                16069
            ],
            [
                16076,
                16093
            ],
            [
                16093,
                16099
            ],
            [
                16116,
                16117
            ],
            [
                16122,
                16184
            ],
            [
                16187,
                16207
            ],
            [
                16207,
                16210
            ],
            [
                16211,
                16349
            ],
            [
                16349,
                16354
            ],
            [
                16355,
                16367
            ],
            [
                16368,
                16372
            ],
            [
                16372,
                16373
            ],
            [
                16374,
                16408
            ],
            [
                16408,
                16474
            ],
            [
                16474,
                16547
            ],
            [
                16554,
                16604
            ],
            [
                16604,
                16679
            ],
            [
                16680,
                16690
            ],
            [
                16691,
                16698
            ],
            [
                16698,
                16756
            ],
            [
                16757,
                16762
            ],
            [
                16775,
                16777
            ],
            [
                16777,
                16787
            ],
            [
                16788,
                16821
            ],
            [
                16821,
                16869
            ],
            [
                16870,
                16890
            ],
            [
                16890,
                16953
            ],
            [
                16968,
                16995
            ],
            [
                16995,
                17009
            ],
            [
                17009,
                17010
            ],
            [
                17011,
                17037
            ],
            [
                17037,
                17123
            ],
            [
                17124,
                17231
            ],
            [
                17231,
                17233
            ],
            [
                17233,
                17240
            ],
            [
                17241,
                17247
            ],
            [
                17262,
                17297
            ],
            [
                17297,
                17368
            ],
            [
                17368,
                17371
            ],
            [
                17381,
                17437
            ],
            [
                17448,
                17481
            ],
            [
                17492,
                17499
            ],
            [
                17502,
                17552
            ],
            [
                17563,
                17601
            ],
            [
                17607,
                17633
            ],
            [
                17633,
                17672
            ],
            [
                17673,
                17678
            ],
            [
                17686,
                17687
            ],
            [
                17688,
                17737
            ],
            [
                17737,
                17773
            ],
            [
                17773,
                17779
            ],
            [
                17780,
                17905
            ],
            [
                17905,
                17950
            ],
            [
                17950,
                18050
            ],
            [
                18050,
                18094
            ],
            [
                18094,
                18112
            ],
            [
                18126,
                18145
            ],
            [
                18156,
                18161
            ],
            [
                18161,
                18185
            ],
            [
                18185,
                18233
            ],
            [
                18234,
                18254
            ],
            [
                18254,
                18296
            ],
            [
                18297,
                18317
            ],
            [
                18319,
                18339
            ],
            [
                18339,
                18342
            ],
            [
                18342,
                18409
            ],
            [
                18409,
                18533
            ],
            [
                18533,
                18552
            ],
            [
                18562,
                18568
            ],
            [
                18569,
                18577
            ],
            [
                18578,
                18581
            ],
            [
                18586,
                18589
            ],
            [
                18590,
                18596
            ],
            [
                18620,
                18625
            ],
            [
                18625,
                18627
            ],
            [
                18627,
                18650
            ],
            [
                18650,
                18698
            ],
            [
                18700,
                18748
            ],
            [
                18749,
                18768
            ],
            [
                18768,
                18818
            ],
            [
                18819,
                18827
            ],
            [
                18830,
                18843
            ],
            [
                18843,
                18846
            ],
            [
                18846,
                18852
            ],
            [
                18853,
                18871
            ],
            [
                18873,
                18882
            ],
            [
                18883,
                18919
            ],
            [
                18919,
                18953
            ],
            [
                18956,
                18988
            ],
            [
                18988,
                19008
            ],
            [
                19011,
                19040
            ],
            [
                19041,
                19043
            ],
            [
                19057,
                19072
            ],
            [
                19072,
                19098
            ],
            [
                19098,
                19165
            ],
            [
                19166,
                19180
            ],
            [
                19182,
                19221
            ],
            [
                19221,
                19338
            ],
            [
                19341,
                19381
            ],
            [
                19381,
                19384
            ],
            [
                19384,
                19434
            ],
            [
                19434,
                19435
            ],
            [
                19436,
                19505
            ],
            [
                19505,
                19506
            ],
            [
                19507,
                19557
            ],
            [
                19558,
                19563
            ],
            [
                19570,
                19571
            ],
            [
                19572,
                19607
            ],
            [
                19607,
                19757
            ],
            [
                19757,
                19771
            ],
            [
                19771,
                19802
            ],
            [
                19804,
                19854
            ],
            [
                19858,
                19906
            ],
            [
                19906,
                19976
            ],
            [
                19978,
                20083
            ],
            [
                20083,
                20160
            ],
            [
                20160,
                20162
            ],
            [
                20162,
                20218
            ],
            [
                20218,
                20283
            ],
            [
                20288,
                20306
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                310
            ],
            [
                310,
                592
            ],
            [
                592,
                789
            ],
            [
                789,
                870
            ],
            [
                870,
                911
            ],
            [
                911,
                1166
            ],
            [
                1166,
                1330
            ],
            [
                1330,
                1501
            ],
            [
                1501,
                1581
            ],
            [
                1581,
                1701
            ],
            [
                1701,
                1744
            ],
            [
                1744,
                1863
            ],
            [
                1863,
                2056
            ],
            [
                2056,
                2131
            ],
            [
                2131,
                2458
            ],
            [
                2458,
                2536
            ],
            [
                2536,
                2627
            ],
            [
                2627,
                2811
            ],
            [
                2811,
                2940
            ],
            [
                2940,
                3183
            ],
            [
                3183,
                3288
            ],
            [
                3288,
                3400
            ],
            [
                3400,
                3448
            ],
            [
                3448,
                3624
            ],
            [
                3624,
                3797
            ],
            [
                3797,
                3924
            ],
            [
                3924,
                4019
            ],
            [
                4019,
                4094
            ],
            [
                4094,
                4138
            ],
            [
                4138,
                4433
            ],
            [
                4433,
                4493
            ],
            [
                4493,
                4652
            ],
            [
                4652,
                4783
            ],
            [
                4783,
                4991
            ],
            [
                4991,
                4991
            ],
            [
                4991,
                5181
            ],
            [
                5181,
                5294
            ],
            [
                5294,
                5450
            ],
            [
                5450,
                5641
            ],
            [
                5641,
                5641
            ],
            [
                5641,
                5844
            ],
            [
                5844,
                6113
            ],
            [
                6113,
                6306
            ],
            [
                6306,
                6509
            ],
            [
                6509,
                6699
            ],
            [
                6699,
                6738
            ],
            [
                6738,
                6843
            ],
            [
                6843,
                6959
            ],
            [
                6959,
                6959
            ],
            [
                6959,
                7107
            ],
            [
                7107,
                7317
            ],
            [
                7317,
                7317
            ],
            [
                7317,
                7418
            ],
            [
                7418,
                7624
            ],
            [
                7624,
                7735
            ],
            [
                7735,
                7735
            ],
            [
                7735,
                7735
            ],
            [
                7735,
                7735
            ],
            [
                7735,
                7807
            ],
            [
                7807,
                7850
            ],
            [
                7850,
                7902
            ],
            [
                7902,
                7915
            ],
            [
                7915,
                7944
            ],
            [
                7944,
                8023
            ],
            [
                8023,
                8109
            ],
            [
                8109,
                8172
            ],
            [
                8172,
                8209
            ],
            [
                8209,
                8342
            ],
            [
                8342,
                8516
            ],
            [
                8516,
                8722
            ],
            [
                8722,
                8747
            ],
            [
                8747,
                8766
            ],
            [
                8766,
                8860
            ],
            [
                8860,
                8883
            ],
            [
                8883,
                8931
            ],
            [
                8931,
                8985
            ],
            [
                8985,
                8985
            ],
            [
                8985,
                9143
            ],
            [
                9143,
                9143
            ],
            [
                9143,
                9294
            ],
            [
                9294,
                9382
            ],
            [
                9382,
                9425
            ],
            [
                9425,
                9452
            ],
            [
                9452,
                9498
            ],
            [
                9498,
                9562
            ],
            [
                9562,
                9654
            ],
            [
                9654,
                9748
            ],
            [
                9748,
                9838
            ],
            [
                9838,
                9856
            ],
            [
                9856,
                9875
            ],
            [
                9875,
                9967
            ],
            [
                9967,
                9990
            ],
            [
                9990,
                10011
            ],
            [
                10011,
                10046
            ],
            [
                10046,
                10051
            ],
            [
                10051,
                10087
            ],
            [
                10087,
                10189
            ],
            [
                10189,
                10200
            ],
            [
                10200,
                10301
            ],
            [
                10301,
                10437
            ],
            [
                10437,
                10476
            ],
            [
                10476,
                10490
            ],
            [
                10490,
                10505
            ],
            [
                10505,
                10615
            ],
            [
                10615,
                10803
            ],
            [
                10803,
                10831
            ],
            [
                10831,
                10831
            ],
            [
                10831,
                10992
            ],
            [
                10992,
                11160
            ],
            [
                11160,
                11267
            ],
            [
                11267,
                11293
            ],
            [
                11293,
                11445
            ],
            [
                11445,
                11445
            ],
            [
                11445,
                11485
            ],
            [
                11485,
                11535
            ],
            [
                11535,
                11589
            ],
            [
                11589,
                11654
            ],
            [
                11654,
                11654
            ],
            [
                11654,
                11654
            ],
            [
                11654,
                11725
            ],
            [
                11725,
                11840
            ],
            [
                11840,
                11840
            ],
            [
                11840,
                11862
            ],
            [
                11862,
                12009
            ],
            [
                12009,
                12120
            ],
            [
                12120,
                12132
            ],
            [
                12132,
                12132
            ],
            [
                12132,
                12160
            ],
            [
                12160,
                12263
            ],
            [
                12263,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12301
            ],
            [
                12301,
                12340
            ],
            [
                12340,
                12416
            ],
            [
                12416,
                12416
            ],
            [
                12416,
                12552
            ],
            [
                12552,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                12744
            ],
            [
                12744,
                12789
            ],
            [
                12789,
                12835
            ],
            [
                12835,
                12861
            ],
            [
                12861,
                12902
            ],
            [
                12902,
                12973
            ],
            [
                12973,
                13007
            ],
            [
                13007,
                13021
            ],
            [
                13021,
                13053
            ],
            [
                13053,
                13165
            ],
            [
                13165,
                13173
            ],
            [
                13173,
                13227
            ],
            [
                13227,
                13269
            ],
            [
                13269,
                13419
            ],
            [
                13419,
                13614
            ],
            [
                13614,
                13725
            ],
            [
                13725,
                13915
            ],
            [
                13915,
                14063
            ],
            [
                14063,
                14357
            ],
            [
                14357,
                14463
            ],
            [
                14463,
                14494
            ],
            [
                14494,
                14617
            ],
            [
                14617,
                14647
            ],
            [
                14647,
                14737
            ],
            [
                14737,
                14857
            ],
            [
                14857,
                14857
            ],
            [
                14857,
                14894
            ],
            [
                14894,
                14932
            ],
            [
                14932,
                14958
            ],
            [
                14958,
                15024
            ],
            [
                15024,
                15046
            ],
            [
                15046,
                15108
            ],
            [
                15108,
                15108
            ],
            [
                15108,
                15128
            ],
            [
                15128,
                15141
            ],
            [
                15141,
                15204
            ],
            [
                15204,
                15226
            ],
            [
                15226,
                15253
            ],
            [
                15253,
                15314
            ],
            [
                15314,
                15408
            ],
            [
                15408,
                15408
            ],
            [
                15408,
                15408
            ],
            [
                15408,
                15467
            ],
            [
                15467,
                15495
            ],
            [
                15495,
                15507
            ],
            [
                15507,
                15537
            ],
            [
                15537,
                15579
            ],
            [
                15579,
                15627
            ],
            [
                15627,
                15728
            ],
            [
                15728,
                15728
            ],
            [
                15728,
                15754
            ],
            [
                15754,
                15793
            ],
            [
                15793,
                15816
            ],
            [
                15816,
                15928
            ],
            [
                15928,
                15948
            ],
            [
                15948,
                16062
            ],
            [
                16062,
                16093
            ],
            [
                16093,
                16207
            ],
            [
                16207,
                16349
            ],
            [
                16349,
                16374
            ],
            [
                16374,
                16408
            ],
            [
                16408,
                16474
            ],
            [
                16474,
                16604
            ],
            [
                16604,
                16698
            ],
            [
                16698,
                16698
            ],
            [
                16698,
                16777
            ],
            [
                16777,
                16890
            ],
            [
                16890,
                16995
            ],
            [
                16995,
                17124
            ],
            [
                17124,
                17124
            ],
            [
                17124,
                17233
            ],
            [
                17233,
                17297
            ],
            [
                17297,
                17368
            ],
            [
                17368,
                17633
            ],
            [
                17633,
                17688
            ],
            [
                17688,
                17688
            ],
            [
                17688,
                17688
            ],
            [
                17688,
                17688
            ],
            [
                17688,
                17773
            ],
            [
                17773,
                17773
            ],
            [
                17773,
                17773
            ],
            [
                17773,
                17905
            ],
            [
                17905,
                17950
            ],
            [
                17950,
                18050
            ],
            [
                18050,
                18094
            ],
            [
                18094,
                18161
            ],
            [
                18161,
                18185
            ],
            [
                18185,
                18254
            ],
            [
                18254,
                18342
            ],
            [
                18342,
                18409
            ],
            [
                18409,
                18533
            ],
            [
                18533,
                18627
            ],
            [
                18627,
                18627
            ],
            [
                18627,
                18768
            ],
            [
                18768,
                18919
            ],
            [
                18919,
                18988
            ],
            [
                18988,
                18988
            ],
            [
                18988,
                19072
            ],
            [
                19072,
                19098
            ],
            [
                19098,
                19182
            ],
            [
                19182,
                19221
            ],
            [
                19221,
                19338
            ],
            [
                19338,
                19338
            ],
            [
                19338,
                19384
            ],
            [
                19384,
                19436
            ],
            [
                19436,
                19436
            ],
            [
                19436,
                19436
            ],
            [
                19436,
                19507
            ],
            [
                19507,
                19572
            ],
            [
                19572,
                19572
            ],
            [
                19572,
                19572
            ],
            [
                19572,
                19607
            ],
            [
                19607,
                19757
            ],
            [
                19757,
                19771
            ],
            [
                19771,
                19804
            ],
            [
                19804,
                19906
            ],
            [
                19906,
                20083
            ],
            [
                20083,
                20162
            ],
            [
                20162,
                20218
            ],
            [
                20218,
                20306
            ]
        ]
    }
}