{
    "original": {
        "text": "\"_Gorgibus._-- * * * Je te dis que le mariage est une chose sainte et sacre: et que c'est faire en honntes gens, que de dbuter par l.\n\"_Madelon._--Mon Dieu! que si tout le monde vous ressemblait, un roman serait bientt fini! La belle chose que ce serait, si d'abord Cyrus pousait Mandane, et qu'Aronce de plain-pied ft mari Cllie! * * * Laissez-nous faire loisir le tissu de notre roman, et n'en pressez pas tant la conclusion.\" MOLIRE. _Les Prcieuses Ridicules._\nIt would be a little hard to blame the rector of Pennicote that in the course of looking at things from every point of view, he looked at Gwendolen as a girl likely to make a brilliant marriage. Why should he be expected to differ from his contemporaries in this matter, and wish his niece a worse end of her charming maidenhood than they would approve as the best possible? It is rather to be set down to his credit that his feelings on the subject were entirely good-natured. And in considering the relation of means to ends, it would have been mere folly to have been guided by the exceptional and idyllic--to have recommended that Gwendolen should wear a gown as shabby as Griselda's in order that a marquis might fall in love with her, or to have insisted that since a fair maiden was to be sought, she should keep herself out of the way. Mr. Gascoigne's calculations were of the kind called rational, and he did not even think of getting a too frisky horse in order that Gwendolen might be threatened with an accident and be rescued by a man of property. He wished his niece well, and he meant her to be seen to advantage in the best society of the neighborhood.\nHer uncle's intention fell in perfectly with Gwendolen's own wishes. But let no one suppose that she also contemplated a brilliant marriage as the direct end of her witching the world with her grace on horseback, or with any other accomplishment. That she was to be married some time or other she would have felt obliged to admit; and that her marriage would not be of a middling kind, such as most girls were contented with, she felt quietly, unargumentatively sure. But her thoughts never dwelt on marriage as the fulfillment of her ambition; the dramas in which she imagined herself a heroine were not wrought up to that close. To be very much sued or hopelessly sighed for as a bride was indeed an indispensable and agreeable guarantee of womanly power; but to become a wife and wear all the domestic fetters of that condition, was on the whole a vexatious necessity. Her observation of matrimony had inclined her to think it rather a dreary state in which a woman could not do what she liked, had more children than were desirable, was consequently dull, and became irrevocably immersed in humdrum. Of course marriage was social promotion; she could not look forward to a single life; but promotions have sometimes to be taken with bitter herbs--a peerage will not quite do instead of leadership to the man who meant to lead; and this delicate-limbed sylph of twenty meant to lead. For such passions dwell in feminine breasts also. In Gwendolen's, however, they dwelt among strictly feminine furniture, and had no disturbing reference to the advancement of learning or the balance of the constitution; her knowledge being such as with no sort of standing-room or length of lever could have been expected to move the world. She meant to do what was pleasant to herself in a striking manner; or rather, whatever she could do so as to strike others with admiration and get in that reflected way a more ardent sense of living, seemed pleasant to her fancy.\n\"Gwendolen will not rest without having the world at her feet,\" said Miss Merry, the meek governess: hyperbolical words which have long come to carry the most moderate meanings; for who has not heard of private persons having the world at their feet in the shape of some half-dozen items of flattering regard generally known in a genteel suburb? And words could hardly be too wide or vague to indicate the prospect that made a hazy largeness about poor Gwendolen on the heights of her young self-exultation. Other people allowed themselves to be made slaves of, and to have their lives blown hither and thither like empty ships in which no will was present. It was not to be so with her; she would no longer be sacrificed to creatures worth less than herself, but would make the very best of the chances that life offered her, and conquer circumstances by her exceptional cleverness. Certainly, to be settled at Offendene, with the notice of Lady Brackenshaw, the archery club, and invitations to dine with the Arrowpoints, as the highest lights in her scenery, was not a position that seemed to offer remarkable chances; but Gwendolen's confidence lay chiefly in herself. She felt well equipped for the mastery of life. With regard to much in her lot hitherto, she held herself rather hardly dealt with, but as to her \"education,\" she would have admitted that it had left her under no disadvantages. In the school-room her quick mind had taken readily that strong starch of unexplained rules and disconnected facts which saves ignorance from any painful sense of limpness; and what remained of all things knowable, she was conscious of being sufficiently acquainted with through novels, plays and poems. About her French and music, the two justifying accomplishments of a young lady, she felt no ground for uneasiness; and when to all these qualifications, negative and positive, we add the spontaneous sense of capability some happy persons are born with, so that any subject they turn their attention to impresses them with their own power of forming a correct judgment on it, who can wonder if Gwendolen felt ready to manage her own destiny?\nThere were many subjects in the world--perhaps the majority--in which she felt no interest, because they were stupid; for subjects are apt to appear stupid to the young as light seems dull to the old; but she would not have felt at all helpless in relation to them if they had turned up in conversation. It must be remembered that no one had disputed her power or her general superiority. As on the arrival at Offendene, so always, the first thought of those about her had been, what will Gwendolen think?--if the footman trod heavily in creaking boots, or if the laundress's work was unsatisfactory, the maid said, \"This will never do for Miss Harleth\"; if the wood smoked in the bedroom fireplace, Mrs. Davilow, whose own weak eyes suffered much from this inconvenience, spoke apologetically of it to Gwendolen. If, when they were under the stress of traveling, she did not appear at the breakfast table till every one else had finished, the only question was, how Gwendolen's coffee and toast should still be of the hottest and crispest; and when she appeared with her freshly-brushed light-brown hair streaming backward and awaiting her mamma's hand to coil it up, her large brown eyes glancing bright as a wave-washed onyx from under their long lashes, it was always she herself who had to be tolerant--to beg that Alice who sat waiting on her would not stick up her shoulders in that frightful manner, and that Isabel, instead of pushing up to her and asking questions, would go away to Miss Merry.\nAlways she was the princess in exile, who in time of famine was to have her breakfast-roll made of the finest-bolted flour from the seven thin ears of wheat, and in a general decampment was to have her silver fork kept out of the baggage. How was this to be accounted for? The answer may seem to lie quite on the surface:--in her beauty, a certain unusualness about her, a decision of will which made itself felt in her graceful movements and clear unhesitating tones, so that if she came into the room on a rainy day when everybody else was flaccid and the use of things in general was not apparent to them, there seemed to be a sudden, sufficient reason for keeping up the forms of life; and even the waiters at hotels showed the more alacrity in doing away with crumbs and creases and dregs with struggling flies in them. This potent charm, added to the fact that she was the eldest daughter, toward whom her mamma had always been in an apologetic state of mind for the evils brought on her by a step-father, may seem so full a reason for Gwendolen's domestic empire, that to look for any other would be to ask the reason of daylight when the sun is shining. But beware of arriving at conclusions without comparison. I remember having seen the same assiduous, apologetic attention awarded to persons who were not at all beautiful or unusual, whose firmness showed itself in no very graceful or euphonious way, and who were not eldest daughters with a tender, timid mother, compunctious at having subjected them to inconveniences. Some of them were a very common sort of men. And the only point of resemblance among them all was a strong determination to have what was pleasant, with a total fearlessness in making themselves disagreeable or dangerous when they did not get it. Who is so much cajoled and served with trembling by the weak females of a household as the unscrupulous male--capable, if he has not free way at home, of going and doing worse elsewhere? Hence I am forced to doubt whether even without her potent charm and peculiar filial position Gwendolen might not still have played the queen in exile, if only she had kept her inborn energy of egoistic desire, and her power of inspiring fear as to what she might say or do. However, she had the charm, and those who feared her were also fond of her; the fear and the fondness being perhaps both heightened by what may be called the iridescence of her character--the play of various, nay, contrary tendencies. For Macbeth's rhetoric about the impossibility of being many opposite things in the same moment, referred to the clumsy necessities of action and not to the subtler possibilities of feeling. We cannot speak a loyal word and be meanly silent; we cannot kill and not kill in the same moment; but a moment is wide enough for the loyal and mean desire, for the outlash of a murderous thought and the sharp backward stroke of repentance.",
        "paragraph_chars": [
            [
                0,
                134
            ],
            [
                134,
                464
            ],
            [
                464,
                1633
            ],
            [
                1633,
                3591
            ],
            [
                3591,
                5737
            ],
            [
                5737,
                7242
            ],
            [
                7242,
                10151
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                157
            ],
            [
                157,
                225
            ],
            [
                225,
                331
            ],
            [
                331,
                429
            ],
            [
                429,
                437
            ],
            [
                437,
                464
            ],
            [
                464,
                659
            ],
            [
                659,
                839
            ],
            [
                839,
                942
            ],
            [
                942,
                1308
            ],
            [
                1308,
                1525
            ],
            [
                1525,
                1633
            ],
            [
                1633,
                1702
            ],
            [
                1702,
                1880
            ],
            [
                1880,
                2101
            ],
            [
                2101,
                2264
            ],
            [
                2264,
                2505
            ],
            [
                2505,
                2737
            ],
            [
                2737,
                3020
            ],
            [
                3020,
                3070
            ],
            [
                3070,
                3361
            ],
            [
                3361,
                3591
            ],
            [
                3591,
                3937
            ],
            [
                3937,
                4099
            ],
            [
                4099,
                4249
            ],
            [
                4249,
                4475
            ],
            [
                4475,
                4764
            ],
            [
                4764,
                4812
            ],
            [
                4812,
                4992
            ],
            [
                4992,
                5296
            ],
            [
                5296,
                5737
            ],
            [
                5737,
                6041
            ],
            [
                6041,
                6126
            ],
            [
                6126,
                6551
            ],
            [
                6551,
                7242
            ],
            [
                7242,
                7481
            ],
            [
                7481,
                7515
            ],
            [
                7515,
                8067
            ],
            [
                8067,
                8404
            ],
            [
                8404,
                8462
            ],
            [
                8462,
                8775
            ],
            [
                8775,
                8820
            ],
            [
                8820,
                9022
            ],
            [
                9022,
                9209
            ],
            [
                9209,
                9484
            ],
            [
                9484,
                9719
            ],
            [
                9719,
                9910
            ],
            [
                9910,
                10151
            ]
        ],
        "overlap_chars": [
            [
                464,
                522
            ],
            [
                602,
                659
            ],
            [
                659,
                733
            ],
            [
                837,
                839
            ],
            [
                867,
                880
            ],
            [
                886,
                942
            ],
            [
                1308,
                1321
            ],
            [
                1369,
                1370
            ],
            [
                1408,
                1409
            ],
            [
                1361,
                1369
            ],
            [
                1378,
                1407
            ],
            [
                1410,
                1420
            ],
            [
                1421,
                1525
            ],
            [
                1525,
                1618
            ],
            [
                1631,
                1633
            ],
            [
                1655,
                1702
            ],
            [
                1702,
                1779
            ],
            [
                1791,
                1797
            ],
            [
                1826,
                1844
            ],
            [
                1878,
                1880
            ],
            [
                1926,
                1929
            ],
            [
                1880,
                1925
            ],
            [
                2057,
                2058
            ],
            [
                1964,
                1967
            ],
            [
                1941,
                1945
            ],
            [
                2095,
                2099
            ],
            [
                1968,
                1998
            ],
            [
                2002,
                2003
            ],
            [
                2017,
                2057
            ],
            [
                2099,
                2101
            ],
            [
                2101,
                2141
            ],
            [
                2176,
                2228
            ],
            [
                2234,
                2237
            ],
            [
                2252,
                2256
            ],
            [
                2262,
                2264
            ],
            [
                2264,
                2269
            ],
            [
                2288,
                2334
            ],
            [
                2353,
                2362
            ],
            [
                2373,
                2420
            ],
            [
                2429,
                2445
            ],
            [
                2465,
                2468
            ],
            [
                2494,
                2505
            ],
            [
                2521,
                2523
            ],
            [
                2570,
                2653
            ],
            [
                2691,
                2696
            ],
            [
                2670,
                2673
            ],
            [
                2687,
                2691
            ],
            [
                2728,
                2736
            ],
            [
                2737,
                2826
            ],
            [
                3005,
                3020
            ],
            [
                3020,
                3063
            ],
            [
                3068,
                3070
            ],
            [
                3070,
                3148
            ],
            [
                3173,
                3175
            ],
            [
                3268,
                3272
            ],
            [
                3195,
                3206
            ],
            [
                3359,
                3361
            ],
            [
                3361,
                3438
            ],
            [
                3467,
                3559
            ],
            [
                3589,
                3591
            ],
            [
                3591,
                3675
            ],
            [
                3681,
                3691
            ],
            [
                3705,
                3710
            ],
            [
                3841,
                3843
            ],
            [
                3937,
                3966
            ],
            [
                3975,
                3996
            ],
            [
                4018,
                4022
            ],
            [
                4039,
                4099
            ],
            [
                4099,
                4218
            ],
            [
                4247,
                4249
            ],
            [
                4249,
                4288
            ],
            [
                4299,
                4474
            ],
            [
                4475,
                4522
            ],
            [
                4555,
                4567
            ],
            [
                4569,
                4572
            ],
            [
                4573,
                4584
            ],
            [
                4598,
                4613
            ],
            [
                4615,
                4726
            ],
            [
                4729,
                4739
            ],
            [
                4752,
                4764
            ],
            [
                4764,
                4812
            ],
            [
                4923,
                4926
            ],
            [
                4955,
                4958
            ],
            [
                4977,
                4990
            ],
            [
                4851,
                4856
            ],
            [
                4947,
                4951
            ],
            [
                4835,
                4838
            ],
            [
                4911,
                4920
            ],
            [
                4990,
                4992
            ],
            [
                4992,
                5010
            ],
            [
                5026,
                5029
            ],
            [
                5078,
                5087
            ],
            [
                5101,
                5106
            ],
            [
                5011,
                5014
            ],
            [
                5129,
                5133
            ],
            [
                5163,
                5168
            ],
            [
                5205,
                5210
            ],
            [
                5234,
                5262
            ],
            [
                5263,
                5296
            ],
            [
                5296,
                5322
            ],
            [
                5374,
                5447
            ],
            [
                5472,
                5478
            ],
            [
                5495,
                5514
            ],
            [
                5322,
                5323
            ],
            [
                5552,
                5556
            ],
            [
                5645,
                5666
            ],
            [
                5557,
                5568
            ],
            [
                5669,
                5737
            ],
            [
                5737,
                5774
            ],
            [
                5776,
                5783
            ],
            [
                5798,
                5920
            ],
            [
                5926,
                5981
            ],
            [
                6002,
                6041
            ],
            [
                6041,
                6091
            ],
            [
                6113,
                6126
            ],
            [
                6169,
                6195
            ],
            [
                6144,
                6156
            ],
            [
                6318,
                6321
            ],
            [
                6161,
                6167
            ],
            [
                6214,
                6242
            ],
            [
                6392,
                6489
            ],
            [
                6534,
                6536
            ],
            [
                6156,
                6157
            ],
            [
                6537,
                6539
            ],
            [
                6202,
                6205
            ],
            [
                6549,
                6551
            ],
            [
                6551,
                6553
            ],
            [
                6704,
                6713
            ],
            [
                6605,
                6647
            ],
            [
                6658,
                6698
            ],
            [
                6700,
                6703
            ],
            [
                6906,
                6909
            ],
            [
                6716,
                6739
            ],
            [
                6746,
                6748
            ],
            [
                6764,
                6773
            ],
            [
                6776,
                6824
            ],
            [
                6837,
                6905
            ],
            [
                6995,
                7043
            ],
            [
                6830,
                6831
            ],
            [
                7045,
                7062
            ],
            [
                7086,
                7172
            ],
            [
                7195,
                7226
            ],
            [
                7240,
                7242
            ],
            [
                7242,
                7283
            ],
            [
                7302,
                7313
            ],
            [
                7341,
                7344
            ],
            [
                7292,
                7294
            ],
            [
                7479,
                7481
            ],
            [
                7485,
                7493
            ],
            [
                7513,
                7515
            ],
            [
                7515,
                7541
            ],
            [
                7565,
                7579
            ],
            [
                7814,
                7816
            ],
            [
                7551,
                7554
            ],
            [
                7615,
                7709
            ],
            [
                8065,
                8067
            ],
            [
                8067,
                8159
            ],
            [
                8182,
                8192
            ],
            [
                8207,
                8262
            ],
            [
                8273,
                8311
            ],
            [
                8402,
                8403
            ],
            [
                8404,
                8407
            ],
            [
                8462,
                8463
            ],
            [
                8480,
                8493
            ],
            [
                8516,
                8525
            ],
            [
                8534,
                8574
            ],
            [
                8585,
                8615
            ],
            [
                8442,
                8449
            ],
            [
                8653,
                8716
            ],
            [
                8773,
                8775
            ],
            [
                8775,
                8792
            ],
            [
                8795,
                8820
            ],
            [
                8824,
                9022
            ],
            [
                9244,
                9260
            ],
            [
                9268,
                9273
            ],
            [
                9303,
                9318
            ],
            [
                9323,
                9360
            ],
            [
                9382,
                9385
            ],
            [
                9393,
                9483
            ],
            [
                9484,
                9591
            ],
            [
                9600,
                9670
            ],
            [
                9691,
                9692
            ],
            [
                9698,
                9706
            ],
            [
                9717,
                9718
            ]
        ],
        "row_chars": [
            [
                0,
                134
            ],
            [
                134,
                157
            ],
            [
                157,
                225
            ],
            [
                225,
                331
            ],
            [
                331,
                429
            ],
            [
                429,
                437
            ],
            [
                437,
                464
            ],
            [
                464,
                659
            ],
            [
                659,
                839
            ],
            [
                839,
                942
            ],
            [
                942,
                1308
            ],
            [
                1308,
                1525
            ],
            [
                1525,
                1633
            ],
            [
                1633,
                1702
            ],
            [
                1702,
                1880
            ],
            [
                1880,
                2101
            ],
            [
                2101,
                2264
            ],
            [
                2264,
                2505
            ],
            [
                2505,
                2737
            ],
            [
                2737,
                3020
            ],
            [
                3020,
                3070
            ],
            [
                3070,
                3361
            ],
            [
                3361,
                3591
            ],
            [
                3591,
                3937
            ],
            [
                3937,
                4099
            ],
            [
                4099,
                4249
            ],
            [
                4249,
                4475
            ],
            [
                4475,
                4764
            ],
            [
                4764,
                4812
            ],
            [
                4812,
                4992
            ],
            [
                4992,
                5296
            ],
            [
                5296,
                5737
            ],
            [
                5737,
                6041
            ],
            [
                6041,
                6126
            ],
            [
                6126,
                6551
            ],
            [
                6551,
                7242
            ],
            [
                7242,
                7481
            ],
            [
                7481,
                7515
            ],
            [
                7515,
                8067
            ],
            [
                8067,
                8404
            ],
            [
                8404,
                8775
            ],
            [
                8775,
                8820
            ],
            [
                8820,
                9022
            ],
            [
                9022,
                9209
            ],
            [
                9209,
                9484
            ],
            [
                9484,
                9719
            ],
            [
                9719,
                9910
            ],
            [
                9910,
                10151
            ]
        ]
    },
    "abridged": {
        "text": "It would be a little hard to blame the rector of Pennicote for regarding Gwendolen as a girl likely to make a brilliant marriage. Why should he be expected to differ from his contemporaries in this matter? To his credit, his feelings on the subject were entirely good-natured. Mr. Gascoigne, being a rational man, did not even think of getting too frisky a horse in order that Gwendolen might be threatened with an accident and be rescued by a man of property. He wished his niece well, and he meant her to be seen to advantage in the best society of the neighbourhood.\nThis fell in perfectly with Gwendolen's own wishes. But let no one suppose that she also contemplated a brilliant marriage as the result of her bewitching grace on horseback. She assumed that she was to be married some time or other, and felt sure that her marriage would not be a mediocre one, such as most girls were contented with. But her thoughts never dwelt on marriage; the dramas in which she imagined herself a heroine did not end that way. To be hopelessly sighed for as a bride was indeed an agreeable sign of womanly power; but to become a wife and wear domestic fetters was an unpleasant necessity. She thought of marriage as a dreary state in which a woman could not do what she liked, had more children than she wished, and was dull and humdrum.\nOf course marriage was social promotion; she could not look forward to a single life; but Gwendolen meant to lead. For such passions dwell in feminine breasts as well as men's. In Gwendolen's, however, they dwelt among strictly feminine furniture, and had nothing to do with learning or politics. She meant to do what was pleasant to herself in a striking manner; or rather, to strike others with admiration and get in that reflected way a more ardent sense of living.\n\"Gwendolen will not rest without having the world at her feet,\" said Miss Merry, the governess: words often used in exaggeration. And words could hardly be too vague to indicate the hazy prospects facing poor Gwendolen on the heights of her young self-exultation. Other people allowed themselves to be made slaves of, and to have their lives blown hither and thither like empty ships. It was not to be so with her; she would not be sacrificed to creatures worth less than herself, but would make the very best of the chances that life offered her, and conquer circumstances by her exceptional cleverness.\nCertainly, to be settled at Offendene, with the archery club and dinner invitations at the Arrowpoints' as the highest lights in her scenery, was not a position that seemed to offer remarkable chances; but Gwendolen had confidence in herself. She felt well equipped for the mastery of life. Although she had suffered disadvantages, she felt that these did not include her education. In the school-room she had quickly picked up enough rules and facts to save her from feeling ignorant; and as for other knowledge, she thought herself sufficiently acquainted with it through novels, plays and poems. About her French and music, she felt no ground for uneasiness; and when to all these qualifications we add her sense of capability, which persuaded her that she could form a correct judgment on any subject, who can wonder if Gwendolen felt ready to manage her own destiny?\nThere were many subjects in the world - perhaps most - in which she felt no interest, because they were stupid; for subjects are apt to appear stupid to the young as light seems dim to the old; but she would not have felt at all helpless if they had turned up in conversation. It must be remembered that no one had disputed her superiority. The first thought of those at Offendene was always, what will Gwendolen think? If the wood smoked in the bedroom fireplace, Mrs. Davilow, whose own weak eyes suffered much from it, apologised to her daughter. If Gwendolen did not appear at the breakfast table till everyone else had finished, the only question was how her coffee and toast should be kept hot and crisp; and when she appeared with her freshly-brushed hair streaming backward and awaiting her mamma's hand to coil it up, it was always she herself who had to be tolerant - to beg that Alice would not stick up her shoulders in that frightful manner, and that Isabel, instead of asking questions, would go away.\nAlways she was the princess in exile, who was to have the best of everything. Why was this? The answer may seem to lie in her beauty, in the decision of will which made itself felt in her graceful movements and clear unhesitating tones. This potent charm, added to the fact that she was the eldest daughter, toward whom her mamma felt apologetic for the evils brought on her by a step-father, may seem sufficient reason for Gwendolen's domestic empire.\nBut I have seen the same attention given to persons who were not at all beautiful, whose firmness showed itself without grace, and who were not eldest daughters with a tender, timid mother. Some of them were very common sort of men. The only point of resemblance among them all was a strong determination to have what was pleasant, with a total fearlessness in making themselves disagreeable or dangerous when they did not get it. Even without her powerful charm, Gwendolen might still have played the queen in exile, with her energy of egoistic desire, and her power of inspiring fear as to what she might say or do.\nHowever, she had the charm, and those who feared her were also fond of her; the fear and the fondness being both heightened by what may be called the iridescence of her character, and its contrary nature.",
        "paragraph_chars": [
            [
                0,
                570
            ],
            [
                570,
                1331
            ],
            [
                1331,
                1800
            ],
            [
                1800,
                2405
            ],
            [
                2405,
                3277
            ],
            [
                3277,
                4293
            ],
            [
                4293,
                4746
            ],
            [
                4746,
                5364
            ],
            [
                5364,
                5568
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                206
            ],
            [
                206,
                277
            ],
            [
                277,
                461
            ],
            [
                461,
                570
            ],
            [
                570,
                622
            ],
            [
                622,
                745
            ],
            [
                745,
                905
            ],
            [
                905,
                1020
            ],
            [
                1020,
                1182
            ],
            [
                1182,
                1331
            ],
            [
                1331,
                1446
            ],
            [
                1446,
                1508
            ],
            [
                1508,
                1628
            ],
            [
                1628,
                1800
            ],
            [
                1800,
                1930
            ],
            [
                1930,
                2064
            ],
            [
                2064,
                2185
            ],
            [
                2185,
                2405
            ],
            [
                2405,
                2648
            ],
            [
                2648,
                2696
            ],
            [
                2696,
                2788
            ],
            [
                2788,
                3004
            ],
            [
                3004,
                3277
            ],
            [
                3277,
                3554
            ],
            [
                3554,
                3618
            ],
            [
                3618,
                3697
            ],
            [
                3697,
                3827
            ],
            [
                3827,
                4293
            ],
            [
                4293,
                4371
            ],
            [
                4371,
                4385
            ],
            [
                4385,
                4530
            ],
            [
                4530,
                4746
            ],
            [
                4746,
                4936
            ],
            [
                4936,
                4979
            ],
            [
                4979,
                5177
            ],
            [
                5177,
                5364
            ],
            [
                5364,
                5568
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                73,
                130
            ],
            [
                130,
                204
            ],
            [
                204,
                206
            ],
            [
                206,
                219
            ],
            [
                221,
                277
            ],
            [
                277,
                290
            ],
            [
                290,
                291
            ],
            [
                298,
                299
            ],
            [
                300,
                308
            ],
            [
                314,
                343
            ],
            [
                344,
                354
            ],
            [
                357,
                461
            ],
            [
                461,
                554
            ],
            [
                568,
                570
            ],
            [
                575,
                622
            ],
            [
                622,
                699
            ],
            [
                707,
                713
            ],
            [
                725,
                743
            ],
            [
                743,
                745
            ],
            [
                745,
                748
            ],
            [
                757,
                802
            ],
            [
                802,
                803
            ],
            [
                804,
                807
            ],
            [
                808,
                812
            ],
            [
                813,
                817
            ],
            [
                818,
                848
            ],
            [
                849,
                850
            ],
            [
                863,
                903
            ],
            [
                903,
                905
            ],
            [
                905,
                945
            ],
            [
                945,
                997
            ],
            [
                1002,
                1005
            ],
            [
                1010,
                1014
            ],
            [
                1018,
                1020
            ],
            [
                1020,
                1025
            ],
            [
                1026,
                1072
            ],
            [
                1073,
                1082
            ],
            [
                1088,
                1135
            ],
            [
                1136,
                1152
            ],
            [
                1153,
                1156
            ],
            [
                1171,
                1182
            ],
            [
                1194,
                1196
            ],
            [
                1209,
                1292
            ],
            [
                1303,
                1308
            ],
            [
                1309,
                1312
            ],
            [
                1313,
                1317
            ],
            [
                1322,
                1330
            ],
            [
                1331,
                1420
            ],
            [
                1431,
                1446
            ],
            [
                1446,
                1489
            ],
            [
                1506,
                1508
            ],
            [
                1508,
                1586
            ],
            [
                1595,
                1597
            ],
            [
                1601,
                1605
            ],
            [
                1606,
                1617
            ],
            [
                1626,
                1628
            ],
            [
                1628,
                1705
            ],
            [
                1706,
                1798
            ],
            [
                1798,
                1800
            ],
            [
                1800,
                1884
            ],
            [
                1885,
                1895
            ],
            [
                1896,
                1901
            ],
            [
                1913,
                1915
            ],
            [
                1930,
                1959
            ],
            [
                1960,
                1981
            ],
            [
                1982,
                1986
            ],
            [
                2004,
                2064
            ],
            [
                2064,
                2183
            ],
            [
                2183,
                2185
            ],
            [
                2185,
                2224
            ],
            [
                2229,
                2404
            ],
            [
                2405,
                2452
            ],
            [
                2453,
                2465
            ],
            [
                2466,
                2469
            ],
            [
                2477,
                2488
            ],
            [
                2492,
                2507
            ],
            [
                2509,
                2620
            ],
            [
                2625,
                2635
            ],
            [
                2636,
                2648
            ],
            [
                2648,
                2696
            ],
            [
                2705,
                2708
            ],
            [
                2709,
                2712
            ],
            [
                2722,
                2735
            ],
            [
                2735,
                2740
            ],
            [
                2746,
                2750
            ],
            [
                2773,
                2776
            ],
            [
                2777,
                2786
            ],
            [
                2786,
                2788
            ],
            [
                2788,
                2806
            ],
            [
                2811,
                2814
            ],
            [
                2840,
                2849
            ],
            [
                2850,
                2855
            ],
            [
                2864,
                2867
            ],
            [
                2868,
                2872
            ],
            [
                2889,
                2894
            ],
            [
                2917,
                2922
            ],
            [
                2939,
                2967
            ],
            [
                2971,
                3004
            ],
            [
                3004,
                3030
            ],
            [
                3030,
                3103
            ],
            [
                3104,
                3110
            ],
            [
                3115,
                3134
            ],
            [
                3134,
                3135
            ],
            [
                3156,
                3160
            ],
            [
                3176,
                3197
            ],
            [
                3198,
                3209
            ],
            [
                3209,
                3277
            ],
            [
                3277,
                3314
            ],
            [
                3317,
                3324
            ],
            [
                3332,
                3454
            ],
            [
                3459,
                3514
            ],
            [
                3515,
                3554
            ],
            [
                3554,
                3604
            ],
            [
                3605,
                3618
            ],
            [
                3618,
                3644
            ],
            [
                3645,
                3657
            ],
            [
                3658,
                3661
            ],
            [
                3662,
                3668
            ],
            [
                3668,
                3696
            ],
            [
                3697,
                3794
            ],
            [
                3795,
                3797
            ],
            [
                3797,
                3798
            ],
            [
                3810,
                3812
            ],
            [
                3813,
                3816
            ],
            [
                3825,
                3827
            ],
            [
                3827,
                3829
            ],
            [
                3830,
                3839
            ],
            [
                3840,
                3882
            ],
            [
                3892,
                3932
            ],
            [
                3933,
                3936
            ],
            [
                3937,
                3940
            ],
            [
                3941,
                3964
            ],
            [
                3965,
                3967
            ],
            [
                3977,
                3986
            ],
            [
                3986,
                4034
            ],
            [
                4035,
                4103
            ],
            [
                4104,
                4152
            ],
            [
                4153,
                4154
            ],
            [
                4155,
                4172
            ],
            [
                4173,
                4259
            ],
            [
                4260,
                4291
            ],
            [
                4291,
                4293
            ],
            [
                4293,
                4334
            ],
            [
                4335,
                4346
            ],
            [
                4347,
                4350
            ],
            [
                4356,
                4358
            ],
            [
                4369,
                4371
            ],
            [
                4375,
                4383
            ],
            [
                4383,
                4385
            ],
            [
                4385,
                4411
            ],
            [
                4412,
                4426
            ],
            [
                4427,
                4429
            ],
            [
                4430,
                4433
            ],
            [
                4434,
                4528
            ],
            [
                4528,
                4530
            ],
            [
                4530,
                4622
            ],
            [
                4628,
                4638
            ],
            [
                4639,
                4694
            ],
            [
                4706,
                4744
            ],
            [
                4744,
                4745
            ],
            [
                4746,
                4749
            ],
            [
                4750,
                4751
            ],
            [
                4757,
                4770
            ],
            [
                4771,
                4780
            ],
            [
                4787,
                4827
            ],
            [
                4827,
                4857
            ],
            [
                4858,
                4865
            ],
            [
                4871,
                4934
            ],
            [
                4934,
                4936
            ],
            [
                4936,
                4953
            ],
            [
                4954,
                4979
            ],
            [
                4979,
                5177
            ],
            [
                5177,
                5193
            ],
            [
                5203,
                5208
            ],
            [
                5210,
                5225
            ],
            [
                5226,
                5263
            ],
            [
                5269,
                5272
            ],
            [
                5273,
                5363
            ],
            [
                5364,
                5471
            ],
            [
                5472,
                5542
            ],
            [
                5542,
                5543
            ],
            [
                5552,
                5560
            ],
            [
                5567,
                5568
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                130
            ],
            [
                130,
                206
            ],
            [
                206,
                277
            ],
            [
                277,
                277
            ],
            [
                277,
                461
            ],
            [
                461,
                570
            ],
            [
                570,
                622
            ],
            [
                622,
                745
            ],
            [
                745,
                905
            ],
            [
                905,
                1020
            ],
            [
                1020,
                1182
            ],
            [
                1182,
                1331
            ],
            [
                1331,
                1446
            ],
            [
                1446,
                1508
            ],
            [
                1508,
                1628
            ],
            [
                1628,
                1800
            ],
            [
                1800,
                1930
            ],
            [
                1930,
                2064
            ],
            [
                2064,
                2185
            ],
            [
                2185,
                2405
            ],
            [
                2405,
                2648
            ],
            [
                2648,
                2696
            ],
            [
                2696,
                2788
            ],
            [
                2788,
                3004
            ],
            [
                3004,
                3277
            ],
            [
                3277,
                3554
            ],
            [
                3554,
                3618
            ],
            [
                3618,
                3827
            ],
            [
                3827,
                4293
            ],
            [
                4293,
                4371
            ],
            [
                4371,
                4385
            ],
            [
                4385,
                4530
            ],
            [
                4530,
                4746
            ],
            [
                4746,
                4936
            ],
            [
                4936,
                4979
            ],
            [
                4979,
                5177
            ],
            [
                5177,
                5177
            ],
            [
                5177,
                5364
            ],
            [
                5364,
                5568
            ],
            [
                5568,
                5568
            ],
            [
                5568,
                5568
            ]
        ]
    }
}