{
    "original": {
        "text": "\"A wild dedication of yourselves To unpath'd waters, undreamed shores.\" --SHAKESPEARE.\nOn the day when Gwendolen Harleth was married and became Mrs. Grandcourt, the morning was clear and bright, and while the sun was low a slight frost crisped the leaves. The bridal party was worth seeing, and half Pennicote turned out to see it, lining the pathway up to the church. An old friend of the rector's performed the marriage ceremony, the rector himself acting as father, to the great advantage of the procession. Only two faces, it was remarked, showed signs of sadness--Mrs. Davilow's and Anna's. The mother's delicate eyelids were pink, as if she had been crying half the night; and no one was surprised that, splendid as the match was, she should feel the parting from a daughter who was the flower of her children and of her own life. It was less understood why Anna should be troubled when she was being so well set off by the bridesmaid's dress. Every one else seemed to reflect the brilliancy of the occasion--the bride most of all. Of her it was agreed that as to figure and carriage she was worthy to be a \"lady o' title\": as to face, perhaps it might be thought that a title required something more rosy; but the bridegroom himself not being fresh-colored--being indeed, as the miller's wife observed, very much of her own husband's complexion--the match was the more complete. Anyhow he must be very fond of her; and it was to be hoped that he would never cast it up to her that she had been going out to service as a governess, and her mother to live at Sawyer's Cottage--vicissitudes which had been much spoken of in the village. The miller's daughter of fourteen could not believe that high gentry behaved badly to their wives, but her mother instructed her--\"Oh, child, men's men: gentle or simple, they're much of a muchness. I've heard my mother say Squire Pelton used to take his dogs and a long whip into his wife's room, and flog 'em there to frighten her; and my mother was lady's-maid there at the very time.\"\n\"That's unlucky talk for a wedding, Mrs. Girdle,\" said the tailor. \"A quarrel may end wi' the whip, but it begins wi' the tongue, and it's the women have got the most o' that.\"\n\"The Lord gave it 'em to use, I suppose,\" said Mrs. Girdle. \"_He_ never meant you to have it all your own way.\"\n\"By what I can make out from the gentleman as attends to the grooming at Offendene,\" said the tailor, \"this Mr. Grandcourt has wonderful little tongue. Everything must be done dummy-like without his ordering.\"\n\"Then he's the more whip, I doubt,\" said Mrs. Girdle. \"_She's_ got tongue enough, I warrant her. See, there they come out together!\"\n\"What wonderful long corners she's got to her eyes!\" said the tailor. \"She makes you feel comical when she looks at you.\"\nGwendolen, in fact, never showed more elasticity in her bearing, more lustre in her long brown glance: she had the brilliancy of strong excitement, which will sometimes come even from pain. It was not pain, however, that she was feeling: she had wrought herself up to much the same condition as that in which she stood at the gambling-table when Deronda was looking at her, and she began to lose. There was an enjoyment in it: whatever uneasiness a growing conscience had created was disregarded as an ailment might have been, amidst the gratification of that ambitious vanity and desire for luxury within her which it would take a great deal of slow poisoning to kill. This morning she could not have said truly that she repented her acceptance of Grandcourt, or that any fears in hazy perspective could hinder the glowing effect of the immediate scene in which she was the central object. That she was doing something wrong--that a punishment might be hanging over her--that the woman to whom she had given a promise and broken it, was thinking of her in bitterness and misery with a just reproach--that Deronda with his way of looking into things very likely despised her for marrying Grandcourt, as he had despised her for gambling--above all, that the cord which united her with this lover and which she had heretofore held by the hand, was now being flung over her neck,--all this yeasty mingling of dimly understood facts with vague but deep impressions, and with images half real, half fantastic, had been disturbing her during the weeks of her engagement. Was that agitating experience nullified this morning? No: it was surmounted and thrust down with a sort of exulting defiance as she felt herself standing at the game of life with many eyes upon her, daring everything to win much--or if to lose, still with _clat_ and a sense of importance. But this morning a losing destiny for herself did not press upon her as a fear: she thought that she was entering on a fuller power of managing circumstances--with all the official strength of marriage, which some women made so poor a use of. That intoxication of youthful egoism out of which she had been shaken by trouble, humiliation, and a new sense of culpability, had returned upon her under a newly-fed strength of the old fumes. She did not in the least present the ideal of the tearful, tremulous bride. Poor Gwendolen, whom some had judged much too forward and instructed in the world's ways!--with her erect head and elastic footstep she was walking among illusions; and yet, too, there was an under-consciousness of her that she was a little intoxicated.\n\"Thank God you bear it so well, my darling!\" said Mrs. Davilow, when she had helped Gwendolen to doff her bridal white and put on her traveling dress. All the trembling had been done by the poor mother, and her agitation urged Gwendolen doubly to take the morning as if it were a triumph.\n\"Why, you might have said that, if I had been going to Mrs. Mompert's, you dear, sad, incorrigible mamma!\" said Gwendolen just putting her hands to her mother's cheeks with laughing tenderness--then retreating a little and spreading out her arms as if to exhibit herself: \"Here am I--Mrs. Grandcourt! what else would you have me, but what I am sure to be? You know you were ready to die with vexation when you thought that I would not be Mrs. Grandcourt.\"\n\"Hush, hush, my child, for heaven's sake!\" said Mrs. Davilow, almost in a whisper. \"How can I help feeling it when I am parting from you. But I can bear anything gladly if you are happy.\"\n\"Not gladly, mamma, no!\" said Gwendolen, shaking her head, with a bright smile. \"Willingly you would bear it, but always sorrowfully. Sorrowing is your sauce; you can take nothing without it.\" Then, clasping her mother's shoulders and raining kisses first on one cheek and then on the other between her words, she said, gaily, \"And you shall sorrow over my having everything at my beck---and enjoying everything glorious--splendid houses--and horses--and diamonds, I shall have diamonds--and going to court--and being Lady Certainly--and Lady Perhaps--and grand here--and tantivy there--and always loving you better than anybody else in the world.\"\n\"My sweet child!--But I shall not be jealous if you love your husband better; and he will expect to be first.\"\nGwendolen thrust out her lips and chin with a pretty grimace, saying, \"Rather a ridiculous expectation. However, I don't mean to treat him ill, unless he deserves it.\"\nThen the two fell into a clinging embrace, and Gwendolen could not hinder a rising sob when she said, \"I wish you were going with me, mamma.\"\nBut the slight dew on her long eyelashes only made her the more charming when she gave her hand to Grandcourt to be led to the carriage.\nThe rector looked in on her to give a final \"Good-bye; God bless you; we shall see you again before long,\" and then returned to Mrs. Davilow, saying half cheerfully, half solemnly,\n\"Let us be thankful, Fanny. She is in a position well suited to her, and beyond what I should have dared to hope for. And few women can have been chosen more entirely for their own sake. You should feel yourself a happy mother.\"\n* * * * *\nThere was a railway journey of some fifty miles before the new husband and wife reached the station near Ryelands. The sky had veiled itself since the morning, and it was hardly more than twilight when they entered the park-gates, but still Gwendolen, looking out of the carriage-window as they drove rapidly along, could see the grand outlines and the nearer beauties of the scene--the long winding drive bordered with evergreens backed by huge gray stems: then the opening of wide grassy spaces and undulations studded with dark clumps; till at last came a wide level where the white house could be seen, with a hanging wood for a back-ground, and the rising and sinking balustrade of a terrace in front.\nGwendolen had been at her liveliest during the journey, chatting incessantly, ignoring any change in their mutual position since yesterday; and Grandcourt had been rather ecstatically quiescent, while she turned his gentle seizure of her hand into a grasp of his hand by both hers, with an increased vivacity as of a kitten that will not sit quiet to be petted. She was really getting somewhat febrile in her excitement; and now in this drive through the park her usual susceptibility to changes of light and scenery helped to make her heart palpitate newly. Was it at the novelty simply, or the almost incredible fulfilment about to be given to her girlish dreams of being \"somebody\"--walking through her own furlong of corridor and under her own ceilings of an out-of-sight loftiness, where her own painted Spring was shedding painted flowers, and her own fore-shortened Zephyrs were blowing their trumpets over her; while her own servants, lackeys in clothing but men in bulk and shape, were as nought in her presence, and revered the propriety of her insolence to them:--being in short the heroine of an admired play without the pains of art? Was it alone the closeness of this fulfilment which made her heart flutter? or was it some dim forecast, the insistent penetration of suppressed experience, mixing the expectation of a triumph with the dread of a crisis? Hers was one of the natures in which exultation inevitably carries an infusion of dread ready to curdle and declare itself.\nShe fell silent in spite of herself as they approached the gates, and when her husband said, \"Here we are at home!\" and for the first time kissed her on the lips, she hardly knew of it: it was no more than the passive acceptance of a greeting in the midst of an absorbing show. Was not all her hurrying life of the last three months a show, in which her consciousness was a wondering spectator? After the half-willful excitement of the day, a numbness had come over her personality.\nBut there was a brilliant light in the hall--warmth, matting, carpets, full-length portraits, Olympian statues, assiduous servants. Not many servants, however: only a few from Diplow in addition to those constantly in charge of the house; and Gwendolen's new maid, who had come with her, was taken under guidance by the housekeeper. Gwendolen felt herself being led by Grandcourt along a subtly-scented corridor, into an ante-room where she saw an open doorway sending out a rich glow of light and color.\n\"These are our dens,\" said Grandcourt. \"You will like to be quiet here till dinner. We shall dine early.\"\nHe pressed her hand to his lips and moved away, more in love than he had ever expected to be.\nGwendolen, yielded up her hat and mantle, threw herself into a chair by the glowing hearth, and saw herself repeated in glass panels with all her faint-green satin surroundings. The housekeeper had passed into this boudoir from the adjoining dressing-room and seemed disposed to linger, Gwendolen thought, in order to look at the new mistress of Ryelands, who, however, being impatient for solitude said to her, \"Will you tell Hudson when she has put out my dress to leave everything? I shall not want her again, unless I ring.\"\nThe housekeeper, coming forward, said, \"Here is a packet, madam, which I was ordered to give into nobody's hands but yours, when you were alone. The person who brought it said it was a present particularly ordered by Mr. Grandcourt; but he was not to know of its arrival till he saw you wear it. Excuse me, madam; I felt it right to obey orders.\"\nGwendolen took the packet and let it lie on her lap till she heard the doors close. It came into her mind that the packet might contain the diamonds which Grandcourt had spoken of as being deposited somewhere and to be given to her on her marriage. In this moment of confused feeling and creeping luxurious languor she was glad of this diversion--glad of such an event as having her own diamonds to try on.\nWithin all the sealed paper coverings was a box, but within the box there _was_ a jewel-case; and now she felt no doubt that she had the diamonds. But on opening the case, in the same instant that she saw them gleam she saw a letter lying above them. She knew the handwriting of the address. It was as if an adder had lain on them. Her heart gave a leap which seemed to have spent all her strength; and as she opened the bit of thin paper, it shook with the trembling of her hands. But it was legible as print, and thrust its words upon her.\nThese diamonds, which were once given with ardent love to Lydia Glasher, she passes on to you. You have broken your word to her, that you might possess what was hers. Perhaps you think of being happy, as she once was, and of having beautiful children such as hers, who will thrust hers aside. God is too just for that. The man you have married has a withered heart. His best young love was mine: you could not take that from me when you took the rest. It is dead: but I am the grave in which your chance of happiness is buried as well as mine. You had your warning. You have chosen to injure me and my children. He had meant to marry me. He would have married me at last, if you had not broken your word. You will have your punishment. I desire it with all my soul.\nWill you give him this letter to set him against me and ruin us more--me and my children? Shall you like to stand before your husband with these diamonds on you, and these words of mine in his thoughts and yours? Will he think you have any right to complain when he has made you miserable? You took him with your eyes open. The willing wrong you have done me will be your curse.\nIt seemed at first as if Gwendolen's eyes were spell-bound in reading the horrible words of the letter over and over again as a doom of penance; but suddenly a new spasm of terror made her lean forward and stretch out the paper toward the fire, lest accusation and proof at once should meet all eyes. It flew like a feather from her trembling fingers and was caught up in a great draught of flame. In her movement the casket fell on the floor and the diamonds rolled out. She took no notice, but fell back in her chair again helpless. She could not see the reflections of herself then; they were like so many women petrified white; but coming near herself you might have seen the tremor in her lips and hands. She sat so for a long while, knowing little more than that she was feeling ill, and that those written words kept repeating themselves to her.\nTruly here were poisoned gems, and the poison had entered into this poor young creature.\nAfter that long while, there was a tap at the door and Grandcourt entered, dressed for dinner. The sight of him brought a new nervous shock, and Gwendolen screamed again and again with hysterical violence. He had expected to see her dressed and smiling, ready to be led down. He saw her pallid, shrieking as it seemed with terror, the jewels scattered around her on the floor. Was it a fit of madness?\nIn some form or other the furies had crossed his threshold.",
        "paragraph_chars": [
            [
                0,
                87
            ],
            [
                87,
                2030
            ],
            [
                2030,
                2207
            ],
            [
                2207,
                2319
            ],
            [
                2319,
                2529
            ],
            [
                2529,
                2662
            ],
            [
                2662,
                2784
            ],
            [
                2784,
                5406
            ],
            [
                5406,
                5695
            ],
            [
                5695,
                6151
            ],
            [
                6151,
                6339
            ],
            [
                6339,
                6988
            ],
            [
                6988,
                7099
            ],
            [
                7099,
                7267
            ],
            [
                7267,
                7409
            ],
            [
                7409,
                7546
            ],
            [
                7546,
                7727
            ],
            [
                7727,
                7956
            ],
            [
                7956,
                7966
            ],
            [
                7966,
                8673
            ],
            [
                8673,
                10165
            ],
            [
                10165,
                10648
            ],
            [
                10648,
                11153
            ],
            [
                11153,
                11259
            ],
            [
                11259,
                11353
            ],
            [
                11353,
                11882
            ],
            [
                11882,
                12229
            ],
            [
                12229,
                12636
            ],
            [
                12636,
                13178
            ],
            [
                13178,
                13944
            ],
            [
                13944,
                14323
            ],
            [
                14323,
                15176
            ],
            [
                15176,
                15265
            ],
            [
                15265,
                15667
            ],
            [
                15667,
                15726
            ]
        ],
        "segment_chars": [
            [
                0,
                72
            ],
            [
                72,
                87
            ],
            [
                87,
                256
            ],
            [
                256,
                369
            ],
            [
                369,
                511
            ],
            [
                511,
                596
            ],
            [
                596,
                837
            ],
            [
                837,
                950
            ],
            [
                950,
                1038
            ],
            [
                1038,
                1386
            ],
            [
                1386,
                1641
            ],
            [
                1641,
                1840
            ],
            [
                1840,
                2030
            ],
            [
                2030,
                2097
            ],
            [
                2097,
                2207
            ],
            [
                2207,
                2267
            ],
            [
                2267,
                2319
            ],
            [
                2319,
                2471
            ],
            [
                2471,
                2529
            ],
            [
                2529,
                2583
            ],
            [
                2583,
                2626
            ],
            [
                2626,
                2662
            ],
            [
                2662,
                2715
            ],
            [
                2715,
                2732
            ],
            [
                2732,
                2784
            ],
            [
                2784,
                2974
            ],
            [
                2974,
                3181
            ],
            [
                3181,
                3454
            ],
            [
                3454,
                3675
            ],
            [
                3675,
                4349
            ],
            [
                4349,
                4403
            ],
            [
                4403,
                4639
            ],
            [
                4639,
                4882
            ],
            [
                4882,
                5076
            ],
            [
                5076,
                5152
            ],
            [
                5152,
                5406
            ],
            [
                5406,
                5451
            ],
            [
                5451,
                5557
            ],
            [
                5557,
                5695
            ],
            [
                5695,
                5802
            ],
            [
                5802,
                5996
            ],
            [
                5996,
                6051
            ],
            [
                6051,
                6151
            ],
            [
                6151,
                6194
            ],
            [
                6194,
                6234
            ],
            [
                6234,
                6289
            ],
            [
                6289,
                6339
            ],
            [
                6339,
                6364
            ],
            [
                6364,
                6419
            ],
            [
                6419,
                6473
            ],
            [
                6473,
                6532
            ],
            [
                6532,
                6988
            ],
            [
                6988,
                7099
            ],
            [
                7099,
                7203
            ],
            [
                7203,
                7267
            ],
            [
                7267,
                7409
            ],
            [
                7409,
                7546
            ],
            [
                7546,
                7727
            ],
            [
                7727,
                7755
            ],
            [
                7755,
                7845
            ],
            [
                7845,
                7914
            ],
            [
                7914,
                7956
            ],
            [
                7956,
                7966
            ],
            [
                7966,
                8081
            ],
            [
                8081,
                8673
            ],
            [
                8673,
                9035
            ],
            [
                9035,
                9232
            ],
            [
                9232,
                9820
            ],
            [
                9820,
                9896
            ],
            [
                9896,
                10041
            ],
            [
                10041,
                10165
            ],
            [
                10165,
                10281
            ],
            [
                10281,
                10443
            ],
            [
                10443,
                10560
            ],
            [
                10560,
                10648
            ],
            [
                10648,
                10780
            ],
            [
                10780,
                10981
            ],
            [
                10981,
                11153
            ],
            [
                11153,
                11192
            ],
            [
                11192,
                11237
            ],
            [
                11237,
                11259
            ],
            [
                11259,
                11353
            ],
            [
                11353,
                11531
            ],
            [
                11531,
                11838
            ],
            [
                11838,
                11882
            ],
            [
                11882,
                12027
            ],
            [
                12027,
                12178
            ],
            [
                12178,
                12229
            ],
            [
                12229,
                12313
            ],
            [
                12313,
                12478
            ],
            [
                12478,
                12636
            ],
            [
                12636,
                12783
            ],
            [
                12783,
                12887
            ],
            [
                12887,
                12928
            ],
            [
                12928,
                12968
            ],
            [
                12968,
                13118
            ],
            [
                13118,
                13178
            ],
            [
                13178,
                13273
            ],
            [
                13273,
                13345
            ],
            [
                13345,
                13471
            ],
            [
                13471,
                13497
            ],
            [
                13497,
                13544
            ],
            [
                13544,
                13630
            ],
            [
                13630,
                13722
            ],
            [
                13722,
                13744
            ],
            [
                13744,
                13790
            ],
            [
                13790,
                13816
            ],
            [
                13816,
                13883
            ],
            [
                13883,
                13914
            ],
            [
                13914,
                13944
            ],
            [
                13944,
                14034
            ],
            [
                14034,
                14157
            ],
            [
                14157,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14323
            ],
            [
                14323,
                14624
            ],
            [
                14624,
                14721
            ],
            [
                14721,
                14795
            ],
            [
                14795,
                14858
            ],
            [
                14858,
                15033
            ],
            [
                15033,
                15176
            ],
            [
                15176,
                15265
            ],
            [
                15265,
                15360
            ],
            [
                15360,
                15471
            ],
            [
                15471,
                15541
            ],
            [
                15541,
                15642
            ],
            [
                15642,
                15667
            ],
            [
                15667,
                15726
            ]
        ],
        "overlap_chars": [
            [
                87,
                97
            ],
            [
                103,
                120
            ],
            [
                125,
                132
            ],
            [
                144,
                145
            ],
            [
                147,
                198
            ],
            [
                221,
                256
            ],
            [
                295,
                327
            ],
            [
                256,
                272
            ],
            [
                330,
                350
            ],
            [
                354,
                369
            ],
            [
                369,
                460
            ],
            [
                472,
                475
            ],
            [
                461,
                467
            ],
            [
                492,
                498
            ],
            [
                509,
                510
            ],
            [
                511,
                525
            ],
            [
                544,
                567
            ],
            [
                569,
                596
            ],
            [
                596,
                815
            ],
            [
                835,
                837
            ],
            [
                837,
                887
            ],
            [
                948,
                950
            ],
            [
                960,
                1013
            ],
            [
                1015,
                1038
            ],
            [
                1045,
                1076
            ],
            [
                1090,
                1149
            ],
            [
                1153,
                1161
            ],
            [
                1175,
                1176
            ],
            [
                1202,
                1211
            ],
            [
                1277,
                1278
            ],
            [
                1213,
                1216
            ],
            [
                1041,
                1044
            ],
            [
                1331,
                1351
            ],
            [
                1384,
                1386
            ],
            [
                1386,
                1536
            ],
            [
                1639,
                1640
            ],
            [
                2784,
                2821
            ],
            [
                2833,
                2839
            ],
            [
                2847,
                2867
            ],
            [
                2885,
                2930
            ],
            [
                2972,
                2974
            ],
            [
                3022,
                3181
            ],
            [
                3181,
                3210
            ],
            [
                3220,
                3230
            ],
            [
                3427,
                3429
            ],
            [
                3390,
                3393
            ],
            [
                3233,
                3251
            ],
            [
                3264,
                3279
            ],
            [
                3309,
                3338
            ],
            [
                3344,
                3382
            ],
            [
                3452,
                3454
            ],
            [
                3454,
                3556
            ],
            [
                3566,
                3570
            ],
            [
                3557,
                3562
            ],
            [
                3596,
                3607
            ],
            [
                3632,
                3674
            ],
            [
                3675,
                3709
            ],
            [
                3711,
                3754
            ],
            [
                3885,
                3897
            ],
            [
                3934,
                4019
            ],
            [
                4021,
                4096
            ],
            [
                4108,
                4159
            ],
            [
                4162,
                4165
            ],
            [
                4190,
                4212
            ],
            [
                3803,
                3806
            ],
            [
                4218,
                4223
            ],
            [
                4233,
                4244
            ],
            [
                4289,
                4349
            ],
            [
                4389,
                4401
            ],
            [
                4353,
                4357
            ],
            [
                4349,
                4352
            ],
            [
                4429,
                4445
            ],
            [
                4456,
                4572
            ],
            [
                4579,
                4593
            ],
            [
                4600,
                4604
            ],
            [
                4606,
                4610
            ],
            [
                4425,
                4428
            ],
            [
                4627,
                4638
            ],
            [
                4639,
                4655
            ],
            [
                4685,
                4692
            ],
            [
                4713,
                4717
            ],
            [
                4656,
                4672
            ],
            [
                4717,
                4796
            ],
            [
                4880,
                4882
            ],
            [
                5061,
                5064
            ],
            [
                4903,
                4982
            ],
            [
                4987,
                5021
            ],
            [
                5027,
                5030
            ],
            [
                5039,
                5057
            ],
            [
                5074,
                5076
            ],
            [
                5076,
                5100
            ],
            [
                5126,
                5152
            ],
            [
                5243,
                5247
            ],
            [
                5252,
                5283
            ],
            [
                5166,
                5167
            ],
            [
                5284,
                5330
            ],
            [
                5337,
                5340
            ],
            [
                5350,
                5359
            ],
            [
                5371,
                5406
            ],
            [
                5406,
                5451
            ],
            [
                5451,
                5478
            ],
            [
                5483,
                5539
            ],
            [
                5550,
                5556
            ],
            [
                5695,
                5780
            ],
            [
                5794,
                5802
            ],
            [
                5802,
                5816
            ],
            [
                5822,
                5887
            ],
            [
                5967,
                5977
            ],
            [
                5979,
                5996
            ],
            [
                5996,
                6023
            ],
            [
                6049,
                6051
            ],
            [
                6060,
                6151
            ],
            [
                6151,
                6152
            ],
            [
                6158,
                6194
            ],
            [
                6194,
                6211
            ],
            [
                6232,
                6234
            ],
            [
                6234,
                6287
            ],
            [
                6289,
                6339
            ],
            [
                6339,
                6364
            ],
            [
                6364,
                6397
            ],
            [
                6417,
                6419
            ],
            [
                6419,
                6473
            ],
            [
                6473,
                6532
            ],
            [
                6532,
                6537
            ],
            [
                6547,
                6550
            ],
            [
                6647,
                6713
            ],
            [
                6751,
                6759
            ],
            [
                6770,
                6776
            ],
            [
                6782,
                6788
            ],
            [
                6790,
                6825
            ],
            [
                6847,
                6861
            ],
            [
                6882,
                6889
            ],
            [
                6891,
                6905
            ],
            [
                6907,
                6924
            ],
            [
                6926,
                6988
            ],
            [
                6988,
                7003
            ],
            [
                7006,
                7099
            ],
            [
                7099,
                7203
            ],
            [
                7203,
                7267
            ],
            [
                7267,
                7409
            ],
            [
                7409,
                7546
            ],
            [
                7956,
                7966
            ],
            [
                7966,
                8081
            ],
            [
                8130,
                8252
            ],
            [
                8280,
                8310
            ],
            [
                8335,
                8347
            ],
            [
                8603,
                8604
            ],
            [
                8349,
                8396
            ],
            [
                8422,
                8462
            ],
            [
                8503,
                8517
            ],
            [
                8542,
                8557
            ],
            [
                8571,
                8579
            ],
            [
                8588,
                8598
            ],
            [
                8124,
                8129
            ],
            [
                8653,
                8673
            ],
            [
                8673,
                8779
            ],
            [
                8787,
                8954
            ],
            [
                8973,
                8976
            ],
            [
                8982,
                8984
            ],
            [
                8988,
                9034
            ],
            [
                9035,
                9049
            ],
            [
                9058,
                9066
            ],
            [
                9075,
                9136
            ],
            [
                9209,
                9219
            ],
            [
                9225,
                9232
            ],
            [
                9232,
                9253
            ],
            [
                9260,
                9357
            ],
            [
                9439,
                9440
            ],
            [
                9359,
                9402
            ],
            [
                9458,
                9459
            ],
            [
                9592,
                9601
            ],
            [
                9606,
                9614
            ],
            [
                9663,
                9693
            ],
            [
                9442,
                9443
            ],
            [
                9748,
                9820
            ],
            [
                9820,
                9826
            ],
            [
                9833,
                9896
            ],
            [
                9896,
                9976
            ],
            [
                10018,
                10040
            ],
            [
                10165,
                10180
            ],
            [
                10201,
                10281
            ],
            [
                10281,
                10443
            ],
            [
                10443,
                10560
            ],
            [
                10560,
                10569
            ],
            [
                10583,
                10634
            ],
            [
                10646,
                10648
            ],
            [
                10648,
                10691
            ],
            [
                10708,
                10780
            ],
            [
                10780,
                10807
            ],
            [
                10887,
                10981
            ],
            [
                10981,
                10990
            ],
            [
                11010,
                11145
            ],
            [
                11151,
                11153
            ],
            [
                11153,
                11192
            ],
            [
                11192,
                11237
            ],
            [
                11237,
                11259
            ],
            [
                11259,
                11353
            ],
            [
                11353,
                11362
            ],
            [
                11375,
                11386
            ],
            [
                11393,
                11530
            ],
            [
                11531,
                11550
            ],
            [
                11609,
                11638
            ],
            [
                11576,
                11580
            ],
            [
                11638,
                11658
            ],
            [
                11792,
                11795
            ],
            [
                11752,
                11756
            ],
            [
                11763,
                11786
            ],
            [
                11838,
                11879
            ],
            [
                11899,
                11914
            ],
            [
                11882,
                11897
            ],
            [
                11915,
                12027
            ],
            [
                12027,
                12178
            ],
            [
                12178,
                12229
            ],
            [
                12229,
                12313
            ],
            [
                12313,
                12398
            ],
            [
                12409,
                12478
            ],
            [
                12478,
                12574
            ],
            [
                12581,
                12583
            ],
            [
                12601,
                12636
            ],
            [
                12636,
                12642
            ],
            [
                12647,
                12683
            ],
            [
                12689,
                12709
            ],
            [
                12711,
                12714
            ],
            [
                12716,
                12783
            ],
            [
                12783,
                12807
            ],
            [
                12852,
                12887
            ],
            [
                12887,
                12911
            ],
            [
                12926,
                12928
            ],
            [
                12928,
                12968
            ],
            [
                12968,
                12989
            ],
            [
                13033,
                13056
            ],
            [
                13069,
                13084
            ],
            [
                13021,
                13024
            ],
            [
                13094,
                13103
            ],
            [
                13111,
                13118
            ],
            [
                13122,
                13124
            ],
            [
                13151,
                13178
            ],
            [
                13184,
                13273
            ],
            [
                13273,
                13306
            ],
            [
                13307,
                13345
            ],
            [
                13345,
                13377
            ],
            [
                13497,
                13544
            ],
            [
                13544,
                13572
            ],
            [
                13628,
                13630
            ],
            [
                13630,
                13704
            ],
            [
                13720,
                13722
            ],
            [
                13722,
                13744
            ],
            [
                13744,
                13790
            ],
            [
                13790,
                13816
            ],
            [
                13816,
                13883
            ],
            [
                13883,
                13914
            ],
            [
                13914,
                13944
            ],
            [
                13944,
                14007
            ],
            [
                14014,
                14034
            ],
            [
                14034,
                14121
            ],
            [
                14130,
                14157
            ],
            [
                14157,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14271
            ],
            [
                14280,
                14321
            ],
            [
                14323,
                14445
            ],
            [
                14466,
                14471
            ],
            [
                14449,
                14450
            ],
            [
                14487,
                14566
            ],
            [
                14622,
                14624
            ],
            [
                14624,
                14721
            ],
            [
                14737,
                14795
            ],
            [
                14795,
                14858
            ],
            [
                15033,
                15176
            ],
            [
                15176,
                15233
            ],
            [
                15239,
                15265
            ],
            [
                15265,
                15360
            ],
            [
                15360,
                15471
            ],
            [
                15471,
                15541
            ],
            [
                15541,
                15642
            ],
            [
                15642,
                15667
            ],
            [
                15667,
                15726
            ]
        ],
        "row_chars": [
            [
                0,
                72
            ],
            [
                72,
                87
            ],
            [
                87,
                256
            ],
            [
                256,
                369
            ],
            [
                369,
                511
            ],
            [
                511,
                596
            ],
            [
                596,
                837
            ],
            [
                837,
                950
            ],
            [
                950,
                1038
            ],
            [
                1038,
                1386
            ],
            [
                1386,
                1641
            ],
            [
                1641,
                1840
            ],
            [
                1840,
                2030
            ],
            [
                2030,
                2097
            ],
            [
                2097,
                2207
            ],
            [
                2207,
                2267
            ],
            [
                2267,
                2319
            ],
            [
                2319,
                2471
            ],
            [
                2471,
                2529
            ],
            [
                2529,
                2583
            ],
            [
                2583,
                2626
            ],
            [
                2626,
                2662
            ],
            [
                2662,
                2715
            ],
            [
                2715,
                2732
            ],
            [
                2732,
                2784
            ],
            [
                2784,
                2974
            ],
            [
                2974,
                3181
            ],
            [
                3181,
                3454
            ],
            [
                3454,
                3675
            ],
            [
                3675,
                4349
            ],
            [
                4349,
                4639
            ],
            [
                4639,
                4882
            ],
            [
                4882,
                5076
            ],
            [
                5076,
                5152
            ],
            [
                5152,
                5406
            ],
            [
                5406,
                5451
            ],
            [
                5451,
                5557
            ],
            [
                5557,
                5695
            ],
            [
                5695,
                5802
            ],
            [
                5802,
                5996
            ],
            [
                5996,
                6051
            ],
            [
                6051,
                6151
            ],
            [
                6151,
                6194
            ],
            [
                6194,
                6234
            ],
            [
                6234,
                6289
            ],
            [
                6289,
                6339
            ],
            [
                6339,
                6364
            ],
            [
                6364,
                6419
            ],
            [
                6419,
                6473
            ],
            [
                6473,
                6532
            ],
            [
                6532,
                6988
            ],
            [
                6988,
                7099
            ],
            [
                7099,
                7203
            ],
            [
                7203,
                7267
            ],
            [
                7267,
                7409
            ],
            [
                7409,
                7546
            ],
            [
                7546,
                7727
            ],
            [
                7727,
                7755
            ],
            [
                7755,
                7845
            ],
            [
                7845,
                7914
            ],
            [
                7914,
                7956
            ],
            [
                7956,
                7966
            ],
            [
                7966,
                8081
            ],
            [
                8081,
                8673
            ],
            [
                8673,
                9035
            ],
            [
                9035,
                9232
            ],
            [
                9232,
                9820
            ],
            [
                9820,
                9896
            ],
            [
                9896,
                10041
            ],
            [
                10041,
                10165
            ],
            [
                10165,
                10281
            ],
            [
                10281,
                10443
            ],
            [
                10443,
                10560
            ],
            [
                10560,
                10648
            ],
            [
                10648,
                10780
            ],
            [
                10780,
                10981
            ],
            [
                10981,
                11153
            ],
            [
                11153,
                11192
            ],
            [
                11192,
                11237
            ],
            [
                11237,
                11259
            ],
            [
                11259,
                11353
            ],
            [
                11353,
                11531
            ],
            [
                11531,
                11882
            ],
            [
                11882,
                12027
            ],
            [
                12027,
                12178
            ],
            [
                12178,
                12229
            ],
            [
                12229,
                12313
            ],
            [
                12313,
                12478
            ],
            [
                12478,
                12636
            ],
            [
                12636,
                12783
            ],
            [
                12783,
                12887
            ],
            [
                12887,
                12928
            ],
            [
                12928,
                12968
            ],
            [
                12968,
                13118
            ],
            [
                13118,
                13178
            ],
            [
                13178,
                13273
            ],
            [
                13273,
                13345
            ],
            [
                13345,
                13544
            ],
            [
                13544,
                13630
            ],
            [
                13630,
                13722
            ],
            [
                13722,
                13744
            ],
            [
                13744,
                13790
            ],
            [
                13790,
                13816
            ],
            [
                13816,
                13883
            ],
            [
                13883,
                13914
            ],
            [
                13914,
                13944
            ],
            [
                13944,
                14034
            ],
            [
                14034,
                14157
            ],
            [
                14157,
                14234
            ],
            [
                14234,
                14268
            ],
            [
                14268,
                14323
            ],
            [
                14323,
                14624
            ],
            [
                14624,
                14721
            ],
            [
                14721,
                14795
            ],
            [
                14795,
                14858
            ],
            [
                14858,
                15033
            ],
            [
                15033,
                15176
            ],
            [
                15176,
                15265
            ],
            [
                15265,
                15360
            ],
            [
                15360,
                15471
            ],
            [
                15471,
                15541
            ],
            [
                15541,
                15642
            ],
            [
                15642,
                15667
            ],
            [
                15667,
                15726
            ]
        ]
    },
    "abridged": {
        "text": "On the day Gwendolen Harleth married Mr. Grandcourt, the morning was clear and bright, and a slight frost crisped the leaves. Half Pennicote turned out to see the bridal party, lining the pathway to the church. An old friend of the rector's performed the marriage ceremony, the rector himself acting as the father of the bride.\nOnly two faces showed signs of sadness - Mrs. Davilow's and Anna's. The mother's delicate eyelids were pink, as if she had been crying half the night; and no one was surprised that, splendid as the match was, she should feel the parting from a daughter who was the flower of her children. It was less understood why Anna should be troubled. Everyone else seemed to reflect the brilliancy of the occasion - the bride most of all. It was agreed that as to figure she was worthy to be a \"lady o' title\": as to face, perhaps she might be a little more rosy, but she matched her husband's complexion. Anyhow he must be very fond of her; and it was to be hoped that he would never cast it up to her that she had been going out to service as a governess.\nGwendolen, in fact, never showed more spring in her step, more lustre in her eyes: she had the brilliancy of strong excitement. She had wrought herself up to much the same condition as that in which she stood at the gambling-table when Deronda was looking at her, and she began to lose. There was an enjoyment in it: the uneasiness of her growing conscience was disregarded, amidst the gratification of her ambitious vanity and desire for luxury. This morning she could not have said truly that she repented her acceptance of Grandcourt, or that any hazy fears marred the glowing scene in which she was the central object.\nThat she was doing something wrong - that a punishment might be hanging over her - that Deronda very likely despised her for marrying Grandcourt, as he had despised her for gambling - above all, that the cord which united her with this lover and which she had until now held by the hand, was now being flung over her neck - all these dimly understood facts and vague impressions had been disturbing her during the weeks of her engagement. But this morning that agitation was thrust down with exulting defiance as she felt herself standing at the game of life with many eyes upon her, daring everything to win - or if to lose, to lose with clat and importance.\nBut this morning she did not fear a losing destiny: she thought that she was entering on a fuller power of managing circumstances. The youthful egoism out of which she had been shaken by trouble, humiliation, and a sense of culpability, had returned to her with newly-fed strength. She did not in the least appear a tearful, tremulous bride. With erect head and elastic footstep, she was walking among illusions; and yet, too, she was conscious that she was a little intoxicated.\n\"Thank God you bear it so well, my darling!\" said Mrs. Davilow, when she helped Gwendolen to doff her bridal white and put on her travelling dress.\n\"Why, you might have said that, if I had been going to Mrs. Mompert's, you dear, sad, mamma!\" said Gwendolen, putting her hands to her mother's cheeks with laughing tenderness. \"Here am I - Mrs. Grandcourt! what else would you have me? You were ready to die with vexation when you thought that I would not be Mrs. Grandcourt.\"\n\"Hush, my child, for heaven's sake!\" said Mrs. Davilow. \"How can I help feeling it when I am parting from you? But I can bear anything gladly if you are happy.\"\n\"Not gladly, mamma, no!\" said Gwendolen, shaking her head, and smiling. \"Willingly you would bear it, but always sorrowfully. Sorrowing is your sauce; you can take nothing without it.\" Then, kissing her, she said, gaily, \"And you shall sorrow over my having everything glorious - splendid houses, horses - and diamonds, I shall have diamonds - and being Lady Perhaps - and grand here - and tantivy there - and always loving you better than anybody else in the world.\"\n\"My sweet child! But I shall not be jealous if you love your husband better; and he will expect to be first.\"\nGwendolen thrust out her lips and chin with a pretty grimace, saying, \"Rather a ridiculous expectation. However, I don't mean to treat him ill, unless he deserves it.\"\nThen the two fell into a clinging embrace, and Gwendolen could not hinder a rising sob when she said, \"I wish you were going with me, mamma.\"\nBut the slight dew on her long eyelashes only made her the more charming when she gave her hand to Grandcourt to be led to the carriage.\n* * * * *\nThere was a railway journey of some fifty miles before the new husband and wife reached the station near Ryelands. It was hardly more than twilight when they entered the park-gates, but still Gwendolen, looking out of the carriage-window, could see the grand outlines of the scene - the long winding drive bordered with evergreens: then the opening of wide grassy spaces; till at last the white house appeared, with a wood for a background, and a terrace in front.\nGwendolen had been at her liveliest during the journey, chatting incessantly, ignoring any change in their position since yesterday; and Grandcourt had been rather ecstatically quiescent, while she turned his gentle seizure of her hand into a grasp of his hand by both hers, vivacious as a kitten that will not sit quiet to be petted.\nShe was really somewhat feverish in her excitement; and now in this drive through the park her heart palpitated newly. Was it at the novelty, or the almost incredible fulfilment about to be given to her girlish dreams of being \"somebody\" - walking through her own furlong of corridor, while her servants were as nought in her presence - being in short the heroine of an admired play without the pains of art? Was it the closeness of this fulfilment which made her heart flutter? or was it some dim forecast, the insistent penetration of suppressed experience, creating the dread of a crisis?\nShe fell silent as they approached the gates, and when her husband said, \"Here we are at home!\" and for the first time kissed her on the lips, she hardly knew of it: it was no more than the passive acceptance of a greeting in the midst of an absorbing show. Was not all her hurrying life of the last three months a show, in which her consciousness was a wondering spectator? After the excitement of the day, a numbness had come over her.\nBut there was a brilliant light in the hall - warmth, carpets, full-length portraits, Olympian statues, assiduous servants. Not many servants, however: and Gwendolen's new maid, who had come with her, was taken under guidance by the housekeeper. Gwendolen was led by Grandcourt along a subtly-scented corridor, into an ante-room where she saw an open doorway sending out a rich glow of light and colour.\n\"These are our dens,\" said Grandcourt. \"You will like to be quiet here till dinner. We shall dine early.\"\nHe pressed her hand to his lips and moved away, more in love than he had ever expected to be.\nGwendolen took off her hat and cloak, threw herself into a chair by the glowing hearth, and saw herself repeated in glass panels with all her faint-green satin surroundings.\nThe housekeeper had entered and seemed disposed to linger; from curiosity, Gwendolen thought, and she said, \"Will you tell Hudson I shall not want her again, unless I ring?\"\nComing forward, the housekeeper said, \"Here is a packet, madam, which I was ordered to give into nobody's hands but yours, when you were alone. The person who brought it said it was a present particularly ordered by Mr. Grandcourt; but he was not to know of its arrival till he saw you wear it. Excuse me, madam; I felt it right to obey orders.\"\nGwendolen took the packet and let it lie on her lap till she heard the doors close. It came into her mind that the packet might contain the diamonds which Grandcourt had mentioned as being deposited somewhere and to be given to her on her marriage. In this moment of confused feeling and creeping luxurious languor she was glad of this diversion, of having her own diamonds to try on.\nWithin the sealed paper coverings was a box: within the box there was a jewel-case; and now she felt no doubt that she had the diamonds. But on opening the case, she saw a letter lying above them. She knew the handwriting. It was as if an adder had lain on them. Her heart gave a leap; and as she opened the paper, it shook in her trembling hands. It thrust its words upon her.\n'These diamonds, which were once given with ardent love to Lydia Glasher, she passes on to you. You have broken your word to her, so that you might possess what was hers. Perhaps you think of being happy; but the man you have married has a withered heart. His best young love was mine. It is dead: but I am the grave in which your chance of happiness is buried. You had your warning. You have chosen to injure me and my children. He had meant to marry me. He would have married me at last, if you had not broken your word. You will have your punishment. I desire it with all my soul.\n'Will you give him this letter to set him against me and ruin us - me and my children? Shall you like to stand before your husband with these diamonds on you, and these words in his thoughts and yours? Will he think you have any right to complain when he has made you miserable? You took him with your eyes open. The wrong you have done me will be your curse.'\nIt seemed at first as if Gwendolen's eyes were spell-bound in reading the horrible words of the letter over and over again; but a sudden spasm of terror made her lean forward and stretch out the paper toward the fire. It flew like a feather from her trembling fingers and was caught up in a great draught of flame. The casket fell on the floor and the diamonds rolled out. She took no notice, but fell back in her chair again helpless. She sat so for a long while, knowing little more than that she was feeling ill, and that those written words kept repeating themselves to her.\nTruly here were poisoned gems, and the poison had entered this poor young creature.\nAfter that long while, there was a tap at the door and Grandcourt entered, dressed for dinner. The sight of him brought a new nervous shock, and Gwendolen screamed again and again with hysterical violence. He had expected to see her dressed and smiling, ready to be led down. He saw her pallid, shrieking as it seemed with terror, the jewels scattered around her on the floor. Was it a fit of madness?\nIn some form or other the Furies had crossed his threshold.",
        "paragraph_chars": [
            [
                0,
                328
            ],
            [
                328,
                1076
            ],
            [
                1076,
                1699
            ],
            [
                1699,
                2359
            ],
            [
                2359,
                2839
            ],
            [
                2839,
                2987
            ],
            [
                2987,
                3314
            ],
            [
                3314,
                3475
            ],
            [
                3475,
                3943
            ],
            [
                3943,
                4053
            ],
            [
                4053,
                4221
            ],
            [
                4221,
                4363
            ],
            [
                4363,
                4500
            ],
            [
                4500,
                4510
            ],
            [
                4510,
                4975
            ],
            [
                4975,
                5310
            ],
            [
                5310,
                5902
            ],
            [
                5902,
                6340
            ],
            [
                6340,
                6744
            ],
            [
                6744,
                6850
            ],
            [
                6850,
                6944
            ],
            [
                6944,
                7118
            ],
            [
                7118,
                7292
            ],
            [
                7292,
                7638
            ],
            [
                7638,
                8023
            ],
            [
                8023,
                8401
            ],
            [
                8401,
                8985
            ],
            [
                8985,
                9346
            ],
            [
                9346,
                9925
            ],
            [
                9925,
                10009
            ],
            [
                10009,
                10411
            ],
            [
                10411,
                10470
            ]
        ],
        "segment_chars": [
            [
                0,
                126
            ],
            [
                126,
                211
            ],
            [
                211,
                328
            ],
            [
                328,
                396
            ],
            [
                396,
                617
            ],
            [
                617,
                669
            ],
            [
                669,
                757
            ],
            [
                757,
                924
            ],
            [
                924,
                1076
            ],
            [
                1076,
                1204
            ],
            [
                1204,
                1363
            ],
            [
                1363,
                1523
            ],
            [
                1523,
                1699
            ],
            [
                1699,
                2138
            ],
            [
                2138,
                2359
            ],
            [
                2359,
                2490
            ],
            [
                2490,
                2641
            ],
            [
                2641,
                2701
            ],
            [
                2701,
                2839
            ],
            [
                2839,
                2884
            ],
            [
                2884,
                2987
            ],
            [
                2987,
                3081
            ],
            [
                3081,
                3164
            ],
            [
                3164,
                3194
            ],
            [
                3194,
                3223
            ],
            [
                3223,
                3314
            ],
            [
                3314,
                3351
            ],
            [
                3351,
                3370
            ],
            [
                3370,
                3425
            ],
            [
                3425,
                3475
            ],
            [
                3475,
                3500
            ],
            [
                3500,
                3547
            ],
            [
                3547,
                3601
            ],
            [
                3601,
                3660
            ],
            [
                3660,
                3943
            ],
            [
                3943,
                3960
            ],
            [
                3960,
                4053
            ],
            [
                4053,
                4157
            ],
            [
                4157,
                4221
            ],
            [
                4221,
                4363
            ],
            [
                4363,
                4500
            ],
            [
                4500,
                4510
            ],
            [
                4510,
                4625
            ],
            [
                4625,
                4975
            ],
            [
                4975,
                5310
            ],
            [
                5310,
                5429
            ],
            [
                5429,
                5719
            ],
            [
                5719,
                5789
            ],
            [
                5789,
                5902
            ],
            [
                5902,
                5998
            ],
            [
                5998,
                6160
            ],
            [
                6160,
                6277
            ],
            [
                6277,
                6340
            ],
            [
                6340,
                6464
            ],
            [
                6464,
                6586
            ],
            [
                6586,
                6744
            ],
            [
                6744,
                6783
            ],
            [
                6783,
                6828
            ],
            [
                6828,
                6850
            ],
            [
                6850,
                6944
            ],
            [
                6944,
                7118
            ],
            [
                7118,
                7292
            ],
            [
                7292,
                7436
            ],
            [
                7436,
                7587
            ],
            [
                7587,
                7638
            ],
            [
                7638,
                7722
            ],
            [
                7722,
                7887
            ],
            [
                7887,
                8023
            ],
            [
                8023,
                8160
            ],
            [
                8160,
                8220
            ],
            [
                8220,
                8246
            ],
            [
                8246,
                8286
            ],
            [
                8286,
                8371
            ],
            [
                8371,
                8401
            ],
            [
                8401,
                8497
            ],
            [
                8497,
                8572
            ],
            [
                8572,
                8657
            ],
            [
                8657,
                8687
            ],
            [
                8687,
                8763
            ],
            [
                8763,
                8785
            ],
            [
                8785,
                8831
            ],
            [
                8831,
                8857
            ],
            [
                8857,
                8924
            ],
            [
                8924,
                8955
            ],
            [
                8955,
                8985
            ],
            [
                8985,
                9072
            ],
            [
                9072,
                9187
            ],
            [
                9187,
                9264
            ],
            [
                9264,
                9298
            ],
            [
                9298,
                9346
            ],
            [
                9346,
                9564
            ],
            [
                9564,
                9661
            ],
            [
                9661,
                9719
            ],
            [
                9719,
                9782
            ],
            [
                9782,
                9925
            ],
            [
                9925,
                10009
            ],
            [
                10009,
                10104
            ],
            [
                10104,
                10215
            ],
            [
                10215,
                10285
            ],
            [
                10285,
                10386
            ],
            [
                10386,
                10411
            ],
            [
                10411,
                10470
            ]
        ],
        "overlap_chars": [
            [
                0,
                10
            ],
            [
                11,
                28
            ],
            [
                29,
                36
            ],
            [
                37,
                38
            ],
            [
                39,
                90
            ],
            [
                91,
                126
            ],
            [
                126,
                158
            ],
            [
                159,
                175
            ],
            [
                175,
                195
            ],
            [
                196,
                211
            ],
            [
                211,
                302
            ],
            [
                303,
                306
            ],
            [
                307,
                313
            ],
            [
                314,
                320
            ],
            [
                326,
                327
            ],
            [
                328,
                342
            ],
            [
                343,
                366
            ],
            [
                369,
                396
            ],
            [
                396,
                615
            ],
            [
                615,
                617
            ],
            [
                617,
                667
            ],
            [
                667,
                669
            ],
            [
                678,
                731
            ],
            [
                734,
                757
            ],
            [
                757,
                788
            ],
            [
                789,
                848
            ],
            [
                853,
                861
            ],
            [
                862,
                863
            ],
            [
                871,
                880
            ],
            [
                880,
                881
            ],
            [
                882,
                885
            ],
            [
                898,
                901
            ],
            [
                902,
                922
            ],
            [
                922,
                924
            ],
            [
                924,
                1074
            ],
            [
                1074,
                1075
            ],
            [
                1076,
                1113
            ],
            [
                1121,
                1127
            ],
            [
                1132,
                1152
            ],
            [
                1157,
                1202
            ],
            [
                1202,
                1204
            ],
            [
                1204,
                1363
            ],
            [
                1363,
                1392
            ],
            [
                1397,
                1407
            ],
            [
                1408,
                1410
            ],
            [
                1411,
                1414
            ],
            [
                1415,
                1433
            ],
            [
                1434,
                1449
            ],
            [
                1449,
                1478
            ],
            [
                1483,
                1521
            ],
            [
                1521,
                1523
            ],
            [
                1523,
                1625
            ],
            [
                1626,
                1630
            ],
            [
                1631,
                1636
            ],
            [
                1644,
                1655
            ],
            [
                1656,
                1698
            ],
            [
                1699,
                1733
            ],
            [
                1736,
                1779
            ],
            [
                1782,
                1794
            ],
            [
                1795,
                1880
            ],
            [
                1883,
                1958
            ],
            [
                1969,
                2020
            ],
            [
                2023,
                2026
            ],
            [
                2033,
                2055
            ],
            [
                2056,
                2059
            ],
            [
                2060,
                2065
            ],
            [
                2066,
                2077
            ],
            [
                2078,
                2138
            ],
            [
                2142,
                2154
            ],
            [
                2155,
                2159
            ],
            [
                2170,
                2173
            ],
            [
                2174,
                2190
            ],
            [
                2191,
                2307
            ],
            [
                2310,
                2324
            ],
            [
                2333,
                2337
            ],
            [
                2338,
                2342
            ],
            [
                2343,
                2346
            ],
            [
                2347,
                2358
            ],
            [
                2359,
                2375
            ],
            [
                2380,
                2387
            ],
            [
                2388,
                2392
            ],
            [
                2393,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2490
            ],
            [
                2490,
                2493
            ],
            [
                2494,
                2573
            ],
            [
                2574,
                2608
            ],
            [
                2612,
                2615
            ],
            [
                2621,
                2639
            ],
            [
                2639,
                2641
            ],
            [
                2641,
                2665
            ],
            [
                2675,
                2701
            ],
            [
                2701,
                2705
            ],
            [
                2706,
                2737
            ],
            [
                2737,
                2738
            ],
            [
                2739,
                2785
            ],
            [
                2790,
                2793
            ],
            [
                2794,
                2803
            ],
            [
                2804,
                2839
            ],
            [
                2839,
                2884
            ],
            [
                2884,
                2911
            ],
            [
                2912,
                2968
            ],
            [
                2980,
                2986
            ],
            [
                2987,
                3072
            ],
            [
                3073,
                3081
            ],
            [
                3081,
                3095
            ],
            [
                3097,
                3162
            ],
            [
                3164,
                3174
            ],
            [
                3177,
                3194
            ],
            [
                3194,
                3221
            ],
            [
                3221,
                3223
            ],
            [
                3223,
                3314
            ],
            [
                3314,
                3315
            ],
            [
                3315,
                3351
            ],
            [
                3351,
                3368
            ],
            [
                3368,
                3370
            ],
            [
                3370,
                3423
            ],
            [
                3425,
                3475
            ],
            [
                3475,
                3500
            ],
            [
                3500,
                3533
            ],
            [
                3545,
                3547
            ],
            [
                3547,
                3601
            ],
            [
                3601,
                3660
            ],
            [
                3660,
                3665
            ],
            [
                3674,
                3677
            ],
            [
                3677,
                3743
            ],
            [
                3744,
                3752
            ],
            [
                3764,
                3770
            ],
            [
                3772,
                3778
            ],
            [
                3781,
                3816
            ],
            [
                3819,
                3833
            ],
            [
                3834,
                3841
            ],
            [
                3844,
                3858
            ],
            [
                3861,
                3878
            ],
            [
                3881,
                3943
            ],
            [
                3943,
                3958
            ],
            [
                3960,
                4053
            ],
            [
                4053,
                4157
            ],
            [
                4157,
                4221
            ],
            [
                4221,
                4363
            ],
            [
                4363,
                4500
            ],
            [
                4500,
                4510
            ],
            [
                4510,
                4625
            ],
            [
                4625,
                4747
            ],
            [
                4747,
                4777
            ],
            [
                4778,
                4790
            ],
            [
                4791,
                4792
            ],
            [
                4793,
                4840
            ],
            [
                4840,
                4880
            ],
            [
                4880,
                4894
            ],
            [
                4895,
                4910
            ],
            [
                4919,
                4927
            ],
            [
                4928,
                4938
            ],
            [
                4949,
                4954
            ],
            [
                4955,
                4975
            ],
            [
                4975,
                5081
            ],
            [
                5082,
                5249
            ],
            [
                5250,
                5253
            ],
            [
                5260,
                5262
            ],
            [
                5263,
                5309
            ],
            [
                5310,
                5324
            ],
            [
                5325,
                5333
            ],
            [
                5343,
                5404
            ],
            [
                5405,
                5415
            ],
            [
                5422,
                5429
            ],
            [
                5429,
                5450
            ],
            [
                5450,
                5547
            ],
            [
                5548,
                5549
            ],
            [
                5550,
                5593
            ],
            [
                5593,
                5594
            ],
            [
                5595,
                5604
            ],
            [
                5605,
                5613
            ],
            [
                5614,
                5644
            ],
            [
                5645,
                5646
            ],
            [
                5647,
                5719
            ],
            [
                5719,
                5725
            ],
            [
                5726,
                5789
            ],
            [
                5789,
                5869
            ],
            [
                5879,
                5901
            ],
            [
                5902,
                5917
            ],
            [
                5918,
                5998
            ],
            [
                5998,
                6160
            ],
            [
                6160,
                6277
            ],
            [
                6277,
                6286
            ],
            [
                6287,
                6338
            ],
            [
                6338,
                6340
            ],
            [
                6340,
                6383
            ],
            [
                6392,
                6464
            ],
            [
                6464,
                6491
            ],
            [
                6492,
                6586
            ],
            [
                6586,
                6595
            ],
            [
                6600,
                6735
            ],
            [
                6742,
                6744
            ],
            [
                6744,
                6783
            ],
            [
                6783,
                6828
            ],
            [
                6828,
                6850
            ],
            [
                6850,
                6944
            ],
            [
                6944,
                6953
            ],
            [
                6963,
                6974
            ],
            [
                6980,
                7117
            ],
            [
                7118,
                7137
            ],
            [
                7146,
                7175
            ],
            [
                7177,
                7181
            ],
            [
                7191,
                7211
            ],
            [
                7216,
                7219
            ],
            [
                7220,
                7224
            ],
            [
                7224,
                7247
            ],
            [
                7248,
                7289
            ],
            [
                7292,
                7307
            ],
            [
                7308,
                7323
            ],
            [
                7324,
                7436
            ],
            [
                7436,
                7587
            ],
            [
                7587,
                7638
            ],
            [
                7638,
                7722
            ],
            [
                7722,
                7807
            ],
            [
                7818,
                7887
            ],
            [
                7887,
                7983
            ],
            [
                7985,
                7987
            ],
            [
                7988,
                8023
            ],
            [
                8023,
                8029
            ],
            [
                8030,
                8066
            ],
            [
                8068,
                8088
            ],
            [
                8089,
                8092
            ],
            [
                8093,
                8160
            ],
            [
                8160,
                8184
            ],
            [
                8185,
                8220
            ],
            [
                8220,
                8244
            ],
            [
                8244,
                8246
            ],
            [
                8246,
                8286
            ],
            [
                8286,
                8307
            ],
            [
                8307,
                8330
            ],
            [
                8331,
                8346
            ],
            [
                8350,
                8353
            ],
            [
                8354,
                8363
            ],
            [
                8364,
                8371
            ],
            [
                8371,
                8373
            ],
            [
                8374,
                8401
            ],
            [
                8408,
                8497
            ],
            [
                8497,
                8530
            ],
            [
                8534,
                8572
            ],
            [
                8572,
                8604
            ],
            [
                8610,
                8657
            ],
            [
                8657,
                8685
            ],
            [
                8685,
                8687
            ],
            [
                8687,
                8761
            ],
            [
                8761,
                8763
            ],
            [
                8763,
                8785
            ],
            [
                8785,
                8831
            ],
            [
                8831,
                8857
            ],
            [
                8857,
                8924
            ],
            [
                8924,
                8955
            ],
            [
                8955,
                8985
            ],
            [
                8986,
                9049
            ],
            [
                9052,
                9072
            ],
            [
                9072,
                9159
            ],
            [
                9160,
                9187
            ],
            [
                9187,
                9264
            ],
            [
                9264,
                9298
            ],
            [
                9298,
                9301
            ],
            [
                9302,
                9343
            ],
            [
                9346,
                9468
            ],
            [
                9468,
                9473
            ],
            [
                9474,
                9475
            ],
            [
                9483,
                9562
            ],
            [
                9562,
                9564
            ],
            [
                9564,
                9661
            ],
            [
                9661,
                9719
            ],
            [
                9719,
                9782
            ],
            [
                9782,
                9925
            ],
            [
                9925,
                9982
            ],
            [
                9983,
                10009
            ],
            [
                10009,
                10104
            ],
            [
                10104,
                10215
            ],
            [
                10215,
                10285
            ],
            [
                10285,
                10386
            ],
            [
                10386,
                10411
            ],
            [
                10411,
                10470
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                126
            ],
            [
                126,
                211
            ],
            [
                211,
                328
            ],
            [
                328,
                396
            ],
            [
                396,
                617
            ],
            [
                617,
                669
            ],
            [
                669,
                757
            ],
            [
                757,
                924
            ],
            [
                924,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1076
            ],
            [
                1076,
                1204
            ],
            [
                1204,
                1363
            ],
            [
                1363,
                1523
            ],
            [
                1523,
                1699
            ],
            [
                1699,
                2138
            ],
            [
                2138,
                2359
            ],
            [
                2359,
                2490
            ],
            [
                2490,
                2641
            ],
            [
                2641,
                2701
            ],
            [
                2701,
                2839
            ],
            [
                2839,
                2884
            ],
            [
                2884,
                2987
            ],
            [
                2987,
                2987
            ],
            [
                2987,
                3081
            ],
            [
                3081,
                3194
            ],
            [
                3194,
                3223
            ],
            [
                3223,
                3314
            ],
            [
                3314,
                3351
            ],
            [
                3351,
                3370
            ],
            [
                3370,
                3425
            ],
            [
                3425,
                3475
            ],
            [
                3475,
                3500
            ],
            [
                3500,
                3547
            ],
            [
                3547,
                3601
            ],
            [
                3601,
                3660
            ],
            [
                3660,
                3943
            ],
            [
                3943,
                4053
            ],
            [
                4053,
                4157
            ],
            [
                4157,
                4221
            ],
            [
                4221,
                4363
            ],
            [
                4363,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4500
            ],
            [
                4500,
                4510
            ],
            [
                4510,
                4625
            ],
            [
                4625,
                4975
            ],
            [
                4975,
                5310
            ],
            [
                5310,
                5429
            ],
            [
                5429,
                5719
            ],
            [
                5719,
                5789
            ],
            [
                5789,
                5902
            ],
            [
                5902,
                5902
            ],
            [
                5902,
                5998
            ],
            [
                5998,
                6160
            ],
            [
                6160,
                6277
            ],
            [
                6277,
                6340
            ],
            [
                6340,
                6464
            ],
            [
                6464,
                6586
            ],
            [
                6586,
                6744
            ],
            [
                6744,
                6783
            ],
            [
                6783,
                6828
            ],
            [
                6828,
                6850
            ],
            [
                6850,
                6944
            ],
            [
                6944,
                7118
            ],
            [
                7118,
                7292
            ],
            [
                7292,
                7436
            ],
            [
                7436,
                7587
            ],
            [
                7587,
                7638
            ],
            [
                7638,
                7722
            ],
            [
                7722,
                7887
            ],
            [
                7887,
                8023
            ],
            [
                8023,
                8160
            ],
            [
                8160,
                8220
            ],
            [
                8220,
                8246
            ],
            [
                8246,
                8286
            ],
            [
                8286,
                8371
            ],
            [
                8371,
                8401
            ],
            [
                8401,
                8497
            ],
            [
                8497,
                8572
            ],
            [
                8572,
                8657
            ],
            [
                8657,
                8687
            ],
            [
                8687,
                8763
            ],
            [
                8763,
                8785
            ],
            [
                8785,
                8831
            ],
            [
                8831,
                8857
            ],
            [
                8857,
                8924
            ],
            [
                8924,
                8955
            ],
            [
                8955,
                8985
            ],
            [
                8985,
                9072
            ],
            [
                9072,
                9187
            ],
            [
                9187,
                9264
            ],
            [
                9264,
                9298
            ],
            [
                9298,
                9346
            ],
            [
                9346,
                9564
            ],
            [
                9564,
                9661
            ],
            [
                9661,
                9719
            ],
            [
                9719,
                9782
            ],
            [
                9782,
                9782
            ],
            [
                9782,
                9925
            ],
            [
                9925,
                10009
            ],
            [
                10009,
                10104
            ],
            [
                10104,
                10215
            ],
            [
                10215,
                10285
            ],
            [
                10285,
                10386
            ],
            [
                10386,
                10411
            ],
            [
                10411,
                10470
            ]
        ]
    }
}