{
    "original": {
        "text": "\"No man,\" says a Rabbi, by way of indisputable instance, \"may turn the bones of his father and mother into spoons\"--sure that his hearers felt the checks against that form of economy. The market for spoons has never expanded enough for any one to say, \"Why not?\" and to argue that human progress lies in such an application of material. The only check to be alleged is a sentiment, which will coerce none who do not hold that sentiments are the better part of the world's wealth.\nDeronda meanwhile took to a less fashionable form of exercise than riding in Rotten Row. He went often rambling in those parts of London which are most inhabited by common Jews. He walked to the synagogues at times of service, he looked into shops, he observed faces:--a process not very promising of particular discovery. Why did he not address himself to an influential Rabbi or other member of a Jewish community, to consult on the chances of finding a mother named Cohen, with a son named Ezra, and a lost daughter named Mirah? He thought of doing so--after Christmas. The fact was, notwithstanding all his sense of poetry in common things, Deronda, where a keen personal interest was aroused, could not, more than the rest of us, continuously escape suffering from the pressure of that hard unaccommodating Actual, which has never consulted our taste and is entirely unselect. Enthusiasm, we know, dwells at ease among ideas, tolerates garlic breathed in the middle ages, and sees no shabbiness in the official trappings of classic processions: it gets squeamish when ideals press upon it as something warmly incarnate, and can hardly face them without fainting. Lying dreamily in a boat, imagining one's self in quest of a beautiful maiden's relatives in Cordova elbowed by Jews in the time of Ibn-Gebirol, all the physical incidents can be borne without shock. Or if the scenery of St. Mary Axe and Whitechapel were imaginatively transported to the borders of the Rhine at the end of the eleventh century, when in the ears listening for the signals of the Messiah, the Hep! Hep! Hep! of the Crusaders came like the bay of blood-hounds; and in the presence of those devilish missionaries with sword and firebrand the crouching figure of the reviled Jew turned round erect, heroic, flashing with sublime constancy in the face of torture and death--what would the dingy shops and unbeautiful faces signify to the thrill of contemplative emotion? But the fervor of sympathy with which we contemplate a grandiose martyrdom is feeble compared with the enthusiasm that keeps unslacked where there is no danger, no challenge--nothing but impartial midday falling on commonplace, perhaps half-repulsive, objects which are really the beloved ideas made flesh. Here undoubtedly lies the chief poetic energy: in the force of imagination that pierces or exalts the solid fact, instead of floating among cloud-pictures. To glory in a prophetic vision of knowledge covering the earth, is an easier exercise of believing imagination than to see its beginning in newspaper placards, staring at you from the bridge beyond the corn-fields; and it might well happen to most of us dainty people that we were in the thick of the battle of Armageddon without being aware of anything more than the annoyance of a little explosive smoke and struggling on the ground immediately about us.\nIt lay in Deronda's nature usually to contemn the feeble, fastidious sympathy which shrinks from the broad life of mankind; but now, with Mirah before him as a living reality, whose experience he had to care for, he saw every common Jew and Jewess in the light of a comparison with her, and had a presentiment of the collision between her idea of the unknown mother and brother and the discovered fact--a presentiment all the keener in him because of a suppressed consciousness that a not unlike possibility of collision might lie hidden in his own lot. Not that he would have looked with more complacency of expectation at wealthy Jews, outdoing the lords of the Philistines in their sports; but since there was no likelihood of Mirah's friends being found among that class, their habits did not immediately affect him. In this mood he rambled, without expectation of a more pregnant result than a little preparation of his own mind, perhaps for future theorizing as well as practice--very much as if, Mirah being related to Welsh miners, he had gone to look more closely at the ways of those people, not without wishing at the same time to get a little light of detail on the history of Strikes.\nHe really did not long to find anybody in particular; and when, as his habit was, he looked at the name over a shop door, he was well content that it was not Ezra Cohen. I confess, he particularly desired that Ezra Cohen should not keep a shop. Wishes are held to be ominous; according to which belief the order of the world is so arranged that if you have an impious objection to a squint, your offspring is the more likely to be born with one; also, that if you happened to desire a squint you would not get it. This desponding view of probability the hopeful entirely reject, taking their wishes as good and sufficient security for all kinds of fulfilment. Who is absolutely neutral? Deronda happening one morning to turn into a little side street out of the noise and obstructions of Holborn, felt the scale dip on the desponding side.\nHe was rather tired of the streets and had paused to hail a hansom cab which he saw coming, when his attention was caught by some fine old clasps in chased silver displayed in the window at his right hand. His first thought was that Lady Mallinger, who had a strictly Protestant taste for such Catholic spoils, might like to have these missal-clasps turned into a bracelet: then his eyes traveled over the other contents of the window, and he saw that the shop was that kind of pawnbroker's where the lead is given to jewelry, lace and all equivocal objects introduced as _bric--brac_. A placard in one corner announced--_Watches and Jewelry exchanged and repaired_. But his survey had been noticed from within, and a figure appeared at the door, looking round at him and saying in a tone of cordial encouragement, \"Good day, sir.\" The instant was enough for Deronda to see the face, unmistakably Jewish, belonged to a young man about thirty, and wincing from the shopkeeper's persuasiveness that would probably follow, he had no sooner returned the \"good day,\" than he passed to the other side of the street and beckoned to the cabman to draw up there. From that station he saw the name over the shop window--_Ezra Cohen_.\nThere might be a hundred Ezra Cohens lettered above shop windows, but Deronda had not seen them. Probably the young man interested in a possible customer was Ezra himself; and he was about the age to be expected in Mirah's brother, who was grown up while she was still a little child. But Deronda's first endeavor as he drove homeward was to convince himself that there was not the slightest warrantable presumption of this Ezra being Mirah's brother; and next, that even if, in spite of good reasoning, he turned out to be that brother, while on inquiry the mother was found to be dead, it was not his--Deronda's--duty to make known the discovery to Mirah. In inconvenient disturbance of this conclusion there came his lately-acquired knowledge that Mirah would have a religious desire to know of her mother's death, and also to learn whether her brother were living. How far was he justified in determining another life by his own notions? Was it not his secret complaint against the way in which others had ordered his own life, that he had not open daylight on all its relations, so that he had not, like other men, the full guidance of primary duties?\nThe immediate relief from this inward debate was the reflection that he had not yet made any real discovery, and that by looking into the facts more closely he should be certified that there was no demand on him for any decision whatever. He intended to return to that shop as soon as he could conveniently, and buy the clasps for Lady Mallinger. But he was hindered for several days by Sir Hugo, who, about to make an after-dinner speech on a burning topic, wanted Deronda to forage for him on the legal part of the question, besides wasting time every day on argument which always ended in a drawn battle. As on many other questions, they held different sides, but Sir Hugo did not mind this, and when Deronda put his point well, said, with a mixture of satisfaction and regret,\n\"Confound it, Dan! why don't you make an opportunity of saying these things in public? You're wrong, you know. You won't succeed. You've got the massive sentiment--the heavy artillery of the country against you. But it's all the better ground for a young man to display himself on. When I was your age, I should have taken it. And it would be quite as well for you to be in opposition to me here and there. It would throw you more into relief. If you would seize an occasion of this sort to make an impression, you might be in Parliament in no time. And you know that would gratify me.\"\n\"I am sorry not to do what would gratify you, sir,\" said Deronda. \"But I cannot persuade myself to look at politics as a profession.\"\n\"Why not? if a man is not born into public life by his position in the country, there's no way for him but to embrace it by his own efforts. The business of the country must be done--her Majesty's Government carried on, as the old Duke said. And it never could be, my boy, if everybody looked at politics as if they were prophecy, and demanded an inspired vocation. If you are to get into Parliament, it won't do to sit still and wait for a call either from heaven or constituents.\"\n\"I don't want to make a living out of opinions,\" said Deronda; \"especially out of borrowed opinions. Not that I mean to blame other men. I dare say many better fellows than I don't mind getting on to a platform to praise themselves, and giving their word of honor for a party.\"\n\"I'll tell you what, Dan,\" said Sir Hugo, \"a man who sets his face against every sort of humbug is simply a three-cornered, impracticable fellow. There's a bad style of humbug, but there is also a good style--one that oils the wheels and makes progress possible. If you are to rule men, you must rule them through their own ideas; and I agree with the Archbishop at Naples who had a St. Januarius procession against the plague. It's no use having an Order in Council against popular shallowness. There is no action possible without a little acting.\"\n\"One may be obliged to give way to an occasional necessity,\" said Deronda. \"But it is one thing to say, 'In this particular case I am forced to put on this foolscap and grin,' and another to buy a pocket foolscap and practice myself in grinning. I can't see any real public expediency that does not keep an ideal before it which makes a limit of deviation from the direct path. But if I were to set up for a public man I might mistake my success for public expediency.\"\nIt was after this dialogue, which was rather jarring to him, that Deronda set out on his meditated second visit to Ezra Cohen's. He entered the street at the end opposite to the Holborn entrance, and an inward reluctance slackened his pace while his thoughts were transferring what he had just been saying about public expediency to the entirely private difficulty which brought him back again into this unattractive thoroughfare. It might soon become an immediate practical question with him how far he could call it a wise expediency to conceal the fact of close kindred. Such questions turning up constantly in life are often decided in a rough-and-ready way; and to many it will appear an over-refinement in Deronda that he should make any great point of a matter confined to his own knowledge. But we have seen the reasons why he had come to regard concealment as a bane of life, and the necessity of concealment as a mark by which lines of action were to be avoided. The prospect of being urged against the confirmed habit of his mind was naturally grating. He even paused here and there before the most plausible shop-windows for a gentleman to look into, half inclined to decide that he would not increase his knowledge about that modern Ezra, who was certainly not a leader among his people--a hesitation which proved how, in a man much given to reasoning, a bare possibility may weigh more than the best-clad likelihood; for Deronda's reasoning had decided that all likelihood was against this man's being Mirah's brother.\nOne of the shop-windows he paused before was that of a second-hand book-shop, where, on a narrow table outside, the literature of the ages was represented in judicious mixture, from the immortal verse of Homer to the mortal prose of the railway novel. That the mixture was judicious was apparent from Deronda's finding in it something that he wanted--namely, that wonderful bit of autobiography, the life of the Polish Jew, Salomon Maimon; which, as he could easily slip it into his pocket, he took from its place, and entered the shop to pay for, expecting to see behind the counter a grimy personage showing that _nonchalance_ about sales which seems to belong universally to the second-hand book-business. In most other trades you find generous men who are anxious to sell you their wares for your own welfare; but even a Jew will not urge Simson's Euclid on you with an affectionate assurance that you will have pleasure in reading it, and that he wishes he had twenty more of the article, so much is it in request. One is led to fear that a secondhand bookseller may belong to that unhappy class of men who have no belief in the good of what they get their living by, yet keep conscience enough to be morose rather than unctuous in their vocation.\nBut instead of the ordinary tradesman, he saw, on the dark background of books in the long narrow shop, a figure that was somewhat startling in its unusualness. A man in threadbare clothing, whose age was difficult to guess--from the dead yellowish flatness of the flesh, something like an old ivory carving--was seated on a stool against some bookshelves that projected beyond the short counter, doing nothing more remarkable than reading yesterday's _Times_; but when he let the paper rest on his lap and looked at the incoming customer, the thought glanced through Deronda that precisely such a physiognomy as that might possibly have been seen in a prophet of the Exile, or in some New Hebrew poet of the medival time. It was a fine typical Jewish face, wrought into intensity of expression apparently by a strenuous eager experience in which all the satisfaction had been indirect and far off, and perhaps by some bodily suffering also, which involved that absence of ease in the present. The features were clear-cut, not large; the brow not high but broad, and fully defined by the crisp black hair. It might never have been a particularly handsome face, but it must always have been forcible; and now with its dark, far-off gaze, and yellow pallor in relief on the gloom of the backward shop, one might have imagined one's self coming upon it in some past prison of the Inquisition, which a mob had suddenly burst upon; while the look fixed on an incidental customer seemed eager and questioning enough to have been turned on one who might have been a messenger either of delivery or of death. The figure was probably familiar and unexciting enough to the inhabitants of this street; but to Deronda's mind it brought so strange a blending of the unwonted with the common, that there was a perceptible interval of mutual observation before he asked his question; \"What is the price of this book?\"\nAfter taking the book and examining the fly-leaves without rising, the supposed bookseller said, \"There is no mark, and Mr. Ram is not in now. I am keeping the shop while he is gone to dinner. What are you disposed to give for it?\" He held the book close on his lap with his hand on it and looked examiningly at Deronda, over whom there came the disagreeable idea, that possibly this striking personage wanted to see how much could be got out of a customer's ignorance of prices. But without further reflection he said, \"Don't you know how much it is worth?\"\n\"Not its market-price. May I ask have you read it?\"\n\"No. I have read an account of it, which makes me want to buy it.\"\n\"You are a man of learning--you are interested in Jewish history?\" This was said in a deepened tone of eager inquiry.\n\"I am certainly interested in Jewish history,\" said Deronda, quietly, curiosity overcoming his dislike to the sort of inspection as well as questioning he was under.\nBut immediately the strange Jew rose from his sitting posture, and Deronda felt a thin hand pressing his arm tightly, while a hoarse, excited voice, not much above a loud whisper, said,\n\"You are perhaps of our race?\"\nDeronda colored deeply, not liking the grasp, and then answered with a slight shake of the head, \"No.\" The grasp was relaxed, the hand withdrawn, the eagerness of the face collapsed into uninterested melancholy, as if some possessing spirit which had leaped into the eyes and gestures had sunk back again to the inmost recesses of the frame; and moving further off as he held out the little book, the stranger said in a tone of distant civility, \"I believe Mr. Ram will be satisfied with half-a-crown, sir.\"\nThe effect of this change on Deronda--he afterward smiled when he recalled it--was oddly embarrassing and humiliating, as if some high dignitary had found him deficient and given him his _cong_. There was nothing further to be said, however: he paid his half-crown and carried off his _Salomon Maimon's Lebensgeschichte_ with a mere \"good-morning.\"\nHe felt some vexation at the sudden arrest of the interview, and the apparent prohibition that he should know more of this man, who was certainly something out of the common way--as different probably as a Jew could well be from Ezra Cohen, through whose door Deronda was presently entering, and whose flourishing face glistening on the way to fatness was hanging over the counter in negotiation with some one on the other side of the partition, concerning two plated stoppers and three teaspoons, which lay spread before him. Seeing Deronda enter, he called out \"Mother! Mother!\" and then with a familiar nod and smile, said, \"Coming, sir--coming directly.\"\nDeronda could not help looking toward the door from the back with some anxiety, which was not soothed when he saw a vigorous woman beyond fifty enter and approach to serve him. Not that there was anything very repulsive about her: the worst that could be said was that she had that look of having made her toilet with little water, and by twilight, which is common to unyouthful people of her class, and of having presumably slept in her large earrings, if not in her rings and necklace. In fact, what caused a sinking of heart in Deronda was her not being so coarse and ugly as to exclude the idea of her being Mirah's mother. Any one who has looked at a face to try and discern signs of known kinship in it will understand his process of conjecture--how he tried to think away the fat which had gradually disguised the outlines of youth, and to discern what one may call the elementary expressions of the face. He was sorry to see no absolute negative to his fears. Just as it was conceivable that this Ezra, brought up to trade, might resemble the scapegrace father in everything but his knowledge and talent, so it was not impossible that this mother might have had a lovely refined daughter whose type of feature and expression was like Mirah's. The eyebrows had a vexatious similarity of line; and who shall decide how far a face may be masked when the uncherishing years have thrust it far onward in the ever-new procession of youth and age? The good-humor of the glance remained and shone out in a motherly way at Deronda, as she said, in a mild guttural tone,\n\"How can I serve you, sir?\"\n\"I should like to look at the silver clasps in the window,\" said Deronda; \"the larger ones, please, in the corner there.\"\nThey were not quite easy to get at from the mother's station, and the son seeing this called out, \"I'll reach 'em, mother; I'll reach 'em,\" running forward with alacrity, and then handing the clasps to Deronda with the smiling remark,\n\"Mother's too proud: she wants to do everything herself. That's why I called her to wait on you, sir. When there's a particular gentleman customer, sir, I daren't do any other than call her. But I can't let her do herself mischief with stretching.\"\nHere Mr. Cohen made way again for his parent, who gave a little guttural, amiable laugh while she looked at Deronda, as much as to say, \"This boy will be at his jokes, but you see he's the best son in the world,\" and evidently the son enjoyed pleasing her, though he also wished to convey an apology to his distinguished customer for not giving him the advantage of his own exclusive attention.\nDeronda began to examine the clasps as if he had many points to observe before he could come to a decision.\n\"They are only three guineas, sir,\" said the mother, encouragingly.\n\"First-rate workmanship, sir--worth twice the money; only I get 'em a bargain from Cologne,\" said the son, parenthetically, from a distance.\nMeanwhile two new customers entered, and the repeated call, \"Addy!\" brought from the back of the shop a group that Deronda turned frankly to stare at, feeling sure that the stare would be held complimentary. The group consisted of a black-eyed young woman who carried a black-eyed little one, its head already covered with black curls, and deposited it on the counter, from which station it looked round with even more than the usual intelligence of babies: also a robust boy of six and a younger girl, both with black eyes and black-ringed hair--looking more Semitic than their parents, as the puppy lions show the spots of far-off progenitors. The young woman answering to \"Addy\"--a sort of paroquet in a bright blue dress, with coral necklace and earrings, her hair set up in a huge bush--looked as complacently lively and unrefined as her husband; and by a certain difference from the mother deepened in Deronda the unwelcome impression that the latter was not so utterly common a Jewess as to exclude her being the mother of Mirah. While that thought was glancing through his mind, the boy had run forward into the shop with an energetic stamp, and setting himself about four feet from Deronda, with his hands in the pockets of his miniature knickerbockers, looked at him with a precocious air of survey. Perhaps it was chiefly with a diplomatic design to linger and ingratiate himself that Deronda patted the boy's head, saying,\n\"What is your name, sirrah?\"\n\"Jacob Alexander Cohen,\" said the small man, with much ease and distinctness.\n\"You are not named after your father, then?\"\n\"No, after my grandfather; he sells knives and razors and scissors--my grandfather does,\" said Jacob, wishing to impress the stranger with that high connection. \"He gave me this knife.\" Here a pocket-knife was drawn forth, and the small fingers, both naturally and artificially dark, opened two blades and a cork-screw with much quickness.\n\"Is not that a dangerous plaything?\" said Deronda, turning to the grandmother.\n\"_He_'ll never hurt himself, bless you!\" said she, contemplating her grandson with placid rapture.\n\"Have _you_ got a knife?\" says Jacob, coming closer. His small voice was hoarse in its glibness, as if it belonged to an aged commercial soul, fatigued with bargaining through many generations.\n\"Yes. Do you want to see it?\" said Deronda, taking a small penknife from his waistcoat-pocket.\nJacob seized it immediately and retreated a little, holding the two knives in his palms and bending over them in meditative comparison. By this time the other clients were gone, and the whole family had gathered to the spot, centering their attention on the marvelous Jacob: the father, mother, and grandmother behind the counter, with baby held staggering thereon, and the little girl in front leaning at her brother's elbow to assist him in looking at the knives.\n\"Mine's the best,\" said Jacob, at last, returning Deronda's knife as if he had been entertaining the idea of exchange and had rejected it.\nFather and mother laughed aloud with delight. \"You won't find Jacob choosing the worst,\" said Mr. Cohen, winking, with much confidence in the customer's admiration. Deronda, looking at the grandmother, who had only an inward silent laugh, said,\n\"Are these the only grandchildren you have?\"\n\"All. This is my only son,\" she answered in a communicative tone, Deronda's glance and manner as usual conveying the impression of sympathetic interest--which on this occasion answered his purpose well. It seemed to come naturally enough that he should say,\n\"And you have no daughter?\"\nThere was an instantaneous change in the mother's face. Her lips closed more firmly, she looked down, swept her hands outward on the counter, and finally turned her back on Deronda to examine some Indian handkerchiefs that hung in pawn behind her. Her son gave a significant glance, set up his shoulders an instant and just put his fingers to his lips,--then said quickly, \"I think you're a first-rate gentleman in the city, sir, if I may be allowed to guess.\"\n\"No,\" said Deronda, with a preoccupied air, \"I have nothing to do with the city.\"\n\"That's a bad job. I thought you might be the young principal of a first-rate firm,\" said Mr. Cohen, wishing to make amends for the check on his customer's natural desire to know more of him and his. \"But you understand silver-work, I see.\"\n\"A little,\" said Deronda, taking up the clasps a moment and laying them down again. That unwelcome bit of circumstantial evidence had made his mind busy with a plan which was certainly more like acting than anything he had been aware of in his own conduct before. But the bare possibility that more knowledge might nullify the evidence now overpowered the inclination to rest in uncertainty.\n\"To tell you the truth,\" he went on, \"my errand is not so much to buy as to borrow. I dare say you go into rather heavy transactions occasionally.\"\n\"Well, sir, I've accommodated gentlemen of distinction--I'm proud to say it. I wouldn't exchange my business with any in the world. There's none more honorable, nor more charitable, nor more necessary for all classes, from the good lady who wants a little of the ready for the baker, to a gentleman like yourself, sir, who may want it for amusement. I like my business, I like my street, and I like my shop. I wouldn't have it a door further down. And I wouldn't be without a pawn-shop, sir, to be the Lord Mayor. It puts you in connection with the world at large. I say it's like the government revenue--it embraces the brass as well as the gold of the country. And a man who doesn't get money, sir, can't accommodate. Now, what can I do for _you_, sir?\"\nIf an amiable self-satisfaction is the mark of earthly bliss, Solomon in all his glory was a pitiable mortal compared with Mr. Cohen--clearly one of those persons, who, being in excellent spirits about themselves, are willing to cheer strangers by letting them know it. While he was delivering himself with lively rapidity, he took the baby from his wife and holding it on his arm presented his features to be explored by its small fists. Deronda, not in a cheerful mood, was rashly pronouncing this Ezra Cohen to be the most unpoetic Jew he had ever met with in books or life: his phraseology was as little as possible like that of the Old Testament: and no shadow of a suffering race distinguished his vulgarity of soul from that of a prosperous, pink-and-white huckster of the purest English lineage. It is naturally a Christian feeling that a Jew ought not to be conceited. However, this was no reason for not persevering in his project, and he answered at once in adventurous ignorance of technicalities,\n\"I have a fine diamond ring to offer as security--not with me at this moment, unfortunately, for I am not in the habit of wearing it. But I will come again this evening and bring it with me. Fifty pounds at once would be a convenience to me.\"\n\"Well, you know, this evening is the Sabbath, young gentleman,\" said Cohen, \"and I go to the _Shool_. The shop will be closed. But accommodation is a work of charity; if you can't get here before, and are any ways pressed--why, I'll look at your diamond. You're perhaps from the West End--a longish drive?\"\n\"Yes; and your Sabbath begins early at this season. I could be here by five--will that do?\" Deronda had not been without hope that by asking to come on a Friday evening he might get a better opportunity of observing points in the family character, and might even be able to put some decisive question.\nCohen assented; but here the marvelous Jacob, whose _physique_ supported a precocity that would have shattered a Gentile of his years, showed that he had been listening with much comprehension by saying, \"You are coming again. Have you got any more knives at home?\"\n\"I think I have one,\" said Deronda, smiling down at him.\n\"Has it two blades and a hook--and a white handle like that?\" said Jacob, pointing to the waistcoat-pocket.\n\"I dare say it has.\"\n\"Do you like a cork-screw?\" said Jacob, exhibiting that article in his own knife again, and looking up with serious inquiry.\n\"Yes,\" said Deronda, experimentally.\n\"Bring your knife, then, and we'll shwop,\" said Jacob, returning the knife to his pocket, and stamping about with the sense that he had concluded a good transaction.\nThe grandmother had now recovered her usual manners, and the whole family watched Deronda radiantly when he caressingly lifted the little girl, to whom he had not hitherto given attention, and seating her on the counter, asked for her name also. She looked at him in silence, and put her fingers to her gold earrings, which he did not seem to have noticed.\n\"Adelaide Rebekah is her name,\" said her mother, proudly. \"Speak to the gentleman, lovey.\"\n\"Shlav'm Shabbes fyock on,\" said Adelaide Rebekah.\n\"Her Sabbath frock, she means,\" said the father, in explanation. \"She'll have her Sabbath frock on this evening.\"\n\"And will you let me see you in it, Adelaide?\" said Deronda, with that gentle intonation which came very easily to him.\n\"Say yes, lovey--yes, if you please, sir,\" said her mother, enchanted with this handsome young gentleman, who appreciated remarkable children.\n\"And will you give me a kiss this evening?\" said Deronda with a hand on each of her little brown shoulders.\nAdelaide Rebekah (her miniature crinoline and monumental features corresponded with the combination of her names) immediately put up her lips to pay the kiss in advance; whereupon her father rising in still more glowing satisfaction with the general meritoriousness of his circumstances, and with the stranger who was an admiring witness, said cordially,\n\"You see there's somebody will be disappointed if you don't come this evening, sir. You won't mind sitting down in our family place and waiting a bit for me, if I'm not in when you come, sir? I'll stretch a point to accommodate a gent of your sort. Bring the diamond, and I'll see what I can do for you.\"\nDeronda thus left the most favorable impression behind him, as a preparation for more easy intercourse. But for his own part those amenities had been carried on under the heaviest spirits. If these were really Mirah's relatives, he could not imagine that even her fervid filial piety could give the reunion with them any sweetness beyond such as could be found in the strict fulfillment of a painful duty. What did this vaunting brother need? And with the most favorable supposition about the hypothetic mother, Deronda shrank from the image of a first meeting between her and Mirah, and still more from the idea of Mirah's domestication with this family. He took refuge in disbelief. To find an Ezra Cohen when the name was running in your head was no more extraordinary than to find a Josiah Smith under like circumstances; and as to the coincidence about the daughter, it would probably turn out to be a difference. If, however, further knowledge confirmed the more undesirable conclusion, what would be wise expediency?--to try and determine the best consequences by concealment, or to brave other consequences for the sake of that openness which is the sweet fresh air of our moral life.",
        "paragraph_chars": [
            [
                0,
                480
            ],
            [
                480,
                3350
            ],
            [
                3350,
                4548
            ],
            [
                4548,
                5388
            ],
            [
                5388,
                6612
            ],
            [
                6612,
                7769
            ],
            [
                7769,
                8550
            ],
            [
                8550,
                9137
            ],
            [
                9137,
                9271
            ],
            [
                9271,
                9754
            ],
            [
                9754,
                10032
            ],
            [
                10032,
                10582
            ],
            [
                10582,
                11052
            ],
            [
                11052,
                12585
            ],
            [
                12585,
                13838
            ],
            [
                13838,
                15741
            ],
            [
                15741,
                16300
            ],
            [
                16300,
                16352
            ],
            [
                16352,
                16419
            ],
            [
                16419,
                16537
            ],
            [
                16537,
                16703
            ],
            [
                16703,
                16889
            ],
            [
                16889,
                16920
            ],
            [
                16920,
                17428
            ],
            [
                17428,
                17777
            ],
            [
                17777,
                18436
            ],
            [
                18436,
                20005
            ],
            [
                20005,
                20033
            ],
            [
                20033,
                20155
            ],
            [
                20155,
                20390
            ],
            [
                20390,
                20639
            ],
            [
                20639,
                21034
            ],
            [
                21034,
                21142
            ],
            [
                21142,
                21210
            ],
            [
                21210,
                21351
            ],
            [
                21351,
                22786
            ],
            [
                22786,
                22815
            ],
            [
                22815,
                22893
            ],
            [
                22893,
                22938
            ],
            [
                22938,
                23278
            ],
            [
                23278,
                23357
            ],
            [
                23357,
                23456
            ],
            [
                23456,
                23650
            ],
            [
                23650,
                23745
            ],
            [
                23745,
                24211
            ],
            [
                24211,
                24350
            ],
            [
                24350,
                24595
            ],
            [
                24595,
                24640
            ],
            [
                24640,
                24898
            ],
            [
                24898,
                24926
            ],
            [
                24926,
                25387
            ],
            [
                25387,
                25469
            ],
            [
                25469,
                25710
            ],
            [
                25710,
                26102
            ],
            [
                26102,
                26250
            ],
            [
                26250,
                27006
            ],
            [
                27006,
                28016
            ],
            [
                28016,
                28259
            ],
            [
                28259,
                28566
            ],
            [
                28566,
                28868
            ],
            [
                28868,
                29134
            ],
            [
                29134,
                29191
            ],
            [
                29191,
                29299
            ],
            [
                29299,
                29320
            ],
            [
                29320,
                29445
            ],
            [
                29445,
                29482
            ],
            [
                29482,
                29648
            ],
            [
                29648,
                30005
            ],
            [
                30005,
                30096
            ],
            [
                30096,
                30147
            ],
            [
                30147,
                30261
            ],
            [
                30261,
                30381
            ],
            [
                30381,
                30524
            ],
            [
                30524,
                30632
            ],
            [
                30632,
                30987
            ],
            [
                30987,
                31292
            ],
            [
                31292,
                32484
            ]
        ],
        "segment_chars": [
            [
                0,
                184
            ],
            [
                184,
                263
            ],
            [
                263,
                337
            ],
            [
                337,
                480
            ],
            [
                480,
                569
            ],
            [
                569,
                658
            ],
            [
                658,
                803
            ],
            [
                803,
                1012
            ],
            [
                1012,
                1053
            ],
            [
                1053,
                1362
            ],
            [
                1362,
                1648
            ],
            [
                1648,
                1848
            ],
            [
                1848,
                2061
            ],
            [
                2061,
                2066
            ],
            [
                2066,
                2071
            ],
            [
                2071,
                2430
            ],
            [
                2430,
                2737
            ],
            [
                2737,
                2893
            ],
            [
                2893,
                3350
            ],
            [
                3350,
                3904
            ],
            [
                3904,
                4171
            ],
            [
                4171,
                4548
            ],
            [
                4548,
                4718
            ],
            [
                4718,
                4793
            ],
            [
                4793,
                5062
            ],
            [
                5062,
                5208
            ],
            [
                5208,
                5235
            ],
            [
                5235,
                5388
            ],
            [
                5388,
                5594
            ],
            [
                5594,
                5974
            ],
            [
                5974,
                6055
            ],
            [
                6055,
                6220
            ],
            [
                6220,
                6542
            ],
            [
                6542,
                6612
            ],
            [
                6612,
                6709
            ],
            [
                6709,
                6897
            ],
            [
                6897,
                7270
            ],
            [
                7270,
                7481
            ],
            [
                7481,
                7554
            ],
            [
                7554,
                7769
            ],
            [
                7769,
                8008
            ],
            [
                8008,
                8116
            ],
            [
                8116,
                8377
            ],
            [
                8377,
                8550
            ],
            [
                8550,
                8569
            ],
            [
                8569,
                8637
            ],
            [
                8637,
                8661
            ],
            [
                8661,
                8680
            ],
            [
                8680,
                8762
            ],
            [
                8762,
                8832
            ],
            [
                8832,
                8877
            ],
            [
                8877,
                8957
            ],
            [
                8957,
                8994
            ],
            [
                8994,
                9100
            ],
            [
                9100,
                9137
            ],
            [
                9137,
                9203
            ],
            [
                9203,
                9271
            ],
            [
                9271,
                9281
            ],
            [
                9281,
                9412
            ],
            [
                9412,
                9513
            ],
            [
                9513,
                9637
            ],
            [
                9637,
                9754
            ],
            [
                9754,
                9855
            ],
            [
                9855,
                9891
            ],
            [
                9891,
                10032
            ],
            [
                10032,
                10178
            ],
            [
                10178,
                10295
            ],
            [
                10295,
                10460
            ],
            [
                10460,
                10528
            ],
            [
                10528,
                10582
            ],
            [
                10582,
                10657
            ],
            [
                10657,
                10828
            ],
            [
                10828,
                10960
            ],
            [
                10960,
                11052
            ],
            [
                11052,
                11181
            ],
            [
                11181,
                11483
            ],
            [
                11483,
                11626
            ],
            [
                11626,
                11851
            ],
            [
                11851,
                12025
            ],
            [
                12025,
                12116
            ],
            [
                12116,
                12585
            ],
            [
                12585,
                12837
            ],
            [
                12837,
                13294
            ],
            [
                13294,
                13605
            ],
            [
                13605,
                13838
            ],
            [
                13838,
                13999
            ],
            [
                13999,
                14561
            ],
            [
                14561,
                14832
            ],
            [
                14832,
                14944
            ],
            [
                14944,
                15439
            ],
            [
                15439,
                15741
            ],
            [
                15741,
                15884
            ],
            [
                15884,
                15934
            ],
            [
                15934,
                15973
            ],
            [
                15973,
                16221
            ],
            [
                16221,
                16300
            ],
            [
                16300,
                16323
            ],
            [
                16323,
                16352
            ],
            [
                16352,
                16357
            ],
            [
                16357,
                16419
            ],
            [
                16419,
                16486
            ],
            [
                16486,
                16537
            ],
            [
                16537,
                16703
            ],
            [
                16703,
                16889
            ],
            [
                16889,
                16920
            ],
            [
                16920,
                17023
            ],
            [
                17023,
                17428
            ],
            [
                17428,
                17623
            ],
            [
                17623,
                17777
            ],
            [
                17777,
                18304
            ],
            [
                18304,
                18349
            ],
            [
                18349,
                18358
            ],
            [
                18358,
                18436
            ],
            [
                18436,
                18613
            ],
            [
                18613,
                18924
            ],
            [
                18924,
                19064
            ],
            [
                19064,
                19349
            ],
            [
                19349,
                19404
            ],
            [
                19404,
                19687
            ],
            [
                19687,
                19885
            ],
            [
                19885,
                20005
            ],
            [
                20005,
                20033
            ],
            [
                20033,
                20155
            ],
            [
                20155,
                20390
            ],
            [
                20390,
                20447
            ],
            [
                20447,
                20492
            ],
            [
                20492,
                20581
            ],
            [
                20581,
                20639
            ],
            [
                20639,
                21034
            ],
            [
                21034,
                21142
            ],
            [
                21142,
                21210
            ],
            [
                21210,
                21351
            ],
            [
                21351,
                21419
            ],
            [
                21419,
                21559
            ],
            [
                21559,
                21997
            ],
            [
                21997,
                22388
            ],
            [
                22388,
                22661
            ],
            [
                22661,
                22786
            ],
            [
                22786,
                22815
            ],
            [
                22815,
                22893
            ],
            [
                22893,
                22938
            ],
            [
                22938,
                23099
            ],
            [
                23099,
                23124
            ],
            [
                23124,
                23278
            ],
            [
                23278,
                23315
            ],
            [
                23315,
                23357
            ],
            [
                23357,
                23398
            ],
            [
                23398,
                23456
            ],
            [
                23456,
                23482
            ],
            [
                23482,
                23509
            ],
            [
                23509,
                23650
            ],
            [
                23650,
                23656
            ],
            [
                23656,
                23680
            ],
            [
                23680,
                23745
            ],
            [
                23745,
                23881
            ],
            [
                23881,
                24211
            ],
            [
                24211,
                24350
            ],
            [
                24350,
                24396
            ],
            [
                24396,
                24515
            ],
            [
                24515,
                24595
            ],
            [
                24595,
                24640
            ],
            [
                24640,
                24646
            ],
            [
                24646,
                24843
            ],
            [
                24843,
                24898
            ],
            [
                24898,
                24926
            ],
            [
                24926,
                24982
            ],
            [
                24982,
                25174
            ],
            [
                25174,
                25387
            ],
            [
                25387,
                25469
            ],
            [
                25469,
                25488
            ],
            [
                25488,
                25669
            ],
            [
                25669,
                25710
            ],
            [
                25710,
                25794
            ],
            [
                25794,
                25974
            ],
            [
                25974,
                26102
            ],
            [
                26102,
                26186
            ],
            [
                26186,
                26250
            ],
            [
                26250,
                26327
            ],
            [
                26327,
                26382
            ],
            [
                26382,
                26600
            ],
            [
                26600,
                26658
            ],
            [
                26658,
                26698
            ],
            [
                26698,
                26764
            ],
            [
                26764,
                26815
            ],
            [
                26815,
                26913
            ],
            [
                26913,
                26970
            ],
            [
                26970,
                27006
            ],
            [
                27006,
                27276
            ],
            [
                27276,
                27445
            ],
            [
                27445,
                27810
            ],
            [
                27810,
                27884
            ],
            [
                27884,
                28016
            ],
            [
                28016,
                28150
            ],
            [
                28150,
                28207
            ],
            [
                28207,
                28259
            ],
            [
                28259,
                28361
            ],
            [
                28361,
                28386
            ],
            [
                28386,
                28514
            ],
            [
                28514,
                28566
            ],
            [
                28566,
                28618
            ],
            [
                28618,
                28658
            ],
            [
                28658,
                28868
            ],
            [
                28868,
                29095
            ],
            [
                29095,
                29134
            ],
            [
                29134,
                29191
            ],
            [
                29191,
                29253
            ],
            [
                29253,
                29299
            ],
            [
                29299,
                29320
            ],
            [
                29320,
                29348
            ],
            [
                29348,
                29445
            ],
            [
                29445,
                29482
            ],
            [
                29482,
                29648
            ],
            [
                29648,
                29894
            ],
            [
                29894,
                30005
            ],
            [
                30005,
                30063
            ],
            [
                30063,
                30096
            ],
            [
                30096,
                30147
            ],
            [
                30147,
                30212
            ],
            [
                30212,
                30261
            ],
            [
                30261,
                30308
            ],
            [
                30308,
                30381
            ],
            [
                30381,
                30524
            ],
            [
                30524,
                30568
            ],
            [
                30568,
                30632
            ],
            [
                30632,
                30987
            ],
            [
                30987,
                31071
            ],
            [
                31071,
                31179
            ],
            [
                31179,
                31236
            ],
            [
                31236,
                31292
            ],
            [
                31292,
                31396
            ],
            [
                31396,
                31481
            ],
            [
                31481,
                31698
            ],
            [
                31698,
                31735
            ],
            [
                31735,
                31948
            ],
            [
                31948,
                31977
            ],
            [
                31977,
                32211
            ],
            [
                32211,
                32484
            ]
        ],
        "overlap_chars": [
            [
                480,
                487
            ],
            [
                488,
                497
            ],
            [
                577,
                582
            ],
            [
                572,
                576
            ],
            [
                583,
                644
            ],
            [
                652,
                658
            ],
            [
                658,
                670
            ],
            [
                675,
                685
            ],
            [
                705,
                747
            ],
            [
                749,
                780
            ],
            [
                792,
                803
            ],
            [
                803,
                817
            ],
            [
                900,
                907
            ],
            [
                877,
                878
            ],
            [
                852,
                857
            ],
            [
                908,
                1012
            ],
            [
                1012,
                1034
            ],
            [
                1036,
                1052
            ],
            [
                1053,
                1065
            ],
            [
                1125,
                1133
            ],
            [
                1083,
                1099
            ],
            [
                1199,
                1202
            ],
            [
                1176,
                1187
            ],
            [
                1228,
                1234
            ],
            [
                1250,
                1305
            ],
            [
                1326,
                1335
            ],
            [
                1360,
                1362
            ],
            [
                1362,
                1372
            ],
            [
                1383,
                1409
            ],
            [
                1530,
                1552
            ],
            [
                1646,
                1648
            ],
            [
                1654,
                1662
            ],
            [
                1674,
                1683
            ],
            [
                1695,
                1748
            ],
            [
                1672,
                1673
            ],
            [
                1749,
                1783
            ],
            [
                1788,
                1792
            ],
            [
                1797,
                1800
            ],
            [
                1810,
                1848
            ],
            [
                1848,
                1850
            ],
            [
                2074,
                2087
            ],
            [
                1968,
                1991
            ],
            [
                1898,
                1902
            ],
            [
                1917,
                1931
            ],
            [
                1886,
                1897
            ],
            [
                2115,
                2116
            ],
            [
                2227,
                2238
            ],
            [
                1991,
                1992
            ],
            [
                2239,
                2257
            ],
            [
                1882,
                1885
            ],
            [
                2259,
                2265
            ],
            [
                2299,
                2313
            ],
            [
                2326,
                2331
            ],
            [
                2114,
                2115
            ],
            [
                2333,
                2359
            ],
            [
                2382,
                2389
            ],
            [
                2428,
                2430
            ],
            [
                2430,
                2433
            ],
            [
                2759,
                2782
            ],
            [
                2754,
                2758
            ],
            [
                2784,
                2786
            ],
            [
                2529,
                2548
            ],
            [
                2505,
                2507
            ],
            [
                2434,
                2437
            ],
            [
                2645,
                2656
            ],
            [
                2445,
                2447
            ],
            [
                2711,
                2735
            ],
            [
                2782,
                2783
            ],
            [
                2787,
                2824
            ],
            [
                2835,
                2892
            ],
            [
                3360,
                3367
            ],
            [
                3377,
                3384
            ],
            [
                3385,
                3387
            ],
            [
                3396,
                3525
            ],
            [
                3563,
                3575
            ],
            [
                3583,
                3613
            ],
            [
                3616,
                3640
            ],
            [
                3614,
                3615
            ],
            [
                3667,
                3727
            ],
            [
                3561,
                3562
            ],
            [
                3728,
                3735
            ],
            [
                3747,
                3751
            ],
            [
                3768,
                3782
            ],
            [
                3790,
                3813
            ],
            [
                3828,
                3834
            ],
            [
                3861,
                3903
            ],
            [
                4171,
                4194
            ],
            [
                4196,
                4203
            ],
            [
                4221,
                4225
            ],
            [
                4235,
                4246
            ],
            [
                4256,
                4283
            ],
            [
                4346,
                4451
            ],
            [
                4285,
                4292
            ],
            [
                4464,
                4491
            ],
            [
                4524,
                4548
            ],
            [
                4548,
                4550
            ],
            [
                4558,
                4565
            ],
            [
                4571,
                4605
            ],
            [
                4630,
                4718
            ],
            [
                4718,
                4793
            ],
            [
                5140,
                5146
            ],
            [
                4800,
                4823
            ],
            [
                4876,
                4878
            ],
            [
                5235,
                5242
            ],
            [
                5345,
                5359
            ],
            [
                4860,
                4862
            ],
            [
                5360,
                5363
            ],
            [
                5253,
                5264
            ],
            [
                5299,
                5315
            ],
            [
                5333,
                5343
            ],
            [
                5273,
                5298
            ],
            [
                5386,
                5388
            ],
            [
                5388,
                5390
            ],
            [
                5427,
                5458
            ],
            [
                5478,
                5526
            ],
            [
                5544,
                5550
            ],
            [
                5527,
                5533
            ],
            [
                5551,
                5574
            ],
            [
                5578,
                5587
            ],
            [
                5592,
                5594
            ],
            [
                5604,
                5611
            ],
            [
                5616,
                5635
            ],
            [
                5699,
                5766
            ],
            [
                5828,
                5852
            ],
            [
                5645,
                5646
            ],
            [
                5866,
                5878
            ],
            [
                5635,
                5636
            ],
            [
                5809,
                5811
            ],
            [
                5897,
                5905
            ],
            [
                5913,
                5923
            ],
            [
                5967,
                5971
            ],
            [
                5974,
                6007
            ],
            [
                6018,
                6021
            ],
            [
                6030,
                6052
            ],
            [
                6104,
                6134
            ],
            [
                6160,
                6220
            ],
            [
                6262,
                6316
            ],
            [
                6483,
                6485
            ],
            [
                6317,
                6329
            ],
            [
                6247,
                6254
            ],
            [
                6329,
                6330
            ],
            [
                6335,
                6407
            ],
            [
                6425,
                6449
            ],
            [
                6486,
                6523
            ],
            [
                6540,
                6542
            ],
            [
                6542,
                6546
            ],
            [
                6560,
                6596
            ],
            [
                6601,
                6609
            ],
            [
                6612,
                6709
            ],
            [
                6709,
                6731
            ],
            [
                6766,
                6896
            ],
            [
                6897,
                6900
            ],
            [
                6926,
                6937
            ],
            [
                7216,
                7223
            ],
            [
                6951,
                7003
            ],
            [
                7028,
                7067
            ],
            [
                7074,
                7086
            ],
            [
                7116,
                7118
            ],
            [
                7126,
                7135
            ],
            [
                7072,
                7073
            ],
            [
                7167,
                7210
            ],
            [
                6901,
                6910
            ],
            [
                7227,
                7239
            ],
            [
                7246,
                7259
            ],
            [
                7240,
                7245
            ],
            [
                7260,
                7270
            ],
            [
                7270,
                7316
            ],
            [
                7358,
                7481
            ],
            [
                7481,
                7520
            ],
            [
                7529,
                7554
            ],
            [
                7554,
                7585
            ],
            [
                7699,
                7703
            ],
            [
                7611,
                7643
            ],
            [
                7696,
                7698
            ],
            [
                7644,
                7694
            ],
            [
                7767,
                7769
            ],
            [
                7926,
                7928
            ],
            [
                7783,
                7789
            ],
            [
                7833,
                7861
            ],
            [
                7867,
                7912
            ],
            [
                7954,
                7963
            ],
            [
                7981,
                7997
            ],
            [
                8006,
                8008
            ],
            [
                8008,
                8062
            ],
            [
                8075,
                8116
            ],
            [
                8116,
                8126
            ],
            [
                8136,
                8207
            ],
            [
                8226,
                8245
            ],
            [
                8257,
                8263
            ],
            [
                8211,
                8212
            ],
            [
                8268,
                8273
            ],
            [
                8286,
                8338
            ],
            [
                8375,
                8377
            ],
            [
                8377,
                8462
            ],
            [
                8464,
                8500
            ],
            [
                8501,
                8505
            ],
            [
                8507,
                8550
            ],
            [
                8550,
                8569
            ],
            [
                8569,
                8637
            ],
            [
                9061,
                9070
            ],
            [
                9077,
                9087
            ],
            [
                9098,
                9100
            ],
            [
                9104,
                9137
            ],
            [
                9137,
                9203
            ],
            [
                9203,
                9271
            ],
            [
                9271,
                9281
            ],
            [
                9544,
                9586
            ],
            [
                9606,
                9635
            ],
            [
                9489,
                9490
            ],
            [
                9412,
                9439
            ],
            [
                9520,
                9525
            ],
            [
                9448,
                9452
            ],
            [
                9754,
                9855
            ],
            [
                9855,
                9891
            ],
            [
                9891,
                9928
            ],
            [
                9929,
                10011
            ],
            [
                10018,
                10032
            ],
            [
                10032,
                10137
            ],
            [
                10156,
                10169
            ],
            [
                10176,
                10178
            ],
            [
                10178,
                10239
            ],
            [
                10241,
                10295
            ],
            [
                10528,
                10582
            ],
            [
                10582,
                10583
            ],
            [
                10587,
                10593
            ],
            [
                10617,
                10640
            ],
            [
                10640,
                10657
            ],
            [
                10657,
                10742
            ],
            [
                10747,
                10790
            ],
            [
                10795,
                10798
            ],
            [
                10818,
                10828
            ],
            [
                10849,
                10866
            ],
            [
                10886,
                10904
            ],
            [
                10960,
                10976
            ],
            [
                11001,
                11052
            ],
            [
                11052,
                11078
            ],
            [
                11113,
                11140
            ],
            [
                11151,
                11181
            ],
            [
                11181,
                11202
            ],
            [
                11246,
                11247
            ],
            [
                11252,
                11291
            ],
            [
                11451,
                11483
            ],
            [
                11541,
                11544
            ],
            [
                11545,
                11610
            ],
            [
                11611,
                11616
            ],
            [
                11624,
                11625
            ],
            [
                11855,
                11867
            ],
            [
                11880,
                11935
            ],
            [
                11937,
                11940
            ],
            [
                12025,
                12060
            ],
            [
                12084,
                12087
            ],
            [
                12093,
                12116
            ],
            [
                12116,
                12161
            ],
            [
                12172,
                12184
            ],
            [
                12213,
                12219
            ],
            [
                12253,
                12256
            ],
            [
                12201,
                12203
            ],
            [
                12257,
                12285
            ],
            [
                12298,
                12302
            ],
            [
                12302,
                12303
            ],
            [
                12244,
                12246
            ],
            [
                12507,
                12523
            ],
            [
                12551,
                12559
            ],
            [
                12308,
                12311
            ],
            [
                12229,
                12231
            ],
            [
                12568,
                12585
            ],
            [
                12585,
                12696
            ],
            [
                12753,
                12760
            ],
            [
                12697,
                12739
            ],
            [
                12760,
                12837
            ],
            [
                12886,
                12893
            ],
            [
                13279,
                13283
            ],
            [
                12920,
                12934
            ],
            [
                13273,
                13274
            ],
            [
                12981,
                13030
            ],
            [
                13035,
                13037
            ],
            [
                13098,
                13149
            ],
            [
                13169,
                13186
            ],
            [
                13150,
                13168
            ],
            [
                13292,
                13293
            ],
            [
                13838,
                13959
            ],
            [
                13969,
                13978
            ],
            [
                13986,
                13993
            ],
            [
                13997,
                13999
            ],
            [
                13999,
                14061
            ],
            [
                14108,
                14109
            ],
            [
                14333,
                14336
            ],
            [
                14077,
                14083
            ],
            [
                14120,
                14145
            ],
            [
                14147,
                14168
            ],
            [
                14068,
                14071
            ],
            [
                14226,
                14234
            ],
            [
                14270,
                14289
            ],
            [
                14291,
                14296
            ],
            [
                14297,
                14310
            ],
            [
                14345,
                14351
            ],
            [
                14376,
                14418
            ],
            [
                14429,
                14435
            ],
            [
                14456,
                14461
            ],
            [
                14471,
                14546
            ],
            [
                14555,
                14561
            ],
            [
                14561,
                14574
            ],
            [
                14583,
                14595
            ],
            [
                14609,
                14632
            ],
            [
                14644,
                14646
            ],
            [
                14649,
                14675
            ],
            [
                14735,
                14751
            ],
            [
                14757,
                14778
            ],
            [
                14830,
                14832
            ],
            [
                14832,
                14943
            ],
            [
                14944,
                14970
            ],
            [
                14984,
                15092
            ],
            [
                15136,
                15161
            ],
            [
                15173,
                15226
            ],
            [
                15263,
                15288
            ],
            [
                15234,
                15235
            ],
            [
                15303,
                15318
            ],
            [
                15329,
                15370
            ],
            [
                15395,
                15406
            ],
            [
                15116,
                15118
            ],
            [
                15426,
                15439
            ],
            [
                15533,
                15550
            ],
            [
                15516,
                15520
            ],
            [
                15443,
                15453
            ],
            [
                15562,
                15564
            ],
            [
                15615,
                15692
            ],
            [
                15707,
                15741
            ],
            [
                15741,
                15746
            ],
            [
                15767,
                15780
            ],
            [
                15758,
                15762
            ],
            [
                15806,
                15884
            ],
            [
                15884,
                15934
            ],
            [
                15934,
                15973
            ],
            [
                15973,
                15975
            ],
            [
                16031,
                16061
            ],
            [
                16083,
                16104
            ],
            [
                16106,
                16110
            ],
            [
                16120,
                16143
            ],
            [
                16151,
                16179
            ],
            [
                16219,
                16221
            ],
            [
                16252,
                16300
            ],
            [
                16300,
                16323
            ],
            [
                16323,
                16352
            ],
            [
                16352,
                16357
            ],
            [
                16357,
                16419
            ],
            [
                16419,
                16445
            ],
            [
                16447,
                16486
            ],
            [
                16486,
                16537
            ],
            [
                16537,
                16646
            ],
            [
                16655,
                16665
            ],
            [
                16689,
                16703
            ],
            [
                16703,
                16748
            ],
            [
                16764,
                16826
            ],
            [
                16837,
                16850
            ],
            [
                16883,
                16887
            ],
            [
                16827,
                16835
            ],
            [
                16874,
                16881
            ],
            [
                16889,
                16920
            ],
            [
                16920,
                16927
            ],
            [
                16936,
                16943
            ],
            [
                16966,
                16969
            ],
            [
                16975,
                16983
            ],
            [
                17015,
                17023
            ],
            [
                17023,
                17106
            ],
            [
                17120,
                17191
            ],
            [
                17205,
                17224
            ],
            [
                17266,
                17272
            ],
            [
                17315,
                17334
            ],
            [
                17348,
                17428
            ],
            [
                17428,
                17464
            ],
            [
                17507,
                17596
            ],
            [
                17670,
                17712
            ],
            [
                17749,
                17777
            ],
            [
                17777,
                17784
            ],
            [
                17790,
                17793
            ],
            [
                17799,
                17812
            ],
            [
                17820,
                17837
            ],
            [
                17867,
                17881
            ],
            [
                17882,
                17922
            ],
            [
                17956,
                17968
            ],
            [
                17978,
                17992
            ],
            [
                17998,
                18044
            ],
            [
                18067,
                18095
            ],
            [
                18045,
                18048
            ],
            [
                18173,
                18221
            ],
            [
                18302,
                18304
            ],
            [
                18304,
                18347
            ],
            [
                18358,
                18382
            ],
            [
                18391,
                18416
            ],
            [
                18418,
                18436
            ],
            [
                18436,
                18443
            ],
            [
                18502,
                18566
            ],
            [
                18574,
                18585
            ],
            [
                18474,
                18477
            ],
            [
                18611,
                18613
            ],
            [
                18613,
                18732
            ],
            [
                18749,
                18766
            ],
            [
                18783,
                18803
            ],
            [
                18815,
                18903
            ],
            [
                18914,
                18924
            ],
            [
                18924,
                18944
            ],
            [
                18967,
                18974
            ],
            [
                18958,
                18963
            ],
            [
                18975,
                19063
            ],
            [
                19064,
                19096
            ],
            [
                19116,
                19124
            ],
            [
                19131,
                19172
            ],
            [
                19188,
                19290
            ],
            [
                19309,
                19312
            ],
            [
                19324,
                19349
            ],
            [
                19349,
                19404
            ],
            [
                19552,
                19614
            ],
            [
                19445,
                19446
            ],
            [
                19615,
                19631
            ],
            [
                19673,
                19683
            ],
            [
                19685,
                19687
            ],
            [
                19687,
                19743
            ],
            [
                19757,
                19785
            ],
            [
                19880,
                19885
            ],
            [
                19889,
                19897
            ],
            [
                19907,
                19913
            ],
            [
                19927,
                20003
            ],
            [
                20005,
                20033
            ],
            [
                20033,
                20090
            ],
            [
                20123,
                20131
            ],
            [
                20090,
                20105
            ],
            [
                20155,
                20168
            ],
            [
                20175,
                20189
            ],
            [
                20221,
                20228
            ],
            [
                20241,
                20276
            ],
            [
                20292,
                20294
            ],
            [
                20311,
                20324
            ],
            [
                20276,
                20277
            ],
            [
                20217,
                20220
            ],
            [
                20343,
                20388
            ],
            [
                20390,
                20447
            ],
            [
                20447,
                20492
            ],
            [
                20581,
                20639
            ],
            [
                20639,
                20662
            ],
            [
                20669,
                20693
            ],
            [
                20928,
                20930
            ],
            [
                20713,
                20726
            ],
            [
                20754,
                20776
            ],
            [
                20866,
                20869
            ],
            [
                20781,
                20789
            ],
            [
                20805,
                20810
            ],
            [
                20819,
                20849
            ],
            [
                21034,
                21069
            ],
            [
                21140,
                21142
            ],
            [
                21142,
                21210
            ],
            [
                21210,
                21238
            ],
            [
                21240,
                21261
            ],
            [
                21300,
                21315
            ],
            [
                21334,
                21351
            ],
            [
                21351,
                21419
            ],
            [
                21419,
                21559
            ],
            [
                21559,
                21620
            ],
            [
                21632,
                21719
            ],
            [
                21739,
                21896
            ],
            [
                21937,
                21938
            ],
            [
                21898,
                21937
            ],
            [
                21995,
                21997
            ],
            [
                21997,
                22031
            ],
            [
                22034,
                22047
            ],
            [
                22053,
                22110
            ],
            [
                22203,
                22206
            ],
            [
                22111,
                22119
            ],
            [
                22127,
                22141
            ],
            [
                22150,
                22201
            ],
            [
                22386,
                22387
            ],
            [
                22220,
                22366
            ],
            [
                22381,
                22386
            ],
            [
                22371,
                22377
            ],
            [
                22436,
                22445
            ],
            [
                22454,
                22461
            ],
            [
                22499,
                22504
            ],
            [
                22521,
                22661
            ],
            [
                22684,
                22688
            ],
            [
                22691,
                22701
            ],
            [
                22784,
                22785
            ],
            [
                22747,
                22784
            ],
            [
                22786,
                22815
            ],
            [
                22815,
                22848
            ],
            [
                22891,
                22893
            ],
            [
                22893,
                22938
            ],
            [
                22938,
                22984
            ],
            [
                22996,
                23004
            ],
            [
                23025,
                23099
            ],
            [
                23099,
                23124
            ],
            [
                23124,
                23182
            ],
            [
                23222,
                23278
            ],
            [
                23278,
                23315
            ],
            [
                23315,
                23357
            ],
            [
                23357,
                23358
            ],
            [
                23359,
                23361
            ],
            [
                23366,
                23398
            ],
            [
                23398,
                23456
            ],
            [
                23456,
                23461
            ],
            [
                23463,
                23466
            ],
            [
                23468,
                23482
            ],
            [
                23482,
                23509
            ],
            [
                23509,
                23650
            ],
            [
                23650,
                23656
            ],
            [
                23656,
                23680
            ],
            [
                23680,
                23745
            ],
            [
                23745,
                23772
            ],
            [
                23795,
                23819
            ],
            [
                23850,
                23854
            ],
            [
                23879,
                23881
            ],
            [
                23881,
                23883
            ],
            [
                23894,
                23943
            ],
            [
                23970,
                23974
            ],
            [
                23980,
                24002
            ],
            [
                24013,
                24018
            ],
            [
                24209,
                24211
            ],
            [
                24211,
                24240
            ],
            [
                24242,
                24289
            ],
            [
                24308,
                24350
            ],
            [
                24350,
                24396
            ],
            [
                24396,
                24462
            ],
            [
                24513,
                24515
            ],
            [
                24515,
                24593
            ],
            [
                24595,
                24605
            ],
            [
                24610,
                24628
            ],
            [
                24637,
                24640
            ],
            [
                24640,
                24641
            ],
            [
                24644,
                24646
            ],
            [
                24646,
                24680
            ],
            [
                24841,
                24843
            ],
            [
                24843,
                24852
            ],
            [
                24871,
                24882
            ],
            [
                24886,
                24896
            ],
            [
                24898,
                24926
            ],
            [
                24926,
                24938
            ],
            [
                24953,
                24982
            ],
            [
                24982,
                24997
            ],
            [
                25009,
                25026
            ],
            [
                25066,
                25153
            ],
            [
                25162,
                25174
            ],
            [
                25174,
                25208
            ],
            [
                25241,
                25244
            ],
            [
                25250,
                25277
            ],
            [
                25280,
                25387
            ],
            [
                25387,
                25405
            ],
            [
                25431,
                25469
            ],
            [
                25488,
                25596
            ],
            [
                25610,
                25613
            ],
            [
                25622,
                25624
            ],
            [
                25667,
                25669
            ],
            [
                25669,
                25710
            ],
            [
                25710,
                25756
            ],
            [
                25766,
                25794
            ],
            [
                25794,
                25815
            ],
            [
                25831,
                25932
            ],
            [
                25966,
                25974
            ],
            [
                25974,
                25977
            ],
            [
                26078,
                26080
            ],
            [
                26086,
                26100
            ],
            [
                26004,
                26032
            ],
            [
                25999,
                26003
            ],
            [
                26037,
                26045
            ],
            [
                26100,
                26102
            ],
            [
                26102,
                26186
            ],
            [
                26186,
                26200
            ],
            [
                26222,
                26234
            ],
            [
                26250,
                26304
            ],
            [
                26306,
                26327
            ],
            [
                26382,
                26389
            ],
            [
                26395,
                26399
            ],
            [
                26409,
                26600
            ],
            [
                26600,
                26618
            ],
            [
                26636,
                26656
            ],
            [
                26730,
                26731
            ],
            [
                26702,
                26723
            ],
            [
                26674,
                26676
            ],
            [
                26742,
                26744
            ],
            [
                26748,
                26764
            ],
            [
                26764,
                26815
            ],
            [
                26970,
                26992
            ],
            [
                26994,
                26997
            ],
            [
                26998,
                27006
            ],
            [
                27131,
                27138
            ],
            [
                27093,
                27096
            ],
            [
                27181,
                27207
            ],
            [
                27274,
                27276
            ],
            [
                27276,
                27281
            ],
            [
                27308,
                27364
            ],
            [
                27387,
                27400
            ],
            [
                27410,
                27444
            ],
            [
                27445,
                27488
            ],
            [
                27501,
                27583
            ],
            [
                27662,
                27810
            ],
            [
                27884,
                27963
            ],
            [
                28016,
                28025
            ],
            [
                28031,
                28064
            ],
            [
                28066,
                28107
            ],
            [
                28148,
                28150
            ],
            [
                28150,
                28160
            ],
            [
                28189,
                28197
            ],
            [
                28172,
                28184
            ],
            [
                28205,
                28207
            ],
            [
                28207,
                28259
            ],
            [
                28259,
                28351
            ],
            [
                28353,
                28358
            ],
            [
                28361,
                28386
            ],
            [
                28386,
                28389
            ],
            [
                28426,
                28480
            ],
            [
                28482,
                28514
            ],
            [
                28514,
                28546
            ],
            [
                28548,
                28566
            ],
            [
                28566,
                28618
            ],
            [
                28618,
                28641
            ],
            [
                28643,
                28658
            ],
            [
                28658,
                28669
            ],
            [
                28692,
                28781
            ],
            [
                28792,
                28817
            ],
            [
                28844,
                28868
            ],
            [
                28868,
                28896
            ],
            [
                28907,
                28912
            ],
            [
                29070,
                29095
            ],
            [
                29095,
                29134
            ],
            [
                29134,
                29177
            ],
            [
                29183,
                29191
            ],
            [
                29191,
                29220
            ],
            [
                29222,
                29253
            ],
            [
                29253,
                29299
            ],
            [
                29299,
                29320
            ],
            [
                29320,
                29348
            ],
            [
                29348,
                29359
            ],
            [
                29423,
                29445
            ],
            [
                29445,
                29482
            ],
            [
                29482,
                29536
            ],
            [
                29576,
                29648
            ],
            [
                29648,
                29791
            ],
            [
                29837,
                29894
            ],
            [
                29894,
                30005
            ],
            [
                30005,
                30063
            ],
            [
                30063,
                30096
            ],
            [
                30096,
                30147
            ],
            [
                30147,
                30178
            ],
            [
                30184,
                30194
            ],
            [
                30210,
                30212
            ],
            [
                30212,
                30261
            ],
            [
                30261,
                30308
            ],
            [
                30308,
                30320
            ],
            [
                30379,
                30381
            ],
            [
                30381,
                30396
            ],
            [
                30421,
                30524
            ],
            [
                30524,
                30568
            ],
            [
                30568,
                30580
            ],
            [
                30630,
                30632
            ],
            [
                30632,
                30648
            ],
            [
                30746,
                30776
            ],
            [
                30785,
                30789
            ],
            [
                30918,
                30919
            ],
            [
                30802,
                30822
            ],
            [
                30985,
                30986
            ],
            [
                30666,
                30668
            ],
            [
                30844,
                30869
            ],
            [
                30674,
                30677
            ],
            [
                30716,
                30719
            ],
            [
                30953,
                30961
            ],
            [
                30933,
                30941
            ],
            [
                30969,
                30985
            ],
            [
                30987,
                30988
            ],
            [
                31013,
                31071
            ],
            [
                31071,
                31179
            ],
            [
                31236,
                31281
            ],
            [
                31289,
                31292
            ],
            [
                31292,
                31318
            ],
            [
                31329,
                31350
            ],
            [
                31394,
                31396
            ],
            [
                31396,
                31416
            ],
            [
                31459,
                31481
            ],
            [
                31481,
                31546
            ],
            [
                31576,
                31581
            ],
            [
                31609,
                31622
            ],
            [
                31653,
                31655
            ],
            [
                31587,
                31608
            ],
            [
                31623,
                31629
            ],
            [
                31552,
                31555
            ],
            [
                31563,
                31569
            ],
            [
                31692,
                31698
            ],
            [
                31698,
                31735
            ],
            [
                31735,
                31738
            ],
            [
                31804,
                31823
            ],
            [
                31837,
                31860
            ],
            [
                31744,
                31747
            ],
            [
                31796,
                31802
            ],
            [
                31865,
                31947
            ],
            [
                31948,
                31977
            ],
            [
                31977,
                31998
            ],
            [
                32038,
                32078
            ],
            [
                32086,
                32091
            ],
            [
                32116,
                32211
            ],
            [
                32211,
                32255
            ],
            [
                32261,
                32315
            ],
            [
                32317,
                32319
            ],
            [
                32363,
                32370
            ],
            [
                32374,
                32387
            ],
            [
                32338,
                32341
            ],
            [
                32394,
                32483
            ]
        ],
        "row_chars": [
            [
                0,
                184
            ],
            [
                184,
                263
            ],
            [
                263,
                337
            ],
            [
                337,
                480
            ],
            [
                480,
                658
            ],
            [
                658,
                803
            ],
            [
                803,
                1012
            ],
            [
                1012,
                1053
            ],
            [
                1053,
                1362
            ],
            [
                1362,
                1648
            ],
            [
                1648,
                1848
            ],
            [
                1848,
                2430
            ],
            [
                2430,
                2893
            ],
            [
                2893,
                3350
            ],
            [
                3350,
                3904
            ],
            [
                3904,
                4171
            ],
            [
                4171,
                4548
            ],
            [
                4548,
                4718
            ],
            [
                4718,
                4793
            ],
            [
                4793,
                5388
            ],
            [
                5388,
                5594
            ],
            [
                5594,
                5974
            ],
            [
                5974,
                6055
            ],
            [
                6055,
                6220
            ],
            [
                6220,
                6542
            ],
            [
                6542,
                6612
            ],
            [
                6612,
                6709
            ],
            [
                6709,
                6897
            ],
            [
                6897,
                7270
            ],
            [
                7270,
                7481
            ],
            [
                7481,
                7554
            ],
            [
                7554,
                7769
            ],
            [
                7769,
                8008
            ],
            [
                8008,
                8116
            ],
            [
                8116,
                8377
            ],
            [
                8377,
                8550
            ],
            [
                8550,
                8569
            ],
            [
                8569,
                8637
            ],
            [
                8637,
                8661
            ],
            [
                8661,
                8680
            ],
            [
                8680,
                8762
            ],
            [
                8762,
                8832
            ],
            [
                8832,
                8877
            ],
            [
                8877,
                8957
            ],
            [
                8957,
                8994
            ],
            [
                8994,
                9100
            ],
            [
                9100,
                9137
            ],
            [
                9137,
                9203
            ],
            [
                9203,
                9271
            ],
            [
                9271,
                9281
            ],
            [
                9281,
                9412
            ],
            [
                9412,
                9637
            ],
            [
                9637,
                9754
            ],
            [
                9754,
                9855
            ],
            [
                9855,
                9891
            ],
            [
                9891,
                10032
            ],
            [
                10032,
                10178
            ],
            [
                10178,
                10295
            ],
            [
                10295,
                10460
            ],
            [
                10460,
                10528
            ],
            [
                10528,
                10582
            ],
            [
                10582,
                10657
            ],
            [
                10657,
                10828
            ],
            [
                10828,
                11052
            ],
            [
                11052,
                11181
            ],
            [
                11181,
                11483
            ],
            [
                11483,
                11626
            ],
            [
                11626,
                11851
            ],
            [
                11851,
                12116
            ],
            [
                12116,
                12585
            ],
            [
                12585,
                12837
            ],
            [
                12837,
                13294
            ],
            [
                13294,
                13605
            ],
            [
                13605,
                13838
            ],
            [
                13838,
                13999
            ],
            [
                13999,
                14561
            ],
            [
                14561,
                14832
            ],
            [
                14832,
                14944
            ],
            [
                14944,
                15439
            ],
            [
                15439,
                15741
            ],
            [
                15741,
                15884
            ],
            [
                15884,
                15934
            ],
            [
                15934,
                15973
            ],
            [
                15973,
                16221
            ],
            [
                16221,
                16300
            ],
            [
                16300,
                16323
            ],
            [
                16323,
                16352
            ],
            [
                16352,
                16357
            ],
            [
                16357,
                16419
            ],
            [
                16419,
                16486
            ],
            [
                16486,
                16537
            ],
            [
                16537,
                16703
            ],
            [
                16703,
                16889
            ],
            [
                16889,
                16920
            ],
            [
                16920,
                17023
            ],
            [
                17023,
                17428
            ],
            [
                17428,
                17623
            ],
            [
                17623,
                17777
            ],
            [
                17777,
                18304
            ],
            [
                18304,
                18349
            ],
            [
                18349,
                18358
            ],
            [
                18358,
                18436
            ],
            [
                18436,
                18613
            ],
            [
                18613,
                18924
            ],
            [
                18924,
                19064
            ],
            [
                19064,
                19349
            ],
            [
                19349,
                19404
            ],
            [
                19404,
                19687
            ],
            [
                19687,
                19885
            ],
            [
                19885,
                20005
            ],
            [
                20005,
                20033
            ],
            [
                20033,
                20155
            ],
            [
                20155,
                20390
            ],
            [
                20390,
                20447
            ],
            [
                20447,
                20492
            ],
            [
                20492,
                20581
            ],
            [
                20581,
                20639
            ],
            [
                20639,
                21034
            ],
            [
                21034,
                21142
            ],
            [
                21142,
                21210
            ],
            [
                21210,
                21351
            ],
            [
                21351,
                21419
            ],
            [
                21419,
                21559
            ],
            [
                21559,
                21997
            ],
            [
                21997,
                22388
            ],
            [
                22388,
                22661
            ],
            [
                22661,
                22786
            ],
            [
                22786,
                22815
            ],
            [
                22815,
                22893
            ],
            [
                22893,
                22938
            ],
            [
                22938,
                23099
            ],
            [
                23099,
                23124
            ],
            [
                23124,
                23278
            ],
            [
                23278,
                23315
            ],
            [
                23315,
                23357
            ],
            [
                23357,
                23398
            ],
            [
                23398,
                23456
            ],
            [
                23456,
                23482
            ],
            [
                23482,
                23509
            ],
            [
                23509,
                23650
            ],
            [
                23650,
                23656
            ],
            [
                23656,
                23680
            ],
            [
                23680,
                23745
            ],
            [
                23745,
                23881
            ],
            [
                23881,
                24211
            ],
            [
                24211,
                24350
            ],
            [
                24350,
                24396
            ],
            [
                24396,
                24515
            ],
            [
                24515,
                24595
            ],
            [
                24595,
                24640
            ],
            [
                24640,
                24646
            ],
            [
                24646,
                24843
            ],
            [
                24843,
                24898
            ],
            [
                24898,
                24926
            ],
            [
                24926,
                24982
            ],
            [
                24982,
                25174
            ],
            [
                25174,
                25387
            ],
            [
                25387,
                25469
            ],
            [
                25469,
                25488
            ],
            [
                25488,
                25669
            ],
            [
                25669,
                25710
            ],
            [
                25710,
                25794
            ],
            [
                25794,
                25974
            ],
            [
                25974,
                26102
            ],
            [
                26102,
                26186
            ],
            [
                26186,
                26250
            ],
            [
                26250,
                26327
            ],
            [
                26327,
                26382
            ],
            [
                26382,
                26600
            ],
            [
                26600,
                26764
            ],
            [
                26764,
                26815
            ],
            [
                26815,
                26913
            ],
            [
                26913,
                26970
            ],
            [
                26970,
                27006
            ],
            [
                27006,
                27276
            ],
            [
                27276,
                27445
            ],
            [
                27445,
                27810
            ],
            [
                27810,
                27884
            ],
            [
                27884,
                28016
            ],
            [
                28016,
                28150
            ],
            [
                28150,
                28207
            ],
            [
                28207,
                28259
            ],
            [
                28259,
                28361
            ],
            [
                28361,
                28386
            ],
            [
                28386,
                28514
            ],
            [
                28514,
                28566
            ],
            [
                28566,
                28618
            ],
            [
                28618,
                28658
            ],
            [
                28658,
                28868
            ],
            [
                28868,
                29095
            ],
            [
                29095,
                29134
            ],
            [
                29134,
                29191
            ],
            [
                29191,
                29253
            ],
            [
                29253,
                29299
            ],
            [
                29299,
                29320
            ],
            [
                29320,
                29348
            ],
            [
                29348,
                29445
            ],
            [
                29445,
                29482
            ],
            [
                29482,
                29648
            ],
            [
                29648,
                29894
            ],
            [
                29894,
                30005
            ],
            [
                30005,
                30063
            ],
            [
                30063,
                30096
            ],
            [
                30096,
                30147
            ],
            [
                30147,
                30212
            ],
            [
                30212,
                30261
            ],
            [
                30261,
                30308
            ],
            [
                30308,
                30381
            ],
            [
                30381,
                30524
            ],
            [
                30524,
                30568
            ],
            [
                30568,
                30632
            ],
            [
                30632,
                30987
            ],
            [
                30987,
                31071
            ],
            [
                31071,
                31179
            ],
            [
                31179,
                31236
            ],
            [
                31236,
                31292
            ],
            [
                31292,
                31396
            ],
            [
                31396,
                31481
            ],
            [
                31481,
                31698
            ],
            [
                31698,
                31735
            ],
            [
                31735,
                31948
            ],
            [
                31948,
                31977
            ],
            [
                31977,
                32211
            ],
            [
                32211,
                32484
            ]
        ]
    },
    "abridged": {
        "text": "Deronda, meanwhile, often went rambling in those parts of London which are most inhabited by ordinary Jews. He walked to synagogues, he looked into shops, he observed faces: a process not very promising of discovery. Why did he not consult a Rabbi on the chances of finding a mother named Cohen, with a son named Ezra, and a lost daughter named Mirah? He thought of doing so - after Christmas.\nThe fact was that Deronda, for all his sense of the poetic, could not escape the pressure of that hard unaccommodating Actual, which does not consult our taste. Enthusiasm dwells at ease among ideas; but it gets squeamish when faced with bodily reality. Dreamily imagining oneself in quest of a beautiful maiden's relatives in Cordova, elbowed by Jews in the time of Ibn Gebirol, the incidents can be borne without shock. Or suppose the Crusaders of the eleventh century were transported to Whitechapel as they hounded a reviled Jew, who turned round erect and heroic in the face of death - what would the dingy shops signify then? But the chief poetic energy lies in the enthusiasm that is not diminished by the commonplace nature of its beloved ideas made flesh: the force of imagination that pierces the solid fact, instead of floating among cloud-pictures.\nDeronda was usually inclined to condemn the feeble, fastidious sympathy which shrinks from the broad life of mankind; but now, with Mirah before him as a living reality, he saw every Jew and Jewess in the light of comparison with her, and feared a collision between her idea of the unknown mother and brother, and the fact. His fear was all the keener because of a suppressed knowledge that a similar collision might lie hidden in his own lot.\nIn this mood he rambled without expecting any more result than the preparation of his own mind - as if, Mirah being related to Welsh miners, he had gone to look more closely at the ways of those people, perhaps wishing at the same time to learn something about the history of Strikes.\nHe did not wish to find anybody in particular; and whenever he looked at the name over a shop door, he was well content that it was not Ezra Cohen. I confess, he particularly desired that Ezra Cohen should not keep a shop. But wishes are held to be ominous; so Deronda felt the scale of superstition dip against him when one morning he turned out of the noise of Holborn into a little side street.\nHe had paused to hail a hansom cab, when his attention was caught by some fine old silver clasps displayed in the window on his right. He thought that Lady Mallinger might like to have these missal-clasps turned into a bracelet: then he saw that the shop was a pawnbroker's, with most of its space given to jewellery, lace and bric-a-brac. A placard in one corner announced - Watches and Jewellery exchanged and repaired.\nA figure appeared at the door, saying in a tone of cordial encouragement, \"Good day, sir.\" The face, unmistakably Jewish, belonged to a young man of about thirty. Deronda, wincing from the shopkeeper's persuasiveness that would probably follow, returned the \"good day,\" then crossed the street and beckoned to the cabman. From there he saw the name over the shop window - Ezra Cohen.\nThere might be a hundred Ezra Cohens lettered above shop windows, but Deronda had not seen them. Probably the young man was Ezra himself; and he was about the age to be expected in Mirah's brother, who was grown up while she was still a little child.\nBut as he drove home Deronda tried to convince himself that there was not the slightest likelihood of this Ezra being Mirah's brother; and that even if he did turn out to be, and if the mother was found to be dead, it was not Deronda's duty to make the discovery known to Mirah. In inconvenient disturbance of this conclusion, he knew that Mirah would have a religious desire to know of her mother's death, and also to learn whether her brother were living. How far was he justified in determining her life by his own notions? Was it not his secret complaint that others had ordered his own life, so that he had not open daylight on all its relations?\nHe found relief in reflecting that he had not yet made any discovery, and that by looking into the facts he could learn whether there was need for any decision. He intended to return to that shop as soon as he could, and buy the clasps for Lady Mallinger. But he was prevented for several days by Sir Hugo, who, about to make an after-dinner speech, wanted Deronda to help him on a legal question, besides wasting time every day on argument. As on many other questions, they held different sides, but Sir Hugo did not mind this; and when Deronda put his point well, he said with a mixture of satisfaction and regret,\n\"Confound it, Dan! why don't you make an opportunity of saying these things in public? You might enter Parliament. You know that would gratify me.\"\n\"I am sorry not to do what would gratify you, sir,\" said Deronda. \"But I cannot persuade myself to look at politics as a profession.\"\n\"Why not? If everybody looked at politics as if they demanded an inspired vocation, the business of the country would never get done.\"\n\"I don't want to make a living out of opinions,\" said Deronda; \"especially out of borrowed opinions. Not that I mean to blame other men. I dare say many better fellows than I am don't mind getting on to a platform to praise themselves, and giving their word of honour for a party.\"\n\"I'll tell you what, Dan,\" said Sir Hugo, \"a man who sets his face against every sort of humbug is simply impracticable. There's a bad style of humbug, but there is also a good style - one that oils the wheels and makes progress possible. There is no action possible without a little acting.\"\n\"There may be an occasional necessity for it,\" said Deronda. \"But it is one thing to say, 'In this particular case I am forced to put on this fool's cap and grin,' and another to buy a pocket fool's cap and practise grinning. Public expediency keeps an ideal before it; but if I were to enter politics I might mistake my success for public expediency.\"\nIt was after this dialogue that Deronda set out on his second visit to Ezra Cohen's. As he entered the street, an inward reluctance slackened his pace along this unattractive thoroughfare. His thoughts of public expediency made him wonder how far he could call it a wise expediency to conceal the fact of Mirah's close kin.\nWe have seen why he had come to regard concealment as a bane of life; and the prospect of being urged against his inclination was naturally grating. He even paused here and there before the most respectable shop-windows, half persuading himself not to increase his knowledge about Ezra Cohen, even though he had decided that this man was most unlikely to be Mirah's brother.\nOne of the shop-windows he paused before was that of a second-hand book-shop, where, on a narrow table outside, a mixture of the literature of the ages was represented, from the immortal verse of Homer to the mortal prose of the railway novel. Deronda noticed a book that he wanted - the life of the Polish Jew, Salomon Maimon; which he picked up, and entered the shop to pay for, expecting to see a grimy personage behind the counter.\nBut instead of the ordinary tradesman, he saw, on the dark background of books in the long narrow shop, a figure that was startlingly unusual. A man in threadbare clothing, whose age was difficult to guess, his skin being yellow like an old ivory carving, was seated on a stool by the counter, reading yesterday's Times; but when he looked up, the thought glanced through Deronda that such a face might have been seen in a prophet of the Exile, or in some New Hebrew poet of the mediaeval time. It was a fine Jewish face, given an intensity of expression by strenuous eager experience, and perhaps by bodily suffering also. The features were clear-cut, not large; the brow not high but broad, and fully defined by the crisp black hair.\nIt might never have been a handsome face, but it must always have been forcible; and now with its dark, far-off gaze, and yellow pallor, one might have imagined coming upon it in some past prison of the Inquisition; while the look fixed on a customer seemed questioning enough to have been turned on a messenger of salvation or of death. To Deronda's mind this figure was so unusual, that there was a perceptible interval of mutual observation before he asked, \"What is the price of this book?\"\nAfter examining the book, the supposed bookseller said, \"There is no mark, and Mr. Ram is not in now. I am keeping the shop while he is gone to dinner. What are you disposed to give for it?\" He looked examiningly at Deronda, who had the disagreeable idea that this striking personage might want to see how much could be got. He said, \"Don't you know how much it is worth?\"\n\"Not its market-price. May I ask have you read it?\"\n\"No. I have read an account of it, which makes me want to buy it.\"\n\"You are a man of learning - you are interested in Jewish history?\" This was said in a deepened tone of eager inquiry.\n\"I am certainly interested in Jewish history,\" said Deronda, quietly, curiosity overcoming his dislike to the inspection he was under.\nBut immediately the strange Jew rose from his seat, and Deronda felt a thin hand pressing his arm tightly, while an excited voice said in a hoarse whisper-\n\"You are perhaps of our race?\"\nDeronda coloured deeply, and answered, \"No.\" The grasp was relaxed, the hand withdrawn, the eagerness of the face collapsed into melancholy, as if some possessing spirit which had leaped into the eyes had sunk back again. Moving away, the stranger said with distant civility, \"I believe Mr. Ram will be satisfied with half-a-crown, sir.\"\nThe effect of this change on Deronda was oddly embarrassing and humiliating, as if some high dignitary had found him deficient. He paid his half-crown and carried off his book with a mere \"good-morning.\"\nHe felt vexed at the sudden end of the interview, so that he should not know more of this man, who was certainly uncommon - as different as a Jew could be from Ezra Cohen, through whose door Deronda now entered, and whose flourishing face was negotiating with some one on the other side of the partition. Seeing Deronda enter, he called out \"Mother!\" and then with a familiar smile, said, \"Coming, sir - coming directly.\"\nDeronda felt some anxiety, which was not soothed when he saw a vigorous woman of over fifty enter the shop. Not that there was anything very repulsive about her: the worst that could be said was that she had that look of having washed with little water, which is common to older people of her class, and of having presumably slept in her large earrings, if not in her necklace. In fact, what caused Deronda's heart to sink was her not being so coarse and ugly as to exclude the idea of her being Mirah's mother.\nAnyone who has looked at a face for signs of kinship in it will understand his process - how he tried to think away the fat which had gradually disguised the outlines of youth, and to discern the underlying expressions of the face. He was sorry to see no absolute negative to his fears. It was not impossible that this mother might have had a lovely, refined daughter like Mirah. The eyebrows had a vexatious similarity of line; and who knows how far a face may be masked by age? Her good-humoured glance shone out in a motherly way at Deronda, as she said, in a mild guttural tone-\n\"How can I serve you, sir?\"\n\"I should like to look at the silver clasps in the window, please,\" said Deronda.\nThey were not easy to get at. The son called out, \"I'll reach 'em, mother,\" with alacrity; and handed the clasps to Deronda with the smiling remark-\n\"Mother's too proud: she wants to do everything herself. That's why I called her to wait on you, sir. But I can't let her do herself mischief with stretching.\"\nHere Mr. Cohen made way for his parent, who gave an amiable laugh, as much as to say, \"The boy will joke, but he's the best son in the world.\"\nDeronda began to examine the clasps.\n\"They are only three guineas, sir,\" said the mother, encouragingly.\n\"First-rate workmanship, sir - worth twice the money,\" said the son from a distance.\nMeanwhile two new customers entered, and the repeated call, \"Addy!\" brought from the back of the shop a group that Deronda turned frankly to stare at, feeling sure that the stare would be held complimentary. The group consisted of a black-eyed young woman who carried a little one, its head already covered with black curls, and deposited it on the counter, where it looked round with even more than the usual intelligence of babies: also a robust boy of six and a younger girl, both with black eyes and black-ringed hair, looking more Semitic than their parents. The young woman answering to \"Addy\", a sort of parakeet in a bright blue dress, with coral necklace and earrings, and her hair in a huge bush, looked as complacently lively and unrefined as her husband. Her difference from the mother deepened in Deronda the unwelcome impression that the latter was not so utterly common a Jewess as to exclude her being Mirah's mother.\nMeanwhile, the boy ran forward energetically, and standing about four feet from Deronda, with his hands in the pockets of his miniature knickerbockers, looked at him with a precocious air of survey. With diplomatic intentions, Deronda patted the boy's head, saying-\n\"What is your name, sirrah?\"\n\"Jacob Alexander Cohen,\" said the boy distinctly.\n\"You are not named after your father, then?\"\n\"No, after my grandfather; he sells knives and scissors,\" said Jacob, wishing to impress the stranger with that high connection. \"He gave me this knife.\" Here a pocket-knife was drawn forth, and the small fingers opened two blades and a cork-screw with much quickness.\n\"Is not that a dangerous plaything?\" said Deronda, turning to the grandmother.\n\"He'll never hurt himself, bless you!\" said she, contemplating her grandson with placid rapture.\n\"Have you got a knife?\" says Jacob, coming closer. His small voice was hoarse in its glibness, as if it belonged to an aged commercial soul, fatigued with bargaining through many generations.\n\"Yes. Do you want to see it?\" said Deronda, taking a small penknife from his waistcoat-pocket.\nJacob seized it immediately, holding the two knives to compare them. By now the other clients were gone, and the whole family centred their attention on the marvellous Jacob.\n\"Mine's the best,\" said Jacob at last, returning Deronda's knife as if he had considered the idea of exchange and had rejected it.\nFather and mother laughed aloud with delight. \"You won't find Jacob choosing the worst,\" said Mr. Cohen, winking. Deronda, looking at the grandmother, who had only an inward silent laugh, said-\n\"Are these your only grandchildren?\"\n\"Yes. This is my only son,\" she answered. It seemed natural enough that Deronda should say next-\n\"And you have no daughter?\"\nThere was an instant change in the mother's face. Her lips closed, she looked down, and finally turned her back on Deronda to examine some Indian handkerchiefs that hung behind her. Her son gave a significant glance, and put his fingers to his lips - then said quickly, \"I think you're a first-rate gentleman in the city, sir, if I may be allowed to guess.\"\n\"No,\" said Deronda. \"I have nothing to do with the city.\"\n\"I thought you might be the young principal of a first-rate firm,\" said Mr. Cohen, wishing to make amends for his mother's silence. \"But you understand silver-work, I see.\"\n\"A little,\" said Deronda, taking up the clasps and laying them down again. That unwelcome bit of evidence had made his mind busy with a plan which was certainly more like acting than anything he had done before. But he no longer wished to be left in uncertainty, when more knowledge might nullify that evidence.\n\"To tell you the truth,\" he went on, \"my errand is not so much to buy as to borrow. I dare say you do such transactions?\"\n\"Well, sir, I've accommodated gentlemen of distinction - I'm proud to say it. There's no business more honourable, nor more charitable, nor more necessary for all classes, from the good lady who wants a little of the ready for the baker, to a gentleman like yourself, sir, who may want it for amusement. I like my business, and I like my shop - I wouldn't be without it to become the Lord Mayor. It puts you in connection with the world at large. Now, what can I do for you, sir?\"\nMr. Cohen was in excellent spirits about himself. While speaking with lively rapidity, he took the baby from his wife and presented his face to be explored by its small fists.\nDeronda, not in a cheerful mood, was rashly thinking this Ezra Cohen to be the most unpoetic Jew he had ever met with in books or life: no shadow of a suffering race distinguished his vulgarity of soul from that of a prosperous, pink-and-white huckster of the purest English lineage. However, this was no reason for not persevering in his project, and he answered-\n\"I have a diamond ring to offer as security - not with me at this moment, unfortunately. But I will bring it this evening. Fifty pounds at once would be a convenience to me.\"\n\"Well, you know, this evening is the Sabbath, young gentleman,\" said Cohen, \"and I go to the Shool. The shop will be closed. But if you can't get here before, and are any ways pressed - why, I'll look at your diamond. You're perhaps from the West End - a longish drive?\"\n\"Yes; and your Sabbath begins early at this season. I could be here by five: will that do?\" Deronda had hoped that by asking to come on a Friday evening he might get a better opportunity of observing the family character, and perhaps could ask some decisive question.\nCohen assented; but here the marvellous Jacob put in, \"You are coming again. Have you got any more knives at home?\"\n\"I think I have one,\" said Deronda, smiling at him.\n\"Has it two blades and a hook, and a white handle like that?\" said Jacob, pointing to the waistcoat-pocket.\n\"I dare say it has.\"\n\"Do you like a cork-screw?\" said Jacob, with serious inquiry.\n\"Yes,\" said Deronda, experimentally.\n\"Bring your knife, then, and we'll shwop,\" said Jacob, stamping about with the sense that he had concluded a good transaction.\nThe grandmother had now recovered her usual manners, and the whole family watched Deronda radiantly when he caressingly lifted the little girl, and seating her on the counter, asked for her name also. She looked at him in silence, and put her fingers to her gold earrings, which he did not seem to have noticed.\n\"Adelaide Rebekah is her name,\" said her mother, proudly. \"Speak to the gentleman, lovey.\"\n\"Shlav'm Shabbes fyock on,\" said Adelaide Rebekah.\n\"Her Sabbath frock, she means,\" explained the father. \"She'll have her Sabbath frock on this evening.\"\n\"And will you let me see you in it, Adelaide?\" said Deronda gently.\n\"Say yes, lovey,\" said her mother, enchanted with this handsome young gentleman, who appreciated remarkable children.\n\"And will you give me a kiss this evening?\" said Deronda.\nAdelaide Rebekah immediately put up her lips to offer a kiss, whereupon her father, in glowing satisfaction with himself and the admiring stranger, said cordially-\n\"Somebody will be disappointed if you don't come this evening, sir. You won't mind sitting down in our family place and waiting a bit for me, if I'm not in when you come, sir? Bring the diamond, and I'll see what I can do.\"\nDeronda thus left the most favourable impression behind him. But for his own part he was in the heaviest spirits. If these were really Mirah's relatives, he could not imagine that she could find any sweetness in the reunion with them beyond her filial duty. What did this vaunting brother need? And Deronda shrank from imagining a first meeting between the mother and Mirah, and still more from the idea of Mirah's domestication with this family.\nHe took refuge in disbelief. To find an Ezra Cohen was no more extraordinary than to find a John Smith; and as to the coincidence about the daughter, it would probably turn out to be a difference. If, however, further knowledge confirmed the undesirable conclusion, what would be wise expediency?- to conceal it, or to brave the consequences for the sake of that openness which is the sweet fresh air of our moral life?",
        "paragraph_chars": [
            [
                0,
                394
            ],
            [
                394,
                1255
            ],
            [
                1255,
                1699
            ],
            [
                1699,
                1984
            ],
            [
                1984,
                2382
            ],
            [
                2382,
                2804
            ],
            [
                2804,
                3188
            ],
            [
                3188,
                3439
            ],
            [
                3439,
                4091
            ],
            [
                4091,
                4708
            ],
            [
                4708,
                4856
            ],
            [
                4856,
                4990
            ],
            [
                4990,
                5125
            ],
            [
                5125,
                5407
            ],
            [
                5407,
                5700
            ],
            [
                5700,
                6053
            ],
            [
                6053,
                6377
            ],
            [
                6377,
                6752
            ],
            [
                6752,
                7188
            ],
            [
                7188,
                7924
            ],
            [
                7924,
                8419
            ],
            [
                8419,
                8792
            ],
            [
                8792,
                8844
            ],
            [
                8844,
                8911
            ],
            [
                8911,
                9030
            ],
            [
                9030,
                9165
            ],
            [
                9165,
                9321
            ],
            [
                9321,
                9352
            ],
            [
                9352,
                9690
            ],
            [
                9690,
                9894
            ],
            [
                9894,
                10316
            ],
            [
                10316,
                10828
            ],
            [
                10828,
                11411
            ],
            [
                11411,
                11439
            ],
            [
                11439,
                11521
            ],
            [
                11521,
                11670
            ],
            [
                11670,
                11830
            ],
            [
                11830,
                11973
            ],
            [
                11973,
                12010
            ],
            [
                12010,
                12078
            ],
            [
                12078,
                12163
            ],
            [
                12163,
                13097
            ],
            [
                13097,
                13363
            ],
            [
                13363,
                13392
            ],
            [
                13392,
                13442
            ],
            [
                13442,
                13487
            ],
            [
                13487,
                13756
            ],
            [
                13756,
                13835
            ],
            [
                13835,
                13932
            ],
            [
                13932,
                14124
            ],
            [
                14124,
                14219
            ],
            [
                14219,
                14394
            ],
            [
                14394,
                14525
            ],
            [
                14525,
                14719
            ],
            [
                14719,
                14756
            ],
            [
                14756,
                14853
            ],
            [
                14853,
                14881
            ],
            [
                14881,
                15239
            ],
            [
                15239,
                15297
            ],
            [
                15297,
                15470
            ],
            [
                15470,
                15782
            ],
            [
                15782,
                15904
            ],
            [
                15904,
                16385
            ],
            [
                16385,
                16561
            ],
            [
                16561,
                16926
            ],
            [
                16926,
                17101
            ],
            [
                17101,
                17372
            ],
            [
                17372,
                17640
            ],
            [
                17640,
                17756
            ],
            [
                17756,
                17808
            ],
            [
                17808,
                17916
            ],
            [
                17916,
                17937
            ],
            [
                17937,
                17999
            ],
            [
                17999,
                18036
            ],
            [
                18036,
                18163
            ],
            [
                18163,
                18475
            ],
            [
                18475,
                18566
            ],
            [
                18566,
                18617
            ],
            [
                18617,
                18720
            ],
            [
                18720,
                18788
            ],
            [
                18788,
                18906
            ],
            [
                18906,
                18964
            ],
            [
                18964,
                19128
            ],
            [
                19128,
                19352
            ],
            [
                19352,
                19799
            ],
            [
                19799,
                20218
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                217
            ],
            [
                217,
                352
            ],
            [
                352,
                394
            ],
            [
                394,
                555
            ],
            [
                555,
                648
            ],
            [
                648,
                816
            ],
            [
                816,
                1026
            ],
            [
                1026,
                1255
            ],
            [
                1255,
                1579
            ],
            [
                1579,
                1699
            ],
            [
                1699,
                1984
            ],
            [
                1984,
                2132
            ],
            [
                2132,
                2207
            ],
            [
                2207,
                2382
            ],
            [
                2382,
                2517
            ],
            [
                2517,
                2722
            ],
            [
                2722,
                2804
            ],
            [
                2804,
                2895
            ],
            [
                2895,
                2967
            ],
            [
                2967,
                3126
            ],
            [
                3126,
                3188
            ],
            [
                3188,
                3285
            ],
            [
                3285,
                3439
            ],
            [
                3439,
                3718
            ],
            [
                3718,
                3897
            ],
            [
                3897,
                3966
            ],
            [
                3966,
                4091
            ],
            [
                4091,
                4252
            ],
            [
                4252,
                4347
            ],
            [
                4347,
                4533
            ],
            [
                4533,
                4708
            ],
            [
                4708,
                4727
            ],
            [
                4727,
                4795
            ],
            [
                4795,
                4823
            ],
            [
                4823,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                4990
            ],
            [
                4990,
                5000
            ],
            [
                5000,
                5125
            ],
            [
                5125,
                5226
            ],
            [
                5226,
                5262
            ],
            [
                5262,
                5407
            ],
            [
                5407,
                5528
            ],
            [
                5528,
                5646
            ],
            [
                5646,
                5700
            ],
            [
                5700,
                5761
            ],
            [
                5761,
                5926
            ],
            [
                5926,
                6053
            ],
            [
                6053,
                6138
            ],
            [
                6138,
                6242
            ],
            [
                6242,
                6377
            ],
            [
                6377,
                6526
            ],
            [
                6526,
                6752
            ],
            [
                6752,
                6996
            ],
            [
                6996,
                7188
            ],
            [
                7188,
                7331
            ],
            [
                7331,
                7683
            ],
            [
                7683,
                7812
            ],
            [
                7812,
                7924
            ],
            [
                7924,
                8262
            ],
            [
                8262,
                8419
            ],
            [
                8419,
                8521
            ],
            [
                8521,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8744
            ],
            [
                8744,
                8792
            ],
            [
                8792,
                8815
            ],
            [
                8815,
                8844
            ],
            [
                8844,
                8849
            ],
            [
                8849,
                8911
            ],
            [
                8911,
                8979
            ],
            [
                8979,
                9030
            ],
            [
                9030,
                9165
            ],
            [
                9165,
                9321
            ],
            [
                9321,
                9352
            ],
            [
                9352,
                9397
            ],
            [
                9397,
                9574
            ],
            [
                9574,
                9690
            ],
            [
                9690,
                9818
            ],
            [
                9818,
                9894
            ],
            [
                9894,
                10199
            ],
            [
                10199,
                10245
            ],
            [
                10245,
                10316
            ],
            [
                10316,
                10424
            ],
            [
                10424,
                10694
            ],
            [
                10694,
                10828
            ],
            [
                10828,
                11060
            ],
            [
                11060,
                11115
            ],
            [
                11115,
                11208
            ],
            [
                11208,
                11308
            ],
            [
                11308,
                11411
            ],
            [
                11411,
                11439
            ],
            [
                11439,
                11521
            ],
            [
                11521,
                11551
            ],
            [
                11551,
                11670
            ],
            [
                11670,
                11727
            ],
            [
                11727,
                11772
            ],
            [
                11772,
                11830
            ],
            [
                11830,
                11973
            ],
            [
                11973,
                12010
            ],
            [
                12010,
                12078
            ],
            [
                12078,
                12163
            ],
            [
                12163,
                12231
            ],
            [
                12231,
                12371
            ],
            [
                12371,
                12727
            ],
            [
                12727,
                12930
            ],
            [
                12930,
                13097
            ],
            [
                13097,
                13296
            ],
            [
                13296,
                13363
            ],
            [
                13363,
                13392
            ],
            [
                13392,
                13442
            ],
            [
                13442,
                13487
            ],
            [
                13487,
                13616
            ],
            [
                13616,
                13641
            ],
            [
                13641,
                13756
            ],
            [
                13756,
                13793
            ],
            [
                13793,
                13835
            ],
            [
                13835,
                13874
            ],
            [
                13874,
                13932
            ],
            [
                13932,
                13956
            ],
            [
                13956,
                13983
            ],
            [
                13983,
                14124
            ],
            [
                14124,
                14130
            ],
            [
                14130,
                14154
            ],
            [
                14154,
                14219
            ],
            [
                14219,
                14288
            ],
            [
                14288,
                14394
            ],
            [
                14394,
                14525
            ],
            [
                14525,
                14571
            ],
            [
                14571,
                14639
            ],
            [
                14639,
                14719
            ],
            [
                14719,
                14756
            ],
            [
                14756,
                14762
            ],
            [
                14762,
                14798
            ],
            [
                14798,
                14853
            ],
            [
                14853,
                14881
            ],
            [
                14881,
                14931
            ],
            [
                14931,
                15063
            ],
            [
                15063,
                15239
            ],
            [
                15239,
                15259
            ],
            [
                15259,
                15297
            ],
            [
                15297,
                15429
            ],
            [
                15429,
                15470
            ],
            [
                15470,
                15545
            ],
            [
                15545,
                15682
            ],
            [
                15682,
                15782
            ],
            [
                15782,
                15866
            ],
            [
                15866,
                15904
            ],
            [
                15904,
                15982
            ],
            [
                15982,
                16208
            ],
            [
                16208,
                16300
            ],
            [
                16300,
                16351
            ],
            [
                16351,
                16385
            ],
            [
                16385,
                16435
            ],
            [
                16435,
                16561
            ],
            [
                16561,
                16845
            ],
            [
                16845,
                16926
            ],
            [
                16926,
                17015
            ],
            [
                17015,
                17049
            ],
            [
                17049,
                17101
            ],
            [
                17101,
                17201
            ],
            [
                17201,
                17226
            ],
            [
                17226,
                17319
            ],
            [
                17319,
                17372
            ],
            [
                17372,
                17424
            ],
            [
                17424,
                17464
            ],
            [
                17464,
                17640
            ],
            [
                17640,
                17717
            ],
            [
                17717,
                17756
            ],
            [
                17756,
                17808
            ],
            [
                17808,
                17870
            ],
            [
                17870,
                17916
            ],
            [
                17916,
                17937
            ],
            [
                17937,
                17965
            ],
            [
                17965,
                17999
            ],
            [
                17999,
                18036
            ],
            [
                18036,
                18163
            ],
            [
                18163,
                18364
            ],
            [
                18364,
                18475
            ],
            [
                18475,
                18533
            ],
            [
                18533,
                18566
            ],
            [
                18566,
                18617
            ],
            [
                18617,
                18671
            ],
            [
                18671,
                18720
            ],
            [
                18720,
                18767
            ],
            [
                18767,
                18788
            ],
            [
                18788,
                18906
            ],
            [
                18906,
                18950
            ],
            [
                18950,
                18964
            ],
            [
                18964,
                19128
            ],
            [
                19128,
                19196
            ],
            [
                19196,
                19304
            ],
            [
                19304,
                19352
            ],
            [
                19352,
                19413
            ],
            [
                19413,
                19466
            ],
            [
                19466,
                19610
            ],
            [
                19610,
                19647
            ],
            [
                19647,
                19799
            ],
            [
                19799,
                19828
            ],
            [
                19828,
                19996
            ],
            [
                19996,
                20218
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                9,
                18
            ],
            [
                20,
                25
            ],
            [
                26,
                30
            ],
            [
                31,
                92
            ],
            [
                102,
                108
            ],
            [
                108,
                120
            ],
            [
                121,
                131
            ],
            [
                131,
                173
            ],
            [
                174,
                205
            ],
            [
                206,
                217
            ],
            [
                217,
                231
            ],
            [
                232,
                239
            ],
            [
                240,
                241
            ],
            [
                242,
                247
            ],
            [
                248,
                352
            ],
            [
                352,
                374
            ],
            [
                377,
                393
            ],
            [
                394,
                406
            ],
            [
                412,
                420
            ],
            [
                425,
                441
            ],
            [
                442,
                445
            ],
            [
                452,
                463
            ],
            [
                464,
                470
            ],
            [
                471,
                526
            ],
            [
                544,
                553
            ],
            [
                553,
                555
            ],
            [
                555,
                565
            ],
            [
                566,
                592
            ],
            [
                598,
                620
            ],
            [
                646,
                648
            ],
            [
                648,
                656
            ],
            [
                657,
                666
            ],
            [
                675,
                728
            ],
            [
                728,
                729
            ],
            [
                730,
                764
            ],
            [
                769,
                773
            ],
            [
                774,
                777
            ],
            [
                778,
                816
            ],
            [
                816,
                818
            ],
            [
                827,
                840
            ],
            [
                841,
                864
            ],
            [
                865,
                869
            ],
            [
                870,
                884
            ],
            [
                885,
                896
            ],
            [
                905,
                906
            ],
            [
                915,
                926
            ],
            [
                926,
                927
            ],
            [
                932,
                950
            ],
            [
                951,
                954
            ],
            [
                955,
                961
            ],
            [
                962,
                976
            ],
            [
                977,
                982
            ],
            [
                983,
                984
            ],
            [
                985,
                1011
            ],
            [
                1012,
                1019
            ],
            [
                1024,
                1026
            ],
            [
                1026,
                1029
            ],
            [
                1030,
                1053
            ],
            [
                1054,
                1058
            ],
            [
                1059,
                1061
            ],
            [
                1062,
                1081
            ],
            [
                1082,
                1084
            ],
            [
                1103,
                1106
            ],
            [
                1107,
                1118
            ],
            [
                1126,
                1128
            ],
            [
                1133,
                1157
            ],
            [
                1157,
                1158
            ],
            [
                1159,
                1196
            ],
            [
                1197,
                1254
            ],
            [
                1255,
                1262
            ],
            [
                1267,
                1274
            ],
            [
                1284,
                1286
            ],
            [
                1295,
                1424
            ],
            [
                1425,
                1437
            ],
            [
                1438,
                1468
            ],
            [
                1469,
                1493
            ],
            [
                1501,
                1502
            ],
            [
                1503,
                1563
            ],
            [
                1563,
                1564
            ],
            [
                1565,
                1572
            ],
            [
                1573,
                1577
            ],
            [
                1592,
                1606
            ],
            [
                1607,
                1630
            ],
            [
                1641,
                1647
            ],
            [
                1656,
                1698
            ],
            [
                1699,
                1722
            ],
            [
                1723,
                1730
            ],
            [
                1745,
                1749
            ],
            [
                1750,
                1761
            ],
            [
                1766,
                1793
            ],
            [
                1796,
                1901
            ],
            [
                1902,
                1909
            ],
            [
                1910,
                1937
            ],
            [
                1960,
                1984
            ],
            [
                1984,
                1986
            ],
            [
                1987,
                1994
            ],
            [
                2000,
                2034
            ],
            [
                2044,
                2132
            ],
            [
                2132,
                2207
            ],
            [
                2211,
                2217
            ],
            [
                2218,
                2241
            ],
            [
                2242,
                2244
            ],
            [
                2245,
                2252
            ],
            [
                2253,
                2267
            ],
            [
                2268,
                2270
            ],
            [
                2284,
                2287
            ],
            [
                2305,
                2316
            ],
            [
                2327,
                2343
            ],
            [
                2344,
                2354
            ],
            [
                2355,
                2380
            ],
            [
                2380,
                2382
            ],
            [
                2382,
                2384
            ],
            [
                2385,
                2416
            ],
            [
                2416,
                2464
            ],
            [
                2465,
                2471
            ],
            [
                2472,
                2478
            ],
            [
                2479,
                2502
            ],
            [
                2506,
                2515
            ],
            [
                2515,
                2517
            ],
            [
                2520,
                2527
            ],
            [
                2528,
                2547
            ],
            [
                2548,
                2615
            ],
            [
                2616,
                2640
            ],
            [
                2641,
                2642
            ],
            [
                2643,
                2655
            ],
            [
                2655,
                2656
            ],
            [
                2667,
                2669
            ],
            [
                2680,
                2688
            ],
            [
                2698,
                2708
            ],
            [
                2716,
                2720
            ],
            [
                2722,
                2755
            ],
            [
                2766,
                2769
            ],
            [
                2780,
                2802
            ],
            [
                2804,
                2834
            ],
            [
                2835,
                2895
            ],
            [
                2895,
                2949
            ],
            [
                2950,
                2952
            ],
            [
                2953,
                2965
            ],
            [
                2967,
                2974
            ],
            [
                2974,
                2975
            ],
            [
                2976,
                3048
            ],
            [
                3049,
                3073
            ],
            [
                3087,
                3124
            ],
            [
                3124,
                3126
            ],
            [
                3126,
                3130
            ],
            [
                3137,
                3173
            ],
            [
                3178,
                3186
            ],
            [
                3188,
                3285
            ],
            [
                3285,
                3307
            ],
            [
                3308,
                3438
            ],
            [
                3439,
                3442
            ],
            [
                3443,
                3454
            ],
            [
                3460,
                3467
            ],
            [
                3474,
                3526
            ],
            [
                3538,
                3577
            ],
            [
                3578,
                3590
            ],
            [
                3591,
                3593
            ],
            [
                3603,
                3612
            ],
            [
                3612,
                3613
            ],
            [
                3621,
                3664
            ],
            [
                3665,
                3674
            ],
            [
                3675,
                3687
            ],
            [
                3688,
                3701
            ],
            [
                3702,
                3707
            ],
            [
                3708,
                3718
            ],
            [
                3718,
                3764
            ],
            [
                3774,
                3897
            ],
            [
                3897,
                3936
            ],
            [
                3941,
                3966
            ],
            [
                3966,
                3997
            ],
            [
                3998,
                4002
            ],
            [
                4003,
                4035
            ],
            [
                4036,
                4038
            ],
            [
                4039,
                4089
            ],
            [
                4089,
                4091
            ],
            [
                4091,
                4093
            ],
            [
                4100,
                4106
            ],
            [
                4121,
                4149
            ],
            [
                4150,
                4195
            ],
            [
                4219,
                4228
            ],
            [
                4234,
                4250
            ],
            [
                4250,
                4252
            ],
            [
                4252,
                4306
            ],
            [
                4306,
                4347
            ],
            [
                4347,
                4357
            ],
            [
                4368,
                4439
            ],
            [
                4439,
                4458
            ],
            [
                4464,
                4470
            ],
            [
                4471,
                4472
            ],
            [
                4473,
                4478
            ],
            [
                4479,
                4531
            ],
            [
                4531,
                4533
            ],
            [
                4533,
                4618
            ],
            [
                4620,
                4656
            ],
            [
                4660,
                4664
            ],
            [
                4665,
                4708
            ],
            [
                4708,
                4727
            ],
            [
                4727,
                4795
            ],
            [
                4795,
                4804
            ],
            [
                4811,
                4821
            ],
            [
                4821,
                4823
            ],
            [
                4823,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                4990
            ],
            [
                4990,
                5000
            ],
            [
                5000,
                5042
            ],
            [
                5043,
                5072
            ],
            [
                5072,
                5073
            ],
            [
                5074,
                5101
            ],
            [
                5108,
                5113
            ],
            [
                5118,
                5122
            ],
            [
                5125,
                5226
            ],
            [
                5226,
                5262
            ],
            [
                5262,
                5299
            ],
            [
                5303,
                5385
            ],
            [
                5393,
                5407
            ],
            [
                5407,
                5512
            ],
            [
                5513,
                5526
            ],
            [
                5526,
                5528
            ],
            [
                5528,
                5589
            ],
            [
                5592,
                5646
            ],
            [
                5646,
                5700
            ],
            [
                5700,
                5701
            ],
            [
                5707,
                5713
            ],
            [
                5714,
                5737
            ],
            [
                5744,
                5761
            ],
            [
                5761,
                5846
            ],
            [
                5853,
                5896
            ],
            [
                5903,
                5906
            ],
            [
                5916,
                5926
            ],
            [
                5926,
                5943
            ],
            [
                5950,
                5968
            ],
            [
                5970,
                5986
            ],
            [
                6002,
                6053
            ],
            [
                6053,
                6079
            ],
            [
                6080,
                6107
            ],
            [
                6108,
                6138
            ],
            [
                6141,
                6162
            ],
            [
                6162,
                6163
            ],
            [
                6164,
                6203
            ],
            [
                6210,
                6242
            ],
            [
                6281,
                6284
            ],
            [
                6292,
                6357
            ],
            [
                6366,
                6371
            ],
            [
                6375,
                6376
            ],
            [
                6377,
                6389
            ],
            [
                6390,
                6445
            ],
            [
                6447,
                6450
            ],
            [
                6451,
                6486
            ],
            [
                6487,
                6490
            ],
            [
                6503,
                6526
            ],
            [
                6526,
                6571
            ],
            [
                6584,
                6596
            ],
            [
                6596,
                6602
            ],
            [
                6622,
                6625
            ],
            [
                6626,
                6628
            ],
            [
                6629,
                6657
            ],
            [
                6658,
                6662
            ],
            [
                6668,
                6669
            ],
            [
                6682,
                6684
            ],
            [
                6685,
                6701
            ],
            [
                6702,
                6710
            ],
            [
                6711,
                6714
            ],
            [
                6729,
                6731
            ],
            [
                6735,
                6752
            ],
            [
                6752,
                6863
            ],
            [
                6866,
                6873
            ],
            [
                6877,
                6919
            ],
            [
                6919,
                6996
            ],
            [
                6996,
                7003
            ],
            [
                7014,
                7018
            ],
            [
                7019,
                7033
            ],
            [
                7034,
                7035
            ],
            [
                7036,
                7085
            ],
            [
                7086,
                7088
            ],
            [
                7098,
                7149
            ],
            [
                7150,
                7167
            ],
            [
                7168,
                7186
            ],
            [
                7186,
                7187
            ],
            [
                7188,
                7309
            ],
            [
                7310,
                7319
            ],
            [
                7322,
                7329
            ],
            [
                7329,
                7331
            ],
            [
                7331,
                7393
            ],
            [
                7393,
                7394
            ],
            [
                7395,
                7398
            ],
            [
                7410,
                7416
            ],
            [
                7417,
                7442
            ],
            [
                7444,
                7465
            ],
            [
                7469,
                7472
            ],
            [
                7473,
                7481
            ],
            [
                7482,
                7501
            ],
            [
                7502,
                7507
            ],
            [
                7507,
                7520
            ],
            [
                7521,
                7527
            ],
            [
                7530,
                7572
            ],
            [
                7573,
                7579
            ],
            [
                7585,
                7590
            ],
            [
                7591,
                7666
            ],
            [
                7677,
                7683
            ],
            [
                7683,
                7696
            ],
            [
                7697,
                7709
            ],
            [
                7719,
                7742
            ],
            [
                7743,
                7745
            ],
            [
                7746,
                7772
            ],
            [
                7772,
                7788
            ],
            [
                7789,
                7810
            ],
            [
                7810,
                7812
            ],
            [
                7812,
                7923
            ],
            [
                7924,
                7950
            ],
            [
                7951,
                8059
            ],
            [
                8059,
                8084
            ],
            [
                8085,
                8138
            ],
            [
                8138,
                8163
            ],
            [
                8164,
                8165
            ],
            [
                8166,
                8181
            ],
            [
                8182,
                8223
            ],
            [
                8224,
                8235
            ],
            [
                8236,
                8238
            ],
            [
                8249,
                8262
            ],
            [
                8262,
                8279
            ],
            [
                8280,
                8284
            ],
            [
                8285,
                8295
            ],
            [
                8296,
                8298
            ],
            [
                8306,
                8383
            ],
            [
                8385,
                8419
            ],
            [
                8419,
                8424
            ],
            [
                8425,
                8438
            ],
            [
                8439,
                8443
            ],
            [
                8443,
                8521
            ],
            [
                8521,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8612
            ],
            [
                8613,
                8643
            ],
            [
                8652,
                8673
            ],
            [
                8674,
                8678
            ],
            [
                8679,
                8702
            ],
            [
                8714,
                8742
            ],
            [
                8742,
                8744
            ],
            [
                8744,
                8792
            ],
            [
                8792,
                8815
            ],
            [
                8815,
                8844
            ],
            [
                8844,
                8849
            ],
            [
                8849,
                8911
            ],
            [
                8911,
                8937
            ],
            [
                8940,
                8979
            ],
            [
                8979,
                9030
            ],
            [
                9030,
                9139
            ],
            [
                9140,
                9150
            ],
            [
                9151,
                9165
            ],
            [
                9165,
                9210
            ],
            [
                9215,
                9277
            ],
            [
                9281,
                9294
            ],
            [
                9295,
                9299
            ],
            [
                9303,
                9311
            ],
            [
                9312,
                9319
            ],
            [
                9321,
                9352
            ],
            [
                9352,
                9359
            ],
            [
                9369,
                9376
            ],
            [
                9377,
                9380
            ],
            [
                9381,
                9389
            ],
            [
                9389,
                9397
            ],
            [
                9397,
                9480
            ],
            [
                9481,
                9552
            ],
            [
                9553,
                9572
            ],
            [
                9574,
                9580
            ],
            [
                9585,
                9604
            ],
            [
                9610,
                9690
            ],
            [
                9690,
                9726
            ],
            [
                9727,
                9816
            ],
            [
                9818,
                9860
            ],
            [
                9866,
                9894
            ],
            [
                9894,
                9901
            ],
            [
                9902,
                9905
            ],
            [
                9908,
                9921
            ],
            [
                9926,
                9943
            ],
            [
                9947,
                9961
            ],
            [
                9966,
                10006
            ],
            [
                10018,
                10030
            ],
            [
                10031,
                10045
            ],
            [
                10046,
                10092
            ],
            [
                10104,
                10132
            ],
            [
                10133,
                10136
            ],
            [
                10149,
                10197
            ],
            [
                10197,
                10199
            ],
            [
                10199,
                10242
            ],
            [
                10245,
                10269
            ],
            [
                10270,
                10295
            ],
            [
                10298,
                10316
            ],
            [
                10316,
                10323
            ],
            [
                10329,
                10393
            ],
            [
                10402,
                10413
            ],
            [
                10414,
                10417
            ],
            [
                10422,
                10424
            ],
            [
                10424,
                10543
            ],
            [
                10551,
                10568
            ],
            [
                10568,
                10588
            ],
            [
                10595,
                10683
            ],
            [
                10684,
                10694
            ],
            [
                10694,
                10714
            ],
            [
                10715,
                10722
            ],
            [
                10725,
                10730
            ],
            [
                10739,
                10827
            ],
            [
                10828,
                10859
            ],
            [
                10864,
                10872
            ],
            [
                10873,
                10914
            ],
            [
                10917,
                11019
            ],
            [
                11020,
                11023
            ],
            [
                11035,
                11060
            ],
            [
                11060,
                11115
            ],
            [
                11115,
                11177
            ],
            [
                11177,
                11178
            ],
            [
                11179,
                11195
            ],
            [
                11196,
                11206
            ],
            [
                11206,
                11208
            ],
            [
                11208,
                11264
            ],
            [
                11271,
                11299
            ],
            [
                11303,
                11308
            ],
            [
                11312,
                11320
            ],
            [
                11326,
                11332
            ],
            [
                11333,
                11409
            ],
            [
                11411,
                11439
            ],
            [
                11439,
                11496
            ],
            [
                11496,
                11504
            ],
            [
                11504,
                11519
            ],
            [
                11521,
                11534
            ],
            [
                11535,
                11549
            ],
            [
                11551,
                11558
            ],
            [
                11559,
                11594
            ],
            [
                11594,
                11596
            ],
            [
                11597,
                11610
            ],
            [
                11610,
                11611
            ],
            [
                11612,
                11615
            ],
            [
                11623,
                11668
            ],
            [
                11670,
                11727
            ],
            [
                11727,
                11772
            ],
            [
                11772,
                11830
            ],
            [
                11830,
                11853
            ],
            [
                11854,
                11878
            ],
            [
                11879,
                11881
            ],
            [
                11882,
                11895
            ],
            [
                11895,
                11917
            ],
            [
                11917,
                11920
            ],
            [
                11921,
                11929
            ],
            [
                11934,
                11939
            ],
            [
                11940,
                11970
            ],
            [
                11973,
                12008
            ],
            [
                12008,
                12010
            ],
            [
                12010,
                12078
            ],
            [
                12078,
                12106
            ],
            [
                12109,
                12130
            ],
            [
                12130,
                12145
            ],
            [
                12146,
                12163
            ],
            [
                12163,
                12231
            ],
            [
                12231,
                12371
            ],
            [
                12371,
                12432
            ],
            [
                12433,
                12520
            ],
            [
                12527,
                12684
            ],
            [
                12684,
                12685
            ],
            [
                12686,
                12725
            ],
            [
                12725,
                12727
            ],
            [
                12727,
                12761
            ],
            [
                12764,
                12777
            ],
            [
                12783,
                12840
            ],
            [
                12841,
                12844
            ],
            [
                12845,
                12853
            ],
            [
                12854,
                12868
            ],
            [
                12877,
                12928
            ],
            [
                12928,
                12929
            ],
            [
                12934,
                13080
            ],
            [
                13081,
                13086
            ],
            [
                13089,
                13095
            ],
            [
                13106,
                13115
            ],
            [
                13120,
                13127
            ],
            [
                13141,
                13146
            ],
            [
                13156,
                13296
            ],
            [
                13296,
                13300
            ],
            [
                13301,
                13311
            ],
            [
                13322,
                13323
            ],
            [
                13324,
                13361
            ],
            [
                13363,
                13392
            ],
            [
                13392,
                13425
            ],
            [
                13440,
                13442
            ],
            [
                13442,
                13487
            ],
            [
                13487,
                13533
            ],
            [
                13534,
                13542
            ],
            [
                13542,
                13616
            ],
            [
                13616,
                13641
            ],
            [
                13641,
                13699
            ],
            [
                13700,
                13756
            ],
            [
                13756,
                13793
            ],
            [
                13793,
                13835
            ],
            [
                13835,
                13836
            ],
            [
                13836,
                13838
            ],
            [
                13842,
                13874
            ],
            [
                13874,
                13932
            ],
            [
                13932,
                13937
            ],
            [
                13938,
                13941
            ],
            [
                13942,
                13956
            ],
            [
                13956,
                13983
            ],
            [
                13983,
                14124
            ],
            [
                14124,
                14130
            ],
            [
                14130,
                14154
            ],
            [
                14154,
                14219
            ],
            [
                14219,
                14246
            ],
            [
                14246,
                14270
            ],
            [
                14282,
                14286
            ],
            [
                14286,
                14288
            ],
            [
                14288,
                14290
            ],
            [
                14295,
                14344
            ],
            [
                14345,
                14349
            ],
            [
                14353,
                14375
            ],
            [
                14387,
                14392
            ],
            [
                14392,
                14394
            ],
            [
                14394,
                14423
            ],
            [
                14424,
                14471
            ],
            [
                14483,
                14525
            ],
            [
                14525,
                14571
            ],
            [
                14571,
                14637
            ],
            [
                14637,
                14639
            ],
            [
                14639,
                14717
            ],
            [
                14719,
                14729
            ],
            [
                14735,
                14753
            ],
            [
                14753,
                14756
            ],
            [
                14756,
                14757
            ],
            [
                14760,
                14762
            ],
            [
                14762,
                14796
            ],
            [
                14796,
                14798
            ],
            [
                14798,
                14807
            ],
            [
                14816,
                14827
            ],
            [
                14836,
                14846
            ],
            [
                14853,
                14881
            ],
            [
                14881,
                14893
            ],
            [
                14902,
                14931
            ],
            [
                14931,
                14946
            ],
            [
                14946,
                14963
            ],
            [
                14963,
                15050
            ],
            [
                15051,
                15063
            ],
            [
                15063,
                15097
            ],
            [
                15098,
                15101
            ],
            [
                15102,
                15129
            ],
            [
                15132,
                15239
            ],
            [
                15239,
                15257
            ],
            [
                15259,
                15297
            ],
            [
                15298,
                15406
            ],
            [
                15407,
                15410
            ],
            [
                15417,
                15419
            ],
            [
                15427,
                15429
            ],
            [
                15429,
                15470
            ],
            [
                15470,
                15516
            ],
            [
                15517,
                15545
            ],
            [
                15545,
                15566
            ],
            [
                15567,
                15668
            ],
            [
                15674,
                15682
            ],
            [
                15682,
                15685
            ],
            [
                15706,
                15708
            ],
            [
                15717,
                15731
            ],
            [
                15738,
                15766
            ],
            [
                15767,
                15771
            ],
            [
                15772,
                15780
            ],
            [
                15780,
                15782
            ],
            [
                15782,
                15866
            ],
            [
                15866,
                15880
            ],
            [
                15889,
                15901
            ],
            [
                15904,
                15958
            ],
            [
                15961,
                15982
            ],
            [
                15982,
                15989
            ],
            [
                16002,
                16006
            ],
            [
                16017,
                16208
            ],
            [
                16208,
                16226
            ],
            [
                16226,
                16246
            ],
            [
                16247,
                16248
            ],
            [
                16249,
                16270
            ],
            [
                16271,
                16273
            ],
            [
                16274,
                16276
            ],
            [
                16284,
                16300
            ],
            [
                16300,
                16351
            ],
            [
                16351,
                16373
            ],
            [
                16374,
                16377
            ],
            [
                16377,
                16385
            ],
            [
                16387,
                16394
            ],
            [
                16395,
                16398
            ],
            [
                16399,
                16425
            ],
            [
                16433,
                16435
            ],
            [
                16435,
                16440
            ],
            [
                16450,
                16506
            ],
            [
                16507,
                16520
            ],
            [
                16526,
                16560
            ],
            [
                16561,
                16604
            ],
            [
                16614,
                16696
            ],
            [
                16697,
                16845
            ],
            [
                16845,
                16924
            ],
            [
                16926,
                16935
            ],
            [
                16936,
                16969
            ],
            [
                16972,
                17013
            ],
            [
                17013,
                17015
            ],
            [
                17015,
                17025
            ],
            [
                17026,
                17034
            ],
            [
                17035,
                17047
            ],
            [
                17047,
                17049
            ],
            [
                17049,
                17101
            ],
            [
                17101,
                17193
            ],
            [
                17194,
                17199
            ],
            [
                17201,
                17226
            ],
            [
                17226,
                17229
            ],
            [
                17230,
                17284
            ],
            [
                17287,
                17319
            ],
            [
                17319,
                17351
            ],
            [
                17354,
                17372
            ],
            [
                17372,
                17424
            ],
            [
                17424,
                17447
            ],
            [
                17449,
                17464
            ],
            [
                17464,
                17475
            ],
            [
                17482,
                17571
            ],
            [
                17572,
                17597
            ],
            [
                17616,
                17640
            ],
            [
                17640,
                17668
            ],
            [
                17680,
                17685
            ],
            [
                17692,
                17717
            ],
            [
                17717,
                17756
            ],
            [
                17756,
                17799
            ],
            [
                17800,
                17808
            ],
            [
                17808,
                17837
            ],
            [
                17839,
                17870
            ],
            [
                17870,
                17916
            ],
            [
                17916,
                17937
            ],
            [
                17937,
                17965
            ],
            [
                17965,
                17976
            ],
            [
                17977,
                17999
            ],
            [
                17999,
                18036
            ],
            [
                18036,
                18090
            ],
            [
                18091,
                18163
            ],
            [
                18163,
                18306
            ],
            [
                18307,
                18364
            ],
            [
                18364,
                18475
            ],
            [
                18475,
                18533
            ],
            [
                18533,
                18566
            ],
            [
                18566,
                18617
            ],
            [
                18617,
                18648
            ],
            [
                18659,
                18669
            ],
            [
                18669,
                18671
            ],
            [
                18671,
                18720
            ],
            [
                18720,
                18767
            ],
            [
                18767,
                18779
            ],
            [
                18786,
                18788
            ],
            [
                18788,
                18803
            ],
            [
                18803,
                18906
            ],
            [
                18906,
                18950
            ],
            [
                18950,
                18962
            ],
            [
                18962,
                18964
            ],
            [
                18964,
                18980
            ],
            [
                18981,
                19011
            ],
            [
                19020,
                19024
            ],
            [
                19024,
                19025
            ],
            [
                19026,
                19046
            ],
            [
                19046,
                19047
            ],
            [
                19048,
                19050
            ],
            [
                19051,
                19076
            ],
            [
                19085,
                19088
            ],
            [
                19089,
                19092
            ],
            [
                19093,
                19101
            ],
            [
                19102,
                19110
            ],
            [
                19110,
                19126
            ],
            [
                19128,
                19129
            ],
            [
                19138,
                19196
            ],
            [
                19196,
                19304
            ],
            [
                19304,
                19349
            ],
            [
                19349,
                19352
            ],
            [
                19352,
                19378
            ],
            [
                19390,
                19411
            ],
            [
                19411,
                19413
            ],
            [
                19413,
                19433
            ],
            [
                19444,
                19466
            ],
            [
                19466,
                19531
            ],
            [
                19536,
                19541
            ],
            [
                19547,
                19560
            ],
            [
                19561,
                19563
            ],
            [
                19564,
                19585
            ],
            [
                19586,
                19592
            ],
            [
                19593,
                19596
            ],
            [
                19597,
                19603
            ],
            [
                19604,
                19610
            ],
            [
                19610,
                19647
            ],
            [
                19647,
                19650
            ],
            [
                19651,
                19670
            ],
            [
                19681,
                19704
            ],
            [
                19705,
                19708
            ],
            [
                19709,
                19715
            ],
            [
                19716,
                19798
            ],
            [
                19799,
                19828
            ],
            [
                19828,
                19849
            ],
            [
                19850,
                19890
            ],
            [
                19896,
                19901
            ],
            [
                19901,
                19996
            ],
            [
                19996,
                20040
            ],
            [
                20041,
                20095
            ],
            [
                20097,
                20099
            ],
            [
                20100,
                20107
            ],
            [
                20110,
                20123
            ],
            [
                20124,
                20127
            ],
            [
                20128,
                20217
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                108
            ],
            [
                108,
                217
            ],
            [
                217,
                352
            ],
            [
                352,
                394
            ],
            [
                394,
                555
            ],
            [
                555,
                648
            ],
            [
                648,
                816
            ],
            [
                816,
                1026
            ],
            [
                1026,
                1255
            ],
            [
                1255,
                1255
            ],
            [
                1255,
                1699
            ],
            [
                1699,
                1699
            ],
            [
                1699,
                1984
            ],
            [
                1984,
                2132
            ],
            [
                2132,
                2207
            ],
            [
                2207,
                2382
            ],
            [
                2382,
                2517
            ],
            [
                2517,
                2722
            ],
            [
                2722,
                2804
            ],
            [
                2804,
                2895
            ],
            [
                2895,
                3126
            ],
            [
                3126,
                3188
            ],
            [
                3188,
                3285
            ],
            [
                3285,
                3439
            ],
            [
                3439,
                3718
            ],
            [
                3718,
                3897
            ],
            [
                3897,
                3966
            ],
            [
                3966,
                4091
            ],
            [
                4091,
                4252
            ],
            [
                4252,
                4347
            ],
            [
                4347,
                4533
            ],
            [
                4533,
                4708
            ],
            [
                4708,
                4727
            ],
            [
                4727,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4823
            ],
            [
                4823,
                4856
            ],
            [
                4856,
                4922
            ],
            [
                4922,
                4990
            ],
            [
                4990,
                5000
            ],
            [
                5000,
                5000
            ],
            [
                5000,
                5125
            ],
            [
                5125,
                5125
            ],
            [
                5125,
                5226
            ],
            [
                5226,
                5262
            ],
            [
                5262,
                5407
            ],
            [
                5407,
                5528
            ],
            [
                5528,
                5646
            ],
            [
                5646,
                5646
            ],
            [
                5646,
                5646
            ],
            [
                5646,
                5700
            ],
            [
                5700,
                5761
            ],
            [
                5761,
                5926
            ],
            [
                5926,
                6053
            ],
            [
                6053,
                6138
            ],
            [
                6138,
                6242
            ],
            [
                6242,
                6377
            ],
            [
                6377,
                6377
            ],
            [
                6377,
                6526
            ],
            [
                6526,
                6752
            ],
            [
                6752,
                6996
            ],
            [
                6996,
                7188
            ],
            [
                7188,
                7188
            ],
            [
                7188,
                7188
            ],
            [
                7188,
                7331
            ],
            [
                7331,
                7683
            ],
            [
                7683,
                7812
            ],
            [
                7812,
                7924
            ],
            [
                7924,
                8262
            ],
            [
                8262,
                8419
            ],
            [
                8419,
                8521
            ],
            [
                8521,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8744
            ],
            [
                8744,
                8792
            ],
            [
                8792,
                8815
            ],
            [
                8815,
                8844
            ],
            [
                8844,
                8849
            ],
            [
                8849,
                8911
            ],
            [
                8911,
                8979
            ],
            [
                8979,
                9030
            ],
            [
                9030,
                9165
            ],
            [
                9165,
                9321
            ],
            [
                9321,
                9352
            ],
            [
                9352,
                9397
            ],
            [
                9397,
                9690
            ],
            [
                9690,
                9818
            ],
            [
                9818,
                9894
            ],
            [
                9894,
                10199
            ],
            [
                10199,
                10245
            ],
            [
                10245,
                10245
            ],
            [
                10245,
                10316
            ],
            [
                10316,
                10424
            ],
            [
                10424,
                10694
            ],
            [
                10694,
                10828
            ],
            [
                10828,
                11060
            ],
            [
                11060,
                11115
            ],
            [
                11115,
                11208
            ],
            [
                11208,
                11308
            ],
            [
                11308,
                11411
            ],
            [
                11411,
                11439
            ],
            [
                11439,
                11521
            ],
            [
                11521,
                11670
            ],
            [
                11670,
                11727
            ],
            [
                11727,
                11772
            ],
            [
                11772,
                11772
            ],
            [
                11772,
                11830
            ],
            [
                11830,
                11973
            ],
            [
                11973,
                12010
            ],
            [
                12010,
                12078
            ],
            [
                12078,
                12163
            ],
            [
                12163,
                12231
            ],
            [
                12231,
                12371
            ],
            [
                12371,
                12727
            ],
            [
                12727,
                13097
            ],
            [
                13097,
                13296
            ],
            [
                13296,
                13363
            ],
            [
                13363,
                13392
            ],
            [
                13392,
                13442
            ],
            [
                13442,
                13487
            ],
            [
                13487,
                13616
            ],
            [
                13616,
                13641
            ],
            [
                13641,
                13756
            ],
            [
                13756,
                13793
            ],
            [
                13793,
                13835
            ],
            [
                13835,
                13874
            ],
            [
                13874,
                13932
            ],
            [
                13932,
                13956
            ],
            [
                13956,
                13983
            ],
            [
                13983,
                14124
            ],
            [
                14124,
                14130
            ],
            [
                14130,
                14154
            ],
            [
                14154,
                14219
            ],
            [
                14219,
                14288
            ],
            [
                14288,
                14394
            ],
            [
                14394,
                14525
            ],
            [
                14525,
                14571
            ],
            [
                14571,
                14639
            ],
            [
                14639,
                14719
            ],
            [
                14719,
                14756
            ],
            [
                14756,
                14762
            ],
            [
                14762,
                14798
            ],
            [
                14798,
                14853
            ],
            [
                14853,
                14881
            ],
            [
                14881,
                14931
            ],
            [
                14931,
                15063
            ],
            [
                15063,
                15239
            ],
            [
                15239,
                15297
            ],
            [
                15297,
                15297
            ],
            [
                15297,
                15429
            ],
            [
                15429,
                15470
            ],
            [
                15470,
                15545
            ],
            [
                15545,
                15682
            ],
            [
                15682,
                15782
            ],
            [
                15782,
                15866
            ],
            [
                15866,
                15904
            ],
            [
                15904,
                15982
            ],
            [
                15982,
                15982
            ],
            [
                15982,
                16208
            ],
            [
                16208,
                16300
            ],
            [
                16300,
                16351
            ],
            [
                16351,
                16351
            ],
            [
                16351,
                16351
            ],
            [
                16351,
                16385
            ],
            [
                16385,
                16435
            ],
            [
                16435,
                16561
            ],
            [
                16561,
                16845
            ],
            [
                16845,
                16845
            ],
            [
                16845,
                16926
            ],
            [
                16926,
                17015
            ],
            [
                17015,
                17049
            ],
            [
                17049,
                17101
            ],
            [
                17101,
                17201
            ],
            [
                17201,
                17226
            ],
            [
                17226,
                17319
            ],
            [
                17319,
                17372
            ],
            [
                17372,
                17424
            ],
            [
                17424,
                17464
            ],
            [
                17464,
                17640
            ],
            [
                17640,
                17717
            ],
            [
                17717,
                17756
            ],
            [
                17756,
                17808
            ],
            [
                17808,
                17870
            ],
            [
                17870,
                17916
            ],
            [
                17916,
                17937
            ],
            [
                17937,
                17965
            ],
            [
                17965,
                17999
            ],
            [
                17999,
                18036
            ],
            [
                18036,
                18163
            ],
            [
                18163,
                18364
            ],
            [
                18364,
                18475
            ],
            [
                18475,
                18533
            ],
            [
                18533,
                18566
            ],
            [
                18566,
                18617
            ],
            [
                18617,
                18671
            ],
            [
                18671,
                18720
            ],
            [
                18720,
                18767
            ],
            [
                18767,
                18788
            ],
            [
                18788,
                18906
            ],
            [
                18906,
                18950
            ],
            [
                18950,
                18964
            ],
            [
                18964,
                19128
            ],
            [
                19128,
                19196
            ],
            [
                19196,
                19304
            ],
            [
                19304,
                19304
            ],
            [
                19304,
                19352
            ],
            [
                19352,
                19413
            ],
            [
                19413,
                19466
            ],
            [
                19466,
                19610
            ],
            [
                19610,
                19647
            ],
            [
                19647,
                19799
            ],
            [
                19799,
                19828
            ],
            [
                19828,
                19996
            ],
            [
                19996,
                20218
            ]
        ]
    }
}