{
    "original": {
        "text": "\"Er ist geheissen Israel. Ihn hat verwandelt Hexenspruch in einen Hund. * * * * * Aber jeden Freitag Abend, In der Dmm'rungstunde, pltzlich Weicht der Zauber, und der Hund Wird aufs Neu' ein menschlich Wesen.\" --HEINE: _Prinzessin Sabbath_.\nWhen Deronda arrived at five o'clock, the shop was closed and the door was opened for him by the Christian servant. When she showed him into the room behind the shop he was surprised at the prettiness of the scene. The house was old, and rather extensive at the back: probably the large room he now entered was gloomy by daylight, but now it was agreeably lit by a fine old brass lamp with seven oil-lights hanging above the snow-white cloth spread on the central table. The ceiling and walls were smoky, and all the surroundings were dark enough to throw into relief the human figures, which had a Venetian glow of coloring. The grandmother was arrayed in yellowish brown with a large gold chain in lieu of the necklace, and by this light her yellow face with its darkly-marked eyebrows and framing roll of gray hair looked as handsome as was necessary for picturesque effect. Young Mrs. Cohen was clad in red and black, with a string of large artificial pearls wound round and round her neck: the baby lay asleep in the cradle under a scarlet counterpane; Adelaide Rebekah was in braided amber, and Jacob Alexander was in black velveteen with scarlet stockings. As the four pairs of black eyes all glistened a welcome at Deronda, he was almost ashamed of the supercilious dislike these happy-looking creatures had raised in him by daylight. Nothing could be more cordial than the greeting he received, and both mother and grandmother seemed to gather more dignity from being seen on the private hearth, showing hospitality. He looked round with some wonder at the old furniture: the oaken bureau and high side-table must surely be mere matters of chance and economy, and not due to the family taste. A large dish of blue and yellow ware was set up on the side-table, and flanking it were two old silver vessels; in front of them a large volume in darkened vellum with a deep-ribbed back. In the corner at the farther end was an open door into an inner room, where there was also a light.\nDeronda took in these details by parenthetic glances while he met Jacob's pressing solicitude about the knife. He had taken the pains to buy one with the requisites of the hook and white handle, and produced it on demand, saying,\n\"Is that the sort of thing you want, Jacob?\"\nIt was subjected to a severe scrutiny, the hook and blades were opened, and the article of barter with the cork-screw was drawn forth for comparison.\n\"Why do you like a hook better than a cork-screw?\" said Deronda.\n\"'Caush I can get hold of things with a hook. A corkscrew won't go into anything but corks. But it's better for you, you can draw corks.\"\n\"You agree to change, then?\" said Deronda, observing that the grandmother was listening with delight.\n\"What else have you got in your pockets?\" said Jacob, with deliberative seriousness.\n\"Hush, hush, Jacob, love,\" said the grandmother. And Deronda, mindful of discipline, answered,\n\"I think I must not tell you that. Our business was with the knives.\"\nJacob looked up into his face scanningly for a moment or two, and apparently arriving at his conclusions, said gravely,\n\"I'll shwop,\" handing the cork-screw knife to Deronda, who pocketed it with corresponding gravity.\nImmediately the small son of Shem ran off into the next room, whence his voice was heard in rapid chat; and then ran back again--when, seeing his father enter, he seized a little velveteen hat which lay on a chair and put it on to approach him. Cohen kept on his own hat, and took no notice of the visitor, but stood still while the two children went up to him and clasped his knees: then he laid his hands on each in turn and uttered his Hebrew benediction; whereupon the wife, who had lately taken baby from the cradle, brought it up to her husband and held it under his outstretched hands, to be blessed in its sleep. For the moment, Deronda thought that this pawnbroker, proud of his vocation, was not utterly prosaic.\n\"Well, sir, you found your welcome in my family, I think,\" said Cohen, putting down his hat and becoming his former self. \"And you've been punctual. Nothing like a little stress here,\" he added, tapping his side pocket as he sat down. \"It's good for us all in our turn. I've felt it when I've had to make up payments. I began to fit every sort of box. It's bracing to the mind. Now then! let us see, let us see.\"\n\"That is the ring I spoke of,\" said Deronda, taking it from his finger. \"I believe it cost a hundred pounds. It will be a sufficient pledge to you for fifty, I think. I shall probably redeem it in a month or so.\"\nCohen's glistening eyes seemed to get a little nearer together as he met the ingenuous look of this crude young gentleman, who apparently supposed that redemption was a satisfaction to pawnbrokers. He took the ring, examined and returned it, saying with indifference, \"Good, good. We'll talk of it after our meal. Perhaps you'll join us, if you've no objection. Me and my wife'll feel honored, and so will mother; won't you, mother?\"\nThe invitation was doubly echoed, and Deronda gladly accepted it. All now turned and stood round the table. No dish was at present seen except one covered with a napkin; and Mrs. Cohen had placed a china bowl near her husband that he might wash his hands in it. But after putting on his hat again, he paused, and called in a loud voice, \"Mordecai!\"\nCan this be part of the religious ceremony? thought Deronda, not knowing what might be expected of the ancient hero. But he heard a \"Yes\" from the next room, which made him look toward the open door; and there, to his astonishment, he saw the figure of the enigmatic Jew whom he had this morning met with in the book-shop. Their eyes met, and Mordecai looked as much surprised as Deronda--neither in his surprise making any sign of recognition. But when Mordecai was seating himself at the end of the table, he just bent his head to the guest in a cold and distant manner, as if the disappointment of the morning remained a disagreeable association with this new acquaintance.\nCohen now washed his hands, pronouncing Hebrew words the while: afterward, he took off the napkin covering the dish and disclosed the two long flat loaves besprinkled with seed--the memorial of the manna that fed the wandering forefathers--and breaking off small pieces gave one to each of the family, including Adelaide Rebekah, who stood on the chair with her whole length exhibited in her amber-colored garment, her little Jewish nose lengthened by compression of the lip in the effort to make a suitable appearance. Cohen then uttered another Hebrew blessing, and after that, the male heads were uncovered, all seated themselves, and the meal went on without any peculiarity that interested Deronda. He was not very conscious of what dishes he ate from; being preoccupied with a desire to turn the conversation in a way that would enable him to ask some leading question; and also thinking of Mordecai, between whom and himself there was an exchange of fascinated, half-furtive glances. Mordecai had no handsome Sabbath garment, but instead of the threadbare rusty black coat of the morning he wore one of light drab, which looked as if it had once been a handsome loose paletot now shrunk with washing; and this change of clothing gave a still stronger accentuation to his dark-haired, eager face which might have belonged to the prophet Ezekiel--also probably not modish in the eyes of contemporaries. It was noticeable that the thin tails of the fried fish were given to Mordecai; and in general the sort of share assigned to a poor relation--no doubt a \"survival\" of prehistoric practice, not yet generally admitted to be superstitious.\nMr. Cohen kept up the conversation with much liveliness, introducing as subjects always in taste (the Jew is proud of his loyalty) the Queen and the Royal Family, the Emperor and Empress of the French--into which both grandmother and wife entered with zest. Mrs. Cohen the younger showed an accurate memory of distinguished birthdays; and the elder assisted her son in informing the guest of what occurred when the Emperor and Empress were in England and visited the city ten years before.\n\"I dare say you know all about it better than we do, sir,\" said Cohen, repeatedly, by way of preface to full information; and the interesting statements were kept up in a trio.\n\"Our baby is named _Eu_genie Esther,\" said young Mrs. Cohen, vivaciously.\n\"It's wonderful how the Emperor's like a cousin of mine in the face,\" said the grandmother; \"it struck me like lightning when I caught sight of him. I couldn't have thought it.\"\n\"Mother and me went to see the Emperor and Empress at the Crystal Palace,\" said Mr. Cohen. \"I had a fine piece of work to take care of, mother; she might have been squeezed flat--though she was pretty near as lusty then as she is now. I said if I had a hundred mothers I'd never take one of 'em to see the Emperor and Empress at the Crystal Palace again; and you may think a man can't afford it when he's got but one mother--not if he'd ever so big an insurance on her.\" He stroked his mother's shoulder affectionately, and chuckled a little at his own humor.\n\"Your mother has been a widow a long while, perhaps,\" said Deronda, seizing his opportunity. \"That has made your care for her the more needful.\"\n\"Ay, ay, it's a good many _yore-zeit_ since I had to manage for her and myself,\" said Cohen quickly. \"I went early to it. It's that makes you a sharp knife.\"\n\"What does--what makes a sharp knife, father?\" said Jacob, his cheek very much swollen with sweet-cake.\nThe father winked at his guest and said, \"Having your nose put on the grindstone.\"\nJacob slipped from his chair with the piece of sweet-cake in his hand, and going close up to Mordecai, who had been totally silent hitherto, said, \"What does that mean--putting my nose to the grindstone?\"\n\"It means that you are to bear being hurt without making a noise,\" said Mordecai, turning his eyes benignantly on the small face close to his. Jacob put the corner of the cake into Mordecai's mouth as an invitation to bite, saying meanwhile, \"I shan't though,\" and keeping his eyes on the cake to observe how much of it went in this act of generosity. Mordecai took a bite and smiled, evidently meaning to please the lad, and the little incident made them both look more lovable. Deronda, however, felt with some vexation that he had taken little by his question.\n\"I fancy that is the right quarter for learning,\" said he, carrying on the subject that he might have an excuse for addressing Mordecai, to whom he turned and said, \"You have been a great student, I imagine?\"\n\"I have studied,\" was the quiet answer. \"And you?--You know German by the book you were buying.\"\n\"Yes, I have studied in Germany. Are you generally engaged in bookselling?\" said Deronda.\n\"No; I only go to Mr. Ram's shop every day to keep it while he goes to meals,\" said Mordecai, who was now looking at Deronda with what seemed a revival of his original interest: it seemed as if the face had some attractive indication for him which now neutralized the former disappointment. After a slight pause, he said, \"Perhaps you know Hebrew?\"\n\"I am sorry to say, not at all.\"\nMordecai's countenance fell: he cast down his eyelids, looking at his hands, which lay crossed before him, and said no more. Deronda had now noticed more decisively than in their former interview a difficulty in breathing, which he thought must be a sign of consumption.\n\"I've had something else to do than to get book-learning.\" said Mr. Cohen,--\"I've had to make myself knowing about useful things. I know stones well,\"--here he pointed to Deronda's ring. \"I'm not afraid of taking that ring of yours at my own valuation. But now,\" he added, with a certain drop in his voice to a lower, more familiar nasal, \"what do you want for it?\"\n\"Fifty or sixty pounds,\" Deronda answered, rather too carelessly.\nCohen paused a little, thrust his hands into his pockets, fixed on Deronda a pair of glistening eyes that suggested a miraculous guinea-pig, and said, \"Couldn't do you that. Happy to oblige, but couldn't go that lengths. Forty pound--say forty--I'll let you have forty on it.\"\nDeronda was aware that Mordecai had looked up again at the words implying a monetary affair, and was now examining him again, while he said, \"Very well, I shall redeem it in a month or so.\"\n\"Good. I'll make you out the ticket by-and-by,\" said Cohen, indifferently. Then he held up his finger as a sign that conversation must be deferred. He, Mordecai and Jacob put on their hats, and Cohen opened a thanksgiving, which was carried on by responses, till Mordecai delivered himself alone at some length, in a solemn chanting tone, with his chin slightly uplifted and his thin hands clasped easily before him. Not only in his accent and tone, but in his freedom from the self-consciousness which has reference to others' approbation, there could hardly have been a stronger contrast to the Jew at the other end of the table. It was an unaccountable conjunction--the presence among these common, prosperous, shopkeeping types, of a man who, in an emaciated threadbare condition, imposed a certain awe on Deronda, and an embarrassment at not meeting his expectations.\nNo sooner had Mordecai finished his devotional strain, than rising, with a slight bend of his head to the stranger, he walked back into his room, and shut the door behind him.\n\"That seems to be rather a remarkable man,\" said Deronda, turning to Cohen, who immediately set up his shoulders, put out his tongue slightly, and tapped his own brow. It was clearly to be understood that Mordecai did not come up to the standard of sanity which was set by Mr. Cohen's view of men and things.\n\"Does he belong to your family?\" said Deronda.\nThis idea appeared to be rather ludicrous to the ladies as well as to Cohen, and the family interchanged looks of amusement.\n\"No, no,\" said Cohen. \"Charity! charity! he worked for me, and when he got weaker and weaker I took him in. He's an incumbrance; but he brings a blessing down, and he teaches the boy. Besides, he does the repairing at the watches and jewelry.\"\nDeronda hardly abstained from smiling at this mixture of kindliness and the desire to justify it in the light of a calculation; but his willingness to speak further of Mordecai, whose character was made the more enigmatically striking by these new details, was baffled. Mr. Cohen immediately dismissed the subject by reverting to the \"accommodation,\" which was also an act of charity, and proceeded to make out the ticket, get the forty pounds, and present them both in exchange for the diamond ring. Deronda, feeling that it would be hardly delicate to protract his visit beyond the settlement of the business which was its pretext, had to take his leave, with no more decided result than the advance of forty pounds and the pawn-ticket in his breast-pocket, to make a reason for returning when he came up to town after Christmas. He was resolved that he would then endeavor to gain a little more insight into the character and history of Mordecai; from whom also he might gather something decisive about the Cohens--for example, the reason why it was forbidden to ask Mrs. Cohen the elder whether she had a daughter.",
        "paragraph_chars": [
            [
                0,
                241
            ],
            [
                241,
                2231
            ],
            [
                2231,
                2461
            ],
            [
                2461,
                2506
            ],
            [
                2506,
                2656
            ],
            [
                2656,
                2721
            ],
            [
                2721,
                2859
            ],
            [
                2859,
                2961
            ],
            [
                2961,
                3046
            ],
            [
                3046,
                3141
            ],
            [
                3141,
                3211
            ],
            [
                3211,
                3331
            ],
            [
                3331,
                3430
            ],
            [
                3430,
                4153
            ],
            [
                4153,
                4566
            ],
            [
                4566,
                4779
            ],
            [
                4779,
                5213
            ],
            [
                5213,
                5562
            ],
            [
                5562,
                6239
            ],
            [
                6239,
                7884
            ],
            [
                7884,
                8374
            ],
            [
                8374,
                8551
            ],
            [
                8551,
                8625
            ],
            [
                8625,
                8803
            ],
            [
                8803,
                9363
            ],
            [
                9363,
                9508
            ],
            [
                9508,
                9666
            ],
            [
                9666,
                9770
            ],
            [
                9770,
                9853
            ],
            [
                9853,
                10058
            ],
            [
                10058,
                10622
            ],
            [
                10622,
                10831
            ],
            [
                10831,
                10928
            ],
            [
                10928,
                11018
            ],
            [
                11018,
                11367
            ],
            [
                11367,
                11400
            ],
            [
                11400,
                11671
            ],
            [
                11671,
                12037
            ],
            [
                12037,
                12103
            ],
            [
                12103,
                12380
            ],
            [
                12380,
                12570
            ],
            [
                12570,
                13443
            ],
            [
                13443,
                13619
            ],
            [
                13619,
                13928
            ],
            [
                13928,
                13975
            ],
            [
                13975,
                14100
            ],
            [
                14100,
                14344
            ],
            [
                14344,
                15462
            ]
        ],
        "segment_chars": [
            [
                0,
                26
            ],
            [
                26,
                72
            ],
            [
                72,
                210
            ],
            [
                210,
                241
            ],
            [
                241,
                357
            ],
            [
                357,
                456
            ],
            [
                456,
                712
            ],
            [
                712,
                867
            ],
            [
                867,
                1119
            ],
            [
                1119,
                1405
            ],
            [
                1405,
                1584
            ],
            [
                1584,
                1767
            ],
            [
                1767,
                1943
            ],
            [
                1943,
                2131
            ],
            [
                2131,
                2231
            ],
            [
                2231,
                2342
            ],
            [
                2342,
                2461
            ],
            [
                2461,
                2506
            ],
            [
                2506,
                2656
            ],
            [
                2656,
                2707
            ],
            [
                2707,
                2721
            ],
            [
                2721,
                2767
            ],
            [
                2767,
                2813
            ],
            [
                2813,
                2859
            ],
            [
                2859,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3003
            ],
            [
                3003,
                3046
            ],
            [
                3046,
                3095
            ],
            [
                3095,
                3141
            ],
            [
                3141,
                3176
            ],
            [
                3176,
                3211
            ],
            [
                3211,
                3331
            ],
            [
                3331,
                3430
            ],
            [
                3430,
                3675
            ],
            [
                3675,
                4051
            ],
            [
                4051,
                4153
            ],
            [
                4153,
                4275
            ],
            [
                4275,
                4302
            ],
            [
                4302,
                4388
            ],
            [
                4388,
                4423
            ],
            [
                4423,
                4471
            ],
            [
                4471,
                4505
            ],
            [
                4505,
                4531
            ],
            [
                4531,
                4541
            ],
            [
                4541,
                4566
            ],
            [
                4566,
                4638
            ],
            [
                4638,
                4675
            ],
            [
                4675,
                4733
            ],
            [
                4733,
                4779
            ],
            [
                4779,
                4977
            ],
            [
                4977,
                5060
            ],
            [
                5060,
                5093
            ],
            [
                5093,
                5141
            ],
            [
                5141,
                5213
            ],
            [
                5213,
                5279
            ],
            [
                5279,
                5321
            ],
            [
                5321,
                5475
            ],
            [
                5475,
                5562
            ],
            [
                5562,
                5606
            ],
            [
                5606,
                5679
            ],
            [
                5679,
                5885
            ],
            [
                5885,
                6007
            ],
            [
                6007,
                6239
            ],
            [
                6239,
                6759
            ],
            [
                6759,
                6943
            ],
            [
                6943,
                7230
            ],
            [
                7230,
                7647
            ],
            [
                7647,
                7884
            ],
            [
                7884,
                8142
            ],
            [
                8142,
                8374
            ],
            [
                8374,
                8551
            ],
            [
                8551,
                8625
            ],
            [
                8625,
                8774
            ],
            [
                8774,
                8803
            ],
            [
                8803,
                8894
            ],
            [
                8894,
                9038
            ],
            [
                9038,
                9274
            ],
            [
                9274,
                9363
            ],
            [
                9363,
                9456
            ],
            [
                9456,
                9508
            ],
            [
                9508,
                9609
            ],
            [
                9609,
                9630
            ],
            [
                9630,
                9666
            ],
            [
                9666,
                9713
            ],
            [
                9713,
                9770
            ],
            [
                9770,
                9853
            ],
            [
                9853,
                10058
            ],
            [
                10058,
                10201
            ],
            [
                10201,
                10410
            ],
            [
                10410,
                10538
            ],
            [
                10538,
                10622
            ],
            [
                10622,
                10831
            ],
            [
                10831,
                10871
            ],
            [
                10871,
                10928
            ],
            [
                10928,
                10961
            ],
            [
                10961,
                11004
            ],
            [
                11004,
                11018
            ],
            [
                11018,
                11309
            ],
            [
                11309,
                11367
            ],
            [
                11367,
                11400
            ],
            [
                11400,
                11525
            ],
            [
                11525,
                11671
            ],
            [
                11671,
                11730
            ],
            [
                11730,
                11801
            ],
            [
                11801,
                11858
            ],
            [
                11858,
                11924
            ],
            [
                11924,
                12037
            ],
            [
                12037,
                12103
            ],
            [
                12103,
                12277
            ],
            [
                12277,
                12324
            ],
            [
                12324,
                12380
            ],
            [
                12380,
                12570
            ],
            [
                12570,
                12577
            ],
            [
                12577,
                12645
            ],
            [
                12645,
                12718
            ],
            [
                12718,
                12987
            ],
            [
                12987,
                13202
            ],
            [
                13202,
                13443
            ],
            [
                13443,
                13619
            ],
            [
                13619,
                13787
            ],
            [
                13787,
                13928
            ],
            [
                13928,
                13961
            ],
            [
                13961,
                13975
            ],
            [
                13975,
                14100
            ],
            [
                14100,
                14122
            ],
            [
                14122,
                14132
            ],
            [
                14132,
                14141
            ],
            [
                14141,
                14208
            ],
            [
                14208,
                14284
            ],
            [
                14284,
                14344
            ],
            [
                14344,
                14614
            ],
            [
                14614,
                14845
            ],
            [
                14845,
                15176
            ],
            [
                15176,
                15462
            ]
        ],
        "overlap_chars": [
            [
                241,
                282
            ],
            [
                348,
                355
            ],
            [
                366,
                401
            ],
            [
                292,
                298
            ],
            [
                283,
                287
            ],
            [
                355,
                356
            ],
            [
                407,
                456
            ],
            [
                456,
                478
            ],
            [
                486,
                508
            ],
            [
                518,
                532
            ],
            [
                548,
                551
            ],
            [
                597,
                711
            ],
            [
                712,
                715
            ],
            [
                776,
                780
            ],
            [
                758,
                770
            ],
            [
                797,
                827
            ],
            [
                838,
                856
            ],
            [
                865,
                867
            ],
            [
                967,
                980
            ],
            [
                961,
                962
            ],
            [
                867,
                882
            ],
            [
                992,
                1048
            ],
            [
                1054,
                1065
            ],
            [
                1099,
                1110
            ],
            [
                1069,
                1077
            ],
            [
                1117,
                1119
            ],
            [
                1119,
                1269
            ],
            [
                1297,
                1347
            ],
            [
                1358,
                1404
            ],
            [
                1464,
                1471
            ],
            [
                1476,
                1584
            ],
            [
                1584,
                1683
            ],
            [
                1694,
                1698
            ],
            [
                1765,
                1767
            ],
            [
                1767,
                1810
            ],
            [
                1832,
                1858
            ],
            [
                1908,
                1909
            ],
            [
                1943,
                1950
            ],
            [
                1959,
                1974
            ],
            [
                1951,
                1955
            ],
            [
                1980,
                1990
            ],
            [
                2031,
                2071
            ],
            [
                2072,
                2105
            ],
            [
                2129,
                2131
            ],
            [
                2131,
                2137
            ],
            [
                2138,
                2144
            ],
            [
                2164,
                2231
            ],
            [
                2231,
                2260
            ],
            [
                2284,
                2342
            ],
            [
                2342,
                2380
            ],
            [
                2403,
                2459
            ],
            [
                2461,
                2506
            ],
            [
                2506,
                2544
            ],
            [
                2604,
                2608
            ],
            [
                2628,
                2656
            ],
            [
                2656,
                2707
            ],
            [
                2707,
                2721
            ],
            [
                2721,
                2767
            ],
            [
                2767,
                2813
            ],
            [
                2813,
                2859
            ],
            [
                2859,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3003
            ],
            [
                3003,
                3013
            ],
            [
                3044,
                3046
            ],
            [
                3046,
                3047
            ],
            [
                3053,
                3095
            ],
            [
                3095,
                3106
            ],
            [
                3131,
                3139
            ],
            [
                3141,
                3176
            ],
            [
                3176,
                3211
            ],
            [
                3211,
                3216
            ],
            [
                3232,
                3240
            ],
            [
                3252,
                3264
            ],
            [
                3271,
                3272
            ],
            [
                3322,
                3329
            ],
            [
                3331,
                3406
            ],
            [
                3421,
                3430
            ],
            [
                3430,
                3441
            ],
            [
                3464,
                3557
            ],
            [
                3559,
                3622
            ],
            [
                3636,
                3657
            ],
            [
                3673,
                3675
            ],
            [
                3675,
                3705
            ],
            [
                3741,
                3812
            ],
            [
                3814,
                3907
            ],
            [
                3724,
                3727
            ],
            [
                3930,
                3934
            ],
            [
                3981,
                3984
            ],
            [
                3952,
                3962
            ],
            [
                3966,
                3980
            ],
            [
                4023,
                4051
            ],
            [
                4051,
                4103
            ],
            [
                4128,
                4153
            ],
            [
                4153,
                4154
            ],
            [
                4158,
                4163
            ],
            [
                4209,
                4244
            ],
            [
                4273,
                4275
            ],
            [
                4275,
                4276
            ],
            [
                4280,
                4302
            ],
            [
                4302,
                4388
            ],
            [
                4388,
                4423
            ],
            [
                4505,
                4531
            ],
            [
                4531,
                4541
            ],
            [
                4553,
                4566
            ],
            [
                4566,
                4638
            ],
            [
                4638,
                4675
            ],
            [
                4675,
                4733
            ],
            [
                4733,
                4779
            ],
            [
                4779,
                4844
            ],
            [
                4848,
                4855
            ],
            [
                4866,
                4878
            ],
            [
                4885,
                4977
            ],
            [
                4977,
                4979
            ],
            [
                4995,
                5003
            ],
            [
                4985,
                4993
            ],
            [
                5004,
                5060
            ],
            [
                5060,
                5093
            ],
            [
                5093,
                5115
            ],
            [
                5139,
                5141
            ],
            [
                5141,
                5163
            ],
            [
                5171,
                5191
            ],
            [
                5251,
                5274
            ],
            [
                5277,
                5279
            ],
            [
                5279,
                5319
            ],
            [
                5321,
                5328
            ],
            [
                5333,
                5343
            ],
            [
                5349,
                5475
            ],
            [
                5475,
                5562
            ],
            [
                5686,
                5719
            ],
            [
                5762,
                5765
            ],
            [
                5773,
                5793
            ],
            [
                5801,
                5844
            ],
            [
                5858,
                5861
            ],
            [
                5867,
                5885
            ],
            [
                5885,
                5949
            ],
            [
                5982,
                6007
            ],
            [
                6007,
                6010
            ],
            [
                6016,
                6024
            ],
            [
                6059,
                6140
            ],
            [
                6141,
                6174
            ],
            [
                6237,
                6239
            ],
            [
                6239,
                6291
            ],
            [
                6301,
                6302
            ],
            [
                6681,
                6685
            ],
            [
                6314,
                6415
            ],
            [
                6417,
                6477
            ],
            [
                6479,
                6591
            ],
            [
                6624,
                6637
            ],
            [
                6645,
                6653
            ],
            [
                6728,
                6730
            ],
            [
                6757,
                6759
            ],
            [
                6759,
                6942
            ],
            [
                6943,
                6990
            ],
            [
                6995,
                7073
            ],
            [
                7081,
                7084
            ],
            [
                7088,
                7091
            ],
            [
                7113,
                7145
            ],
            [
                7154,
                7158
            ],
            [
                7196,
                7207
            ],
            [
                7217,
                7230
            ],
            [
                7230,
                7341
            ],
            [
                7349,
                7354
            ],
            [
                7342,
                7345
            ],
            [
                7359,
                7413
            ],
            [
                7422,
                7445
            ],
            [
                7541,
                7546
            ],
            [
                7475,
                7481
            ],
            [
                7488,
                7540
            ],
            [
                7645,
                7647
            ],
            [
                7665,
                7669
            ],
            [
                7717,
                7725
            ],
            [
                7650,
                7653
            ],
            [
                7708,
                7713
            ],
            [
                7670,
                7702
            ],
            [
                7742,
                7787
            ],
            [
                7882,
                7884
            ],
            [
                7884,
                7964
            ],
            [
                8015,
                8046
            ],
            [
                8074,
                8084
            ],
            [
                8051,
                8070
            ],
            [
                8086,
                8141
            ],
            [
                8625,
                8656
            ],
            [
                8664,
                8680
            ],
            [
                8692,
                8752
            ],
            [
                8769,
                8772
            ],
            [
                8803,
                8804
            ],
            [
                8818,
                8894
            ],
            [
                8894,
                8900
            ],
            [
                8917,
                8937
            ],
            [
                8939,
                8980
            ],
            [
                9036,
                9038
            ],
            [
                9045,
                9157
            ],
            [
                9176,
                9226
            ],
            [
                9271,
                9274
            ],
            [
                9274,
                9321
            ],
            [
                9361,
                9363
            ],
            [
                9363,
                9456
            ],
            [
                9456,
                9508
            ],
            [
                9508,
                9533
            ],
            [
                9546,
                9599
            ],
            [
                9607,
                9609
            ],
            [
                9630,
                9666
            ],
            [
                9666,
                9667
            ],
            [
                9678,
                9713
            ],
            [
                9713,
                9734
            ],
            [
                9745,
                9757
            ],
            [
                9764,
                9770
            ],
            [
                9770,
                9832
            ],
            [
                9836,
                9853
            ],
            [
                9853,
                9881
            ],
            [
                9906,
                9913
            ],
            [
                9918,
                9933
            ],
            [
                9943,
                9968
            ],
            [
                9977,
                10020
            ],
            [
                9905,
                9906
            ],
            [
                10030,
                10058
            ],
            [
                10058,
                10163
            ],
            [
                10169,
                10201
            ],
            [
                10201,
                10281
            ],
            [
                10323,
                10342
            ],
            [
                10352,
                10410
            ],
            [
                10410,
                10441
            ],
            [
                10478,
                10538
            ],
            [
                10538,
                10560
            ],
            [
                10580,
                10591
            ],
            [
                10598,
                10622
            ],
            [
                10759,
                10761
            ],
            [
                10749,
                10758
            ],
            [
                10677,
                10679
            ],
            [
                10781,
                10831
            ],
            [
                10831,
                10871
            ],
            [
                10871,
                10880
            ],
            [
                10882,
                10928
            ],
            [
                10928,
                10961
            ],
            [
                10961,
                11004
            ],
            [
                11004,
                11018
            ],
            [
                11018,
                11147
            ],
            [
                11160,
                11194
            ],
            [
                11307,
                11309
            ],
            [
                11309,
                11367
            ],
            [
                11367,
                11400
            ],
            [
                11400,
                11453
            ],
            [
                11507,
                11525
            ],
            [
                11525,
                11532
            ],
            [
                11541,
                11548
            ],
            [
                11596,
                11597
            ],
            [
                11598,
                11611
            ],
            [
                11612,
                11671
            ],
            [
                11671,
                11676
            ],
            [
                11714,
                11730
            ],
            [
                11730,
                11744
            ],
            [
                11747,
                11759
            ],
            [
                11780,
                11801
            ],
            [
                11801,
                11821
            ],
            [
                11823,
                11858
            ],
            [
                12010,
                12011
            ],
            [
                11928,
                11931
            ],
            [
                11942,
                11943
            ],
            [
                12011,
                12037
            ],
            [
                12037,
                12103
            ],
            [
                12103,
                12125
            ],
            [
                12137,
                12142
            ],
            [
                12148,
                12253
            ],
            [
                12254,
                12277
            ],
            [
                12277,
                12297
            ],
            [
                12337,
                12346
            ],
            [
                12330,
                12335
            ],
            [
                12348,
                12380
            ],
            [
                12380,
                12425
            ],
            [
                12473,
                12480
            ],
            [
                12485,
                12570
            ],
            [
                12570,
                12577
            ],
            [
                12577,
                12628
            ],
            [
                12643,
                12645
            ],
            [
                12645,
                12649
            ],
            [
                12718,
                12763
            ],
            [
                12650,
                12652
            ],
            [
                12777,
                12841
            ],
            [
                12860,
                12893
            ],
            [
                12907,
                12922
            ],
            [
                12932,
                12967
            ],
            [
                12985,
                12987
            ],
            [
                13111,
                13202
            ],
            [
                13202,
                13208
            ],
            [
                13212,
                13225
            ],
            [
                13239,
                13443
            ],
            [
                13443,
                13478
            ],
            [
                13498,
                13502
            ],
            [
                13559,
                13561
            ],
            [
                13496,
                13497
            ],
            [
                13511,
                13558
            ],
            [
                13562,
                13619
            ],
            [
                13619,
                13698
            ],
            [
                13766,
                13785
            ],
            [
                13731,
                13732
            ],
            [
                13819,
                13851
            ],
            [
                13718,
                13721
            ],
            [
                13856,
                13874
            ],
            [
                13926,
                13928
            ],
            [
                13928,
                13961
            ],
            [
                13961,
                13975
            ],
            [
                14056,
                14066
            ],
            [
                14080,
                14100
            ],
            [
                14100,
                14122
            ],
            [
                14122,
                14132
            ],
            [
                14141,
                14181
            ],
            [
                14193,
                14208
            ],
            [
                14208,
                14215
            ],
            [
                14219,
                14253
            ],
            [
                14258,
                14284
            ],
            [
                14284,
                14295
            ],
            [
                14318,
                14333
            ],
            [
                14341,
                14344
            ],
            [
                14344,
                14351
            ],
            [
                14382,
                14440
            ],
            [
                14470,
                14475
            ],
            [
                14444,
                14447
            ],
            [
                14509,
                14520
            ],
            [
                14579,
                14581
            ],
            [
                14492,
                14494
            ],
            [
                14612,
                14614
            ],
            [
                14733,
                14766
            ],
            [
                14771,
                14792
            ],
            [
                14801,
                14844
            ],
            [
                14845,
                14861
            ],
            [
                15140,
                15142
            ],
            [
                14898,
                14916
            ],
            [
                14976,
                15013
            ],
            [
                15022,
                15033
            ],
            [
                15070,
                15088
            ],
            [
                15096,
                15102
            ],
            [
                15104,
                15134
            ],
            [
                15159,
                15176
            ],
            [
                15176,
                15210
            ],
            [
                15220,
                15222
            ],
            [
                15237,
                15241
            ],
            [
                15284,
                15324
            ],
            [
                15344,
                15360
            ],
            [
                15362,
                15462
            ]
        ],
        "row_chars": [
            [
                0,
                26
            ],
            [
                26,
                72
            ],
            [
                72,
                210
            ],
            [
                210,
                241
            ],
            [
                241,
                456
            ],
            [
                456,
                712
            ],
            [
                712,
                867
            ],
            [
                867,
                1119
            ],
            [
                1119,
                1405
            ],
            [
                1405,
                1584
            ],
            [
                1584,
                1767
            ],
            [
                1767,
                2131
            ],
            [
                2131,
                2231
            ],
            [
                2231,
                2342
            ],
            [
                2342,
                2461
            ],
            [
                2461,
                2506
            ],
            [
                2506,
                2656
            ],
            [
                2656,
                2707
            ],
            [
                2707,
                2721
            ],
            [
                2721,
                2767
            ],
            [
                2767,
                2813
            ],
            [
                2813,
                2859
            ],
            [
                2859,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                3003
            ],
            [
                3003,
                3046
            ],
            [
                3046,
                3095
            ],
            [
                3095,
                3141
            ],
            [
                3141,
                3176
            ],
            [
                3176,
                3211
            ],
            [
                3211,
                3331
            ],
            [
                3331,
                3430
            ],
            [
                3430,
                3675
            ],
            [
                3675,
                4051
            ],
            [
                4051,
                4153
            ],
            [
                4153,
                4275
            ],
            [
                4275,
                4302
            ],
            [
                4302,
                4388
            ],
            [
                4388,
                4423
            ],
            [
                4423,
                4471
            ],
            [
                4471,
                4505
            ],
            [
                4505,
                4531
            ],
            [
                4531,
                4541
            ],
            [
                4541,
                4566
            ],
            [
                4566,
                4638
            ],
            [
                4638,
                4675
            ],
            [
                4675,
                4733
            ],
            [
                4733,
                4779
            ],
            [
                4779,
                4977
            ],
            [
                4977,
                5060
            ],
            [
                5060,
                5093
            ],
            [
                5093,
                5141
            ],
            [
                5141,
                5213
            ],
            [
                5213,
                5279
            ],
            [
                5279,
                5475
            ],
            [
                5475,
                5562
            ],
            [
                5562,
                5606
            ],
            [
                5606,
                5679
            ],
            [
                5679,
                5885
            ],
            [
                5885,
                6007
            ],
            [
                6007,
                6239
            ],
            [
                6239,
                6759
            ],
            [
                6759,
                6943
            ],
            [
                6943,
                7230
            ],
            [
                7230,
                7647
            ],
            [
                7647,
                7884
            ],
            [
                7884,
                8142
            ],
            [
                8142,
                8374
            ],
            [
                8374,
                8551
            ],
            [
                8551,
                8625
            ],
            [
                8625,
                8774
            ],
            [
                8774,
                8803
            ],
            [
                8803,
                8894
            ],
            [
                8894,
                9038
            ],
            [
                9038,
                9274
            ],
            [
                9274,
                9363
            ],
            [
                9363,
                9456
            ],
            [
                9456,
                9508
            ],
            [
                9508,
                9609
            ],
            [
                9609,
                9630
            ],
            [
                9630,
                9666
            ],
            [
                9666,
                9713
            ],
            [
                9713,
                9770
            ],
            [
                9770,
                9853
            ],
            [
                9853,
                10058
            ],
            [
                10058,
                10201
            ],
            [
                10201,
                10410
            ],
            [
                10410,
                10538
            ],
            [
                10538,
                10622
            ],
            [
                10622,
                10831
            ],
            [
                10831,
                10871
            ],
            [
                10871,
                10928
            ],
            [
                10928,
                10961
            ],
            [
                10961,
                11004
            ],
            [
                11004,
                11018
            ],
            [
                11018,
                11309
            ],
            [
                11309,
                11367
            ],
            [
                11367,
                11400
            ],
            [
                11400,
                11525
            ],
            [
                11525,
                11671
            ],
            [
                11671,
                11730
            ],
            [
                11730,
                11801
            ],
            [
                11801,
                11858
            ],
            [
                11858,
                11924
            ],
            [
                11924,
                12037
            ],
            [
                12037,
                12103
            ],
            [
                12103,
                12277
            ],
            [
                12277,
                12380
            ],
            [
                12380,
                12570
            ],
            [
                12570,
                12577
            ],
            [
                12577,
                12645
            ],
            [
                12645,
                12987
            ],
            [
                12987,
                13202
            ],
            [
                13202,
                13443
            ],
            [
                13443,
                13619
            ],
            [
                13619,
                13928
            ],
            [
                13928,
                13961
            ],
            [
                13961,
                13975
            ],
            [
                13975,
                14100
            ],
            [
                14100,
                14122
            ],
            [
                14122,
                14132
            ],
            [
                14132,
                14141
            ],
            [
                14141,
                14208
            ],
            [
                14208,
                14284
            ],
            [
                14284,
                14344
            ],
            [
                14344,
                14614
            ],
            [
                14614,
                14845
            ],
            [
                14845,
                15176
            ],
            [
                15176,
                15462
            ]
        ]
    },
    "abridged": {
        "text": "When Deronda arrived at five o'clock, the servant showed him into the room behind the closed shop. He was surprised at the prettiness of the scene. The house was old, and extensive at the back: the large room was lit by a fine old brass lamp with seven oil-lights hanging above the snow-white cloth spread on the central table.\nThe dark surroundings threw into relief the human figures, with a Venetian glow of colouring. By this light, the grandmother's face with its darkly-marked eyebrows and framing roll of grey hair looked picturesquely handsome. Young Mrs. Cohen was clad in red and black, with a string of large artificial pearls wound round and round her neck: the baby lay asleep in the cradle; Adelaide Rebekah was in braided amber, and Jacob was in black velveteen with scarlet stockings.\nDeronda was almost ashamed of the supercilious dislike these happy-looking creatures had raised in him by daylight. Nothing could be more cordial than the greeting he received, and both mother and grandmother seemed more dignified in this setting. He looked round with some wonder at the old oak bureau and high side-table, where a large blue and yellow dish was set up between two old silver vessels; in front of them lay a large volume in darkened vellum. In the far corner was an open door into an inner room, where there was also a light.\nDeronda took in these details while he met Jacob's pressing solicitude about the knife. He had taken the pains to buy one with a hook and white handle, and produced it on demand, saying,-\n\"Is that the sort of thing you want, Jacob?\"\nIt was subjected to a severe scrutiny, with Jacob's own knife being drawn forth for comparison.\n\"Why do you like a hook better than a cork-screw?\" said Deronda.\n\"'Caush I can get hold of things with a hook. A corkscrew won't go into anything but corks. But it's better for you, you can draw corks.\"\n\"You agree to change, then?\" said Deronda, observing that the grandmother was listening with delight.\n\"What else have you got in your pockets?\" said Jacob.\n\"Hush, Jacob, love,\" said the grandmother. And Deronda answered-\n\"I think I must not tell you that. Our business was with the knives.\"\nJacob scanned his face for a moment, before saying gravely-\n\"I'll shwop,\" handing the cork-screw knife to Deronda, who pocketed it with equal gravity.\nImmediately Jacob ran off into the next room, whence his voice was heard in rapid chat; and then ran back again - when, seeing his father enter, he seized a little velveteen hat from a chair and put it on. Cohen kept on his own hat, and stood still while the two children went up to him and clasped his knees. Then he laid his hands on each in turn and uttered his Hebrew benediction; whereupon the wife lifted the baby and brought it to her husband to be blessed in its sleep. For the moment, Deronda thought that this pawnbroker was not utterly prosaic.\n\"Welcome, sir,\" said Cohen, putting down his hat. \"You've been punctual. Nothing like a little stress here,\" he added, tapping his side pocket as he sat down. \"It's good for us all in our turn. It's bracing to the mind. Now then! let us see.\"\n\"That is the ring I spoke of,\" said Deronda, taking it from his finger. \"I believe it cost a hundred pounds. It will be a sufficient pledge to you for fifty, I think. I shall probably redeem it in a month or so.\"\nCohen's glistening eyes seemed to get a little nearer together as met the innocent look of this young gentleman, who apparently supposed that redemption was a satisfaction to pawnbrokers. He examined the ring and returned it, saying with indifference, \"Good, good. We'll talk of it after our meal. Perhaps you'll join us. Me and my wife'll feel honoured, and so will mother.\"\nDeronda gladly accepted. All now turned and stood round the table, which held no dish at present except one covered with a napkin; and Mrs. Cohen had placed a china bowl near her husband that he might wash his hands in it. But after putting on his hat again, he paused, and called in a loud voice, \"Mordecai!\"\nDeronda heard a \"Yes\" from the next room, and to his astonishment, from it stepped the figure of the enigmatic Jew whom he had met in the book-shop. Their eyes met, and Mordecai looked as much surprised as Deronda - though neither made any sign of recognition. But as Mordecai came to the table, he just bent his head to the guest in a cold and distant manner, as if still feeling the disappointment of the morning.\nCohen now washed his hands, pronouncing Hebrew words: then he took off the napkin covering the dish and disclosed the two long flat loaves besprinkled with seed - the memorial of the manna that fed the wandering forefathers - and breaking off small pieces gave one to each of the family, including Adelaide Rebekah, who stood on the chair in her amber-coloured garment, trying to look suitably solemn. Cohen then uttered another Hebrew blessing, and after that, the male heads were uncovered, all seated themselves, and the meal went on without any peculiarity that interested Deronda.\nHe was not very conscious of what dishes he ate; being preoccupied with a desire to turn the conversation in a way that would let him ask about Mirah; and also thinking of Mordecai, with whom he exchanged fascinated, furtive glances. Mordecai had no handsome Sabbath garment, but instead of the threadbare rusty black coat of the morning he wore a light one, which looked as if it had once been a handsome loose jacket, now shrunk with washing, which gave a stronger accentuation to his dark-haired, eager face. Deronda noticed that Mordecai was given the thin tails of the fried fish: the sort of share assigned to a poor relation.\nMr. Cohen kept up the conversation with much liveliness, introducing as subjects the Queen and the Royal Family, and the French Emperor and Empress - into which both grandmother and wife entered with zest.\n\"It's wonderful how the Emperor resembles a cousin of mine,\" said the grandmother; \"it struck me like lightning when I saw him.\"\n\"We went to see the Emperor and Empress at the Crystal Palace,\" said Mr. Cohen. \"I had hard work to take care of mother; she might have been squeezed flat. If I had a hundred mothers I'd never take one of 'em to see the Emperor and Empress at the Crystal Palace again; a man can't afford it when he's got but one mother.\" He stroked his mother's shoulder affectionately.\n\"Your mother has been a widow a long while, perhaps,\" said Deronda, seizing his opportunity. \"That has made your care for her the more needful.\"\n\"Ay, ay, it's a good many years since I had to manage for her and myself,\" said Cohen. \"It's that makes you a sharp knife.\"\n\"What makes a sharp knife, father?\" said Jacob, his cheek swollen with cake.\nThe father winked at his guest and said, \"Having your nose put to the grindstone.\"\nJacob slipped from his chair, cake in hand, and going to Mordecai, who had been silent hitherto, said, \"What does that mean - putting my nose to the grindstone?\"\n\"It means that you are to bear being hurt without making a noise,\" said Mordecai, turning his eyes benignly on the small face close to his. Jacob put the corner of the cake into Mordecai's mouth as an invitation to bite, keeping his eyes on it to observe how much of it went in this act of generosity. Mordecai took a bite and smiled, and the little incident made them both look more lovable. Deronda, however, felt that he had gathered little by his question.\nTurning to Mordecai, he said, \"You have been a great student, I imagine?\"\n\"I have studied,\" was the quiet answer. \"And you? You know German by the book you were buying.\"\n\"Yes, I have studied in Germany. Are you generally engaged in bookselling?\" said Deronda.\n\"No; I only go to Mr. Ram's shop every day to keep it while he goes to meals,\" said Mordecai, who was now looking at Deronda with a revival of his original interest. After a slight pause, he said, \"Perhaps you know Hebrew?\"\n\"I am sorry to say, not at all.\"\nMordecai's countenance fell: he cast down his eyelids and said no more. Deronda noticed a definite difficulty in the other man's breathing, which he thought must be a sign of consumption.\n\"I've been too busy for book-learning.\" said Mr. Cohen. \"I've had to learn about useful things. I know stones well,\" - here he pointed to Deronda's ring. \"Now, what do you want for it?\"\n\"Fifty or sixty pounds,\" Deronda answered, rather too carelessly.\nCohen paused a little, hands in his pockets, fixed on Deronda a pair of glistening eyes that suggested a miraculous guinea-pig, and said,\n\"Couldn't do you that. Happy to oblige, but say forty pound - I'll let you have forty on it.\"\nDeronda was aware that Mordecai had looked up and was examining him again, while he said, \"Very well, I shall redeem it in a month or so.\"\n\"Good. I'll make you out the ticket by-and-by,\" said Cohen. Then he, Mordecai and Jacob put on their hats, and he began a thanksgiving, which was carried on by responses, till Mordecai spoke alone at some length, in a solemn chant, with his chin uplifted and his thin hands clasped. There could hardly have been a stronger contrast to the Jew at the other end of the table. It was unaccountable - the presence among these common, prosperous, shopkeeping types, of a man who, in an emaciated threadbare condition, imposed a certain awe on Deronda, and an embarrassment at not meeting his expectations.\nNo sooner had Mordecai finished his prayer than he rose, and with a slight bend of his head to the stranger, walked back into his room, and shut the door behind him.\n\"That seems to be rather a remarkable man,\" said Deronda, turning to Cohen, who tapped his own brow, indicating that Mordecai did not come up to his standard of sanity.\n\"Does he belong to your family?\" said Deronda.\nThe family exchanged looks of amusement.\n\"No, no,\" said Cohen. \"Charity! he worked for me, and when he got weaker I took him in. He's an encumbrance; but he brings a blessing, and he teaches the boy. Besides, he repairs the watches and jewellery.\"\nDeronda smiled at this mixture of kindliness and the desire to justify it; but Mr. Cohen immediately dismissed the subject of Mordecai by reverting to business. He proceeded to make out the ticket, got the forty pounds, and presented them both in exchange for the diamond ring.\nDeronda, feeling he could protract his visit no longer, had to take his leave, with no more result than a pawn-ticket in his pocket to make a reason for returning after Christmas. He was resolved that he would then try to learn more about Mordecai; from whom also he might gather knowledge about the Cohens - for example, the reason why it was forbidden to ask Mrs. Cohen the elder whether she had a daughter.",
        "paragraph_chars": [
            [
                0,
                328
            ],
            [
                328,
                801
            ],
            [
                801,
                1344
            ],
            [
                1344,
                1532
            ],
            [
                1532,
                1577
            ],
            [
                1577,
                1673
            ],
            [
                1673,
                1738
            ],
            [
                1738,
                1876
            ],
            [
                1876,
                1978
            ],
            [
                1978,
                2032
            ],
            [
                2032,
                2097
            ],
            [
                2097,
                2167
            ],
            [
                2167,
                2227
            ],
            [
                2227,
                2318
            ],
            [
                2318,
                2874
            ],
            [
                2874,
                3117
            ],
            [
                3117,
                3330
            ],
            [
                3330,
                3706
            ],
            [
                3706,
                4016
            ],
            [
                4016,
                4432
            ],
            [
                4432,
                5018
            ],
            [
                5018,
                5651
            ],
            [
                5651,
                5857
            ],
            [
                5857,
                5986
            ],
            [
                5986,
                6357
            ],
            [
                6357,
                6502
            ],
            [
                6502,
                6626
            ],
            [
                6626,
                6703
            ],
            [
                6703,
                6786
            ],
            [
                6786,
                6948
            ],
            [
                6948,
                7409
            ],
            [
                7409,
                7483
            ],
            [
                7483,
                7579
            ],
            [
                7579,
                7669
            ],
            [
                7669,
                7893
            ],
            [
                7893,
                7926
            ],
            [
                7926,
                8114
            ],
            [
                8114,
                8300
            ],
            [
                8300,
                8366
            ],
            [
                8366,
                8504
            ],
            [
                8504,
                8598
            ],
            [
                8598,
                8737
            ],
            [
                8737,
                9338
            ],
            [
                9338,
                9504
            ],
            [
                9504,
                9673
            ],
            [
                9673,
                9720
            ],
            [
                9720,
                9761
            ],
            [
                9761,
                9968
            ],
            [
                9968,
                10246
            ],
            [
                10246,
                10655
            ]
        ],
        "segment_chars": [
            [
                0,
                99
            ],
            [
                99,
                148
            ],
            [
                148,
                328
            ],
            [
                328,
                422
            ],
            [
                422,
                553
            ],
            [
                553,
                801
            ],
            [
                801,
                917
            ],
            [
                917,
                1049
            ],
            [
                1049,
                1259
            ],
            [
                1259,
                1344
            ],
            [
                1344,
                1432
            ],
            [
                1432,
                1532
            ],
            [
                1532,
                1577
            ],
            [
                1577,
                1673
            ],
            [
                1673,
                1724
            ],
            [
                1724,
                1738
            ],
            [
                1738,
                1784
            ],
            [
                1784,
                1830
            ],
            [
                1830,
                1876
            ],
            [
                1876,
                1905
            ],
            [
                1905,
                1978
            ],
            [
                1978,
                2020
            ],
            [
                2020,
                2032
            ],
            [
                2032,
                2075
            ],
            [
                2075,
                2097
            ],
            [
                2097,
                2132
            ],
            [
                2132,
                2167
            ],
            [
                2167,
                2227
            ],
            [
                2227,
                2318
            ],
            [
                2318,
                2524
            ],
            [
                2524,
                2628
            ],
            [
                2628,
                2796
            ],
            [
                2796,
                2874
            ],
            [
                2874,
                2924
            ],
            [
                2924,
                2947
            ],
            [
                2947,
                3033
            ],
            [
                3033,
                3068
            ],
            [
                3068,
                3094
            ],
            [
                3094,
                3104
            ],
            [
                3104,
                3117
            ],
            [
                3117,
                3189
            ],
            [
                3189,
                3226
            ],
            [
                3226,
                3284
            ],
            [
                3284,
                3330
            ],
            [
                3330,
                3518
            ],
            [
                3518,
                3595
            ],
            [
                3595,
                3628
            ],
            [
                3628,
                3652
            ],
            [
                3652,
                3706
            ],
            [
                3706,
                3731
            ],
            [
                3731,
                3929
            ],
            [
                3929,
                4016
            ],
            [
                4016,
                4165
            ],
            [
                4165,
                4277
            ],
            [
                4277,
                4432
            ],
            [
                4432,
                4834
            ],
            [
                4834,
                5018
            ],
            [
                5018,
                5252
            ],
            [
                5252,
                5530
            ],
            [
                5530,
                5651
            ],
            [
                5651,
                5857
            ],
            [
                5857,
                5986
            ],
            [
                5986,
                6066
            ],
            [
                6066,
                6142
            ],
            [
                6142,
                6308
            ],
            [
                6308,
                6357
            ],
            [
                6357,
                6450
            ],
            [
                6450,
                6502
            ],
            [
                6502,
                6589
            ],
            [
                6589,
                6626
            ],
            [
                6626,
                6662
            ],
            [
                6662,
                6703
            ],
            [
                6703,
                6786
            ],
            [
                6786,
                6948
            ],
            [
                6948,
                7088
            ],
            [
                7088,
                7250
            ],
            [
                7250,
                7341
            ],
            [
                7341,
                7409
            ],
            [
                7409,
                7483
            ],
            [
                7483,
                7523
            ],
            [
                7523,
                7533
            ],
            [
                7533,
                7579
            ],
            [
                7579,
                7612
            ],
            [
                7612,
                7655
            ],
            [
                7655,
                7669
            ],
            [
                7669,
                7835
            ],
            [
                7835,
                7893
            ],
            [
                7893,
                7926
            ],
            [
                7926,
                7998
            ],
            [
                7998,
                8114
            ],
            [
                8114,
                8154
            ],
            [
                8154,
                8170
            ],
            [
                8170,
                8210
            ],
            [
                8210,
                8268
            ],
            [
                8268,
                8300
            ],
            [
                8300,
                8366
            ],
            [
                8366,
                8504
            ],
            [
                8504,
                8527
            ],
            [
                8527,
                8598
            ],
            [
                8598,
                8737
            ],
            [
                8737,
                8744
            ],
            [
                8744,
                8797
            ],
            [
                8797,
                9020
            ],
            [
                9020,
                9111
            ],
            [
                9111,
                9338
            ],
            [
                9338,
                9504
            ],
            [
                9504,
                9673
            ],
            [
                9673,
                9706
            ],
            [
                9706,
                9720
            ],
            [
                9720,
                9761
            ],
            [
                9761,
                9783
            ],
            [
                9783,
                9793
            ],
            [
                9793,
                9849
            ],
            [
                9849,
                9920
            ],
            [
                9920,
                9968
            ],
            [
                9968,
                10129
            ],
            [
                10129,
                10246
            ],
            [
                10246,
                10426
            ],
            [
                10426,
                10655
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                42,
                49
            ],
            [
                50,
                85
            ],
            [
                86,
                92
            ],
            [
                93,
                97
            ],
            [
                97,
                98
            ],
            [
                99,
                148
            ],
            [
                148,
                170
            ],
            [
                171,
                193
            ],
            [
                194,
                208
            ],
            [
                209,
                212
            ],
            [
                213,
                327
            ],
            [
                328,
                331
            ],
            [
                332,
                336
            ],
            [
                337,
                349
            ],
            [
                356,
                386
            ],
            [
                392,
                410
            ],
            [
                420,
                422
            ],
            [
                422,
                435
            ],
            [
                435,
                436
            ],
            [
                437,
                452
            ],
            [
                455,
                511
            ],
            [
                517,
                528
            ],
            [
                529,
                540
            ],
            [
                543,
                551
            ],
            [
                551,
                553
            ],
            [
                553,
                703
            ],
            [
                703,
                753
            ],
            [
                754,
                800
            ],
            [
                801,
                808
            ],
            [
                809,
                917
            ],
            [
                917,
                1016
            ],
            [
                1017,
                1021
            ],
            [
                1047,
                1049
            ],
            [
                1049,
                1092
            ],
            [
                1097,
                1123
            ],
            [
                1123,
                1124
            ],
            [
                1131,
                1138
            ],
            [
                1139,
                1154
            ],
            [
                1155,
                1159
            ],
            [
                1160,
                1170
            ],
            [
                1179,
                1219
            ],
            [
                1224,
                1257
            ],
            [
                1257,
                1259
            ],
            [
                1259,
                1265
            ],
            [
                1270,
                1276
            ],
            [
                1277,
                1344
            ],
            [
                1344,
                1373
            ],
            [
                1374,
                1432
            ],
            [
                1432,
                1470
            ],
            [
                1473,
                1529
            ],
            [
                1532,
                1577
            ],
            [
                1577,
                1615
            ],
            [
                1616,
                1620
            ],
            [
                1645,
                1673
            ],
            [
                1673,
                1724
            ],
            [
                1724,
                1738
            ],
            [
                1738,
                1784
            ],
            [
                1784,
                1830
            ],
            [
                1830,
                1876
            ],
            [
                1876,
                1905
            ],
            [
                1905,
                1978
            ],
            [
                1978,
                2020
            ],
            [
                2020,
                2030
            ],
            [
                2030,
                2032
            ],
            [
                2032,
                2033
            ],
            [
                2033,
                2075
            ],
            [
                2075,
                2086
            ],
            [
                2087,
                2095
            ],
            [
                2097,
                2132
            ],
            [
                2132,
                2167
            ],
            [
                2167,
                2172
            ],
            [
                2181,
                2189
            ],
            [
                2190,
                2202
            ],
            [
                2202,
                2203
            ],
            [
                2218,
                2225
            ],
            [
                2227,
                2302
            ],
            [
                2309,
                2318
            ],
            [
                2318,
                2329
            ],
            [
                2336,
                2429
            ],
            [
                2432,
                2495
            ],
            [
                2501,
                2522
            ],
            [
                2522,
                2524
            ],
            [
                2524,
                2554
            ],
            [
                2555,
                2626
            ],
            [
                2628,
                2721
            ],
            [
                2729,
                2732
            ],
            [
                2733,
                2737
            ],
            [
                2738,
                2741
            ],
            [
                2742,
                2752
            ],
            [
                2753,
                2767
            ],
            [
                2768,
                2796
            ],
            [
                2796,
                2848
            ],
            [
                2849,
                2874
            ],
            [
                2874,
                2875
            ],
            [
                2882,
                2887
            ],
            [
                2887,
                2922
            ],
            [
                2922,
                2924
            ],
            [
                2924,
                2925
            ],
            [
                2925,
                2947
            ],
            [
                2947,
                3033
            ],
            [
                3033,
                3068
            ],
            [
                3068,
                3094
            ],
            [
                3094,
                3104
            ],
            [
                3104,
                3117
            ],
            [
                3117,
                3189
            ],
            [
                3189,
                3226
            ],
            [
                3226,
                3284
            ],
            [
                3284,
                3330
            ],
            [
                3330,
                3395
            ],
            [
                3396,
                3403
            ],
            [
                3413,
                3425
            ],
            [
                3426,
                3518
            ],
            [
                3518,
                3520
            ],
            [
                3521,
                3529
            ],
            [
                3530,
                3538
            ],
            [
                3539,
                3595
            ],
            [
                3595,
                3628
            ],
            [
                3628,
                3650
            ],
            [
                3650,
                3652
            ],
            [
                3652,
                3674
            ],
            [
                3683,
                3703
            ],
            [
                3706,
                3729
            ],
            [
                3729,
                3731
            ],
            [
                3731,
                3771
            ],
            [
                3784,
                3791
            ],
            [
                3792,
                3802
            ],
            [
                3803,
                3929
            ],
            [
                3929,
                4016
            ],
            [
                4024,
                4057
            ],
            [
                4058,
                4061
            ],
            [
                4062,
                4082
            ],
            [
                4099,
                4142
            ],
            [
                4143,
                4146
            ],
            [
                4147,
                4165
            ],
            [
                4165,
                4229
            ],
            [
                4252,
                4277
            ],
            [
                4277,
                4280
            ],
            [
                4284,
                4292
            ],
            [
                4301,
                4382
            ],
            [
                4397,
                4430
            ],
            [
                4430,
                4432
            ],
            [
                4432,
                4484
            ],
            [
                4484,
                4485
            ],
            [
                4486,
                4490
            ],
            [
                4491,
                4592
            ],
            [
                4595,
                4655
            ],
            [
                4658,
                4770
            ],
            [
                4771,
                4784
            ],
            [
                4793,
                4801
            ],
            [
                4809,
                4811
            ],
            [
                4832,
                4834
            ],
            [
                4834,
                5017
            ],
            [
                5018,
                5065
            ],
            [
                5065,
                5143
            ],
            [
                5148,
                5151
            ],
            [
                5152,
                5155
            ],
            [
                5167,
                5199
            ],
            [
                5205,
                5209
            ],
            [
                5223,
                5234
            ],
            [
                5239,
                5252
            ],
            [
                5252,
                5363
            ],
            [
                5366,
                5371
            ],
            [
                5372,
                5375
            ],
            [
                5375,
                5429
            ],
            [
                5438,
                5461
            ],
            [
                5463,
                5468
            ],
            [
                5469,
                5475
            ],
            [
                5476,
                5528
            ],
            [
                5528,
                5530
            ],
            [
                5546,
                5550
            ],
            [
                5551,
                5559
            ],
            [
                5560,
                5563
            ],
            [
                5564,
                5569
            ],
            [
                5570,
                5602
            ],
            [
                5604,
                5649
            ],
            [
                5649,
                5651
            ],
            [
                5651,
                5731
            ],
            [
                5732,
                5763
            ],
            [
                5768,
                5778
            ],
            [
                5779,
                5798
            ],
            [
                5801,
                5856
            ],
            [
                5857,
                5888
            ],
            [
                5899,
                5915
            ],
            [
                5915,
                5975
            ],
            [
                5980,
                5983
            ],
            [
                5986,
                5987
            ],
            [
                5990,
                6066
            ],
            [
                6066,
                6072
            ],
            [
                6078,
                6098
            ],
            [
                6099,
                6140
            ],
            [
                6140,
                6142
            ],
            [
                6142,
                6254
            ],
            [
                6255,
                6305
            ],
            [
                6305,
                6308
            ],
            [
                6308,
                6355
            ],
            [
                6355,
                6357
            ],
            [
                6357,
                6450
            ],
            [
                6450,
                6502
            ],
            [
                6502,
                6527
            ],
            [
                6534,
                6587
            ],
            [
                6587,
                6589
            ],
            [
                6590,
                6626
            ],
            [
                6626,
                6627
            ],
            [
                6627,
                6662
            ],
            [
                6662,
                6683
            ],
            [
                6684,
                6696
            ],
            [
                6697,
                6703
            ],
            [
                6703,
                6765
            ],
            [
                6769,
                6786
            ],
            [
                6786,
                6814
            ],
            [
                6816,
                6823
            ],
            [
                6824,
                6839
            ],
            [
                6840,
                6865
            ],
            [
                6866,
                6909
            ],
            [
                6910,
                6911
            ],
            [
                6920,
                6948
            ],
            [
                6948,
                7053
            ],
            [
                7056,
                7088
            ],
            [
                7088,
                7168
            ],
            [
                7169,
                7188
            ],
            [
                7192,
                7250
            ],
            [
                7250,
                7281
            ],
            [
                7281,
                7341
            ],
            [
                7341,
                7363
            ],
            [
                7364,
                7375
            ],
            [
                7385,
                7409
            ],
            [
                7417,
                7419
            ],
            [
                7420,
                7429
            ],
            [
                7430,
                7432
            ],
            [
                7433,
                7483
            ],
            [
                7483,
                7523
            ],
            [
                7523,
                7532
            ],
            [
                7533,
                7579
            ],
            [
                7579,
                7612
            ],
            [
                7612,
                7655
            ],
            [
                7655,
                7669
            ],
            [
                7669,
                7798
            ],
            [
                7799,
                7833
            ],
            [
                7833,
                7835
            ],
            [
                7835,
                7893
            ],
            [
                7893,
                7926
            ],
            [
                7926,
                7979
            ],
            [
                7980,
                7998
            ],
            [
                7998,
                8005
            ],
            [
                8006,
                8013
            ],
            [
                8014,
                8015
            ],
            [
                8025,
                8038
            ],
            [
                8055,
                8114
            ],
            [
                8114,
                8119
            ],
            [
                8138,
                8154
            ],
            [
                8154,
                8168
            ],
            [
                8170,
                8182
            ],
            [
                8189,
                8210
            ],
            [
                8210,
                8230
            ],
            [
                8233,
                8268
            ],
            [
                8268,
                8269
            ],
            [
                8269,
                8272
            ],
            [
                8272,
                8273
            ],
            [
                8274,
                8300
            ],
            [
                8300,
                8366
            ],
            [
                8366,
                8388
            ],
            [
                8389,
                8394
            ],
            [
                8398,
                8503
            ],
            [
                8504,
                8527
            ],
            [
                8527,
                8547
            ],
            [
                8548,
                8557
            ],
            [
                8558,
                8563
            ],
            [
                8566,
                8598
            ],
            [
                8598,
                8643
            ],
            [
                8644,
                8651
            ],
            [
                8652,
                8737
            ],
            [
                8737,
                8744
            ],
            [
                8744,
                8795
            ],
            [
                8795,
                8797
            ],
            [
                8797,
                8801
            ],
            [
                8802,
                8847
            ],
            [
                8848,
                8850
            ],
            [
                8857,
                8921
            ],
            [
                8928,
                8961
            ],
            [
                8967,
                8982
            ],
            [
                8983,
                9018
            ],
            [
                9018,
                9020
            ],
            [
                9020,
                9111
            ],
            [
                9111,
                9117
            ],
            [
                9118,
                9131
            ],
            [
                9134,
                9338
            ],
            [
                9338,
                9373
            ],
            [
                9381,
                9385
            ],
            [
                9386,
                9388
            ],
            [
                9393,
                9394
            ],
            [
                9399,
                9446
            ],
            [
                9447,
                9504
            ],
            [
                9504,
                9583
            ],
            [
                9584,
                9603
            ],
            [
                9603,
                9604
            ],
            [
                9616,
                9648
            ],
            [
                9649,
                9652
            ],
            [
                9653,
                9671
            ],
            [
                9671,
                9673
            ],
            [
                9673,
                9706
            ],
            [
                9706,
                9720
            ],
            [
                9720,
                9730
            ],
            [
                9741,
                9761
            ],
            [
                9761,
                9783
            ],
            [
                9783,
                9793
            ],
            [
                9793,
                9833
            ],
            [
                9834,
                9849
            ],
            [
                9849,
                9856
            ],
            [
                9860,
                9894
            ],
            [
                9894,
                9920
            ],
            [
                9920,
                9931
            ],
            [
                9940,
                9955
            ],
            [
                9965,
                9968
            ],
            [
                9968,
                9975
            ],
            [
                9983,
                10041
            ],
            [
                10041,
                10046
            ],
            [
                10079,
                10082
            ],
            [
                10091,
                10102
            ],
            [
                10103,
                10105
            ],
            [
                10116,
                10118
            ],
            [
                10127,
                10129
            ],
            [
                10132,
                10165
            ],
            [
                10170,
                10191
            ],
            [
                10202,
                10245
            ],
            [
                10246,
                10262
            ],
            [
                10263,
                10265
            ],
            [
                10272,
                10290
            ],
            [
                10300,
                10337
            ],
            [
                10338,
                10349
            ],
            [
                10352,
                10370
            ],
            [
                10371,
                10377
            ],
            [
                10378,
                10408
            ],
            [
                10409,
                10426
            ],
            [
                10426,
                10460
            ],
            [
                10465,
                10467
            ],
            [
                10474,
                10478
            ],
            [
                10485,
                10525
            ],
            [
                10536,
                10552
            ],
            [
                10555,
                10655
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                148
            ],
            [
                148,
                328
            ],
            [
                328,
                422
            ],
            [
                422,
                553
            ],
            [
                553,
                801
            ],
            [
                801,
                917
            ],
            [
                917,
                1049
            ],
            [
                1049,
                1259
            ],
            [
                1259,
                1344
            ],
            [
                1344,
                1432
            ],
            [
                1432,
                1532
            ],
            [
                1532,
                1577
            ],
            [
                1577,
                1673
            ],
            [
                1673,
                1724
            ],
            [
                1724,
                1738
            ],
            [
                1738,
                1784
            ],
            [
                1784,
                1830
            ],
            [
                1830,
                1876
            ],
            [
                1876,
                1905
            ],
            [
                1905,
                1978
            ],
            [
                1978,
                2020
            ],
            [
                2020,
                2032
            ],
            [
                2032,
                2075
            ],
            [
                2075,
                2097
            ],
            [
                2097,
                2132
            ],
            [
                2132,
                2167
            ],
            [
                2167,
                2227
            ],
            [
                2227,
                2318
            ],
            [
                2318,
                2524
            ],
            [
                2524,
                2796
            ],
            [
                2796,
                2874
            ],
            [
                2874,
                2924
            ],
            [
                2924,
                2947
            ],
            [
                2947,
                3033
            ],
            [
                3033,
                3068
            ],
            [
                3068,
                3068
            ],
            [
                3068,
                3068
            ],
            [
                3068,
                3094
            ],
            [
                3094,
                3104
            ],
            [
                3104,
                3117
            ],
            [
                3117,
                3189
            ],
            [
                3189,
                3226
            ],
            [
                3226,
                3284
            ],
            [
                3284,
                3330
            ],
            [
                3330,
                3518
            ],
            [
                3518,
                3595
            ],
            [
                3595,
                3628
            ],
            [
                3628,
                3652
            ],
            [
                3652,
                3706
            ],
            [
                3706,
                3731
            ],
            [
                3731,
                3929
            ],
            [
                3929,
                4016
            ],
            [
                4016,
                4016
            ],
            [
                4016,
                4016
            ],
            [
                4016,
                4165
            ],
            [
                4165,
                4277
            ],
            [
                4277,
                4432
            ],
            [
                4432,
                4834
            ],
            [
                4834,
                5018
            ],
            [
                5018,
                5252
            ],
            [
                5252,
                5530
            ],
            [
                5530,
                5651
            ],
            [
                5651,
                5857
            ],
            [
                5857,
                5857
            ],
            [
                5857,
                5857
            ],
            [
                5857,
                5857
            ],
            [
                5857,
                5986
            ],
            [
                5986,
                5986
            ],
            [
                5986,
                6066
            ],
            [
                6066,
                6142
            ],
            [
                6142,
                6308
            ],
            [
                6308,
                6357
            ],
            [
                6357,
                6450
            ],
            [
                6450,
                6502
            ],
            [
                6502,
                6589
            ],
            [
                6589,
                6589
            ],
            [
                6589,
                6626
            ],
            [
                6626,
                6662
            ],
            [
                6662,
                6703
            ],
            [
                6703,
                6786
            ],
            [
                6786,
                6948
            ],
            [
                6948,
                7088
            ],
            [
                7088,
                7250
            ],
            [
                7250,
                7341
            ],
            [
                7341,
                7409
            ],
            [
                7409,
                7483
            ],
            [
                7483,
                7523
            ],
            [
                7523,
                7579
            ],
            [
                7579,
                7612
            ],
            [
                7612,
                7655
            ],
            [
                7655,
                7669
            ],
            [
                7669,
                7835
            ],
            [
                7835,
                7893
            ],
            [
                7893,
                7926
            ],
            [
                7926,
                7998
            ],
            [
                7998,
                8114
            ],
            [
                8114,
                8154
            ],
            [
                8154,
                8210
            ],
            [
                8210,
                8268
            ],
            [
                8268,
                8268
            ],
            [
                8268,
                8300
            ],
            [
                8300,
                8366
            ],
            [
                8366,
                8527
            ],
            [
                8527,
                8598
            ],
            [
                8598,
                8737
            ],
            [
                8737,
                8744
            ],
            [
                8744,
                8797
            ],
            [
                8797,
                9020
            ],
            [
                9020,
                9111
            ],
            [
                9111,
                9338
            ],
            [
                9338,
                9504
            ],
            [
                9504,
                9673
            ],
            [
                9673,
                9706
            ],
            [
                9706,
                9720
            ],
            [
                9720,
                9761
            ],
            [
                9761,
                9783
            ],
            [
                9783,
                9793
            ],
            [
                9793,
                9793
            ],
            [
                9793,
                9849
            ],
            [
                9849,
                9920
            ],
            [
                9920,
                9968
            ],
            [
                9968,
                10129
            ],
            [
                10129,
                10246
            ],
            [
                10246,
                10426
            ],
            [
                10426,
                10655
            ]
        ]
    }
}