{
    "original": {
        "text": "_Aspern._ Pardon, my lord--I speak for Sigismund. _Fronsberg._ For him? Oh, ay--for him I always hold A pardon safe in bank, sure he will draw Sooner or later on me. What his need? Mad project broken? fine mechanic wings That would not fly? durance, assault on watch, Bill for Epernay, not a crust to eat? _Aspern._ Oh, none of these, my lord; he has escaped From Circe's herd, and seeks to win the love Of your fair ward Cecilia: but would win First your consent. You frown. _Fronsberg._ Distinguish words. I said I held a pardon, not consent.\nIn spite of Deronda's reasons for wishing to be in town again--reasons in which his anxiety for Mirah was blent with curiosity to know more of the enigmatic Mordecai--he did not manage to go up before Sir Hugo, who preceded his family that he might be ready for the opening of Parliament on the sixth of February. Deronda took up his quarters in Park Lane, aware that his chambers were sufficiently tenanted by Hans Meyrick. This was what he expected; but he found other things not altogether according to his expectations.\nMost of us remember Retzsch's drawing of destiny in the shape of Mephistopheles playing at chess with man for his soul, a game in which we may imagine the clever adversary making a feint of unintended moves so as to set the beguiled mortal on carrying his defensive pieces away from the true point of attack. The fiend makes preparation his favorite object of mockery, that he may fatally persuade us against our taking out waterproofs when he is well aware the sky is going to clear, foreseeing that the imbecile will turn this delusion into a prejudice against waterproofs instead of giving a closer study to the weather-signs. It is a peculiar test of a man's mettle when, after he has painfully adjusted himself to what seems a wise provision, he finds all his mental precaution a little beside the mark, and his excellent intentions no better than miscalculated dovetails, accurately cut from a wrong starting-point. His magnanimity has got itself ready to meet misbehavior, and finds quite a different call upon it. Something of this kind happened to Deronda.\nHis first impression was one of pure pleasure and amusement at finding his sitting-room transformed into an _atelier_ strewed with miscellaneous drawings and with the contents of two chests from Rome, the lower half of the windows darkened with baize, and the blonde Hans in his weird youth as the presiding genius of the littered place--his hair longer than of old, his face more whimsically creased, and his high voice as usual getting higher under the excitement of rapid talk. The friendship of the two had been kept up warmly since the memorable Cambridge time, not only by correspondence but by little episodes of companionship abroad and in England, and the original relation of confidence on one side and indulgence on the other had been developed in practice, as is wont to be the case where such spiritual borrowing and lending has been well begun.\n\"I knew you would like to see my casts and antiquities,\" said Hans, after the first hearty greetings and inquiries, \"so I didn't scruple to unlade my chests here. But I've found two rooms at Chelsea not many hundred yards from my mother and sisters, and I shall soon be ready to hang out there--when they've scraped the walls and put in some new lights. That's all I'm waiting for. But you see I don't wait to begin work: you can't conceive what a great fellow I'm going to be. The seed of immortality has sprouted within me.\"\n\"Only a fungoid growth, I dare say--a growing disease in the lungs,\" said Deronda, accustomed to treat Hans in brotherly fashion. He was walking toward some drawings propped on the ledge of his bookcases; five rapidly-sketched heads--different aspects of the same face. He stood at a convenient distance from them, without making any remark. Hans, too, was silent for a minute, took up his palette and began touching the picture on his easel.\n\"What do you think of them?\" he said at last.\n\"The full face looks too massive; otherwise the likenesses are good,\" said Deronda, more coldly than was usual with him.\n\"No, it is not too massive,\" said Hans, decisively. \"I have noted that. There is always a little surprise when one passes from the profile to the full face. But I shall enlarge her scale for Berenice. I am making a Berenice series--look at the sketches along there--and now I think of it, you are just the model I want for the Agrippa.\" Hans, still with pencil and palette in hand, had moved to Deronda's side while he said this, but he added hastily, as if conscious of a mistake, \"No, no, I forgot; you don't like sitting for your portrait, confound you! However, I've picked up a capital Titus. There are to be five in the series. The first is Berenice clasping the knees of Gessius Florus and beseeching him to spare her people; I've got that on the easel. Then, this, where she is standing on the Xystus with Agrippa, entreating the people not to injure themselves by resistance.\"\n\"Agrippa's legs will never do,\" said Deronda.\n\"The legs are good realistically,\" said Hans, his face creasing drolly; \"public men are often shaky about the legs--' Their legs, the emblem of their various thought,' as somebody says in the _Rehearsal._\"\n\"But these are as impossible as the legs of Raphael's Alcibiades,\" said Deronda.\n\"Then they are good ideally,\" said Hans. \"Agrippa's legs were possibly bad; I idealize that and make them impossibly bad. Art, my Eugenius, must intensify. But never mind the legs now: the third sketch in the series is Berenice exulting in the prospects of being Empress of Rome, when the news has come that Vespasian is declared Emperor and her lover Titus his successor.\"\n\"You must put a scroll in her mouth, else people will not understand that. You can't tell that in a picture.\"\n\"It will make them feel their ignorance then--an excellent sthetic effect. The fourth is, Titus sending Berenice away from Rome after she has shared his palace for ten years--both reluctant, both sad--_invitus invitam_, as Suetonius hath it. I've found a model for the Roman brute.\"\n\"Shall you make Berenice look fifty? She must have been that.\"\n\"No, no; a few mature touches to show the lapse of time. Dark-eyed beauty wears well, hers particularly. But now, here is the fifth: Berenice seated lonely on the ruins of Jerusalem. That is pure imagination. That is what ought to have been--perhaps was. Now, see how I tell a pathetic negative. Nobody knows what became of her--that is finely indicated by the series coming to a close. There is no sixth picture.\" Here Hans pretended to speak with a gasping sense of sublimity, and drew back his head with a frown, as if looking for a like impression on Deronda. \"I break off in the Homeric style. The story is chipped off, so to speak, and passes with a ragged edge into nothing--_le nant_; can anything be more sublime, especially in French? The vulgar would desire to see her corpse and burial--perhaps her will read and her linen distributed. But now come and look at this on the easel. I have made some way there.\"\n\"That beseeching attitude is really good,\" said Deronda, after a moment's contemplation. \"You have been very industrious in the Christmas holidays; for I suppose you have taken up the subject since you came to London.\" Neither of them had yet mentioned Mirah.\n\"No,\" said Hans, putting touches to his picture, \"I made up my mind to the subject before. I take that lucky chance for an augury that I am going to burst on the world as a great painter. I saw a splendid woman in the Trastevere--the grandest women there are half Jewesses--and she set me hunting for a fine situation of a Jewess at Rome. Like other men of vast learning, I ended by taking what lay on the surface. I'll show you a sketch of the Trasteverina's head when I can lay my hands on it.\"\n\"I should think she would be a more suitable model for Berenice,\" said Deronda, not knowing exactly how to express his discontent.\n\"Not a bit of it. The model ought to be the most beautiful Jewess in the world, and I have found her.\"\n\"Have you made yourself sure that she would like to figure in that character? I should think no woman would be more abhorrent to her. Does she quite know what you are doing?\"\n\"Certainly. I got her to throw herself precisely into this attitude. Little mother sat for Gessius Florus, and Mirah clasped her knees.\" Here Hans went a little way off and looked at the effect of his touches.\n\"I dare say she knows nothing about Berenice's history,\" said Deronda, feeling more indignation than he would have been able to justify.\n\"Oh, yes, she does--ladies' edition. Berenice was a fervid patriot, but was beguiled by love and ambition into attaching herself to the arch-enemy of her people. Whence the Nemesis. Mirah takes it as a tragic parable, and cries to think what the penitent Berenice suffered as she wandered back to Jerusalem and sat desolate amidst desolation. That was her own phrase. I couldn't find it in my heart to tell her I invented that part of the story.\"\n\"Show me your Trasteverina,\" said Deronda, chiefly in order to hinder himself from saying something else.\n\"Shall you mind turning over that folio?\" said Hans. \"My studies of heads are all there. But they are in confusion. You will perhaps find her next to a crop-eared undergraduate.\"\nAfter Deronda had been turning over the drawings a minute or two, he said,\n\"These seem to be all Cambridge heads and bits of country. Perhaps I had better begin at the other end.\"\n\"No; you'll find her about the middle. I emptied one folio into another.\"\n\"Is this one of your undergraduates?\" said Deronda, holding up a drawing. \"It's an unusually agreeable face.\"\n\"That! Oh, that's a man named Gascoigne--Rex Gascoigne. An uncommonly good fellow; his upper lip, too, is good. I coached him before he got his scholarship. He ought to have taken honors last Easter. But he was ill, and has had to stay up another year. I must look him up. I want to know how he's going on.\"\n\"Here she is, I suppose,\" said Deronda, holding up a sketch of the Trasteverina.\n\"Ah,\" said Hans, looking at it rather contemptuously, \"too coarse. I was unregenerate then.\"\nDeronda was silent while he closed the folio, leaving the Trasteverina outside. Then clasping his coat-collar, and turning toward Hans, he said, \"I dare say my scruples are excessive, Meyrick, but I must ask you to oblige me by giving up this notion.\"\nHans threw himself into a tragic attitude, and screamed, \"What! my series--my immortal Berenice series? Think of what you are saying, man--destroying, as Milton says, not a life but an immortality. Wait before you answer, that I may deposit the implements of my art and be ready to uproot my hair.\"\nHere Hans laid down his pencil and palette, threw himself backward into a great chair, and hanging limply over the side, shook his long hair over his face, lifted his hooked fingers on each side his head, and looked up with comic terror at Deronda, who was obliged to smile, as he said,\n\"Paint as many Berenices as you like, but I wish you could feel with me--perhaps you will, on reflection--that you should choose another model.\"\n\"Why?\" said Hans, standing up, and looking serious again.\n\"Because she may get into such a position that her face is likely to be recognized. Mrs. Meyrick and I are anxious for her that she should be known as an admirable singer. It is right, and she wishes it, that she should make herself independent. And she has excellent chances. One good introduction is secured already, and I am going to speak to Klesmer. Her face may come to be very well known, and--well, it is useless to attempt to explain, unless you feel as I do. I believe that if Mirah saw the circumstances clearly, she would strongly object to being exhibited in this way--to allowing herself to be used as a model for a heroine of this sort.\"\nAs Hans stood with his thumbs in the belt of his blouse, listening to this speech, his face showed a growing surprise melting into amusement, that at last would have its way in an explosive laugh: but seeing that Deronda looked gravely offended, he checked himself to say, \"Excuse my laughing, Deronda. You never gave me an advantage over you before. If it had been about anything but my own pictures, I should have swallowed every word because you said it. And so you actually believe that I should get my five pictures hung on the line in a conspicuous position, and carefully studied by the public? Zounds, man! cider-cup and conceit never gave me half such a beautiful dream. My pictures are likely to remain as private as the utmost hypersensitiveness could desire.\"\nHans turned to paint again as a way of filling up awkward pauses. Deronda stood perfectly still, recognizing his mistake as to publicity, but also conscious that his repugnance was not much diminished. He was the reverse of satisfied either with himself or with Hans; but the power of being quiet carries a man well through moments of embarrassment. Hans had a reverence for his friend which made him feel a sort of shyness at Deronda's being in the wrong; but it was not in his nature to give up anything readily, though it were only a whim--or rather, especially if it were a whim, and he presently went on, painting the while,\n\"But even supposing I had a public rushing after my pictures as if they were a railway series including nurses, babies and bonnet-boxes, I can't see any justice in your objection. Every painter worth remembering has painted the face he admired most, as often as he could. It is a part of his soul that goes out into his pictures. He diffuses its influence in that way. He puts what he hates into a caricature. He puts what he adores into some sacred, heroic form. If a man could paint the woman he loves a thousand times as the _Stella Maris_ to put courage into the sailors on board a thousand ships, so much the more honor to her. Isn't that better than painting a piece of staring immodesty and calling it by a worshipful name?\"\n\"Every objection can be answered if you take broad ground enough, Hans: no special question of conduct can be properly settled in that way,\" said Deronda, with a touch of peremptoriness. \"I might admit all your generalities, and yet be right in saying you ought not to publish Mirah's face as a model for Berenice. But I give up the question of publicity. I was unreasonable there.\" Deronda hesitated a moment. \"Still, even as a private affair, there might be good reasons for your not indulging yourself too much in painting her from the point of view you mention. You must feel that her situation at present is a very delicate one; and until she is in more independence, she should be kept as carefully as a bit of Venetian glass, for fear of shaking her out of the safe place she is lodged in. Are you quite sure of your own discretion? Excuse me, Hans. My having found her binds me to watch over her. Do you understand me?\"\n\"Perfectly,\" said Hans, turning his face into a good-humored smile. \"You have the very justifiable opinion of me that I am likely to shatter all the glass in my way, and break my own skull into the bargain. Quite fair. Since I got into the scrape of being born, everything I have liked best has been a scrape either for myself or somebody else. Everything I have taken to heartily has somehow turned into a scrape. My painting is the last scrape; and I shall be all my life getting out of it. You think now I shall get into a scrape at home. No; I am regenerate. You think I must be over head and ears in love with Mirah. Quite right; so I am. But you think I shall scream and plunge and spoil everything. There you are mistaken--excusably, but transcendently mistaken. I have undergone baptism by immersion. Awe takes care of me. Ask the little mother.\"\n\"You don't reckon a hopeless love among your scrapes, then,\" said Deronda, whose voice seemed to get deeper as Hans's went higher.\n\"I don't mean to call mine hopeless,\" said Hans, with provoking coolness, laying down his tools, thrusting his thumbs into his belt, and moving away a little, as if to contemplate his picture more deliberately.\n\"My dear fellow, you are only preparing misery for yourself,\" said Deronda, decisively. \"She would not marry a Christian, even if she loved him. Have you heard her--of course you have--heard her speak of her people and her religion?\"\n\"That can't last,\" said Hans. \"She will see no Jew who is tolerable. Every male of that race is insupportable--'insupportably advancing'--his nose.\"\n\"She may rejoin her family. That is what she longs for. Her mother and brother are probably strict Jews.\"\n\"I'll turn proselyte, if she wishes it,\" said Hans, with a shrug and a laugh.\n\"Don't talk nonsense, Hans. I thought you professed a serious love for her,\" said Deronda, getting heated.\n\"So I do. You think it desperate, but I don't.\"\n\"I know nothing; I can't tell what has happened. We must be prepared for surprises. But I can hardly imagine a greater surprise to me than that there should have seemed to be anything in Mirah's sentiments for you to found a romantic hope on.\" Deronda felt that he was too contemptuous.\n\"I don't found my romantic hopes on a woman's sentiments,\" said Hans, perversely inclined to be the merrier when he was addressed with gravity. \"I go to science and philosophy for my romance. Nature designed Mirah to fall in love with me. The amalgamation of races demands it--the mitigation of human ugliness demands it--the affinity of contrasts assures it. I am the utmost contrast to Mirah--a bleached Christian, who can't sing two notes in tune. Who has a chance against me?\"\n\"I see now; it was all _persiflage_. You don't mean a word you say, Meyrick,\" said Deronda, laying his hand on Meyrick's shoulder, and speaking in a tone of cordial relief. \"I was a wiseacre to answer you seriously.\"\n\"Upon my honor I do mean it, though,\" said Hans, facing round and laying his left hand on Deronda's shoulder, so that their eyes fronted each other closely. \"I am at the confessional. I meant to tell you as soon as you came. My mother says you are Mirah's guardian, and she thinks herself responsible to you for every breath that falls on Mirah in her house. Well, I love her--I worship her--I won't despair--I mean to deserve her.\"\n\"My dear fellow, you can't do it,\" said Deronda, quickly.\n\"I should have said, I mean to try.\"\n\"You can't keep your resolve, Hans. You used to resolve what you would do for your mother and sisters.\"\n\"You have a right to reproach me, old fellow,\" said Hans, gently.\n\"Perhaps I am ungenerous,\" said Deronda, not apologetically, however. \"Yet it can't be ungenerous to warn you that you are indulging mad, Quixotic expectations.\"\n\"Who will be hurt but myself, then?\" said Hans, putting out his lip. \"I am not going to say anything to her unless I felt sure of the answer. I dare not ask the oracles: I prefer a cheerful caliginosity, as Sir Thomas Browne might say. I would rather run my chance there and lose, than be sure of winning anywhere else. And I don't mean to swallow the poison of despair, though you are disposed to thrust it on me. I am giving up wine, so let me get a little drunk on hope and vanity.\"\n\"With all my heart, if it will do you any good,\" said Deronda, loosing Hans's shoulder, with a little push. He made his tone kindly, but his words were from the lip only. As to his real feeling he was silenced.\nHe was conscious of that peculiar irritation which will sometimes befall the man whom others are inclined to trust as a mentor--the irritation of perceiving that he is supposed to be entirely off the same plane of desire and temptation as those who confess to him. Our guides, we pretend, must be sinless: as if those were not often the best teachers who only yesterday got corrected for their mistakes. Throughout their friendship Deronda had been used to Hans's egotism, but he had never before felt intolerant of it: when Hans, habitually pouring out his own feelings and affairs, had never cared for any detail in return, and, if he chanced to know any, had soon forgotten it. Deronda had been inwardly as well as outwardly indulgent--nay, satisfied. But now he had noted with some indignation, all the stronger because it must not be betrayed, Hans's evident assumption that for any danger of rivalry or jealousy in relation to Mirah, Deronda was not as much out of the question as the angel Gabriel. It is one thing to be resolute in placing one's self out of the question, and another to endure that others should perform that exclusion for us. He had expected that Hans would give him trouble: what he had not expected was that the trouble would have a strong element of personal feeling. And he was rather ashamed that Hans's hopes caused him uneasiness in spite of his well-warranted conviction that they would never be fulfilled. They had raised an image of Mirah changing; and however he might protest that the change would not happen, the protest kept up the unpleasant image. Altogether poor Hans seemed to be entering into Deronda's experience in a disproportionate manner--going beyond his part of rescued prodigal, and rousing a feeling quite distinct from compassionate affection.\nWhen Deronda went to Chelsea he was not made as comfortable as he ought to have been by Mrs. Meyrick's evident release from anxiety about the beloved but incalculable son. Mirah seemed livelier than before, and for the first time he saw her laugh. It was when they were talking of Hans, he being naturally the mother's first topic. Mirah wished to know if Deronda had seen Mr. Hans going through a sort of character piece without changing his dress.\n\"He passes from one figure to another as if he were a bit of flame where you fancied the figures without seeing them,\" said Mirah, full of her subject; \"he is so wonderfully quick. I used never to like comic things on the stage--they were dwelt on too long; but all in one minute Mr. Hans makes himself a blind bard, and then Rienzi addressing the Romans, and then an opera-dancer, and then a desponding young gentleman--I am sorry for them all, and yet I laugh, all in one\"--here Mirah gave a little laugh that might have entered into a song.\n\"We hardly thought that Mirah could laugh till Hans came,\" said Mrs. Meyrick, seeing that Deronda, like herself, was observing the pretty picture.\n\"Hans seems in great force just now,\" said Deronda in a tone of congratulation. \"I don't wonder at his enlivening you.\"\n\"He's been just perfect ever since he came back,\" said Mrs. Meyrick, keeping to herself the next clause--\"if it will but last.\"\n\"It is a great happiness,\" said Mirah, \"to see the son and brother come into this dear home. And I hear them all talk about what they did together when they were little. That seems like heaven, and to have a mother and brother who talk in that way. I have never had it.\"\n\"Nor I,\" said Deronda, involuntarily.\n\"No?\" said Mirah, regretfully. \"I wish you had. I wish you had had every good.\" The last words were uttered with a serious ardor as if they had been part of a litany, while her eyes were fixed on Deronda, who with his elbow on the back of his chair was contemplating her by the new light of the impression she had made on Hans, and the possibility of her being attracted by that extraordinary contrast. It was no more than what had happened on each former visit of his, that Mirah appeared to enjoy speaking of what she felt very much as a little girl fresh from school pours forth spontaneously all the long-repressed chat for which she has found willing ears. For the first time in her life Mirah was among those whom she entirely trusted, and her original visionary impression that Deronda was a divinely-sent messenger hung about his image still, stirring always anew the disposition to reliance and openness. It was in this way she took what might have been the injurious flattery of admiring attention into which her helpless dependence had been suddenly transformed. Every one around her watched for her looks and words, and the effect on her was simply that of having passed from a trifling imprisonment into an exhilarating air which made speech and action a delight. To her mind it was all a gift from others' goodness. But that word of Deronda's implying that there had been some lack in his life which might be compared with anything she had known in hers, was an entirely new inlet of thought about him. After her first expression of sorrowful surprise she went on,\n\"But Mr. Hans said yesterday that you thought so much of others you hardly wanted anything for yourself. He told us a wonderful story of Buddha giving himself to the famished tigress to save her and her little ones from starving. And he said you were like Buddha. That is what we all imagine of you.\"\n\"Pray don't imagine that,\" said Deronda, who had lately been finding such suppositions rather exasperating. \"Even if it were true that I thought so much of others, it would not follow that I had no wants for myself. When Buddha let the tigress eat him he might have been very hungry himself.\"\n\"Perhaps if he was starved he would not mind so much about being eaten,\" said Mab, shyly.\n\"Please don't think that, Mab; it takes away the beauty of the action,\" said Mirah.\n\"But if it were true, Mirah?\" said the rational Amy, having a half-holiday from her teaching; \"you always take what is beautiful as if it were true.\"\n\"So it is,\" said Mirah, gently. \"If people have thought what is the most beautiful and the best thing, it must be true. It is always there.\"\n\"Now, Mirah, what do you mean?\" said Amy.\n\"I understand her,\" said Deronda, coming to the rescue.\n\"It is a truth in thought though it may never have been carried out in action. It lives as an idea. Is that it?\" He turned to Mirah, who was listening with a blind look in her lovely eyes.\n\"It must be that, because you understand me, but I cannot quite explain,\" said Mirah, rather abstractedly--still searching for some expression.\n\"But _was_ it beautiful for Buddha to let the tiger eat him?\" said Amy, changing her ground. \"It would be a bad pattern.\"\n\"The world would get full of fat tigers,\" said Mab.\nDeronda laughed, but defended the myth. \"It is like a passionate word,\" he said; \"the exaggeration is a flash of fervor. It is an extreme image of what is happening every day--the transmutation of self.\"\n\"I think I can say what I mean, now,\" said Mirah, who had not heard the intermediate talk. \"When the best thing comes into our thoughts, it is like what my mother has been to me. She has been just as really with me as all the other people about me--often more really with me.\"\nDeronda, inwardly wincing under this illustration, which brought other possible realities about that mother vividly before him, presently turned the conversation by saying, \"But we must not get too far away from practical matters. I came, for one thing, to tell of an interview I had yesterday, which I hope Mirah will find to have been useful to her. It was with Klesmer, the great pianist.\"\n\"Ah?\" said Mrs. Meyrick, with satisfaction. \"You think he will help her?\"\n\"I hope so. He is very much occupied, but has promised to fix a time for receiving and hearing Miss Lapidoth, as we must learn to call her\"--here Deronda smiled at Mirah--\"If she consents to go to him.\"\n\"I shall be very grateful,\" said Mirah. \"He wants to hear me sing, before he can judge whether I ought to be helped.\"\nDeronda was struck with her plain sense about these matters of practical concern.\n\"It will not be at all trying to you, I hope, if Mrs. Meyrick will kindly go with you to Klesmer's house.\"\n\"Oh, no, not at all trying. I have been doing that all my life--I mean, told to do things that others may judge of me. And I have gone through a bad trial of that sort. I am prepared to bear it, and do some very small thing. Is Klesmer a severe man?\"\n\"He is peculiar, but I have not had experience enough of him to know whether he would be what you would call severe.\"\n\"I know he is kind-hearted--kind in action, if not in speech.\"\n\"I have been used to be frowned at and not praised,\" said Mirah.\n\"By the by, Klesmer frowns a good deal,\" said Deronda, \"but there is often a sort of smile in his eyes all the while. Unhappily he wears spectacles, so you must catch him in the right light to see the smile.\"\n\"I shall not be frightened,\" said Mirah. \"If he were like a roaring lion, he only wants me to sing. I shall do what I can.\"\n\"Then I feel sure you will not mind being invited to sing in Lady Mallinger's drawing-room,\" said Deronda. \"She intends to ask you next month, and will invite many ladies to hear you, who are likely to want lessons from you for their daughters.\"\n\"How fast we are mounting!\" said Mrs. Meyrick, with delight. \"You never thought of getting grand so quickly, Mirah.\"\n\"I am a little frightened at being called Miss Lapidoth,\" said Mirah, coloring with a new uneasiness. \"Might I be called Cohen?\"\n\"I understand you,\" said Deronda, promptly. \"But I assure you, you must not be called Cohen. The name is inadmissible for a singer. This is one of the trifles in which we must conform to vulgar prejudice. We could choose some other name, however--such as singers ordinarily choose--an Italian or Spanish name, which would suit your _physique_.\" To Deronda just now the name Cohen was equivalent to the ugliest of yellow badges.\nMirah reflected a little, anxiously, then said, \"No. If Cohen will not do, I will keep the name I have been called by. I will not hide myself. I have friends to protect me. And now--if my father were very miserable and wanted help--no,\" she said, looking at Mrs. Meyrick, \"I should think, then, that he was perhaps crying as I used to see him, and had nobody to pity him, and I had hidden myself from him. He had none belonging to him but me. Others that made friends with him always left him.\"\n\"Keep to what you feel right, my dear child,\" said Mrs. Meyrick. \"_I_ would not persuade you to the contrary.\" For her own part she had no patience or pity for that father, and would have left him to his crying.\nDeronda was saying to himself, \"I am rather base to be angry with Hans. How can he help being in love with her? But it is too absurdly presumptuous for him even to frame the idea of appropriating her, and a sort of blasphemy to suppose that she could possibly give herself to him.\"\nWhat would it be for Daniel Deronda to entertain such thoughts? He was not one who could quite naively introduce himself where he had just excluded his friend, yet it was undeniable that what had just happened made a new stage in his feeling toward Mirah. But apart from other grounds for self-repression, reasons both definite and vague made him shut away that question as he might have shut up a half-opened writing that would have carried his imagination too far, and given too much shape to presentiments. Might there not come a disclosure which would hold the missing determination of his course? What did he really know about his origin? Strangely in these latter months when it seemed right that he should exert his will in the choice of a destination, the passion of his nature had got more and more locked by this uncertainty. The disclosure might bring its pain, indeed the likelihood seemed to him to be all on that side; but if it helped him to make his life a sequence which would take the form of duty--if it saved him from having to make an arbitrary selection where he felt no preponderance of desire? Still more, he wanted to escape standing as a critic outside the activities of men, stiffened into the ridiculous attitude of self-assigned superiority. His chief tether was his early inwrought affection for Sir Hugo, making him gratefully deferential to wishes with which he had little agreement: but gratitude had been sometimes disturbed by doubts which were near reducing it to a fear of being ungrateful. Many of us complain that half our birthright is sharp duty: Deronda was more inclined to complain that he was robbed of this half; yet he accused himself, as he would have accused another, of being weakly self-conscious and wanting in resolve. He was the reverse of that type painted for us in Faulconbridge and Edmund of Gloster, whose coarse ambition for personal success is inflamed by a defiance of accidental disadvantages. To Daniel the words Father and Mother had the altar-fire in them; and the thought of all closest relations of our nature held still something of the mystic power which had made his neck and ears burn in boyhood. The average man may regard this sensibility on the question of birth as preposterous and hardly credible; but with the utmost respect for his knowledge as the rock from which all other knowledge is hewn, it must be admitted that many well-proved facts are dark to the average man, even concerning the action of his own heart and the structure of his own retina. A century ago he and all his forefathers had not had the slightest notion of that electric discharge by means of which they had all wagged their tongues mistakenly; any more than they were awake to the secluded anguish of exceptional sensitiveness into which many a carelessly-begotten child of man is born.\nPerhaps the ferment was all the stronger in Deronda's mind because he had never had a confidant to whom he could open himself on these delicate subjects. He had always been leaned on instead of being invited to lean. Sometimes he had longed for the sort of friend to whom he might possibly unfold his experience: a young man like himself who sustained a private grief and was not too confident about his own career; speculative enough to understand every moral difficulty, yet socially susceptible, as he himself was, and having every outward sign of equality either in bodily or spiritual wrestling--for he had found it impossible to reciprocate confidences with one who looked up to him. But he had no expectation of meeting the friend he imagined. Deronda's was not one of those quiveringly-poised natures that lend themselves to second-sight.",
        "paragraph_chars": [
            [
                0,
                545
            ],
            [
                545,
                1069
            ],
            [
                1069,
                2135
            ],
            [
                2135,
                2994
            ],
            [
                2994,
                3521
            ],
            [
                3521,
                3964
            ],
            [
                3964,
                4010
            ],
            [
                4010,
                4131
            ],
            [
                4131,
                5017
            ],
            [
                5017,
                5063
            ],
            [
                5063,
                5269
            ],
            [
                5269,
                5350
            ],
            [
                5350,
                5724
            ],
            [
                5724,
                5834
            ],
            [
                5834,
                6117
            ],
            [
                6117,
                6180
            ],
            [
                6180,
                7101
            ],
            [
                7101,
                7361
            ],
            [
                7361,
                7858
            ],
            [
                7858,
                7989
            ],
            [
                7989,
                8092
            ],
            [
                8092,
                8267
            ],
            [
                8267,
                8477
            ],
            [
                8477,
                8614
            ],
            [
                8614,
                9061
            ],
            [
                9061,
                9167
            ],
            [
                9167,
                9346
            ],
            [
                9346,
                9421
            ],
            [
                9421,
                9526
            ],
            [
                9526,
                9600
            ],
            [
                9600,
                9710
            ],
            [
                9710,
                10018
            ],
            [
                10018,
                10099
            ],
            [
                10099,
                10192
            ],
            [
                10192,
                10444
            ],
            [
                10444,
                10743
            ],
            [
                10743,
                11030
            ],
            [
                11030,
                11175
            ],
            [
                11175,
                11233
            ],
            [
                11233,
                11886
            ],
            [
                11886,
                12658
            ],
            [
                12658,
                13288
            ],
            [
                13288,
                14020
            ],
            [
                14020,
                14948
            ],
            [
                14948,
                15803
            ],
            [
                15803,
                15934
            ],
            [
                15934,
                16145
            ],
            [
                16145,
                16379
            ],
            [
                16379,
                16528
            ],
            [
                16528,
                16634
            ],
            [
                16634,
                16712
            ],
            [
                16712,
                16819
            ],
            [
                16819,
                16867
            ],
            [
                16867,
                17154
            ],
            [
                17154,
                17635
            ],
            [
                17635,
                17852
            ],
            [
                17852,
                18285
            ],
            [
                18285,
                18343
            ],
            [
                18343,
                18380
            ],
            [
                18380,
                18484
            ],
            [
                18484,
                18550
            ],
            [
                18550,
                18712
            ],
            [
                18712,
                19198
            ],
            [
                19198,
                19409
            ],
            [
                19409,
                21208
            ],
            [
                21208,
                21658
            ],
            [
                21658,
                22202
            ],
            [
                22202,
                22349
            ],
            [
                22349,
                22469
            ],
            [
                22469,
                22597
            ],
            [
                22597,
                22868
            ],
            [
                22868,
                22906
            ],
            [
                22906,
                24485
            ],
            [
                24485,
                24786
            ],
            [
                24786,
                25079
            ],
            [
                25079,
                25169
            ],
            [
                25169,
                25253
            ],
            [
                25253,
                25403
            ],
            [
                25403,
                25544
            ],
            [
                25544,
                25586
            ],
            [
                25586,
                25642
            ],
            [
                25642,
                25831
            ],
            [
                25831,
                25975
            ],
            [
                25975,
                26097
            ],
            [
                26097,
                26149
            ],
            [
                26149,
                26353
            ],
            [
                26353,
                26630
            ],
            [
                26630,
                27023
            ],
            [
                27023,
                27097
            ],
            [
                27097,
                27300
            ],
            [
                27300,
                27418
            ],
            [
                27418,
                27500
            ],
            [
                27500,
                27607
            ],
            [
                27607,
                27858
            ],
            [
                27858,
                27976
            ],
            [
                27976,
                28039
            ],
            [
                28039,
                28104
            ],
            [
                28104,
                28313
            ],
            [
                28313,
                28437
            ],
            [
                28437,
                28683
            ],
            [
                28683,
                28800
            ],
            [
                28800,
                28929
            ],
            [
                28929,
                29357
            ],
            [
                29357,
                29852
            ],
            [
                29852,
                30064
            ],
            [
                30064,
                30346
            ],
            [
                30346,
                33185
            ],
            [
                33185,
                34031
            ]
        ],
        "segment_chars": [
            [
                0,
                50
            ],
            [
                50,
                72
            ],
            [
                72,
                166
            ],
            [
                166,
                181
            ],
            [
                181,
                201
            ],
            [
                201,
                241
            ],
            [
                241,
                306
            ],
            [
                306,
                465
            ],
            [
                465,
                476
            ],
            [
                476,
                508
            ],
            [
                508,
                545
            ],
            [
                545,
                859
            ],
            [
                859,
                970
            ],
            [
                970,
                1069
            ],
            [
                1069,
                1378
            ],
            [
                1378,
                1699
            ],
            [
                1699,
                1991
            ],
            [
                1991,
                2091
            ],
            [
                2091,
                2135
            ],
            [
                2135,
                2616
            ],
            [
                2616,
                2994
            ],
            [
                2994,
                3157
            ],
            [
                3157,
                3348
            ],
            [
                3348,
                3376
            ],
            [
                3376,
                3472
            ],
            [
                3472,
                3521
            ],
            [
                3521,
                3651
            ],
            [
                3651,
                3791
            ],
            [
                3791,
                3863
            ],
            [
                3863,
                3964
            ],
            [
                3964,
                3993
            ],
            [
                3993,
                4010
            ],
            [
                4010,
                4131
            ],
            [
                4131,
                4183
            ],
            [
                4183,
                4203
            ],
            [
                4203,
                4288
            ],
            [
                4288,
                4332
            ],
            [
                4332,
                4468
            ],
            [
                4468,
                4688
            ],
            [
                4688,
                4729
            ],
            [
                4729,
                4765
            ],
            [
                4765,
                4892
            ],
            [
                4892,
                5017
            ],
            [
                5017,
                5063
            ],
            [
                5063,
                5269
            ],
            [
                5269,
                5350
            ],
            [
                5350,
                5391
            ],
            [
                5391,
                5472
            ],
            [
                5472,
                5506
            ],
            [
                5506,
                5724
            ],
            [
                5724,
                5799
            ],
            [
                5799,
                5834
            ],
            [
                5834,
                5909
            ],
            [
                5909,
                6076
            ],
            [
                6076,
                6117
            ],
            [
                6117,
                6154
            ],
            [
                6154,
                6180
            ],
            [
                6180,
                6237
            ],
            [
                6237,
                6285
            ],
            [
                6285,
                6363
            ],
            [
                6363,
                6389
            ],
            [
                6389,
                6435
            ],
            [
                6435,
                6476
            ],
            [
                6476,
                6567
            ],
            [
                6567,
                6595
            ],
            [
                6595,
                6744
            ],
            [
                6744,
                6779
            ],
            [
                6779,
                6925
            ],
            [
                6925,
                7028
            ],
            [
                7028,
                7072
            ],
            [
                7072,
                7101
            ],
            [
                7101,
                7190
            ],
            [
                7190,
                7320
            ],
            [
                7320,
                7361
            ],
            [
                7361,
                7452
            ],
            [
                7452,
                7549
            ],
            [
                7549,
                7700
            ],
            [
                7700,
                7776
            ],
            [
                7776,
                7858
            ],
            [
                7858,
                7989
            ],
            [
                7989,
                8007
            ],
            [
                8007,
                8092
            ],
            [
                8092,
                8170
            ],
            [
                8170,
                8226
            ],
            [
                8226,
                8267
            ],
            [
                8267,
                8279
            ],
            [
                8279,
                8336
            ],
            [
                8336,
                8404
            ],
            [
                8404,
                8477
            ],
            [
                8477,
                8614
            ],
            [
                8614,
                8651
            ],
            [
                8651,
                8776
            ],
            [
                8776,
                8796
            ],
            [
                8796,
                8957
            ],
            [
                8957,
                8982
            ],
            [
                8982,
                9061
            ],
            [
                9061,
                9167
            ],
            [
                9167,
                9209
            ],
            [
                9209,
                9220
            ],
            [
                9220,
                9256
            ],
            [
                9256,
                9283
            ],
            [
                9283,
                9346
            ],
            [
                9346,
                9421
            ],
            [
                9421,
                9480
            ],
            [
                9480,
                9526
            ],
            [
                9526,
                9565
            ],
            [
                9565,
                9600
            ],
            [
                9600,
                9638
            ],
            [
                9638,
                9674
            ],
            [
                9674,
                9710
            ],
            [
                9710,
                9717
            ],
            [
                9717,
                9766
            ],
            [
                9766,
                9822
            ],
            [
                9822,
                9867
            ],
            [
                9867,
                9910
            ],
            [
                9910,
                9963
            ],
            [
                9963,
                9983
            ],
            [
                9983,
                10018
            ],
            [
                10018,
                10099
            ],
            [
                10099,
                10166
            ],
            [
                10166,
                10192
            ],
            [
                10192,
                10272
            ],
            [
                10272,
                10444
            ],
            [
                10444,
                10508
            ],
            [
                10508,
                10548
            ],
            [
                10548,
                10642
            ],
            [
                10642,
                10743
            ],
            [
                10743,
                11030
            ],
            [
                11030,
                11175
            ],
            [
                11175,
                11182
            ],
            [
                11182,
                11233
            ],
            [
                11233,
                11317
            ],
            [
                11317,
                11405
            ],
            [
                11405,
                11479
            ],
            [
                11479,
                11510
            ],
            [
                11510,
                11588
            ],
            [
                11588,
                11702
            ],
            [
                11702,
                11886
            ],
            [
                11886,
                12189
            ],
            [
                12189,
                12237
            ],
            [
                12237,
                12344
            ],
            [
                12344,
                12488
            ],
            [
                12488,
                12501
            ],
            [
                12501,
                12566
            ],
            [
                12566,
                12658
            ],
            [
                12658,
                12724
            ],
            [
                12724,
                12860
            ],
            [
                12860,
                13008
            ],
            [
                13008,
                13288
            ],
            [
                13288,
                13468
            ],
            [
                13468,
                13560
            ],
            [
                13560,
                13618
            ],
            [
                13618,
                13657
            ],
            [
                13657,
                13698
            ],
            [
                13698,
                13752
            ],
            [
                13752,
                13921
            ],
            [
                13921,
                14020
            ],
            [
                14020,
                14207
            ],
            [
                14207,
                14335
            ],
            [
                14335,
                14376
            ],
            [
                14376,
                14403
            ],
            [
                14403,
                14431
            ],
            [
                14431,
                14586
            ],
            [
                14586,
                14817
            ],
            [
                14817,
                14860
            ],
            [
                14860,
                14877
            ],
            [
                14877,
                14925
            ],
            [
                14925,
                14948
            ],
            [
                14948,
                15016
            ],
            [
                15016,
                15155
            ],
            [
                15155,
                15167
            ],
            [
                15167,
                15293
            ],
            [
                15293,
                15363
            ],
            [
                15363,
                15441
            ],
            [
                15441,
                15490
            ],
            [
                15490,
                15511
            ],
            [
                15511,
                15570
            ],
            [
                15570,
                15592
            ],
            [
                15592,
                15654
            ],
            [
                15654,
                15718
            ],
            [
                15718,
                15757
            ],
            [
                15757,
                15779
            ],
            [
                15779,
                15803
            ],
            [
                15803,
                15934
            ],
            [
                15934,
                16145
            ],
            [
                16145,
                16233
            ],
            [
                16233,
                16290
            ],
            [
                16290,
                16379
            ],
            [
                16379,
                16409
            ],
            [
                16409,
                16448
            ],
            [
                16448,
                16528
            ],
            [
                16528,
                16556
            ],
            [
                16556,
                16584
            ],
            [
                16584,
                16634
            ],
            [
                16634,
                16712
            ],
            [
                16712,
                16740
            ],
            [
                16740,
                16819
            ],
            [
                16819,
                16829
            ],
            [
                16829,
                16867
            ],
            [
                16867,
                16916
            ],
            [
                16916,
                16951
            ],
            [
                16951,
                17111
            ],
            [
                17111,
                17154
            ],
            [
                17154,
                17298
            ],
            [
                17298,
                17346
            ],
            [
                17346,
                17393
            ],
            [
                17393,
                17514
            ],
            [
                17514,
                17605
            ],
            [
                17605,
                17635
            ],
            [
                17635,
                17672
            ],
            [
                17672,
                17808
            ],
            [
                17808,
                17852
            ],
            [
                17852,
                18009
            ],
            [
                18009,
                18036
            ],
            [
                18036,
                18077
            ],
            [
                18077,
                18211
            ],
            [
                18211,
                18285
            ],
            [
                18285,
                18343
            ],
            [
                18343,
                18380
            ],
            [
                18380,
                18416
            ],
            [
                18416,
                18484
            ],
            [
                18484,
                18550
            ],
            [
                18550,
                18620
            ],
            [
                18620,
                18712
            ],
            [
                18712,
                18749
            ],
            [
                18749,
                18781
            ],
            [
                18781,
                18854
            ],
            [
                18854,
                18948
            ],
            [
                18948,
                19032
            ],
            [
                19032,
                19127
            ],
            [
                19127,
                19198
            ],
            [
                19198,
                19306
            ],
            [
                19306,
                19369
            ],
            [
                19369,
                19409
            ],
            [
                19409,
                19674
            ],
            [
                19674,
                19813
            ],
            [
                19813,
                20090
            ],
            [
                20090,
                20164
            ],
            [
                20164,
                20415
            ],
            [
                20415,
                20561
            ],
            [
                20561,
                20706
            ],
            [
                20706,
                20850
            ],
            [
                20850,
                20999
            ],
            [
                20999,
                21208
            ],
            [
                21208,
                21380
            ],
            [
                21380,
                21456
            ],
            [
                21456,
                21540
            ],
            [
                21540,
                21658
            ],
            [
                21658,
                21839
            ],
            [
                21839,
                22202
            ],
            [
                22202,
                22349
            ],
            [
                22349,
                22429
            ],
            [
                22429,
                22469
            ],
            [
                22469,
                22597
            ],
            [
                22597,
                22690
            ],
            [
                22690,
                22767
            ],
            [
                22767,
                22846
            ],
            [
                22846,
                22868
            ],
            [
                22868,
                22906
            ],
            [
                22906,
                22912
            ],
            [
                22912,
                22937
            ],
            [
                22937,
                22954
            ],
            [
                22954,
                22986
            ],
            [
                22986,
                23309
            ],
            [
                23309,
                23568
            ],
            [
                23568,
                23820
            ],
            [
                23820,
                23980
            ],
            [
                23980,
                24183
            ],
            [
                24183,
                24236
            ],
            [
                24236,
                24423
            ],
            [
                24423,
                24485
            ],
            [
                24485,
                24590
            ],
            [
                24590,
                24715
            ],
            [
                24715,
                24749
            ],
            [
                24749,
                24786
            ],
            [
                24786,
                24894
            ],
            [
                24894,
                25002
            ],
            [
                25002,
                25079
            ],
            [
                25079,
                25169
            ],
            [
                25169,
                25253
            ],
            [
                25253,
                25283
            ],
            [
                25283,
                25403
            ],
            [
                25403,
                25435
            ],
            [
                25435,
                25523
            ],
            [
                25523,
                25544
            ],
            [
                25544,
                25576
            ],
            [
                25576,
                25586
            ],
            [
                25586,
                25642
            ],
            [
                25642,
                25721
            ],
            [
                25721,
                25742
            ],
            [
                25742,
                25755
            ],
            [
                25755,
                25831
            ],
            [
                25831,
                25975
            ],
            [
                25975,
                26037
            ],
            [
                26037,
                26068
            ],
            [
                26068,
                26097
            ],
            [
                26097,
                26149
            ],
            [
                26149,
                26189
            ],
            [
                26189,
                26270
            ],
            [
                26270,
                26353
            ],
            [
                26353,
                26444
            ],
            [
                26444,
                26532
            ],
            [
                26532,
                26630
            ],
            [
                26630,
                26861
            ],
            [
                26861,
                26982
            ],
            [
                26982,
                27023
            ],
            [
                27023,
                27029
            ],
            [
                27029,
                27067
            ],
            [
                27067,
                27097
            ],
            [
                27097,
                27109
            ],
            [
                27109,
                27300
            ],
            [
                27300,
                27340
            ],
            [
                27340,
                27418
            ],
            [
                27418,
                27500
            ],
            [
                27500,
                27607
            ],
            [
                27607,
                27635
            ],
            [
                27635,
                27726
            ],
            [
                27726,
                27776
            ],
            [
                27776,
                27832
            ],
            [
                27832,
                27858
            ],
            [
                27858,
                27976
            ],
            [
                27976,
                28039
            ],
            [
                28039,
                28104
            ],
            [
                28104,
                28222
            ],
            [
                28222,
                28313
            ],
            [
                28313,
                28354
            ],
            [
                28354,
                28413
            ],
            [
                28413,
                28437
            ],
            [
                28437,
                28544
            ],
            [
                28544,
                28683
            ],
            [
                28683,
                28711
            ],
            [
                28711,
                28744
            ],
            [
                28744,
                28800
            ],
            [
                28800,
                28902
            ],
            [
                28902,
                28929
            ],
            [
                28929,
                28973
            ],
            [
                28973,
                29022
            ],
            [
                29022,
                29061
            ],
            [
                29061,
                29134
            ],
            [
                29134,
                29274
            ],
            [
                29274,
                29357
            ],
            [
                29357,
                29410
            ],
            [
                29410,
                29476
            ],
            [
                29476,
                29500
            ],
            [
                29500,
                29530
            ],
            [
                29530,
                29763
            ],
            [
                29763,
                29800
            ],
            [
                29800,
                29852
            ],
            [
                29852,
                29917
            ],
            [
                29917,
                29963
            ],
            [
                29963,
                30064
            ],
            [
                30064,
                30136
            ],
            [
                30136,
                30176
            ],
            [
                30176,
                30346
            ],
            [
                30346,
                30410
            ],
            [
                30410,
                30602
            ],
            [
                30602,
                30856
            ],
            [
                30856,
                30948
            ],
            [
                30948,
                30990
            ],
            [
                30990,
                31182
            ],
            [
                31182,
                31464
            ],
            [
                31464,
                31617
            ],
            [
                31617,
                31874
            ],
            [
                31874,
                32118
            ],
            [
                32118,
                32303
            ],
            [
                32303,
                32515
            ],
            [
                32515,
                32877
            ],
            [
                32877,
                33185
            ],
            [
                33185,
                33339
            ],
            [
                33339,
                33402
            ],
            [
                33402,
                33875
            ],
            [
                33875,
                33936
            ],
            [
                33936,
                34031
            ]
        ],
        "overlap_chars": [
            [
                545,
                595
            ],
            [
                601,
                606
            ],
            [
                629,
                646
            ],
            [
                657,
                671
            ],
            [
                702,
                710
            ],
            [
                712,
                735
            ],
            [
                739,
                759
            ],
            [
                685,
                687
            ],
            [
                769,
                779
            ],
            [
                803,
                832
            ],
            [
                616,
                618
            ],
            [
                849,
                859
            ],
            [
                859,
                901
            ],
            [
                913,
                930
            ],
            [
                944,
                968
            ],
            [
                997,
                1009
            ],
            [
                1016,
                1022
            ],
            [
                1023,
                1069
            ],
            [
                1699,
                1750
            ],
            [
                1758,
                1767
            ],
            [
                1777,
                1787
            ],
            [
                1799,
                1805
            ],
            [
                1841,
                1851
            ],
            [
                1815,
                1825
            ],
            [
                1751,
                1757
            ],
            [
                1868,
                1877
            ],
            [
                2059,
                2081
            ],
            [
                2082,
                2086
            ],
            [
                2028,
                2030
            ],
            [
                1989,
                1990
            ],
            [
                2402,
                2406
            ],
            [
                2385,
                2386
            ],
            [
                2126,
                2133
            ],
            [
                2139,
                2194
            ],
            [
                2195,
                2239
            ],
            [
                2133,
                2134
            ],
            [
                2261,
                2265
            ],
            [
                2280,
                2292
            ],
            [
                2298,
                2313
            ],
            [
                2336,
                2339
            ],
            [
                2325,
                2335
            ],
            [
                2293,
                2297
            ],
            [
                2426,
                2471
            ],
            [
                2473,
                2493
            ],
            [
                2500,
                2555
            ],
            [
                2565,
                2615
            ],
            [
                2994,
                3094
            ],
            [
                3108,
                3111
            ],
            [
                3114,
                3122
            ],
            [
                3141,
                3157
            ],
            [
                3161,
                3192
            ],
            [
                3221,
                3287
            ],
            [
                3289,
                3348
            ],
            [
                3376,
                3389
            ],
            [
                3414,
                3472
            ],
            [
                3472,
                3521
            ],
            [
                3521,
                3555
            ],
            [
                3587,
                3651
            ],
            [
                3651,
                3653
            ],
            [
                3666,
                3701
            ],
            [
                3715,
                3753
            ],
            [
                3755,
                3791
            ],
            [
                3791,
                3793
            ],
            [
                3800,
                3802
            ],
            [
                3830,
                3834
            ],
            [
                3836,
                3862
            ],
            [
                3863,
                3898
            ],
            [
                3919,
                3937
            ],
            [
                3904,
                3906
            ],
            [
                3938,
                3964
            ],
            [
                3964,
                3993
            ],
            [
                3993,
                4010
            ],
            [
                4010,
                4093
            ],
            [
                4099,
                4105
            ],
            [
                4129,
                4131
            ],
            [
                4131,
                4183
            ],
            [
                4288,
                4332
            ],
            [
                4332,
                4361
            ],
            [
                4390,
                4395
            ],
            [
                4371,
                4383
            ],
            [
                4397,
                4400
            ],
            [
                4420,
                4453
            ],
            [
                4458,
                4465
            ],
            [
                4618,
                4688
            ],
            [
                4688,
                4729
            ],
            [
                4729,
                4763
            ],
            [
                5017,
                5063
            ],
            [
                5063,
                5076
            ],
            [
                5095,
                5107
            ],
            [
                5133,
                5177
            ],
            [
                5506,
                5529
            ],
            [
                5533,
                5551
            ],
            [
                5566,
                5724
            ],
            [
                5724,
                5797
            ],
            [
                5834,
                5878
            ],
            [
                5880,
                5909
            ],
            [
                5909,
                6007
            ],
            [
                6009,
                6023
            ],
            [
                6030,
                6033
            ],
            [
                6117,
                6154
            ],
            [
                6154,
                6180
            ],
            [
                6180,
                6237
            ],
            [
                6285,
                6363
            ],
            [
                6363,
                6389
            ],
            [
                6389,
                6420
            ],
            [
                6422,
                6435
            ],
            [
                6476,
                6507
            ],
            [
                6565,
                6567
            ],
            [
                6567,
                6592
            ],
            [
                6745,
                6779
            ],
            [
                6779,
                6816
            ],
            [
                7028,
                7070
            ],
            [
                7101,
                7190
            ],
            [
                7190,
                7221
            ],
            [
                7229,
                7238
            ],
            [
                7247,
                7320
            ],
            [
                7320,
                7361
            ],
            [
                7361,
                7377
            ],
            [
                7410,
                7412
            ],
            [
                7432,
                7452
            ],
            [
                7549,
                7589
            ],
            [
                7591,
                7633
            ],
            [
                7635,
                7668
            ],
            [
                7679,
                7700
            ],
            [
                7776,
                7858
            ],
            [
                7858,
                7989
            ],
            [
                7989,
                7993
            ],
            [
                8005,
                8007
            ],
            [
                8007,
                8092
            ],
            [
                8092,
                8093
            ],
            [
                8098,
                8101
            ],
            [
                8116,
                8170
            ],
            [
                8170,
                8226
            ],
            [
                8226,
                8267
            ],
            [
                8267,
                8279
            ],
            [
                8279,
                8305
            ],
            [
                8316,
                8336
            ],
            [
                8336,
                8403
            ],
            [
                8477,
                8547
            ],
            [
                8561,
                8572
            ],
            [
                8612,
                8614
            ],
            [
                8614,
                8632
            ],
            [
                8640,
                8651
            ],
            [
                8651,
                8776
            ],
            [
                8796,
                8957
            ],
            [
                8957,
                8982
            ],
            [
                8982,
                9061
            ],
            [
                9061,
                9123
            ],
            [
                9131,
                9167
            ],
            [
                9167,
                9168
            ],
            [
                9196,
                9206
            ],
            [
                9209,
                9220
            ],
            [
                9220,
                9223
            ],
            [
                9224,
                9231
            ],
            [
                9241,
                9254
            ],
            [
                9410,
                9411
            ],
            [
                9443,
                9462
            ],
            [
                9439,
                9442
            ],
            [
                9478,
                9480
            ],
            [
                9531,
                9563
            ],
            [
                9600,
                9638
            ],
            [
                9638,
                9674
            ],
            [
                9674,
                9710
            ],
            [
                9717,
                9749
            ],
            [
                9755,
                9766
            ],
            [
                9766,
                9792
            ],
            [
                9822,
                9867
            ],
            [
                9914,
                9963
            ],
            [
                9963,
                9981
            ],
            [
                10018,
                10099
            ],
            [
                10099,
                10166
            ],
            [
                10166,
                10192
            ],
            [
                10192,
                10236
            ],
            [
                10270,
                10272
            ],
            [
                10272,
                10276
            ],
            [
                10307,
                10406
            ],
            [
                10427,
                10444
            ],
            [
                10444,
                10486
            ],
            [
                10499,
                10508
            ],
            [
                10519,
                10548
            ],
            [
                10548,
                10581
            ],
            [
                10611,
                10642
            ],
            [
                10642,
                10646
            ],
            [
                10664,
                10665
            ],
            [
                10671,
                10672
            ],
            [
                10677,
                10713
            ],
            [
                10726,
                10743
            ],
            [
                10743,
                10773
            ],
            [
                10785,
                10800
            ],
            [
                10810,
                10833
            ],
            [
                10870,
                10898
            ],
            [
                10910,
                10916
            ],
            [
                10906,
                10909
            ],
            [
                10917,
                10924
            ],
            [
                10948,
                11028
            ],
            [
                11030,
                11082
            ],
            [
                11152,
                11175
            ],
            [
                11175,
                11182
            ],
            [
                11182,
                11233
            ],
            [
                11233,
                11291
            ],
            [
                11305,
                11317
            ],
            [
                11317,
                11347
            ],
            [
                11356,
                11405
            ],
            [
                11422,
                11432
            ],
            [
                11453,
                11479
            ],
            [
                11479,
                11510
            ],
            [
                11510,
                11588
            ],
            [
                11588,
                11632
            ],
            [
                11702,
                11813
            ],
            [
                11815,
                11886
            ],
            [
                11886,
                11918
            ],
            [
                11931,
                11934
            ],
            [
                11923,
                11927
            ],
            [
                11941,
                11984
            ],
            [
                11995,
                12026
            ],
            [
                12081,
                12134
            ],
            [
                12157,
                12189
            ],
            [
                12189,
                12237
            ],
            [
                12348,
                12378
            ],
            [
                12386,
                12411
            ],
            [
                12424,
                12488
            ],
            [
                12488,
                12501
            ],
            [
                12547,
                12566
            ],
            [
                12566,
                12612
            ],
            [
                12643,
                12658
            ],
            [
                12658,
                12684
            ],
            [
                12705,
                12707
            ],
            [
                12708,
                12715
            ],
            [
                12722,
                12724
            ],
            [
                12724,
                12737
            ],
            [
                12748,
                12794
            ],
            [
                12796,
                12799
            ],
            [
                12820,
                12842
            ],
            [
                12848,
                12860
            ],
            [
                13008,
                13012
            ],
            [
                13249,
                13286
            ],
            [
                13288,
                13289
            ],
            [
                13293,
                13313
            ],
            [
                13316,
                13468
            ],
            [
                13468,
                13481
            ],
            [
                13512,
                13523
            ],
            [
                13532,
                13536
            ],
            [
                13558,
                13560
            ],
            [
                13568,
                13584
            ],
            [
                13590,
                13618
            ],
            [
                13698,
                13750
            ],
            [
                14020,
                14052
            ],
            [
                14084,
                14090
            ],
            [
                14158,
                14174
            ],
            [
                14205,
                14207
            ],
            [
                14207,
                14221
            ],
            [
                14226,
                14309
            ],
            [
                14333,
                14335
            ],
            [
                14376,
                14394
            ],
            [
                14365,
                14374
            ],
            [
                14335,
                14338
            ],
            [
                14465,
                14479
            ],
            [
                14480,
                14549
            ],
            [
                14584,
                14586
            ],
            [
                14605,
                14618
            ],
            [
                14630,
                14632
            ],
            [
                14635,
                14648
            ],
            [
                14652,
                14670
            ],
            [
                14674,
                14678
            ],
            [
                14691,
                14706
            ],
            [
                14715,
                14724
            ],
            [
                14707,
                14711
            ],
            [
                14788,
                14792
            ],
            [
                14815,
                14817
            ],
            [
                14817,
                14860
            ],
            [
                14860,
                14877
            ],
            [
                14877,
                14925
            ],
            [
                14925,
                14942
            ],
            [
                14945,
                14948
            ],
            [
                14948,
                14971
            ],
            [
                14994,
                15004
            ],
            [
                15009,
                15016
            ],
            [
                15016,
                15020
            ],
            [
                15066,
                15067
            ],
            [
                15137,
                15141
            ],
            [
                15153,
                15155
            ],
            [
                15155,
                15167
            ],
            [
                15167,
                15293
            ],
            [
                15363,
                15381
            ],
            [
                15387,
                15441
            ],
            [
                15511,
                15522
            ],
            [
                15536,
                15540
            ],
            [
                15531,
                15535
            ],
            [
                15550,
                15570
            ],
            [
                15570,
                15592
            ],
            [
                15592,
                15595
            ],
            [
                15596,
                15652
            ],
            [
                15687,
                15688
            ],
            [
                15660,
                15676
            ],
            [
                15716,
                15718
            ],
            [
                15757,
                15760
            ],
            [
                15775,
                15779
            ],
            [
                15779,
                15803
            ],
            [
                15803,
                15934
            ],
            [
                15934,
                16006
            ],
            [
                16143,
                16145
            ],
            [
                16145,
                16204
            ],
            [
                16231,
                16233
            ],
            [
                16234,
                16290
            ],
            [
                16290,
                16298
            ],
            [
                16330,
                16379
            ],
            [
                16379,
                16409
            ],
            [
                16409,
                16448
            ],
            [
                16448,
                16488
            ],
            [
                16525,
                16528
            ],
            [
                16528,
                16556
            ],
            [
                16556,
                16584
            ],
            [
                16584,
                16634
            ],
            [
                16634,
                16712
            ],
            [
                16712,
                16740
            ],
            [
                16740,
                16819
            ],
            [
                16819,
                16829
            ],
            [
                16829,
                16867
            ],
            [
                16955,
                16975
            ],
            [
                17006,
                17016
            ],
            [
                17042,
                17110
            ],
            [
                17154,
                17222
            ],
            [
                17296,
                17298
            ],
            [
                17298,
                17346
            ],
            [
                17346,
                17393
            ],
            [
                17393,
                17429
            ],
            [
                17672,
                17745
            ],
            [
                17753,
                17764
            ],
            [
                17806,
                17807
            ],
            [
                17852,
                17860
            ],
            [
                17867,
                17900
            ],
            [
                17918,
                17928
            ],
            [
                17934,
                17960
            ],
            [
                18007,
                18009
            ],
            [
                18009,
                18036
            ],
            [
                18077,
                18211
            ],
            [
                18211,
                18218
            ],
            [
                18231,
                18242
            ],
            [
                18244,
                18259
            ],
            [
                18261,
                18285
            ],
            [
                18285,
                18342
            ],
            [
                18550,
                18574
            ],
            [
                18589,
                18590
            ],
            [
                18651,
                18712
            ],
            [
                18712,
                18749
            ],
            [
                18749,
                18758
            ],
            [
                18779,
                18781
            ],
            [
                18781,
                18828
            ],
            [
                18834,
                18854
            ],
            [
                19127,
                19198
            ],
            [
                19198,
                19260
            ],
            [
                19314,
                19330
            ],
            [
                19306,
                19308
            ],
            [
                19261,
                19263
            ],
            [
                19269,
                19284
            ],
            [
                19286,
                19305
            ],
            [
                19409,
                19433
            ],
            [
                19443,
                19459
            ],
            [
                19465,
                19477
            ],
            [
                19482,
                19501
            ],
            [
                19518,
                19535
            ],
            [
                19537,
                19674
            ],
            [
                19674,
                19713
            ],
            [
                19811,
                19813
            ],
            [
                20090,
                20101
            ],
            [
                19858,
                19927
            ],
            [
                20088,
                20089
            ],
            [
                19929,
                19938
            ],
            [
                19959,
                19979
            ],
            [
                19938,
                19939
            ],
            [
                19980,
                19983
            ],
            [
                19997,
                20034
            ],
            [
                19841,
                19857
            ],
            [
                20137,
                20146
            ],
            [
                20162,
                20163
            ],
            [
                20164,
                20174
            ],
            [
                20258,
                20264
            ],
            [
                20273,
                20288
            ],
            [
                20307,
                20314
            ],
            [
                20342,
                20347
            ],
            [
                20347,
                20360
            ],
            [
                20365,
                20415
            ],
            [
                20561,
                20662
            ],
            [
                20704,
                20706
            ],
            [
                20706,
                20771
            ],
            [
                20848,
                20850
            ],
            [
                20850,
                20868
            ],
            [
                20981,
                20991
            ],
            [
                20869,
                20892
            ],
            [
                20997,
                20998
            ],
            [
                21208,
                21247
            ],
            [
                21293,
                21310
            ],
            [
                21332,
                21345
            ],
            [
                21375,
                21380
            ],
            [
                21380,
                21454
            ],
            [
                21493,
                21494
            ],
            [
                21489,
                21493
            ],
            [
                21656,
                21658
            ],
            [
                21810,
                21837
            ],
            [
                21774,
                21787
            ],
            [
                21837,
                21839
            ],
            [
                22131,
                22132
            ],
            [
                21839,
                21885
            ],
            [
                21914,
                21983
            ],
            [
                22023,
                22077
            ],
            [
                22079,
                22098
            ],
            [
                22102,
                22119
            ],
            [
                22202,
                22278
            ],
            [
                22347,
                22349
            ],
            [
                22349,
                22428
            ],
            [
                22469,
                22536
            ],
            [
                22597,
                22688
            ],
            [
                22690,
                22693
            ],
            [
                22696,
                22767
            ],
            [
                22767,
                22790
            ],
            [
                22795,
                22846
            ],
            [
                22846,
                22868
            ],
            [
                22868,
                22906
            ],
            [
                22906,
                22912
            ],
            [
                22912,
                22937
            ],
            [
                22937,
                22954
            ],
            [
                22954,
                22986
            ],
            [
                22986,
                23032
            ],
            [
                23071,
                23114
            ],
            [
                23155,
                23196
            ],
            [
                23228,
                23232
            ],
            [
                23232,
                23276
            ],
            [
                23120,
                23123
            ],
            [
                23307,
                23308
            ],
            [
                23568,
                23629
            ],
            [
                23639,
                23664
            ],
            [
                23691,
                23698
            ],
            [
                23703,
                23739
            ],
            [
                23750,
                23755
            ],
            [
                23818,
                23820
            ],
            [
                24067,
                24071
            ],
            [
                24082,
                24093
            ],
            [
                24105,
                24183
            ],
            [
                24236,
                24239
            ],
            [
                24253,
                24313
            ],
            [
                24369,
                24423
            ],
            [
                24472,
                24483
            ],
            [
                24485,
                24486
            ],
            [
                24492,
                24590
            ],
            [
                24590,
                24715
            ],
            [
                24715,
                24747
            ],
            [
                24786,
                24826
            ],
            [
                24873,
                24887
            ],
            [
                24892,
                24894
            ],
            [
                24894,
                24989
            ],
            [
                25000,
                25002
            ],
            [
                25002,
                25079
            ],
            [
                25079,
                25123
            ],
            [
                25132,
                25169
            ],
            [
                25169,
                25253
            ],
            [
                25253,
                25283
            ],
            [
                25283,
                25304
            ],
            [
                25345,
                25403
            ],
            [
                25403,
                25435
            ],
            [
                25435,
                25523
            ],
            [
                25523,
                25544
            ],
            [
                25544,
                25576
            ],
            [
                25576,
                25586
            ],
            [
                25586,
                25641
            ],
            [
                25642,
                25721
            ],
            [
                25721,
                25742
            ],
            [
                25742,
                25755
            ],
            [
                25755,
                25831
            ],
            [
                25831,
                25936
            ],
            [
                25973,
                25975
            ],
            [
                25975,
                25979
            ],
            [
                25981,
                25984
            ],
            [
                25986,
                26037
            ],
            [
                26037,
                26045
            ],
            [
                26066,
                26068
            ],
            [
                26068,
                26086
            ],
            [
                26094,
                26097
            ],
            [
                26097,
                26149
            ],
            [
                26444,
                26530
            ],
            [
                26530,
                26531
            ],
            [
                26630,
                26655
            ],
            [
                26695,
                26700
            ],
            [
                26720,
                26737
            ],
            [
                26679,
                26680
            ],
            [
                26768,
                26791
            ],
            [
                26756,
                26757
            ],
            [
                26795,
                26804
            ],
            [
                26861,
                26867
            ],
            [
                26884,
                26891
            ],
            [
                26892,
                26923
            ],
            [
                26989,
                27020
            ],
            [
                26859,
                26860
            ],
            [
                27109,
                27111
            ],
            [
                27139,
                27169
            ],
            [
                27184,
                27206
            ],
            [
                27269,
                27284
            ],
            [
                27297,
                27300
            ],
            [
                27300,
                27340
            ],
            [
                27340,
                27417
            ],
            [
                27418,
                27457
            ],
            [
                27481,
                27490
            ],
            [
                27498,
                27499
            ],
            [
                27832,
                27858
            ],
            [
                27858,
                27880
            ],
            [
                27886,
                27889
            ],
            [
                27922,
                27926
            ],
            [
                27952,
                27966
            ],
            [
                27915,
                27918
            ],
            [
                27967,
                27973
            ],
            [
                27984,
                27989
            ],
            [
                28004,
                28039
            ],
            [
                28039,
                28104
            ],
            [
                28104,
                28105
            ],
            [
                28116,
                28163
            ],
            [
                28179,
                28206
            ],
            [
                28114,
                28115
            ],
            [
                28256,
                28259
            ],
            [
                28265,
                28270
            ],
            [
                28310,
                28313
            ],
            [
                28313,
                28339
            ],
            [
                28352,
                28354
            ],
            [
                28413,
                28437
            ],
            [
                28437,
                28544
            ],
            [
                28544,
                28683
            ],
            [
                28683,
                28711
            ],
            [
                28711,
                28743
            ],
            [
                28800,
                28869
            ],
            [
                28879,
                28902
            ],
            [
                28902,
                28929
            ],
            [
                28929,
                28973
            ],
            [
                28973,
                29022
            ],
            [
                29022,
                29061
            ],
            [
                29061,
                29134
            ],
            [
                29134,
                29174
            ],
            [
                29211,
                29260
            ],
            [
                29271,
                29274
            ],
            [
                29274,
                29357
            ],
            [
                29357,
                29372
            ],
            [
                29383,
                29410
            ],
            [
                29432,
                29452
            ],
            [
                29474,
                29476
            ],
            [
                29476,
                29500
            ],
            [
                29500,
                29530
            ],
            [
                29530,
                29537
            ],
            [
                29539,
                29587
            ],
            [
                29591,
                29656
            ],
            [
                29733,
                29763
            ],
            [
                29763,
                29769
            ],
            [
                29792,
                29798
            ],
            [
                29852,
                29853
            ],
            [
                29861,
                29917
            ],
            [
                29963,
                30023
            ],
            [
                30062,
                30064
            ],
            [
                30064,
                30071
            ],
            [
                30093,
                30097
            ],
            [
                30116,
                30136
            ],
            [
                30136,
                30176
            ],
            [
                30176,
                30196
            ],
            [
                30212,
                30227
            ],
            [
                30243,
                30245
            ],
            [
                30260,
                30346
            ],
            [
                30346,
                30399
            ],
            [
                30408,
                30410
            ],
            [
                30410,
                30412
            ],
            [
                30429,
                30434
            ],
            [
                30417,
                30420
            ],
            [
                30441,
                30532
            ],
            [
                30538,
                30541
            ],
            [
                30561,
                30602
            ],
            [
                30602,
                30605
            ],
            [
                30652,
                30716
            ],
            [
                30854,
                30856
            ],
            [
                30948,
                30989
            ],
            [
                30936,
                30939
            ],
            [
                30946,
                30947
            ],
            [
                30990,
                30999
            ],
            [
                31000,
                31058
            ],
            [
                31091,
                31105
            ],
            [
                31132,
                31135
            ],
            [
                31140,
                31160
            ],
            [
                31074,
                31076
            ],
            [
                31161,
                31182
            ],
            [
                31617,
                31647
            ],
            [
                31658,
                31680
            ],
            [
                31760,
                31761
            ],
            [
                31737,
                31739
            ],
            [
                31693,
                31718
            ],
            [
                31719,
                31725
            ],
            [
                31680,
                31681
            ],
            [
                31726,
                31730
            ],
            [
                31762,
                31765
            ],
            [
                31808,
                31814
            ],
            [
                31821,
                31825
            ],
            [
                31843,
                31845
            ],
            [
                31682,
                31692
            ],
            [
                31862,
                31873
            ],
            [
                32009,
                32027
            ],
            [
                32063,
                32118
            ],
            [
                32303,
                32340
            ],
            [
                32429,
                32434
            ],
            [
                32424,
                32428
            ],
            [
                32448,
                32515
            ],
            [
                32515,
                32546
            ],
            [
                32559,
                32599
            ],
            [
                32619,
                32624
            ],
            [
                32779,
                32794
            ],
            [
                32922,
                32925
            ],
            [
                32796,
                32800
            ],
            [
                32812,
                32875
            ],
            [
                32717,
                32718
            ],
            [
                32653,
                32656
            ],
            [
                33183,
                33185
            ],
            [
                33185,
                33192
            ],
            [
                33229,
                33236
            ],
            [
                33209,
                33216
            ],
            [
                33244,
                33283
            ],
            [
                33311,
                33339
            ],
            [
                33339,
                33402
            ],
            [
                33402,
                33465
            ],
            [
                33475,
                33526
            ],
            [
                33793,
                33796
            ],
            [
                33527,
                33599
            ],
            [
                33873,
                33875
            ],
            [
                33875,
                33936
            ],
            [
                33936,
                33966
            ],
            [
                33986,
                34031
            ]
        ],
        "row_chars": [
            [
                0,
                50
            ],
            [
                50,
                72
            ],
            [
                72,
                166
            ],
            [
                166,
                181
            ],
            [
                181,
                201
            ],
            [
                201,
                241
            ],
            [
                241,
                306
            ],
            [
                306,
                465
            ],
            [
                465,
                476
            ],
            [
                476,
                508
            ],
            [
                508,
                545
            ],
            [
                545,
                859
            ],
            [
                859,
                1069
            ],
            [
                1069,
                1378
            ],
            [
                1378,
                1699
            ],
            [
                1699,
                2091
            ],
            [
                2091,
                2616
            ],
            [
                2616,
                2994
            ],
            [
                2994,
                3157
            ],
            [
                3157,
                3348
            ],
            [
                3348,
                3376
            ],
            [
                3376,
                3472
            ],
            [
                3472,
                3521
            ],
            [
                3521,
                3651
            ],
            [
                3651,
                3791
            ],
            [
                3791,
                3863
            ],
            [
                3863,
                3964
            ],
            [
                3964,
                3993
            ],
            [
                3993,
                4010
            ],
            [
                4010,
                4131
            ],
            [
                4131,
                4183
            ],
            [
                4183,
                4203
            ],
            [
                4203,
                4288
            ],
            [
                4288,
                4332
            ],
            [
                4332,
                4468
            ],
            [
                4468,
                4688
            ],
            [
                4688,
                4729
            ],
            [
                4729,
                4765
            ],
            [
                4765,
                4892
            ],
            [
                4892,
                5017
            ],
            [
                5017,
                5063
            ],
            [
                5063,
                5269
            ],
            [
                5269,
                5350
            ],
            [
                5350,
                5391
            ],
            [
                5391,
                5472
            ],
            [
                5472,
                5506
            ],
            [
                5506,
                5724
            ],
            [
                5724,
                5799
            ],
            [
                5799,
                5834
            ],
            [
                5834,
                5909
            ],
            [
                5909,
                6076
            ],
            [
                6076,
                6117
            ],
            [
                6117,
                6154
            ],
            [
                6154,
                6180
            ],
            [
                6180,
                6237
            ],
            [
                6237,
                6285
            ],
            [
                6285,
                6363
            ],
            [
                6363,
                6389
            ],
            [
                6389,
                6435
            ],
            [
                6435,
                6476
            ],
            [
                6476,
                6567
            ],
            [
                6567,
                6595
            ],
            [
                6595,
                6744
            ],
            [
                6744,
                6779
            ],
            [
                6779,
                6925
            ],
            [
                6925,
                7028
            ],
            [
                7028,
                7072
            ],
            [
                7072,
                7101
            ],
            [
                7101,
                7190
            ],
            [
                7190,
                7320
            ],
            [
                7320,
                7361
            ],
            [
                7361,
                7452
            ],
            [
                7452,
                7549
            ],
            [
                7549,
                7700
            ],
            [
                7700,
                7776
            ],
            [
                7776,
                7858
            ],
            [
                7858,
                7989
            ],
            [
                7989,
                8007
            ],
            [
                8007,
                8092
            ],
            [
                8092,
                8170
            ],
            [
                8170,
                8226
            ],
            [
                8226,
                8267
            ],
            [
                8267,
                8279
            ],
            [
                8279,
                8336
            ],
            [
                8336,
                8404
            ],
            [
                8404,
                8477
            ],
            [
                8477,
                8614
            ],
            [
                8614,
                8651
            ],
            [
                8651,
                8776
            ],
            [
                8776,
                8796
            ],
            [
                8796,
                8957
            ],
            [
                8957,
                8982
            ],
            [
                8982,
                9061
            ],
            [
                9061,
                9167
            ],
            [
                9167,
                9220
            ],
            [
                9220,
                9480
            ],
            [
                9480,
                9526
            ],
            [
                9526,
                9565
            ],
            [
                9565,
                9600
            ],
            [
                9600,
                9638
            ],
            [
                9638,
                9674
            ],
            [
                9674,
                9710
            ],
            [
                9710,
                9717
            ],
            [
                9717,
                9766
            ],
            [
                9766,
                9867
            ],
            [
                9867,
                9910
            ],
            [
                9910,
                9963
            ],
            [
                9963,
                9983
            ],
            [
                9983,
                10018
            ],
            [
                10018,
                10099
            ],
            [
                10099,
                10166
            ],
            [
                10166,
                10192
            ],
            [
                10192,
                10272
            ],
            [
                10272,
                10444
            ],
            [
                10444,
                10508
            ],
            [
                10508,
                10548
            ],
            [
                10548,
                10642
            ],
            [
                10642,
                10743
            ],
            [
                10743,
                11030
            ],
            [
                11030,
                11175
            ],
            [
                11175,
                11182
            ],
            [
                11182,
                11233
            ],
            [
                11233,
                11317
            ],
            [
                11317,
                11405
            ],
            [
                11405,
                11479
            ],
            [
                11479,
                11510
            ],
            [
                11510,
                11588
            ],
            [
                11588,
                11886
            ],
            [
                11886,
                12189
            ],
            [
                12189,
                12237
            ],
            [
                12237,
                12344
            ],
            [
                12344,
                12488
            ],
            [
                12488,
                12501
            ],
            [
                12501,
                12566
            ],
            [
                12566,
                12658
            ],
            [
                12658,
                12724
            ],
            [
                12724,
                12860
            ],
            [
                12860,
                13008
            ],
            [
                13008,
                13288
            ],
            [
                13288,
                13468
            ],
            [
                13468,
                13560
            ],
            [
                13560,
                13618
            ],
            [
                13618,
                13657
            ],
            [
                13657,
                13698
            ],
            [
                13698,
                13752
            ],
            [
                13752,
                13921
            ],
            [
                13921,
                14020
            ],
            [
                14020,
                14207
            ],
            [
                14207,
                14335
            ],
            [
                14335,
                14586
            ],
            [
                14586,
                14817
            ],
            [
                14817,
                14860
            ],
            [
                14860,
                14877
            ],
            [
                14877,
                14925
            ],
            [
                14925,
                14948
            ],
            [
                14948,
                15016
            ],
            [
                15016,
                15155
            ],
            [
                15155,
                15167
            ],
            [
                15167,
                15293
            ],
            [
                15293,
                15363
            ],
            [
                15363,
                15441
            ],
            [
                15441,
                15490
            ],
            [
                15490,
                15511
            ],
            [
                15511,
                15570
            ],
            [
                15570,
                15592
            ],
            [
                15592,
                15718
            ],
            [
                15718,
                15757
            ],
            [
                15757,
                15779
            ],
            [
                15779,
                15803
            ],
            [
                15803,
                15934
            ],
            [
                15934,
                16145
            ],
            [
                16145,
                16233
            ],
            [
                16233,
                16290
            ],
            [
                16290,
                16379
            ],
            [
                16379,
                16409
            ],
            [
                16409,
                16448
            ],
            [
                16448,
                16528
            ],
            [
                16528,
                16556
            ],
            [
                16556,
                16584
            ],
            [
                16584,
                16634
            ],
            [
                16634,
                16712
            ],
            [
                16712,
                16740
            ],
            [
                16740,
                16819
            ],
            [
                16819,
                16829
            ],
            [
                16829,
                16867
            ],
            [
                16867,
                16916
            ],
            [
                16916,
                16951
            ],
            [
                16951,
                17111
            ],
            [
                17111,
                17154
            ],
            [
                17154,
                17298
            ],
            [
                17298,
                17346
            ],
            [
                17346,
                17393
            ],
            [
                17393,
                17514
            ],
            [
                17514,
                17605
            ],
            [
                17605,
                17635
            ],
            [
                17635,
                17672
            ],
            [
                17672,
                17808
            ],
            [
                17808,
                17852
            ],
            [
                17852,
                18009
            ],
            [
                18009,
                18036
            ],
            [
                18036,
                18077
            ],
            [
                18077,
                18211
            ],
            [
                18211,
                18285
            ],
            [
                18285,
                18343
            ],
            [
                18343,
                18380
            ],
            [
                18380,
                18416
            ],
            [
                18416,
                18484
            ],
            [
                18484,
                18550
            ],
            [
                18550,
                18712
            ],
            [
                18712,
                18749
            ],
            [
                18749,
                18781
            ],
            [
                18781,
                18854
            ],
            [
                18854,
                18948
            ],
            [
                18948,
                19032
            ],
            [
                19032,
                19127
            ],
            [
                19127,
                19198
            ],
            [
                19198,
                19369
            ],
            [
                19369,
                19409
            ],
            [
                19409,
                19674
            ],
            [
                19674,
                19813
            ],
            [
                19813,
                20164
            ],
            [
                20164,
                20415
            ],
            [
                20415,
                20561
            ],
            [
                20561,
                20706
            ],
            [
                20706,
                20850
            ],
            [
                20850,
                20999
            ],
            [
                20999,
                21208
            ],
            [
                21208,
                21380
            ],
            [
                21380,
                21658
            ],
            [
                21658,
                21839
            ],
            [
                21839,
                22202
            ],
            [
                22202,
                22349
            ],
            [
                22349,
                22429
            ],
            [
                22429,
                22469
            ],
            [
                22469,
                22597
            ],
            [
                22597,
                22767
            ],
            [
                22767,
                22846
            ],
            [
                22846,
                22868
            ],
            [
                22868,
                22906
            ],
            [
                22906,
                22912
            ],
            [
                22912,
                22937
            ],
            [
                22937,
                22954
            ],
            [
                22954,
                22986
            ],
            [
                22986,
                23309
            ],
            [
                23309,
                23568
            ],
            [
                23568,
                23820
            ],
            [
                23820,
                23980
            ],
            [
                23980,
                24183
            ],
            [
                24183,
                24236
            ],
            [
                24236,
                24423
            ],
            [
                24423,
                24485
            ],
            [
                24485,
                24590
            ],
            [
                24590,
                24715
            ],
            [
                24715,
                24749
            ],
            [
                24749,
                24786
            ],
            [
                24786,
                24894
            ],
            [
                24894,
                25002
            ],
            [
                25002,
                25079
            ],
            [
                25079,
                25169
            ],
            [
                25169,
                25253
            ],
            [
                25253,
                25283
            ],
            [
                25283,
                25403
            ],
            [
                25403,
                25435
            ],
            [
                25435,
                25523
            ],
            [
                25523,
                25544
            ],
            [
                25544,
                25576
            ],
            [
                25576,
                25586
            ],
            [
                25586,
                25642
            ],
            [
                25642,
                25721
            ],
            [
                25721,
                25742
            ],
            [
                25742,
                25755
            ],
            [
                25755,
                25831
            ],
            [
                25831,
                25975
            ],
            [
                25975,
                26037
            ],
            [
                26037,
                26068
            ],
            [
                26068,
                26097
            ],
            [
                26097,
                26149
            ],
            [
                26149,
                26189
            ],
            [
                26189,
                26270
            ],
            [
                26270,
                26353
            ],
            [
                26353,
                26444
            ],
            [
                26444,
                26532
            ],
            [
                26532,
                26630
            ],
            [
                26630,
                27023
            ],
            [
                27023,
                27029
            ],
            [
                27029,
                27067
            ],
            [
                27067,
                27097
            ],
            [
                27097,
                27109
            ],
            [
                27109,
                27300
            ],
            [
                27300,
                27340
            ],
            [
                27340,
                27418
            ],
            [
                27418,
                27500
            ],
            [
                27500,
                27607
            ],
            [
                27607,
                27635
            ],
            [
                27635,
                27726
            ],
            [
                27726,
                27776
            ],
            [
                27776,
                27832
            ],
            [
                27832,
                27858
            ],
            [
                27858,
                27976
            ],
            [
                27976,
                28039
            ],
            [
                28039,
                28104
            ],
            [
                28104,
                28313
            ],
            [
                28313,
                28354
            ],
            [
                28354,
                28413
            ],
            [
                28413,
                28437
            ],
            [
                28437,
                28544
            ],
            [
                28544,
                28683
            ],
            [
                28683,
                28711
            ],
            [
                28711,
                28744
            ],
            [
                28744,
                28800
            ],
            [
                28800,
                28902
            ],
            [
                28902,
                28929
            ],
            [
                28929,
                28973
            ],
            [
                28973,
                29022
            ],
            [
                29022,
                29061
            ],
            [
                29061,
                29134
            ],
            [
                29134,
                29274
            ],
            [
                29274,
                29357
            ],
            [
                29357,
                29410
            ],
            [
                29410,
                29476
            ],
            [
                29476,
                29500
            ],
            [
                29500,
                29530
            ],
            [
                29530,
                29763
            ],
            [
                29763,
                29800
            ],
            [
                29800,
                29852
            ],
            [
                29852,
                29917
            ],
            [
                29917,
                29963
            ],
            [
                29963,
                30064
            ],
            [
                30064,
                30136
            ],
            [
                30136,
                30176
            ],
            [
                30176,
                30346
            ],
            [
                30346,
                30410
            ],
            [
                30410,
                30602
            ],
            [
                30602,
                30856
            ],
            [
                30856,
                30990
            ],
            [
                30990,
                31182
            ],
            [
                31182,
                31464
            ],
            [
                31464,
                31617
            ],
            [
                31617,
                31874
            ],
            [
                31874,
                32118
            ],
            [
                32118,
                32303
            ],
            [
                32303,
                32515
            ],
            [
                32515,
                33185
            ],
            [
                33185,
                33339
            ],
            [
                33339,
                33402
            ],
            [
                33402,
                33875
            ],
            [
                33875,
                33936
            ],
            [
                33936,
                34031
            ]
        ]
    },
    "abridged": {
        "text": "In spite of Deronda's reasons for wishing to be in London again - anxiety for Mirah, combined with curiosity about Mordecai - he did not manage to go there before Sir Hugo, who went ahead of his family for the opening of Parliament in February. Deronda took up his quarters in Park Lane, since his chambers were tenanted by Hans Meyrick - but he found things there not altogether according to his expectations.\nIt is a peculiar test of a man's mettle when, after painfully adjusting himself to a wise precaution, he finds he has missed the mark, so that quite a different call is made upon him to that which he expected.\nOn visiting Hans, Deronda's first impression was one of pure pleasure and amusement, at finding his sitting-room transformed into a studio. It was strewn with drawings and the contents of the trunks from Rome, with Hans as the presiding genius of the littered place - his hair longer than before, his face more whimsically creased, and his high voice getting higher under the excitement of rapid talk.\n\"I knew you would like to see my casts and antiquities,\" said Hans, after the first hearty greetings, \"but I didn't unload my chests here. I've found two rooms at Chelsea close to my mother and sisters, and I shall soon be ready to hang out there - when they've scraped the walls and put in some new lights. But you see I've already begun working: you can't conceive what a great fellow I'm going to be. The seed of immortality has sprouted within me.\"\n\"Only a fungoid growth, I dare say,\" said Deronda, accustomed to treat Hans in brotherly fashion. He walked toward some drawings propped on the bookcases; five rapidly-sketched heads - different aspects of the same face. He looked at them without making any remark.\nHans, too, was silent for a minute, and began touching up the picture on his easel.\n\"What do you think of them?\" he said at last.\n\"The full face looks too massive; otherwise the likenesses are good,\" said Deronda, somewhat coldly.\n\"No, it is not too massive,\" said Hans, decisively. \"But I shall enlarge her scale for Berenice. I am making a Berenice series - there are the sketches - and you are just the model I want for Agrippa. No, I forgot; you don't like sitting for your portrait, confound you! However, I've picked up a capital Titus. There are to be five in the series.\"\n\"Agrippa's legs will never do,\" said Deronda.\n\"The legs are realistic,\" said Hans; \"public men are often shaky about the legs. But never mind the legs: the third sketch is Berenice exulting in the prospects of being Empress of Rome, when the news has come that Vespasian is declared Emperor and her lover Titus his successor.\"\n\"You must put a scroll in her mouth, else people will not understand that.\"\n\"It will make them feel their ignorance then - an excellent sthetic effect. The fourth is, Titus sending Berenice away from Rome after she has shared his palace for ten years - both reluctant and sad.\"\n\"Shall you make Berenice look fifty? She must have been that.\"\n\"No, no; a few mature touches to show the lapse of time. But now, here is the fifth: Berenice seated lonely on the ruins of Jerusalem. That is pure imagination. That is what ought to have been - perhaps was. Nobody knows what became of her. There is no sixth picture. I break off in the Homeric style. The story is chipped off, so to speak. But now come and look at this on the easel.\"\n\"That beseeching attitude is really good,\" said Deronda, after a moment's contemplation. \"You have been very industrious over Christmas; for I suppose you have taken up the subject since you came to London.\" Neither of them had yet mentioned Mirah.\n\"No,\" said Hans, \"I decided on the subject before. I saw a splendid woman in the Trastevere - the grandest women there are half Jewesses - and she set me hunting for a fine subject of a Jewess at Rome. I'll show you a sketch of the Trasteverina's head when I can lay my hands on it.\"\n\"I should think she would be a more suitable model for Berenice,\" said Deronda, not knowing exactly how to express his discontent.\n\"Not at all. The model ought to be the most beautiful Jewess in the world, and I have found her.\"\n\"Are you sure that she would like to figure in that character? I should think no woman would be more abhorrent to her. Does she quite know what you are doing?\"\n\"Certainly. I got her to throw herself into this attitude. Little mother sat for Gessius Florus, and Mirah clasped her knees.\"\n\"I dare say she knows nothing about Berenice's history,\" said Deronda, with some indignation.\n\"Oh, yes, she does - ladies' edition. Berenice was a fervid patriot, but was beguiled by love and ambition into attaching herself to the arch-enemy of her people. Mirah takes it as a tragic parable, and cries to think what the penitent Berenice suffered as she wandered back to Jerusalem and sat desolate amidst desolation. That was her own phrase. I couldn't find it in my heart to tell her I invented that part of the story.\"\n\"Show me your Trasteverina,\" said Deronda, chiefly in order to stop himself from saying something else.\n\"Look in that folio,\" said Hans. \"My portrait studies are all there, Cambridge heads and others all mixed up. You'll find her about the middle.\"\n\"Is this one of your undergraduates?\" said Deronda, holding up a drawing. \"It's an unusually agreeable face.\"\n\"Oh, that's a man named Gascoigne - Rex Gascoigne. An uncommonly good fellow; I coached him before he got his scholarship. He was ill, and has had to stay up another year. I must look him up.\"\n\"Here she is, I suppose,\" said Deronda, holding up a sketch of the Trasteverina.\n\"Ah,\" said Hans, looking at it rather contemptuously, \"too coarse. I was unregenerate then.\"\nDeronda was silent while he closed the folio. Then turning toward Hans, he said, \"I dare say my scruples are excessive, Meyrick, but I must ask you to give up this notion.\"\nHans threw himself into a tragic attitude, screaming, \"What! my immortal Berenice series? Think of what you are saying, man - destroying not a life but an immortality. Wait, while I deposit the implements of my art and uproot my hair.\"\nHere Hans laid down his pencil, threw himself into a great chair, and shaking his long hair over his face, hooked his fingers onto it and looked up with comic terror at Deronda, who was obliged to smile, as he said-\n\"Paint as many Berenices as you like, but I wish you would choose another model.\"\n\"Why?\" said Hans, standing up, and looking serious again.\n\"Because she may get into such a position that her face is recognized. Mrs. Meyrick and I are anxious that she should be known as an admirable singer. She wishes to make herself independent. And she has excellent chances. One good introduction is secured already, and I am going to speak to Klesmer. Her face may come to be very well known, and I believe that if Mirah saw the circumstances clearly, she would strongly object to being exhibited in this way - to allowing herself to be used as a model for a heroine of this sort.\"\nAs Hans stood with his thumbs in his belt, listening to this speech, his face showed surprise melting into amusement: but seeing that Deronda looked gravely offended, he said, \"Excuse my laughing, Deronda. You never gave me an advantage over you before. So you actually believe that I could get my five pictures hung in a conspicuous position, and carefully studied by the public? Zounds, man! what a beautiful dream. My pictures are likely to remain as private as you could desire.\"\nHans turned to paint again to fill up the awkward pause. Deronda stood still, recognizing his mistake as to publicity; but his repugnance was not diminished. Hans presently went on, painting the while-\n\"Even supposing I had the public rushing after my pictures as if they were a railway series including nurses, babies and bonnet-boxes, I can't see any justice in your objection. Every painter paints the face he admires most. Part of his soul goes out into his pictures. He puts what he adores into some sacred, heroic form.\"\n\"Every objection can be answered by generalising, Hans,\" said Deronda, impatiently. \"I might admit your generalities, and yet be right in saying you ought not to publish Mirah's face. I was unreasonable about publicity; but there might be other good reasons for your not indulging yourself too much in painting her. Her situation is very delicate; and until she is more independent, she should be carefully kept safe. Are you quite sure of your own discretion? Excuse me, Hans. My having found her binds me to watch over her. Do you understand?\"\n\"Perfectly,\" said Hans, putting on a good-humoured smile. \"You think I shall get into a scrape. Quite fair. Since I got into the scrape of being born, everything I have liked best has been a scrape either for myself or somebody else. My painting is the latest scrape; and I shall be all my life getting out of it. You think I am head over heels in love with Mirah. Quite right; so I am. But if you think I shall scream and plunge and spoil everything, you are mistaken. Awe prevents me. Ask the little mother.\"\n\"You don't reckon a hopeless love among your scrapes, then,\" said Deronda, whose voice seemed to get deeper as Hans's went higher.\n\"I don't mean to call mine hopeless,\" said Hans, with provoking coolness.\n\"My dear fellow, you are only preparing misery for yourself. She would not marry a Christian, even if she loved him. Have you heard her speak of her people and her religion?\"\n\"That can't last,\" said Hans. \"She will see no Jew who is tolerable. Every male of that race is insupportable.\"\n\"She may rejoin her family. That is what she longs for. Her mother and brother are probably strict Jews.\"\n\"I'll turn proselyte, if she wishes it,\" said Hans, with a shrug and a laugh.\n\"Don't talk nonsense, Hans. I thought you professed a serious love for her,\" said Deronda, getting heated.\n\"So I do. You think it desperate, but I don't.\"\n\"I can hardly imagine that there was anything in Mirah's sentiments for you to found a romantic hope on.\"\n\"I don't found my romantic hopes on a woman's sentiments,\" said Hans. \"I go to science and philosophy for my romance. Nature designed Mirah to fall in love with me. The amalgamation of races demands it.\"\n\"You don't mean a word you say, Meyrick,\" said Deronda, laying his hand on his friend's shoulder.\n\"Upon my honour I do mean it, though,\" said Hans, in turn laying his hand on Deronda's shoulder. \"I am at the confessional. My mother says you are Mirah's guardian, and she thinks herself responsible to you for every breath that falls on Mirah in her house. Well, I worship her - I won't despair - I mean to deserve her.\"\n\"My dear fellow, you can't do it,\" said Deronda, quickly. \"Perhaps I am ungenerous, but I warn you that you are indulging mad, Quixotic expectations.\"\n\"Who will be hurt but myself, then?\" said Hans. \"I am not going to say anything to her unless I am sure of the answer. I am giving up wine, so let me get a little drunk on hope and vanity.\"\n\"With all my heart, if it will do you any good,\" said Deronda, making his tone kindly, as he loosed Hans's shoulder with a little push.\nHe was conscious of that irritation which sometimes befalls the man whom others trust as a mentor - the irritation of perceiving that he is supposed to be entirely off the same plane of desire and temptation as those who confess to him. Our guides, we pretend, must be sinless. Deronda had grown used to Hans's egotism, but he had never before felt intolerant of it. When Hans poured out his own feelings, and never cared for any detail in return, Deronda had been indulgent.\nBut now he was indignant at Hans's assumption that as far as rivalry over Mirah was concerned, Deronda was as much out of the question as the angel Gabriel. He had expected that Hans would give him trouble: what he had not expected was that the trouble would make him feel so strongly. And he was rather ashamed that Hans's hopes caused him uneasiness. They had raised an unpleasant image of Mirah changing.\nWhen Deronda went to Chelsea he was not comforted by Mrs. Meyrick's lack of anxiety about her son. Mirah seemed livelier than before, and for the first time he saw her laugh, as she described Hans play-acting.\n\"He is so wonderfully quick,\" said Mirah. \"I used never to like comic things on the stage; but all in one minute Mr. Hans makes himself a blind bard, and then an opera-dancer, and then a desponding young gentleman - I am sorry for them, and yet I laugh.\"\n\"We hardly thought that Mirah could laugh till Hans came,\" said Mrs. Meyrick.\n\"Hans seems in great force just now,\" said Deronda in a tone of congratulation.\n\"He's been just perfect ever since he came back,\" said Mrs. Meyrick.\n\"It is a great happiness,\" said Mirah, \"to see the son and brother come into this dear home, and to hear them all talk about what they did together when they were little. That seems like heaven, to have a mother and brother who talk in that way. I have never had it.\"\n\"Nor I,\" said Deronda, involuntarily.\n\"No?\" said Mirah, regretfully. \"I wish you had. I wish you had had every good.\" The last words were uttered with a serious ardour, while her eyes were fixed on Deronda, who was contemplating her by the new light of Hans's worship, and the possibility of her being attracted to his friend.\nFor the first time in her life Mirah was among those whom she trusted, and her original vision of Deronda as a divinely-sent messenger hung about him still. She felt that she had passed from imprisonment into an exhilarating air which made speech and action a delight. But Deronda's implying that there had been some lack in his life comparable to hers, was an entirely new inlet of thought about him. She went on-\n\"Mr. Hans said yesterday that you thought so much of others you hardly wanted anything for yourself. He told us a wonderful story of Buddha giving himself to the famished tigress to save her and her little ones from starving. And he said you were like Buddha.\"\n\"Pray don't imagine that,\" said Deronda, rather exasperated. \"Even if it were true that I thought so much of others, it would not follow that I had no wants. When Buddha let the tigress eat him he might have been very hungry himself.\"\n\"Perhaps if he was starved he would not mind about being eaten,\" said Mab, shyly.\n\"Please don't think that, Mab; it takes away the beauty of the action,\" said Mirah.\n\"But if it were true, Mirah?\" said the rational Amy; \"you always take what is beautiful as if it were true.\"\n\"So it is,\" said Mirah, gently. \"If people have thought what is the most beautiful and the best thing, it must be true. It is always there.\"\n\"Now, Mirah, what do you mean?\" said Amy.\n\"I understand her,\" said Deronda, coming to the rescue. \"It is a truth in thought though it may never have been carried out in action. It lives as an idea. Is that it?\" He turned to Mirah, who was listening with a blind look in her lovely eyes.\n\"It must be that, because you understand me, but I cannot quite explain,\" said Mirah, rather abstractedly.\n\"But was it beautiful for Buddha to let the tiger eat him?\" said Amy. \"It would be a bad example.\"\n\"The world would get full of fat tigers,\" said Mab.\n\"When the best thing comes into our thoughts, it is like what my mother has been to me,\" said Mirah.\nDeronda, inwardly wincing as he thought of other possibilities about that mother, turned the conversation, saying, \"I came to tell you of an interview I had yesterday with Klesmer, the great pianist. He has promised to fix a time for hearing Miss Lapidoth, if she consents.\"\n\"I shall be very grateful,\" said Mirah. \"He wants to hear me sing, before he can judge whether I ought to be helped.\" Deronda was struck with her plain sense and practicality. \"Is Klesmer a severe man?\"\n\"He is peculiar, but I do not know if you would call him severe. He is kind in action, if not in speech.\"\n\"I have been used to be frowned at and not praised,\" said Mirah.\n\"Klesmer frowns a good deal,\" said Deronda, \"but with a sort of smile in his eyes, if you can catch it.\"\n\"I shall not be frightened. I shall do what I can.\"\n\"Then I feel sure you will not mind being invited to sing in Lady Mallinger's drawing-room,\" said Deronda. \"She intends to ask you next month, and will invite many ladies to hear you, who are likely to want lessons from you for their daughters.\"\n\"How fast we are mounting!\" said Mrs. Meyrick, with delight.\n\"I am a little frightened at being called Miss Lapidoth,\" said Mirah, with a new uneasiness. \"Might I be called Cohen?\"\n\"I understand you,\" said Deronda, promptly. \"But I assure you, you must not be called Cohen. The name is inadmissible for a singer. This is one of the trifles in which we must conform to vulgar prejudice. We could choose some other name, however: an Italian or Spanish name, which would suit your looks.\" To Deronda just now the name Cohen was equivalent to the ugliest of yellow badges.\nMirah reflected anxiously, then said, \"No. I will keep the name Lapidoth. I will not hide myself. I have friends to protect me. And now - if my father were very miserable and wanted help,\" she said, looking at Mrs. Meyrick, \"I should think, then, that I had hidden myself from him. He had no one but me.\"\n\"Do what you feel right, my dear child,\" said Mrs. Meyrick. For her own part she had no patience or pity for that father.\nDeronda thought, \"I should not be angry with Hans. How can he help being in love with her? But it is too absurd for him even to think of marrying her, and a sort of blasphemy to suppose that she could possibly give herself to him.\"\nWhat would it be for Daniel Deronda to entertain such hopes? He could not naively introduce himself where he had just excluded his friend, yet it was undeniable that he had reached a new stage in his feeling toward Mirah. But reasons both definite and vague made him shut away that question. What did he really know about his origin? What was his destination? Strangely, in these latter months when it seemed right that he should choose a destination, he had become more and more locked in by this uncertainty. His chief tether was his early affection for Sir Hugo: he was gratefully deferential to his wishes, while not agreeing with them; but now his doubts were close to making him ungrateful.\nHe accused himself of being weakly self-conscious and wanting in resolve. To Daniel the words Father and Mother still held the mystic power which had made his neck and ears burn in boyhood. The average man may regard this sensitivity on the question of birth as preposterous; but the average man does not even understand the action of his own heart and the structure of his own retina, let alone his mind.\nPerhaps Deronda struggled all the more because he had never had a confidant to speak openly to on these delicate subjects. He had always been leaned on instead of being invited to lean. Sometimes he had longed for the sort of friend to whom he might unfold his experience: a young man like himself who had sustained a private grief and was not too confident about his own career. But he had no expectation of meeting the friend he imagined. Deronda's was not one of those natures that lend themselves to second-sight.",
        "paragraph_chars": [
            [
                0,
                411
            ],
            [
                411,
                621
            ],
            [
                621,
                1023
            ],
            [
                1023,
                1476
            ],
            [
                1476,
                1742
            ],
            [
                1742,
                1826
            ],
            [
                1826,
                1872
            ],
            [
                1872,
                1973
            ],
            [
                1973,
                2322
            ],
            [
                2322,
                2368
            ],
            [
                2368,
                2649
            ],
            [
                2649,
                2725
            ],
            [
                2725,
                2927
            ],
            [
                2927,
                2990
            ],
            [
                2990,
                3376
            ],
            [
                3376,
                3625
            ],
            [
                3625,
                3909
            ],
            [
                3909,
                4040
            ],
            [
                4040,
                4138
            ],
            [
                4138,
                4298
            ],
            [
                4298,
                4425
            ],
            [
                4425,
                4519
            ],
            [
                4519,
                4947
            ],
            [
                4947,
                5051
            ],
            [
                5051,
                5196
            ],
            [
                5196,
                5306
            ],
            [
                5306,
                5499
            ],
            [
                5499,
                5580
            ],
            [
                5580,
                5673
            ],
            [
                5673,
                5846
            ],
            [
                5846,
                6082
            ],
            [
                6082,
                6298
            ],
            [
                6298,
                6380
            ],
            [
                6380,
                6438
            ],
            [
                6438,
                6968
            ],
            [
                6968,
                7452
            ],
            [
                7452,
                7654
            ],
            [
                7654,
                7979
            ],
            [
                7979,
                8525
            ],
            [
                8525,
                9036
            ],
            [
                9036,
                9167
            ],
            [
                9167,
                9241
            ],
            [
                9241,
                9416
            ],
            [
                9416,
                9528
            ],
            [
                9528,
                9634
            ],
            [
                9634,
                9712
            ],
            [
                9712,
                9819
            ],
            [
                9819,
                9867
            ],
            [
                9867,
                9973
            ],
            [
                9973,
                10177
            ],
            [
                10177,
                10275
            ],
            [
                10275,
                10597
            ],
            [
                10597,
                10748
            ],
            [
                10748,
                10938
            ],
            [
                10938,
                11074
            ],
            [
                11074,
                11550
            ],
            [
                11550,
                11958
            ],
            [
                11958,
                12168
            ],
            [
                12168,
                12423
            ],
            [
                12423,
                12501
            ],
            [
                12501,
                12581
            ],
            [
                12581,
                12650
            ],
            [
                12650,
                12918
            ],
            [
                12918,
                12956
            ],
            [
                12956,
                13245
            ],
            [
                13245,
                13660
            ],
            [
                13660,
                13921
            ],
            [
                13921,
                14156
            ],
            [
                14156,
                14238
            ],
            [
                14238,
                14322
            ],
            [
                14322,
                14431
            ],
            [
                14431,
                14572
            ],
            [
                14572,
                14614
            ],
            [
                14614,
                14859
            ],
            [
                14859,
                14966
            ],
            [
                14966,
                15065
            ],
            [
                15065,
                15117
            ],
            [
                15117,
                15218
            ],
            [
                15218,
                15493
            ],
            [
                15493,
                15696
            ],
            [
                15696,
                15802
            ],
            [
                15802,
                15867
            ],
            [
                15867,
                15972
            ],
            [
                15972,
                16024
            ],
            [
                16024,
                16270
            ],
            [
                16270,
                16331
            ],
            [
                16331,
                16451
            ],
            [
                16451,
                16839
            ],
            [
                16839,
                17144
            ],
            [
                17144,
                17266
            ],
            [
                17266,
                17498
            ],
            [
                17498,
                18195
            ],
            [
                18195,
                18601
            ],
            [
                18601,
                19118
            ]
        ],
        "segment_chars": [
            [
                0,
                245
            ],
            [
                245,
                411
            ],
            [
                411,
                621
            ],
            [
                621,
                761
            ],
            [
                761,
                1023
            ],
            [
                1023,
                1162
            ],
            [
                1162,
                1331
            ],
            [
                1331,
                1427
            ],
            [
                1427,
                1476
            ],
            [
                1476,
                1574
            ],
            [
                1574,
                1697
            ],
            [
                1697,
                1742
            ],
            [
                1742,
                1826
            ],
            [
                1826,
                1855
            ],
            [
                1855,
                1872
            ],
            [
                1872,
                1973
            ],
            [
                1973,
                2025
            ],
            [
                2025,
                2070
            ],
            [
                2070,
                2174
            ],
            [
                2174,
                2244
            ],
            [
                2244,
                2285
            ],
            [
                2285,
                2322
            ],
            [
                2322,
                2368
            ],
            [
                2368,
                2449
            ],
            [
                2449,
                2649
            ],
            [
                2649,
                2725
            ],
            [
                2725,
                2801
            ],
            [
                2801,
                2927
            ],
            [
                2927,
                2964
            ],
            [
                2964,
                2990
            ],
            [
                2990,
                3047
            ],
            [
                3047,
                3125
            ],
            [
                3125,
                3151
            ],
            [
                3151,
                3198
            ],
            [
                3198,
                3231
            ],
            [
                3231,
                3258
            ],
            [
                3258,
                3292
            ],
            [
                3292,
                3331
            ],
            [
                3331,
                3376
            ],
            [
                3376,
                3465
            ],
            [
                3465,
                3584
            ],
            [
                3584,
                3625
            ],
            [
                3625,
                3676
            ],
            [
                3676,
                3827
            ],
            [
                3827,
                3909
            ],
            [
                3909,
                4040
            ],
            [
                4040,
                4053
            ],
            [
                4053,
                4138
            ],
            [
                4138,
                4201
            ],
            [
                4201,
                4257
            ],
            [
                4257,
                4298
            ],
            [
                4298,
                4310
            ],
            [
                4310,
                4357
            ],
            [
                4357,
                4425
            ],
            [
                4425,
                4519
            ],
            [
                4519,
                4557
            ],
            [
                4557,
                4682
            ],
            [
                4682,
                4843
            ],
            [
                4843,
                4868
            ],
            [
                4868,
                4947
            ],
            [
                4947,
                5051
            ],
            [
                5051,
                5084
            ],
            [
                5084,
                5161
            ],
            [
                5161,
                5196
            ],
            [
                5196,
                5234
            ],
            [
                5234,
                5270
            ],
            [
                5270,
                5306
            ],
            [
                5306,
                5357
            ],
            [
                5357,
                5429
            ],
            [
                5429,
                5478
            ],
            [
                5478,
                5499
            ],
            [
                5499,
                5580
            ],
            [
                5580,
                5647
            ],
            [
                5647,
                5673
            ],
            [
                5673,
                5719
            ],
            [
                5719,
                5846
            ],
            [
                5846,
                5907
            ],
            [
                5907,
                5936
            ],
            [
                5936,
                6014
            ],
            [
                6014,
                6082
            ],
            [
                6082,
                6298
            ],
            [
                6298,
                6380
            ],
            [
                6380,
                6387
            ],
            [
                6387,
                6438
            ],
            [
                6438,
                6509
            ],
            [
                6509,
                6589
            ],
            [
                6589,
                6629
            ],
            [
                6629,
                6660
            ],
            [
                6660,
                6738
            ],
            [
                6738,
                6968
            ],
            [
                6968,
                7174
            ],
            [
                7174,
                7222
            ],
            [
                7222,
                7349
            ],
            [
                7349,
                7362
            ],
            [
                7362,
                7386
            ],
            [
                7386,
                7452
            ],
            [
                7452,
                7509
            ],
            [
                7509,
                7610
            ],
            [
                7610,
                7654
            ],
            [
                7654,
                7832
            ],
            [
                7832,
                7879
            ],
            [
                7879,
                7924
            ],
            [
                7924,
                7979
            ],
            [
                7979,
                8063
            ],
            [
                8063,
                8163
            ],
            [
                8163,
                8295
            ],
            [
                8295,
                8397
            ],
            [
                8397,
                8440
            ],
            [
                8440,
                8457
            ],
            [
                8457,
                8505
            ],
            [
                8505,
                8525
            ],
            [
                8525,
                8583
            ],
            [
                8583,
                8621
            ],
            [
                8621,
                8633
            ],
            [
                8633,
                8759
            ],
            [
                8759,
                8839
            ],
            [
                8839,
                8890
            ],
            [
                8890,
                8912
            ],
            [
                8912,
                8995
            ],
            [
                8995,
                9012
            ],
            [
                9012,
                9036
            ],
            [
                9036,
                9167
            ],
            [
                9167,
                9241
            ],
            [
                9241,
                9302
            ],
            [
                9302,
                9358
            ],
            [
                9358,
                9416
            ],
            [
                9416,
                9446
            ],
            [
                9446,
                9485
            ],
            [
                9485,
                9528
            ],
            [
                9528,
                9556
            ],
            [
                9556,
                9584
            ],
            [
                9584,
                9634
            ],
            [
                9634,
                9712
            ],
            [
                9712,
                9740
            ],
            [
                9740,
                9819
            ],
            [
                9819,
                9829
            ],
            [
                9829,
                9867
            ],
            [
                9867,
                9973
            ],
            [
                9973,
                10043
            ],
            [
                10043,
                10091
            ],
            [
                10091,
                10138
            ],
            [
                10138,
                10177
            ],
            [
                10177,
                10275
            ],
            [
                10275,
                10372
            ],
            [
                10372,
                10399
            ],
            [
                10399,
                10533
            ],
            [
                10533,
                10597
            ],
            [
                10597,
                10655
            ],
            [
                10655,
                10748
            ],
            [
                10748,
                10785
            ],
            [
                10785,
                10796
            ],
            [
                10796,
                10867
            ],
            [
                10867,
                10938
            ],
            [
                10938,
                11074
            ],
            [
                11074,
                11311
            ],
            [
                11311,
                11352
            ],
            [
                11352,
                11441
            ],
            [
                11441,
                11550
            ],
            [
                11550,
                11707
            ],
            [
                11707,
                11836
            ],
            [
                11836,
                11903
            ],
            [
                11903,
                11958
            ],
            [
                11958,
                12057
            ],
            [
                12057,
                12168
            ],
            [
                12168,
                12210
            ],
            [
                12210,
                12423
            ],
            [
                12423,
                12501
            ],
            [
                12501,
                12581
            ],
            [
                12581,
                12650
            ],
            [
                12650,
                12821
            ],
            [
                12821,
                12896
            ],
            [
                12896,
                12918
            ],
            [
                12918,
                12956
            ],
            [
                12956,
                12962
            ],
            [
                12962,
                12987
            ],
            [
                12987,
                13004
            ],
            [
                13004,
                13036
            ],
            [
                13036,
                13245
            ],
            [
                13245,
                13402
            ],
            [
                13402,
                13514
            ],
            [
                13514,
                13647
            ],
            [
                13647,
                13660
            ],
            [
                13660,
                13761
            ],
            [
                13761,
                13886
            ],
            [
                13886,
                13921
            ],
            [
                13921,
                13982
            ],
            [
                13982,
                14079
            ],
            [
                14079,
                14156
            ],
            [
                14156,
                14238
            ],
            [
                14238,
                14322
            ],
            [
                14322,
                14352
            ],
            [
                14352,
                14431
            ],
            [
                14431,
                14463
            ],
            [
                14463,
                14551
            ],
            [
                14551,
                14572
            ],
            [
                14572,
                14604
            ],
            [
                14604,
                14614
            ],
            [
                14614,
                14670
            ],
            [
                14670,
                14749
            ],
            [
                14749,
                14770
            ],
            [
                14770,
                14783
            ],
            [
                14783,
                14859
            ],
            [
                14859,
                14966
            ],
            [
                14966,
                15026
            ],
            [
                15026,
                15036
            ],
            [
                15036,
                15065
            ],
            [
                15065,
                15117
            ],
            [
                15117,
                15218
            ],
            [
                15218,
                15418
            ],
            [
                15418,
                15493
            ],
            [
                15493,
                15533
            ],
            [
                15533,
                15611
            ],
            [
                15611,
                15669
            ],
            [
                15669,
                15696
            ],
            [
                15696,
                15761
            ],
            [
                15761,
                15802
            ],
            [
                15802,
                15867
            ],
            [
                15867,
                15972
            ],
            [
                15972,
                16000
            ],
            [
                16000,
                16024
            ],
            [
                16024,
                16131
            ],
            [
                16131,
                16270
            ],
            [
                16270,
                16298
            ],
            [
                16298,
                16331
            ],
            [
                16331,
                16424
            ],
            [
                16424,
                16451
            ],
            [
                16451,
                16495
            ],
            [
                16495,
                16544
            ],
            [
                16544,
                16583
            ],
            [
                16583,
                16656
            ],
            [
                16656,
                16756
            ],
            [
                16756,
                16839
            ],
            [
                16839,
                16882
            ],
            [
                16882,
                16913
            ],
            [
                16913,
                16937
            ],
            [
                16937,
                16967
            ],
            [
                16967,
                17121
            ],
            [
                17121,
                17144
            ],
            [
                17144,
                17204
            ],
            [
                17204,
                17266
            ],
            [
                17266,
                17317
            ],
            [
                17317,
                17357
            ],
            [
                17357,
                17498
            ],
            [
                17498,
                17559
            ],
            [
                17559,
                17720
            ],
            [
                17720,
                17790
            ],
            [
                17790,
                17832
            ],
            [
                17832,
                17858
            ],
            [
                17858,
                18009
            ],
            [
                18009,
                18195
            ],
            [
                18195,
                18269
            ],
            [
                18269,
                18385
            ],
            [
                18385,
                18601
            ],
            [
                18601,
                18724
            ],
            [
                18724,
                18787
            ],
            [
                18787,
                18981
            ],
            [
                18981,
                19042
            ],
            [
                19042,
                19118
            ]
        ],
        "overlap_chars": [
            [
                0,
                50
            ],
            [
                58,
                63
            ],
            [
                66,
                83
            ],
            [
                94,
                108
            ],
            [
                115,
                123
            ],
            [
                126,
                149
            ],
            [
                156,
                176
            ],
            [
                188,
                190
            ],
            [
                191,
                201
            ],
            [
                202,
                231
            ],
            [
                232,
                234
            ],
            [
                235,
                245
            ],
            [
                245,
                287
            ],
            [
                294,
                311
            ],
            [
                312,
                336
            ],
            [
                339,
                351
            ],
            [
                352,
                358
            ],
            [
                365,
                411
            ],
            [
                411,
                462
            ],
            [
                463,
                472
            ],
            [
                483,
                493
            ],
            [
                494,
                500
            ],
            [
                501,
                511
            ],
            [
                511,
                521
            ],
            [
                522,
                528
            ],
            [
                536,
                545
            ],
            [
                554,
                576
            ],
            [
                585,
                589
            ],
            [
                594,
                596
            ],
            [
                619,
                620
            ],
            [
                633,
                637
            ],
            [
                637,
                638
            ],
            [
                639,
                646
            ],
            [
                649,
                704
            ],
            [
                706,
                750
            ],
            [
                759,
                760
            ],
            [
                775,
                779
            ],
            [
                780,
                792
            ],
            [
                793,
                808
            ],
            [
                809,
                812
            ],
            [
                820,
                830
            ],
            [
                831,
                835
            ],
            [
                841,
                886
            ],
            [
                889,
                909
            ],
            [
                916,
                971
            ],
            [
                972,
                1022
            ],
            [
                1023,
                1123
            ],
            [
                1123,
                1126
            ],
            [
                1130,
                1138
            ],
            [
                1146,
                1162
            ],
            [
                1162,
                1193
            ],
            [
                1203,
                1269
            ],
            [
                1272,
                1331
            ],
            [
                1331,
                1344
            ],
            [
                1369,
                1427
            ],
            [
                1427,
                1476
            ],
            [
                1476,
                1510
            ],
            [
                1510,
                1574
            ],
            [
                1574,
                1576
            ],
            [
                1584,
                1619
            ],
            [
                1620,
                1658
            ],
            [
                1661,
                1697
            ],
            [
                1697,
                1699
            ],
            [
                1707,
                1709
            ],
            [
                1710,
                1714
            ],
            [
                1715,
                1741
            ],
            [
                1742,
                1777
            ],
            [
                1778,
                1796
            ],
            [
                1797,
                1799
            ],
            [
                1800,
                1826
            ],
            [
                1826,
                1855
            ],
            [
                1855,
                1872
            ],
            [
                1872,
                1955
            ],
            [
                1965,
                1971
            ],
            [
                1971,
                1973
            ],
            [
                1973,
                2025
            ],
            [
                2026,
                2070
            ],
            [
                2070,
                2099
            ],
            [
                2102,
                2107
            ],
            [
                2112,
                2124
            ],
            [
                2127,
                2130
            ],
            [
                2131,
                2164
            ],
            [
                2165,
                2172
            ],
            [
                2174,
                2244
            ],
            [
                2244,
                2285
            ],
            [
                2285,
                2319
            ],
            [
                2322,
                2368
            ],
            [
                2368,
                2381
            ],
            [
                2391,
                2403
            ],
            [
                2403,
                2447
            ],
            [
                2449,
                2472
            ],
            [
                2472,
                2490
            ],
            [
                2491,
                2649
            ],
            [
                2649,
                2722
            ],
            [
                2725,
                2769
            ],
            [
                2772,
                2801
            ],
            [
                2801,
                2899
            ],
            [
                2902,
                2916
            ],
            [
                2921,
                2924
            ],
            [
                2927,
                2964
            ],
            [
                2964,
                2990
            ],
            [
                2990,
                3047
            ],
            [
                3047,
                3125
            ],
            [
                3125,
                3151
            ],
            [
                3151,
                3182
            ],
            [
                3185,
                3198
            ],
            [
                3198,
                3229
            ],
            [
                3229,
                3231
            ],
            [
                3231,
                3256
            ],
            [
                3258,
                3292
            ],
            [
                3292,
                3329
            ],
            [
                3331,
                3373
            ],
            [
                3376,
                3465
            ],
            [
                3465,
                3496
            ],
            [
                3502,
                3511
            ],
            [
                3511,
                3584
            ],
            [
                3584,
                3625
            ],
            [
                3625,
                3641
            ],
            [
                3642,
                3644
            ],
            [
                3656,
                3676
            ],
            [
                3676,
                3716
            ],
            [
                3719,
                3761
            ],
            [
                3764,
                3797
            ],
            [
                3806,
                3827
            ],
            [
                3827,
                3909
            ],
            [
                3909,
                4040
            ],
            [
                4040,
                4044
            ],
            [
                4051,
                4053
            ],
            [
                4053,
                4138
            ],
            [
                4138,
                4139
            ],
            [
                4143,
                4146
            ],
            [
                4147,
                4201
            ],
            [
                4201,
                4257
            ],
            [
                4257,
                4298
            ],
            [
                4298,
                4310
            ],
            [
                4310,
                4336
            ],
            [
                4337,
                4357
            ],
            [
                4357,
                4424
            ],
            [
                4425,
                4495
            ],
            [
                4506,
                4517
            ],
            [
                4517,
                4519
            ],
            [
                4519,
                4537
            ],
            [
                4546,
                4557
            ],
            [
                4557,
                4682
            ],
            [
                4682,
                4843
            ],
            [
                4843,
                4868
            ],
            [
                4868,
                4947
            ],
            [
                4947,
                5009
            ],
            [
                5015,
                5051
            ],
            [
                5051,
                5052
            ],
            [
                5060,
                5070
            ],
            [
                5073,
                5084
            ],
            [
                5084,
                5087
            ],
            [
                5097,
                5104
            ],
            [
                5105,
                5118
            ],
            [
                5118,
                5119
            ],
            [
                5120,
                5139
            ],
            [
                5147,
                5150
            ],
            [
                5159,
                5161
            ],
            [
                5161,
                5193
            ],
            [
                5196,
                5234
            ],
            [
                5234,
                5270
            ],
            [
                5270,
                5306
            ],
            [
                5307,
                5339
            ],
            [
                5346,
                5357
            ],
            [
                5357,
                5383
            ],
            [
                5384,
                5429
            ],
            [
                5429,
                5478
            ],
            [
                5478,
                5496
            ],
            [
                5499,
                5580
            ],
            [
                5580,
                5647
            ],
            [
                5647,
                5673
            ],
            [
                5673,
                5717
            ],
            [
                5717,
                5719
            ],
            [
                5719,
                5723
            ],
            [
                5724,
                5823
            ],
            [
                5829,
                5846
            ],
            [
                5846,
                5888
            ],
            [
                5898,
                5907
            ],
            [
                5907,
                5936
            ],
            [
                5936,
                5969
            ],
            [
                5983,
                6014
            ],
            [
                6014,
                6018
            ],
            [
                6018,
                6019
            ],
            [
                6026,
                6027
            ],
            [
                6028,
                6064
            ],
            [
                6065,
                6082
            ],
            [
                6082,
                6112
            ],
            [
                6112,
                6127
            ],
            [
                6128,
                6151
            ],
            [
                6160,
                6188
            ],
            [
                6189,
                6195
            ],
            [
                6196,
                6199
            ],
            [
                6200,
                6207
            ],
            [
                6216,
                6296
            ],
            [
                6298,
                6350
            ],
            [
                6357,
                6380
            ],
            [
                6380,
                6387
            ],
            [
                6387,
                6438
            ],
            [
                6438,
                6496
            ],
            [
                6497,
                6509
            ],
            [
                6509,
                6539
            ],
            [
                6540,
                6589
            ],
            [
                6589,
                6599
            ],
            [
                6603,
                6629
            ],
            [
                6629,
                6660
            ],
            [
                6660,
                6738
            ],
            [
                6738,
                6782
            ],
            [
                6783,
                6894
            ],
            [
                6897,
                6968
            ],
            [
                6968,
                7000
            ],
            [
                7001,
                7004
            ],
            [
                7005,
                7009
            ],
            [
                7009,
                7052
            ],
            [
                7053,
                7084
            ],
            [
                7084,
                7137
            ],
            [
                7142,
                7174
            ],
            [
                7174,
                7222
            ],
            [
                7222,
                7252
            ],
            [
                7259,
                7284
            ],
            [
                7285,
                7349
            ],
            [
                7349,
                7362
            ],
            [
                7367,
                7386
            ],
            [
                7386,
                7432
            ],
            [
                7437,
                7452
            ],
            [
                7452,
                7478
            ],
            [
                7487,
                7489
            ],
            [
                7494,
                7501
            ],
            [
                7507,
                7509
            ],
            [
                7509,
                7522
            ],
            [
                7523,
                7569
            ],
            [
                7571,
                7574
            ],
            [
                7575,
                7597
            ],
            [
                7598,
                7610
            ],
            [
                7610,
                7614
            ],
            [
                7615,
                7652
            ],
            [
                7654,
                7655
            ],
            [
                7655,
                7675
            ],
            [
                7680,
                7832
            ],
            [
                7832,
                7845
            ],
            [
                7853,
                7864
            ],
            [
                7873,
                7877
            ],
            [
                7877,
                7879
            ],
            [
                7879,
                7895
            ],
            [
                7896,
                7924
            ],
            [
                7924,
                7976
            ],
            [
                7979,
                8011
            ],
            [
                8027,
                8033
            ],
            [
                8033,
                8049
            ],
            [
                8061,
                8063
            ],
            [
                8063,
                8077
            ],
            [
                8078,
                8161
            ],
            [
                8161,
                8163
            ],
            [
                8163,
                8181
            ],
            [
                8188,
                8197
            ],
            [
                8199,
                8202
            ],
            [
                8203,
                8217
            ],
            [
                8224,
                8293
            ],
            [
                8293,
                8295
            ],
            [
                8295,
                8308
            ],
            [
                8309,
                8311
            ],
            [
                8312,
                8325
            ],
            [
                8325,
                8343
            ],
            [
                8344,
                8348
            ],
            [
                8360,
                8375
            ],
            [
                8376,
                8385
            ],
            [
                8386,
                8390
            ],
            [
                8391,
                8395
            ],
            [
                8395,
                8397
            ],
            [
                8397,
                8440
            ],
            [
                8440,
                8457
            ],
            [
                8457,
                8505
            ],
            [
                8505,
                8522
            ],
            [
                8522,
                8525
            ],
            [
                8525,
                8548
            ],
            [
                8560,
                8570
            ],
            [
                8576,
                8583
            ],
            [
                8583,
                8587
            ],
            [
                8594,
                8595
            ],
            [
                8606,
                8610
            ],
            [
                8619,
                8621
            ],
            [
                8621,
                8633
            ],
            [
                8633,
                8759
            ],
            [
                8759,
                8777
            ],
            [
                8785,
                8839
            ],
            [
                8839,
                8850
            ],
            [
                8854,
                8858
            ],
            [
                8859,
                8863
            ],
            [
                8870,
                8890
            ],
            [
                8890,
                8912
            ],
            [
                8912,
                8915
            ],
            [
                8919,
                8975
            ],
            [
                8975,
                8976
            ],
            [
                8977,
                8993
            ],
            [
                8993,
                8995
            ],
            [
                8995,
                8998
            ],
            [
                9008,
                9012
            ],
            [
                9012,
                9036
            ],
            [
                9036,
                9167
            ],
            [
                9167,
                9239
            ],
            [
                9239,
                9241
            ],
            [
                9241,
                9300
            ],
            [
                9300,
                9302
            ],
            [
                9302,
                9358
            ],
            [
                9358,
                9366
            ],
            [
                9367,
                9416
            ],
            [
                9416,
                9446
            ],
            [
                9446,
                9485
            ],
            [
                9485,
                9525
            ],
            [
                9525,
                9528
            ],
            [
                9528,
                9556
            ],
            [
                9556,
                9584
            ],
            [
                9584,
                9634
            ],
            [
                9634,
                9712
            ],
            [
                9712,
                9740
            ],
            [
                9740,
                9819
            ],
            [
                9819,
                9829
            ],
            [
                9829,
                9867
            ],
            [
                9868,
                9888
            ],
            [
                9889,
                9899
            ],
            [
                9904,
                9972
            ],
            [
                9973,
                10041
            ],
            [
                10041,
                10043
            ],
            [
                10043,
                10091
            ],
            [
                10091,
                10138
            ],
            [
                10138,
                10174
            ],
            [
                10178,
                10251
            ],
            [
                10262,
                10273
            ],
            [
                10273,
                10274
            ],
            [
                10275,
                10283
            ],
            [
                10291,
                10324
            ],
            [
                10333,
                10343
            ],
            [
                10344,
                10370
            ],
            [
                10370,
                10372
            ],
            [
                10372,
                10399
            ],
            [
                10399,
                10533
            ],
            [
                10533,
                10540
            ],
            [
                10541,
                10552
            ],
            [
                10555,
                10570
            ],
            [
                10573,
                10597
            ],
            [
                10597,
                10654
            ],
            [
                10655,
                10679
            ],
            [
                10679,
                10680
            ],
            [
                10687,
                10748
            ],
            [
                10748,
                10785
            ],
            [
                10785,
                10794
            ],
            [
                10794,
                10796
            ],
            [
                10796,
                10843
            ],
            [
                10847,
                10867
            ],
            [
                10867,
                10938
            ],
            [
                10938,
                11000
            ],
            [
                11008,
                11024
            ],
            [
                11028,
                11030
            ],
            [
                11031,
                11033
            ],
            [
                11038,
                11053
            ],
            [
                11054,
                11073
            ],
            [
                11074,
                11098
            ],
            [
                11099,
                11115
            ],
            [
                11116,
                11128
            ],
            [
                11134,
                11153
            ],
            [
                11154,
                11171
            ],
            [
                11174,
                11311
            ],
            [
                11311,
                11350
            ],
            [
                11350,
                11352
            ],
            [
                11352,
                11363
            ],
            [
                11370,
                11439
            ],
            [
                11439,
                11440
            ],
            [
                11441,
                11450
            ],
            [
                11458,
                11478
            ],
            [
                11478,
                11479
            ],
            [
                11480,
                11483
            ],
            [
                11484,
                11521
            ],
            [
                11522,
                11538
            ],
            [
                11539,
                11548
            ],
            [
                11548,
                11549
            ],
            [
                11550,
                11560
            ],
            [
                11578,
                11584
            ],
            [
                11585,
                11600
            ],
            [
                11611,
                11618
            ],
            [
                11624,
                11629
            ],
            [
                11643,
                11656
            ],
            [
                11657,
                11707
            ],
            [
                11707,
                11808
            ],
            [
                11834,
                11836
            ],
            [
                11836,
                11901
            ],
            [
                11901,
                11903
            ],
            [
                11903,
                11921
            ],
            [
                11922,
                11932
            ],
            [
                11933,
                11956
            ],
            [
                11956,
                11957
            ],
            [
                11958,
                11997
            ],
            [
                12008,
                12025
            ],
            [
                12034,
                12047
            ],
            [
                12052,
                12057
            ],
            [
                12057,
                12131
            ],
            [
                12131,
                12132
            ],
            [
                12150,
                12154
            ],
            [
                12166,
                12168
            ],
            [
                12168,
                12195
            ],
            [
                12195,
                12208
            ],
            [
                12208,
                12210
            ],
            [
                12210,
                12211
            ],
            [
                12211,
                12257
            ],
            [
                12257,
                12326
            ],
            [
                12327,
                12381
            ],
            [
                12384,
                12403
            ],
            [
                12403,
                12420
            ],
            [
                12423,
                12499
            ],
            [
                12499,
                12501
            ],
            [
                12501,
                12580
            ],
            [
                12581,
                12648
            ],
            [
                12650,
                12741
            ],
            [
                12743,
                12746
            ],
            [
                12750,
                12821
            ],
            [
                12821,
                12844
            ],
            [
                12845,
                12896
            ],
            [
                12896,
                12918
            ],
            [
                12918,
                12956
            ],
            [
                12956,
                12962
            ],
            [
                12962,
                12987
            ],
            [
                12987,
                13004
            ],
            [
                13004,
                13036
            ],
            [
                13036,
                13082
            ],
            [
                13085,
                13128
            ],
            [
                13129,
                13170
            ],
            [
                13171,
                13175
            ],
            [
                13185,
                13229
            ],
            [
                13233,
                13236
            ],
            [
                13243,
                13244
            ],
            [
                13245,
                13306
            ],
            [
                13307,
                13332
            ],
            [
                13343,
                13350
            ],
            [
                13354,
                13390
            ],
            [
                13395,
                13400
            ],
            [
                13400,
                13402
            ],
            [
                13411,
                13415
            ],
            [
                13424,
                13435
            ],
            [
                13436,
                13514
            ],
            [
                13514,
                13517
            ],
            [
                13518,
                13578
            ],
            [
                13593,
                13647
            ],
            [
                13647,
                13658
            ],
            [
                13660,
                13661
            ],
            [
                13663,
                13761
            ],
            [
                13761,
                13886
            ],
            [
                13886,
                13918
            ],
            [
                13921,
                13961
            ],
            [
                13962,
                13976
            ],
            [
                13980,
                13982
            ],
            [
                13982,
                14077
            ],
            [
                14077,
                14079
            ],
            [
                14079,
                14156
            ],
            [
                14156,
                14200
            ],
            [
                14201,
                14238
            ],
            [
                14238,
                14322
            ],
            [
                14322,
                14352
            ],
            [
                14352,
                14373
            ],
            [
                14373,
                14431
            ],
            [
                14431,
                14463
            ],
            [
                14463,
                14551
            ],
            [
                14551,
                14572
            ],
            [
                14572,
                14604
            ],
            [
                14604,
                14614
            ],
            [
                14614,
                14669
            ],
            [
                14670,
                14749
            ],
            [
                14749,
                14770
            ],
            [
                14770,
                14783
            ],
            [
                14783,
                14859
            ],
            [
                14859,
                14964
            ],
            [
                14964,
                14966
            ],
            [
                14966,
                14970
            ],
            [
                14971,
                14974
            ],
            [
                14975,
                15026
            ],
            [
                15026,
                15034
            ],
            [
                15034,
                15036
            ],
            [
                15036,
                15054
            ],
            [
                15062,
                15065
            ],
            [
                15065,
                15117
            ],
            [
                15117,
                15203
            ],
            [
                15216,
                15217
            ],
            [
                15218,
                15243
            ],
            [
                15261,
                15266
            ],
            [
                15281,
                15298
            ],
            [
                15298,
                15299
            ],
            [
                15300,
                15323
            ],
            [
                15323,
                15324
            ],
            [
                15325,
                15334
            ],
            [
                15334,
                15340
            ],
            [
                15341,
                15348
            ],
            [
                15353,
                15384
            ],
            [
                15385,
                15416
            ],
            [
                15416,
                15417
            ],
            [
                15418,
                15420
            ],
            [
                15421,
                15451
            ],
            [
                15452,
                15474
            ],
            [
                15475,
                15490
            ],
            [
                15490,
                15493
            ],
            [
                15493,
                15533
            ],
            [
                15533,
                15610
            ],
            [
                15611,
                15650
            ],
            [
                15655,
                15664
            ],
            [
                15667,
                15668
            ],
            [
                15670,
                15696
            ],
            [
                15696,
                15718
            ],
            [
                15722,
                15725
            ],
            [
                15726,
                15730
            ],
            [
                15734,
                15748
            ],
            [
                15749,
                15752
            ],
            [
                15753,
                15759
            ],
            [
                15761,
                15766
            ],
            [
                15767,
                15802
            ],
            [
                15802,
                15867
            ],
            [
                15867,
                15868
            ],
            [
                15868,
                15915
            ],
            [
                15921,
                15948
            ],
            [
                15948,
                15949
            ],
            [
                15953,
                15956
            ],
            [
                15961,
                15966
            ],
            [
                15969,
                15972
            ],
            [
                15972,
                15998
            ],
            [
                15998,
                16000
            ],
            [
                16000,
                16024
            ],
            [
                16024,
                16131
            ],
            [
                16131,
                16270
            ],
            [
                16270,
                16298
            ],
            [
                16298,
                16330
            ],
            [
                16331,
                16400
            ],
            [
                16401,
                16424
            ],
            [
                16424,
                16451
            ],
            [
                16451,
                16495
            ],
            [
                16495,
                16544
            ],
            [
                16544,
                16583
            ],
            [
                16583,
                16656
            ],
            [
                16656,
                16696
            ],
            [
                16698,
                16747
            ],
            [
                16753,
                16756
            ],
            [
                16756,
                16839
            ],
            [
                16839,
                16854
            ],
            [
                16855,
                16882
            ],
            [
                16882,
                16902
            ],
            [
                16911,
                16913
            ],
            [
                16913,
                16937
            ],
            [
                16937,
                16967
            ],
            [
                16967,
                16974
            ],
            [
                16977,
                17025
            ],
            [
                17025,
                17090
            ],
            [
                17091,
                17121
            ],
            [
                17121,
                17127
            ],
            [
                17135,
                17141
            ],
            [
                17144,
                17145
            ],
            [
                17148,
                17204
            ],
            [
                17204,
                17264
            ],
            [
                17264,
                17266
            ],
            [
                17266,
                17273
            ],
            [
                17281,
                17285
            ],
            [
                17297,
                17317
            ],
            [
                17317,
                17357
            ],
            [
                17357,
                17377
            ],
            [
                17378,
                17393
            ],
            [
                17400,
                17402
            ],
            [
                17412,
                17498
            ],
            [
                17498,
                17551
            ],
            [
                17557,
                17559
            ],
            [
                17559,
                17561
            ],
            [
                17562,
                17567
            ],
            [
                17568,
                17571
            ],
            [
                17572,
                17663
            ],
            [
                17667,
                17670
            ],
            [
                17679,
                17720
            ],
            [
                17720,
                17723
            ],
            [
                17724,
                17788
            ],
            [
                17788,
                17790
            ],
            [
                17790,
                17831
            ],
            [
                17841,
                17844
            ],
            [
                17856,
                17857
            ],
            [
                17858,
                17867
            ],
            [
                17869,
                17927
            ],
            [
                17935,
                17949
            ],
            [
                17953,
                17956
            ],
            [
                17964,
                17984
            ],
            [
                17985,
                17987
            ],
            [
                17988,
                18009
            ],
            [
                18009,
                18039
            ],
            [
                18040,
                18062
            ],
            [
                18062,
                18063
            ],
            [
                18064,
                18066
            ],
            [
                18071,
                18096
            ],
            [
                18101,
                18107
            ],
            [
                18107,
                18108
            ],
            [
                18128,
                18132
            ],
            [
                18139,
                18142
            ],
            [
                18151,
                18157
            ],
            [
                18158,
                18162
            ],
            [
                18169,
                18171
            ],
            [
                18172,
                18182
            ],
            [
                18183,
                18194
            ],
            [
                18195,
                18213
            ],
            [
                18214,
                18269
            ],
            [
                18269,
                18306
            ],
            [
                18307,
                18312
            ],
            [
                18313,
                18317
            ],
            [
                18318,
                18385
            ],
            [
                18385,
                18416
            ],
            [
                18429,
                18469
            ],
            [
                18469,
                18474
            ],
            [
                18475,
                18490
            ],
            [
                18496,
                18499
            ],
            [
                18500,
                18504
            ],
            [
                18516,
                18579
            ],
            [
                18579,
                18580
            ],
            [
                18591,
                18594
            ],
            [
                18599,
                18601
            ],
            [
                18601,
                18608
            ],
            [
                18609,
                18616
            ],
            [
                18627,
                18634
            ],
            [
                18640,
                18679
            ],
            [
                18696,
                18724
            ],
            [
                18724,
                18787
            ],
            [
                18787,
                18850
            ],
            [
                18851,
                18902
            ],
            [
                18903,
                18906
            ],
            [
                18907,
                18979
            ],
            [
                18979,
                18981
            ],
            [
                18981,
                19042
            ],
            [
                19042,
                19072
            ],
            [
                19073,
                19118
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                245
            ],
            [
                245,
                411
            ],
            [
                411,
                411
            ],
            [
                411,
                411
            ],
            [
                411,
                621
            ],
            [
                621,
                1023
            ],
            [
                1023,
                1023
            ],
            [
                1023,
                1162
            ],
            [
                1162,
                1331
            ],
            [
                1331,
                1331
            ],
            [
                1331,
                1427
            ],
            [
                1427,
                1476
            ],
            [
                1476,
                1574
            ],
            [
                1574,
                1697
            ],
            [
                1697,
                1742
            ],
            [
                1742,
                1826
            ],
            [
                1826,
                1855
            ],
            [
                1855,
                1872
            ],
            [
                1872,
                1973
            ],
            [
                1973,
                2025
            ],
            [
                2025,
                2025
            ],
            [
                2025,
                2025
            ],
            [
                2025,
                2070
            ],
            [
                2070,
                2174
            ],
            [
                2174,
                2244
            ],
            [
                2244,
                2285
            ],
            [
                2285,
                2322
            ],
            [
                2322,
                2322
            ],
            [
                2322,
                2322
            ],
            [
                2322,
                2368
            ],
            [
                2368,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2449
            ],
            [
                2449,
                2649
            ],
            [
                2649,
                2725
            ],
            [
                2725,
                2725
            ],
            [
                2725,
                2801
            ],
            [
                2801,
                2927
            ],
            [
                2927,
                2927
            ],
            [
                2927,
                2964
            ],
            [
                2964,
                2990
            ],
            [
                2990,
                3047
            ],
            [
                3047,
                3047
            ],
            [
                3047,
                3125
            ],
            [
                3125,
                3151
            ],
            [
                3151,
                3198
            ],
            [
                3198,
                3198
            ],
            [
                3198,
                3231
            ],
            [
                3231,
                3258
            ],
            [
                3258,
                3258
            ],
            [
                3258,
                3292
            ],
            [
                3292,
                3331
            ],
            [
                3331,
                3331
            ],
            [
                3331,
                3376
            ],
            [
                3376,
                3376
            ],
            [
                3376,
                3465
            ],
            [
                3465,
                3584
            ],
            [
                3584,
                3625
            ],
            [
                3625,
                3676
            ],
            [
                3676,
                3676
            ],
            [
                3676,
                3827
            ],
            [
                3827,
                3827
            ],
            [
                3827,
                3909
            ],
            [
                3909,
                4040
            ],
            [
                4040,
                4053
            ],
            [
                4053,
                4138
            ],
            [
                4138,
                4201
            ],
            [
                4201,
                4257
            ],
            [
                4257,
                4298
            ],
            [
                4298,
                4310
            ],
            [
                4310,
                4357
            ],
            [
                4357,
                4425
            ],
            [
                4425,
                4425
            ],
            [
                4425,
                4519
            ],
            [
                4519,
                4557
            ],
            [
                4557,
                4682
            ],
            [
                4682,
                4682
            ],
            [
                4682,
                4843
            ],
            [
                4843,
                4868
            ],
            [
                4868,
                4947
            ],
            [
                4947,
                5051
            ],
            [
                5051,
                5084
            ],
            [
                5084,
                5161
            ],
            [
                5161,
                5161
            ],
            [
                5161,
                5196
            ],
            [
                5196,
                5196
            ],
            [
                5196,
                5234
            ],
            [
                5234,
                5270
            ],
            [
                5270,
                5306
            ],
            [
                5306,
                5306
            ],
            [
                5306,
                5357
            ],
            [
                5357,
                5429
            ],
            [
                5429,
                5429
            ],
            [
                5429,
                5478
            ],
            [
                5478,
                5499
            ],
            [
                5499,
                5499
            ],
            [
                5499,
                5580
            ],
            [
                5580,
                5647
            ],
            [
                5647,
                5673
            ],
            [
                5673,
                5719
            ],
            [
                5719,
                5846
            ],
            [
                5846,
                5907
            ],
            [
                5907,
                5936
            ],
            [
                5936,
                6014
            ],
            [
                6014,
                6082
            ],
            [
                6082,
                6298
            ],
            [
                6298,
                6380
            ],
            [
                6380,
                6387
            ],
            [
                6387,
                6438
            ],
            [
                6438,
                6509
            ],
            [
                6509,
                6589
            ],
            [
                6589,
                6629
            ],
            [
                6629,
                6660
            ],
            [
                6660,
                6738
            ],
            [
                6738,
                6968
            ],
            [
                6968,
                7174
            ],
            [
                7174,
                7222
            ],
            [
                7222,
                7222
            ],
            [
                7222,
                7349
            ],
            [
                7349,
                7362
            ],
            [
                7362,
                7386
            ],
            [
                7386,
                7452
            ],
            [
                7452,
                7509
            ],
            [
                7509,
                7610
            ],
            [
                7610,
                7610
            ],
            [
                7610,
                7654
            ],
            [
                7654,
                7832
            ],
            [
                7832,
                7879
            ],
            [
                7879,
                7924
            ],
            [
                7924,
                7924
            ],
            [
                7924,
                7924
            ],
            [
                7924,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                7979
            ],
            [
                7979,
                8063
            ],
            [
                8063,
                8163
            ],
            [
                8163,
                8295
            ],
            [
                8295,
                8397
            ],
            [
                8397,
                8440
            ],
            [
                8440,
                8457
            ],
            [
                8457,
                8505
            ],
            [
                8505,
                8525
            ],
            [
                8525,
                8583
            ],
            [
                8583,
                8621
            ],
            [
                8621,
                8633
            ],
            [
                8633,
                8759
            ],
            [
                8759,
                8759
            ],
            [
                8759,
                8839
            ],
            [
                8839,
                8839
            ],
            [
                8839,
                8839
            ],
            [
                8839,
                8890
            ],
            [
                8890,
                8912
            ],
            [
                8912,
                8995
            ],
            [
                8995,
                8995
            ],
            [
                8995,
                9012
            ],
            [
                9012,
                9036
            ],
            [
                9036,
                9167
            ],
            [
                9167,
                9241
            ],
            [
                9241,
                9302
            ],
            [
                9302,
                9358
            ],
            [
                9358,
                9416
            ],
            [
                9416,
                9446
            ],
            [
                9446,
                9485
            ],
            [
                9485,
                9528
            ],
            [
                9528,
                9556
            ],
            [
                9556,
                9584
            ],
            [
                9584,
                9634
            ],
            [
                9634,
                9712
            ],
            [
                9712,
                9740
            ],
            [
                9740,
                9819
            ],
            [
                9819,
                9829
            ],
            [
                9829,
                9867
            ],
            [
                9867,
                9867
            ],
            [
                9867,
                9867
            ],
            [
                9867,
                9973
            ],
            [
                9973,
                9973
            ],
            [
                9973,
                10043
            ],
            [
                10043,
                10091
            ],
            [
                10091,
                10138
            ],
            [
                10138,
                10177
            ],
            [
                10177,
                10177
            ],
            [
                10177,
                10177
            ],
            [
                10177,
                10177
            ],
            [
                10177,
                10275
            ],
            [
                10275,
                10275
            ],
            [
                10275,
                10372
            ],
            [
                10372,
                10399
            ],
            [
                10399,
                10399
            ],
            [
                10399,
                10533
            ],
            [
                10533,
                10597
            ],
            [
                10597,
                10655
            ],
            [
                10655,
                10655
            ],
            [
                10655,
                10655
            ],
            [
                10655,
                10655
            ],
            [
                10655,
                10655
            ],
            [
                10655,
                10748
            ],
            [
                10748,
                10785
            ],
            [
                10785,
                10796
            ],
            [
                10796,
                10867
            ],
            [
                10867,
                10867
            ],
            [
                10867,
                10867
            ],
            [
                10867,
                10867
            ],
            [
                10867,
                10938
            ],
            [
                10938,
                11074
            ],
            [
                11074,
                11074
            ],
            [
                11074,
                11311
            ],
            [
                11311,
                11352
            ],
            [
                11352,
                11550
            ],
            [
                11550,
                11707
            ],
            [
                11707,
                11707
            ],
            [
                11707,
                11836
            ],
            [
                11836,
                11903
            ],
            [
                11903,
                11958
            ],
            [
                11958,
                11958
            ],
            [
                11958,
                12057
            ],
            [
                12057,
                12168
            ],
            [
                12168,
                12210
            ],
            [
                12210,
                12423
            ],
            [
                12423,
                12501
            ],
            [
                12501,
                12581
            ],
            [
                12581,
                12581
            ],
            [
                12581,
                12650
            ],
            [
                12650,
                12821
            ],
            [
                12821,
                12896
            ],
            [
                12896,
                12918
            ],
            [
                12918,
                12956
            ],
            [
                12956,
                12962
            ],
            [
                12962,
                12987
            ],
            [
                12987,
                13004
            ],
            [
                13004,
                13036
            ],
            [
                13036,
                13245
            ],
            [
                13245,
                13245
            ],
            [
                13245,
                13402
            ],
            [
                13402,
                13402
            ],
            [
                13402,
                13514
            ],
            [
                13514,
                13514
            ],
            [
                13514,
                13647
            ],
            [
                13647,
                13660
            ],
            [
                13660,
                13761
            ],
            [
                13761,
                13886
            ],
            [
                13886,
                13921
            ],
            [
                13921,
                13921
            ],
            [
                13921,
                13982
            ],
            [
                13982,
                14079
            ],
            [
                14079,
                14156
            ],
            [
                14156,
                14238
            ],
            [
                14238,
                14322
            ],
            [
                14322,
                14352
            ],
            [
                14352,
                14431
            ],
            [
                14431,
                14463
            ],
            [
                14463,
                14551
            ],
            [
                14551,
                14572
            ],
            [
                14572,
                14604
            ],
            [
                14604,
                14614
            ],
            [
                14614,
                14670
            ],
            [
                14670,
                14749
            ],
            [
                14749,
                14770
            ],
            [
                14770,
                14783
            ],
            [
                14783,
                14859
            ],
            [
                14859,
                14966
            ],
            [
                14966,
                15026
            ],
            [
                15026,
                15036
            ],
            [
                15036,
                15065
            ],
            [
                15065,
                15117
            ],
            [
                15117,
                15117
            ],
            [
                15117,
                15117
            ],
            [
                15117,
                15117
            ],
            [
                15117,
                15117
            ],
            [
                15117,
                15218
            ],
            [
                15218,
                15218
            ],
            [
                15218,
                15418
            ],
            [
                15418,
                15418
            ],
            [
                15418,
                15418
            ],
            [
                15418,
                15418
            ],
            [
                15418,
                15418
            ],
            [
                15418,
                15493
            ],
            [
                15493,
                15533
            ],
            [
                15533,
                15611
            ],
            [
                15611,
                15669
            ],
            [
                15669,
                15669
            ],
            [
                15669,
                15669
            ],
            [
                15669,
                15669
            ],
            [
                15669,
                15669
            ],
            [
                15669,
                15669
            ],
            [
                15669,
                15696
            ],
            [
                15696,
                15761
            ],
            [
                15761,
                15802
            ],
            [
                15802,
                15867
            ],
            [
                15867,
                15972
            ],
            [
                15972,
                16000
            ],
            [
                16000,
                16000
            ],
            [
                16000,
                16024
            ],
            [
                16024,
                16131
            ],
            [
                16131,
                16270
            ],
            [
                16270,
                16298
            ],
            [
                16298,
                16331
            ],
            [
                16331,
                16331
            ],
            [
                16331,
                16424
            ],
            [
                16424,
                16451
            ],
            [
                16451,
                16495
            ],
            [
                16495,
                16544
            ],
            [
                16544,
                16583
            ],
            [
                16583,
                16656
            ],
            [
                16656,
                16756
            ],
            [
                16756,
                16839
            ],
            [
                16839,
                16882
            ],
            [
                16882,
                16913
            ],
            [
                16913,
                16937
            ],
            [
                16937,
                16967
            ],
            [
                16967,
                17121
            ],
            [
                17121,
                17144
            ],
            [
                17144,
                17144
            ],
            [
                17144,
                17204
            ],
            [
                17204,
                17204
            ],
            [
                17204,
                17266
            ],
            [
                17266,
                17317
            ],
            [
                17317,
                17357
            ],
            [
                17357,
                17498
            ],
            [
                17498,
                17559
            ],
            [
                17559,
                17720
            ],
            [
                17720,
                17790
            ],
            [
                17790,
                17858
            ],
            [
                17858,
                18009
            ],
            [
                18009,
                18009
            ],
            [
                18009,
                18009
            ],
            [
                18009,
                18195
            ],
            [
                18195,
                18269
            ],
            [
                18269,
                18269
            ],
            [
                18269,
                18385
            ],
            [
                18385,
                18601
            ],
            [
                18601,
                18724
            ],
            [
                18724,
                18787
            ],
            [
                18787,
                18981
            ],
            [
                18981,
                19042
            ],
            [
                19042,
                19118
            ]
        ]
    }
}