{
    "original": {
        "text": "\"Within the soul a faculty abides, That with interpositions, which would hide And darken, so can deal, that they become Contingencies of pomp; and serve to exalt Her native brightness, as the ample moon, In the deep stillness of a summer even, Rising behind a thick and lofty grove, Burns, like an unconsuming fire of light, In the green trees; and, kindling on all sides Their leafy umbrage, turns the dusky veil Into a substance glorious as her own, Yea, with her own incorporated, by power Capacious and serene.\" --WORDSWORTH: _Excursion_, B. IV.\nDeronda came out of the narrow house at Chelsea in a frame of mind that made him long for some good bodily exercise to carry off what he was himself inclined to call the fumes of his temper. He was going toward the city, and the sight of the Chelsea Stairs with the waiting boats at once determined him to avoid the irritating inaction of being driven in a cab, by calling a wherry and taking an oar.\nHis errand was to go to Ram's book-shop, where he had yesterday arrived too late for Mordecai's midday watch, and had been told that he invariably came there again between five and six. Some further acquaintance with this remarkable inmate of the Cohens was particularly desired by Deronda as a preliminary to redeeming his ring: he wished that their conversation should not again end speedily with that drop of Mordecai's interest which was like the removal of a drawbridge, and threatened to shut out any easy communication in future. As he got warmed with the use of the oar, fixing his mind on the errand before him and the ends he wanted to achieve on Mirah's account, he experienced, as was wont with him, a quick change of mental light, shifting his point of view to that of the person whom he had been thinking of hitherto chiefly as serviceable to his own purposes, and was inclined to taunt himself with being not much better than an enlisting sergeant, who never troubles himself with the drama that brings him the needful recruits.\n\"I suppose if I got from this man the information I am most anxious about,\" thought Deronda, \"I should be contented enough if he felt no disposition to tell me more of himself, or why he seemed to have some expectation from me which was disappointed. The sort of curiosity he stirs would die out; and yet it might be that he had neared and parted as one can imagine two ships doing, each freighted with an exile who would have recognized the other if the two could have looked out face to face. Not that there is any likelihood of a peculiar tie between me and this poor fellow, whose voyage, I fancy, must soon be over. But I wonder whether there is much of that momentous mutual missing between people who interchange blank looks, or even long for one another's absence in a crowded place. However, one makes one's self chances of missing by going on the recruiting sergeant's plan.\"\nWhen the wherry was approaching Blackfriars Bridge, where Deronda meant to land, it was half-past four, and the gray day was dying gloriously, its western clouds all broken into narrowing purple strata before a wide-spreading saffron clearness, which in the sky had a monumental calm, but on the river, with its changing objects, was reflected as a luminous movement, the alternate flash of ripples or currents, the sudden glow of the brown sail, the passage of laden barges from blackness into color, making an active response to that brooding glory.\nFeeling well heated by this time, Deronda gave up the oar and drew over him again his Inverness cape. As he lifted up his head while fastening the topmost button his eyes caught a well-remembered face looking toward him over the parapet of the bridge--brought out by the western light into startling distinctness and brilliancy--an illuminated type of bodily emaciation and spiritual eagerness. It was the face of Mordecai, who also, in his watch toward the west, had caught sight of the advancing boat, and had kept it fast within his gaze, at first simply because it was advancing, then with a recovery of impressions that made him quiver as with a presentiment, till at last the nearing figure lifted up its face toward him--the face of his visions--and then immediately, with white uplifted hand, beckoned again and again.\nFor Deronda, anxious that Mordecai should recognize and await him, had lost no time before signaling, and the answer came straightway. Mordecai lifted his cap and waved it--feeling in that moment that his inward prophecy was fulfilled. Obstacles, incongruities, all melted into the sense of completion with which his soul was flooded by this outward satisfaction of his longing. His exultation was not widely different from that of the experimenter, bending over the first stirrings of change that correspond to what in the fervor of concentrated prevision his thought has foreshadowed. The prefigured friend had come from the golden background, and had signaled to him: this actually was: the rest was to be.\nIn three minutes Deronda had landed, had paid his boatman, and was joining Mordecai, whose instinct it was to stand perfectly still and wait for him.\n\"I was very glad to see you standing here,\" said Deronda, \"for I was intending to go on to the book-shop and look for you again. I was there yesterday--perhaps they mentioned it to you?\"\n\"Yes,\" said Mordecai; \"that was the reason I came to the bridge.\"\nThis answer, made with simple gravity, was startlingly mysterious to Deronda. Were the peculiarities of this man really associated with any sort of mental alienation, according to Cohen's hint?\n\"You knew nothing of my being at Chelsea?\" he said, after a moment.\n\"No; but I expected you to come down the river. I have been waiting for you these five years.\" Mordecai's deep-sunk eyes were fixed on those of the friend who had at last arrived with a look of affectionate dependence, at once pathetic and solemn. Deronda's sensitiveness was not the less responsive because he could not but believe that this strangely-disclosed relation was founded on an illusion.\n\"It will be a satisfaction to me if I can be of any real use to you,\" he answered, very earnestly. \"Shall we get into a cab and drive to--wherever you wish to go? You have probably had walking enough with your short breath.\"\n\"Let us go to the book-shop. It will soon be time for me to be there. But now look up the river,\" said Mordecai, turning again toward it and speaking in undertones of what may be called an excited calm--so absorbed by a sense of fulfillment that he was conscious of no barrier to a complete understanding between him and Deronda. \"See the sky, how it is slowly fading. I have always loved this bridge: I stood on it when I was a little boy. It is a meeting-place for the spiritual messengers. It is true--what the Masters said--that each order of things has its angel: that means the full message of each from what is afar. Here I have listened to the messages of earth and sky; when I was stronger I used to stay and watch for the stars in the deep heavens. But this time just about sunset was always what I loved best. It has sunk into me and dwelt with me--fading, slowly fading: it was my own decline: it paused--it waited, till at last it brought me my new life--my new self--who will live when this breath is all breathed out.\"\nDeronda did not speak. He felt himself strangely wrought upon. The first-prompted suspicion that Mordecai might be liable to hallucinations of thought--might have become a monomaniac on some subject which had given too severe a strain to his diseased organism--gave way to a more submissive expectancy. His nature was too large, too ready to conceive regions beyond his own experience, to rest at once in the easy explanation, \"madness,\" whenever a consciousness showed some fullness and conviction where his own was blank. It accorded with his habitual disposition that he should meet rather than resist any claim on him in the shape of another's need; and this claim brought with it a sense of solemnity which seemed a radiation from Mordecai, as utterly nullifying his outward poverty and lifting him into authority as if he had been that preternatural guide seen in the universal legend, who suddenly drops his mean disguise and stands a manifest Power. That impression was the more sanctioned by a sort of resolved quietude which the persuasion of fulfillment had produced in Mordecai's manner. After they had stood a moment in silence he said, \"Let us go now,\" and when they were riding he added, \"We will get down at the end of the street and walk to the shop. You can look at the books, and Mr. Ram will be going away directly and leave us alone.\"\nIt seemed that this enthusiast was just as cautious, just as much alive to judgments in other minds as if he had been that antipode of all enthusiasm called \"a man of the world.\"\nWhile they were rattling along in the cab, Mirah was still present with Deronda in the midst of this strange experience, but he foresaw that the course of conversation would be determined by Mordecai, not by himself: he was no longer confident what questions he should be able to ask; and with a reaction on his own mood, he inwardly said, \"I suppose I am in a state of complete superstition, just as if I were awaiting the destiny that could interpret the oracle. But some strong relation there must be between me and this man, since he feels it strongly. Great heaven! what relation has proved itself more potent in the world than faith even when mistaken--than expectation even when perpetually disappointed? Is my side of the relation to be disappointing or fulfilling?--well, if it is ever possible for me to fulfill I will not disappoint.\"\nIn ten minutes the two men, with as intense a consciousness as if they had been two undeclared lovers, felt themselves alone in the small gas-lit book-shop and turned face to face, each baring his head from an instinctive feeling that they wished to see each other fully. Mordecai came forward to lean his back against the little counter, while Deronda stood against the opposite wall hardly more than four feet off. I wish I could perpetuate those two faces, as Titian's \"Tribute Money\" has perpetuated two types presenting another sort of contrast. Imagine--we all of us can--the pathetic stamp of consumption with its brilliancy of glance to which the sharply-defined structure of features reminding one of a forsaken temple, give already a far-off look as of one getting unwillingly out of reach; and imagine it on a Jewish face naturally accentuated for the expression of an eager mind--the face of a man little above thirty, but with that age upon it which belongs to time lengthened by suffering, the hair and beard, still black, throwing out the yellow pallor of the skin, the difficult breathing giving more decided marking to the mobile nostril, the wasted yellow hands conspicuous on the folded arms: then give to the yearning consumptive glance something of the slowly dying mother's look, when her one loved son visits her bedside, and the flickering power of gladness leaps out as she says, \"My boy!\"--for the sense of spiritual perpetuation in another resembles that maternal transference of self.\nSeeing such a portrait you would see Mordecai. And opposite to him was a face not more distinctively oriental than many a type seen among what we call the Latin races; rich in youthful health, and with a forcible masculine gravity in its repose, that gave the value of judgment to the reverence with which he met the gaze of this mysterious son of poverty who claimed him as a long-expected friend. The more exquisite quality of Deronda's nature--that keenly perceptive sympathetic emotiveness which ran along with his speculative tendency--was never more thoroughly tested. He felt nothing that could be called belief in the validity of Mordecai's impressions concerning him or in the probability of any greatly effective issue: what he felt was a profound sensibility to a cry from the depths of another and accompanying that, the summons to be receptive instead of superciliously prejudging. Receptiveness is a rare and massive power, like fortitude; and this state of mind now gave Deronda's face its utmost expression of calm benignant force--an expression which nourished Mordecai's confidence and made an open way before him. He began to speak.\n\"You cannot know what has guided me to you and brought us together at this moment. You are wondering.\"\n\"I am not impatient,\" said Deronda. \"I am ready to listen to whatever you may wish to disclose.\"\n\"You see some of the reasons why I needed you,\" said Mordecai, speaking quietly, as if he wished to reserve his strength. \"You see that I am dying. You see that I am as one shut up behind bars by the wayside, who if he spoke to any would be met only by head-shaking and pity. The day is closing--the light is fading--soon we should not have been able to discern each other. But you have come in time.\"\n\"I rejoice that I am come in time,\" said Deronda, feelingly. He would not say, \"I hope you are not mistaken in me,\"--the very word \"mistaken,\" he thought, would be a cruelty at that moment.\n\"But the hidden reasons why I need you began afar off,\" said Mordecai; \"began in my early years when I was studying in another land. Then ideas, beloved ideas, came to me, because I was a Jew. They were a trust to fulfill, because I was a Jew. They were an inspiration, because I was a Jew, and felt the heart of my race beating within me. They were my life; I was not fully born till then. I counted this heart, and this breath, and this right hand\"--Mordecai had pathetically pressed his hand upon his breast, and then stretched its wasted fingers out before him--\"I counted my sleep and my waking, and the work I fed my body with, and the sights that fed my eyes--I counted them but as fuel to the divine flame. But I had done as one who wanders and engraves his thought in rocky solitudes, and before I could change my course came care and labor and disease, and blocked the way before me, and bound me with the iron that eats itself into the soul. Then I said, 'How shall I save the life within me from being stifled with this stifled breath?'\"\nMordecai paused to rest that poor breath which had been taxed by the rising excitement of his speech. And also he wished to check that excitement. Deronda dared not speak: the very silence in the narrow space seemed alive with mingled awe and compassion before this struggling fervor. And presently Mordecai went on:\n\"But you may misunderstand me. I speak not as an ignorant dreamer--as one bred up in the inland valleys, thinking ancient thoughts anew, and not knowing them ancient, never having stood by the great waters where the world's knowledge passes to and fro. English is my mother-tongue, England is the native land of this body, which is but as a breaking pot of earth around the fruit-bearing tree, whose seed might make the desert rejoice. But my true life was nourished in Holland at the feet of my mother's brother, a Rabbi skilled in special learning: and when he died I went to Hamburg to study, and afterwards to Gttingen, that I might take a larger outlook on my people, and on the Gentile world, and drank knowledge at all sources. I was a youth; I felt free; I saw our chief seats in Germany; I was not then in utter poverty. And I had possessed myself of a handicraft. For I said, I care not if my lot be as that of Joshua ben Chananja: after the last destruction he earned his bread by making needles, but in his youth he had been a singer on the steps of the Temple, and had a memory of what was before the glory departed. I said, let my body dwell in poverty, and my hands be as the hands of the toiler: but let my soul be as a temple of remembrance where the treasures of knowledge enter and the inner sanctuary is hope. I knew what I chose. They said, 'He feeds himself on visions,' and I denied not; for visions are the creators and feeders of the world. I see, I measure the world as it is, which the vision will create anew. You are not listening to one who raves aloof from the lives of his fellows.\"\nMordecai paused, and Deronda, feeling that the pause was expectant, said, \"Do me the justice to believe that I was not inclined to call your words raving. I listen that I may know, without prejudgment. I have had experience which gives me a keen interest in the story of a spiritual destiny embraced willingly, and embraced in youth.\"\n\"A spiritual destiny embraced willingly--in youth?\" Mordecai repeated in a corrective tone. \"It was the soul fully born within me, and it came in my boyhood. It brought its own world--a mediaeval world, where there are men who made the ancient language live again in new psalms of exile. They had absorbed the philosophy of the Gentile into the faith of the Jew, and they still yearned toward a center for our race. One of their souls was born again within me, and awakened amid the memories of their world. It traveled into Spain and Provence; it debated with Aben-Ezra; it took ship with Jehuda ha-Levi; it heard the roar of the Crusaders and the shrieks of tortured Israel. And when its dumb tongue was loosed, it spoke the speech they had made alive with the new blood of their ardor, their sorrow, and their martyred trust: it sang with the cadence of their strain.\"\nMordecai paused again, and then said in a loud, hoarse whisper,\n\"While it is imprisoned in me, it will never learn another.\"\n\"Have you written entirely in Hebrew, then?\" said Deronda, remembering with some anxiety the former question as to his own knowledge of that tongue.\n\"Yes--yes,\" said Mordecai, in a tone of deep sadness: \"in my youth I wandered toward that solitude, not feeling that it was a solitude. I had the ranks of the great dead around me; the martyrs gathered and listened. But soon I found that the living were deaf to me. At first I saw my life spread as a long future: I said part of my Jewish heritage is an unbreaking patience; part is skill to seek divers methods and find a rooting-place where the planters despair. But there came new messengers from the Eternal. I had to bow under the yoke that presses on the great multitude born of woman: family troubles called me--I had to work, to care, not for myself alone. I was left solitary again; but already the angel of death had turned to me and beckoned, and I felt his skirts continually on my path. I loosed not my effort. I besought hearing and help. I spoke; I went to men of our people--to the rich in influence or knowledge, to the rich in other wealth. But I found none to listen with understanding. I was rebuked for error; I was offered a small sum in charity. No wonder. I looked poor; I carried a bundle of Hebrew manuscript with me; I said, our chief teachers are misleading the hope of our race. Scholar and merchant were both too busy to listen. Scorn stood as interpreter between me and them. One said, 'The book of Mormon would never have answered in Hebrew; and if you mean to address our learned men, it is not likely you can teach them anything.' He touched a truth there.\"\nThe last words had a perceptible irony in their hoarsened tone.\n\"But though you had accustomed yourself to write in Hebrew, few, surely, can use English better,\" said Deronda, wanting to hint consolation in a new effort for which he could smooth the way.\nMordecai shook his head slowly, and answered,\n\"Too late--too late. I can write no more. My writing would be like this gasping breath. But the breath may wake the fount of pity--the writing not. If I could write now and used English, I should be as one who beats a board to summon those who have been used to no signal but a bell. My soul has an ear to hear the faults of its own speech. New writing of mine would be like this body\"--Mordecai spread his arms--\"within it there might be the Ruach-ha-kodesh--the breath of divine thought--but, men would smile at it and say, 'A poor Jew!' and the chief smilers would be of my own people.\"\nMordecai let his hands fall, and his head sink in melancholy: for the moment he had lost hold of his hope. Despondency, conjured up by his own words, had floated in and hovered above him with eclipsing wings. He had sunk into momentary darkness,\n\"I feel with you--I feel strongly with you,\" said Deronda, in a clear deep voice which was itself a cordial, apart from the words of sympathy. \"But forgive me if I speak hastily--for what you have actually written there need be no utter burial. The means of publication are within reach. If you will rely on me, I can assure you of all that is necessary to that end.\"\n\"That is not enough,\" said Mordecai, quickly, looking up again with the flash of recovered memory and confidence. \"That is not all my trust in you. You must be not only a hand to me, but a soul--believing my belief--being moved by my reasons--hoping my hope--seeing the vision I point to--beholding a glory where I behold it!\"--Mordecai had taken a step nearer as he spoke, and now laid his hand on Deronda's arm with a tight grasp; his face little more than a foot off had something like a pale flame in it--an intensity of reliance that acted as a peremptory claim, while he went on--\"You will be my life: it will be planted afresh; it will grow. You shall take the inheritance; it has been gathering for ages. The generations are crowding on my narrow life as a bridge: what has been and what is to be are meeting there; and the bridge is breaking. But I have found you. You have come in time. You will take the inheritance which the base son refuses because of the tombs which the plow and harrow may not pass over or the gold-seeker disturb: you will take the sacred inheritance of the Jew.\"\nDeronda had become as pallid as Mordecai. Quick as an alarm of flood or fire, there spread within him not only a compassionate dread of discouraging this fellowman who urged a prayer as one in the last agony, but also the opposing dread of fatally feeding an illusion, and being hurried on to a self-committal which might turn into a falsity. The peculiar appeal to his tenderness overcame the repulsion that most of us experience under a grasp and speech which assumed to dominate. The difficulty to him was to inflict the accents of hesitation and doubt on this ardent suffering creature, who was crowding too much of his brief being into a moment of perhaps extravagant trust. With exquisite instinct, Deronda, before he opened his lips, placed his palm gently on Mordecai's straining hand--an act just then equal to many speeches. And after that he said, without haste, as if conscious that he might be wrong,\n\"Do you forget what I told you when we first saw each other? Do you remember that I said I was not of your race?\"\n\"It can't be true,\" Mordecai whispered immediately, with no sign of shock. The sympathetic hand still upon him had fortified the feeling which was stronger than those words of denial. There was a perceptible pause, Deronda feeling it impossible to answer, conscious indeed that the assertion \"It can't be true\"--had the pressure of argument for him. Mordecai, too entirely possessed by the supreme importance of the relation between himself and Deronda to have any other care in his speech, followed up that assertion by a second, which came to his lips as a mere sequence of his long-cherished conviction--\"You are not sure of your own origin.\"\n\"How do you know that?\" said Daniel, with an habitual shrinking which made him remove his hands from Mordecai's, who also relaxed his hold, and fell back into his former leaning position.\n\"I know it--I know it; what is my life else?\" said Mordecai, with a low cry of impatience. \"Tell me everything: tell me why you deny.\"\nHe could have no conception what that demand was to the hearer--how probingly it touched the hidden sensibility, the vividly conscious reticence of years; how the uncertainty he was insisting on as part of his own hope had always for Daniel been a threatening possibility of painful revelation about his mother. But the moment had influences which were not only new but solemn to Deronda; any evasion here might turn out to be a hateful refusal of some task that belonged to him, some act of due fellowship; in any case it would be a cruel rebuff to a being who was appealing to him as a forlorn hope under the shadow of a coming doom. After a few moments, he said, with a great effort over himself--determined to tell all the truth briefly,\n\"I have never known my mother. I have no knowledge about her. I have never called any man father. But I am convinced that my father is an Englishman.\"\nDeronda's deep tones had a tremor in them as he uttered this confession; and all the while there was an undercurrent of amazement in him at the strange circumstances under which he uttered it. It seemed as if Mordecai were hardly overrating his own power to determine the action of the friend whom he had mysteriously chosen.\n\"It will be seen--it will be declared,\" said Mordecai, triumphantly. \"The world grows, and its frame is knit together by the growing soul; dim, dim at first, then clearer and more clear, the consciousness discerns remote stirrings. As thoughts move within us darkly, and shake us before they are fully discerned--so events--so beings: they are knit with us in the growth of the world. You have risen within me like a thought not fully spelled; my soul is shaken before the words are all there. The rest will come--it will come.\"\n\"We must not lose sight of the fact that the outward event has not always been a fulfillment of the firmest faith,\" said Deronda, in a tone that was made hesitating by the painfully conflicting desires, not to give any severe blow to Mordecai, and not to give his confidence a sanction which might have the severest of blows in reserve.\nMordecai's face, which had been illuminated to the utmost in that last declaration of his confidence, changed under Deronda's words, not only into any show of collapsed trust: the force did not disappear from the expression, but passed from the triumphant into the firmly resistant.\n\"You would remind me that I may be under an illusion--that the history of our people's trust has been full of illusion. I face it all.\" Here Mordecai paused a moment. Then bending his head a little forward, he said, in his hoarse whisper, \"_So it might be with my trust, if you would make it an illusion. But you will not._\"\nThe very sharpness with which these words penetrated Deronda made him feel the more that here was a crisis in which he must be firm.\n\"What my birth was does not lie in my will,\" he answered. \"My sense of claims on me cannot be independent of my knowledge there. And I cannot promise you that I will try to hasten a disclosure. Feelings which have struck root through half my life may still hinder me from doing what I have never been able to do. Everything must be waited for. I must know more of the truth about my own life, and I must know more of what it would become if it were made a part of yours.\"\nMordecai had folded his arms again while Deronda was speaking, and now answered with equal firmness, though with difficult breathing,\n\"You _shall_ know. What are we met for, but that you should know. Your doubts lie as light as dust on my belief. I know the philosophies of this time and of other times; if I chose I could answer a summons before their tribunals. I could silence the beliefs which are the mother-tongue of my soul and speak with the rote-learned language of a system, that gives you the spelling of all things, sure of its alphabet covering them all. I could silence them: may not a man silence his awe or his love, and take to finding reasons, which others demand? But if his love lies deeper than any reasons to be found? Man finds his pathways: at first they were foot tracks, as those of the beast in the wilderness: now they are swift and invisible: his thought dives through the ocean, and his wishes thread the air: has he found all the pathways yet? What reaches him, stays with him, rules him: he must accept it, not knowing its pathway. Say, my expectation of you has grown but as false hopes grow. That doubt is in your mind? Well, my expectation was there, and you are come. Men have died of thirst. But I was thirsty, and the water is on my lips! What are doubts to me? In the hour when you come to me and say, 'I reject your soul: I know that I am not a Jew: we have no lot in common'--I shall not doubt. I shall be certain--certain that I have been deluded. That hour will never come!\"\nDeronda felt a new chord sounding in his speech: it was rather imperious than appealing--had more of conscious power than of the yearning need which had acted as a beseeching grasp on him before. And usually, though he was the reverse of pugnacious, such a change of attitude toward him would have weakened his inclination to admit a claim. But here there was something that balanced his resistance and kept it aloof. This strong man whose gaze was sustainedly calm and his finger-nails pink with health, who was exercised in all questioning, and accused of excessive mental independence, still felt a subduing influence over him in the tenacious certitude of the fragile creature before him, whose pallid yellow nostril was tense with effort as his breath labored under the burthen of eager speech. The influence seemed to strengthen the bond of sympathetic obligation. In Deronda at this moment the desire to escape what might turn into a trying embarrassment was no more likely to determine action than the solicitations of indolence are likely to determine it in one with whom industry is a daily law. He answered simply,\n\"It is my wish to meet and satisfy your wishes wherever that is possible to me. It is certain to me at least that I desire not to undervalue your toil and your suffering. Let me know your thoughts. But where can we meet?\"\n\"I have thought of that,\" said Mordecai. \"It is not hard for you to come into this neighborhood later in the evening? You did so once.\"\n\"I can manage it very well occasionally,\" said Deronda. \"You live under the same roof with the Cohens, I think?\"\nBefore Mordecai could answer, Mr. Ram re-entered to take his place behind the counter. He was an elderly son of Abraham, whose childhood had fallen on the evil times at the beginning of this century, and who remained amid this smart and instructed generation as a preserved specimen, soaked through and through with the effect of the poverty and contempt which were the common heritage of most English Jews seventy years ago. He had none of the oily cheerfulness observable in Mr. Cohen's aspect: his very features--broad and chubby--showed that tendency to look mongrel without due cause, which, in a miscellaneous London neighborhood, may perhaps be compared with the marvels of imitation in insects, and may have been nature's imperfect effort on behalf of the pure Caucasian to shield him from the shame and spitting to which purer features would have been exposed in the times of zeal. Mr. Ram dealt ably in books, in the same way that he would have dealt in tins of meat and other commodities--without knowledge or responsibility as to the proportion of rottenness or nourishment they might contain. But he believed in Mordecai's learning as something marvellous, and was not sorry that his conversation should be sought by a bookish gentleman, whose visits had twice ended in a purchase. He greeted Deronda with a crabbed good-will, and, putting on large silver spectacles, appeared at once to abstract himself in the daily accounts.\nBut Deronda and Mordecai were soon in the street together, and without any explicit agreement as to their direction, were walking toward Ezra Cohen's.\n\"We can't meet there: my room is too narrow,\" said Mordecai, taking up the thread of talk where they had dropped it. \"But there is a tavern not far from here where I sometimes go to a club. It is the _Hand and Banner_, in the street at the next turning, five doors down. We can have the parlor there any evening.\"\n\"We can try that for once,\" said Deronda. \"But you will perhaps let me provide you with some lodging, which would give you more freedom and comfort than where you are.\"\n\"No; I need nothing. My outer life is as nought. I will take nothing less precious from you than your soul's brotherhood. I will think of nothing else yet. But I am glad you are rich. You did not need money on that diamond ring. You had some other motive for bringing it.\"\nDeronda was a little startled by this clear-sightedness; but before he could reply Mordecai added--\"it is all one. Had you been in need of the money, the great end would have been that we should meet again. But you are rich?\" he ended, in a tone of interrogation.\n\"Not rich, except in the sense that every one is rich who has more than he needs for himself.\"\n\"I desired that your life should be free,\" said Mordecai, dreamily--\"mine has been a bondage.\"\nIt was clear that he had no interest in the fact of Deronda's appearance at the Cohens' beyond its relation to his own ideal purpose. Despairing of leading easily up to the question he wished to ask, Deronda determined to put it abruptly, and said,\n\"Can you tell me why Mrs. Cohen, the mother, must not be spoken to about her daughter?\"\nThere was no immediate answer, and he thought that he should have to repeat the question. The fact was that Mordecai had heard the words, but had to drag his mind to a new subject away from his passionate preoccupation. After a few moments, he replied with a careful effort such as he would have used if he had been asked the road to Holborn:\n\"I know the reason. But I will not speak even of trivial family affairs which I have heard in the privacy of the family. I dwell in their tent as in a sanctuary. Their history, so far as they injure none other, is their own possession.\"\nDeronda felt the blood mounting to his cheeks as a sort of rebuke he was little used to, and he also found himself painfully baffled where he had reckoned with some confidence on getting decisive knowledge. He became the more conscious of emotional strain from the excitements of the day; and although he had the money in his pocket to redeem his ring, he recoiled from the further task of a visit to the Cohens', which must be made not only under the former uncertainty, but under a new disappointment as to the possibility of its removal.\n\"I will part from you now,\" he said, just before they could reach Cohen's door; and Mordecai paused, looking up at him with an anxious fatigued face under the gaslight.\n\"When will you come back?\" he said, with slow emphasis.\n\"May I leave that unfixed? May I ask for you at the Cohens' any evening after your hour at the book-shop? There is no objection, I suppose, to their knowing that you and I meet in private?\"\n\"None,\" said Mordecai. \"But the days I wait now are longer than the years of my strength. Life shrinks: what was but a tithe is now the half. My hope abides in you.\"\n\"I will be faithful,\" said Deronda--he could not have left those words unuttered. \"I will come the first evening I can after seven: on Saturday or Monday, if possible. Trust me.\"\nHe put out his ungloved hand. Mordecai, clasping it eagerly, seemed to feel a new instreaming of confidence, and he said with some recovered energy--\"This is come to pass, and the rest will come.\"\nThat was their good-by.",
        "paragraph_chars": [
            [
                0,
                550
            ],
            [
                550,
                951
            ],
            [
                951,
                1995
            ],
            [
                1995,
                2881
            ],
            [
                2881,
                3433
            ],
            [
                3433,
                4260
            ],
            [
                4260,
                4970
            ],
            [
                4970,
                5120
            ],
            [
                5120,
                5307
            ],
            [
                5307,
                5373
            ],
            [
                5373,
                5567
            ],
            [
                5567,
                5635
            ],
            [
                5635,
                6035
            ],
            [
                6035,
                6260
            ],
            [
                6260,
                7294
            ],
            [
                7294,
                8650
            ],
            [
                8650,
                8829
            ],
            [
                8829,
                9675
            ],
            [
                9675,
                11188
            ],
            [
                11188,
                12340
            ],
            [
                12340,
                12443
            ],
            [
                12443,
                12540
            ],
            [
                12540,
                12942
            ],
            [
                12942,
                13132
            ],
            [
                13132,
                14182
            ],
            [
                14182,
                14499
            ],
            [
                14499,
                16114
            ],
            [
                16114,
                16449
            ],
            [
                16449,
                17321
            ],
            [
                17321,
                17385
            ],
            [
                17385,
                17446
            ],
            [
                17446,
                17595
            ],
            [
                17595,
                19087
            ],
            [
                19087,
                19151
            ],
            [
                19151,
                19342
            ],
            [
                19342,
                19388
            ],
            [
                19388,
                19978
            ],
            [
                19978,
                20224
            ],
            [
                20224,
                20592
            ],
            [
                20592,
                21689
            ],
            [
                21689,
                22603
            ],
            [
                22603,
                22717
            ],
            [
                22717,
                23363
            ],
            [
                23363,
                23551
            ],
            [
                23551,
                23686
            ],
            [
                23686,
                24428
            ],
            [
                24428,
                24579
            ],
            [
                24579,
                24905
            ],
            [
                24905,
                25434
            ],
            [
                25434,
                25771
            ],
            [
                25771,
                26054
            ],
            [
                26054,
                26379
            ],
            [
                26379,
                26512
            ],
            [
                26512,
                26984
            ],
            [
                26984,
                27118
            ],
            [
                27118,
                28502
            ],
            [
                28502,
                29628
            ],
            [
                29628,
                29850
            ],
            [
                29850,
                29986
            ],
            [
                29986,
                30099
            ],
            [
                30099,
                31540
            ],
            [
                31540,
                31691
            ],
            [
                31691,
                32005
            ],
            [
                32005,
                32174
            ],
            [
                32174,
                32447
            ],
            [
                32447,
                32711
            ],
            [
                32711,
                32806
            ],
            [
                32806,
                32901
            ],
            [
                32901,
                33150
            ],
            [
                33150,
                33238
            ],
            [
                33238,
                33581
            ],
            [
                33581,
                33818
            ],
            [
                33818,
                34359
            ],
            [
                34359,
                34528
            ],
            [
                34528,
                34584
            ],
            [
                34584,
                34774
            ],
            [
                34774,
                34940
            ],
            [
                34940,
                35119
            ],
            [
                35119,
                35316
            ],
            [
                35316,
                35339
            ]
        ],
        "segment_chars": [
            [
                0,
                516
            ],
            [
                516,
                550
            ],
            [
                550,
                741
            ],
            [
                741,
                951
            ],
            [
                951,
                1137
            ],
            [
                1137,
                1488
            ],
            [
                1488,
                1995
            ],
            [
                1995,
                2246
            ],
            [
                2246,
                2490
            ],
            [
                2490,
                2616
            ],
            [
                2616,
                2787
            ],
            [
                2787,
                2881
            ],
            [
                2881,
                3433
            ],
            [
                3433,
                3535
            ],
            [
                3535,
                3828
            ],
            [
                3828,
                4260
            ],
            [
                4260,
                4395
            ],
            [
                4395,
                4496
            ],
            [
                4496,
                4639
            ],
            [
                4639,
                4847
            ],
            [
                4847,
                4970
            ],
            [
                4970,
                5120
            ],
            [
                5120,
                5249
            ],
            [
                5249,
                5307
            ],
            [
                5307,
                5373
            ],
            [
                5373,
                5451
            ],
            [
                5451,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5683
            ],
            [
                5683,
                5730
            ],
            [
                5730,
                5883
            ],
            [
                5883,
                6035
            ],
            [
                6035,
                6134
            ],
            [
                6134,
                6198
            ],
            [
                6198,
                6260
            ],
            [
                6260,
                6289
            ],
            [
                6289,
                6330
            ],
            [
                6330,
                6590
            ],
            [
                6590,
                6629
            ],
            [
                6629,
                6701
            ],
            [
                6701,
                6753
            ],
            [
                6753,
                6884
            ],
            [
                6884,
                7019
            ],
            [
                7019,
                7081
            ],
            [
                7081,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7357
            ],
            [
                7357,
                7597
            ],
            [
                7597,
                7818
            ],
            [
                7818,
                8252
            ],
            [
                8252,
                8394
            ],
            [
                8394,
                8562
            ],
            [
                8562,
                8650
            ],
            [
                8650,
                8829
            ],
            [
                8829,
                9294
            ],
            [
                9294,
                9386
            ],
            [
                9386,
                9400
            ],
            [
                9400,
                9541
            ],
            [
                9541,
                9675
            ],
            [
                9675,
                9947
            ],
            [
                9947,
                10092
            ],
            [
                10092,
                10226
            ],
            [
                10226,
                11089
            ],
            [
                11089,
                11188
            ],
            [
                11188,
                11235
            ],
            [
                11235,
                11587
            ],
            [
                11587,
                11763
            ],
            [
                11763,
                12083
            ],
            [
                12083,
                12321
            ],
            [
                12321,
                12340
            ],
            [
                12340,
                12423
            ],
            [
                12423,
                12443
            ],
            [
                12443,
                12479
            ],
            [
                12479,
                12540
            ],
            [
                12540,
                12662
            ],
            [
                12662,
                12688
            ],
            [
                12688,
                12816
            ],
            [
                12816,
                12914
            ],
            [
                12914,
                12942
            ],
            [
                12942,
                13003
            ],
            [
                13003,
                13132
            ],
            [
                13132,
                13265
            ],
            [
                13265,
                13325
            ],
            [
                13325,
                13376
            ],
            [
                13376,
                13472
            ],
            [
                13472,
                13523
            ],
            [
                13523,
                13847
            ],
            [
                13847,
                14085
            ],
            [
                14085,
                14182
            ],
            [
                14182,
                14284
            ],
            [
                14284,
                14329
            ],
            [
                14329,
                14467
            ],
            [
                14467,
                14499
            ],
            [
                14499,
                14530
            ],
            [
                14530,
                14752
            ],
            [
                14752,
                14935
            ],
            [
                14935,
                15234
            ],
            [
                15234,
                15329
            ],
            [
                15329,
                15373
            ],
            [
                15373,
                15629
            ],
            [
                15629,
                15829
            ],
            [
                15829,
                15850
            ],
            [
                15850,
                15965
            ],
            [
                15965,
                16037
            ],
            [
                16037,
                16114
            ],
            [
                16114,
                16269
            ],
            [
                16269,
                16316
            ],
            [
                16316,
                16449
            ],
            [
                16449,
                16501
            ],
            [
                16501,
                16541
            ],
            [
                16541,
                16607
            ],
            [
                16607,
                16737
            ],
            [
                16737,
                16865
            ],
            [
                16865,
                16957
            ],
            [
                16957,
                17126
            ],
            [
                17126,
                17321
            ],
            [
                17321,
                17385
            ],
            [
                17385,
                17446
            ],
            [
                17446,
                17491
            ],
            [
                17491,
                17595
            ],
            [
                17595,
                17731
            ],
            [
                17731,
                17811
            ],
            [
                17811,
                17861
            ],
            [
                17861,
                18060
            ],
            [
                18060,
                18108
            ],
            [
                18108,
                18260
            ],
            [
                18260,
                18395
            ],
            [
                18395,
                18419
            ],
            [
                18419,
                18448
            ],
            [
                18448,
                18554
            ],
            [
                18554,
                18601
            ],
            [
                18601,
                18664
            ],
            [
                18664,
                18675
            ],
            [
                18675,
                18803
            ],
            [
                18803,
                18854
            ],
            [
                18854,
                18902
            ],
            [
                18902,
                19060
            ],
            [
                19060,
                19087
            ],
            [
                19087,
                19151
            ],
            [
                19151,
                19342
            ],
            [
                19342,
                19388
            ],
            [
                19388,
                19409
            ],
            [
                19409,
                19430
            ],
            [
                19430,
                19476
            ],
            [
                19476,
                19536
            ],
            [
                19536,
                19672
            ],
            [
                19672,
                19729
            ],
            [
                19729,
                19928
            ],
            [
                19928,
                19978
            ],
            [
                19978,
                20085
            ],
            [
                20085,
                20187
            ],
            [
                20187,
                20224
            ],
            [
                20224,
                20367
            ],
            [
                20367,
                20469
            ],
            [
                20469,
                20512
            ],
            [
                20512,
                20592
            ],
            [
                20592,
                20706
            ],
            [
                20706,
                20740
            ],
            [
                20740,
                20918
            ],
            [
                20918,
                21241
            ],
            [
                21241,
                21305
            ],
            [
                21305,
                21444
            ],
            [
                21444,
                21466
            ],
            [
                21466,
                21489
            ],
            [
                21489,
                21689
            ],
            [
                21689,
                21731
            ],
            [
                21731,
                22032
            ],
            [
                22032,
                22172
            ],
            [
                22172,
                22369
            ],
            [
                22369,
                22524
            ],
            [
                22524,
                22603
            ],
            [
                22603,
                22664
            ],
            [
                22664,
                22717
            ],
            [
                22717,
                22792
            ],
            [
                22792,
                22901
            ],
            [
                22901,
                23067
            ],
            [
                23067,
                23363
            ],
            [
                23363,
                23387
            ],
            [
                23387,
                23551
            ],
            [
                23551,
                23597
            ],
            [
                23597,
                23642
            ],
            [
                23642,
                23686
            ],
            [
                23686,
                23998
            ],
            [
                23998,
                24322
            ],
            [
                24322,
                24428
            ],
            [
                24428,
                24459
            ],
            [
                24459,
                24490
            ],
            [
                24490,
                24526
            ],
            [
                24526,
                24579
            ],
            [
                24579,
                24772
            ],
            [
                24772,
                24905
            ],
            [
                24905,
                24974
            ],
            [
                24974,
                25137
            ],
            [
                25137,
                25290
            ],
            [
                25290,
                25399
            ],
            [
                25399,
                25434
            ],
            [
                25434,
                25771
            ],
            [
                25771,
                26054
            ],
            [
                26054,
                26174
            ],
            [
                26174,
                26190
            ],
            [
                26190,
                26221
            ],
            [
                26221,
                26359
            ],
            [
                26359,
                26379
            ],
            [
                26379,
                26512
            ],
            [
                26512,
                26570
            ],
            [
                26570,
                26641
            ],
            [
                26641,
                26706
            ],
            [
                26706,
                26825
            ],
            [
                26825,
                26856
            ],
            [
                26856,
                26984
            ],
            [
                26984,
                27118
            ],
            [
                27118,
                27137
            ],
            [
                27137,
                27184
            ],
            [
                27184,
                27231
            ],
            [
                27231,
                27348
            ],
            [
                27348,
                27552
            ],
            [
                27552,
                27667
            ],
            [
                27667,
                27725
            ],
            [
                27725,
                27959
            ],
            [
                27959,
                28048
            ],
            [
                28048,
                28110
            ],
            [
                28110,
                28138
            ],
            [
                28138,
                28188
            ],
            [
                28188,
                28213
            ],
            [
                28213,
                28261
            ],
            [
                28261,
                28284
            ],
            [
                28284,
                28420
            ],
            [
                28420,
                28474
            ],
            [
                28474,
                28502
            ],
            [
                28502,
                28698
            ],
            [
                28698,
                28843
            ],
            [
                28843,
                28920
            ],
            [
                28920,
                29302
            ],
            [
                29302,
                29373
            ],
            [
                29373,
                29608
            ],
            [
                29608,
                29628
            ],
            [
                29628,
                29708
            ],
            [
                29708,
                29799
            ],
            [
                29799,
                29826
            ],
            [
                29826,
                29850
            ],
            [
                29850,
                29891
            ],
            [
                29891,
                29968
            ],
            [
                29968,
                29986
            ],
            [
                29986,
                30042
            ],
            [
                30042,
                30099
            ],
            [
                30099,
                30186
            ],
            [
                30186,
                30525
            ],
            [
                30525,
                30990
            ],
            [
                30990,
                31205
            ],
            [
                31205,
                31394
            ],
            [
                31394,
                31540
            ],
            [
                31540,
                31691
            ],
            [
                31691,
                31808
            ],
            [
                31808,
                31881
            ],
            [
                31881,
                31962
            ],
            [
                31962,
                32005
            ],
            [
                32005,
                32047
            ],
            [
                32047,
                32174
            ],
            [
                32174,
                32195
            ],
            [
                32195,
                32223
            ],
            [
                32223,
                32296
            ],
            [
                32296,
                32330
            ],
            [
                32330,
                32358
            ],
            [
                32358,
                32403
            ],
            [
                32403,
                32447
            ],
            [
                32447,
                32562
            ],
            [
                32562,
                32654
            ],
            [
                32654,
                32673
            ],
            [
                32673,
                32711
            ],
            [
                32711,
                32806
            ],
            [
                32806,
                32901
            ],
            [
                32901,
                33035
            ],
            [
                33035,
                33150
            ],
            [
                33150,
                33238
            ],
            [
                33238,
                33328
            ],
            [
                33328,
                33458
            ],
            [
                33458,
                33581
            ],
            [
                33581,
                33601
            ],
            [
                33601,
                33702
            ],
            [
                33702,
                33743
            ],
            [
                33743,
                33818
            ],
            [
                33818,
                34025
            ],
            [
                34025,
                34359
            ],
            [
                34359,
                34528
            ],
            [
                34528,
                34555
            ],
            [
                34555,
                34584
            ],
            [
                34584,
                34611
            ],
            [
                34611,
                34690
            ],
            [
                34690,
                34774
            ],
            [
                34774,
                34797
            ],
            [
                34797,
                34864
            ],
            [
                34864,
                34916
            ],
            [
                34916,
                34940
            ],
            [
                34940,
                35022
            ],
            [
                35022,
                35108
            ],
            [
                35108,
                35119
            ],
            [
                35119,
                35149
            ],
            [
                35149,
                35316
            ],
            [
                35316,
                35339
            ]
        ],
        "overlap_chars": [
            [
                550,
                573
            ],
            [
                581,
                597
            ],
            [
                636,
                644
            ],
            [
                650,
                668
            ],
            [
                729,
                741
            ],
            [
                775,
                791
            ],
            [
                816,
                829
            ],
            [
                812,
                815
            ],
            [
                830,
                852
            ],
            [
                853,
                855
            ],
            [
                761,
                769
            ],
            [
                907,
                911
            ],
            [
                912,
                951
            ],
            [
                951,
                1086
            ],
            [
                1103,
                1108
            ],
            [
                1115,
                1137
            ],
            [
                1233,
                1240
            ],
            [
                1142,
                1149
            ],
            [
                1302,
                1314
            ],
            [
                1163,
                1204
            ],
            [
                1261,
                1301
            ],
            [
                1315,
                1425
            ],
            [
                1486,
                1488
            ],
            [
                1488,
                1493
            ],
            [
                1521,
                1529
            ],
            [
                1761,
                1772
            ],
            [
                1623,
                1639
            ],
            [
                1808,
                1811
            ],
            [
                1671,
                1743
            ],
            [
                1915,
                1918
            ],
            [
                1644,
                1647
            ],
            [
                1537,
                1545
            ],
            [
                1993,
                1995
            ],
            [
                1995,
                1996
            ],
            [
                2006,
                2014
            ],
            [
                2033,
                2044
            ],
            [
                2063,
                2068
            ],
            [
                2015,
                2019
            ],
            [
                2068,
                2108
            ],
            [
                2118,
                2123
            ],
            [
                2147,
                2159
            ],
            [
                2163,
                2246
            ],
            [
                2258,
                2267
            ],
            [
                2277,
                2286
            ],
            [
                2290,
                2316
            ],
            [
                2320,
                2341
            ],
            [
                2361,
                2370
            ],
            [
                2376,
                2382
            ],
            [
                2398,
                2453
            ],
            [
                2488,
                2490
            ],
            [
                2561,
                2572
            ],
            [
                2580,
                2614
            ],
            [
                2881,
                2983
            ],
            [
                2989,
                2992
            ],
            [
                2998,
                3042
            ],
            [
                3047,
                3182
            ],
            [
                3211,
                3238
            ],
            [
                2983,
                2984
            ],
            [
                3272,
                3273
            ],
            [
                3239,
                3247
            ],
            [
                3431,
                3433
            ],
            [
                3467,
                3490
            ],
            [
                3515,
                3535
            ],
            [
                3535,
                3547
            ],
            [
                3551,
                3579
            ],
            [
                3588,
                3594
            ],
            [
                3595,
                3683
            ],
            [
                3782,
                3784
            ],
            [
                3792,
                3796
            ],
            [
                3817,
                3826
            ],
            [
                3765,
                3776
            ],
            [
                3697,
                3760
            ],
            [
                3826,
                3828
            ],
            [
                3828,
                3860
            ],
            [
                3867,
                3952
            ],
            [
                3958,
                4028
            ],
            [
                4067,
                4069
            ],
            [
                4084,
                4139
            ],
            [
                4161,
                4184
            ],
            [
                4186,
                4260
            ],
            [
                4260,
                4330
            ],
            [
                4360,
                4395
            ],
            [
                4395,
                4403
            ],
            [
                4423,
                4428
            ],
            [
                4411,
                4418
            ],
            [
                4441,
                4464
            ],
            [
                4472,
                4496
            ],
            [
                4496,
                4505
            ],
            [
                4522,
                4561
            ],
            [
                4567,
                4572
            ],
            [
                4586,
                4593
            ],
            [
                4573,
                4581
            ],
            [
                4637,
                4639
            ],
            [
                4847,
                4913
            ],
            [
                4923,
                4970
            ],
            [
                4970,
                5054
            ],
            [
                5086,
                5101
            ],
            [
                5077,
                5079
            ],
            [
                5106,
                5120
            ],
            [
                5120,
                5147
            ],
            [
                5157,
                5204
            ],
            [
                5208,
                5249
            ],
            [
                5249,
                5270
            ],
            [
                5272,
                5284
            ],
            [
                5301,
                5307
            ],
            [
                5307,
                5373
            ],
            [
                5373,
                5451
            ],
            [
                5477,
                5492
            ],
            [
                5538,
                5539
            ],
            [
                5553,
                5558
            ],
            [
                5565,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5683
            ],
            [
                5683,
                5730
            ],
            [
                5730,
                5883
            ],
            [
                5883,
                5890
            ],
            [
                5915,
                5918
            ],
            [
                6019,
                6033
            ],
            [
                5943,
                5959
            ],
            [
                6033,
                6035
            ],
            [
                6035,
                6036
            ],
            [
                6039,
                6046
            ],
            [
                6068,
                6134
            ],
            [
                6134,
                6171
            ],
            [
                6182,
                6198
            ],
            [
                6198,
                6234
            ],
            [
                6257,
                6260
            ],
            [
                6260,
                6289
            ],
            [
                6330,
                6372
            ],
            [
                6401,
                6409
            ],
            [
                6427,
                6461
            ],
            [
                6463,
                6488
            ],
            [
                6501,
                6508
            ],
            [
                6526,
                6590
            ],
            [
                6590,
                6629
            ],
            [
                6629,
                6661
            ],
            [
                6701,
                6753
            ],
            [
                6884,
                7019
            ],
            [
                7019,
                7022
            ],
            [
                7044,
                7081
            ],
            [
                7081,
                7118
            ],
            [
                7135,
                7141
            ],
            [
                7126,
                7127
            ],
            [
                7150,
                7175
            ],
            [
                7177,
                7226
            ],
            [
                7228,
                7239
            ],
            [
                7241,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7342
            ],
            [
                7355,
                7357
            ],
            [
                7361,
                7366
            ],
            [
                7376,
                7433
            ],
            [
                7480,
                7502
            ],
            [
                7366,
                7367
            ],
            [
                7532,
                7544
            ],
            [
                7560,
                7568
            ],
            [
                7574,
                7597
            ],
            [
                7601,
                7621
            ],
            [
                7778,
                7781
            ],
            [
                7680,
                7687
            ],
            [
                7696,
                7729
            ],
            [
                7865,
                7867
            ],
            [
                7880,
                7886
            ],
            [
                7875,
                7879
            ],
            [
                7887,
                7951
            ],
            [
                8164,
                8167
            ],
            [
                7990,
                7999
            ],
            [
                7987,
                7989
            ],
            [
                7952,
                7962
            ],
            [
                8030,
                8038
            ],
            [
                8098,
                8112
            ],
            [
                8038,
                8039
            ],
            [
                7979,
                7980
            ],
            [
                8150,
                8155
            ],
            [
                8186,
                8233
            ],
            [
                8040,
                8042
            ],
            [
                8013,
                8014
            ],
            [
                8245,
                8250
            ],
            [
                8184,
                8185
            ],
            [
                8082,
                8085
            ],
            [
                8305,
                8313
            ],
            [
                8250,
                8251
            ],
            [
                8394,
                8434
            ],
            [
                8438,
                8442
            ],
            [
                8444,
                8479
            ],
            [
                8487,
                8562
            ],
            [
                8562,
                8614
            ],
            [
                8620,
                8649
            ],
            [
                8650,
                8664
            ],
            [
                8756,
                8758
            ],
            [
                8681,
                8684
            ],
            [
                8716,
                8749
            ],
            [
                8870,
                8871
            ],
            [
                8901,
                8908
            ],
            [
                9030,
                9033
            ],
            [
                8872,
                8877
            ],
            [
                9044,
                9045
            ],
            [
                8950,
                8953
            ],
            [
                9046,
                9097
            ],
            [
                9109,
                9117
            ],
            [
                9163,
                9167
            ],
            [
                9154,
                9162
            ],
            [
                9167,
                9189
            ],
            [
                9208,
                9215
            ],
            [
                9190,
                9195
            ],
            [
                8948,
                8949
            ],
            [
                9227,
                9252
            ],
            [
                8922,
                8924
            ],
            [
                9286,
                9294
            ],
            [
                9294,
                9297
            ],
            [
                9319,
                9332
            ],
            [
                9298,
                9318
            ],
            [
                9333,
                9386
            ],
            [
                9386,
                9400
            ],
            [
                9400,
                9413
            ],
            [
                9432,
                9443
            ],
            [
                9457,
                9467
            ],
            [
                9468,
                9486
            ],
            [
                9539,
                9541
            ],
            [
                9544,
                9546
            ],
            [
                9588,
                9590
            ],
            [
                9601,
                9602
            ],
            [
                9604,
                9609
            ],
            [
                9651,
                9672
            ],
            [
                9610,
                9612
            ],
            [
                9624,
                9632
            ],
            [
                9672,
                9675
            ],
            [
                9675,
                9737
            ],
            [
                9755,
                9777
            ],
            [
                9783,
                9876
            ],
            [
                9922,
                9946
            ],
            [
                10226,
                10233
            ],
            [
                10253,
                10316
            ],
            [
                10330,
                10345
            ],
            [
                10359,
                10367
            ],
            [
                10402,
                10403
            ],
            [
                10417,
                10493
            ],
            [
                10552,
                10560
            ],
            [
                10496,
                10507
            ],
            [
                10567,
                10609
            ],
            [
                10665,
                10682
            ],
            [
                10705,
                10710
            ],
            [
                10683,
                10697
            ],
            [
                10725,
                10754
            ],
            [
                10756,
                10779
            ],
            [
                10829,
                10854
            ],
            [
                10885,
                10948
            ],
            [
                10956,
                11089
            ],
            [
                11188,
                11235
            ],
            [
                11235,
                11247
            ],
            [
                11251,
                11307
            ],
            [
                11454,
                11456
            ],
            [
                11339,
                11433
            ],
            [
                11497,
                11586
            ],
            [
                11617,
                11626
            ],
            [
                11640,
                11657
            ],
            [
                11729,
                11763
            ],
            [
                11763,
                11765
            ],
            [
                11807,
                11863
            ],
            [
                11916,
                11945
            ],
            [
                11958,
                11993
            ],
            [
                12015,
                12016
            ],
            [
                11994,
                11997
            ],
            [
                11870,
                11873
            ],
            [
                12029,
                12044
            ],
            [
                12071,
                12077
            ],
            [
                12081,
                12083
            ],
            [
                12083,
                12188
            ],
            [
                12214,
                12234
            ],
            [
                12250,
                12287
            ],
            [
                12319,
                12321
            ],
            [
                12321,
                12340
            ],
            [
                12340,
                12344
            ],
            [
                12357,
                12421
            ],
            [
                12443,
                12479
            ],
            [
                12479,
                12500
            ],
            [
                12537,
                12540
            ],
            [
                12540,
                12620
            ],
            [
                12637,
                12662
            ],
            [
                12662,
                12688
            ],
            [
                12816,
                12834
            ],
            [
                12836,
                12855
            ],
            [
                12857,
                12914
            ],
            [
                12914,
                12942
            ],
            [
                12942,
                12990
            ],
            [
                13001,
                13003
            ],
            [
                13003,
                13055
            ],
            [
                13085,
                13095
            ],
            [
                13119,
                13123
            ],
            [
                13097,
                13105
            ],
            [
                13130,
                13132
            ],
            [
                13132,
                13265
            ],
            [
                13265,
                13269
            ],
            [
                13277,
                13290
            ],
            [
                13292,
                13325
            ],
            [
                13376,
                13426
            ],
            [
                13427,
                13472
            ],
            [
                13472,
                13523
            ],
            [
                13523,
                13581
            ],
            [
                13584,
                13592
            ],
            [
                13597,
                13609
            ],
            [
                13653,
                13662
            ],
            [
                13682,
                13685
            ],
            [
                13618,
                13621
            ],
            [
                13667,
                13681
            ],
            [
                13698,
                13731
            ],
            [
                13814,
                13847
            ],
            [
                13847,
                13850
            ],
            [
                13967,
                13975
            ],
            [
                13982,
                13993
            ],
            [
                13962,
                13966
            ],
            [
                13993,
                14006
            ],
            [
                13952,
                13954
            ],
            [
                14011,
                14014
            ],
            [
                14024,
                14062
            ],
            [
                14070,
                14085
            ],
            [
                14085,
                14153
            ],
            [
                14178,
                14182
            ],
            [
                14182,
                14205
            ],
            [
                14284,
                14287
            ],
            [
                14303,
                14311
            ],
            [
                14272,
                14275
            ],
            [
                14251,
                14257
            ],
            [
                14317,
                14329
            ],
            [
                14329,
                14352
            ],
            [
                14354,
                14370
            ],
            [
                14391,
                14463
            ],
            [
                14465,
                14467
            ],
            [
                14481,
                14497
            ],
            [
                14530,
                14564
            ],
            [
                14566,
                14602
            ],
            [
                14664,
                14752
            ],
            [
                14781,
                14791
            ],
            [
                14763,
                14765
            ],
            [
                14796,
                14807
            ],
            [
                14935,
                14994
            ],
            [
                15011,
                15014
            ],
            [
                15015,
                15020
            ],
            [
                15048,
                15135
            ],
            [
                15161,
                15175
            ],
            [
                15208,
                15234
            ],
            [
                15329,
                15334
            ],
            [
                15339,
                15360
            ],
            [
                15371,
                15373
            ],
            [
                15629,
                15762
            ],
            [
                15780,
                15789
            ],
            [
                15796,
                15829
            ],
            [
                15829,
                15850
            ],
            [
                15850,
                15904
            ],
            [
                15905,
                15965
            ],
            [
                15967,
                16037
            ],
            [
                16045,
                16048
            ],
            [
                16062,
                16114
            ],
            [
                16114,
                16142
            ],
            [
                16182,
                16189
            ],
            [
                16142,
                16143
            ],
            [
                16223,
                16224
            ],
            [
                16229,
                16232
            ],
            [
                16245,
                16269
            ],
            [
                16269,
                16277
            ],
            [
                16295,
                16316
            ],
            [
                16316,
                16423
            ],
            [
                16438,
                16449
            ],
            [
                16449,
                16488
            ],
            [
                16490,
                16501
            ],
            [
                16501,
                16518
            ],
            [
                16539,
                16541
            ],
            [
                16541,
                16542
            ],
            [
                16542,
                16607
            ],
            [
                16607,
                16631
            ],
            [
                16633,
                16657
            ],
            [
                16668,
                16671
            ],
            [
                16676,
                16692
            ],
            [
                16693,
                16735
            ],
            [
                16810,
                16815
            ],
            [
                16827,
                16843
            ],
            [
                16851,
                16865
            ],
            [
                16865,
                16908
            ],
            [
                16955,
                16957
            ],
            [
                16957,
                16959
            ],
            [
                16969,
                17126
            ],
            [
                17126,
                17129
            ],
            [
                17163,
                17234
            ],
            [
                17252,
                17261
            ],
            [
                17244,
                17250
            ],
            [
                17278,
                17321
            ],
            [
                17446,
                17491
            ],
            [
                17491,
                17504
            ],
            [
                17517,
                17534
            ],
            [
                17555,
                17595
            ],
            [
                17595,
                17596
            ],
            [
                17601,
                17620
            ],
            [
                17635,
                17731
            ],
            [
                17731,
                17774
            ],
            [
                17809,
                17811
            ],
            [
                17811,
                17861
            ],
            [
                17861,
                17969
            ],
            [
                18060,
                18063
            ],
            [
                18108,
                18151
            ],
            [
                18185,
                18212
            ],
            [
                18025,
                18026
            ],
            [
                18214,
                18260
            ],
            [
                18260,
                18321
            ],
            [
                18339,
                18395
            ],
            [
                18395,
                18419
            ],
            [
                18419,
                18429
            ],
            [
                18442,
                18448
            ],
            [
                18448,
                18484
            ],
            [
                18486,
                18500
            ],
            [
                18514,
                18524
            ],
            [
                18537,
                18539
            ],
            [
                18546,
                18554
            ],
            [
                18554,
                18557
            ],
            [
                18566,
                18570
            ],
            [
                18581,
                18601
            ],
            [
                18601,
                18664
            ],
            [
                18664,
                18675
            ],
            [
                18675,
                18738
            ],
            [
                18739,
                18803
            ],
            [
                18803,
                18823
            ],
            [
                18829,
                18833
            ],
            [
                18889,
                18891
            ],
            [
                19151,
                19166
            ],
            [
                19200,
                19278
            ],
            [
                19294,
                19342
            ],
            [
                19342,
                19386
            ],
            [
                19388,
                19397
            ],
            [
                19399,
                19409
            ],
            [
                19409,
                19430
            ],
            [
                19430,
                19474
            ],
            [
                20011,
                20019
            ],
            [
                20025,
                20066
            ],
            [
                20075,
                20085
            ],
            [
                20085,
                20096
            ],
            [
                20147,
                20187
            ],
            [
                20187,
                20222
            ],
            [
                20224,
                20225
            ],
            [
                20242,
                20293
            ],
            [
                20331,
                20332
            ],
            [
                20294,
                20298
            ],
            [
                20299,
                20304
            ],
            [
                20365,
                20367
            ],
            [
                20367,
                20371
            ],
            [
                20407,
                20420
            ],
            [
                20430,
                20437
            ],
            [
                20444,
                20448
            ],
            [
                20467,
                20469
            ],
            [
                20469,
                20512
            ],
            [
                20536,
                20541
            ],
            [
                20515,
                20518
            ],
            [
                20578,
                20592
            ],
            [
                20592,
                20648
            ],
            [
                20655,
                20659
            ],
            [
                20673,
                20682
            ],
            [
                20694,
                20706
            ],
            [
                20706,
                20740
            ],
            [
                20740,
                20785
            ],
            [
                20797,
                20806
            ],
            [
                20814,
                20833
            ],
            [
                20842,
                20849
            ],
            [
                20838,
                20841
            ],
            [
                20891,
                20918
            ],
            [
                20920,
                20928
            ],
            [
                20946,
                20969
            ],
            [
                20974,
                21033
            ],
            [
                21076,
                21093
            ],
            [
                21158,
                21176
            ],
            [
                21178,
                21241
            ],
            [
                21241,
                21271
            ],
            [
                21299,
                21305
            ],
            [
                21305,
                21444
            ],
            [
                21444,
                21466
            ],
            [
                21466,
                21489
            ],
            [
                21639,
                21689
            ],
            [
                21689,
                21710
            ],
            [
                21718,
                21731
            ],
            [
                21731,
                21748
            ],
            [
                21765,
                21842
            ],
            [
                21843,
                21852
            ],
            [
                21896,
                21961
            ],
            [
                21749,
                21751
            ],
            [
                21962,
                22010
            ],
            [
                22030,
                22032
            ],
            [
                22032,
                22035
            ],
            [
                22045,
                22127
            ],
            [
                22128,
                22144
            ],
            [
                22170,
                22172
            ],
            [
                22309,
                22312
            ],
            [
                22176,
                22186
            ],
            [
                22194,
                22197
            ],
            [
                22187,
                22189
            ],
            [
                22198,
                22200
            ],
            [
                22248,
                22278
            ],
            [
                22367,
                22369
            ],
            [
                22369,
                22393
            ],
            [
                22410,
                22412
            ],
            [
                22430,
                22481
            ],
            [
                22522,
                22524
            ],
            [
                22539,
                22561
            ],
            [
                22603,
                22664
            ],
            [
                22664,
                22717
            ],
            [
                22717,
                22792
            ],
            [
                22792,
                22812
            ],
            [
                22819,
                22841
            ],
            [
                22899,
                22901
            ],
            [
                22901,
                22912
            ],
            [
                22925,
                22971
            ],
            [
                23065,
                23067
            ],
            [
                23067,
                23076
            ],
            [
                23081,
                23149
            ],
            [
                23206,
                23216
            ],
            [
                23220,
                23247
            ],
            [
                23193,
                23195
            ],
            [
                23290,
                23322
            ],
            [
                23324,
                23363
            ],
            [
                23363,
                23387
            ],
            [
                23387,
                23399
            ],
            [
                23417,
                23426
            ],
            [
                23549,
                23551
            ],
            [
                23464,
                23472
            ],
            [
                23485,
                23501
            ],
            [
                23551,
                23552
            ],
            [
                23563,
                23597
            ],
            [
                23597,
                23601
            ],
            [
                23612,
                23642
            ],
            [
                23642,
                23643
            ],
            [
                23663,
                23683
            ],
            [
                23686,
                23730
            ],
            [
                23735,
                23748
            ],
            [
                23750,
                23802
            ],
            [
                23821,
                23860
            ],
            [
                23905,
                23926
            ],
            [
                23932,
                23933
            ],
            [
                23958,
                23998
            ],
            [
                23998,
                24001
            ],
            [
                24066,
                24073
            ],
            [
                24144,
                24148
            ],
            [
                24075,
                24086
            ],
            [
                24123,
                24130
            ],
            [
                24209,
                24235
            ],
            [
                24244,
                24268
            ],
            [
                24287,
                24322
            ],
            [
                24322,
                24371
            ],
            [
                24428,
                24459
            ],
            [
                24459,
                24490
            ],
            [
                24490,
                24526
            ],
            [
                24526,
                24579
            ],
            [
                24579,
                24655
            ],
            [
                24676,
                24679
            ],
            [
                24716,
                24771
            ],
            [
                24905,
                24921
            ],
            [
                24923,
                24974
            ],
            [
                24974,
                24995
            ],
            [
                25006,
                25090
            ],
            [
                25135,
                25137
            ],
            [
                25137,
                25216
            ],
            [
                25218,
                25227
            ],
            [
                25232,
                25238
            ],
            [
                25245,
                25290
            ],
            [
                25290,
                25399
            ],
            [
                25399,
                25417
            ],
            [
                25431,
                25434
            ],
            [
                25434,
                25435
            ],
            [
                25475,
                25514
            ],
            [
                25527,
                25562
            ],
            [
                25588,
                25598
            ],
            [
                25562,
                25563
            ],
            [
                25641,
                25677
            ],
            [
                25686,
                25688
            ],
            [
                25769,
                25771
            ],
            [
                25771,
                25786
            ],
            [
                25873,
                25880
            ],
            [
                26007,
                26026
            ],
            [
                25815,
                25817
            ],
            [
                26032,
                26054
            ],
            [
                26054,
                26106
            ],
            [
                26108,
                26174
            ],
            [
                26174,
                26190
            ],
            [
                26190,
                26221
            ],
            [
                26221,
                26233
            ],
            [
                26252,
                26292
            ],
            [
                26295,
                26359
            ],
            [
                26359,
                26375
            ],
            [
                26379,
                26397
            ],
            [
                26409,
                26420
            ],
            [
                26432,
                26439
            ],
            [
                26463,
                26472
            ],
            [
                26495,
                26512
            ],
            [
                26512,
                26570
            ],
            [
                26641,
                26665
            ],
            [
                26682,
                26706
            ],
            [
                26706,
                26825
            ],
            [
                26825,
                26856
            ],
            [
                26856,
                26984
            ],
            [
                26984,
                27012
            ],
            [
                27045,
                27116
            ],
            [
                27118,
                27122
            ],
            [
                27124,
                27129
            ],
            [
                27131,
                27137
            ],
            [
                27137,
                27182
            ],
            [
                27184,
                27231
            ],
            [
                27725,
                27959
            ],
            [
                27959,
                28048
            ],
            [
                28048,
                28074
            ],
            [
                28092,
                28097
            ],
            [
                28108,
                28110
            ],
            [
                28110,
                28138
            ],
            [
                28138,
                28143
            ],
            [
                28168,
                28188
            ],
            [
                28188,
                28213
            ],
            [
                28213,
                28261
            ],
            [
                28261,
                28284
            ],
            [
                28301,
                28347
            ],
            [
                28360,
                28398
            ],
            [
                28401,
                28420
            ],
            [
                28474,
                28502
            ],
            [
                28502,
                28509
            ],
            [
                28515,
                28520
            ],
            [
                28565,
                28574
            ],
            [
                28521,
                28538
            ],
            [
                28696,
                28698
            ],
            [
                29097,
                29122
            ],
            [
                29132,
                29138
            ],
            [
                29149,
                29200
            ],
            [
                29252,
                29262
            ],
            [
                29267,
                29276
            ],
            [
                29285,
                29302
            ],
            [
                29346,
                29371
            ],
            [
                29468,
                29470
            ],
            [
                29403,
                29463
            ],
            [
                29606,
                29608
            ],
            [
                29608,
                29626
            ],
            [
                29628,
                29645
            ],
            [
                29655,
                29700
            ],
            [
                29706,
                29708
            ],
            [
                29714,
                29721
            ],
            [
                29742,
                29799
            ],
            [
                29799,
                29826
            ],
            [
                29826,
                29847
            ],
            [
                30077,
                30087
            ],
            [
                30043,
                30051
            ],
            [
                30096,
                30099
            ],
            [
                30099,
                30147
            ],
            [
                30173,
                30176
            ],
            [
                30184,
                30186
            ],
            [
                30186,
                30203
            ],
            [
                30501,
                30504
            ],
            [
                30410,
                30414
            ],
            [
                30532,
                30539
            ],
            [
                30576,
                30587
            ],
            [
                30544,
                30561
            ],
            [
                30988,
                30990
            ],
            [
                30990,
                31097
            ],
            [
                31099,
                31205
            ],
            [
                31205,
                31394
            ],
            [
                31394,
                31540
            ],
            [
                31540,
                31633
            ],
            [
                31655,
                31691
            ],
            [
                31691,
                31750
            ],
            [
                31806,
                31808
            ],
            [
                31808,
                31879
            ],
            [
                31887,
                31890
            ],
            [
                31892,
                31907
            ],
            [
                31908,
                31916
            ],
            [
                31931,
                31935
            ],
            [
                31917,
                31923
            ],
            [
                31943,
                31962
            ],
            [
                31962,
                31968
            ],
            [
                31974,
                31981
            ],
            [
                31985,
                31990
            ],
            [
                32002,
                32005
            ],
            [
                32005,
                32021
            ],
            [
                32030,
                32047
            ],
            [
                32047,
                32174
            ],
            [
                32174,
                32195
            ],
            [
                32195,
                32223
            ],
            [
                32223,
                32296
            ],
            [
                32330,
                32358
            ],
            [
                32358,
                32403
            ],
            [
                32403,
                32447
            ],
            [
                32447,
                32458
            ],
            [
                32468,
                32544
            ],
            [
                32546,
                32562
            ],
            [
                32566,
                32569
            ],
            [
                32590,
                32596
            ],
            [
                32632,
                32641
            ],
            [
                32642,
                32654
            ],
            [
                32654,
                32672
            ],
            [
                32711,
                32712
            ],
            [
                32729,
                32746
            ],
            [
                32757,
                32806
            ],
            [
                32806,
                32872
            ],
            [
                32874,
                32901
            ],
            [
                32901,
                32944
            ],
            [
                32953,
                32995
            ],
            [
                33012,
                33019
            ],
            [
                33026,
                33035
            ],
            [
                33101,
                33108
            ],
            [
                33099,
                33100
            ],
            [
                33120,
                33126
            ],
            [
                33074,
                33082
            ],
            [
                33138,
                33139
            ],
            [
                33144,
                33148
            ],
            [
                33150,
                33238
            ],
            [
                33238,
                33267
            ],
            [
                33346,
                33400
            ],
            [
                33418,
                33458
            ],
            [
                33458,
                33489
            ],
            [
                33581,
                33601
            ],
            [
                33601,
                33621
            ],
            [
                33627,
                33629
            ],
            [
                33638,
                33702
            ],
            [
                33702,
                33718
            ],
            [
                33724,
                33743
            ],
            [
                33743,
                33756
            ],
            [
                33792,
                33818
            ],
            [
                33818,
                33863
            ],
            [
                33877,
                33883
            ],
            [
                33905,
                33913
            ],
            [
                33919,
                33950
            ],
            [
                34023,
                34025
            ],
            [
                34025,
                34034
            ],
            [
                34044,
                34229
            ],
            [
                34359,
                34395
            ],
            [
                34401,
                34412
            ],
            [
                34425,
                34507
            ],
            [
                34526,
                34528
            ],
            [
                34528,
                34555
            ],
            [
                34555,
                34562
            ],
            [
                34582,
                34584
            ],
            [
                34584,
                34611
            ],
            [
                34611,
                34690
            ],
            [
                34690,
                34760
            ],
            [
                34771,
                34774
            ],
            [
                34774,
                34797
            ],
            [
                34797,
                34864
            ],
            [
                34864,
                34916
            ],
            [
                34916,
                34940
            ],
            [
                34940,
                34974
            ],
            [
                34976,
                35022
            ],
            [
                35022,
                35058
            ],
            [
                35106,
                35108
            ],
            [
                35108,
                35119
            ],
            [
                35119,
                35133
            ],
            [
                35143,
                35149
            ],
            [
                35149,
                35179
            ],
            [
                35235,
                35239
            ],
            [
                35268,
                35316
            ],
            [
                35316,
                35336
            ],
            [
                35338,
                35339
            ]
        ],
        "row_chars": [
            [
                0,
                516
            ],
            [
                516,
                550
            ],
            [
                550,
                741
            ],
            [
                741,
                951
            ],
            [
                951,
                1137
            ],
            [
                1137,
                1488
            ],
            [
                1488,
                1995
            ],
            [
                1995,
                2246
            ],
            [
                2246,
                2490
            ],
            [
                2490,
                2616
            ],
            [
                2616,
                2787
            ],
            [
                2787,
                2881
            ],
            [
                2881,
                3433
            ],
            [
                3433,
                3535
            ],
            [
                3535,
                3828
            ],
            [
                3828,
                4260
            ],
            [
                4260,
                4395
            ],
            [
                4395,
                4496
            ],
            [
                4496,
                4639
            ],
            [
                4639,
                4847
            ],
            [
                4847,
                4970
            ],
            [
                4970,
                5120
            ],
            [
                5120,
                5249
            ],
            [
                5249,
                5307
            ],
            [
                5307,
                5373
            ],
            [
                5373,
                5451
            ],
            [
                5451,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5635
            ],
            [
                5635,
                5683
            ],
            [
                5683,
                5730
            ],
            [
                5730,
                5883
            ],
            [
                5883,
                6035
            ],
            [
                6035,
                6134
            ],
            [
                6134,
                6198
            ],
            [
                6198,
                6260
            ],
            [
                6260,
                6289
            ],
            [
                6289,
                6330
            ],
            [
                6330,
                6590
            ],
            [
                6590,
                6629
            ],
            [
                6629,
                6753
            ],
            [
                6753,
                6884
            ],
            [
                6884,
                7019
            ],
            [
                7019,
                7081
            ],
            [
                7081,
                7294
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7357
            ],
            [
                7357,
                7597
            ],
            [
                7597,
                7818
            ],
            [
                7818,
                8394
            ],
            [
                8394,
                8562
            ],
            [
                8562,
                8650
            ],
            [
                8650,
                8829
            ],
            [
                8829,
                9294
            ],
            [
                9294,
                9386
            ],
            [
                9386,
                9400
            ],
            [
                9400,
                9541
            ],
            [
                9541,
                9675
            ],
            [
                9675,
                9947
            ],
            [
                9947,
                10092
            ],
            [
                10092,
                10226
            ],
            [
                10226,
                11089
            ],
            [
                11089,
                11188
            ],
            [
                11188,
                11235
            ],
            [
                11235,
                11587
            ],
            [
                11587,
                11763
            ],
            [
                11763,
                12083
            ],
            [
                12083,
                12321
            ],
            [
                12321,
                12340
            ],
            [
                12340,
                12423
            ],
            [
                12423,
                12443
            ],
            [
                12443,
                12479
            ],
            [
                12479,
                12540
            ],
            [
                12540,
                12662
            ],
            [
                12662,
                12688
            ],
            [
                12688,
                12816
            ],
            [
                12816,
                12914
            ],
            [
                12914,
                12942
            ],
            [
                12942,
                13003
            ],
            [
                13003,
                13132
            ],
            [
                13132,
                13265
            ],
            [
                13265,
                13325
            ],
            [
                13325,
                13376
            ],
            [
                13376,
                13472
            ],
            [
                13472,
                13523
            ],
            [
                13523,
                13847
            ],
            [
                13847,
                14085
            ],
            [
                14085,
                14182
            ],
            [
                14182,
                14329
            ],
            [
                14329,
                14467
            ],
            [
                14467,
                14499
            ],
            [
                14499,
                14530
            ],
            [
                14530,
                14752
            ],
            [
                14752,
                15234
            ],
            [
                15234,
                15329
            ],
            [
                15329,
                15373
            ],
            [
                15373,
                15629
            ],
            [
                15629,
                15829
            ],
            [
                15829,
                15850
            ],
            [
                15850,
                15965
            ],
            [
                15965,
                16037
            ],
            [
                16037,
                16114
            ],
            [
                16114,
                16269
            ],
            [
                16269,
                16316
            ],
            [
                16316,
                16449
            ],
            [
                16449,
                16501
            ],
            [
                16501,
                16541
            ],
            [
                16541,
                16607
            ],
            [
                16607,
                16865
            ],
            [
                16865,
                16957
            ],
            [
                16957,
                17126
            ],
            [
                17126,
                17321
            ],
            [
                17321,
                17385
            ],
            [
                17385,
                17446
            ],
            [
                17446,
                17491
            ],
            [
                17491,
                17595
            ],
            [
                17595,
                17731
            ],
            [
                17731,
                17811
            ],
            [
                17811,
                17861
            ],
            [
                17861,
                18260
            ],
            [
                18260,
                18395
            ],
            [
                18395,
                18419
            ],
            [
                18419,
                18448
            ],
            [
                18448,
                18554
            ],
            [
                18554,
                18601
            ],
            [
                18601,
                18664
            ],
            [
                18664,
                18675
            ],
            [
                18675,
                18803
            ],
            [
                18803,
                18902
            ],
            [
                18902,
                19060
            ],
            [
                19060,
                19087
            ],
            [
                19087,
                19151
            ],
            [
                19151,
                19342
            ],
            [
                19342,
                19388
            ],
            [
                19388,
                19409
            ],
            [
                19409,
                19430
            ],
            [
                19430,
                19476
            ],
            [
                19476,
                19536
            ],
            [
                19536,
                19672
            ],
            [
                19672,
                19729
            ],
            [
                19729,
                19928
            ],
            [
                19928,
                19978
            ],
            [
                19978,
                20085
            ],
            [
                20085,
                20187
            ],
            [
                20187,
                20224
            ],
            [
                20224,
                20367
            ],
            [
                20367,
                20469
            ],
            [
                20469,
                20512
            ],
            [
                20512,
                20592
            ],
            [
                20592,
                20706
            ],
            [
                20706,
                20740
            ],
            [
                20740,
                20918
            ],
            [
                20918,
                21241
            ],
            [
                21241,
                21305
            ],
            [
                21305,
                21444
            ],
            [
                21444,
                21466
            ],
            [
                21466,
                21489
            ],
            [
                21489,
                21689
            ],
            [
                21689,
                21731
            ],
            [
                21731,
                22032
            ],
            [
                22032,
                22172
            ],
            [
                22172,
                22369
            ],
            [
                22369,
                22524
            ],
            [
                22524,
                22603
            ],
            [
                22603,
                22664
            ],
            [
                22664,
                22717
            ],
            [
                22717,
                22792
            ],
            [
                22792,
                22901
            ],
            [
                22901,
                23067
            ],
            [
                23067,
                23363
            ],
            [
                23363,
                23387
            ],
            [
                23387,
                23551
            ],
            [
                23551,
                23597
            ],
            [
                23597,
                23642
            ],
            [
                23642,
                23686
            ],
            [
                23686,
                23998
            ],
            [
                23998,
                24322
            ],
            [
                24322,
                24428
            ],
            [
                24428,
                24459
            ],
            [
                24459,
                24490
            ],
            [
                24490,
                24526
            ],
            [
                24526,
                24579
            ],
            [
                24579,
                24772
            ],
            [
                24772,
                24905
            ],
            [
                24905,
                24974
            ],
            [
                24974,
                25137
            ],
            [
                25137,
                25290
            ],
            [
                25290,
                25399
            ],
            [
                25399,
                25434
            ],
            [
                25434,
                25771
            ],
            [
                25771,
                26054
            ],
            [
                26054,
                26174
            ],
            [
                26174,
                26190
            ],
            [
                26190,
                26221
            ],
            [
                26221,
                26359
            ],
            [
                26359,
                26379
            ],
            [
                26379,
                26512
            ],
            [
                26512,
                26570
            ],
            [
                26570,
                26641
            ],
            [
                26641,
                26706
            ],
            [
                26706,
                26825
            ],
            [
                26825,
                26856
            ],
            [
                26856,
                26984
            ],
            [
                26984,
                27118
            ],
            [
                27118,
                27137
            ],
            [
                27137,
                27184
            ],
            [
                27184,
                27231
            ],
            [
                27231,
                27348
            ],
            [
                27348,
                27552
            ],
            [
                27552,
                27667
            ],
            [
                27667,
                27725
            ],
            [
                27725,
                27959
            ],
            [
                27959,
                28048
            ],
            [
                28048,
                28110
            ],
            [
                28110,
                28138
            ],
            [
                28138,
                28188
            ],
            [
                28188,
                28213
            ],
            [
                28213,
                28261
            ],
            [
                28261,
                28284
            ],
            [
                28284,
                28420
            ],
            [
                28420,
                28474
            ],
            [
                28474,
                28502
            ],
            [
                28502,
                28698
            ],
            [
                28698,
                28843
            ],
            [
                28843,
                28920
            ],
            [
                28920,
                29302
            ],
            [
                29302,
                29608
            ],
            [
                29608,
                29628
            ],
            [
                29628,
                29708
            ],
            [
                29708,
                29799
            ],
            [
                29799,
                29826
            ],
            [
                29826,
                29850
            ],
            [
                29850,
                29891
            ],
            [
                29891,
                29968
            ],
            [
                29968,
                29986
            ],
            [
                29986,
                30042
            ],
            [
                30042,
                30099
            ],
            [
                30099,
                30186
            ],
            [
                30186,
                30990
            ],
            [
                30990,
                31205
            ],
            [
                31205,
                31394
            ],
            [
                31394,
                31540
            ],
            [
                31540,
                31691
            ],
            [
                31691,
                31808
            ],
            [
                31808,
                31962
            ],
            [
                31962,
                32005
            ],
            [
                32005,
                32047
            ],
            [
                32047,
                32174
            ],
            [
                32174,
                32195
            ],
            [
                32195,
                32223
            ],
            [
                32223,
                32296
            ],
            [
                32296,
                32330
            ],
            [
                32330,
                32358
            ],
            [
                32358,
                32403
            ],
            [
                32403,
                32447
            ],
            [
                32447,
                32562
            ],
            [
                32562,
                32654
            ],
            [
                32654,
                32673
            ],
            [
                32673,
                32711
            ],
            [
                32711,
                32806
            ],
            [
                32806,
                32901
            ],
            [
                32901,
                33035
            ],
            [
                33035,
                33150
            ],
            [
                33150,
                33238
            ],
            [
                33238,
                33458
            ],
            [
                33458,
                33581
            ],
            [
                33581,
                33601
            ],
            [
                33601,
                33702
            ],
            [
                33702,
                33743
            ],
            [
                33743,
                33818
            ],
            [
                33818,
                34025
            ],
            [
                34025,
                34359
            ],
            [
                34359,
                34528
            ],
            [
                34528,
                34555
            ],
            [
                34555,
                34584
            ],
            [
                34584,
                34611
            ],
            [
                34611,
                34690
            ],
            [
                34690,
                34774
            ],
            [
                34774,
                34797
            ],
            [
                34797,
                34864
            ],
            [
                34864,
                34916
            ],
            [
                34916,
                34940
            ],
            [
                34940,
                35022
            ],
            [
                35022,
                35108
            ],
            [
                35108,
                35119
            ],
            [
                35119,
                35149
            ],
            [
                35149,
                35316
            ],
            [
                35316,
                35339
            ]
        ]
    },
    "abridged": {
        "text": "Deronda came out of the house at Chelsea longing for some bodily exercise to relieve his temper. The sight of the waiting boats at the riverside at once determined him not to go to the City by cab, but by calling a wherry and taking an oar.\nHis errand was to go to Ram's book-shop, where he had yesterday arrived too late for Mordecai's midday watch, and had been told that he returned there between five and six. Deronda wished for further conversation with this remarkable inmate of the Cohens before redeeming his ring: he wished that their talk should not again end speedily with that drop of Mordecai's interest which was like the removal of a drawbridge. As he plied the oar, thinking of Mordecai, he experienced his habitual change of mental light, shifting his point of view to that of the person who was in his mind.\n\"If I got information about Mirah's family from Mordecai,\" thought Deronda, \"I should be content if he did not tell me more about himself, or why he seemed to have some expectation from me which was disappointed. My curiosity would die; and yet it might be that we had neared and parted like two ships, each carrying an exile who would have recognized the other if the two met. Poor fellow; his voyage, I fancy, must soon be over.\"\nWhen the wherry was approaching Blackfriars Bridge, where Deronda meant to land, it was half-past four. The grey day was dying gloriously, its western clouds broken into narrowing purple strata before a wide-spreading saffron clearness, which in the sky had a monumental calm, but on the river was reflected as a luminous, rippling movement.\nDeronda gave up the oar to draw on his Inverness cape. As he lifted his head while fastening the button, his eyes caught a well-remembered face looking toward him over the parapet of the bridge - a face of emaciated eagerness illuminated by the western light into startling distinctness and brilliancy. It was the face of Mordecai, who in his watch toward the west, had caught sight of the advancing boat, and had kept it within his gaze, at first simply because it was advancing, then with a quivering presentiment, till at last the nearing figure lifted up the face of his visions - and then immediately, with white uplifted hand, beckoned again and again.\nFor Deronda, anxious that Mordecai should recognize and await him, had signalled, and the answer came straightway. Mordecai waved his cap, feeling in that moment that his prophecy was fulfilled. Obstacles all melted into the sense of completion which flooded his soul. The prefigured friend had come from the golden background, and had signalled to him: this actually was: the rest was to be.\nIn three minutes Deronda had landed, had paid his boatman, and was joining Mordecai, who stood perfectly still to wait for him.\n\"I was very glad to see you here,\" said Deronda, \"for I was intending to go to the book-shop and look for you again. I was there yesterday - perhaps they told you?\"\n\"Yes,\" said Mordecai; \"that was the reason I came to the bridge.\"\nThis answer, made with simple gravity, was startlingly mysterious to Deronda. Did this man really have a wandering mind, as Cohen had hinted?\n\"You knew nothing of my being at Chelsea?\" he said, after a moment.\n\"No; but I expected you to come down the river. I have been waiting for you these five years.\" Mordecai's deep-sunk eyes were fixed on those of the friend who had at last arrived with a look of affectionate dependence, at once pathetic and solemn. Although Deronda believed the words to be based on an illusion, he could not but respond with sensitivity.\n\"I will be happy if I can be of any real use to you,\" he answered, very earnestly. \"Shall we get into a cab and drive to - wherever you wish to go? You have probably had walking enough.\"\n\"Let us go to the book-shop. But now look up the river,\" said Mordecai, speaking with what may be called an excited calm - so absorbed by a sense of fulfilment that he felt no barrier to a complete understanding between him and Deronda. \"See the sky, how it is slowly fading. I have always loved this bridge: it is a meeting-place for the spiritual messengers. Here I have listened to the messages of earth and sky; when I was stronger I used to stay and watch for the stars in the deep heavens. But the sunset was always what I loved best. It has sunk into me and dwelt with me - fading, with my own decline: it paused - it waited, till at last it brought me my new life - my new self - who will live when this breath is all breathed out.\"\nDeronda did not speak. He felt himself strangely affected. His first suspicion that Mordecai might be liable to hallucinations, obsessed by some subject which had over-strained his diseased body, gave way to a submissive expectancy. Deronda's nature was too large and open to rest in the easy explanation, \"madness.\" He would rather meet than resist any claim on him in the shape of another's need; and the solemnity of this claim lifted Mordecai into authority, like a supernatural guide who suddenly drops his mean disguise and stands revealed as a Power, calm and resolved.\nAfter they had stood a moment in silence Mordecai said- \"Let us go now,\" and when they were in the cab he added, \"We will get down at the end of the street and walk to the shop. You can look at the books, and Mr. Ram will be going directly and leave us alone.\" It seemed that he was alive to judgments in other minds.\nMeanwhile, Deronda had not forgotten Mirah: but he was no longer confident what questions he should ask; and said inwardly, \"I suppose I am in a superstitious state, as if I were awaiting the fulfilment of an oracle. But there must be some strong relation between me and this man, since he feels it strongly. Great heaven! what relation is more potent than faith, even when mistaken? Will I fulfil my part, or disappoint? - well, I will not disappoint if possible.\"\nIn ten minutes the two men, with as intense a consciousness as two undeclared lovers, found themselves alone in the small gas-lit book-shop and turned face to face, each baring his head to see each other fully.\nImagine the pathetic stamp of consumption with its brilliancy of glance and sharply-defined features, creating a far-off look as of one getting unwillingly out of reach; and imagine it on an eager Jewish face - the face of a man little above thirty, but aged by suffering, the black hair and beard emphasising the yellow pallor of the skin. Imagine the difficult breathing, the wasted yellow hands: then give to the yearning consumptive glance something of the dying mother's look, when her one loved son visits her bedside, and the flickering power of gladness leaps out as she says, \"My boy!\"\nSeeing such a portrait you would see Mordecai. And opposite him was a face not more distinctively oriental than many of the Latin races; rich in youthful health, and with a forcible masculine gravity in its repose, as it met the gaze of this mysterious son of poverty who claimed him as a long-expected friend.\nDeronda's keenly perceptive sympathy was never more thoroughly tested. He did not believe in the validity of Mordecai's impressions concerning him: what he felt was a profound sensitivity to a cry from the depths of another, and the urge to be receptive rather than prejudge. Receptiveness is a rare and massive power, like fortitude; and this state of mind now gave Deronda's face a calm benignant force which nourished Mordecai's confidence. He began to speak.\n\"You are wondering what has guided me to you and brought us together at this moment.\"\n\"I am not impatient,\" said Deronda. \"I am ready to listen.\"\n\"You see some of the reasons why I needed you,\" said Mordecai, speaking quietly, to reserve his strength. \"You see that I am dying. The day is closing - the light is fading - soon we should not have been able to discern each other. But you have come in time.\"\n\"I rejoice that I am come in time,\" said Deronda. He would not say, \"I hope you are not mistaken in me\"; for he thought that would be cruel just then.\n\"But the hidden reasons why I need you began afar off,\" said Mordecai; \"began in my early years when I was studying in another land. Then beloved ideas came to me, because I was a Jew. They were an inspiration, because I was a Jew, and I felt the heart of my race beating within me. They were my life; I was not fully born till then. I counted this heart, and this breath, and this right hand\"- Mordecai pathetically stretched out his wasted fingers - \"I counted my sleep and my waking but as fuel to the divine flame. But care and labour and disease came, and blocked my way, and bound me with the iron that eats into the soul. Then I said, 'How shall I save the life within me from being stifled?'\"\nMordecai paused to rest, and to check his rising excitement. Deronda dared not speak. The very silence seemed alive with mingled awe and compassion before this struggling fervour. Mordecai went on-\n\"I speak not as an ignorant dreamer - as one bred up in the inland valleys, never having stood by the great waters where the world's knowledge passes to and fro. England is my native land; but my true life was nourished in Holland at the feet of my uncle, a learned Rabbi: and when he died I went to Hamburg to study, and afterwards to Gttingen, that I might learn about my people, and drink knowledge at all sources. And I possessed myself of a craft. For I said, let my body dwell in poverty, and my hands be as the hands of the toiler: but let my soul be as a temple of remembrance where knowledge enters and the inner sanctuary is hope. I knew what I chose. They said, 'He feeds himself on visions,' and I denied it not; for visions are the creators and feeders of the world. You see, I measure the world as it is, which the vision will create anew. I am not one who raves aloof from the lives of his fellows.\"\nMordecai paused, and Deronda said, \"Indeed, I would not call your words raving. I listen without prejudgment. I have had experience which gives me a keen interest in the story of a spiritual destiny embraced willingly in youth.\"\n\"A spiritual destiny embraced willingly in youth?\" Mordecai repeated. \"Rather it was the soul fully born within me, and it came in my boyhood. It brought its own world - a mediaeval world, where men made the ancient Hebrew language live again in new psalms of exile, and yearned toward a centre for our race. One of their souls was born again within me. It travelled into Spain and Provence; it debated with Aben-Ezra; it took ship with Jehuda ha-Levi; it heard the roar of the Crusaders and the shrieks of tortured Israel. And it spoke the speech they had made alive with the new blood of their ardour and their sorrow; it sang with the cadence of their strain.\"\n\"Have you written entirely in Hebrew, then?\" said Deronda, with some anxiety as to his own knowledge of that tongue.\n\"Yes,\" said Mordecai with deep sadness: \"in my youth I wandered toward that solitude, not feeling that it was a solitude. I had the ranks of the great dead around me. But soon I found that the living were deaf to me. At first I saw my life spread as a long future: I said part of my Jewish heritage is an unbreaking patience; but then I had to bow under the yoke that presses on so many: family troubles called me - I had to work, to care, not for myself alone. I was left solitary again; but already the angel of death had beckoned, and I felt his skirts continually on my path. I loosed not my effort. I besought help. I spoke; I went to men of our people - to the rich in knowledge, and in wealth. But none listened with understanding. I was rebuked for error; I was offered a small sum in charity. No wonder. I looked poor; I carried a bundle of Hebrew manuscript with me; and I said, our chief teachers are misleading the hope of our race. Scholar and merchant both scorned me.\"\n\"But though you wrote in Hebrew, few, surely, can use English better,\" said Deronda, wanting to hint at a new effort for which he could smooth the way.\nMordecai shook his head slowly, and answered-\n\"Too late - too late. I can write no more. My writing would be like this gasping breath.\" His head bowed in melancholy: for the moment he had lost his hope. Despondency hovered above him with eclipsing wings. He had sunk into momentary darkness.\n\"I feel strongly with you,\" said Deronda, in a clear, deep, reviving voice. \"But what you have written need not lie buried. The means of publication are within reach. I can help you to that end.\"\n\"That is not enough,\" said Mordecai, quickly, looking up with recovered confidence. \"That is not all my trust in you. You must be not only a hand to me, but a soul - believing my belief - moved by my reasons - hoping my hope - beholding a glory where I behold it!\"\nMordecai moved nearer as he spoke, and laid his hand on Deronda's arm with a tight grasp; his face shone like a pale flame, while he went on- \"You will be my life: it will be planted afresh; it will grow. You shall take the inheritance of ages. The generations are crowding on my narrow life as a bridge: what has been and what is to be are meeting there; and the bridge is breaking. But I have found you. You have come in time. You will take the sacred inheritance of the Jew.\"\nDeronda had become as pale as Mordecai. Quick as an alarm, there spread within him not only a compassionate dread of discouraging this dying fellow man, but also the opposing dread of fatally feeding an illusion, and of being hurried on to a self-committal which might prove impossible to carry out. The appeal to his tenderness overcame the repulsion that most of us experience under a dominating grasp and speech. His difficulty was how to express his doubts to this ardent suffering creature. With exquisite instinct, he placed his palm gently on Mordecai's straining hand. Then he said, without haste,-\n\"Do you forget what I told you when we first saw each other? Do you remember that I said I was not of your race?\"\n\"It can't be true,\" Mordecai whispered immediately, with no sign of shock. The sympathetic hand upon him had fortified his feelings. There was a pause, Deronda feeling it impossible to answer. Mordecai, entirely possessed by the supreme importance of the relation between them, followed that assertion by a second, spoken in consequence of his long-cherished conviction- \"You are not sure of your own origin.\"\n\"How do you know that?\" said Daniel, shrinking away.\nMordecai relaxed his hold. \"I know it; what is my life else?\" he said with a low cry of impatience. \"Tell me why you deny?\"\nHe could have no conception what that demand meant to the hearer - how probingly it touched the hidden sensibility, the reticence of years; how the uncertainty had always for Daniel held a threat of painful revelation about his mother. But Deronda felt that any evasion or refusal would be a cruel rebuff to one who was appealing to him under the shadow of a coming doom. After a few moments, he said, with a great effort-\n\"I have never known my mother. I have no knowledge about her. I have never called any man father. But I am convinced that my father is an Englishman.\"\nDeronda's deep tones had a tremor in them as he uttered this confession; and he was amazed at the strange circumstances under which he uttered it.\n\"It will be seen - it will be declared,\" said Mordecai, triumphantly. \"The world grows, and is knit together by the growing soul; dim, dim at first, then clearer and more clear. As thoughts move within us darkly, and shake us before they are fully discerned, so events and beings are knit with us in the growth of the world. You have risen within me like a thought not fully spelled; my soul is shaken before the words are all there. The rest will come.\"\n\"The outward event has not always been a fulfilment of the firmest faith,\" said Deronda hesitatingly, wishing neither to give any severe blow to Mordecai, nor to encourage him unwisely.\nMordecai's face changed from the triumphant to the firmly resistant.\n\"You would remind me that I may be under an illusion - that the history of our people's trust has been full of illusion. I face it all.\" Here Mordecai paused a moment. Then bending forward, he said, in his hoarse whisper, \"So it might be with my trust, if you would make it an illusion. But you will not.\"\nThe very sharpness of these words persuaded Deronda that here he must be firm.\n\"What my birth was does not lie in my will,\" he answered. \"And I cannot promise you to hasten a disclosure. Feelings which have struck root through half my life may still hinder me from doing what I have never been able to do. Everything must be waited for. I must know more of the truth about my own life, and I must know more of what it would become if it were made a part of yours.\"\nMordecai had folded his arms, and now answered with equal firmness, though with difficult breathing-\n\"You shall know. What are we met for, but that you should know? Your doubts lie as light as dust on my belief. Man finds his pathways: at first they were foot tracks, as those of the beast in the wilderness: now they are swift and invisible: his thought dives through the ocean, and his wishes thread the air: has he found all the pathways yet? What reaches him, stays with him, rules him: he must accept it, not knowing its pathway. Say, my expectation of you is a false hope. That doubt is in your mind? Well, I expected you, and you are come. Men have died of thirst. But I was thirsty, and the water is on my lips! What are doubts to me? Even if you come to me and say, 'I reject your soul: I am not a Jew: we have no lot in common'- I shall not doubt. That hour will never come!\"\nDeronda heard a new, imperious chord sounding in these words. He felt a subduing influence in the certitude of the fragile creature before him, whose breath laboured under the burden of eager speech. His feeling of sympathetic obligation grew, so that he felt no desire to escape what might turn into a trying embarrassment. He answered simply-\n\"It is my wish to satisfy your wishes wherever that is possible. Certainly I desire not to undervalue your toil and your suffering. Let me know your thoughts. But where can we meet? At the Cohens', where you live?\"\nBefore Mordecai could answer, Mr. Ram re-entered the shop. He was an elderly Jew with none of Mr. Cohen's oily cheerfulness. Mr. Ram dealt ably in books, in the same way that he would have dealt in tins of meat and other commodities - without knowledge or responsibility as to the proportion of rottenness or nourishment they might contain. But he believed in Mordecai's learning as something marvellous, and was not sorry that his conversation should be sought by a bookish gentleman, whose visits had twice ended in a purchase. He greeted Deronda with a crabbed good-will, and, putting on large silver spectacles, appeared at once to abstract himself in the daily accounts.\nBut Deronda and Mordecai were soon in the street together, and without any explicit agreement, were walking toward Ezra Cohen's.\n\"We can't meet there: my room is too narrow,\" said Mordecai. \"But there is a tavern not far from here where I sometimes go to a club: the Hand and Banner, in the next street, five doors down. We can use the parlour there.\"\n\"We can try that,\" said Deronda. \"But you will perhaps let me provide you with some lodging, which would give you more freedom and comfort than where you are.\"\n\"No; I need nothing. My outer life is as nought. I will take nothing less precious from you than your soul's brotherhood. But I am glad you are rich. You did not need money on that diamond ring. You had some other motive for bringing it.\"\nDeronda was startled by this clear-sightedness; but before he could reply Mordecai added- \"It is all one. If you needed money, we should still meet again. But you are rich?\"\n\"Only in the sense that everyone is rich who has more than he needs for himself.\"\n\"I desired that your life should be free,\" said Mordecai, dreamily; \"mine has been a bondage.\"\nIt was clear that he had no interest in the reason for Deronda's appearance at the Cohens' beyond his own purpose. Deronda, determine to put his question, said-\n\"Can you tell me why Mrs. Cohen, the mother, must not be spoken to about her daughter?\"\nThere was no immediate answer: Mordecai had heard the words, but had to drag his mind away from his passionate preoccupation. After a few moments, he replied-\n\"I know the reason. But I will not speak of family affairs which I have heard in the privacy of the family. I dwell in their home as in a sanctuary. Their history is their own possession.\"\nDeronda felt the blood mounting to his cheeks at this rebuke, and he found himself painfully baffled. He became conscious of emotional strain from the excitements of the day; and although he had the money in his pocket to redeem his ring, he recoiled from the further task of a visit to the Cohens'.\n\"I will part from you now,\" he said, before they reached Cohen's door; and Mordecai paused, looking up at him with an anxious fatigued face.\n\"When will you come back?\" he said.\n\"May I leave that unfixed? May I ask for you at the Cohens' any evening after your hour at the book-shop? There is no objection, I suppose, to their knowing that you and I meet?\"\n\"None,\" said Mordecai. \"But the days I wait now are longer than the years of my strength. Life shrinks: what was but a tithe is now the half. My hope abides in you.\"\n\"I will be faithful,\" said Deronda - he could not have left those words unuttered. \"I will come the first evening I can. Trust me.\"\nHe put out his hand. Mordecai, clasping it eagerly, said- \"This is come to pass, and the rest will come.\"\nThat was their good-bye.",
        "paragraph_chars": [
            [
                0,
                241
            ],
            [
                241,
                826
            ],
            [
                826,
                1258
            ],
            [
                1258,
                1600
            ],
            [
                1600,
                2259
            ],
            [
                2259,
                2652
            ],
            [
                2652,
                2780
            ],
            [
                2780,
                2945
            ],
            [
                2945,
                3011
            ],
            [
                3011,
                3153
            ],
            [
                3153,
                3221
            ],
            [
                3221,
                3576
            ],
            [
                3576,
                3763
            ],
            [
                3763,
                4504
            ],
            [
                4504,
                5081
            ],
            [
                5081,
                5399
            ],
            [
                5399,
                5865
            ],
            [
                5865,
                6076
            ],
            [
                6076,
                6671
            ],
            [
                6671,
                6982
            ],
            [
                6982,
                7445
            ],
            [
                7445,
                7531
            ],
            [
                7531,
                7591
            ],
            [
                7591,
                7851
            ],
            [
                7851,
                8002
            ],
            [
                8002,
                8703
            ],
            [
                8703,
                8901
            ],
            [
                8901,
                9816
            ],
            [
                9816,
                10045
            ],
            [
                10045,
                10709
            ],
            [
                10709,
                10826
            ],
            [
                10826,
                11810
            ],
            [
                11810,
                11962
            ],
            [
                11962,
                12008
            ],
            [
                12008,
                12254
            ],
            [
                12254,
                12450
            ],
            [
                12450,
                12715
            ],
            [
                12715,
                13194
            ],
            [
                13194,
                13801
            ],
            [
                13801,
                13915
            ],
            [
                13915,
                14325
            ],
            [
                14325,
                14378
            ],
            [
                14378,
                14502
            ],
            [
                14502,
                14925
            ],
            [
                14925,
                15076
            ],
            [
                15076,
                15223
            ],
            [
                15223,
                15678
            ],
            [
                15678,
                15864
            ],
            [
                15864,
                15933
            ],
            [
                15933,
                16239
            ],
            [
                16239,
                16318
            ],
            [
                16318,
                16704
            ],
            [
                16704,
                16805
            ],
            [
                16805,
                17590
            ],
            [
                17590,
                17935
            ],
            [
                17935,
                18150
            ],
            [
                18150,
                18826
            ],
            [
                18826,
                18955
            ],
            [
                18955,
                19178
            ],
            [
                19178,
                19338
            ],
            [
                19338,
                19577
            ],
            [
                19577,
                19751
            ],
            [
                19751,
                19833
            ],
            [
                19833,
                19928
            ],
            [
                19928,
                20089
            ],
            [
                20089,
                20177
            ],
            [
                20177,
                20336
            ],
            [
                20336,
                20525
            ],
            [
                20525,
                20825
            ],
            [
                20825,
                20966
            ],
            [
                20966,
                21002
            ],
            [
                21002,
                21181
            ],
            [
                21181,
                21347
            ],
            [
                21347,
                21479
            ],
            [
                21479,
                21585
            ],
            [
                21585,
                21609
            ]
        ],
        "segment_chars": [
            [
                0,
                97
            ],
            [
                97,
                241
            ],
            [
                241,
                414
            ],
            [
                414,
                661
            ],
            [
                661,
                826
            ],
            [
                826,
                1039
            ],
            [
                1039,
                1204
            ],
            [
                1204,
                1258
            ],
            [
                1258,
                1362
            ],
            [
                1362,
                1600
            ],
            [
                1600,
                1655
            ],
            [
                1655,
                1903
            ],
            [
                1903,
                2259
            ],
            [
                2259,
                2374
            ],
            [
                2374,
                2454
            ],
            [
                2454,
                2528
            ],
            [
                2528,
                2652
            ],
            [
                2652,
                2780
            ],
            [
                2780,
                2897
            ],
            [
                2897,
                2945
            ],
            [
                2945,
                3011
            ],
            [
                3011,
                3089
            ],
            [
                3089,
                3153
            ],
            [
                3153,
                3196
            ],
            [
                3196,
                3221
            ],
            [
                3221,
                3269
            ],
            [
                3269,
                3316
            ],
            [
                3316,
                3469
            ],
            [
                3469,
                3576
            ],
            [
                3576,
                3659
            ],
            [
                3659,
                3724
            ],
            [
                3724,
                3763
            ],
            [
                3763,
                3792
            ],
            [
                3792,
                4000
            ],
            [
                4000,
                4039
            ],
            [
                4039,
                4124
            ],
            [
                4124,
                4259
            ],
            [
                4259,
                4304
            ],
            [
                4304,
                4504
            ],
            [
                4504,
                4527
            ],
            [
                4527,
                4563
            ],
            [
                4563,
                4737
            ],
            [
                4737,
                4821
            ],
            [
                4821,
                5081
            ],
            [
                5081,
                5259
            ],
            [
                5259,
                5342
            ],
            [
                5342,
                5399
            ],
            [
                5399,
                5616
            ],
            [
                5616,
                5708
            ],
            [
                5708,
                5722
            ],
            [
                5722,
                5783
            ],
            [
                5783,
                5821
            ],
            [
                5821,
                5865
            ],
            [
                5865,
                6076
            ],
            [
                6076,
                6417
            ],
            [
                6417,
                6671
            ],
            [
                6671,
                6718
            ],
            [
                6718,
                6982
            ],
            [
                6982,
                7053
            ],
            [
                7053,
                7258
            ],
            [
                7258,
                7426
            ],
            [
                7426,
                7445
            ],
            [
                7445,
                7531
            ],
            [
                7531,
                7567
            ],
            [
                7567,
                7591
            ],
            [
                7591,
                7697
            ],
            [
                7697,
                7723
            ],
            [
                7723,
                7823
            ],
            [
                7823,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7901,
                8002
            ],
            [
                8002,
                8135
            ],
            [
                8135,
                8187
            ],
            [
                8187,
                8285
            ],
            [
                8285,
                8336
            ],
            [
                8336,
                8521
            ],
            [
                8521,
                8631
            ],
            [
                8631,
                8703
            ],
            [
                8703,
                8764
            ],
            [
                8764,
                8789
            ],
            [
                8789,
                8883
            ],
            [
                8883,
                8901
            ],
            [
                8901,
                9063
            ],
            [
                9063,
                9319
            ],
            [
                9319,
                9354
            ],
            [
                9354,
                9542
            ],
            [
                9542,
                9563
            ],
            [
                9563,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                9816
            ],
            [
                9816,
                9896
            ],
            [
                9896,
                9926
            ],
            [
                9926,
                10045
            ],
            [
                10045,
                10096
            ],
            [
                10096,
                10115
            ],
            [
                10115,
                10188
            ],
            [
                10188,
                10354
            ],
            [
                10354,
                10399
            ],
            [
                10399,
                10569
            ],
            [
                10569,
                10709
            ],
            [
                10709,
                10754
            ],
            [
                10754,
                10826
            ],
            [
                10826,
                10948
            ],
            [
                10948,
                10993
            ],
            [
                10993,
                11043
            ],
            [
                11043,
                11288
            ],
            [
                11288,
                11406
            ],
            [
                11406,
                11430
            ],
            [
                11430,
                11447
            ],
            [
                11447,
                11527
            ],
            [
                11527,
                11565
            ],
            [
                11565,
                11628
            ],
            [
                11628,
                11639
            ],
            [
                11639,
                11771
            ],
            [
                11771,
                11810
            ],
            [
                11810,
                11962
            ],
            [
                11962,
                12008
            ],
            [
                12008,
                12030
            ],
            [
                12030,
                12051
            ],
            [
                12051,
                12098
            ],
            [
                12098,
                12165
            ],
            [
                12165,
                12217
            ],
            [
                12217,
                12254
            ],
            [
                12254,
                12330
            ],
            [
                12330,
                12378
            ],
            [
                12378,
                12421
            ],
            [
                12421,
                12450
            ],
            [
                12450,
                12534
            ],
            [
                12534,
                12568
            ],
            [
                12568,
                12715
            ],
            [
                12715,
                12920
            ],
            [
                12920,
                12960
            ],
            [
                12960,
                13099
            ],
            [
                13099,
                13121
            ],
            [
                13121,
                13144
            ],
            [
                13144,
                13194
            ],
            [
                13194,
                13234
            ],
            [
                13234,
                13494
            ],
            [
                13494,
                13610
            ],
            [
                13610,
                13690
            ],
            [
                13690,
                13771
            ],
            [
                13771,
                13801
            ],
            [
                13801,
                13862
            ],
            [
                13862,
                13915
            ],
            [
                13915,
                13990
            ],
            [
                13990,
                14048
            ],
            [
                14048,
                14108
            ],
            [
                14108,
                14325
            ],
            [
                14325,
                14349
            ],
            [
                14349,
                14378
            ],
            [
                14378,
                14405
            ],
            [
                14405,
                14440
            ],
            [
                14440,
                14478
            ],
            [
                14478,
                14502
            ],
            [
                14502,
                14738
            ],
            [
                14738,
                14874
            ],
            [
                14874,
                14925
            ],
            [
                14925,
                14956
            ],
            [
                14956,
                14987
            ],
            [
                14987,
                15023
            ],
            [
                15023,
                15076
            ],
            [
                15076,
                15223
            ],
            [
                15223,
                15293
            ],
            [
                15293,
                15401
            ],
            [
                15401,
                15548
            ],
            [
                15548,
                15657
            ],
            [
                15657,
                15678
            ],
            [
                15678,
                15864
            ],
            [
                15864,
                15933
            ],
            [
                15933,
                16054
            ],
            [
                16054,
                16070
            ],
            [
                16070,
                16101
            ],
            [
                16101,
                16220
            ],
            [
                16220,
                16239
            ],
            [
                16239,
                16318
            ],
            [
                16318,
                16376
            ],
            [
                16376,
                16426
            ],
            [
                16426,
                16545
            ],
            [
                16545,
                16576
            ],
            [
                16576,
                16704
            ],
            [
                16704,
                16805
            ],
            [
                16805,
                16822
            ],
            [
                16822,
                16869
            ],
            [
                16869,
                16916
            ],
            [
                16916,
                17150
            ],
            [
                17150,
                17239
            ],
            [
                17239,
                17283
            ],
            [
                17283,
                17311
            ],
            [
                17311,
                17351
            ],
            [
                17351,
                17376
            ],
            [
                17376,
                17424
            ],
            [
                17424,
                17447
            ],
            [
                17447,
                17562
            ],
            [
                17562,
                17590
            ],
            [
                17590,
                17652
            ],
            [
                17652,
                17790
            ],
            [
                17790,
                17915
            ],
            [
                17915,
                17935
            ],
            [
                17935,
                18000
            ],
            [
                18000,
                18067
            ],
            [
                18067,
                18094
            ],
            [
                18094,
                18117
            ],
            [
                18117,
                18150
            ],
            [
                18150,
                18209
            ],
            [
                18209,
                18275
            ],
            [
                18275,
                18491
            ],
            [
                18491,
                18680
            ],
            [
                18680,
                18826
            ],
            [
                18826,
                18955
            ],
            [
                18955,
                19016
            ],
            [
                19016,
                19147
            ],
            [
                19147,
                19178
            ],
            [
                19178,
                19211
            ],
            [
                19211,
                19338
            ],
            [
                19338,
                19359
            ],
            [
                19359,
                19387
            ],
            [
                19387,
                19460
            ],
            [
                19460,
                19488
            ],
            [
                19488,
                19533
            ],
            [
                19533,
                19577
            ],
            [
                19577,
                19683
            ],
            [
                19683,
                19732
            ],
            [
                19732,
                19751
            ],
            [
                19751,
                19833
            ],
            [
                19833,
                19928
            ],
            [
                19928,
                20043
            ],
            [
                20043,
                20089
            ],
            [
                20089,
                20177
            ],
            [
                20177,
                20303
            ],
            [
                20303,
                20336
            ],
            [
                20336,
                20356
            ],
            [
                20356,
                20444
            ],
            [
                20444,
                20485
            ],
            [
                20485,
                20525
            ],
            [
                20525,
                20627
            ],
            [
                20627,
                20825
            ],
            [
                20825,
                20966
            ],
            [
                20966,
                20993
            ],
            [
                20993,
                21002
            ],
            [
                21002,
                21029
            ],
            [
                21029,
                21108
            ],
            [
                21108,
                21181
            ],
            [
                21181,
                21204
            ],
            [
                21204,
                21271
            ],
            [
                21271,
                21323
            ],
            [
                21323,
                21347
            ],
            [
                21347,
                21430
            ],
            [
                21430,
                21468
            ],
            [
                21468,
                21479
            ],
            [
                21479,
                21500
            ],
            [
                21500,
                21585
            ],
            [
                21585,
                21609
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                24,
                40
            ],
            [
                49,
                57
            ],
            [
                58,
                76
            ],
            [
                85,
                97
            ],
            [
                97,
                113
            ],
            [
                114,
                127
            ],
            [
                131,
                134
            ],
            [
                145,
                167
            ],
            [
                172,
                174
            ],
            [
                181,
                189
            ],
            [
                193,
                197
            ],
            [
                202,
                241
            ],
            [
                241,
                376
            ],
            [
                386,
                391
            ],
            [
                392,
                414
            ],
            [
                414,
                421
            ],
            [
                433,
                440
            ],
            [
                441,
                453
            ],
            [
                454,
                495
            ],
            [
                503,
                543
            ],
            [
                549,
                659
            ],
            [
                659,
                661
            ],
            [
                661,
                666
            ],
            [
                673,
                681
            ],
            [
                682,
                693
            ],
            [
                702,
                718
            ],
            [
                719,
                722
            ],
            [
                732,
                804
            ],
            [
                805,
                808
            ],
            [
                809,
                812
            ],
            [
                816,
                824
            ],
            [
                824,
                826
            ],
            [
                826,
                827
            ],
            [
                827,
                835
            ],
            [
                836,
                847
            ],
            [
                848,
                853
            ],
            [
                869,
                873
            ],
            [
                882,
                922
            ],
            [
                923,
                928
            ],
            [
                937,
                949
            ],
            [
                956,
                1039
            ],
            [
                1042,
                1051
            ],
            [
                1052,
                1061
            ],
            [
                1061,
                1087
            ],
            [
                1091,
                1112
            ],
            [
                1118,
                1127
            ],
            [
                1127,
                1133
            ],
            [
                1143,
                1198
            ],
            [
                1202,
                1204
            ],
            [
                1204,
                1215
            ],
            [
                1221,
                1255
            ],
            [
                1258,
                1360
            ],
            [
                1362,
                1365
            ],
            [
                1371,
                1415
            ],
            [
                1416,
                1551
            ],
            [
                1552,
                1579
            ],
            [
                1579,
                1580
            ],
            [
                1581,
                1582
            ],
            [
                1590,
                1598
            ],
            [
                1598,
                1600
            ],
            [
                1600,
                1623
            ],
            [
                1635,
                1655
            ],
            [
                1655,
                1667
            ],
            [
                1668,
                1696
            ],
            [
                1697,
                1703
            ],
            [
                1705,
                1793
            ],
            [
                1803,
                1805
            ],
            [
                1806,
                1810
            ],
            [
                1816,
                1825
            ],
            [
                1826,
                1837
            ],
            [
                1838,
                1901
            ],
            [
                1901,
                1903
            ],
            [
                1903,
                1935
            ],
            [
                1936,
                2021
            ],
            [
                2022,
                2092
            ],
            [
                2093,
                2095
            ],
            [
                2103,
                2158
            ],
            [
                2159,
                2182
            ],
            [
                2185,
                2259
            ],
            [
                2259,
                2329
            ],
            [
                2339,
                2374
            ],
            [
                2374,
                2382
            ],
            [
                2383,
                2388
            ],
            [
                2389,
                2396
            ],
            [
                2406,
                2429
            ],
            [
                2430,
                2454
            ],
            [
                2454,
                2463
            ],
            [
                2464,
                2503
            ],
            [
                2504,
                2509
            ],
            [
                2510,
                2517
            ],
            [
                2518,
                2526
            ],
            [
                2526,
                2528
            ],
            [
                2528,
                2594
            ],
            [
                2605,
                2652
            ],
            [
                2652,
                2736
            ],
            [
                2747,
                2762
            ],
            [
                2763,
                2765
            ],
            [
                2766,
                2780
            ],
            [
                2780,
                2807
            ],
            [
                2808,
                2855
            ],
            [
                2856,
                2897
            ],
            [
                2897,
                2918
            ],
            [
                2921,
                2933
            ],
            [
                2939,
                2945
            ],
            [
                2945,
                3011
            ],
            [
                3011,
                3089
            ],
            [
                3093,
                3108
            ],
            [
                3130,
                3131
            ],
            [
                3135,
                3140
            ],
            [
                3151,
                3153
            ],
            [
                3153,
                3196
            ],
            [
                3196,
                3221
            ],
            [
                3221,
                3269
            ],
            [
                3269,
                3316
            ],
            [
                3316,
                3469
            ],
            [
                3478,
                3485
            ],
            [
                3495,
                3498
            ],
            [
                3517,
                3531
            ],
            [
                3533,
                3549
            ],
            [
                3574,
                3576
            ],
            [
                3576,
                3577
            ],
            [
                3579,
                3586
            ],
            [
                3593,
                3659
            ],
            [
                3659,
                3696
            ],
            [
                3708,
                3724
            ],
            [
                3724,
                3760
            ],
            [
                3760,
                3763
            ],
            [
                3763,
                3792
            ],
            [
                3792,
                3834
            ],
            [
                3835,
                3843
            ],
            [
                3849,
                3883
            ],
            [
                3886,
                3911
            ],
            [
                3923,
                3930
            ],
            [
                3936,
                4000
            ],
            [
                4000,
                4039
            ],
            [
                4039,
                4071
            ],
            [
                4072,
                4124
            ],
            [
                4124,
                4259
            ],
            [
                4259,
                4262
            ],
            [
                4267,
                4304
            ],
            [
                4304,
                4341
            ],
            [
                4344,
                4350
            ],
            [
                4350,
                4351
            ],
            [
                4357,
                4382
            ],
            [
                4385,
                4434
            ],
            [
                4437,
                4448
            ],
            [
                4451,
                4504
            ],
            [
                4504,
                4527
            ],
            [
                4527,
                4552
            ],
            [
                4561,
                4563
            ],
            [
                4567,
                4572
            ],
            [
                4573,
                4630
            ],
            [
                4644,
                4666
            ],
            [
                4671,
                4672
            ],
            [
                4681,
                4693
            ],
            [
                4705,
                4713
            ],
            [
                4714,
                4737
            ],
            [
                4747,
                4767
            ],
            [
                4768,
                4771
            ],
            [
                4777,
                4784
            ],
            [
                4785,
                4818
            ],
            [
                4821,
                4823
            ],
            [
                4830,
                4836
            ],
            [
                4837,
                4841
            ],
            [
                4842,
                4906
            ],
            [
                4907,
                4910
            ],
            [
                4911,
                4920
            ],
            [
                4921,
                4923
            ],
            [
                4924,
                4934
            ],
            [
                4942,
                4950
            ],
            [
                4951,
                4965
            ],
            [
                4965,
                4966
            ],
            [
                4972,
                4973
            ],
            [
                4987,
                4992
            ],
            [
                4993,
                5040
            ],
            [
                5050,
                5052
            ],
            [
                5053,
                5054
            ],
            [
                5055,
                5060
            ],
            [
                5060,
                5061
            ],
            [
                5067,
                5070
            ],
            [
                5071,
                5079
            ],
            [
                5079,
                5080
            ],
            [
                5081,
                5121
            ],
            [
                5131,
                5135
            ],
            [
                5137,
                5172
            ],
            [
                5184,
                5259
            ],
            [
                5259,
                5311
            ],
            [
                5312,
                5341
            ],
            [
                5342,
                5356
            ],
            [
                5357,
                5359
            ],
            [
                5360,
                5363
            ],
            [
                5364,
                5397
            ],
            [
                5408,
                5409
            ],
            [
                5410,
                5417
            ],
            [
                5422,
                5425
            ],
            [
                5436,
                5441
            ],
            [
                5441,
                5442
            ],
            [
                5443,
                5446
            ],
            [
                5447,
                5498
            ],
            [
                5499,
                5507
            ],
            [
                5508,
                5512
            ],
            [
                5513,
                5521
            ],
            [
                5521,
                5543
            ],
            [
                5544,
                5551
            ],
            [
                5558,
                5563
            ],
            [
                5563,
                5564
            ],
            [
                5565,
                5590
            ],
            [
                5602,
                5604
            ],
            [
                5608,
                5616
            ],
            [
                5616,
                5619
            ],
            [
                5620,
                5633
            ],
            [
                5634,
                5654
            ],
            [
                5655,
                5708
            ],
            [
                5708,
                5722
            ],
            [
                5722,
                5735
            ],
            [
                5739,
                5750
            ],
            [
                5751,
                5761
            ],
            [
                5763,
                5781
            ],
            [
                5781,
                5783
            ],
            [
                5797,
                5799
            ],
            [
                5806,
                5808
            ],
            [
                5819,
                5820
            ],
            [
                5823,
                5828
            ],
            [
                5829,
                5850
            ],
            [
                5851,
                5853
            ],
            [
                5854,
                5862
            ],
            [
                5862,
                5865
            ],
            [
                5865,
                5927
            ],
            [
                5928,
                5950
            ],
            [
                5957,
                6050
            ],
            [
                6051,
                6075
            ],
            [
                6076,
                6083
            ],
            [
                6084,
                6147
            ],
            [
                6152,
                6167
            ],
            [
                6168,
                6176
            ],
            [
                6176,
                6177
            ],
            [
                6187,
                6263
            ],
            [
                6264,
                6272
            ],
            [
                6273,
                6284
            ],
            [
                6287,
                6329
            ],
            [
                6335,
                6352
            ],
            [
                6353,
                6358
            ],
            [
                6359,
                6373
            ],
            [
                6386,
                6415
            ],
            [
                6425,
                6448
            ],
            [
                6448,
                6473
            ],
            [
                6473,
                6536
            ],
            [
                6537,
                6670
            ],
            [
                6671,
                6718
            ],
            [
                6718,
                6730
            ],
            [
                6731,
                6787
            ],
            [
                6788,
                6790
            ],
            [
                6791,
                6885
            ],
            [
                6892,
                6981
            ],
            [
                6982,
                6991
            ],
            [
                6992,
                7009
            ],
            [
                7019,
                7053
            ],
            [
                7053,
                7055
            ],
            [
                7072,
                7128
            ],
            [
                7128,
                7157
            ],
            [
                7170,
                7205
            ],
            [
                7205,
                7206
            ],
            [
                7207,
                7210
            ],
            [
                7211,
                7214
            ],
            [
                7220,
                7235
            ],
            [
                7248,
                7254
            ],
            [
                7256,
                7258
            ],
            [
                7258,
                7363
            ],
            [
                7366,
                7386
            ],
            [
                7387,
                7424
            ],
            [
                7424,
                7426
            ],
            [
                7426,
                7445
            ],
            [
                7445,
                7449
            ],
            [
                7464,
                7528
            ],
            [
                7531,
                7567
            ],
            [
                7567,
                7588
            ],
            [
                7588,
                7591
            ],
            [
                7591,
                7671
            ],
            [
                7672,
                7697
            ],
            [
                7697,
                7723
            ],
            [
                7723,
                7741
            ],
            [
                7744,
                7763
            ],
            [
                7766,
                7823
            ],
            [
                7823,
                7851
            ],
            [
                7851,
                7899
            ],
            [
                7899,
                7901
            ],
            [
                7901,
                7953
            ],
            [
                7960,
                7970
            ],
            [
                7971,
                7975
            ],
            [
                7976,
                7984
            ],
            [
                8000,
                8002
            ],
            [
                8002,
                8135
            ],
            [
                8135,
                8139
            ],
            [
                8140,
                8153
            ],
            [
                8154,
                8187
            ],
            [
                8187,
                8237
            ],
            [
                8240,
                8285
            ],
            [
                8285,
                8336
            ],
            [
                8336,
                8394
            ],
            [
                8397,
                8405
            ],
            [
                8406,
                8418
            ],
            [
                8419,
                8428
            ],
            [
                8429,
                8432
            ],
            [
                8433,
                8436
            ],
            [
                8437,
                8451
            ],
            [
                8454,
                8487
            ],
            [
                8488,
                8521
            ],
            [
                8521,
                8524
            ],
            [
                8525,
                8533
            ],
            [
                8541,
                8552
            ],
            [
                8553,
                8557
            ],
            [
                8557,
                8570
            ],
            [
                8571,
                8573
            ],
            [
                8574,
                8577
            ],
            [
                8577,
                8615
            ],
            [
                8616,
                8631
            ],
            [
                8631,
                8699
            ],
            [
                8699,
                8703
            ],
            [
                8703,
                8726
            ],
            [
                8728,
                8731
            ],
            [
                8732,
                8740
            ],
            [
                8741,
                8744
            ],
            [
                8745,
                8751
            ],
            [
                8752,
                8764
            ],
            [
                8764,
                8787
            ],
            [
                8789,
                8805
            ],
            [
                8806,
                8878
            ],
            [
                8881,
                8883
            ],
            [
                8883,
                8899
            ],
            [
                8902,
                8936
            ],
            [
                8939,
                8975
            ],
            [
                8975,
                9063
            ],
            [
                9063,
                9073
            ],
            [
                9074,
                9076
            ],
            [
                9077,
                9088
            ],
            [
                9090,
                9149
            ],
            [
                9155,
                9158
            ],
            [
                9167,
                9172
            ],
            [
                9172,
                9259
            ],
            [
                9272,
                9286
            ],
            [
                9293,
                9319
            ],
            [
                9319,
                9324
            ],
            [
                9325,
                9346
            ],
            [
                9352,
                9354
            ],
            [
                9358,
                9491
            ],
            [
                9492,
                9501
            ],
            [
                9509,
                9542
            ],
            [
                9542,
                9563
            ],
            [
                9563,
                9617
            ],
            [
                9621,
                9681
            ],
            [
                9685,
                9755
            ],
            [
                9760,
                9763
            ],
            [
                9764,
                9816
            ],
            [
                9816,
                9844
            ],
            [
                9845,
                9852
            ],
            [
                9858,
                9859
            ],
            [
                9860,
                9861
            ],
            [
                9868,
                9871
            ],
            [
                9872,
                9896
            ],
            [
                9896,
                9904
            ],
            [
                9905,
                9926
            ],
            [
                9926,
                10033
            ],
            [
                10034,
                10045
            ],
            [
                10045,
                10084
            ],
            [
                10085,
                10096
            ],
            [
                10096,
                10113
            ],
            [
                10113,
                10115
            ],
            [
                10115,
                10116
            ],
            [
                10123,
                10188
            ],
            [
                10188,
                10212
            ],
            [
                10215,
                10239
            ],
            [
                10240,
                10243
            ],
            [
                10244,
                10260
            ],
            [
                10268,
                10310
            ],
            [
                10310,
                10315
            ],
            [
                10316,
                10332
            ],
            [
                10340,
                10354
            ],
            [
                10354,
                10397
            ],
            [
                10397,
                10399
            ],
            [
                10399,
                10401
            ],
            [
                10412,
                10569
            ],
            [
                10569,
                10572
            ],
            [
                10573,
                10644
            ],
            [
                10648,
                10657
            ],
            [
                10658,
                10664
            ],
            [
                10666,
                10709
            ],
            [
                10709,
                10754
            ],
            [
                10754,
                10767
            ],
            [
                10768,
                10785
            ],
            [
                10786,
                10826
            ],
            [
                10826,
                10827
            ],
            [
                10827,
                10846
            ],
            [
                10852,
                10948
            ],
            [
                10948,
                10991
            ],
            [
                10991,
                10993
            ],
            [
                10993,
                11043
            ],
            [
                11043,
                11151
            ],
            [
                11152,
                11155
            ],
            [
                11161,
                11204
            ],
            [
                11212,
                11239
            ],
            [
                11240,
                11241
            ],
            [
                11242,
                11288
            ],
            [
                11288,
                11349
            ],
            [
                11350,
                11406
            ],
            [
                11406,
                11430
            ],
            [
                11430,
                11440
            ],
            [
                11441,
                11447
            ],
            [
                11447,
                11483
            ],
            [
                11486,
                11500
            ],
            [
                11501,
                11511
            ],
            [
                11516,
                11518
            ],
            [
                11519,
                11527
            ],
            [
                11527,
                11530
            ],
            [
                11531,
                11535
            ],
            [
                11545,
                11565
            ],
            [
                11565,
                11628
            ],
            [
                11628,
                11639
            ],
            [
                11639,
                11702
            ],
            [
                11707,
                11771
            ],
            [
                11771,
                11791
            ],
            [
                11792,
                11796
            ],
            [
                11805,
                11807
            ],
            [
                11810,
                11825
            ],
            [
                11832,
                11910
            ],
            [
                11914,
                11962
            ],
            [
                11962,
                12006
            ],
            [
                12008,
                12017
            ],
            [
                12020,
                12030
            ],
            [
                12030,
                12051
            ],
            [
                12051,
                12095
            ],
            [
                12098,
                12106
            ],
            [
                12113,
                12154
            ],
            [
                12155,
                12165
            ],
            [
                12165,
                12176
            ],
            [
                12177,
                12217
            ],
            [
                12217,
                12252
            ],
            [
                12254,
                12255
            ],
            [
                12255,
                12306
            ],
            [
                12306,
                12307
            ],
            [
                12308,
                12312
            ],
            [
                12323,
                12328
            ],
            [
                12328,
                12330
            ],
            [
                12330,
                12334
            ],
            [
                12335,
                12348
            ],
            [
                12349,
                12356
            ],
            [
                12357,
                12361
            ],
            [
                12376,
                12378
            ],
            [
                12378,
                12421
            ],
            [
                12421,
                12426
            ],
            [
                12432,
                12435
            ],
            [
                12436,
                12450
            ],
            [
                12450,
                12506
            ],
            [
                12507,
                12511
            ],
            [
                12512,
                12521
            ],
            [
                12522,
                12534
            ],
            [
                12534,
                12568
            ],
            [
                12568,
                12613
            ],
            [
                12626,
                12635
            ],
            [
                12638,
                12657
            ],
            [
                12667,
                12674
            ],
            [
                12683,
                12686
            ],
            [
                12687,
                12714
            ],
            [
                12715,
                12723
            ],
            [
                12730,
                12753
            ],
            [
                12754,
                12813
            ],
            [
                12820,
                12837
            ],
            [
                12837,
                12855
            ],
            [
                12857,
                12920
            ],
            [
                12920,
                12950
            ],
            [
                12954,
                12960
            ],
            [
                12960,
                13099
            ],
            [
                13099,
                13121
            ],
            [
                13121,
                13144
            ],
            [
                13144,
                13194
            ],
            [
                13194,
                13215
            ],
            [
                13221,
                13234
            ],
            [
                13234,
                13251
            ],
            [
                13251,
                13328
            ],
            [
                13335,
                13345
            ],
            [
                13345,
                13410
            ],
            [
                13411,
                13413
            ],
            [
                13414,
                13462
            ],
            [
                13492,
                13494
            ],
            [
                13494,
                13497
            ],
            [
                13498,
                13580
            ],
            [
                13592,
                13608
            ],
            [
                13608,
                13610
            ],
            [
                13610,
                13613
            ],
            [
                13614,
                13624
            ],
            [
                13625,
                13628
            ],
            [
                13633,
                13635
            ],
            [
                13655,
                13657
            ],
            [
                13658,
                13688
            ],
            [
                13688,
                13690
            ],
            [
                13690,
                13714
            ],
            [
                13715,
                13717
            ],
            [
                13718,
                13769
            ],
            [
                13769,
                13771
            ],
            [
                13776,
                13798
            ],
            [
                13801,
                13862
            ],
            [
                13862,
                13915
            ],
            [
                13915,
                13990
            ],
            [
                13990,
                14010
            ],
            [
                14011,
                14033
            ],
            [
                14046,
                14048
            ],
            [
                14048,
                14059
            ],
            [
                14060,
                14106
            ],
            [
                14106,
                14108
            ],
            [
                14108,
                14117
            ],
            [
                14118,
                14186
            ],
            [
                14191,
                14201
            ],
            [
                14202,
                14229
            ],
            [
                14237,
                14239
            ],
            [
                14252,
                14284
            ],
            [
                14286,
                14325
            ],
            [
                14325,
                14349
            ],
            [
                14349,
                14361
            ],
            [
                14362,
                14371
            ],
            [
                14376,
                14378
            ],
            [
                14378,
                14386
            ],
            [
                14387,
                14403
            ],
            [
                14405,
                14406
            ],
            [
                14406,
                14440
            ],
            [
                14443,
                14447
            ],
            [
                14448,
                14478
            ],
            [
                14478,
                14479
            ],
            [
                14479,
                14499
            ],
            [
                14502,
                14546
            ],
            [
                14553,
                14566
            ],
            [
                14569,
                14621
            ],
            [
                14622,
                14661
            ],
            [
                14662,
                14683
            ],
            [
                14689,
                14690
            ],
            [
                14698,
                14738
            ],
            [
                14738,
                14741
            ],
            [
                14742,
                14749
            ],
            [
                14755,
                14759
            ],
            [
                14760,
                14771
            ],
            [
                14775,
                14782
            ],
            [
                14783,
                14809
            ],
            [
                14814,
                14838
            ],
            [
                14839,
                14874
            ],
            [
                14874,
                14923
            ],
            [
                14925,
                14956
            ],
            [
                14956,
                14987
            ],
            [
                14987,
                15023
            ],
            [
                15023,
                15076
            ],
            [
                15076,
                15152
            ],
            [
                15156,
                15159
            ],
            [
                15167,
                15222
            ],
            [
                15223,
                15239
            ],
            [
                15242,
                15293
            ],
            [
                15293,
                15314
            ],
            [
                15315,
                15399
            ],
            [
                15399,
                15401
            ],
            [
                15401,
                15480
            ],
            [
                15482,
                15491
            ],
            [
                15496,
                15502
            ],
            [
                15503,
                15548
            ],
            [
                15548,
                15657
            ],
            [
                15657,
                15675
            ],
            [
                15675,
                15678
            ],
            [
                15678,
                15679
            ],
            [
                15679,
                15718
            ],
            [
                15730,
                15765
            ],
            [
                15766,
                15776
            ],
            [
                15778,
                15779
            ],
            [
                15796,
                15832
            ],
            [
                15837,
                15839
            ],
            [
                15862,
                15864
            ],
            [
                15864,
                15879
            ],
            [
                15880,
                15887
            ],
            [
                15888,
                15907
            ],
            [
                15908,
                15910
            ],
            [
                15911,
                15933
            ],
            [
                15933,
                15985
            ],
            [
                15988,
                16054
            ],
            [
                16054,
                16070
            ],
            [
                16070,
                16101
            ],
            [
                16101,
                16113
            ],
            [
                16114,
                16154
            ],
            [
                16156,
                16220
            ],
            [
                16220,
                16236
            ],
            [
                16239,
                16257
            ],
            [
                16261,
                16272
            ],
            [
                16283,
                16290
            ],
            [
                16291,
                16300
            ],
            [
                16301,
                16318
            ],
            [
                16318,
                16376
            ],
            [
                16377,
                16401
            ],
            [
                16402,
                16426
            ],
            [
                16426,
                16545
            ],
            [
                16545,
                16576
            ],
            [
                16576,
                16704
            ],
            [
                16704,
                16732
            ],
            [
                16732,
                16803
            ],
            [
                16805,
                16809
            ],
            [
                16810,
                16815
            ],
            [
                16816,
                16822
            ],
            [
                16822,
                16867
            ],
            [
                16869,
                16916
            ],
            [
                16916,
                17150
            ],
            [
                17150,
                17239
            ],
            [
                17239,
                17265
            ],
            [
                17271,
                17276
            ],
            [
                17281,
                17283
            ],
            [
                17283,
                17311
            ],
            [
                17311,
                17316
            ],
            [
                17331,
                17351
            ],
            [
                17351,
                17376
            ],
            [
                17376,
                17424
            ],
            [
                17424,
                17447
            ],
            [
                17455,
                17501
            ],
            [
                17502,
                17540
            ],
            [
                17543,
                17562
            ],
            [
                17562,
                17590
            ],
            [
                17590,
                17597
            ],
            [
                17604,
                17609
            ],
            [
                17611,
                17620
            ],
            [
                17621,
                17638
            ],
            [
                17650,
                17652
            ],
            [
                17655,
                17680
            ],
            [
                17681,
                17687
            ],
            [
                17688,
                17739
            ],
            [
                17740,
                17750
            ],
            [
                17756,
                17765
            ],
            [
                17773,
                17790
            ],
            [
                17802,
                17827
            ],
            [
                17850,
                17852
            ],
            [
                17853,
                17913
            ],
            [
                17913,
                17915
            ],
            [
                17915,
                17933
            ],
            [
                17935,
                17952
            ],
            [
                17953,
                17998
            ],
            [
                17998,
                18000
            ],
            [
                18000,
                18007
            ],
            [
                18010,
                18067
            ],
            [
                18067,
                18094
            ],
            [
                18094,
                18115
            ],
            [
                18120,
                18130
            ],
            [
                18139,
                18147
            ],
            [
                18147,
                18150
            ],
            [
                18150,
                18198
            ],
            [
                18199,
                18202
            ],
            [
                18207,
                18209
            ],
            [
                18209,
                18226
            ],
            [
                18227,
                18230
            ],
            [
                18231,
                18235
            ],
            [
                18236,
                18243
            ],
            [
                18244,
                18255
            ],
            [
                18256,
                18273
            ],
            [
                18273,
                18275
            ],
            [
                18275,
                18382
            ],
            [
                18385,
                18491
            ],
            [
                18491,
                18680
            ],
            [
                18680,
                18826
            ],
            [
                18826,
                18919
            ],
            [
                18919,
                18955
            ],
            [
                18955,
                19014
            ],
            [
                19014,
                19016
            ],
            [
                19016,
                19087
            ],
            [
                19089,
                19092
            ],
            [
                19093,
                19108
            ],
            [
                19108,
                19116
            ],
            [
                19117,
                19121
            ],
            [
                19122,
                19128
            ],
            [
                19128,
                19147
            ],
            [
                19147,
                19153
            ],
            [
                19158,
                19165
            ],
            [
                19170,
                19175
            ],
            [
                19175,
                19178
            ],
            [
                19178,
                19194
            ],
            [
                19194,
                19211
            ],
            [
                19211,
                19338
            ],
            [
                19338,
                19359
            ],
            [
                19359,
                19387
            ],
            [
                19387,
                19460
            ],
            [
                19460,
                19488
            ],
            [
                19488,
                19533
            ],
            [
                19533,
                19577
            ],
            [
                19577,
                19588
            ],
            [
                19589,
                19665
            ],
            [
                19667,
                19683
            ],
            [
                19686,
                19689
            ],
            [
                19697,
                19703
            ],
            [
                19704,
                19713
            ],
            [
                19720,
                19732
            ],
            [
                19732,
                19750
            ],
            [
                19751,
                19752
            ],
            [
                19757,
                19774
            ],
            [
                19784,
                19833
            ],
            [
                19833,
                19899
            ],
            [
                19901,
                19928
            ],
            [
                19928,
                19971
            ],
            [
                19983,
                20025
            ],
            [
                20026,
                20033
            ],
            [
                20034,
                20043
            ],
            [
                20043,
                20050
            ],
            [
                20050,
                20051
            ],
            [
                20062,
                20068
            ],
            [
                20073,
                20081
            ],
            [
                20081,
                20082
            ],
            [
                20083,
                20087
            ],
            [
                20089,
                20177
            ],
            [
                20177,
                20206
            ],
            [
                20208,
                20262
            ],
            [
                20263,
                20303
            ],
            [
                20303,
                20334
            ],
            [
                20336,
                20356
            ],
            [
                20356,
                20376
            ],
            [
                20377,
                20379
            ],
            [
                20380,
                20444
            ],
            [
                20444,
                20460
            ],
            [
                20466,
                20485
            ],
            [
                20485,
                20498
            ],
            [
                20499,
                20525
            ],
            [
                20525,
                20570
            ],
            [
                20579,
                20585
            ],
            [
                20585,
                20593
            ],
            [
                20594,
                20625
            ],
            [
                20625,
                20627
            ],
            [
                20627,
                20636
            ],
            [
                20637,
                20822
            ],
            [
                20825,
                20861
            ],
            [
                20862,
                20873
            ],
            [
                20882,
                20964
            ],
            [
                20964,
                20966
            ],
            [
                20966,
                20993
            ],
            [
                20993,
                21000
            ],
            [
                21000,
                21002
            ],
            [
                21002,
                21029
            ],
            [
                21029,
                21108
            ],
            [
                21108,
                21178
            ],
            [
                21178,
                21181
            ],
            [
                21181,
                21204
            ],
            [
                21204,
                21271
            ],
            [
                21271,
                21323
            ],
            [
                21323,
                21347
            ],
            [
                21347,
                21381
            ],
            [
                21384,
                21430
            ],
            [
                21430,
                21466
            ],
            [
                21466,
                21468
            ],
            [
                21468,
                21479
            ],
            [
                21479,
                21493
            ],
            [
                21494,
                21500
            ],
            [
                21500,
                21530
            ],
            [
                21531,
                21535
            ],
            [
                21537,
                21585
            ],
            [
                21585,
                21605
            ],
            [
                21608,
                21609
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                97
            ],
            [
                97,
                241
            ],
            [
                241,
                414
            ],
            [
                414,
                661
            ],
            [
                661,
                826
            ],
            [
                826,
                1039
            ],
            [
                1039,
                1204
            ],
            [
                1204,
                1258
            ],
            [
                1258,
                1258
            ],
            [
                1258,
                1258
            ],
            [
                1258,
                1600
            ],
            [
                1600,
                1655
            ],
            [
                1655,
                1903
            ],
            [
                1903,
                2259
            ],
            [
                2259,
                2374
            ],
            [
                2374,
                2454
            ],
            [
                2454,
                2528
            ],
            [
                2528,
                2528
            ],
            [
                2528,
                2652
            ],
            [
                2652,
                2780
            ],
            [
                2780,
                2897
            ],
            [
                2897,
                2945
            ],
            [
                2945,
                3011
            ],
            [
                3011,
                3089
            ],
            [
                3089,
                3153
            ],
            [
                3153,
                3196
            ],
            [
                3196,
                3221
            ],
            [
                3221,
                3269
            ],
            [
                3269,
                3316
            ],
            [
                3316,
                3469
            ],
            [
                3469,
                3576
            ],
            [
                3576,
                3659
            ],
            [
                3659,
                3724
            ],
            [
                3724,
                3763
            ],
            [
                3763,
                3792
            ],
            [
                3792,
                3792
            ],
            [
                3792,
                4000
            ],
            [
                4000,
                4039
            ],
            [
                4039,
                4124
            ],
            [
                4124,
                4124
            ],
            [
                4124,
                4259
            ],
            [
                4259,
                4304
            ],
            [
                4304,
                4504
            ],
            [
                4504,
                4527
            ],
            [
                4527,
                4563
            ],
            [
                4563,
                4737
            ],
            [
                4737,
                4821
            ],
            [
                4821,
                5081
            ],
            [
                5081,
                5259
            ],
            [
                5259,
                5342
            ],
            [
                5342,
                5399
            ],
            [
                5399,
                5616
            ],
            [
                5616,
                5708
            ],
            [
                5708,
                5722
            ],
            [
                5722,
                5783
            ],
            [
                5783,
                5865
            ],
            [
                5865,
                6076
            ],
            [
                6076,
                6076
            ],
            [
                6076,
                6076
            ],
            [
                6076,
                6671
            ],
            [
                6671,
                6671
            ],
            [
                6671,
                6718
            ],
            [
                6718,
                6982
            ],
            [
                6982,
                7053
            ],
            [
                7053,
                7258
            ],
            [
                7258,
                7426
            ],
            [
                7426,
                7445
            ],
            [
                7445,
                7531
            ],
            [
                7531,
                7531
            ],
            [
                7531,
                7567
            ],
            [
                7567,
                7591
            ],
            [
                7591,
                7697
            ],
            [
                7697,
                7723
            ],
            [
                7723,
                7723
            ],
            [
                7723,
                7823
            ],
            [
                7823,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7901,
                8002
            ],
            [
                8002,
                8135
            ],
            [
                8135,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8285
            ],
            [
                8285,
                8336
            ],
            [
                8336,
                8521
            ],
            [
                8521,
                8631
            ],
            [
                8631,
                8703
            ],
            [
                8703,
                8764
            ],
            [
                8764,
                8883
            ],
            [
                8883,
                8901
            ],
            [
                8901,
                8901
            ],
            [
                8901,
                9063
            ],
            [
                9063,
                9319
            ],
            [
                9319,
                9319
            ],
            [
                9319,
                9354
            ],
            [
                9354,
                9354
            ],
            [
                9354,
                9542
            ],
            [
                9542,
                9563
            ],
            [
                9563,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                9816
            ],
            [
                9816,
                9896
            ],
            [
                9896,
                9926
            ],
            [
                9926,
                10045
            ],
            [
                10045,
                10096
            ],
            [
                10096,
                10115
            ],
            [
                10115,
                10188
            ],
            [
                10188,
                10354
            ],
            [
                10354,
                10399
            ],
            [
                10399,
                10569
            ],
            [
                10569,
                10709
            ],
            [
                10709,
                10709
            ],
            [
                10709,
                10709
            ],
            [
                10709,
                10754
            ],
            [
                10754,
                10826
            ],
            [
                10826,
                10948
            ],
            [
                10948,
                10993
            ],
            [
                10993,
                11043
            ],
            [
                11043,
                11288
            ],
            [
                11288,
                11406
            ],
            [
                11406,
                11430
            ],
            [
                11430,
                11447
            ],
            [
                11447,
                11527
            ],
            [
                11527,
                11565
            ],
            [
                11565,
                11628
            ],
            [
                11628,
                11639
            ],
            [
                11639,
                11771
            ],
            [
                11771,
                11810
            ],
            [
                11810,
                11810
            ],
            [
                11810,
                11810
            ],
            [
                11810,
                11810
            ],
            [
                11810,
                11962
            ],
            [
                11962,
                12008
            ],
            [
                12008,
                12030
            ],
            [
                12030,
                12051
            ],
            [
                12051,
                12098
            ],
            [
                12098,
                12098
            ],
            [
                12098,
                12098
            ],
            [
                12098,
                12098
            ],
            [
                12098,
                12098
            ],
            [
                12098,
                12098
            ],
            [
                12098,
                12165
            ],
            [
                12165,
                12217
            ],
            [
                12217,
                12254
            ],
            [
                12254,
                12330
            ],
            [
                12330,
                12378
            ],
            [
                12378,
                12421
            ],
            [
                12421,
                12450
            ],
            [
                12450,
                12534
            ],
            [
                12534,
                12568
            ],
            [
                12568,
                12715
            ],
            [
                12715,
                12920
            ],
            [
                12920,
                12960
            ],
            [
                12960,
                13099
            ],
            [
                13099,
                13121
            ],
            [
                13121,
                13144
            ],
            [
                13144,
                13194
            ],
            [
                13194,
                13234
            ],
            [
                13234,
                13494
            ],
            [
                13494,
                13610
            ],
            [
                13610,
                13690
            ],
            [
                13690,
                13771
            ],
            [
                13771,
                13801
            ],
            [
                13801,
                13862
            ],
            [
                13862,
                13915
            ],
            [
                13915,
                13990
            ],
            [
                13990,
                14048
            ],
            [
                14048,
                14108
            ],
            [
                14108,
                14325
            ],
            [
                14325,
                14349
            ],
            [
                14349,
                14405
            ],
            [
                14405,
                14440
            ],
            [
                14440,
                14478
            ],
            [
                14478,
                14502
            ],
            [
                14502,
                14738
            ],
            [
                14738,
                14874
            ],
            [
                14874,
                14925
            ],
            [
                14925,
                14956
            ],
            [
                14956,
                14987
            ],
            [
                14987,
                15023
            ],
            [
                15023,
                15076
            ],
            [
                15076,
                15223
            ],
            [
                15223,
                15223
            ],
            [
                15223,
                15293
            ],
            [
                15293,
                15401
            ],
            [
                15401,
                15548
            ],
            [
                15548,
                15657
            ],
            [
                15657,
                15678
            ],
            [
                15678,
                15864
            ],
            [
                15864,
                15933
            ],
            [
                15933,
                16054
            ],
            [
                16054,
                16070
            ],
            [
                16070,
                16101
            ],
            [
                16101,
                16220
            ],
            [
                16220,
                16239
            ],
            [
                16239,
                16318
            ],
            [
                16318,
                16376
            ],
            [
                16376,
                16376
            ],
            [
                16376,
                16426
            ],
            [
                16426,
                16545
            ],
            [
                16545,
                16576
            ],
            [
                16576,
                16704
            ],
            [
                16704,
                16805
            ],
            [
                16805,
                16822
            ],
            [
                16822,
                16869
            ],
            [
                16869,
                16916
            ],
            [
                16916,
                16916
            ],
            [
                16916,
                16916
            ],
            [
                16916,
                16916
            ],
            [
                16916,
                16916
            ],
            [
                16916,
                17150
            ],
            [
                17150,
                17239
            ],
            [
                17239,
                17283
            ],
            [
                17283,
                17311
            ],
            [
                17311,
                17351
            ],
            [
                17351,
                17376
            ],
            [
                17376,
                17424
            ],
            [
                17424,
                17447
            ],
            [
                17447,
                17562
            ],
            [
                17562,
                17562
            ],
            [
                17562,
                17590
            ],
            [
                17590,
                17652
            ],
            [
                17652,
                17652
            ],
            [
                17652,
                17652
            ],
            [
                17652,
                17790
            ],
            [
                17790,
                17915
            ],
            [
                17915,
                17935
            ],
            [
                17935,
                18000
            ],
            [
                18000,
                18067
            ],
            [
                18067,
                18094
            ],
            [
                18094,
                18117
            ],
            [
                18117,
                18117
            ],
            [
                18117,
                18117
            ],
            [
                18117,
                18117
            ],
            [
                18117,
                18117
            ],
            [
                18117,
                18150
            ],
            [
                18150,
                18209
            ],
            [
                18209,
                18275
            ],
            [
                18275,
                18491
            ],
            [
                18491,
                18680
            ],
            [
                18680,
                18826
            ],
            [
                18826,
                18955
            ],
            [
                18955,
                19016
            ],
            [
                19016,
                19147
            ],
            [
                19147,
                19178
            ],
            [
                19178,
                19211
            ],
            [
                19211,
                19338
            ],
            [
                19338,
                19359
            ],
            [
                19359,
                19387
            ],
            [
                19387,
                19460
            ],
            [
                19460,
                19460
            ],
            [
                19460,
                19488
            ],
            [
                19488,
                19533
            ],
            [
                19533,
                19577
            ],
            [
                19577,
                19683
            ],
            [
                19683,
                19732
            ],
            [
                19732,
                19751
            ],
            [
                19751,
                19751
            ],
            [
                19751,
                19833
            ],
            [
                19833,
                19928
            ],
            [
                19928,
                20043
            ],
            [
                20043,
                20089
            ],
            [
                20089,
                20177
            ],
            [
                20177,
                20303
            ],
            [
                20303,
                20336
            ],
            [
                20336,
                20356
            ],
            [
                20356,
                20444
            ],
            [
                20444,
                20485
            ],
            [
                20485,
                20525
            ],
            [
                20525,
                20627
            ],
            [
                20627,
                20825
            ],
            [
                20825,
                20966
            ],
            [
                20966,
                20993
            ],
            [
                20993,
                21002
            ],
            [
                21002,
                21029
            ],
            [
                21029,
                21108
            ],
            [
                21108,
                21181
            ],
            [
                21181,
                21204
            ],
            [
                21204,
                21271
            ],
            [
                21271,
                21323
            ],
            [
                21323,
                21347
            ],
            [
                21347,
                21430
            ],
            [
                21430,
                21468
            ],
            [
                21468,
                21479
            ],
            [
                21479,
                21500
            ],
            [
                21500,
                21585
            ],
            [
                21585,
                21609
            ]
        ]
    }
}