{
    "original": {
        "text": "\"Her wit Values itself so highly, that to her All matter else seems weak.\" --_Much Ado About Nothing._\nGwendolen's reception in the neighborhood fulfilled her uncle's expectations. From Brackenshaw Castle to the Firs at Wanchester, where Mr. Quallon the banker kept a generous house, she was welcomed with manifest admiration, and even those ladies who did not quite like her, felt a comfort in having a new, striking girl to invite; for hostesses who entertain much must make up their parties as ministers make up their cabinets, on grounds other than personal liking. Then, in order to have Gwendolen as a guest, it was not necessary to ask any one who was disagreeable, for Mrs. Davilow always made a quiet, picturesque figure as a chaperon, and Mr. Gascoigne was everywhere in request for his own sake.\nAmong the houses where Gwendolen was not quite liked, and yet invited, was Quetcham Hall. One of her first invitations was to a large dinner-party there, which made a sort of general introduction for her to the society of the neighborhood; for in a select party of thirty and of well-composed proportions as to age, few visitable families could be entirely left out. No youthful figure there was comparable to Gwendolen's as she passed through the long suite of rooms adorned with light and flowers, and, visible at first as a slim figure floating along in white drapery, approached through one wide doorway after another into fuller illumination and definiteness. She had never had that sort of promenade before, and she felt exultingly that it befitted her: any one looking at her for the first time might have supposed that long galleries and lackeys had always been a matter of course in her life; while her cousin Anna, who was really more familiar with these things, felt almost as much embarrassed as a rabbit suddenly deposited in that well-lit-space.\n\"Who is that with Gascoigne?\" said the archdeacon, neglecting a discussion of military manoeuvres on which, as a clergyman, he was naturally appealed to. And his son, on the other side of the room--a hopeful young scholar, who had already suggested some \"not less elegant than ingenious,\" emendations of Greek texts--said nearly at the same time, \"By George! who is that girl with the awfully well-set head and jolly figure?\"\nBut to a mind of general benevolence, wishing everybody to look well, it was rather exasperating to see how Gwendolen eclipsed others: how even the handsome Miss Lawe, explained to be the daughter of Lady Lawe, looked suddenly broad, heavy and inanimate; and how Miss Arrowpoint, unfortunately also dressed in white, immediately resembled a _carte-de-visite_ in which one would fancy the skirt alone to have been charged for. Since Miss Arrowpoint was generally liked for the amiable unpretending way in which she wore her fortunes, and made a softening screen for the oddities of her mother, there seemed to be some unfitness in Gwendolen's looking so much more like a person of social importance.\n\"She is not really so handsome if you come to examine her features,\" said Mrs. Arrowpoint, later in the evening, confidentially to Mrs. Vulcany. \"It is a certain style she has, which produces a great effect at first, but afterward she is less agreeable.\"\nIn fact, Gwendolen, not intending it, but intending the contrary, had offended her hostess, who, though not a splenetic or vindictive woman, had her susceptibilities. Several conditions had met in the Lady of Quetcham which to the reasoners in that neighborhood seemed to have an essential connection with each other. It was occasionally recalled that she had been the heiress of a fortune gained by some moist or dry business in the city, in order fully to account for her having a squat figure, a harsh parrot-like voice, and a systematically high head-dress; and since these points made her externally rather ridiculous, it appeared to many only natural that she should have what are called literary tendencies. A little comparison would have shown that all these points are to be found apart; daughters of aldermen being often well-grown and well-featured, pretty women having sometimes harsh or husky voices, and the production of feeble literature being found compatible with the most diverse forms of _physique_, masculine as well as feminine.\nGwendolen, who had a keen sense of absurdity in others, but was kindly disposed toward any one who could make life agreeable to her, meant to win Mrs. Arrowpoint by giving her an interest and attention beyond what others were probably inclined to show. But self-confidence is apt to address itself to an imaginary dullness in others; as people who are well off speak in a cajoling tone to the poor, and those who are in the prime of life raise their voice and talk artificially to seniors, hastily conceiving them to be deaf and rather imbecile. Gwendolen, with all her cleverness and purpose to be agreeable, could not escape that form of stupidity: it followed in her mind, unreflectingly, that because Mrs. Arrowpoint was ridiculous she was also likely to be wanting in penetration, and she went through her little scenes without suspicion that the various shades of her behavior were all noted.\n\"You are fond of books as well as of music, riding, and archery, I hear,\" Mrs. Arrowpoint said, going to her for a _tete--tete_ in the drawing-room after dinner. \"Catherine will be very glad to have so sympathetic a neighbor.\" This little speech might have seemed the most graceful politeness, spoken in a low, melodious tone; but with a twang, fatally loud, it gave Gwendolen a sense of exercising patronage when she answered, gracefully:\n\"It is I who am fortunate. Miss Arrowpoint will teach me what good music is. I shall be entirely a learner. I hear that she is a thorough musician.\"\n\"Catherine has certainly had every advantage. We have a first-rate musician in the house now--Herr Klesmer; perhaps you know all his compositions. You must allow me to introduce him to you. You sing, I believe. Catherine plays three instruments, but she does not sing. I hope you will let us hear you. I understand you are an accomplished singer.\"\n\"Oh, no!--'die Kraft ist schwach, allein die Lust ist gross,' as Mephistopheles says.\"\n\"Ah, you are a student of Goethe. Young ladies are so advanced now. I suppose you have read everything.\"\n\"No, really. I shall be so glad if you will tell me what to read. I have been looking into all the books in the library at Offendene, but there is nothing readable. The leaves all stick together and smell musty. I wish I could write books to amuse myself, as you can! How delightful it must be to write books after one's own taste instead of reading other people's! Home-made books must be so nice.\"\nFor an instant Mrs. Arrowpoint's glance was a little sharper, but the perilous resemblance to satire in the last sentence took the hue of girlish simplicity when Gwendolen added,\n\"I would give anything to write a book!\"\n\"And why should you not?\" said Mrs. Arrowpoint, encouragingly. \"You have but to begin as I did. Pen, ink, and paper are at everybody's command. But I will send you all I have written with pleasure.\"\n\"Thanks. I shall be so glad to read your writings. Being acquainted with authors must give a peculiar understanding of their books: one would be able to tell then which parts were funny and which serious. I am sure I often laugh in the wrong place.\" Here Gwendolen herself became aware of danger, and added quickly, \"In Shakespeare, you know, and other great writers that we can never see. But I always want to know more than there is in the books.\"\n\"If you are interested in any of my subjects I can lend you many extra sheets in manuscript,\" said Mrs. Arrowpoint--while Gwendolen felt herself painfully in the position of the young lady who professed to like potted sprats.\n\"These are things I dare say I shall publish eventually: several friends have urged me to do so, and one doesn't like to be obstinate. My Tasso, for example--I could have made it twice the size.\"\n\"I dote on Tasso,\" said Gwendolen.\n\"Well, you shall have all my papers, if you like. So many, you know, have written about Tasso; but they are all wrong. As to the particular nature of his madness, and his feelings for Leonora, and the real cause of his imprisonment, and the character of Leonora, who, in my opinion, was a cold-hearted woman, else she would have married him in spite of her brother--they are all wrong. I differ from everybody.\"\n\"How very interesting!\" said Gwendolen. \"I like to differ from everybody. I think it is so stupid to agree. That is the worst of writing your opinions; you make people agree with you.\" This speech renewed a slight suspicion in Mrs. Arrowpoint, and again her glance became for a moment examining. But Gwendolen looked very innocent, and continued with a docile air:\n\"I know nothing of Tasso except the _Gerusalemme Liberata_, which we read and learned by heart at school.\"\n\"Ah, his life is more interesting than his poetry, I have constructed the early part of his life as a sort of romance. When one thinks of his father Bernardo, and so on, there is much that must be true.\"\n\"Imagination is often truer than fact,\" said Gwendolen, decisively, though she could no more have explained these glib words than if they had been Coptic or Etruscan. \"I shall be so glad to learn all about Tasso--and his madness especially. I suppose poets are always a little mad.\"\n\"To be sure--'the poet's eye in a fine frenzy rolling'; and somebody says of Marlowe,\n'For that fine madness still he did maintain, Which always should possess the poet's brain.'\"\n\"But it was not always found out, was it?\" said Gwendolen innocently. \"I suppose some of them rolled their eyes in private. Mad people are often very cunning.\"\nAgain a shade flitted over Mrs. Arrowpoint's face; but the entrance of the gentlemen prevented any immediate mischief between her and this too quick young lady, who had over-acted her _navet_.\n\"Ah, here comes Herr Klesmer,\" said Mrs. Arrowpoint, rising; and presently bringing him to Gwendolen, she left them to a dialogue which was agreeable on both sides, Herr Klesmer being a felicitous combination of the German, the Sclave and the Semite, with grand features, brown hair floating in artistic fashion, and brown eyes in spectacles. His English had little foreignness except its fluency; and his alarming cleverness was made less formidable just then by a certain softening air of silliness which will sometimes befall even Genius in the desire of being agreeable to Beauty.\nMusic was soon begun. Miss Arrowpoint and Herr Klesmer played a four-handed piece on two pianos, which convinced the company in general that it was long, and Gwendolen in particular that the neutral, placid-faced Miss Arrowpoint had a mastery of the instrument which put her own execution out of question--though she was not discouraged as to her often-praised touch and style. After this every one became anxious to hear Gwendolen sing; especially Mr. Arrowpoint; as was natural in a host and a perfect gentleman, of whom no one had anything to say but that he married Miss Cuttler and imported the best cigars; and he led her to the piano with easy politeness. Herr Klesmer closed the instrument in readiness for her, and smiled with pleasure at her approach; then placed himself at a distance of a few feet so that he could see her as she sang.\nGwendolen was not nervous; what she undertook to do she did without trembling, and singing was an enjoyment to her. Her voice was a moderately powerful soprano (some one had told her it was like Jenny Lind's), her ear good, and she was able to keep in tune, so that her singing gave pleasure to ordinary hearers, and she had been used to unmingled applause. She had the rare advantage of looking almost prettier when she was singing than at other times, and that Herr Klesmer was in front of her seemed not disagreeable. Her song, determined on beforehand, was a favorite aria of Belini's, in which she felt quite sure of herself.\n\"Charming!\" said Mr. Arrowpoint, who had remained near, and the word was echoed around without more insincerity than we recognize in a brotherly way as human. But Herr Klesmer stood like a statue--if a statue can be imagined in spectacles; at least, he was as mute as a statue. Gwendolen was pressed to keep her seat and double the general pleasure, and she did not wish to refuse; but before resolving to do so, she moved a little toward Herr Klesmer, saying with a look of smiling appeal, \"It would be too cruel to a great musician. You cannot like to hear poor amateur singing.\"\n\"No, truly; but that makes nothing,\" said Herr Klesmer, suddenly speaking in an odious German fashion with staccato endings, quite unobservable in him before, and apparently depending on a change of mood, as Irishmen resume their strongest brogue when they are fervid or quarrelsome. \"That makes nothing. It is always acceptable to see you sing.\"\nWas there ever so unexpected an assertion of superiority--at least before the late Teutonic conquest? Gwendolen colored deeply, but, with her usual presence of mind, did not show an ungraceful resentment by moving away immediately; and Miss Arrowpoint, who had been near enough to overhear (and also to observe that Herr Klesmer's mode of looking at Gwendolen was more conspicuously admiring than was quite consistent with good taste), now with the utmost tact and kindness came close to her and said,\n\"Imagine what I have to go through with this professor! He can hardly tolerate anything we English do in music. We can only put up with his severity, and make use of it to find out the worst that can be said of us. It is a little comfort to know that; and one can bear it when every one else is admiring.\"\n\"I should be very much obliged to him for telling me the worst,\" said Gwendolen, recovering herself. \"I dare say I have been extremely ill taught, in addition to having no talent--only liking for music.\" This was very well expressed considering that it had never entered her mind before.\n\"Yes, it is true: you have not been well taught,\" said Herr Klesmer, quietly. Woman was dear to him, but music was dearer. \"Still, you are not quite without gifts. You sing in tune, and you have a pretty fair organ. But you produce your notes badly; and that music which you sing is beneath you. It is a form of melody which expresses a puerile state of culture--a dawdling, canting, see-saw kind of stuff--the passion and thought of people without any breadth of horizon. There is a sort of self-satisfied folly about every phrase of such melody; no cries of deep, mysterious passion--no conflict--no sense of the universal. It makes men small as they listen to it. Sing now something larger. And I shall see.\"\n\"Oh, not now--by-and-by,\" said Gwendolen, with a sinking of heart at the sudden width of horizon opened round her small musical performance. For a lady desiring to lead, this first encounter in her campaign was startling. But she was bent on not behaving foolishly, and Miss Arrowpoint helped her by saying, \"Yes, by-and-by. I always require half an hour to get up my courage after being criticised by Herr Klesmer. We will ask him to play to us now: he is bound to show us what is good music.\"\nTo be quite safe on this point Herr Klesmer played a composition of his own, a fantasia called _Freudvoll, Leidvoll, Gedankenvoll_--an extensive commentary on some melodic ideas not too grossly evident; and he certainly fetched as much variety and depth of passion out of the piano as that moderately responsive instrument lends itself to, having an imperious magic in his fingers that seem to send a nerve-thrill through ivory key and wooden hammer, and compel the strings to make a quivering lingering speech for him. Gwendolen, in spite of her wounded egoism, had fullness of nature enough to feel the power of this playing, and it gradually turned her inward sob of mortification into an excitement which lifted her for the moment into a desperate indifference about her own doings, or at least a determination to get a superiority over them by laughing at them as if they belonged to somebody else. Her eyes had become brighter, her cheeks slightly flushed, and her tongue ready for any mischievous remarks.\n\"I wish you would sing to us again, Miss Harleth,\" said young Clintock, the archdeacon's classical son, who had been so fortunate as to take her to dinner, and came up to renew conversation as soon as Herr Klesmer's performance was ended, \"That is the style of music for me. I never can make anything of this tip-top playing. It is like a jar of leeches, where you can never tell either beginnings or endings. I could listen to your singing all day.\"\n\"Yes, we should be glad of something popular now--another song from you would be a relaxation,\" said Mrs. Arrowpoint, who had also come near with polite intentions.\n\"That must be because you are in a puerile state of culture, and have no breadth of horizon. I have just learned that. I have been taught how bad my taste is, and am feeling growing pains. They are never pleasant,\" said Gwendolen, not taking any notice of Mrs. Arrowpoint, and looking up with a bright smile at young Clintock.\nMrs. Arrowpoint was not insensible to this rudeness, but merely said, \"Well, we will not press anything disagreeably,\" and as there was a perceptible outburst of imprisoned conversation just then, and a movement of guests seeking each other, she remained seated where she was, and looked around her with the relief of a hostess at finding she is not needed.\n\"I am glad you like this neighborhood,\" said young Clintock, well-pleased with his station in front of Gwendolen.\n\"Exceedingly. There seems to be a little of everything and not much of anything.\"\n\"That is rather equivocal praise.\"\n\"Not with me. I like a little of everything; a little absurdity, for example, is very amusing. I am thankful for a few queer people; but much of them is a bore.\"\n(Mrs. Arrowpoint, who was hearing this dialogue, perceived quite a new tone in Gwendolen's speech, and felt a revival of doubt as to her interest in Tasso's madness.)\n\"I think there should be more croquet, for one thing,\" said young Clintock; \"I am usually away, but if I were more here I should go in for a croquet club. You are one of the archers, I think. But depend upon it croquet is the game of the future. It wants writing up, though. One of our best men has written a poem on it, in four cantos;--as good as Pope. I want him to publish it--You never read anything better.\"\n\"I shall study croquet to-morrow. I shall take to it instead of singing.\"\n\"No, no, not that; but do take to croquet. I will send you Jenning's poem if you like. I have a manuscript copy.\"\n\"Is he a great friend of yours?\"\n\"Well, rather.\"\n\"Oh, if he is only rather, I think I will decline. Or, if you send it to me, will you promise not to catechise me upon it and ask me which part I like best? Because it is not so easy to know a poem without reading it as to know a sermon without listening.\"\n\"Decidedly,\" Mrs. Arrowpoint thought, \"this girl is double and satirical. I shall be on my guard against her.\"\nBut Gwendolen, nevertheless, continued to receive polite attentions from the family at Quetcham, not merely because invitations have larger grounds than those of personal liking, but because the trying little scene at the piano had awakened a kindly solicitude toward her in the gentle mind of Miss Arrowpoint, who managed all the invitations and visits, her mother being otherwise occupied.",
        "paragraph_chars": [
            [
                0,
                103
            ],
            [
                103,
                807
            ],
            [
                807,
                1867
            ],
            [
                1867,
                2293
            ],
            [
                2293,
                2992
            ],
            [
                2992,
                3247
            ],
            [
                3247,
                4298
            ],
            [
                4298,
                5197
            ],
            [
                5197,
                5637
            ],
            [
                5637,
                5786
            ],
            [
                5786,
                6134
            ],
            [
                6134,
                6221
            ],
            [
                6221,
                6326
            ],
            [
                6326,
                6726
            ],
            [
                6726,
                6905
            ],
            [
                6905,
                6946
            ],
            [
                6946,
                7145
            ],
            [
                7145,
                7595
            ],
            [
                7595,
                7821
            ],
            [
                7821,
                8017
            ],
            [
                8017,
                8052
            ],
            [
                8052,
                8464
            ],
            [
                8464,
                8829
            ],
            [
                8829,
                8936
            ],
            [
                8936,
                9140
            ],
            [
                9140,
                9423
            ],
            [
                9423,
                9509
            ],
            [
                9509,
                9603
            ],
            [
                9603,
                9763
            ],
            [
                9763,
                9956
            ],
            [
                9956,
                10541
            ],
            [
                10541,
                11389
            ],
            [
                11389,
                12020
            ],
            [
                12020,
                12602
            ],
            [
                12602,
                12949
            ],
            [
                12949,
                13451
            ],
            [
                13451,
                13757
            ],
            [
                13757,
                14045
            ],
            [
                14045,
                14757
            ],
            [
                14757,
                15252
            ],
            [
                15252,
                16265
            ],
            [
                16265,
                16716
            ],
            [
                16716,
                16881
            ],
            [
                16881,
                17208
            ],
            [
                17208,
                17566
            ],
            [
                17566,
                17680
            ],
            [
                17680,
                17762
            ],
            [
                17762,
                17797
            ],
            [
                17797,
                17959
            ],
            [
                17959,
                18126
            ],
            [
                18126,
                18540
            ],
            [
                18540,
                18614
            ],
            [
                18614,
                18728
            ],
            [
                18728,
                18761
            ],
            [
                18761,
                18777
            ],
            [
                18777,
                19034
            ],
            [
                19034,
                19145
            ],
            [
                19145,
                19536
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                103
            ],
            [
                103,
                181
            ],
            [
                181,
                570
            ],
            [
                570,
                807
            ],
            [
                807,
                897
            ],
            [
                897,
                1174
            ],
            [
                1174,
                1472
            ],
            [
                1472,
                1867
            ],
            [
                1867,
                1897
            ],
            [
                1897,
                2021
            ],
            [
                2021,
                2226
            ],
            [
                2226,
                2293
            ],
            [
                2293,
                2719
            ],
            [
                2719,
                2992
            ],
            [
                2992,
                3137
            ],
            [
                3137,
                3247
            ],
            [
                3247,
                3414
            ],
            [
                3414,
                3565
            ],
            [
                3565,
                3962
            ],
            [
                3962,
                4298
            ],
            [
                4298,
                4551
            ],
            [
                4551,
                4844
            ],
            [
                4844,
                5197
            ],
            [
                5197,
                5359
            ],
            [
                5359,
                5424
            ],
            [
                5424,
                5637
            ],
            [
                5637,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5714,
                5745
            ],
            [
                5745,
                5786
            ],
            [
                5786,
                5832
            ],
            [
                5832,
                5933
            ],
            [
                5933,
                5976
            ],
            [
                5976,
                5997
            ],
            [
                5997,
                6055
            ],
            [
                6055,
                6088
            ],
            [
                6088,
                6134
            ],
            [
                6134,
                6221
            ],
            [
                6221,
                6255
            ],
            [
                6255,
                6289
            ],
            [
                6289,
                6326
            ],
            [
                6326,
                6339
            ],
            [
                6339,
                6392
            ],
            [
                6392,
                6491
            ],
            [
                6491,
                6538
            ],
            [
                6538,
                6594
            ],
            [
                6594,
                6692
            ],
            [
                6692,
                6726
            ],
            [
                6726,
                6905
            ],
            [
                6905,
                6946
            ],
            [
                6946,
                6972
            ],
            [
                6972,
                7009
            ],
            [
                7009,
                7042
            ],
            [
                7042,
                7090
            ],
            [
                7090,
                7145
            ],
            [
                7145,
                7154
            ],
            [
                7154,
                7196
            ],
            [
                7196,
                7350
            ],
            [
                7350,
                7395
            ],
            [
                7395,
                7535
            ],
            [
                7535,
                7595
            ],
            [
                7595,
                7821
            ],
            [
                7821,
                7956
            ],
            [
                7956,
                8017
            ],
            [
                8017,
                8052
            ],
            [
                8052,
                8102
            ],
            [
                8102,
                8171
            ],
            [
                8171,
                8438
            ],
            [
                8438,
                8464
            ],
            [
                8464,
                8488
            ],
            [
                8488,
                8504
            ],
            [
                8504,
                8538
            ],
            [
                8538,
                8572
            ],
            [
                8572,
                8649
            ],
            [
                8649,
                8760
            ],
            [
                8760,
                8829
            ],
            [
                8829,
                8936
            ],
            [
                8936,
                9055
            ],
            [
                9055,
                9140
            ],
            [
                9140,
                9307
            ],
            [
                9307,
                9381
            ],
            [
                9381,
                9423
            ],
            [
                9423,
                9509
            ],
            [
                9509,
                9603
            ],
            [
                9603,
                9646
            ],
            [
                9646,
                9673
            ],
            [
                9673,
                9727
            ],
            [
                9727,
                9763
            ],
            [
                9763,
                9956
            ],
            [
                9956,
                10299
            ],
            [
                10299,
                10541
            ],
            [
                10541,
                10563
            ],
            [
                10563,
                10919
            ],
            [
                10919,
                11204
            ],
            [
                11204,
                11389
            ],
            [
                11389,
                11505
            ],
            [
                11505,
                11747
            ],
            [
                11747,
                11910
            ],
            [
                11910,
                12020
            ],
            [
                12020,
                12032
            ],
            [
                12032,
                12179
            ],
            [
                12179,
                12298
            ],
            [
                12298,
                12555
            ],
            [
                12555,
                12602
            ],
            [
                12602,
                12886
            ],
            [
                12886,
                12907
            ],
            [
                12907,
                12949
            ],
            [
                12949,
                13051
            ],
            [
                13051,
                13451
            ],
            [
                13451,
                13507
            ],
            [
                13507,
                13563
            ],
            [
                13563,
                13666
            ],
            [
                13666,
                13757
            ],
            [
                13757,
                13858
            ],
            [
                13858,
                13961
            ],
            [
                13961,
                14045
            ],
            [
                14045,
                14123
            ],
            [
                14123,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14261
            ],
            [
                14261,
                14341
            ],
            [
                14341,
                14518
            ],
            [
                14518,
                14671
            ],
            [
                14671,
                14712
            ],
            [
                14712,
                14739
            ],
            [
                14739,
                14757
            ],
            [
                14757,
                14898
            ],
            [
                14898,
                14979
            ],
            [
                14979,
                15082
            ],
            [
                15082,
                15173
            ],
            [
                15173,
                15252
            ],
            [
                15252,
                15772
            ],
            [
                15772,
                16156
            ],
            [
                16156,
                16265
            ],
            [
                16265,
                16540
            ],
            [
                16540,
                16591
            ],
            [
                16591,
                16675
            ],
            [
                16675,
                16716
            ],
            [
                16716,
                16881
            ],
            [
                16881,
                16974
            ],
            [
                16974,
                17000
            ],
            [
                17000,
                17070
            ],
            [
                17070,
                17208
            ],
            [
                17208,
                17566
            ],
            [
                17566,
                17680
            ],
            [
                17680,
                17694
            ],
            [
                17694,
                17762
            ],
            [
                17762,
                17797
            ],
            [
                17797,
                17811
            ],
            [
                17811,
                17892
            ],
            [
                17892,
                17959
            ],
            [
                17959,
                18126
            ],
            [
                18126,
                18281
            ],
            [
                18281,
                18318
            ],
            [
                18318,
                18372
            ],
            [
                18372,
                18401
            ],
            [
                18401,
                18481
            ],
            [
                18481,
                18540
            ],
            [
                18540,
                18574
            ],
            [
                18574,
                18614
            ],
            [
                18614,
                18657
            ],
            [
                18657,
                18701
            ],
            [
                18701,
                18728
            ],
            [
                18728,
                18761
            ],
            [
                18761,
                18777
            ],
            [
                18777,
                18828
            ],
            [
                18828,
                18934
            ],
            [
                18934,
                19034
            ],
            [
                19034,
                19108
            ],
            [
                19108,
                19145
            ],
            [
                19145,
                19536
            ]
        ],
        "overlap_chars": [
            [
                103,
                131
            ],
            [
                145,
                181
            ],
            [
                284,
                305
            ],
            [
                315,
                375
            ],
            [
                377,
                432
            ],
            [
                205,
                207
            ],
            [
                480,
                493
            ],
            [
                568,
                570
            ],
            [
                576,
                578
            ],
            [
                574,
                575
            ],
            [
                677,
                780
            ],
            [
                789,
                807
            ],
            [
                807,
                897
            ],
            [
                897,
                966
            ],
            [
                1007,
                1032
            ],
            [
                1172,
                1173
            ],
            [
                1174,
                1176
            ],
            [
                1186,
                1198
            ],
            [
                1214,
                1305
            ],
            [
                1312,
                1354
            ],
            [
                1361,
                1378
            ],
            [
                1379,
                1453
            ],
            [
                1470,
                1472
            ],
            [
                1472,
                1566
            ],
            [
                1709,
                1730
            ],
            [
                1780,
                1784
            ],
            [
                1792,
                1794
            ],
            [
                1800,
                1867
            ],
            [
                2214,
                2224
            ],
            [
                2184,
                2188
            ],
            [
                2037,
                2040
            ],
            [
                2029,
                2032
            ],
            [
                2226,
                2293
            ],
            [
                2293,
                2299
            ],
            [
                2361,
                2426
            ],
            [
                2329,
                2330
            ],
            [
                2556,
                2608
            ],
            [
                2717,
                2719
            ],
            [
                2719,
                2829
            ],
            [
                2858,
                2885
            ],
            [
                2854,
                2857
            ],
            [
                2923,
                2932
            ],
            [
                2899,
                2901
            ],
            [
                2943,
                2955
            ],
            [
                2990,
                2992
            ],
            [
                2992,
                3022
            ],
            [
                3058,
                3137
            ],
            [
                3137,
                3138
            ],
            [
                3160,
                3167
            ],
            [
                3144,
                3159
            ],
            [
                3167,
                3247
            ],
            [
                3247,
                3265
            ],
            [
                3313,
                3316
            ],
            [
                3317,
                3337
            ],
            [
                3412,
                3414
            ],
            [
                3444,
                3464
            ],
            [
                3433,
                3436
            ],
            [
                3728,
                3776
            ],
            [
                3792,
                3840
            ],
            [
                3852,
                3873
            ],
            [
                3509,
                3515
            ],
            [
                3891,
                3924
            ],
            [
                3941,
                3961
            ],
            [
                4298,
                4312
            ],
            [
                4358,
                4384
            ],
            [
                4393,
                4462
            ],
            [
                4470,
                4473
            ],
            [
                4477,
                4499
            ],
            [
                4519,
                4523
            ],
            [
                4542,
                4544
            ],
            [
                4549,
                4551
            ],
            [
                4551,
                4580
            ],
            [
                4612,
                4700
            ],
            [
                4718,
                4721
            ],
            [
                4736,
                4787
            ],
            [
                4807,
                4826
            ],
            [
                4842,
                4844
            ],
            [
                4844,
                4878
            ],
            [
                4906,
                4948
            ],
            [
                4972,
                5059
            ],
            [
                5068,
                5145
            ],
            [
                4964,
                4967
            ],
            [
                5190,
                5197
            ],
            [
                5197,
                5219
            ],
            [
                5260,
                5291
            ],
            [
                5299,
                5305
            ],
            [
                5345,
                5359
            ],
            [
                5359,
                5412
            ],
            [
                5421,
                5424
            ],
            [
                5424,
                5460
            ],
            [
                5625,
                5635
            ],
            [
                5491,
                5623
            ],
            [
                5635,
                5637
            ],
            [
                5637,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5714,
                5745
            ],
            [
                5745,
                5786
            ],
            [
                5786,
                5832
            ],
            [
                5832,
                5874
            ],
            [
                5880,
                5910
            ],
            [
                5915,
                5933
            ],
            [
                5976,
                5997
            ],
            [
                5997,
                6055
            ],
            [
                6055,
                6088
            ],
            [
                6088,
                6134
            ],
            [
                6134,
                6141
            ],
            [
                6144,
                6221
            ],
            [
                6221,
                6255
            ],
            [
                6255,
                6289
            ],
            [
                6289,
                6326
            ],
            [
                6326,
                6339
            ],
            [
                6339,
                6392
            ],
            [
                6464,
                6489
            ],
            [
                6431,
                6458
            ],
            [
                6421,
                6430
            ],
            [
                6525,
                6538
            ],
            [
                6538,
                6594
            ],
            [
                6594,
                6692
            ],
            [
                6692,
                6726
            ],
            [
                6726,
                6791
            ],
            [
                6888,
                6897
            ],
            [
                6883,
                6887
            ],
            [
                6898,
                6904
            ],
            [
                6905,
                6946
            ],
            [
                6946,
                6972
            ],
            [
                6972,
                7009
            ],
            [
                7042,
                7045
            ],
            [
                7052,
                7090
            ],
            [
                7090,
                7145
            ],
            [
                7145,
                7154
            ],
            [
                7154,
                7196
            ],
            [
                7218,
                7237
            ],
            [
                7247,
                7350
            ],
            [
                7350,
                7395
            ],
            [
                7395,
                7409
            ],
            [
                7418,
                7511
            ],
            [
                7533,
                7535
            ],
            [
                7535,
                7595
            ],
            [
                7595,
                7709
            ],
            [
                7711,
                7787
            ],
            [
                7798,
                7820
            ],
            [
                7821,
                7877
            ],
            [
                7956,
                7977
            ],
            [
                8014,
                8017
            ],
            [
                8017,
                8052
            ],
            [
                8052,
                8073
            ],
            [
                8078,
                8102
            ],
            [
                8102,
                8109
            ],
            [
                8121,
                8150
            ],
            [
                8171,
                8180
            ],
            [
                8192,
                8244
            ],
            [
                8418,
                8438
            ],
            [
                8438,
                8464
            ],
            [
                8464,
                8488
            ],
            [
                8488,
                8504
            ],
            [
                8504,
                8538
            ],
            [
                8538,
                8572
            ],
            [
                8572,
                8648
            ],
            [
                8649,
                8706
            ],
            [
                8758,
                8760
            ],
            [
                8760,
                8829
            ],
            [
                8829,
                8864
            ],
            [
                8866,
                8886
            ],
            [
                8887,
                8902
            ],
            [
                8924,
                8936
            ],
            [
                8936,
                8985
            ],
            [
                9053,
                9054
            ],
            [
                8987,
                9053
            ],
            [
                9140,
                9307
            ],
            [
                9307,
                9351
            ],
            [
                9353,
                9381
            ],
            [
                9381,
                9420
            ],
            [
                9507,
                9508
            ],
            [
                9615,
                9635
            ],
            [
                9727,
                9763
            ],
            [
                9763,
                9817
            ],
            [
                9834,
                9847
            ],
            [
                9956,
                9965
            ],
            [
                9972,
                10020
            ],
            [
                10040,
                10071
            ],
            [
                10121,
                10133
            ],
            [
                10075,
                10076
            ],
            [
                10153,
                10167
            ],
            [
                10172,
                10179
            ],
            [
                10191,
                10194
            ],
            [
                10199,
                10202
            ],
            [
                10205,
                10299
            ],
            [
                10299,
                10333
            ],
            [
                10352,
                10406
            ],
            [
                10417,
                10421
            ],
            [
                10430,
                10541
            ],
            [
                10541,
                10563
            ],
            [
                10563,
                10731
            ],
            [
                10741,
                10819
            ],
            [
                10830,
                10836
            ],
            [
                10837,
                10845
            ],
            [
                10917,
                10918
            ],
            [
                10919,
                10929
            ],
            [
                10940,
                10978
            ],
            [
                11031,
                11034
            ],
            [
                10990,
                11004
            ],
            [
                11161,
                11181
            ],
            [
                11202,
                11204
            ],
            [
                11204,
                11216
            ],
            [
                11265,
                11322
            ],
            [
                11340,
                11350
            ],
            [
                11351,
                11389
            ],
            [
                11389,
                11414
            ],
            [
                11421,
                11424
            ],
            [
                11472,
                11479
            ],
            [
                11503,
                11505
            ],
            [
                11505,
                11548
            ],
            [
                11599,
                11747
            ],
            [
                11747,
                11846
            ],
            [
                11852,
                11864
            ],
            [
                11869,
                11884
            ],
            [
                11865,
                11868
            ],
            [
                11892,
                11910
            ],
            [
                11910,
                11918
            ],
            [
                11946,
                11949
            ],
            [
                11961,
                11968
            ],
            [
                11972,
                12020
            ],
            [
                12020,
                12032
            ],
            [
                12032,
                12052
            ],
            [
                12076,
                12106
            ],
            [
                12177,
                12179
            ],
            [
                12179,
                12201
            ],
            [
                12277,
                12298
            ],
            [
                12298,
                12322
            ],
            [
                12368,
                12405
            ],
            [
                12433,
                12436
            ],
            [
                12423,
                12425
            ],
            [
                12459,
                12472
            ],
            [
                12480,
                12486
            ],
            [
                12495,
                12523
            ],
            [
                12528,
                12555
            ],
            [
                12555,
                12602
            ],
            [
                12602,
                12726
            ],
            [
                12807,
                12862
            ],
            [
                12884,
                12886
            ],
            [
                12886,
                12907
            ],
            [
                12907,
                12949
            ],
            [
                12949,
                13005
            ],
            [
                13049,
                13051
            ],
            [
                13051,
                13060
            ],
            [
                13069,
                13251
            ],
            [
                13260,
                13277
            ],
            [
                13309,
                13312
            ],
            [
                13288,
                13308
            ],
            [
                13313,
                13317
            ],
            [
                13341,
                13427
            ],
            [
                13441,
                13449
            ],
            [
                13451,
                13507
            ],
            [
                13507,
                13563
            ],
            [
                13563,
                13599
            ],
            [
                13664,
                13666
            ],
            [
                13707,
                13727
            ],
            [
                13738,
                13757
            ],
            [
                13827,
                13856
            ],
            [
                13858,
                13935
            ],
            [
                13937,
                13961
            ],
            [
                13961,
                14045
            ],
            [
                14045,
                14123
            ],
            [
                14123,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14253
            ],
            [
                14259,
                14261
            ],
            [
                14261,
                14303
            ],
            [
                14304,
                14309
            ],
            [
                14325,
                14341
            ],
            [
                14341,
                14343
            ],
            [
                14498,
                14518
            ],
            [
                14518,
                14528
            ],
            [
                14537,
                14563
            ],
            [
                14580,
                14595
            ],
            [
                14605,
                14629
            ],
            [
                14631,
                14642
            ],
            [
                14644,
                14671
            ],
            [
                14671,
                14712
            ],
            [
                14712,
                14737
            ],
            [
                14757,
                14769
            ],
            [
                14771,
                14813
            ],
            [
                14817,
                14822
            ],
            [
                14896,
                14898
            ],
            [
                14898,
                14979
            ],
            [
                14979,
                15064
            ],
            [
                15065,
                15082
            ],
            [
                15082,
                15173
            ],
            [
                15173,
                15210
            ],
            [
                15223,
                15252
            ],
            [
                15252,
                15327
            ],
            [
                15453,
                15487
            ],
            [
                15509,
                15541
            ],
            [
                15564,
                15637
            ],
            [
                15734,
                15762
            ],
            [
                15714,
                15725
            ],
            [
                15770,
                15772
            ],
            [
                15772,
                15782
            ],
            [
                15795,
                15814
            ],
            [
                15848,
                15907
            ],
            [
                15922,
                16016
            ],
            [
                15845,
                15847
            ],
            [
                16023,
                16030
            ],
            [
                16037,
                16069
            ],
            [
                16110,
                16117
            ],
            [
                16154,
                16156
            ],
            [
                16156,
                16196
            ],
            [
                16206,
                16243
            ],
            [
                16263,
                16265
            ],
            [
                16265,
                16320
            ],
            [
                16327,
                16353
            ],
            [
                16364,
                16368
            ],
            [
                16455,
                16502
            ],
            [
                16504,
                16540
            ],
            [
                16540,
                16589
            ],
            [
                16618,
                16619
            ],
            [
                16675,
                16716
            ],
            [
                16716,
                16764
            ],
            [
                16766,
                16832
            ],
            [
                16879,
                16881
            ],
            [
                16881,
                16906
            ],
            [
                16946,
                16974
            ],
            [
                17000,
                17006
            ],
            [
                17007,
                17070
            ],
            [
                17070,
                17111
            ],
            [
                17137,
                17157
            ],
            [
                17189,
                17208
            ],
            [
                17208,
                17302
            ],
            [
                17566,
                17590
            ],
            [
                17603,
                17639
            ],
            [
                17640,
                17644
            ],
            [
                17669,
                17680
            ],
            [
                17680,
                17694
            ],
            [
                17694,
                17734
            ],
            [
                17735,
                17742
            ],
            [
                17743,
                17759
            ],
            [
                17811,
                17890
            ],
            [
                19034,
                19085
            ],
            [
                19097,
                19108
            ],
            [
                19108,
                19145
            ],
            [
                19145,
                19240
            ],
            [
                19336,
                19346
            ],
            [
                19354,
                19536
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                103
            ],
            [
                103,
                181
            ],
            [
                181,
                570
            ],
            [
                570,
                807
            ],
            [
                807,
                897
            ],
            [
                897,
                1174
            ],
            [
                1174,
                1472
            ],
            [
                1472,
                1867
            ],
            [
                1867,
                1897
            ],
            [
                1897,
                2021
            ],
            [
                2021,
                2226
            ],
            [
                2226,
                2293
            ],
            [
                2293,
                2719
            ],
            [
                2719,
                2992
            ],
            [
                2992,
                3137
            ],
            [
                3137,
                3247
            ],
            [
                3247,
                3414
            ],
            [
                3414,
                3962
            ],
            [
                3962,
                4298
            ],
            [
                4298,
                4551
            ],
            [
                4551,
                4844
            ],
            [
                4844,
                5197
            ],
            [
                5197,
                5359
            ],
            [
                5359,
                5424
            ],
            [
                5424,
                5637
            ],
            [
                5637,
                5664
            ],
            [
                5664,
                5714
            ],
            [
                5714,
                5745
            ],
            [
                5745,
                5786
            ],
            [
                5786,
                5832
            ],
            [
                5832,
                5933
            ],
            [
                5933,
                5976
            ],
            [
                5976,
                5997
            ],
            [
                5997,
                6055
            ],
            [
                6055,
                6088
            ],
            [
                6088,
                6134
            ],
            [
                6134,
                6221
            ],
            [
                6221,
                6255
            ],
            [
                6255,
                6289
            ],
            [
                6289,
                6326
            ],
            [
                6326,
                6339
            ],
            [
                6339,
                6392
            ],
            [
                6392,
                6538
            ],
            [
                6538,
                6594
            ],
            [
                6594,
                6692
            ],
            [
                6692,
                6726
            ],
            [
                6726,
                6946
            ],
            [
                6946,
                6972
            ],
            [
                6972,
                7009
            ],
            [
                7009,
                7042
            ],
            [
                7042,
                7090
            ],
            [
                7090,
                7145
            ],
            [
                7145,
                7154
            ],
            [
                7154,
                7196
            ],
            [
                7196,
                7350
            ],
            [
                7350,
                7395
            ],
            [
                7395,
                7535
            ],
            [
                7535,
                7595
            ],
            [
                7595,
                7821
            ],
            [
                7821,
                8017
            ],
            [
                8017,
                8052
            ],
            [
                8052,
                8102
            ],
            [
                8102,
                8438
            ],
            [
                8438,
                8464
            ],
            [
                8464,
                8488
            ],
            [
                8488,
                8504
            ],
            [
                8504,
                8538
            ],
            [
                8538,
                8572
            ],
            [
                8572,
                8649
            ],
            [
                8649,
                8760
            ],
            [
                8760,
                8829
            ],
            [
                8829,
                8936
            ],
            [
                8936,
                9055
            ],
            [
                9055,
                9140
            ],
            [
                9140,
                9307
            ],
            [
                9307,
                9381
            ],
            [
                9381,
                9646
            ],
            [
                9646,
                9673
            ],
            [
                9673,
                9727
            ],
            [
                9727,
                9763
            ],
            [
                9763,
                9956
            ],
            [
                9956,
                10299
            ],
            [
                10299,
                10541
            ],
            [
                10541,
                10563
            ],
            [
                10563,
                10919
            ],
            [
                10919,
                11204
            ],
            [
                11204,
                11389
            ],
            [
                11389,
                11505
            ],
            [
                11505,
                11747
            ],
            [
                11747,
                11910
            ],
            [
                11910,
                12020
            ],
            [
                12020,
                12032
            ],
            [
                12032,
                12179
            ],
            [
                12179,
                12298
            ],
            [
                12298,
                12555
            ],
            [
                12555,
                12602
            ],
            [
                12602,
                12886
            ],
            [
                12886,
                12907
            ],
            [
                12907,
                12949
            ],
            [
                12949,
                13051
            ],
            [
                13051,
                13451
            ],
            [
                13451,
                13507
            ],
            [
                13507,
                13563
            ],
            [
                13563,
                13666
            ],
            [
                13666,
                13757
            ],
            [
                13757,
                13961
            ],
            [
                13961,
                14045
            ],
            [
                14045,
                14123
            ],
            [
                14123,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14261
            ],
            [
                14261,
                14341
            ],
            [
                14341,
                14518
            ],
            [
                14518,
                14671
            ],
            [
                14671,
                14712
            ],
            [
                14712,
                14739
            ],
            [
                14739,
                14757
            ],
            [
                14757,
                14898
            ],
            [
                14898,
                14979
            ],
            [
                14979,
                15082
            ],
            [
                15082,
                15173
            ],
            [
                15173,
                15252
            ],
            [
                15252,
                15772
            ],
            [
                15772,
                16156
            ],
            [
                16156,
                16265
            ],
            [
                16265,
                16540
            ],
            [
                16540,
                16716
            ],
            [
                16716,
                16881
            ],
            [
                16881,
                16974
            ],
            [
                16974,
                17000
            ],
            [
                17000,
                17070
            ],
            [
                17070,
                17208
            ],
            [
                17208,
                17566
            ],
            [
                17566,
                17680
            ],
            [
                17680,
                17694
            ],
            [
                17694,
                17762
            ],
            [
                17762,
                17797
            ],
            [
                17797,
                17811
            ],
            [
                17811,
                17892
            ],
            [
                17892,
                17959
            ],
            [
                17959,
                18126
            ],
            [
                18126,
                18281
            ],
            [
                18281,
                18318
            ],
            [
                18318,
                18372
            ],
            [
                18372,
                18401
            ],
            [
                18401,
                18481
            ],
            [
                18481,
                18540
            ],
            [
                18540,
                18574
            ],
            [
                18574,
                18614
            ],
            [
                18614,
                18657
            ],
            [
                18657,
                18701
            ],
            [
                18701,
                18728
            ],
            [
                18728,
                18761
            ],
            [
                18761,
                18777
            ],
            [
                18777,
                18828
            ],
            [
                18828,
                18934
            ],
            [
                18934,
                19034
            ],
            [
                19034,
                19108
            ],
            [
                19108,
                19145
            ],
            [
                19145,
                19536
            ]
        ]
    },
    "abridged": {
        "text": "Gwendolen's reception in the neighbourhood fulfilled her uncle's expectations. She was welcomed with admiration, and even those ladies who did not quite like her felt a comfort in having a new, striking girl to invite to their parties. In addition, Mrs. Davilow always made a quiet, picturesque figure as a chaperon, and Mr. Gascoigne was everywhere in demand for his own sake.\nAmong the houses where Gwendolen was not quite liked, and yet invited, was Quetcham Hall. One of her first invitations was to a large dinner-party there, which introduced her to the society of the neighbourhood.\nNo figure there compared to Gwendolen's as she passed through the long suite of rooms adorned with light and flowers. Visible at first as a slim figure floating in white drapery, she approached through one wide doorway after another into fuller illumination. She had never had that sort of promenade before, and she felt exultingly that it befitted her: while her cousin Anna felt as embarrassed as a rabbit suddenly deposited in that well-lit-space.\n\"By George!\" said the Archdeacon's son. \"Who is that girl with the awfully well-set head and jolly figure?\"\nBut to some onlookers, it was rather exasperating to see how Gwendolen eclipsed others, including Miss Arrowpoint, unfortunately also dressed in white. Since Miss Arrowpoint was generally liked for the amiable unpretending way in which she wore her fortunes, and softened the oddities of her mother, it did not seem fitting for Gwendolen to look so much more important.\n\"She is not really so handsome,\" said Mrs. Arrowpoint, later in the evening, confidentially to Mrs. Vulcany. \"She has a certain style, which produces a great effect at first, but afterward she is less agreeable.\"\nIn fact, Gwendolen had unintentionally offended her hostess. The lady of Quetcham had a squat figure, a harsh parrot-like voice, and a high head-dress; and since these points made her appear rather ridiculous, it seemed only natural that she should have literary tendencies.\nGwendolen, who was kindly disposed toward anyone who could make life agreeable to her, meant to win Mrs. Arrowpoint by showing her more interest and attention than other people were likely to. But self-confidence is apt to imagine dullness in others; as people who are well off speak in a cajoling tone to the poor, and the young raise their voice and talk artificially to seniors, assuming them to be deaf and slow. Gwendolen, with all her cleverness, could not escape that form of stupidity: she thought, unreflectingly, that because Mrs. Arrowpoint was ridiculous she was also likely to be lacking in penetration, and she went through her little scenes without suspicion that her behaviour was noted.\n\"You are fond of books, I hear,\" Mrs. Arrowpoint said to her after dinner. \"Catherine will be very glad to have so sympathetic a neighbour.\" This little speech might have seemed gracefully polite if spoken in a low, melodious tone; but with a twang, fatally loud, it gave Gwendolen a sense of exercising patronage when she answered:\n\"It is I who am fortunate. Miss Arrowpoint will teach me what good music is. I shall be entirely a learner. I hear that she is a thorough musician.\"\n\"Catherine has certainly had every advantage. We have a first-rate musician in the house - Herr Klesmer; perhaps you know his compositions. You sing, I believe. Catherine plays three instruments, but she does not sing. I hope you will let us hear you. I understand you are an accomplished singer.\"\n\"Oh, no! - 'die Kraft ist schwach, allein die Lust ist gross,' as Mephistopheles says.\"\n\"Ah, you are a student of Goethe. Young ladies are so advanced now. I suppose you have read everything.\"\n\"No, really. I shall be so glad if you will tell me what to read. There is nothing readable in the library at Offendene; the books smell musty. I wish I could write books to amuse myself, as you can! How delightful it must be to write books after one's own taste instead of reading other people's! Home-made books must be so nice.\"\nFor an instant Mrs. Arrowpoint's glance was a little sharper, but Gwendolen appeared more simple than satirical when she added, \"I would give anything to write a book!\"\n\"And why should you not?\" said Mrs. Arrowpoint, encouragingly. \"Pen and paper are at everybody's command. But I will send you all I have written with pleasure.\"\n\"Thanks. I shall be so glad to read your writings. Knowing authors must give a special understanding of their books: one would be able to tell then which parts were funny and which serious. I am sure I often laugh in the wrong place.\" Here Gwendolen became aware of danger, and added quickly, \"In Shakespeare, you know, and other great writers. But I always want to know more than there is in the books.\"\n\"If you are interested in any of my subjects I can lend you many extra sheets in manuscript,\" said Mrs. Arrowpoint - while Gwendolen felt herself painfully in the position of the young lady who pretended to like potted sprats. \"These are things I dare say I shall publish eventually: my Tasso, for example.\"\n\"I dote on Tasso,\" said Gwendolen.\n\"Well, you shall have my papers, if you like. So many have written about Tasso; but as to the nature of his madness, and his feelings for Leonora, they are all wrong. I differ from everybody.\"\n\"How very interesting!\" said Gwendolen. \"I like to differ from everybody. I think it is so stupid to agree. That is the worst of writing your opinions; you make people agree with you.\"\nThis speech renewed a slight suspicion in Mrs. Arrowpoint. But Gwendolen looked very innocent, and continued with a docile air:\n\"I know nothing of Tasso except the Gerusalemme Liberata, which we read at school.\"\n\"Ah, his life is more interesting than his poetry. I have constructed the early part of his life as a sort of romance.\"\n\"Imagination is often truer than fact,\" said Gwendolen, decisively, though she could no more have explained these glib words than if they had been Coptic or Etruscan. \"I shall be so glad to learn all about Tasso - and his madness especially. I suppose poets are always a little mad, although they are not always found out. Mad people are often very cunning.\"\nAgain a shade flitted over Mrs. Arrowpoint's face; but then the gentlemen came in.\n\"Ah, here is Herr Klesmer,\" said Mrs. Arrowpoint, rising; and introducing him to Gwendolen, she left them together. Herr Klesmer had a happy combination of German, Slav and Semitic looks, with grand features, brown hair floating in artistic fashion, and brown eyes in spectacles. His English had little foreignness; and his alarming cleverness was made less formidable by a softening air of silliness which will sometimes befall even Genius in the desire of being agreeable to Beauty.\nMusic was soon begun. Miss Arrowpoint and Herr Klesmer played a four-handed piece on two pianos, which convinced the company in general that it was long, and Gwendolen in particular that the placid-faced Miss Arrowpoint had a mastery of the instrument which put her own performance out of the question.\nAfter this everyone became anxious to hear Gwendolen sing; and Mr. Arrowpoint led her to the piano. Herr Klesmer smiled with pleasure at her approach; then placed himself a few feet away so that he could see her as she sang.\nGwendolen was not nervous: she enjoyed singing. Her voice was a moderately powerful soprano, her ear good, and she was able to keep in tune, so that her singing gave pleasure to ordinary hearers, and she had been used to unmingled applause. She had the rare advantage of looking almost prettier when she was singing than at other times, and to have Herr Klesmer in front of her was not disagreeable. Her song was an aria of Bellini's, in which she felt quite sure of herself.\n\"Charming!\" said Mr. Arrowpoint, and the word was echoed around the room. But Herr Klesmer stood as mute as a statue. Gwendolen was pressed to sing again, and she did not wish to refuse; but first she said to Herr Klesmer, with a smiling appeal, \"It would be cruel to a great musician. You cannot like to hear poor amateur singing.\"\n\"No, truly; but that makes nothing,\" said Herr Klesmer, suddenly speaking in an odious German fashion with staccato endings, just as Irishmen resume their strongest brogue when they are agitated. \"That makes nothing. It is always acceptable to see you sing.\"\nWas there ever so unexpected an assertion of superiority? Gwendolen coloured deeply, but, with her usual presence of mind, did not show an ungraceful resentment by moving away immediately; and Miss Arrowpoint, who had been near enough to overhear (and also to see that Herr Klesmer was looking at Gwendolen with more conspicuous admiration than was quite consistent with good taste), now with the utmost tact and kindness came up and said-\n\"Imagine what I have to go through with this professor! He can hardly tolerate anything we English do in music. We can only put up with his severity. One can bear it when everyone else is admiring.\"\nGwendolen, recovering herself, answered, \"I dare say I have been extremely ill taught, in addition to having no talent - only liking for music.\" This was very well expressed considering that it had never entered her mind before.\n\"Yes, it is true: you have not been well taught,\" said Herr Klesmer, quietly. Woman was dear to him, but music was dearer. \"Still, you are not quite without gifts. You sing in tune, and you have a pretty fair voice. But you produce your notes badly; and that dawdling, see-saw kind of music is beneath you. It has no breadth of horizon. There is a self-satisfied folly about such melody; no deep, mysterious passion - no conflict - no sense of the universal. It makes men small as they listen to it. Sing now something larger.\"\n\"Oh, not now. By-and-by,\" said Gwendolen, with a sinking heart. For a lady desiring to lead, this first encounter in her campaign was startling. But she was bent on not behaving foolishly, and Miss Arrowpoint helped her by saying,\n\"Yes, by-and-by. I always require half an hour to get up my courage after being criticised by Herr Klesmer. We will ask him to play to us now: he will show us what is good music.\"\nTo be quite safe on this point Herr Klesmer played a composition of his own; and he certainly fetched as much passion out of the piano as that instrument lends itself to, having an imperious magic in his fingers that drew a quivering lingering speech from the strings. Gwendolen, despite her wounded egoism, could feel the power of this playing, and it gradually turned her mortification into an excitement which lifted her for the moment into a desperate indifference to her own shortcomings, or at least a determination to laugh at them. Her eyes had become brighter, her cheeks flushed, and her tongue ready for any mischief.\n\"I wish you would sing to us again, Miss Harleth,\" said Clintock, the Archdeacon's son, as soon as Herr Klesmer's performance was ended. \"That is the style of music for me. I never can make anything of this tip-top playing, but I could listen to your singing all day.\"\n\"Yes, we should be glad of something popular now - another song from you would be a relaxation,\" said Mrs. Arrowpoint politely.\n\"That must be because you have no breadth of horizon. I have just been taught how bad my taste is, and am feeling growing pains. They are never pleasant,\" said Gwendolen, ignoring Mrs. Arrowpoint, and smiling at young Clintock.\nMrs. Arrowpoint was not insensible to this rudeness, but merely said, \"Well, we will not press you.\"\n\"I am glad you like this neighbourhood,\" said young Clintock, well-pleased to be with Gwendolen.\n\"Exceedingly. There seems to be a little of everything, and not too much of anything. I like a little of everything; a little absurdity, for example, is very amusing.\"\n\"Decidedly,\" Mrs. Arrowpoint thought, \"this girl is satirical. I shall be on my guard against her.\"\nBut Gwendolen, nevertheless, continued to receive polite attentions from the family at Quetcham; the trying scene at the piano had awakened a kindly solicitude toward her in the gentle mind of Miss Arrowpoint, who managed all the invitations and visits, her mother being otherwise occupied.",
        "paragraph_chars": [
            [
                0,
                378
            ],
            [
                378,
                590
            ],
            [
                590,
                1041
            ],
            [
                1041,
                1149
            ],
            [
                1149,
                1519
            ],
            [
                1519,
                1732
            ],
            [
                1732,
                2007
            ],
            [
                2007,
                2711
            ],
            [
                2711,
                3044
            ],
            [
                3044,
                3193
            ],
            [
                3193,
                3491
            ],
            [
                3491,
                3579
            ],
            [
                3579,
                3684
            ],
            [
                3684,
                4016
            ],
            [
                4016,
                4185
            ],
            [
                4185,
                4346
            ],
            [
                4346,
                4751
            ],
            [
                4751,
                5059
            ],
            [
                5059,
                5094
            ],
            [
                5094,
                5287
            ],
            [
                5287,
                5472
            ],
            [
                5472,
                5600
            ],
            [
                5600,
                5684
            ],
            [
                5684,
                5804
            ],
            [
                5804,
                6163
            ],
            [
                6163,
                6246
            ],
            [
                6246,
                6731
            ],
            [
                6731,
                7034
            ],
            [
                7034,
                7259
            ],
            [
                7259,
                7735
            ],
            [
                7735,
                8068
            ],
            [
                8068,
                8327
            ],
            [
                8327,
                8767
            ],
            [
                8767,
                8966
            ],
            [
                8966,
                9195
            ],
            [
                9195,
                9723
            ],
            [
                9723,
                9954
            ],
            [
                9954,
                10134
            ],
            [
                10134,
                10763
            ],
            [
                10763,
                11032
            ],
            [
                11032,
                11160
            ],
            [
                11160,
                11388
            ],
            [
                11388,
                11489
            ],
            [
                11489,
                11586
            ],
            [
                11586,
                11754
            ],
            [
                11754,
                11854
            ],
            [
                11854,
                12144
            ]
        ],
        "segment_chars": [
            [
                0,
                79
            ],
            [
                79,
                236
            ],
            [
                236,
                378
            ],
            [
                378,
                468
            ],
            [
                468,
                590
            ],
            [
                590,
                708
            ],
            [
                708,
                849
            ],
            [
                849,
                1041
            ],
            [
                1041,
                1054
            ],
            [
                1054,
                1081
            ],
            [
                1081,
                1149
            ],
            [
                1149,
                1301
            ],
            [
                1301,
                1519
            ],
            [
                1519,
                1628
            ],
            [
                1628,
                1732
            ],
            [
                1732,
                1793
            ],
            [
                1793,
                2007
            ],
            [
                2007,
                2200
            ],
            [
                2200,
                2424
            ],
            [
                2424,
                2711
            ],
            [
                2711,
                2786
            ],
            [
                2786,
                2852
            ],
            [
                2852,
                3044
            ],
            [
                3044,
                3071
            ],
            [
                3071,
                3121
            ],
            [
                3121,
                3152
            ],
            [
                3152,
                3193
            ],
            [
                3193,
                3239
            ],
            [
                3239,
                3333
            ],
            [
                3333,
                3354
            ],
            [
                3354,
                3412
            ],
            [
                3412,
                3445
            ],
            [
                3445,
                3491
            ],
            [
                3491,
                3500
            ],
            [
                3500,
                3579
            ],
            [
                3579,
                3613
            ],
            [
                3613,
                3647
            ],
            [
                3647,
                3684
            ],
            [
                3684,
                3697
            ],
            [
                3697,
                3750
            ],
            [
                3750,
                3828
            ],
            [
                3828,
                3884
            ],
            [
                3884,
                3982
            ],
            [
                3982,
                4016
            ],
            [
                4016,
                4185
            ],
            [
                4185,
                4211
            ],
            [
                4211,
                4248
            ],
            [
                4248,
                4291
            ],
            [
                4291,
                4346
            ],
            [
                4346,
                4355
            ],
            [
                4355,
                4397
            ],
            [
                4397,
                4536
            ],
            [
                4536,
                4581
            ],
            [
                4581,
                4691
            ],
            [
                4691,
                4751
            ],
            [
                4751,
                4978
            ],
            [
                4978,
                5059
            ],
            [
                5059,
                5094
            ],
            [
                5094,
                5140
            ],
            [
                5140,
                5261
            ],
            [
                5261,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5327
            ],
            [
                5327,
                5361
            ],
            [
                5361,
                5395
            ],
            [
                5395,
                5472
            ],
            [
                5472,
                5531
            ],
            [
                5531,
                5600
            ],
            [
                5600,
                5684
            ],
            [
                5684,
                5735
            ],
            [
                5735,
                5804
            ],
            [
                5804,
                5971
            ],
            [
                5971,
                6046
            ],
            [
                6046,
                6127
            ],
            [
                6127,
                6163
            ],
            [
                6163,
                6246
            ],
            [
                6246,
                6362
            ],
            [
                6362,
                6526
            ],
            [
                6526,
                6731
            ],
            [
                6731,
                6753
            ],
            [
                6753,
                7034
            ],
            [
                7034,
                7134
            ],
            [
                7134,
                7259
            ],
            [
                7259,
                7307
            ],
            [
                7307,
                7500
            ],
            [
                7500,
                7659
            ],
            [
                7659,
                7735
            ],
            [
                7735,
                7747
            ],
            [
                7747,
                7809
            ],
            [
                7809,
                7853
            ],
            [
                7853,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8264
            ],
            [
                8264,
                8285
            ],
            [
                8285,
                8327
            ],
            [
                8327,
                8385
            ],
            [
                8385,
                8767
            ],
            [
                8767,
                8823
            ],
            [
                8823,
                8879
            ],
            [
                8879,
                8917
            ],
            [
                8917,
                8966
            ],
            [
                8966,
                9111
            ],
            [
                9111,
                9195
            ],
            [
                9195,
                9273
            ],
            [
                9273,
                9318
            ],
            [
                9318,
                9359
            ],
            [
                9359,
                9411
            ],
            [
                9411,
                9502
            ],
            [
                9502,
                9532
            ],
            [
                9532,
                9654
            ],
            [
                9654,
                9695
            ],
            [
                9695,
                9723
            ],
            [
                9723,
                9737
            ],
            [
                9737,
                9787
            ],
            [
                9787,
                9868
            ],
            [
                9868,
                9954
            ],
            [
                9954,
                9971
            ],
            [
                9971,
                10062
            ],
            [
                10062,
                10134
            ],
            [
                10134,
                10403
            ],
            [
                10403,
                10674
            ],
            [
                10674,
                10763
            ],
            [
                10763,
                10900
            ],
            [
                10900,
                10936
            ],
            [
                10936,
                11032
            ],
            [
                11032,
                11160
            ],
            [
                11160,
                11214
            ],
            [
                11214,
                11289
            ],
            [
                11289,
                11388
            ],
            [
                11388,
                11489
            ],
            [
                11489,
                11586
            ],
            [
                11586,
                11600
            ],
            [
                11600,
                11672
            ],
            [
                11672,
                11754
            ],
            [
                11754,
                11817
            ],
            [
                11817,
                11854
            ],
            [
                11854,
                12144
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                43,
                79
            ],
            [
                79,
                100
            ],
            [
                101,
                161
            ],
            [
                162,
                217
            ],
            [
                218,
                220
            ],
            [
                221,
                234
            ],
            [
                234,
                236
            ],
            [
                236,
                238
            ],
            [
                247,
                248
            ],
            [
                249,
                352
            ],
            [
                360,
                378
            ],
            [
                378,
                468
            ],
            [
                468,
                537
            ],
            [
                549,
                574
            ],
            [
                588,
                589
            ],
            [
                590,
                592
            ],
            [
                593,
                605
            ],
            [
                615,
                706
            ],
            [
                708,
                750
            ],
            [
                751,
                768
            ],
            [
                773,
                847
            ],
            [
                847,
                849
            ],
            [
                849,
                943
            ],
            [
                944,
                965
            ],
            [
                966,
                970
            ],
            [
                971,
                973
            ],
            [
                974,
                1041
            ],
            [
                1041,
                1051
            ],
            [
                1054,
                1058
            ],
            [
                1059,
                1062
            ],
            [
                1076,
                1079
            ],
            [
                1082,
                1149
            ],
            [
                1149,
                1155
            ],
            [
                1170,
                1235
            ],
            [
                1235,
                1236
            ],
            [
                1247,
                1299
            ],
            [
                1299,
                1301
            ],
            [
                1301,
                1411
            ],
            [
                1421,
                1448
            ],
            [
                1473,
                1476
            ],
            [
                1477,
                1486
            ],
            [
                1487,
                1489
            ],
            [
                1495,
                1507
            ],
            [
                1517,
                1519
            ],
            [
                1519,
                1549
            ],
            [
                1549,
                1628
            ],
            [
                1628,
                1629
            ],
            [
                1629,
                1636
            ],
            [
                1637,
                1652
            ],
            [
                1652,
                1732
            ],
            [
                1732,
                1750
            ],
            [
                1751,
                1754
            ],
            [
                1771,
                1791
            ],
            [
                1791,
                1793
            ],
            [
                1793,
                1813
            ],
            [
                1814,
                1817
            ],
            [
                1818,
                1866
            ],
            [
                1867,
                1915
            ],
            [
                1923,
                1944
            ],
            [
                1945,
                1951
            ],
            [
                1952,
                1985
            ],
            [
                1986,
                2006
            ],
            [
                2007,
                2021
            ],
            [
                2022,
                2048
            ],
            [
                2056,
                2125
            ],
            [
                2134,
                2137
            ],
            [
                2143,
                2165
            ],
            [
                2184,
                2188
            ],
            [
                2196,
                2198
            ],
            [
                2198,
                2200
            ],
            [
                2200,
                2229
            ],
            [
                2238,
                2326
            ],
            [
                2327,
                2330
            ],
            [
                2337,
                2388
            ],
            [
                2398,
                2417
            ],
            [
                2422,
                2424
            ],
            [
                2424,
                2458
            ],
            [
                2458,
                2500
            ],
            [
                2512,
                2599
            ],
            [
                2608,
                2685
            ],
            [
                2686,
                2689
            ],
            [
                2704,
                2711
            ],
            [
                2711,
                2733
            ],
            [
                2733,
                2764
            ],
            [
                2765,
                2771
            ],
            [
                2772,
                2786
            ],
            [
                2786,
                2839
            ],
            [
                2849,
                2852
            ],
            [
                2852,
                2888
            ],
            [
                2889,
                2899
            ],
            [
                2910,
                3042
            ],
            [
                3042,
                3044
            ],
            [
                3044,
                3071
            ],
            [
                3071,
                3121
            ],
            [
                3121,
                3152
            ],
            [
                3152,
                3193
            ],
            [
                3193,
                3239
            ],
            [
                3239,
                3281
            ],
            [
                3284,
                3314
            ],
            [
                3315,
                3333
            ],
            [
                3333,
                3354
            ],
            [
                3354,
                3412
            ],
            [
                3412,
                3445
            ],
            [
                3445,
                3491
            ],
            [
                3491,
                3498
            ],
            [
                3502,
                3579
            ],
            [
                3579,
                3613
            ],
            [
                3613,
                3647
            ],
            [
                3647,
                3684
            ],
            [
                3684,
                3697
            ],
            [
                3697,
                3750
            ],
            [
                3750,
                3775
            ],
            [
                3776,
                3803
            ],
            [
                3805,
                3814
            ],
            [
                3815,
                3828
            ],
            [
                3828,
                3884
            ],
            [
                3884,
                3982
            ],
            [
                3982,
                4016
            ],
            [
                4016,
                4081
            ],
            [
                4082,
                4091
            ],
            [
                4128,
                4132
            ],
            [
                4137,
                4143
            ],
            [
                4144,
                4185
            ],
            [
                4185,
                4211
            ],
            [
                4211,
                4248
            ],
            [
                4249,
                4252
            ],
            [
                4253,
                4291
            ],
            [
                4291,
                4346
            ],
            [
                4346,
                4355
            ],
            [
                4355,
                4397
            ],
            [
                4405,
                4424
            ],
            [
                4433,
                4536
            ],
            [
                4536,
                4581
            ],
            [
                4581,
                4595
            ],
            [
                4596,
                4689
            ],
            [
                4689,
                4691
            ],
            [
                4691,
                4751
            ],
            [
                4751,
                4865
            ],
            [
                4868,
                4944
            ],
            [
                4955,
                4977
            ],
            [
                4978,
                5034
            ],
            [
                5035,
                5056
            ],
            [
                5056,
                5059
            ],
            [
                5059,
                5094
            ],
            [
                5094,
                5115
            ],
            [
                5116,
                5140
            ],
            [
                5140,
                5147
            ],
            [
                5148,
                5177
            ],
            [
                5178,
                5187
            ],
            [
                5188,
                5240
            ],
            [
                5241,
                5261
            ],
            [
                5261,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5327
            ],
            [
                5327,
                5361
            ],
            [
                5361,
                5395
            ],
            [
                5395,
                5471
            ],
            [
                5472,
                5529
            ],
            [
                5529,
                5531
            ],
            [
                5531,
                5600
            ],
            [
                5600,
                5635
            ],
            [
                5636,
                5656
            ],
            [
                5656,
                5671
            ],
            [
                5672,
                5684
            ],
            [
                5684,
                5733
            ],
            [
                5733,
                5734
            ],
            [
                5735,
                5801
            ],
            [
                5804,
                5971
            ],
            [
                5971,
                6015
            ],
            [
                6018,
                6046
            ],
            [
                6046,
                6085
            ],
            [
                6085,
                6086
            ],
            [
                6105,
                6125
            ],
            [
                6127,
                6163
            ],
            [
                6163,
                6217
            ],
            [
                6223,
                6236
            ],
            [
                6246,
                6255
            ],
            [
                6259,
                6307
            ],
            [
                6320,
                6351
            ],
            [
                6362,
                6374
            ],
            [
                6379,
                6380
            ],
            [
                6387,
                6401
            ],
            [
                6402,
                6409
            ],
            [
                6415,
                6418
            ],
            [
                6419,
                6422
            ],
            [
                6432,
                6526
            ],
            [
                6526,
                6560
            ],
            [
                6560,
                6614
            ],
            [
                6615,
                6619
            ],
            [
                6620,
                6731
            ],
            [
                6731,
                6753
            ],
            [
                6753,
                6921
            ],
            [
                6922,
                7000
            ],
            [
                7013,
                7019
            ],
            [
                7024,
                7032
            ],
            [
                7032,
                7033
            ],
            [
                7034,
                7044
            ],
            [
                7054,
                7092
            ],
            [
                7093,
                7096
            ],
            [
                7097,
                7111
            ],
            [
                7112,
                7132
            ],
            [
                7132,
                7134
            ],
            [
                7134,
                7146
            ],
            [
                7147,
                7204
            ],
            [
                7205,
                7215
            ],
            [
                7221,
                7259
            ],
            [
                7259,
                7284
            ],
            [
                7286,
                7289
            ],
            [
                7298,
                7305
            ],
            [
                7305,
                7307
            ],
            [
                7307,
                7350
            ],
            [
                7352,
                7500
            ],
            [
                7500,
                7599
            ],
            [
                7608,
                7620
            ],
            [
                7621,
                7636
            ],
            [
                7637,
                7640
            ],
            [
                7641,
                7659
            ],
            [
                7659,
                7667
            ],
            [
                7668,
                7671
            ],
            [
                7675,
                7682
            ],
            [
                7687,
                7735
            ],
            [
                7735,
                7747
            ],
            [
                7747,
                7767
            ],
            [
                7768,
                7798
            ],
            [
                7807,
                7809
            ],
            [
                7809,
                7831
            ],
            [
                7832,
                7853
            ],
            [
                7853,
                7877
            ],
            [
                7888,
                7925
            ],
            [
                7932,
                7935
            ],
            [
                7941,
                7943
            ],
            [
                7944,
                7957
            ],
            [
                7958,
                7964
            ],
            [
                7965,
                7993
            ],
            [
                7994,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8192
            ],
            [
                8198,
                8253
            ],
            [
                8262,
                8264
            ],
            [
                8264,
                8285
            ],
            [
                8285,
                8327
            ],
            [
                8327,
                8383
            ],
            [
                8383,
                8385
            ],
            [
                8385,
                8394
            ],
            [
                8404,
                8586
            ],
            [
                8591,
                8608
            ],
            [
                8609,
                8612
            ],
            [
                8613,
                8633
            ],
            [
                8639,
                8643
            ],
            [
                8667,
                8753
            ],
            [
                8757,
                8765
            ],
            [
                8767,
                8823
            ],
            [
                8823,
                8879
            ],
            [
                8879,
                8915
            ],
            [
                8915,
                8917
            ],
            [
                8917,
                8937
            ],
            [
                8947,
                8966
            ],
            [
                8966,
                8995
            ],
            [
                9007,
                9084
            ],
            [
                9087,
                9111
            ],
            [
                9111,
                9195
            ],
            [
                9195,
                9273
            ],
            [
                9273,
                9318
            ],
            [
                9318,
                9359
            ],
            [
                9359,
                9403
            ],
            [
                9409,
                9411
            ],
            [
                9411,
                9453
            ],
            [
                9480,
                9485
            ],
            [
                9486,
                9502
            ],
            [
                9502,
                9504
            ],
            [
                9512,
                9532
            ],
            [
                9532,
                9542
            ],
            [
                9543,
                9569
            ],
            [
                9570,
                9585
            ],
            [
                9586,
                9610
            ],
            [
                9613,
                9624
            ],
            [
                9627,
                9654
            ],
            [
                9654,
                9695
            ],
            [
                9695,
                9720
            ],
            [
                9723,
                9735
            ],
            [
                9737,
                9779
            ],
            [
                9780,
                9785
            ],
            [
                9785,
                9787
            ],
            [
                9787,
                9868
            ],
            [
                9868,
                9953
            ],
            [
                9954,
                9971
            ],
            [
                9971,
                10062
            ],
            [
                10062,
                10099
            ],
            [
                10105,
                10134
            ],
            [
                10134,
                10209
            ],
            [
                10209,
                10243
            ],
            [
                10244,
                10276
            ],
            [
                10277,
                10350
            ],
            [
                10356,
                10384
            ],
            [
                10390,
                10401
            ],
            [
                10401,
                10403
            ],
            [
                10403,
                10413
            ],
            [
                10422,
                10441
            ],
            [
                10448,
                10507
            ],
            [
                10508,
                10602
            ],
            [
                10603,
                10605
            ],
            [
                10606,
                10613
            ],
            [
                10626,
                10658
            ],
            [
                10665,
                10672
            ],
            [
                10672,
                10674
            ],
            [
                10674,
                10714
            ],
            [
                10715,
                10752
            ],
            [
                10761,
                10763
            ],
            [
                10763,
                10818
            ],
            [
                10819,
                10845
            ],
            [
                10846,
                10850
            ],
            [
                10851,
                10898
            ],
            [
                10900,
                10936
            ],
            [
                10936,
                10985
            ],
            [
                10985,
                10986
            ],
            [
                10991,
                11032
            ],
            [
                11032,
                11080
            ],
            [
                11083,
                11149
            ],
            [
                11158,
                11160
            ],
            [
                11160,
                11185
            ],
            [
                11186,
                11214
            ],
            [
                11214,
                11220
            ],
            [
                11226,
                11289
            ],
            [
                11289,
                11330
            ],
            [
                11340,
                11360
            ],
            [
                11369,
                11388
            ],
            [
                11388,
                11482
            ],
            [
                11489,
                11513
            ],
            [
                11527,
                11563
            ],
            [
                11570,
                11574
            ],
            [
                11575,
                11586
            ],
            [
                11586,
                11600
            ],
            [
                11600,
                11640
            ],
            [
                11642,
                11649
            ],
            [
                11654,
                11670
            ],
            [
                11672,
                11751
            ],
            [
                11754,
                11805
            ],
            [
                11806,
                11817
            ],
            [
                11817,
                11854
            ],
            [
                11854,
                11949
            ],
            [
                11951,
                11961
            ],
            [
                11962,
                12144
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                79
            ],
            [
                79,
                236
            ],
            [
                236,
                378
            ],
            [
                378,
                468
            ],
            [
                468,
                590
            ],
            [
                590,
                849
            ],
            [
                849,
                1041
            ],
            [
                1041,
                1041
            ],
            [
                1041,
                1041
            ],
            [
                1041,
                1081
            ],
            [
                1081,
                1149
            ],
            [
                1149,
                1301
            ],
            [
                1301,
                1519
            ],
            [
                1519,
                1628
            ],
            [
                1628,
                1732
            ],
            [
                1732,
                1793
            ],
            [
                1793,
                2007
            ],
            [
                2007,
                2007
            ],
            [
                2007,
                2200
            ],
            [
                2200,
                2424
            ],
            [
                2424,
                2711
            ],
            [
                2711,
                2786
            ],
            [
                2786,
                2852
            ],
            [
                2852,
                3044
            ],
            [
                3044,
                3071
            ],
            [
                3071,
                3121
            ],
            [
                3121,
                3152
            ],
            [
                3152,
                3193
            ],
            [
                3193,
                3239
            ],
            [
                3239,
                3333
            ],
            [
                3333,
                3333
            ],
            [
                3333,
                3354
            ],
            [
                3354,
                3412
            ],
            [
                3412,
                3445
            ],
            [
                3445,
                3491
            ],
            [
                3491,
                3579
            ],
            [
                3579,
                3613
            ],
            [
                3613,
                3647
            ],
            [
                3647,
                3684
            ],
            [
                3684,
                3697
            ],
            [
                3697,
                3750
            ],
            [
                3750,
                3828
            ],
            [
                3828,
                3884
            ],
            [
                3884,
                3982
            ],
            [
                3982,
                4016
            ],
            [
                4016,
                4185
            ],
            [
                4185,
                4211
            ],
            [
                4211,
                4248
            ],
            [
                4248,
                4248
            ],
            [
                4248,
                4291
            ],
            [
                4291,
                4346
            ],
            [
                4346,
                4355
            ],
            [
                4355,
                4397
            ],
            [
                4397,
                4536
            ],
            [
                4536,
                4581
            ],
            [
                4581,
                4691
            ],
            [
                4691,
                4751
            ],
            [
                4751,
                4978
            ],
            [
                4978,
                5059
            ],
            [
                5059,
                5094
            ],
            [
                5094,
                5140
            ],
            [
                5140,
                5261
            ],
            [
                5261,
                5287
            ],
            [
                5287,
                5311
            ],
            [
                5311,
                5327
            ],
            [
                5327,
                5361
            ],
            [
                5361,
                5395
            ],
            [
                5395,
                5472
            ],
            [
                5472,
                5531
            ],
            [
                5531,
                5600
            ],
            [
                5600,
                5684
            ],
            [
                5684,
                5804
            ],
            [
                5804,
                5804
            ],
            [
                5804,
                5971
            ],
            [
                5971,
                6046
            ],
            [
                6046,
                6127
            ],
            [
                6127,
                6127
            ],
            [
                6127,
                6127
            ],
            [
                6127,
                6163
            ],
            [
                6163,
                6246
            ],
            [
                6246,
                6526
            ],
            [
                6526,
                6731
            ],
            [
                6731,
                6753
            ],
            [
                6753,
                7034
            ],
            [
                7034,
                7134
            ],
            [
                7134,
                7259
            ],
            [
                7259,
                7307
            ],
            [
                7307,
                7500
            ],
            [
                7500,
                7659
            ],
            [
                7659,
                7735
            ],
            [
                7735,
                7747
            ],
            [
                7747,
                7809
            ],
            [
                7809,
                7853
            ],
            [
                7853,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8264
            ],
            [
                8264,
                8285
            ],
            [
                8285,
                8327
            ],
            [
                8327,
                8385
            ],
            [
                8385,
                8767
            ],
            [
                8767,
                8823
            ],
            [
                8823,
                8879
            ],
            [
                8879,
                8917
            ],
            [
                8917,
                8966
            ],
            [
                8966,
                9111
            ],
            [
                9111,
                9195
            ],
            [
                9195,
                9273
            ],
            [
                9273,
                9318
            ],
            [
                9318,
                9359
            ],
            [
                9359,
                9411
            ],
            [
                9411,
                9502
            ],
            [
                9502,
                9532
            ],
            [
                9532,
                9654
            ],
            [
                9654,
                9695
            ],
            [
                9695,
                9723
            ],
            [
                9723,
                9723
            ],
            [
                9723,
                9787
            ],
            [
                9787,
                9868
            ],
            [
                9868,
                9971
            ],
            [
                9971,
                10062
            ],
            [
                10062,
                10134
            ],
            [
                10134,
                10403
            ],
            [
                10403,
                10674
            ],
            [
                10674,
                10763
            ],
            [
                10763,
                10936
            ],
            [
                10936,
                11032
            ],
            [
                11032,
                11160
            ],
            [
                11160,
                11214
            ],
            [
                11214,
                11214
            ],
            [
                11214,
                11289
            ],
            [
                11289,
                11388
            ],
            [
                11388,
                11489
            ],
            [
                11489,
                11586
            ],
            [
                11586,
                11600
            ],
            [
                11600,
                11672
            ],
            [
                11672,
                11672
            ],
            [
                11672,
                11672
            ],
            [
                11672,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11754
            ],
            [
                11754,
                11817
            ],
            [
                11817,
                11854
            ],
            [
                11854,
                12144
            ]
        ]
    }
}