{
    "original": {
        "text": "Fairy folk a-listening Hear the seed sprout in the spring. And for music to their dance Hear the hedgerows wake from trance, Sap that trembles into buds Sending little rhythmic floods Of fairy sound in fairy ears. Thus all beauty that appears Has birth as sound to finer sense And lighter-clad intelligence.\nAnd Gwendolen? She was thinking of Deronda much more than he was thinking of her--often wondering what were his ideas \"about things,\" and how his life was occupied. But a lap-dog would be necessarily at a loss in framing to itself the motives and adventures of doghood at large; and it was as far from Gwendolen's conception that Deronda's life could be determined by the historical destiny of the Jews, as that he could rise into the air on a brazen horse, and so vanish from her horizon in the form of a twinkling star.\nWith all the sense of inferiority that had been forced upon her, it was inevitable that she should imagine a larger place for herself in his thoughts than she actually possessed. They must be rather old and wise persons who are not apt to see their own anxiety or elation about themselves reflected in other minds; and Gwendolen, with her youth and inward solitude, may be excused for dwelling on signs of special interest in her shown by the one person who had impressed her with the feeling of submission, and for mistaking the color and proportion of those signs in the mind of Deronda.\nMeanwhile, what would he tell her that she ought to do? \"He said, I must get more interest in others, and more knowledge, and that I must care about the best things--but how am I to begin?\" She wondered what books he would tell her to take up to her own room, and recalled the famous writers that she had either not looked into or had found the most unreadable, with a half-smiling wish that she could mischievously ask Deronda if they were not the books called \"medicine for the mind.\" Then she repented of her sauciness, and when she was safe from observation carried up a miscellaneous selection--Descartes, Bacon, Locke, Butler, Burke, Guizot--knowing, as a clever young lady of education, that these authors were ornaments of mankind, feeling sure that Deronda had read them, and hoping that by dipping into them all in succession, with her rapid understanding she might get a point of view nearer to his level.\nBut it was astonishing how little time she found for these vast mental excursions. Constantly she had to be on the scene as Mrs. Grandcourt, and to feel herself watched in that part by the exacting eyes of a husband who had found a motive to exercise his tenacity--that of making his marriage answer all the ends he chose, and with the more completeness the more he discerned any opposing will in her. And she herself, whatever rebellion might be going on within her, could not have made up her mind to failure in her representation. No feeling had yet reconciled her for a moment to any act, word, or look that would be a confession to the world: and what she most dreaded in herself was any violent impulse that would make an involuntary confession: it was the will to be silent in every other direction that had thrown the more impetuosity into her confidences toward Deronda, to whom her thought continually turned as a help against herself. Her riding, her hunting, her visiting and receiving of visits, were all performed in a spirit of achievement which served instead of zest and young gladness, so that all around Diplow, in those weeks of the new year, Mrs. Grandcourt was regarded as wearing her honors with triumph.\n\"She disguises it under an air of taking everything as a matter of course,\" said Mrs. Arrowpoint. \"A stranger might suppose that she had condescended rather than risen. I always noticed that doubleness in her.\"\nTo her mother most of all Gwendolen was bent on acting complete satisfaction, and poor Mrs. Davilow was so far deceived that she took the unexpected distance at which she was kept, in spite of what she felt to be Grandcourt's handsome behavior in providing for her, as a comparative indifference in her daughter, now that marriage had created new interests. To be fetched to lunch and then to dinner along with the Gascoignes, to be driven back soon after breakfast the next morning, and to have brief calls from Gwendolen in which her husband waited for her outside either on horseback or sitting in the carriage, was all the intercourse allowed to her mother.\nThe truth was, that the second time Gwendolen proposed to invite her mother with Mr. and Mrs. Gascoigne, Grandcourt had at first been silent, and then drawled, \"We can't be having _those people_ always. Gascoigne talks too much. Country clergy are always bores--with their confounded fuss about everything.\"\nThat speech was full of foreboding for Gwendolen. To have her mother classed under \"those people\" was enough to confirm the previous dread of bringing her too near. Still, she could not give the true reasons--she could not say to her mother, \"Mr. Grandcourt wants to recognize you as little as possible; and besides it is better you should not see much of my married life, else you might find out that I am miserable.\" So she waived as lightly as she could every allusion to the subject; and when Mrs. Davilow again hinted the possibility of her having a house close to Ryelands, Gwendolen said, \"It would not be so nice for you as being near the rectory here, mamma. We shall perhaps be very little at Ryelands. You would miss my aunt and uncle.\"\nAnd all the while this contemptuous veto of her husband's on any intimacy with her family, making her proudly shrink from giving them the aspect of troublesome pensioners, was rousing more inward inclination toward them. She had never felt so kindly toward her uncle, so much disposed to look back on his cheerful, complacent activity and spirit of kind management, even when mistaken, as more of a comfort than the neutral loftiness which was every day chilling her. And here perhaps she was unconsciously finding some of that mental enlargement which it was hard to get from her occasional dashes into difficult authors, who instead of blending themselves with her daily agitations required her to dismiss them.\nIt was a delightful surprise one day when Mr. and Mrs. Gascoigne were at Offendene to see Gwendolen ride up without her husband--with the groom only. All, including the four girls and Miss Merry, seated in the dining-room at lunch, could see the welcome approach; and even the elder ones were not without something of Isabel's romantic sense that the beautiful sister on the splendid chestnut, which held its head as if proud to bear her, was a sort of Harriet Byron or Miss Wardour reappearing out of her \"happiness ever after.\"\nHer uncle went to the door to give her his hand, and she sprang from her horse with an air of alacrity which might well encourage that notion of guaranteed happiness; for Gwendolen was particularly bent to-day on setting her mother's heart at rest, and her unusual sense of freedom in being able to make this visit alone enabled her to bear up under the pressure of painful facts which were urging themselves anew. The seven family kisses were not so tiresome as they used to be.\n\"Mr. Grandcourt is gone out, so I determined to fill up the time by coming to you, mamma,\" said Gwendolen, as she laid down her hat and seated herself next to her mother; and then looking at her with a playfully monitory air, \"That is a punishment to you for not wearing better lace on your head. You didn't think I should come and detect you--you dreadfully careless-about-yourself mamma!\" She gave a caressing touch to the dear head.\n\"Scold me, dear,\" said Mrs. Davilow, her delicate worn face flushing with delight. \"But I wish there was something you could eat after your ride--instead of these scraps. Let Jocosa make you a cup of chocolate in your old way. You used to like that.\"\nMiss Merry immediately rose and went out, though Gwendolen said, \"Oh, no, a piece of bread, or one of those hard biscuits. I can't think about eating. I am come to say good-bye.\"\n\"What! going to Ryelands again?\" said Mr. Gascoigne.\n\"No, we are going to town,\" said Gwendolen, beginning to break up a piece of bread, but putting no morsel into her mouth.\n\"It is rather early to go to town,\" said Mrs. Gascoigne, \"and Mr. Grandcourt not in Parliament.\"\n\"Oh, there is only one more day's hunting to be had, and Henleigh has some business in town with lawyers, I think,\" said Gwendolen. \"I am very glad. I shall like to go to town.\"\n\"You will see your house in Grosvenor Square,\" said Mrs. Davilow. She and the girls were devouring with their eyes every movement of their goddess, soon to vanish.\n\"Yes,\" said Gwendolen, in a tone of assent to the interest of that expectation. \"And there is so much to be seen and done in town.\"\n\"I wish, my dear Gwendolen,\" said Mr. Gascoigne, in a kind of cordial advice, \"that you would use your influence with Mr. Grandcourt to induce him to enter Parliament. A man of his position should make his weight felt in politics. The best judges are confident that the ministry will have to appeal to the country on this question of further Reform, and Mr. Grandcourt should be ready for the opportunity. I am not quite sure that his opinions and mine accord entirely; I have not heard him express himself very fully. But I don't look at the matter from that point of view. I am thinking of your husband's standing in the country. And he has now come to that stage of life when a man like him should enter into public affairs. A wife has great influence with her husband. Use yours in that direction, my dear.\"\nThe rector felt that he was acquitting himself of a duty here, and giving something like the aspect of a public benefit to his niece's match. To Gwendolen the whole speech had the flavor of bitter comedy. If she had been merry, she must have laughed at her uncle's explanation to her that he had not heard Grandcourt express himself very fully on politics. And the wife's great influence! General maxims about husbands and wives seemed now of a precarious usefulness. Gwendolen herself had once believed in her future influence as an omnipotence in managing--she did not know exactly what. But her chief concern at present was to give an answer that would be felt appropriate.\n\"I should be very glad, uncle. But I think Mr. Grandcourt would not like the trouble of an election--at least, unless it could be without his making speeches. I thought candidates always made speeches.\"\n\"Not necessarily--to any great extent,\" said Mr. Gascoigne. \"A man of position and weight can get on without much of it. A county member need have very little trouble in that way, and both out of the House and in it is liked the better for not being a speechifier. Tell Mr. Grandcourt that I say so.\"\n\"Here comes Jocosa with my chocolate after all,\" said Gwendolen, escaping from a promise to give information that would certainly have been received in a way inconceivable to the good rector, who, pushing his chair a little aside from the table and crossing his leg, looked as well as if he felt like a worthy specimen of a clergyman and magistrate giving experienced advice. Mr. Gascoigne had come to the conclusion that Grandcourt was a proud man, but his own self-love, calmed through life by the consciousness of his general value and personal advantages, was not irritable enough to prevent him from hoping the best about his niece's husband because her uncle was kept rather haughtily at a distance. A certain aloofness must be allowed to the representative of an old family; you would not expect him to be on intimate terms even with abstractions. But Mrs. Gascoigne was less dispassionate on her husband's account, and felt Grandcourt's haughtiness as something a little blameable in Gwendolen.\n\"Your uncle and Anna will very likely be in town about Easter,\" she said, with a vague sense of expressing a slight discontent. \"Dear Rex hopes to come out with honors and a fellowship, and he wants his father and Anna to meet him in London, that they may be jolly together, as he says. I shouldn't wonder if Lord Brackenshaw invited them, he has been so very kind since he came back to the Castle.\"\n\"I hope my uncle will bring Ann to stay in Grosvenor Square,\" said Gwendolen, risking herself so far, for the sake of the present moment, but in reality wishing that she might never be obliged to bring any of her family near Grandcourt again. \"I am very glad of Rex's good fortune.\"\n\"We must not be premature, and rejoice too much beforehand,\" said the rector, to whom this topic was the happiest in the world, and altogether allowable, now that the issue of that little affair about Gwendolen had been so satisfactory. \"Not but that I am in correspondence with impartial judges, who have the highest hopes about my son, as a singularly clear-headed young man. And of his excellent disposition and principle I have had the best evidence.\"\n\"We shall have him a great lawyer some time,\" said Mrs. Gascoigne.\n\"How very nice!\" said Gwendolen, with a concealed scepticism as to niceness in general, which made the word quite applicable to lawyers.\n\"Talking of Lord Brackenshaw's kindness,\" said Mrs. Davilow, \"you don't know how delightful he has been, Gwendolen. He has begged me to consider myself his guest in this house till I can get another that I like--he did it in the most graceful way. But now a house has turned up. Old Mr. Jodson is dead, and we can have his house. It is just what I want; small, but with nothing hideous to make you miserable thinking about it. And it is only a mile from the Rectory. You remember the low white house nearly hidden by the trees, as we turn up the lane to the church?\"\n\"Yes, but you have no furniture, poor mamma,\" said Gwendolen, in a melancholy tone.\n\"Oh, I am saving money for that. You know who has made me rather rich, dear,\" said Mrs. Davilow, laying her hand on Gwendolen's. \"And Jocosa really makes so little do for housekeeping--it is quite wonderful.\"\n\"Oh, please let me go up-stairs with you and arrange my hat, mamma,\" said Gwendolen, suddenly putting up her hand to her hair and perhaps creating a desired disarrangement. Her heart was swelling, and she was ready to cry. Her mother _must_ have been worse off, if it had not been for Grandcourt. \"I suppose I shall never see all this again,\" said Gwendolen, looking round her, as they entered the black and yellow bedroom, and then throwing herself into a chair in front of the glass with a little groan as of bodily fatigue. In the resolve not to cry she had become very pale.\n\"You are not well, dear?\" said Mrs. Davilow.\n\"No; that chocolate has made me sick,\" said Gwendolen, putting up her hand to be taken.\n\"I should be allowed to come to you if you were ill, darling,\" said Mrs. Davilow, rather timidly, as she pressed the hand to her bosom. Something had made her sure today that her child loved her--needed her as much as ever.\n\"Oh, yes,\" said Gwendolen, leaning her head against her mother, though speaking as lightly as she could. \"But you know I never am ill. I am as strong as possible; and you must not take to fretting about me, but make yourself as happy as you can with the girls. They are better children to you than I have been, you know.\" She turned up her face with a smile.\n\"You have always been good, my darling. I remember nothing else.\"\n\"Why, what did I ever do that was good to you, except marry Mr. Grandcourt?\" said Gwendolen, starting up with a desperate resolve to be playful, and keep no more on the perilous edge of agitation. \"And I should not have done that unless it had pleased myself.\" She tossed up her chin, and reached her hat.\n\"God forbid, child! I would not have had you marry for my sake. Your happiness by itself is half mine.\"\n\"Very well,\" said Gwendolen, arranging her hat fastidiously, \"then you will please to consider that you are half happy, which is more than I am used to seeing you.\" With the last words she again turned with her old playful smile to her mother. \"Now I am ready; but oh, mamma, Mr. Grandcourt gives me a quantity of money, and expects me to spend it, and I can't spend it; and you know I can't bear charity children and all that; and here are thirty pounds. I wish the girls would spend it for me on little things for themselves when you go to the new house. Tell them so.\" Gwendolen put the notes into her mother's hands and looked away hastily, moving toward the door.\n\"God bless you, dear,\" said Mrs. Davilow. \"It will please them so that you should have thought of them in particular.\"\n\"Oh, they are troublesome things; but they don't trouble me now,\" said Gwendolen, turning and nodding playfully. She hardly understood her own feeling in this act toward her sisters, but at any rate she did not wish it to be taken as anything serious. She was glad to have got out of the bedroom without showing more signs of emotion, and she went through the rest of her visit and all the good-byes with a quiet propriety that made her say to herself sarcastically as she rode away, \"I think I am making a very good Mrs. Grandcourt.\"\nShe believed that her husband had gone to Gadsmere that day--had inferred this, as she had long ago inferred who were the inmates of what he had described as \"a dog-hutch of a place in a black country;\" and the strange conflict of feeling within her had had the characteristic effect of sending her to Offendene with a tightened resolve--a form of excitement which was native to her.\nShe wondered at her own contradictions. Why should she feel it bitter to her that Grandcourt showed concern for the beings on whose account she herself was undergoing remorse? Had she not before her marriage inwardly determined to speak and act on their behalf?--and since he had lately implied that he wanted to be in town because he was making arrangements about his will, she ought to have been glad of any sign that he kept a conscience awake toward those at Gadsmere; and yet, now that she was a wife, the sense that Grandcourt was gone to Gadsmere was like red heat near a burn. She had brought on herself this indignity in her own eyes--this humiliation of being doomed to a terrified silence lest her husband should discover with what sort of consciousness she had married him; and as she had said to Deronda, she \"must go on.\" After the intense moments of secret hatred toward this husband who from the very first had cowed her, there always came back the spiritual pressure which made submission inevitable. There was no effort at freedoms that would not bring fresh and worse humiliation. Gwendolen could dare nothing except an impulsive action--least of all could she dare premeditatedly a vague future in which the only certain condition was indignity. In spite of remorse, it still seemed the worst result of her marriage that she should in any way make a spectacle of herself; and her humiliation was lightened by her thinking that only Mrs. Glasher was aware of the fact which caused it. For Gwendolen had never referred the interview at the Whispering Stones to Lush's agency; her disposition to vague terror investing with shadowy omnipresence any threat of fatal power over her, and so hindering her from imagining plans and channels by which news had been conveyed to the woman who had the poisoning skill of a sorceress. To Gwendolen's mind the secret lay with Mrs. Glasher, and there were words in the horrible letter which implied that Mrs. Glasher would dread disclosure to the husband, as much as the usurping Mrs. Grandcourt.\nSomething else, too, she thought of as more of a secret from her husband than it really was--namely that suppressed struggle of desperate rebellion which she herself dreaded. Grandcourt could not indeed fully imagine how things affected Gwendolen: he had no imagination of anything in her but what affected the gratification of his own will; but on this point he had the sensibility which seems like divination. What we see exclusively we are apt to see with some mistake of proportions; and Grandcourt was not likely to be infallible in his judgments concerning this wife who was governed by many shadowy powers, to him nonexistent. He magnified her inward resistance, but that did not lessen his satisfaction in the mastery of it.",
        "paragraph_chars": [
            [
                0,
                308
            ],
            [
                308,
                830
            ],
            [
                830,
                1420
            ],
            [
                1420,
                2337
            ],
            [
                2337,
                3565
            ],
            [
                3565,
                3776
            ],
            [
                3776,
                4438
            ],
            [
                4438,
                4746
            ],
            [
                4746,
                5494
            ],
            [
                5494,
                6208
            ],
            [
                6208,
                6738
            ],
            [
                6738,
                7218
            ],
            [
                7218,
                7654
            ],
            [
                7654,
                7905
            ],
            [
                7905,
                8084
            ],
            [
                8084,
                8137
            ],
            [
                8137,
                8259
            ],
            [
                8259,
                8356
            ],
            [
                8356,
                8534
            ],
            [
                8534,
                8698
            ],
            [
                8698,
                8830
            ],
            [
                8830,
                9642
            ],
            [
                9642,
                10319
            ],
            [
                10319,
                10522
            ],
            [
                10522,
                10823
            ],
            [
                10823,
                11826
            ],
            [
                11826,
                12226
            ],
            [
                12226,
                12509
            ],
            [
                12509,
                12965
            ],
            [
                12965,
                13032
            ],
            [
                13032,
                13169
            ],
            [
                13169,
                13736
            ],
            [
                13736,
                13820
            ],
            [
                13820,
                14029
            ],
            [
                14029,
                14608
            ],
            [
                14608,
                14653
            ],
            [
                14653,
                14741
            ],
            [
                14741,
                14965
            ],
            [
                14965,
                15324
            ],
            [
                15324,
                15390
            ],
            [
                15390,
                15696
            ],
            [
                15696,
                15800
            ],
            [
                15800,
                16469
            ],
            [
                16469,
                16588
            ],
            [
                16588,
                17123
            ],
            [
                17123,
                17507
            ],
            [
                17507,
                19559
            ],
            [
                19559,
                20291
            ]
        ],
        "segment_chars": [
            [
                0,
                59
            ],
            [
                59,
                214
            ],
            [
                214,
                308
            ],
            [
                308,
                323
            ],
            [
                323,
                473
            ],
            [
                473,
                830
            ],
            [
                830,
                1009
            ],
            [
                1009,
                1420
            ],
            [
                1420,
                1476
            ],
            [
                1476,
                1610
            ],
            [
                1610,
                1907
            ],
            [
                1907,
                2337
            ],
            [
                2337,
                2420
            ],
            [
                2420,
                2739
            ],
            [
                2739,
                2871
            ],
            [
                2871,
                3283
            ],
            [
                3283,
                3565
            ],
            [
                3565,
                3663
            ],
            [
                3663,
                3734
            ],
            [
                3734,
                3776
            ],
            [
                3776,
                4134
            ],
            [
                4134,
                4438
            ],
            [
                4438,
                4641
            ],
            [
                4641,
                4667
            ],
            [
                4667,
                4746
            ],
            [
                4746,
                4796
            ],
            [
                4796,
                4911
            ],
            [
                4911,
                5165
            ],
            [
                5165,
                5414
            ],
            [
                5414,
                5459
            ],
            [
                5459,
                5494
            ],
            [
                5494,
                5715
            ],
            [
                5715,
                5962
            ],
            [
                5962,
                6208
            ],
            [
                6208,
                6358
            ],
            [
                6358,
                6738
            ],
            [
                6738,
                7153
            ],
            [
                7153,
                7218
            ],
            [
                7218,
                7515
            ],
            [
                7515,
                7609
            ],
            [
                7609,
                7654
            ],
            [
                7654,
                7737
            ],
            [
                7737,
                7825
            ],
            [
                7825,
                7881
            ],
            [
                7881,
                7905
            ],
            [
                7905,
                8028
            ],
            [
                8028,
                8056
            ],
            [
                8056,
                8084
            ],
            [
                8084,
                8091
            ],
            [
                8091,
                8117
            ],
            [
                8117,
                8137
            ],
            [
                8137,
                8259
            ],
            [
                8259,
                8356
            ],
            [
                8356,
                8488
            ],
            [
                8488,
                8505
            ],
            [
                8505,
                8534
            ],
            [
                8534,
                8600
            ],
            [
                8600,
                8698
            ],
            [
                8698,
                8778
            ],
            [
                8778,
                8830
            ],
            [
                8830,
                8998
            ],
            [
                8998,
                9061
            ],
            [
                9061,
                9236
            ],
            [
                9236,
                9349
            ],
            [
                9349,
                9405
            ],
            [
                9405,
                9462
            ],
            [
                9462,
                9558
            ],
            [
                9558,
                9603
            ],
            [
                9603,
                9642
            ],
            [
                9642,
                9784
            ],
            [
                9784,
                9847
            ],
            [
                9847,
                9999
            ],
            [
                9999,
                10031
            ],
            [
                10031,
                10110
            ],
            [
                10110,
                10232
            ],
            [
                10232,
                10319
            ],
            [
                10319,
                10350
            ],
            [
                10350,
                10478
            ],
            [
                10478,
                10522
            ],
            [
                10522,
                10582
            ],
            [
                10582,
                10643
            ],
            [
                10643,
                10787
            ],
            [
                10787,
                10823
            ],
            [
                10823,
                11199
            ],
            [
                11199,
                11529
            ],
            [
                11529,
                11678
            ],
            [
                11678,
                11826
            ],
            [
                11826,
                11954
            ],
            [
                11954,
                12113
            ],
            [
                12113,
                12226
            ],
            [
                12226,
                12469
            ],
            [
                12469,
                12509
            ],
            [
                12509,
                12746
            ],
            [
                12746,
                12887
            ],
            [
                12887,
                12965
            ],
            [
                12965,
                13032
            ],
            [
                13032,
                13049
            ],
            [
                13049,
                13169
            ],
            [
                13169,
                13285
            ],
            [
                13285,
                13417
            ],
            [
                13417,
                13448
            ],
            [
                13448,
                13499
            ],
            [
                13499,
                13596
            ],
            [
                13596,
                13636
            ],
            [
                13636,
                13736
            ],
            [
                13736,
                13820
            ],
            [
                13820,
                13853
            ],
            [
                13853,
                13949
            ],
            [
                13949,
                14029
            ],
            [
                14029,
                14202
            ],
            [
                14202,
                14252
            ],
            [
                14252,
                14326
            ],
            [
                14326,
                14556
            ],
            [
                14556,
                14608
            ],
            [
                14608,
                14634
            ],
            [
                14634,
                14653
            ],
            [
                14653,
                14741
            ],
            [
                14741,
                14877
            ],
            [
                14877,
                14965
            ],
            [
                14965,
                15070
            ],
            [
                15070,
                15100
            ],
            [
                15100,
                15226
            ],
            [
                15226,
                15287
            ],
            [
                15287,
                15324
            ],
            [
                15324,
                15364
            ],
            [
                15364,
                15390
            ],
            [
                15390,
                15467
            ],
            [
                15467,
                15587
            ],
            [
                15587,
                15651
            ],
            [
                15651,
                15696
            ],
            [
                15696,
                15716
            ],
            [
                15716,
                15760
            ],
            [
                15760,
                15800
            ],
            [
                15800,
                15965
            ],
            [
                15965,
                16044
            ],
            [
                16044,
                16256
            ],
            [
                16256,
                16357
            ],
            [
                16357,
                16372
            ],
            [
                16372,
                16469
            ],
            [
                16469,
                16511
            ],
            [
                16511,
                16588
            ],
            [
                16588,
                16701
            ],
            [
                16701,
                16840
            ],
            [
                16840,
                17123
            ],
            [
                17123,
                17507
            ],
            [
                17507,
                17547
            ],
            [
                17547,
                17683
            ],
            [
                17683,
                18092
            ],
            [
                18092,
                18343
            ],
            [
                18343,
                18525
            ],
            [
                18525,
                18607
            ],
            [
                18607,
                18773
            ],
            [
                18773,
                19011
            ],
            [
                19011,
                19349
            ],
            [
                19349,
                19559
            ],
            [
                19559,
                19734
            ],
            [
                19734,
                19971
            ],
            [
                19971,
                20193
            ],
            [
                20193,
                20291
            ]
        ],
        "overlap_chars": [
            [
                308,
                323
            ],
            [
                323,
                388
            ],
            [
                390,
                405
            ],
            [
                427,
                432
            ],
            [
                416,
                425
            ],
            [
                442,
                473
            ],
            [
                473,
                495
            ],
            [
                508,
                517
            ],
            [
                529,
                531
            ],
            [
                539,
                542
            ],
            [
                555,
                590
            ],
            [
                610,
                619
            ],
            [
                622,
                710
            ],
            [
                828,
                830
            ],
            [
                918,
                921
            ],
            [
                937,
                997
            ],
            [
                1143,
                1144
            ],
            [
                1160,
                1178
            ],
            [
                1186,
                1195
            ],
            [
                1196,
                1226
            ],
            [
                1227,
                1305
            ],
            [
                1315,
                1322
            ],
            [
                1326,
                1336
            ],
            [
                1418,
                1420
            ],
            [
                1431,
                1453
            ],
            [
                1469,
                1476
            ],
            [
                1476,
                1540
            ],
            [
                1586,
                1610
            ],
            [
                1610,
                1654
            ],
            [
                1678,
                1679
            ],
            [
                1693,
                1780
            ],
            [
                1680,
                1683
            ],
            [
                1787,
                1788
            ],
            [
                1663,
                1669
            ],
            [
                1674,
                1678
            ],
            [
                1793,
                1794
            ],
            [
                1780,
                1781
            ],
            [
                2068,
                2075
            ],
            [
                1965,
                1969
            ],
            [
                1928,
                1931
            ],
            [
                2103,
                2112
            ],
            [
                2114,
                2159
            ],
            [
                1912,
                1915
            ],
            [
                2168,
                2204
            ],
            [
                2212,
                2237
            ],
            [
                2255,
                2337
            ],
            [
                2337,
                2420
            ],
            [
                2420,
                2556
            ],
            [
                2653,
                2658
            ],
            [
                2576,
                2578
            ],
            [
                2669,
                2677
            ],
            [
                2691,
                2738
            ],
            [
                2739,
                2804
            ],
            [
                2811,
                2814
            ],
            [
                2837,
                2839
            ],
            [
                2848,
                2850
            ],
            [
                2869,
                2871
            ],
            [
                2994,
                2997
            ],
            [
                3003,
                3010
            ],
            [
                2901,
                2904
            ],
            [
                2971,
                2984
            ],
            [
                3105,
                3142
            ],
            [
                3148,
                3283
            ],
            [
                3283,
                3311
            ],
            [
                3338,
                3466
            ],
            [
                3500,
                3543
            ],
            [
                3551,
                3565
            ],
            [
                3776,
                3852
            ],
            [
                3858,
                3882
            ],
            [
                3887,
                3955
            ],
            [
                4042,
                4044
            ],
            [
                4059,
                4134
            ],
            [
                4134,
                4160
            ],
            [
                4169,
                4220
            ],
            [
                4242,
                4298
            ],
            [
                4308,
                4342
            ],
            [
                4389,
                4438
            ],
            [
                4438,
                4557
            ],
            [
                4589,
                4617
            ],
            [
                4619,
                4631
            ],
            [
                4633,
                4641
            ],
            [
                4641,
                4667
            ],
            [
                4667,
                4698
            ],
            [
                4743,
                4746
            ],
            [
                4746,
                4796
            ],
            [
                4911,
                4917
            ],
            [
                4955,
                5053
            ],
            [
                5062,
                5118
            ],
            [
                5124,
                5127
            ],
            [
                5134,
                5165
            ],
            [
                5165,
                5287
            ],
            [
                5313,
                5340
            ],
            [
                5342,
                5414
            ],
            [
                5414,
                5459
            ],
            [
                5459,
                5494
            ],
            [
                5512,
                5583
            ],
            [
                5666,
                5677
            ],
            [
                5592,
                5595
            ],
            [
                5709,
                5715
            ],
            [
                5715,
                5786
            ],
            [
                5792,
                5828
            ],
            [
                5880,
                5882
            ],
            [
                5891,
                5892
            ],
            [
                5893,
                5962
            ],
            [
                5962,
                6115
            ],
            [
                6206,
                6208
            ],
            [
                6208,
                6244
            ],
            [
                6245,
                6290
            ],
            [
                6342,
                6345
            ],
            [
                6291,
                6335
            ],
            [
                6356,
                6358
            ],
            [
                6476,
                6534
            ],
            [
                6544,
                6600
            ],
            [
                6647,
                6652
            ],
            [
                6535,
                6543
            ],
            [
                6703,
                6738
            ],
            [
                6909,
                6918
            ],
            [
                6795,
                6824
            ],
            [
                6832,
                6857
            ],
            [
                6894,
                6908
            ],
            [
                6791,
                6794
            ],
            [
                6919,
                6940
            ],
            [
                6948,
                6994
            ],
            [
                7012,
                7117
            ],
            [
                7151,
                7153
            ],
            [
                7153,
                7218
            ],
            [
                7218,
                7251
            ],
            [
                7263,
                7270
            ],
            [
                7274,
                7323
            ],
            [
                7369,
                7387
            ],
            [
                7323,
                7324
            ],
            [
                7328,
                7331
            ],
            [
                7413,
                7429
            ],
            [
                7433,
                7500
            ],
            [
                7513,
                7515
            ],
            [
                7515,
                7540
            ],
            [
                7550,
                7560
            ],
            [
                7562,
                7609
            ],
            [
                7609,
                7654
            ],
            [
                7654,
                7737
            ],
            [
                7737,
                7748
            ],
            [
                7769,
                7772
            ],
            [
                7779,
                7798
            ],
            [
                7823,
                7825
            ],
            [
                7825,
                7863
            ],
            [
                7879,
                7881
            ],
            [
                7881,
                7905
            ],
            [
                7905,
                7995
            ],
            [
                8026,
                8028
            ],
            [
                8028,
                8056
            ],
            [
                8056,
                8084
            ],
            [
                8084,
                8091
            ],
            [
                8091,
                8117
            ],
            [
                8117,
                8137
            ],
            [
                8137,
                8232
            ],
            [
                8243,
                8259
            ],
            [
                8259,
                8314
            ],
            [
                8323,
                8324
            ],
            [
                8356,
                8397
            ],
            [
                8407,
                8488
            ],
            [
                8488,
                8505
            ],
            [
                8505,
                8534
            ],
            [
                8534,
                8598
            ],
            [
                8680,
                8681
            ],
            [
                8623,
                8632
            ],
            [
                8649,
                8663
            ],
            [
                8633,
                8637
            ],
            [
                8644,
                8648
            ],
            [
                8696,
                8698
            ],
            [
                8698,
                8702
            ],
            [
                8776,
                8778
            ],
            [
                8779,
                8805
            ],
            [
                8815,
                8830
            ],
            [
                8830,
                8877
            ],
            [
                8892,
                8896
            ],
            [
                8906,
                8998
            ],
            [
                8998,
                9061
            ],
            [
                9462,
                9558
            ],
            [
                9558,
                9603
            ],
            [
                9603,
                9642
            ],
            [
                9784,
                9796
            ],
            [
                9807,
                9821
            ],
            [
                9829,
                9847
            ],
            [
                10003,
                10031
            ],
            [
                10128,
                10172
            ],
            [
                10188,
                10199
            ],
            [
                10201,
                10232
            ],
            [
                10232,
                10253
            ],
            [
                10265,
                10279
            ],
            [
                10306,
                10317
            ],
            [
                10280,
                10286
            ],
            [
                10317,
                10319
            ],
            [
                10319,
                10350
            ],
            [
                10350,
                10418
            ],
            [
                10420,
                10478
            ],
            [
                10478,
                10522
            ],
            [
                10522,
                10538
            ],
            [
                10559,
                10582
            ],
            [
                10582,
                10600
            ],
            [
                10612,
                10643
            ],
            [
                10643,
                10705
            ],
            [
                10738,
                10787
            ],
            [
                10787,
                10823
            ],
            [
                10823,
                10859
            ],
            [
                10869,
                10911
            ],
            [
                10932,
                11013
            ],
            [
                11197,
                11199
            ],
            [
                11199,
                11216
            ],
            [
                11240,
                11276
            ],
            [
                11383,
                11390
            ],
            [
                11222,
                11224
            ],
            [
                11450,
                11469
            ],
            [
                11419,
                11422
            ],
            [
                11504,
                11529
            ],
            [
                11529,
                11603
            ],
            [
                11676,
                11678
            ],
            [
                11678,
                11696
            ],
            [
                11750,
                11826
            ],
            [
                11826,
                11898
            ],
            [
                11952,
                11954
            ],
            [
                11954,
                11986
            ],
            [
                11994,
                12015
            ],
            [
                12019,
                12113
            ],
            [
                12113,
                12164
            ],
            [
                12166,
                12168
            ],
            [
                12178,
                12190
            ],
            [
                12223,
                12226
            ],
            [
                12226,
                12257
            ],
            [
                12258,
                12303
            ],
            [
                12368,
                12395
            ],
            [
                12402,
                12407
            ],
            [
                12422,
                12469
            ],
            [
                12469,
                12509
            ],
            [
                12509,
                12675
            ],
            [
                12682,
                12746
            ],
            [
                12746,
                12747
            ],
            [
                12804,
                12805
            ],
            [
                12788,
                12804
            ],
            [
                12810,
                12885
            ],
            [
                12891,
                12893
            ],
            [
                12898,
                12933
            ],
            [
                12962,
                12965
            ],
            [
                12965,
                13032
            ],
            [
                13032,
                13049
            ],
            [
                13049,
                13063
            ],
            [
                13167,
                13169
            ],
            [
                13169,
                13231
            ],
            [
                13285,
                13367
            ],
            [
                13415,
                13417
            ],
            [
                13417,
                13448
            ],
            [
                13448,
                13491
            ],
            [
                13497,
                13499
            ],
            [
                13499,
                13596
            ],
            [
                13596,
                13634
            ],
            [
                13736,
                13737
            ],
            [
                13742,
                13796
            ],
            [
                13818,
                13820
            ],
            [
                13820,
                13853
            ],
            [
                13853,
                13949
            ],
            [
                13949,
                14003
            ],
            [
                14005,
                14029
            ],
            [
                14029,
                14050
            ],
            [
                14061,
                14130
            ],
            [
                14134,
                14154
            ],
            [
                14200,
                14202
            ],
            [
                14202,
                14252
            ],
            [
                14252,
                14262
            ],
            [
                14264,
                14268
            ],
            [
                14270,
                14325
            ],
            [
                14407,
                14426
            ],
            [
                14444,
                14452
            ],
            [
                14386,
                14387
            ],
            [
                14405,
                14406
            ],
            [
                14326,
                14371
            ],
            [
                14453,
                14533
            ],
            [
                14554,
                14556
            ],
            [
                14556,
                14608
            ],
            [
                14608,
                14634
            ],
            [
                14634,
                14653
            ],
            [
                14653,
                14741
            ],
            [
                14741,
                14862
            ],
            [
                14875,
                14877
            ],
            [
                14877,
                14931
            ],
            [
                14937,
                14965
            ],
            [
                14965,
                15044
            ],
            [
                15048,
                15055
            ],
            [
                15068,
                15070
            ],
            [
                15070,
                15074
            ],
            [
                15084,
                15100
            ],
            [
                15100,
                15144
            ],
            [
                15153,
                15157
            ],
            [
                15162,
                15189
            ],
            [
                15193,
                15198
            ],
            [
                15210,
                15226
            ],
            [
                15226,
                15287
            ],
            [
                15287,
                15324
            ],
            [
                15324,
                15362
            ],
            [
                15390,
                15467
            ],
            [
                15467,
                15482
            ],
            [
                15495,
                15533
            ],
            [
                15585,
                15587
            ],
            [
                15587,
                15650
            ],
            [
                15696,
                15716
            ],
            [
                15716,
                15760
            ],
            [
                15760,
                15800
            ],
            [
                15800,
                15846
            ],
            [
                15859,
                15866
            ],
            [
                15876,
                15882
            ],
            [
                15886,
                15894
            ],
            [
                15908,
                15965
            ],
            [
                15985,
                15988
            ],
            [
                15995,
                16044
            ],
            [
                16044,
                16045
            ],
            [
                16065,
                16160
            ],
            [
                16059,
                16060
            ],
            [
                16232,
                16256
            ],
            [
                16256,
                16287
            ],
            [
                16295,
                16357
            ],
            [
                16357,
                16372
            ],
            [
                16372,
                16423
            ],
            [
                16436,
                16443
            ],
            [
                16452,
                16469
            ],
            [
                16469,
                16511
            ],
            [
                16511,
                16571
            ],
            [
                16585,
                16588
            ],
            [
                16588,
                16668
            ],
            [
                16699,
                16701
            ],
            [
                16701,
                16774
            ],
            [
                16791,
                16840
            ],
            [
                16840,
                16855
            ],
            [
                16865,
                16904
            ],
            [
                16914,
                16965
            ],
            [
                16988,
                17123
            ],
            [
                17123,
                17182
            ],
            [
                17326,
                17376
            ],
            [
                17418,
                17459
            ],
            [
                17505,
                17506
            ],
            [
                17507,
                17547
            ],
            [
                17547,
                17561
            ],
            [
                17570,
                17576
            ],
            [
                17584,
                17683
            ],
            [
                17683,
                17743
            ],
            [
                17752,
                17768
            ],
            [
                17770,
                17830
            ],
            [
                17853,
                17978
            ],
            [
                17984,
                17987
            ],
            [
                18014,
                18028
            ],
            [
                17839,
                17841
            ],
            [
                18040,
                18069
            ],
            [
                18084,
                18092
            ],
            [
                18092,
                18133
            ],
            [
                18151,
                18155
            ],
            [
                18207,
                18249
            ],
            [
                18272,
                18343
            ],
            [
                18343,
                18409
            ],
            [
                18434,
                18525
            ],
            [
                18538,
                18547
            ],
            [
                18562,
                18567
            ],
            [
                18572,
                18577
            ],
            [
                18588,
                18607
            ],
            [
                18794,
                18809
            ],
            [
                18810,
                18826
            ],
            [
                18843,
                18858
            ],
            [
                18870,
                18988
            ],
            [
                19009,
                19010
            ],
            [
                19011,
                19024
            ],
            [
                19086,
                19092
            ],
            [
                19099,
                19100
            ],
            [
                19025,
                19034
            ],
            [
                19269,
                19294
            ],
            [
                19347,
                19349
            ],
            [
                19349,
                19351
            ],
            [
                19364,
                19401
            ],
            [
                19401,
                19406
            ],
            [
                19427,
                19446
            ],
            [
                19453,
                19504
            ],
            [
                19547,
                19559
            ],
            [
                19559,
                19602
            ],
            [
                19608,
                19650
            ],
            [
                19659,
                19706
            ],
            [
                19732,
                19734
            ],
            [
                19734,
                19754
            ],
            [
                19762,
                19971
            ],
            [
                19971,
                20069
            ],
            [
                20083,
                20171
            ],
            [
                20173,
                20179
            ],
            [
                20191,
                20193
            ],
            [
                20193,
                20291
            ]
        ],
        "row_chars": [
            [
                0,
                59
            ],
            [
                59,
                214
            ],
            [
                214,
                308
            ],
            [
                308,
                323
            ],
            [
                323,
                473
            ],
            [
                473,
                830
            ],
            [
                830,
                1420
            ],
            [
                1420,
                1476
            ],
            [
                1476,
                1610
            ],
            [
                1610,
                1907
            ],
            [
                1907,
                2337
            ],
            [
                2337,
                2420
            ],
            [
                2420,
                2739
            ],
            [
                2739,
                2871
            ],
            [
                2871,
                3283
            ],
            [
                3283,
                3565
            ],
            [
                3565,
                3663
            ],
            [
                3663,
                3734
            ],
            [
                3734,
                3776
            ],
            [
                3776,
                4134
            ],
            [
                4134,
                4438
            ],
            [
                4438,
                4641
            ],
            [
                4641,
                4667
            ],
            [
                4667,
                4746
            ],
            [
                4746,
                4796
            ],
            [
                4796,
                4911
            ],
            [
                4911,
                5165
            ],
            [
                5165,
                5414
            ],
            [
                5414,
                5459
            ],
            [
                5459,
                5494
            ],
            [
                5494,
                5715
            ],
            [
                5715,
                5962
            ],
            [
                5962,
                6208
            ],
            [
                6208,
                6358
            ],
            [
                6358,
                6738
            ],
            [
                6738,
                7153
            ],
            [
                7153,
                7218
            ],
            [
                7218,
                7515
            ],
            [
                7515,
                7609
            ],
            [
                7609,
                7654
            ],
            [
                7654,
                7737
            ],
            [
                7737,
                7825
            ],
            [
                7825,
                7881
            ],
            [
                7881,
                7905
            ],
            [
                7905,
                8028
            ],
            [
                8028,
                8056
            ],
            [
                8056,
                8084
            ],
            [
                8084,
                8091
            ],
            [
                8091,
                8117
            ],
            [
                8117,
                8137
            ],
            [
                8137,
                8259
            ],
            [
                8259,
                8356
            ],
            [
                8356,
                8488
            ],
            [
                8488,
                8505
            ],
            [
                8505,
                8534
            ],
            [
                8534,
                8698
            ],
            [
                8698,
                8778
            ],
            [
                8778,
                8830
            ],
            [
                8830,
                8998
            ],
            [
                8998,
                9061
            ],
            [
                9061,
                9236
            ],
            [
                9236,
                9349
            ],
            [
                9349,
                9405
            ],
            [
                9405,
                9462
            ],
            [
                9462,
                9558
            ],
            [
                9558,
                9603
            ],
            [
                9603,
                9642
            ],
            [
                9642,
                9784
            ],
            [
                9784,
                9847
            ],
            [
                9847,
                9999
            ],
            [
                9999,
                10031
            ],
            [
                10031,
                10110
            ],
            [
                10110,
                10232
            ],
            [
                10232,
                10319
            ],
            [
                10319,
                10350
            ],
            [
                10350,
                10478
            ],
            [
                10478,
                10522
            ],
            [
                10522,
                10582
            ],
            [
                10582,
                10643
            ],
            [
                10643,
                10787
            ],
            [
                10787,
                10823
            ],
            [
                10823,
                11199
            ],
            [
                11199,
                11529
            ],
            [
                11529,
                11678
            ],
            [
                11678,
                11826
            ],
            [
                11826,
                11954
            ],
            [
                11954,
                12113
            ],
            [
                12113,
                12226
            ],
            [
                12226,
                12469
            ],
            [
                12469,
                12509
            ],
            [
                12509,
                12746
            ],
            [
                12746,
                12965
            ],
            [
                12965,
                13032
            ],
            [
                13032,
                13049
            ],
            [
                13049,
                13169
            ],
            [
                13169,
                13417
            ],
            [
                13417,
                13448
            ],
            [
                13448,
                13499
            ],
            [
                13499,
                13596
            ],
            [
                13596,
                13636
            ],
            [
                13636,
                13736
            ],
            [
                13736,
                13820
            ],
            [
                13820,
                13853
            ],
            [
                13853,
                13949
            ],
            [
                13949,
                14029
            ],
            [
                14029,
                14202
            ],
            [
                14202,
                14252
            ],
            [
                14252,
                14326
            ],
            [
                14326,
                14556
            ],
            [
                14556,
                14608
            ],
            [
                14608,
                14634
            ],
            [
                14634,
                14653
            ],
            [
                14653,
                14741
            ],
            [
                14741,
                14877
            ],
            [
                14877,
                14965
            ],
            [
                14965,
                15070
            ],
            [
                15070,
                15100
            ],
            [
                15100,
                15226
            ],
            [
                15226,
                15287
            ],
            [
                15287,
                15324
            ],
            [
                15324,
                15364
            ],
            [
                15364,
                15390
            ],
            [
                15390,
                15467
            ],
            [
                15467,
                15587
            ],
            [
                15587,
                15651
            ],
            [
                15651,
                15696
            ],
            [
                15696,
                15716
            ],
            [
                15716,
                15760
            ],
            [
                15760,
                15800
            ],
            [
                15800,
                15965
            ],
            [
                15965,
                16044
            ],
            [
                16044,
                16256
            ],
            [
                16256,
                16357
            ],
            [
                16357,
                16372
            ],
            [
                16372,
                16469
            ],
            [
                16469,
                16511
            ],
            [
                16511,
                16588
            ],
            [
                16588,
                16701
            ],
            [
                16701,
                16840
            ],
            [
                16840,
                17123
            ],
            [
                17123,
                17507
            ],
            [
                17507,
                17547
            ],
            [
                17547,
                17683
            ],
            [
                17683,
                18092
            ],
            [
                18092,
                18343
            ],
            [
                18343,
                18525
            ],
            [
                18525,
                18607
            ],
            [
                18607,
                18773
            ],
            [
                18773,
                19011
            ],
            [
                19011,
                19349
            ],
            [
                19349,
                19559
            ],
            [
                19559,
                19734
            ],
            [
                19734,
                19971
            ],
            [
                19971,
                20193
            ],
            [
                20193,
                20291
            ]
        ]
    },
    "abridged": {
        "text": "And Gwendolen? She was thinking of Deronda much more than he was thinking of her - often wondering about his ideas, and how his life was occupied. But a lap-dog would be at a loss to understand the adventures of doghood at large; and Gwendolen had no conception that Deronda's life could be determined by the historical destiny of the Jews.\nShe imagined a larger place for herself in his thoughts than she actually held; but with her youth and solitude, she may be excused for dwelling on any signs of special interest in her shown by the one person who had impressed her into feeling submission.\nWhat would he tell her to do? \"He said, I must get more interest in others, and more knowledge - but how am I to begin?\" She wondered what books he would tell her to read, recalling the famous writers that she had either not looked into or had found the most unreadable; and carried a selection to her room - Descartes, Bacon, Locke. Knowing from her education that these authors were ornaments of mankind, she felt sure that Deronda had read them, and hoped that by dipping into them, with her rapid understanding she might get a point of view nearer to his level.\nBut it was astonishing how little time she found for these vast mental excursions. Constantly she had to be on the scene as Mrs. Grandcourt, and to feel herself watched in that part by the exacting eyes of a husband who chose to rule her the more completely the more he discerned any opposing will in her.\nAnd she herself, whatever rebellion might be going on within her, did not wish to fail in playing this part. She dreaded betraying her true feelings to the world: her determination to be silent in every other direction had thrown the more impetuosity into her confidences toward Deronda, to whom her thought continually turned as a help against herself. Her riding, her hunting, her visits, were all performed in a spirit of achievement which served instead of zest and young gladness, so that all around Diplow Mrs. Grandcourt was regarded as wearing her honours with triumph.\nTo her mother most of all Gwendolen was bent on acting complete satisfaction. Poor Mrs. Davilow was so well deceived that she took the unexpected distance at which she was kept as indifference in her daughter, now that marriage had created new interests. To be fetched to lunch and dinner along with the Gascoignes, to be driven back the next morning, and to have brief calls from Gwendolen while her husband waited for her outside, was all the intercourse allowed to her mother.\nThe truth was, that the second time Gwendolen proposed to invite her mother with Mr. and Mrs. Gascoigne, Grandcourt had drawled, \"We can't be having those people always. Gascoigne talks too much. Country clergy are always bores.\"\nThat speech was full of foreboding for Gwendolen. Still, she could not say to her mother, \"Mr. Grandcourt wants to recognize you as little as possible; and it is better you should not see much of my married life, in case you find out that I am miserable.\" So she waived as lightly as she could every allusion to the subject; and when Mrs. Davilow again hinted the possibility of moving closer to Ryelands, Gwendolen said,-\n\"It would not be so nice for you as being near the rectory here, mamma. We shall perhaps be very little at Ryelands. You would miss my aunt and uncle.\"\nMeanwhile this contemptuous veto of her husband's on any intimacy with her family was rousing her attachment to them. She had never felt so kindly toward her uncle, so much disposed to look on his cheerful, complacent activity as a greater comfort than the neutral loftiness which was every day chilling her. And here perhaps she was unconsciously finding some of that mental enlargement which it was hard to get from her occasional dashes into difficult authors.\nIt was a delightful surprise one day, when Mr. and Mrs. Gascoigne were at Offendene, for the family to see Gwendolen ride up without her husband. Even the elder ones were not without something of Isabel's sense that the beautiful sister on the splendid chestnut was a romantic heroine appearing out of her \"happiness ever after.\"\nGwendolen sprang from her horse with an alacrity which might well signify happiness; for she was particularly bent today on setting her mother's heart at rest, and her freedom in being able to make this visit alone enabled her to bear up under the pressure of painful facts. The seven family kisses were not so tiresome as they used to be.\n\"Mr. Grandcourt is gone out, so I decided to fill the time by coming to you, mamma,\" said Gwendolen. Sitting next to her mother, she said with a playfully admonitory air, \"That is a punishment to you for not wearing better lace. You didn't think I should detect you - you dreadfully careless-about-yourself mamma!\" She gave a caressing touch to the dear head.\n\"Scold me, dear,\" said Mrs. Davilow, her delicate worn face flushing with delight. \"But I wish you would eat after your ride. Let Jocosa make you a cup of chocolate. You used to like that.\"\nMiss Merry immediately rose and went out, though Gwendolen said, \"Oh, no, a piece of bread. I can't think about eating. I am come to say good-bye.\"\n\"What! going to Ryelands again?\" said Mr. Gascoigne.\n\"No, we are going to town,\" said Gwendolen, beginning to break up a piece of bread, but putting none into her mouth.\n\"It is rather early to go to town,\" said Mrs. Gascoigne.\n\"Oh, there is only one more day's hunting, and Henleigh has some business in town with lawyers, I think,\" said Gwendolen. \"I am very glad. I shall like to go to town.\"\n\"You will see your house in Grosvenor Square,\" said Mrs. Davilow, devouring Gwendolen's every movement with her eyes.\n\"Yes. And there is so much to be done in town.\"\n\"I wish, my dear Gwendolen,\" said Mr. Gascoigne cordially, \"that you would use your influence with Mr. Grandcourt to induce him to enter Parliament. A man of his position should make his weight felt in politics. And he has now come to that stage of life when a man like him should enter into public affairs. A wife has great influence with her husband. Use yours in that direction, my dear.\"\nTo Gwendolen this speech had the flavour of bitter comedy. The wife's great influence! She had once believed in her future influence as all-powerful in managing - she did not know exactly what. But her chief concern was to give an appropriate answer.\n\"I should be very glad, uncle. But I think Mr. Grandcourt would not like the trouble of an election - at least, unless it could be without his making speeches. I thought candidates always made speeches.\"\n\"Not necessarily,\" said Mr. Gascoigne. \"A man of position can get on without much of it. A county member need have very little trouble in that way, and is liked the better for not being a speechifier. Tell Mr. Grandcourt that I say so.\"\n\"Here comes Jocosa with my chocolate,\" said Gwendolen, escaping from a promise that would certainly have been received in a way inconceivable to the good rector. Mr. Gascoigne had concluded that Grandcourt was a proud man, but he was not so selfish as to resent his niece's husband for keeping him haughtily at a distance. A certain aloofness must be allowed to the representative of an old family. But Mrs. Gascoigne felt Grandcourt's haughtiness as something a little blameable in Gwendolen.\n\"Your uncle and Anna will very likely be in town about Easter,\" she said. \"Dear Rex hopes to come out with honours and a fellowship, and wants his father and Anna to meet him in London, that they may be jolly together, as he says. I shouldn't wonder if Lord Brackenshaw invited them; he is so very kind.\"\n\"I hope my uncle will bring Anna to stay in Grosvenor Square,\" said Gwendolen, in reality wishing that she need never bring any of her family near Grandcourt again. \"I am very glad of Rex's good fortune.\"\n\"We must not be premature, and rejoice too much beforehand,\" said the rector, to whom this topic was the happiest in the world, and altogether allowable, now that the result of that little affair about Gwendolen had been so satisfactory. \"However, impartial judges have the highest hopes about my son, as a singularly clear-headed young man of excellent disposition and principle.\"\n\"We shall have him a great lawyer some time,\" said Mrs. Gascoigne.\n\"How very nice!\" said Gwendolen.\n\"Talking of Lord Brackenshaw's kindness,\" said Mrs. Davilow, \"he has begged me to consider myself his guest in this house till I can get another. But now a house has turned up. Old Mr. Jodson is dead, and we can have his. It is just what I want; small, but with nothing hideous to make you miserable thinking about it. And it is only a mile from the Rectory.\"\n\"But you have no furniture, poor mamma,\" said Gwendolen.\n\"Oh, I am saving money for that. You know who has made me rather rich, dear,\" said Mrs. Davilow, laying her hand on Gwendolen's. \"And Jocosa really makes so little do for housekeeping - it is quite wonderful.\"\n\"Oh, please let me go upstairs with you and arrange my hat, mamma,\" said Gwendolen, suddenly putting her hand to her hair. Her heart was swelling, and she was ready to cry. Her mother must have been worse off, if it had not been for Grandcourt.\nAs they entered the bedroom, she looked around, saying, \"I suppose I shall never see all this again,\" and then throwing herself into a chair in front of the glass with a little groan. In the resolve not to cry she had become very pale.\n\"You are not well, dear?\" said Mrs. Davilow.\n\"No; that chocolate has made me sick,\" said Gwendolen, putting up her hand to be taken.\n\"I should be allowed to come to you if you were ill, darling,\" said Mrs. Davilow, rather timidly, as she pressed the hand. Something had made her sure today that her child loved and needed her as much as ever.\n\"Oh, yes,\" said Gwendolen, leaning her head against her mother, though speaking lightly. \"But I never am ill. I am as strong as possible; and you must not fret about me, but make yourself happy with the girls. They are better children to you than I have been, you know.\" She turned up her face with a smile.\n\"You have always been good, my darling.\"\n\"Why, what did I ever do that was good to you, except marry Mr. Grandcourt?\" said Gwendolen, with a desperate resolve to be playful. \"And I should not have done that unless it had pleased myself.\"\n\"God forbid, child! I would not have had you marry for my sake. Your happiness by itself is half mine.\"\n\"Very well,\" said Gwendolen, arranging her hat, \"then please consider yourself half happy, which is more than I am used to seeing you.\" She turned with her old playful smile to her mother. \"Oh, mamma, Mr. Grandcourt gives me a quantity of money, and expects me to spend it, and I can't; so here are thirty pounds. I wish the girls would spend it on little things for themselves when you go to the new house. Tell them so.\" Gwendolen put the notes into her mother's hands and moved hastily toward the door.\n\"God bless you, dear,\" said Mrs. Davilow. \"It will please them so that you should have thought of them.\"\n\"Oh, they are troublesome things; but they don't trouble me now,\" said Gwendolen. She hardly understood her own feeling in this act toward her sisters, but did not wish it to be taken as anything serious. She was glad to get out of the bedroom without showing more emotion, and she went through the rest of her visit with a quiet propriety that made her say to herself sarcastically as she rode away, \"I think I am making a very good Mrs. Grandcourt.\"\nShe believed that her husband had gone to Gadsmere that day; and the strange conflict of feeling within her had sent her to Offendene with a tightened resolve. She wondered at her own contradictions. Why should she be bitter that Grandcourt showed concern for the beings on whose account she herself was undergoing remorse? Had she not before her marriage inwardly determined to speak on their behalf? - and since he had lately implied that he wanted to be in town to make arrangements about his will, she ought to have been glad of any sign that he kept a conscience awake toward those at Gadsmere.\nYet the sense that he was gone to Gadsmere was like a burn. She had brought on herself this indignity - this humiliating terror lest her husband should discover with what knowledge she had married him; and as she had said to Deronda, she \"must go on.\" After the intense moments of secret hatred toward this husband who cowed her, there always came back the spiritual pressure which made submission inevitable. Any effort at freedom would bring worse humiliation. It still seemed that the worst result would be that she should make a spectacle of herself; and her humiliation was lightened by her thinking that only Mrs. Glasher was aware of the cause.\nFor Gwendolen did not know about Lush's involvement; she had never considered how news had been conveyed to Mrs. Glasher. To her mind the secret lay with Mrs. Glasher only, and she thought the horrible letter implied that Mrs. Glasher would dread disclosure to Grandcourt.\nSomething else, too, she thought of as more secret from her husband than it really was - namely, that suppressed struggle of desperate rebellion within her. Grandcourt could not fully imagine how things affected Gwendolen: he had no imagination of anything in her but what affected the gratification of his own will; but on this point he had the sensibility which seems like divination. What we see exclusively we are apt to see with some mistake of proportions; and Grandcourt was not infallible in his judgments concerning this wife who was governed by many shadowy powers unknown to him. He magnified her inward resistance, but that did not lessen his satisfaction in the mastery of it.",
        "paragraph_chars": [
            [
                0,
                341
            ],
            [
                341,
                597
            ],
            [
                597,
                1163
            ],
            [
                1163,
                1469
            ],
            [
                1469,
                2047
            ],
            [
                2047,
                2527
            ],
            [
                2527,
                2757
            ],
            [
                2757,
                3180
            ],
            [
                3180,
                3332
            ],
            [
                3332,
                3796
            ],
            [
                3796,
                4126
            ],
            [
                4126,
                4466
            ],
            [
                4466,
                4826
            ],
            [
                4826,
                5016
            ],
            [
                5016,
                5164
            ],
            [
                5164,
                5217
            ],
            [
                5217,
                5334
            ],
            [
                5334,
                5391
            ],
            [
                5391,
                5559
            ],
            [
                5559,
                5677
            ],
            [
                5677,
                5725
            ],
            [
                5725,
                6117
            ],
            [
                6117,
                6368
            ],
            [
                6368,
                6572
            ],
            [
                6572,
                6809
            ],
            [
                6809,
                7303
            ],
            [
                7303,
                7608
            ],
            [
                7608,
                7813
            ],
            [
                7813,
                8195
            ],
            [
                8195,
                8262
            ],
            [
                8262,
                8295
            ],
            [
                8295,
                8655
            ],
            [
                8655,
                8712
            ],
            [
                8712,
                8922
            ],
            [
                8922,
                9167
            ],
            [
                9167,
                9403
            ],
            [
                9403,
                9448
            ],
            [
                9448,
                9536
            ],
            [
                9536,
                9746
            ],
            [
                9746,
                10054
            ],
            [
                10054,
                10095
            ],
            [
                10095,
                10292
            ],
            [
                10292,
                10396
            ],
            [
                10396,
                10902
            ],
            [
                10902,
                11007
            ],
            [
                11007,
                11459
            ],
            [
                11459,
                12059
            ],
            [
                12059,
                12711
            ],
            [
                12711,
                12984
            ],
            [
                12984,
                13673
            ]
        ],
        "segment_chars": [
            [
                0,
                15
            ],
            [
                15,
                147
            ],
            [
                147,
                341
            ],
            [
                341,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                718
            ],
            [
                718,
                931
            ],
            [
                931,
                1163
            ],
            [
                1163,
                1246
            ],
            [
                1246,
                1469
            ],
            [
                1469,
                1578
            ],
            [
                1578,
                1823
            ],
            [
                1823,
                2047
            ],
            [
                2047,
                2125
            ],
            [
                2125,
                2302
            ],
            [
                2302,
                2527
            ],
            [
                2527,
                2697
            ],
            [
                2697,
                2723
            ],
            [
                2723,
                2757
            ],
            [
                2757,
                2807
            ],
            [
                2807,
                3013
            ],
            [
                3013,
                3180
            ],
            [
                3180,
                3252
            ],
            [
                3252,
                3297
            ],
            [
                3297,
                3332
            ],
            [
                3332,
                3450
            ],
            [
                3450,
                3641
            ],
            [
                3641,
                3796
            ],
            [
                3796,
                3942
            ],
            [
                3942,
                4126
            ],
            [
                4126,
                4401
            ],
            [
                4401,
                4466
            ],
            [
                4466,
                4567
            ],
            [
                4567,
                4695
            ],
            [
                4695,
                4781
            ],
            [
                4781,
                4826
            ],
            [
                4826,
                4909
            ],
            [
                4909,
                4952
            ],
            [
                4952,
                4992
            ],
            [
                4992,
                5016
            ],
            [
                5016,
                5108
            ],
            [
                5108,
                5136
            ],
            [
                5136,
                5164
            ],
            [
                5164,
                5171
            ],
            [
                5171,
                5197
            ],
            [
                5197,
                5217
            ],
            [
                5217,
                5334
            ],
            [
                5334,
                5391
            ],
            [
                5391,
                5513
            ],
            [
                5513,
                5530
            ],
            [
                5530,
                5559
            ],
            [
                5559,
                5677
            ],
            [
                5677,
                5683
            ],
            [
                5683,
                5725
            ],
            [
                5725,
                5874
            ],
            [
                5874,
                5937
            ],
            [
                5937,
                6033
            ],
            [
                6033,
                6078
            ],
            [
                6078,
                6117
            ],
            [
                6117,
                6176
            ],
            [
                6176,
                6204
            ],
            [
                6204,
                6311
            ],
            [
                6311,
                6368
            ],
            [
                6368,
                6399
            ],
            [
                6399,
                6528
            ],
            [
                6528,
                6572
            ],
            [
                6572,
                6611
            ],
            [
                6611,
                6661
            ],
            [
                6661,
                6773
            ],
            [
                6773,
                6809
            ],
            [
                6809,
                6971
            ],
            [
                6971,
                7132
            ],
            [
                7132,
                7208
            ],
            [
                7208,
                7303
            ],
            [
                7303,
                7377
            ],
            [
                7377,
                7534
            ],
            [
                7534,
                7608
            ],
            [
                7608,
                7773
            ],
            [
                7773,
                7813
            ],
            [
                7813,
                8051
            ],
            [
                8051,
                8195
            ],
            [
                8195,
                8262
            ],
            [
                8262,
                8279
            ],
            [
                8279,
                8295
            ],
            [
                8295,
                8441
            ],
            [
                8441,
                8472
            ],
            [
                8472,
                8517
            ],
            [
                8517,
                8614
            ],
            [
                8614,
                8655
            ],
            [
                8655,
                8712
            ],
            [
                8712,
                8745
            ],
            [
                8745,
                8841
            ],
            [
                8841,
                8922
            ],
            [
                8922,
                9045
            ],
            [
                9045,
                9095
            ],
            [
                9095,
                9167
            ],
            [
                9167,
                9351
            ],
            [
                9351,
                9403
            ],
            [
                9403,
                9429
            ],
            [
                9429,
                9448
            ],
            [
                9448,
                9536
            ],
            [
                9536,
                9659
            ],
            [
                9659,
                9746
            ],
            [
                9746,
                9835
            ],
            [
                9835,
                9856
            ],
            [
                9856,
                9956
            ],
            [
                9956,
                10017
            ],
            [
                10017,
                10054
            ],
            [
                10054,
                10095
            ],
            [
                10095,
                10172
            ],
            [
                10172,
                10228
            ],
            [
                10228,
                10292
            ],
            [
                10292,
                10312
            ],
            [
                10312,
                10356
            ],
            [
                10356,
                10396
            ],
            [
                10396,
                10532
            ],
            [
                10532,
                10585
            ],
            [
                10585,
                10710
            ],
            [
                10710,
                10804
            ],
            [
                10804,
                10819
            ],
            [
                10819,
                10902
            ],
            [
                10902,
                10944
            ],
            [
                10944,
                11007
            ],
            [
                11007,
                11089
            ],
            [
                11089,
                11212
            ],
            [
                11212,
                11459
            ],
            [
                11459,
                11619
            ],
            [
                11619,
                11659
            ],
            [
                11659,
                11783
            ],
            [
                11783,
                11861
            ],
            [
                11861,
                12059
            ],
            [
                12059,
                12119
            ],
            [
                12119,
                12311
            ],
            [
                12311,
                12469
            ],
            [
                12469,
                12522
            ],
            [
                12522,
                12711
            ],
            [
                12711,
                12833
            ],
            [
                12833,
                12984
            ],
            [
                12984,
                13141
            ],
            [
                13141,
                13371
            ],
            [
                13371,
                13575
            ],
            [
                13575,
                13673
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                15,
                80
            ],
            [
                83,
                98
            ],
            [
                99,
                104
            ],
            [
                105,
                114
            ],
            [
                116,
                147
            ],
            [
                147,
                169
            ],
            [
                170,
                179
            ],
            [
                180,
                182
            ],
            [
                194,
                197
            ],
            [
                198,
                233
            ],
            [
                234,
                243
            ],
            [
                251,
                339
            ],
            [
                339,
                341
            ],
            [
                341,
                344
            ],
            [
                354,
                414
            ],
            [
                419,
                420
            ],
            [
                425,
                443
            ],
            [
                444,
                453
            ],
            [
                458,
                488
            ],
            [
                493,
                571
            ],
            [
                577,
                584
            ],
            [
                585,
                595
            ],
            [
                595,
                597
            ],
            [
                597,
                619
            ],
            [
                620,
                627
            ],
            [
                627,
                691
            ],
            [
                694,
                718
            ],
            [
                718,
                762
            ],
            [
                767,
                768
            ],
            [
                779,
                866
            ],
            [
                868,
                871
            ],
            [
                880,
                881
            ],
            [
                892,
                898
            ],
            [
                899,
                903
            ],
            [
                904,
                905
            ],
            [
                915,
                916
            ],
            [
                931,
                938
            ],
            [
                939,
                943
            ],
            [
                944,
                947
            ],
            [
                948,
                957
            ],
            [
                958,
                1003
            ],
            [
                1004,
                1007
            ],
            [
                1013,
                1049
            ],
            [
                1056,
                1081
            ],
            [
                1081,
                1163
            ],
            [
                1163,
                1246
            ],
            [
                1246,
                1382
            ],
            [
                1383,
                1388
            ],
            [
                1389,
                1391
            ],
            [
                1401,
                1409
            ],
            [
                1421,
                1468
            ],
            [
                1469,
                1534
            ],
            [
                1539,
                1542
            ],
            [
                1548,
                1550
            ],
            [
                1556,
                1558
            ],
            [
                1576,
                1578
            ],
            [
                1578,
                1581
            ],
            [
                1582,
                1589
            ],
            [
                1600,
                1603
            ],
            [
                1618,
                1631
            ],
            [
                1650,
                1687
            ],
            [
                1688,
                1823
            ],
            [
                1823,
                1851
            ],
            [
                1852,
                1980
            ],
            [
                1981,
                2024
            ],
            [
                2033,
                2047
            ],
            [
                2047,
                2123
            ],
            [
                2125,
                2149
            ],
            [
                2155,
                2223
            ],
            [
                2224,
                2226
            ],
            [
                2227,
                2302
            ],
            [
                2302,
                2328
            ],
            [
                2329,
                2380
            ],
            [
                2381,
                2437
            ],
            [
                2444,
                2478
            ],
            [
                2478,
                2527
            ],
            [
                2527,
                2646
            ],
            [
                2647,
                2675
            ],
            [
                2676,
                2688
            ],
            [
                2689,
                2697
            ],
            [
                2697,
                2723
            ],
            [
                2723,
                2754
            ],
            [
                2754,
                2757
            ],
            [
                2757,
                2807
            ],
            [
                2807,
                2813
            ],
            [
                2814,
                2912
            ],
            [
                2913,
                2969
            ],
            [
                2978,
                2981
            ],
            [
                2982,
                3013
            ],
            [
                3013,
                3135
            ],
            [
                3150,
                3177
            ],
            [
                3180,
                3252
            ],
            [
                3252,
                3297
            ],
            [
                3297,
                3332
            ],
            [
                3342,
                3413
            ],
            [
                3414,
                3425
            ],
            [
                3426,
                3429
            ],
            [
                3444,
                3450
            ],
            [
                3450,
                3521
            ],
            [
                3522,
                3558
            ],
            [
                3559,
                3561
            ],
            [
                3562,
                3563
            ],
            [
                3572,
                3641
            ],
            [
                3641,
                3794
            ],
            [
                3794,
                3796
            ],
            [
                3796,
                3832
            ],
            [
                3834,
                3879
            ],
            [
                3885,
                3888
            ],
            [
                3896,
                3940
            ],
            [
                3940,
                3942
            ],
            [
                3942,
                4000
            ],
            [
                4001,
                4057
            ],
            [
                4058,
                4063
            ],
            [
                4064,
                4072
            ],
            [
                4091,
                4126
            ],
            [
                4126,
                4135
            ],
            [
                4136,
                4165
            ],
            [
                4166,
                4191
            ],
            [
                4200,
                4214
            ],
            [
                4215,
                4218
            ],
            [
                4219,
                4240
            ],
            [
                4247,
                4293
            ],
            [
                4294,
                4399
            ],
            [
                4399,
                4401
            ],
            [
                4401,
                4466
            ],
            [
                4466,
                4499
            ],
            [
                4508,
                4515
            ],
            [
                4516,
                4565
            ],
            [
                4575,
                4593
            ],
            [
                4593,
                4594
            ],
            [
                4595,
                4598
            ],
            [
                4604,
                4620
            ],
            [
                4626,
                4693
            ],
            [
                4693,
                4695
            ],
            [
                4695,
                4720
            ],
            [
                4721,
                4731
            ],
            [
                4734,
                4781
            ],
            [
                4781,
                4826
            ],
            [
                4826,
                4909
            ],
            [
                4909,
                4920
            ],
            [
                4921,
                4924
            ],
            [
                4931,
                4950
            ],
            [
                4950,
                4952
            ],
            [
                4952,
                4990
            ],
            [
                4990,
                4992
            ],
            [
                4992,
                5016
            ],
            [
                5016,
                5106
            ],
            [
                5106,
                5108
            ],
            [
                5108,
                5136
            ],
            [
                5136,
                5164
            ],
            [
                5164,
                5171
            ],
            [
                5171,
                5197
            ],
            [
                5197,
                5217
            ],
            [
                5217,
                5312
            ],
            [
                5318,
                5334
            ],
            [
                5334,
                5389
            ],
            [
                5389,
                5390
            ],
            [
                5391,
                5432
            ],
            [
                5432,
                5513
            ],
            [
                5513,
                5530
            ],
            [
                5530,
                5559
            ],
            [
                5559,
                5623
            ],
            [
                5623,
                5624
            ],
            [
                5625,
                5634
            ],
            [
                5647,
                5661
            ],
            [
                5662,
                5666
            ],
            [
                5671,
                5675
            ],
            [
                5675,
                5677
            ],
            [
                5677,
                5681
            ],
            [
                5681,
                5683
            ],
            [
                5683,
                5709
            ],
            [
                5710,
                5725
            ],
            [
                5725,
                5772
            ],
            [
                5773,
                5777
            ],
            [
                5782,
                5874
            ],
            [
                5874,
                5937
            ],
            [
                5937,
                6033
            ],
            [
                6033,
                6078
            ],
            [
                6078,
                6117
            ],
            [
                6117,
                6129
            ],
            [
                6135,
                6149
            ],
            [
                6158,
                6176
            ],
            [
                6176,
                6204
            ],
            [
                6208,
                6252
            ],
            [
                6266,
                6277
            ],
            [
                6280,
                6311
            ],
            [
                6311,
                6332
            ],
            [
                6333,
                6347
            ],
            [
                6348,
                6359
            ],
            [
                6360,
                6366
            ],
            [
                6366,
                6368
            ],
            [
                6368,
                6399
            ],
            [
                6399,
                6467
            ],
            [
                6470,
                6528
            ],
            [
                6528,
                6572
            ],
            [
                6572,
                6588
            ],
            [
                6588,
                6611
            ],
            [
                6611,
                6629
            ],
            [
                6630,
                6661
            ],
            [
                6661,
                6723
            ],
            [
                6724,
                6773
            ],
            [
                6773,
                6809
            ],
            [
                6809,
                6845
            ],
            [
                6845,
                6887
            ],
            [
                6888,
                6969
            ],
            [
                6969,
                6971
            ],
            [
                6971,
                6988
            ],
            [
                6999,
                7035
            ],
            [
                7039,
                7046
            ],
            [
                7061,
                7063
            ],
            [
                7071,
                7090
            ],
            [
                7103,
                7106
            ],
            [
                7107,
                7132
            ],
            [
                7132,
                7206
            ],
            [
                7206,
                7208
            ],
            [
                7208,
                7226
            ],
            [
                7227,
                7303
            ],
            [
                7303,
                7375
            ],
            [
                7375,
                7377
            ],
            [
                7377,
                7409
            ],
            [
                7418,
                7439
            ],
            [
                7440,
                7534
            ],
            [
                7534,
                7585
            ],
            [
                7587,
                7589
            ],
            [
                7593,
                7605
            ],
            [
                7605,
                7608
            ],
            [
                7608,
                7639
            ],
            [
                7641,
                7686
            ],
            [
                7687,
                7714
            ],
            [
                7720,
                7725
            ],
            [
                7726,
                7773
            ],
            [
                7773,
                7813
            ],
            [
                7813,
                7979
            ],
            [
                7987,
                8051
            ],
            [
                8051,
                8052
            ],
            [
                8059,
                8060
            ],
            [
                8061,
                8077
            ],
            [
                8078,
                8153
            ],
            [
                8154,
                8156
            ],
            [
                8157,
                8192
            ],
            [
                8192,
                8195
            ],
            [
                8195,
                8262
            ],
            [
                8262,
                8279
            ],
            [
                8279,
                8293
            ],
            [
                8293,
                8295
            ],
            [
                8295,
                8357
            ],
            [
                8357,
                8439
            ],
            [
                8439,
                8441
            ],
            [
                8441,
                8472
            ],
            [
                8472,
                8515
            ],
            [
                8515,
                8517
            ],
            [
                8517,
                8614
            ],
            [
                8614,
                8652
            ],
            [
                8655,
                8656
            ],
            [
                8656,
                8710
            ],
            [
                8710,
                8712
            ],
            [
                8712,
                8745
            ],
            [
                8745,
                8841
            ],
            [
                8841,
                8895
            ],
            [
                8898,
                8922
            ],
            [
                8922,
                8943
            ],
            [
                8953,
                9022
            ],
            [
                9023,
                9043
            ],
            [
                9043,
                9045
            ],
            [
                9045,
                9095
            ],
            [
                9095,
                9105
            ],
            [
                9106,
                9110
            ],
            [
                9111,
                9166
            ],
            [
                9167,
                9186
            ],
            [
                9187,
                9195
            ],
            [
                9213,
                9214
            ],
            [
                9221,
                9222
            ],
            [
                9223,
                9268
            ],
            [
                9269,
                9349
            ],
            [
                9349,
                9351
            ],
            [
                9351,
                9403
            ],
            [
                9403,
                9429
            ],
            [
                9429,
                9448
            ],
            [
                9448,
                9536
            ],
            [
                9536,
                9657
            ],
            [
                9657,
                9659
            ],
            [
                9659,
                9713
            ],
            [
                9718,
                9746
            ],
            [
                9746,
                9825
            ],
            [
                9826,
                9833
            ],
            [
                9833,
                9835
            ],
            [
                9835,
                9839
            ],
            [
                9840,
                9856
            ],
            [
                9856,
                9900
            ],
            [
                9901,
                9905
            ],
            [
                9906,
                9933
            ],
            [
                9934,
                9939
            ],
            [
                9940,
                9956
            ],
            [
                9956,
                10017
            ],
            [
                10017,
                10054
            ],
            [
                10054,
                10092
            ],
            [
                10095,
                10172
            ],
            [
                10172,
                10187
            ],
            [
                10188,
                10226
            ],
            [
                10226,
                10228
            ],
            [
                10228,
                10291
            ],
            [
                10292,
                10312
            ],
            [
                10312,
                10356
            ],
            [
                10356,
                10396
            ],
            [
                10396,
                10442
            ],
            [
                10442,
                10449
            ],
            [
                10450,
                10456
            ],
            [
                10457,
                10465
            ],
            [
                10475,
                10532
            ],
            [
                10532,
                10535
            ],
            [
                10536,
                10585
            ],
            [
                10585,
                10586
            ],
            [
                10586,
                10681
            ],
            [
                10681,
                10682
            ],
            [
                10686,
                10710
            ],
            [
                10710,
                10741
            ],
            [
                10742,
                10804
            ],
            [
                10804,
                10819
            ],
            [
                10819,
                10870
            ],
            [
                10877,
                10884
            ],
            [
                10885,
                10902
            ],
            [
                10902,
                10944
            ],
            [
                10944,
                11004
            ],
            [
                11004,
                11007
            ],
            [
                11007,
                11087
            ],
            [
                11087,
                11089
            ],
            [
                11089,
                11162
            ],
            [
                11163,
                11212
            ],
            [
                11212,
                11227
            ],
            [
                11232,
                11271
            ],
            [
                11272,
                11323
            ],
            [
                11324,
                11459
            ],
            [
                11459,
                11518
            ],
            [
                11520,
                11570
            ],
            [
                11576,
                11617
            ],
            [
                11617,
                11618
            ],
            [
                11619,
                11659
            ],
            [
                11659,
                11673
            ],
            [
                11677,
                11683
            ],
            [
                11684,
                11783
            ],
            [
                11783,
                11843
            ],
            [
                11844,
                11860
            ],
            [
                11863,
                11923
            ],
            [
                11932,
                12057
            ],
            [
                12059,
                12062
            ],
            [
                12063,
                12077
            ],
            [
                12078,
                12080
            ],
            [
                12081,
                12110
            ],
            [
                12111,
                12119
            ],
            [
                12119,
                12160
            ],
            [
                12163,
                12167
            ],
            [
                12187,
                12229
            ],
            [
                12240,
                12311
            ],
            [
                12311,
                12377
            ],
            [
                12378,
                12469
            ],
            [
                12473,
                12482
            ],
            [
                12491,
                12496
            ],
            [
                12497,
                12502
            ],
            [
                12503,
                12522
            ],
            [
                12522,
                12537
            ],
            [
                12543,
                12559
            ],
            [
                12569,
                12584
            ],
            [
                12585,
                12703
            ],
            [
                12709,
                12710
            ],
            [
                12711,
                12724
            ],
            [
                12744,
                12750
            ],
            [
                12762,
                12763
            ],
            [
                12768,
                12777
            ],
            [
                12793,
                12818
            ],
            [
                12831,
                12833
            ],
            [
                12833,
                12835
            ],
            [
                12840,
                12877
            ],
            [
                12882,
                12887
            ],
            [
                12900,
                12919
            ],
            [
                12920,
                12971
            ],
            [
                12972,
                12984
            ],
            [
                12984,
                13027
            ],
            [
                13028,
                13070
            ],
            [
                13081,
                13128
            ],
            [
                13139,
                13141
            ],
            [
                13141,
                13161
            ],
            [
                13162,
                13371
            ],
            [
                13371,
                13469
            ],
            [
                13470,
                13558
            ],
            [
                13567,
                13573
            ],
            [
                13573,
                13575
            ],
            [
                13575,
                13673
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                15
            ],
            [
                15,
                147
            ],
            [
                147,
                341
            ],
            [
                341,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                718
            ],
            [
                718,
                931
            ],
            [
                931,
                1163
            ],
            [
                1163,
                1246
            ],
            [
                1246,
                1469
            ],
            [
                1469,
                1578
            ],
            [
                1578,
                1823
            ],
            [
                1823,
                2047
            ],
            [
                2047,
                2047
            ],
            [
                2047,
                2047
            ],
            [
                2047,
                2047
            ],
            [
                2047,
                2302
            ],
            [
                2302,
                2527
            ],
            [
                2527,
                2697
            ],
            [
                2697,
                2723
            ],
            [
                2723,
                2757
            ],
            [
                2757,
                2807
            ],
            [
                2807,
                2807
            ],
            [
                2807,
                3013
            ],
            [
                3013,
                3252
            ],
            [
                3252,
                3297
            ],
            [
                3297,
                3332
            ],
            [
                3332,
                3450
            ],
            [
                3450,
                3641
            ],
            [
                3641,
                3796
            ],
            [
                3796,
                3942
            ],
            [
                3942,
                4126
            ],
            [
                4126,
                4401
            ],
            [
                4401,
                4466
            ],
            [
                4466,
                4695
            ],
            [
                4695,
                4781
            ],
            [
                4781,
                4826
            ],
            [
                4826,
                4909
            ],
            [
                4909,
                4952
            ],
            [
                4952,
                4992
            ],
            [
                4992,
                5016
            ],
            [
                5016,
                5108
            ],
            [
                5108,
                5136
            ],
            [
                5136,
                5164
            ],
            [
                5164,
                5171
            ],
            [
                5171,
                5197
            ],
            [
                5197,
                5217
            ],
            [
                5217,
                5334
            ],
            [
                5334,
                5391
            ],
            [
                5391,
                5513
            ],
            [
                5513,
                5530
            ],
            [
                5530,
                5559
            ],
            [
                5559,
                5677
            ],
            [
                5677,
                5683
            ],
            [
                5683,
                5725
            ],
            [
                5725,
                5874
            ],
            [
                5874,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                5937
            ],
            [
                5937,
                6033
            ],
            [
                6033,
                6078
            ],
            [
                6078,
                6117
            ],
            [
                6117,
                6117
            ],
            [
                6117,
                6176
            ],
            [
                6176,
                6176
            ],
            [
                6176,
                6204
            ],
            [
                6204,
                6204
            ],
            [
                6204,
                6311
            ],
            [
                6311,
                6368
            ],
            [
                6368,
                6399
            ],
            [
                6399,
                6528
            ],
            [
                6528,
                6572
            ],
            [
                6572,
                6611
            ],
            [
                6611,
                6661
            ],
            [
                6661,
                6773
            ],
            [
                6773,
                6809
            ],
            [
                6809,
                6971
            ],
            [
                6971,
                7132
            ],
            [
                7132,
                7208
            ],
            [
                7208,
                7303
            ],
            [
                7303,
                7377
            ],
            [
                7377,
                7534
            ],
            [
                7534,
                7608
            ],
            [
                7608,
                7773
            ],
            [
                7773,
                7813
            ],
            [
                7813,
                8051
            ],
            [
                8051,
                8195
            ],
            [
                8195,
                8262
            ],
            [
                8262,
                8279
            ],
            [
                8279,
                8295
            ],
            [
                8295,
                8441
            ],
            [
                8441,
                8472
            ],
            [
                8472,
                8517
            ],
            [
                8517,
                8614
            ],
            [
                8614,
                8655
            ],
            [
                8655,
                8655
            ],
            [
                8655,
                8712
            ],
            [
                8712,
                8745
            ],
            [
                8745,
                8841
            ],
            [
                8841,
                8922
            ],
            [
                8922,
                9045
            ],
            [
                9045,
                9095
            ],
            [
                9095,
                9167
            ],
            [
                9167,
                9351
            ],
            [
                9351,
                9403
            ],
            [
                9403,
                9429
            ],
            [
                9429,
                9448
            ],
            [
                9448,
                9536
            ],
            [
                9536,
                9659
            ],
            [
                9659,
                9746
            ],
            [
                9746,
                9835
            ],
            [
                9835,
                9856
            ],
            [
                9856,
                9956
            ],
            [
                9956,
                10017
            ],
            [
                10017,
                10054
            ],
            [
                10054,
                10095
            ],
            [
                10095,
                10095
            ],
            [
                10095,
                10172
            ],
            [
                10172,
                10228
            ],
            [
                10228,
                10292
            ],
            [
                10292,
                10292
            ],
            [
                10292,
                10312
            ],
            [
                10312,
                10356
            ],
            [
                10356,
                10396
            ],
            [
                10396,
                10532
            ],
            [
                10532,
                10585
            ],
            [
                10585,
                10710
            ],
            [
                10710,
                10804
            ],
            [
                10804,
                10819
            ],
            [
                10819,
                10902
            ],
            [
                10902,
                10944
            ],
            [
                10944,
                11007
            ],
            [
                11007,
                11089
            ],
            [
                11089,
                11212
            ],
            [
                11212,
                11459
            ],
            [
                11459,
                11619
            ],
            [
                11619,
                11659
            ],
            [
                11659,
                11783
            ],
            [
                11783,
                12119
            ],
            [
                12119,
                12311
            ],
            [
                12311,
                12469
            ],
            [
                12469,
                12522
            ],
            [
                12522,
                12522
            ],
            [
                12522,
                12711
            ],
            [
                12711,
                12833
            ],
            [
                12833,
                12984
            ],
            [
                12984,
                13141
            ],
            [
                13141,
                13371
            ],
            [
                13371,
                13575
            ],
            [
                13575,
                13673
            ]
        ]
    }
}