{
    "original": {
        "text": "\"And you must love him ere to you He will seem worthy of your love.\" --WORDSWORTH.\nOne might be tempted to envy Deronda providing new clothes for Mordecai, and pleasing himself as if he were sketching a picture in imagining the effect of the fine gray flannel shirts and a dressing-gown very much like a Franciscan's brown frock, with Mordecai's head and neck above them. Half his pleasure was the sense of seeing Mirah's brother through her eyes, and securing her fervid joy from any perturbing impression. And yet, after he had made all things ready, he was visited with doubt whether he were not mistaking her, and putting the lower effect for the higher: was she not just as capable as he himself had been of feeling the impressive distinction in her brother all the more for that aspect of poverty which was among the memorials of his past? But there were the Meyricks to be propitiated toward this too Judaic brother; and Deronda detected himself piqued into getting out of sight everything that might feed the ready repugnance in minds unblessed with that precious \"seeing,\" that bathing of all objects in a solemnity as of sun-set glow, which is begotten of a loving reverential emotion.\nAnd his inclination would have been the more confirmed if he had heard the dialogue round Mrs. Meyrick's fire late in the evening, after Mirah had gone to her room. Hans, settled now in his Chelsea rooms, had stayed late, and Mrs. Meyrick, poking the fire into a blaze, said,\n\"Now, Kate, put out your candle, and all come round the fire cosily. Hans, dear, do leave off laughing at those poems for the ninety-ninth time, and come too. I have something wonderful to tell.\"\n\"As if I didn't know that, ma. I have seen it in the corner of your eye ever so long, and in your pretense of errands,\" said Kate, while the girls came up to put their feet on the fender, and Hans, pushing his chair near them, sat astride it, resting his fists and chin on the back.\n\"Well, then, if you are so wise, perhaps you know that Mirah's brother is found!\" said Mrs. Meyrick, in her clearest accents.\n\"Oh, confound it!\" said Hans, in the same moment.\n\"Hans, that is wicked,\" said Mab. \"Suppose we had lost you?\"\n\"I _cannot_ help being rather sorry,\" said Kate. \"And her mother?--where is she?\"\n\"Her mother is dead.\"\n\"I hope the brother is not a bad man,\" said Amy.\n\"Nor a fellow all smiles and jewelry--a Crystal Palace Assyrian with a hat on,\" said Hans, in the worst humor.\n\"Were there ever such unfeeling children?\" said Mrs. Meyrick, a little strengthened by the need for opposition. \"You don't think the least bit of Mirah's joy in the matter.\"\n\"You know, ma, Mirah hardly remembers her brother,\" said Kate.\n\"People who are lost for twelve years should never come back again,\" said Hans. \"They are always in the way.\"\n\"Hans!\" said Mrs. Meyrick, reproachfully. \"If you had lost me for _twenty_ years, I should have thought--\"\n\"I said twelve years,\" Hans broke in. \"Anywhere about twelve years is the time at which lost relations should keep out of the way.\"\n\"Well, but it's nice finding people--there is something to tell,\" said Mab, clasping her knees. \"Did Prince Camaralzaman find him?\"\nThen Mrs. Meyrick, in her neat, narrative way, told all she knew without interruption. \"Mr. Deronda has the highest admiration for him,\" she ended--\"seems quite to look up to him. And he says Mirah is just the sister to understand this brother.\"\n\"Deronda is getting perfectly preposterous about those Jews,\" said Hans with disgust, rising and setting his chair away with a bang. \"He wants to do everything he can to encourage Mirah in her prejudices.\"\n\"Oh, for shame, Hans!--to speak in that way of Mr. Deronda,\" said Mab. And Mrs. Meyrick's face showed something like an under-current of expression not allowed to get to the surface.\n\"And now we shall never be all together,\" Hans went on, walking about with his hands thrust into the pockets of his brown velveteen coat, \"but we must have this prophet Elijah to tea with us, and Mirah will think of nothing but sitting on the ruins of Jerusalem. She will be spoiled as an artist--mind that--she will get as narrow as a nun. Everything will be spoiled--our home and everything. I shall take to drinking.\"\n\"Oh, really, Hans,\" said Kate, impatiently. \"I do think men are the most contemptible animals in all creation. Every one of them must have everything to his mind, else he is unbearable.\"\n\"Oh, oh, oh, it's very dreadful!\" cried Mab. \"I feel as if ancient Nineveh were come again.\"\n\"I should like to know what is the good of having gone to the university and knowing everything, if you are so childish, Hans,\" said Amy. \"You ought to put up with a man that Providence sends you to be kind to. _We_ shall have to put up with him.\"\n\"I hope you will all of you like the new Lamentations of Jeremiah--'to be continued in our next'--that's all,\" said Hans, seizing his wide-awake. \"It's no use being one thing more than another if one has to endure the company of those men with a fixed idea, staring blankly at you, and requiring all your remarks to be small foot-notes to their text. If you're to be under a petrifying wall, you'd better be an old boot. I don't feel myself an old boot.\" Then abruptly, \"Good night, little mother,\" bending to kiss her brow in a hasty, desperate manner, and condescendingly, on his way to the door, \"Good-night, girls.\"\n\"Suppose Mirah knew how you are behaving,\" said Kate. But her answer was a slam of the door. \"I _should_ like to see Mirah when Mr. Deronda tells her,\" she went on to her mother. \"I know she will look so beautiful.\"\nBut Deronda, on second thoughts, had written a letter, which Mrs. Meyrick received the next morning, begging her to make the revelation instead of waiting for him, not giving the real reason--that he shrank from going again through a narrative in which he seemed to be making himself important and giving himself a character of general beneficence--but saying that he wished to remain with Mordecai while Mrs. Meyrick would bring Mirah on what was to be understood as a visit, so that there might be a little interval before that change of abode which he expected that Mirah herself would propose.\nDeronda secretly felt some wondering anxiety how far Mordecai, after years of solitary preoccupation with ideas likely to have become the more exclusive from continual diminution of bodily strength, would allow him to feel a tender interest in his sister over and above the rendering of pious duties. His feeling for the Cohens, and especially for little Jacob, showed a persistent activity of affection; but these objects had entered into his daily life for years; and Deronda felt it noticeable that Mordecai asked no new questions about Mirah, maintaining, indeed, an unusual silence on all subjects, and appearing simply to submit to the changes that were coming over his personal life. He donned the new clothes obediently, but said afterward to Deronda, with a faint smile, \"I must keep my old garments by me for a remembrance.\" And when they were seated, awaiting Mirah, he uttered no word, keeping his eyelids closed, but yet showing restless feeling in his face and hands. In fact, Mordecai was undergoing that peculiar nervous perturbation only known to those whose minds, long and habitually moving with strong impetus in one current, are suddenly compelled into a new or reopened channel. Susceptible people, whose strength has been long absorbed by dormant bias, dread an interview that imperiously revives the past, as they would dread a threatening illness. Joy may be there, but joy, too, is terrible.\nDeronda felt the infection of excitement, and when he heard the ring at the door, he went out, not knowing exactly why, that he might see and greet Mirah beforehand. He was startled to find that she had on the hat and cloak in which he had first seen her--the memorable cloak that had once been wetted for a winding-sheet. She had come down-stairs equipped in this way; and when Mrs. Meyrick said, in a tone of question, \"You like to go in that dress, dear?\" she answered, \"My brother is poor, and I want to look as much like him as I can, else he may feel distant from me\"--imagining that she should meet him in the workman's dress. Deronda could not make any remark, but felt secretly rather ashamed of his own fastidious arrangements. They shook hands silently, for Mirah looked pale and awed.\nWhen Deronda opened the door for her, Mordecai had risen, and had his eyes turned toward it with an eager gaze. Mirah took only two or three steps, and then stood still. They looked at each other, motionless. It was less their own presence that they felt than another's; they were meeting first in memories, compared with which touch was no union. Mirah was the first to break the silence, standing where she was.\n\"Ezra,\" she said, in exactly the same tone as when she was telling of her mother's call to him.\nMordecai with a sudden movement advanced and laid his hand on her shoulders. He was the head taller, and looked down at her tenderly while he said, \"That was our mother's voice. You remember her calling me?\"\n\"Yes, and how you answered her--'Mother!'--and I knew you loved her.\" Mirah threw her arms round her brother's neck, clasped her little hands behind it, and drew down his face, kissing it with childlike lavishness. Her hat fell backward on the ground and disclosed all her curls.\n\"Ah, the dear head, the dear head!\" said Mordecai, in a low loving tone, laying his thin hand gently on the curls.\n\"You are very ill, Ezra,\" said Mirah, sadly looking at him with more observation.\n\"Yes, dear child, I shall not be long with you in the body,\" was the quiet answer.\n\"Oh, I will love you and we will talk to each other,\" said Mirah, with a sweet outpouring of her words, as spontaneous as bird-notes. \"I will tell you everything, and you will teach me:--you will teach me to be a good Jewess--what she would have liked me to be. I shall always be with you when I am not working. For I work now. I shall get money to keep us. Oh, I have had such good friends.\"\nMirah until now had quite forgotten that any one was by, but here she turned with the prettiest attitude, keeping one hand on her brother's arm while she looked at Mrs. Meyrick and Deronda. The little mother's happy emotion in witnessing this meeting of brother and sister had already won her to Mordecai, who seemed to her really to have more dignity and refinement than she had felt obliged to believe in from Deronda's account.\n\"See this dear lady!\" said Mirah. \"I was a stranger, a poor wanderer, and she believed in me, and has treated me as a daughter. Please give my brother your hand,\" she added, beseechingly, taking Mrs. Meyrick's hand and putting it in Mordecai's, then pressing them both with her own and lifting them to her lips.\n\"The Eternal Goodness has been with you,\" said Mordecai. \"You have helped to fulfill our mother's prayer.\"\n\"I think we will go now, shall we?--and return later,\" said Deronda, laying a gentle pressure on Mrs. Meyrick's arm, and she immediately complied. He was afraid of any reference to the facts about himself which he had kept back from Mordecai, and he felt no uneasiness now in the thought of the brother and sister being alone together.",
        "paragraph_chars": [
            [
                0,
                83
            ],
            [
                83,
                1196
            ],
            [
                1196,
                1472
            ],
            [
                1472,
                1668
            ],
            [
                1668,
                1951
            ],
            [
                1951,
                2077
            ],
            [
                2077,
                2127
            ],
            [
                2127,
                2188
            ],
            [
                2188,
                2270
            ],
            [
                2270,
                2292
            ],
            [
                2292,
                2341
            ],
            [
                2341,
                2452
            ],
            [
                2452,
                2626
            ],
            [
                2626,
                2689
            ],
            [
                2689,
                2799
            ],
            [
                2799,
                2906
            ],
            [
                2906,
                3038
            ],
            [
                3038,
                3170
            ],
            [
                3170,
                3416
            ],
            [
                3416,
                3622
            ],
            [
                3622,
                3805
            ],
            [
                3805,
                4226
            ],
            [
                4226,
                4413
            ],
            [
                4413,
                4506
            ],
            [
                4506,
                4754
            ],
            [
                4754,
                5374
            ],
            [
                5374,
                5590
            ],
            [
                5590,
                6188
            ],
            [
                6188,
                7606
            ],
            [
                7606,
                8403
            ],
            [
                8403,
                8817
            ],
            [
                8817,
                8913
            ],
            [
                8913,
                9121
            ],
            [
                9121,
                9401
            ],
            [
                9401,
                9516
            ],
            [
                9516,
                9598
            ],
            [
                9598,
                9681
            ],
            [
                9681,
                10074
            ],
            [
                10074,
                10505
            ],
            [
                10505,
                10817
            ],
            [
                10817,
                10924
            ],
            [
                10924,
                11259
            ]
        ],
        "segment_chars": [
            [
                0,
                69
            ],
            [
                69,
                83
            ],
            [
                83,
                372
            ],
            [
                372,
                508
            ],
            [
                508,
                846
            ],
            [
                846,
                1196
            ],
            [
                1196,
                1361
            ],
            [
                1361,
                1472
            ],
            [
                1472,
                1541
            ],
            [
                1541,
                1631
            ],
            [
                1631,
                1668
            ],
            [
                1668,
                1699
            ],
            [
                1699,
                1951
            ],
            [
                1951,
                2033
            ],
            [
                2033,
                2077
            ],
            [
                2077,
                2096
            ],
            [
                2096,
                2127
            ],
            [
                2127,
                2161
            ],
            [
                2161,
                2188
            ],
            [
                2188,
                2237
            ],
            [
                2237,
                2270
            ],
            [
                2270,
                2292
            ],
            [
                2292,
                2341
            ],
            [
                2341,
                2452
            ],
            [
                2452,
                2495
            ],
            [
                2495,
                2564
            ],
            [
                2564,
                2626
            ],
            [
                2626,
                2689
            ],
            [
                2689,
                2769
            ],
            [
                2769,
                2799
            ],
            [
                2799,
                2807
            ],
            [
                2807,
                2841
            ],
            [
                2841,
                2906
            ],
            [
                2906,
                2944
            ],
            [
                2944,
                3038
            ],
            [
                3038,
                3134
            ],
            [
                3134,
                3170
            ],
            [
                3170,
                3257
            ],
            [
                3257,
                3350
            ],
            [
                3350,
                3416
            ],
            [
                3416,
                3549
            ],
            [
                3549,
                3622
            ],
            [
                3622,
                3693
            ],
            [
                3693,
                3805
            ],
            [
                3805,
                4068
            ],
            [
                4068,
                4146
            ],
            [
                4146,
                4199
            ],
            [
                4199,
                4226
            ],
            [
                4226,
                4270
            ],
            [
                4270,
                4337
            ],
            [
                4337,
                4413
            ],
            [
                4413,
                4447
            ],
            [
                4447,
                4458
            ],
            [
                4458,
                4506
            ],
            [
                4506,
                4644
            ],
            [
                4644,
                4717
            ],
            [
                4717,
                4754
            ],
            [
                4754,
                4900
            ],
            [
                4900,
                5105
            ],
            [
                5105,
                5175
            ],
            [
                5175,
                5209
            ],
            [
                5209,
                5374
            ],
            [
                5374,
                5428
            ],
            [
                5428,
                5467
            ],
            [
                5467,
                5553
            ],
            [
                5553,
                5590
            ],
            [
                5590,
                6188
            ],
            [
                6188,
                6489
            ],
            [
                6489,
                6879
            ],
            [
                6879,
                7023
            ],
            [
                7023,
                7170
            ],
            [
                7170,
                7389
            ],
            [
                7389,
                7561
            ],
            [
                7561,
                7606
            ],
            [
                7606,
                7772
            ],
            [
                7772,
                7929
            ],
            [
                7929,
                8065
            ],
            [
                8065,
                8240
            ],
            [
                8240,
                8344
            ],
            [
                8344,
                8403
            ],
            [
                8403,
                8515
            ],
            [
                8515,
                8573
            ],
            [
                8573,
                8612
            ],
            [
                8612,
                8751
            ],
            [
                8751,
                8817
            ],
            [
                8817,
                8913
            ],
            [
                8913,
                8990
            ],
            [
                8990,
                9091
            ],
            [
                9091,
                9121
            ],
            [
                9121,
                9162
            ],
            [
                9162,
                9191
            ],
            [
                9191,
                9336
            ],
            [
                9336,
                9401
            ],
            [
                9401,
                9437
            ],
            [
                9437,
                9516
            ],
            [
                9516,
                9598
            ],
            [
                9598,
                9681
            ],
            [
                9681,
                9815
            ],
            [
                9815,
                9943
            ],
            [
                9943,
                9993
            ],
            [
                9993,
                10009
            ],
            [
                10009,
                10039
            ],
            [
                10039,
                10074
            ],
            [
                10074,
                10264
            ],
            [
                10264,
                10505
            ],
            [
                10505,
                10527
            ],
            [
                10527,
                10539
            ],
            [
                10539,
                10633
            ],
            [
                10633,
                10817
            ],
            [
                10817,
                10874
            ],
            [
                10874,
                10924
            ],
            [
                10924,
                11071
            ],
            [
                11071,
                11259
            ]
        ],
        "overlap_chars": [
            [
                112,
                119
            ],
            [
                130,
                155
            ],
            [
                224,
                246
            ],
            [
                252,
                286
            ],
            [
                297,
                322
            ],
            [
                328,
                350
            ],
            [
                360,
                372
            ],
            [
                523,
                525
            ],
            [
                780,
                784
            ],
            [
                414,
                419
            ],
            [
                751,
                762
            ],
            [
                419,
                421
            ],
            [
                736,
                747
            ],
            [
                430,
                437
            ],
            [
                481,
                484
            ],
            [
                792,
                802
            ],
            [
                922,
                923
            ],
            [
                846,
                891
            ],
            [
                446,
                447
            ],
            [
                924,
                935
            ],
            [
                693,
                700
            ],
            [
                618,
                625
            ],
            [
                973,
                1012
            ],
            [
                1023,
                1033
            ],
            [
                1194,
                1196
            ],
            [
                1204,
                1231
            ],
            [
                1241,
                1305
            ],
            [
                1311,
                1361
            ],
            [
                1361,
                1365
            ],
            [
                1401,
                1434
            ],
            [
                1466,
                1470
            ],
            [
                1472,
                1541
            ],
            [
                1631,
                1668
            ],
            [
                1668,
                1699
            ],
            [
                1699,
                1716
            ],
            [
                1731,
                1752
            ],
            [
                1785,
                1864
            ],
            [
                1895,
                1906
            ],
            [
                1874,
                1883
            ],
            [
                1949,
                1951
            ],
            [
                1951,
                2033
            ],
            [
                2033,
                2050
            ],
            [
                2075,
                2077
            ],
            [
                2077,
                2096
            ],
            [
                2096,
                2105
            ],
            [
                2125,
                2127
            ],
            [
                2127,
                2161
            ],
            [
                2161,
                2188
            ],
            [
                2188,
                2190
            ],
            [
                2200,
                2237
            ],
            [
                2237,
                2253
            ],
            [
                2255,
                2270
            ],
            [
                2270,
                2292
            ],
            [
                2292,
                2341
            ],
            [
                2341,
                2369
            ],
            [
                2418,
                2444
            ],
            [
                2450,
                2452
            ],
            [
                2452,
                2495
            ],
            [
                2495,
                2512
            ],
            [
                2562,
                2564
            ],
            [
                2564,
                2580
            ],
            [
                2598,
                2626
            ],
            [
                2626,
                2627
            ],
            [
                2641,
                2689
            ],
            [
                2689,
                2769
            ],
            [
                2769,
                2778
            ],
            [
                2786,
                2799
            ],
            [
                2799,
                2807
            ],
            [
                2807,
                2840
            ],
            [
                3038,
                3039
            ],
            [
                3045,
                3073
            ],
            [
                3075,
                3134
            ],
            [
                3134,
                3170
            ],
            [
                3170,
                3200
            ],
            [
                3212,
                3257
            ],
            [
                3257,
                3316
            ],
            [
                3318,
                3319
            ],
            [
                3350,
                3416
            ],
            [
                3416,
                3487
            ],
            [
                3500,
                3501
            ],
            [
                3493,
                3500
            ],
            [
                3547,
                3549
            ],
            [
                3549,
                3622
            ],
            [
                3622,
                3642
            ],
            [
                3645,
                3693
            ],
            [
                3693,
                3723
            ],
            [
                3739,
                3784
            ],
            [
                3796,
                3805
            ],
            [
                3805,
                3901
            ],
            [
                3917,
                3920
            ],
            [
                3906,
                3913
            ],
            [
                3941,
                4068
            ],
            [
                4146,
                4172
            ],
            [
                4197,
                4199
            ],
            [
                4199,
                4226
            ],
            [
                4226,
                4270
            ],
            [
                4270,
                4337
            ],
            [
                4337,
                4413
            ],
            [
                4506,
                4507
            ],
            [
                4529,
                4548
            ],
            [
                4521,
                4523
            ],
            [
                4568,
                4631
            ],
            [
                4634,
                4644
            ],
            [
                4644,
                4657
            ],
            [
                4705,
                4715
            ],
            [
                4670,
                4701
            ],
            [
                4754,
                4770
            ],
            [
                4782,
                4790
            ],
            [
                4795,
                4819
            ],
            [
                4892,
                4893
            ],
            [
                4852,
                4887
            ],
            [
                4898,
                4900
            ],
            [
                4900,
                4901
            ],
            [
                4961,
                5072
            ],
            [
                5079,
                5103
            ],
            [
                5209,
                5277
            ],
            [
                5306,
                5374
            ],
            [
                5374,
                5428
            ],
            [
                5428,
                5467
            ],
            [
                5467,
                5469
            ],
            [
                5471,
                5477
            ],
            [
                5479,
                5553
            ],
            [
                5553,
                5554
            ],
            [
                5561,
                5590
            ],
            [
                5590,
                5643
            ],
            [
                5645,
                5672
            ],
            [
                5677,
                5752
            ],
            [
                5787,
                5801
            ],
            [
                5822,
                5823
            ],
            [
                5834,
                5855
            ],
            [
                5866,
                5883
            ],
            [
                5939,
                5942
            ],
            [
                6142,
                6144
            ],
            [
                5995,
                6007
            ],
            [
                5950,
                5994
            ],
            [
                6020,
                6028
            ],
            [
                6058,
                6065
            ],
            [
                6038,
                6040
            ],
            [
                6186,
                6188
            ],
            [
                6188,
                6209
            ],
            [
                6307,
                6309
            ],
            [
                6233,
                6236
            ],
            [
                6413,
                6442
            ],
            [
                6241,
                6249
            ],
            [
                6403,
                6410
            ],
            [
                6249,
                6299
            ],
            [
                6487,
                6489
            ],
            [
                6611,
                6614
            ],
            [
                6582,
                6591
            ],
            [
                6501,
                6531
            ],
            [
                6536,
                6548
            ],
            [
                6591,
                6596
            ],
            [
                6643,
                6665
            ],
            [
                6685,
                6734
            ],
            [
                6792,
                6795
            ],
            [
                6877,
                6879
            ],
            [
                6879,
                6925
            ],
            [
                6936,
                6996
            ],
            [
                7003,
                7023
            ],
            [
                7023,
                7121
            ],
            [
                7130,
                7138
            ],
            [
                7163,
                7168
            ],
            [
                7159,
                7162
            ],
            [
                7154,
                7158
            ],
            [
                7168,
                7169
            ],
            [
                7170,
                7207
            ],
            [
                7217,
                7224
            ],
            [
                7238,
                7269
            ],
            [
                7271,
                7275
            ],
            [
                7318,
                7324
            ],
            [
                7269,
                7270
            ],
            [
                7334,
                7367
            ],
            [
                7380,
                7389
            ],
            [
                7464,
                7561
            ],
            [
                7561,
                7606
            ],
            [
                7652,
                7656
            ],
            [
                7606,
                7613
            ],
            [
                7660,
                7669
            ],
            [
                7682,
                7686
            ],
            [
                7686,
                7699
            ],
            [
                7748,
                7772
            ],
            [
                7772,
                7860
            ],
            [
                7862,
                7865
            ],
            [
                7876,
                7890
            ],
            [
                7896,
                7929
            ],
            [
                7929,
                7936
            ],
            [
                7985,
                7997
            ],
            [
                8077,
                8179
            ],
            [
                7946,
                7947
            ],
            [
                8191,
                8218
            ],
            [
                8223,
                8240
            ],
            [
                8240,
                8247
            ],
            [
                8279,
                8344
            ],
            [
                8344,
                8403
            ],
            [
                8403,
                8431
            ],
            [
                8439,
                8464
            ],
            [
                8478,
                8484
            ],
            [
                8469,
                8477
            ],
            [
                8485,
                8515
            ],
            [
                8515,
                8525
            ],
            [
                8531,
                8573
            ],
            [
                8573,
                8612
            ],
            [
                8674,
                8751
            ],
            [
                8751,
                8791
            ],
            [
                8815,
                8817
            ],
            [
                8817,
                8913
            ],
            [
                8913,
                8921
            ],
            [
                8945,
                8966
            ],
            [
                8972,
                8990
            ],
            [
                8990,
                8996
            ],
            [
                9001,
                9045
            ],
            [
                9059,
                9091
            ],
            [
                9091,
                9121
            ],
            [
                9121,
                9151
            ],
            [
                9153,
                9160
            ],
            [
                9164,
                9191
            ],
            [
                9191,
                9237
            ],
            [
                9274,
                9277
            ],
            [
                9288,
                9296
            ],
            [
                9309,
                9336
            ],
            [
                9336,
                9371
            ],
            [
                9390,
                9401
            ],
            [
                9401,
                9419
            ],
            [
                9434,
                9437
            ],
            [
                9437,
                9516
            ],
            [
                9516,
                9553
            ],
            [
                9575,
                9579
            ],
            [
                9585,
                9598
            ],
            [
                9598,
                9681
            ],
            [
                9681,
                9746
            ],
            [
                9774,
                9783
            ],
            [
                9785,
                9787
            ],
            [
                9754,
                9759
            ],
            [
                9788,
                9815
            ],
            [
                9815,
                9865
            ],
            [
                9886,
                9905
            ],
            [
                9907,
                9943
            ],
            [
                9943,
                9993
            ],
            [
                9993,
                10009
            ],
            [
                10009,
                10039
            ],
            [
                10039,
                10074
            ],
            [
                10135,
                10139
            ],
            [
                10074,
                10079
            ],
            [
                10144,
                10178
            ],
            [
                10235,
                10264
            ],
            [
                10264,
                10283
            ],
            [
                10298,
                10324
            ],
            [
                10347,
                10383
            ],
            [
                10413,
                10453
            ],
            [
                10503,
                10505
            ],
            [
                10505,
                10527
            ],
            [
                10527,
                10539
            ],
            [
                10539,
                10545
            ],
            [
                10558,
                10631
            ],
            [
                10693,
                10749
            ],
            [
                10668,
                10671
            ],
            [
                10764,
                10786
            ],
            [
                10791,
                10817
            ],
            [
                10817,
                10873
            ],
            [
                10924,
                10948
            ],
            [
                10960,
                11039
            ],
            [
                11069,
                11071
            ],
            [
                11171,
                11196
            ],
            [
                11215,
                11259
            ]
        ],
        "row_chars": [
            [
                0,
                69
            ],
            [
                69,
                83
            ],
            [
                83,
                372
            ],
            [
                372,
                1196
            ],
            [
                1196,
                1361
            ],
            [
                1361,
                1472
            ],
            [
                1472,
                1541
            ],
            [
                1541,
                1631
            ],
            [
                1631,
                1668
            ],
            [
                1668,
                1699
            ],
            [
                1699,
                1951
            ],
            [
                1951,
                2033
            ],
            [
                2033,
                2077
            ],
            [
                2077,
                2096
            ],
            [
                2096,
                2127
            ],
            [
                2127,
                2161
            ],
            [
                2161,
                2188
            ],
            [
                2188,
                2237
            ],
            [
                2237,
                2270
            ],
            [
                2270,
                2292
            ],
            [
                2292,
                2341
            ],
            [
                2341,
                2452
            ],
            [
                2452,
                2495
            ],
            [
                2495,
                2564
            ],
            [
                2564,
                2626
            ],
            [
                2626,
                2689
            ],
            [
                2689,
                2769
            ],
            [
                2769,
                2799
            ],
            [
                2799,
                2807
            ],
            [
                2807,
                2841
            ],
            [
                2841,
                2906
            ],
            [
                2906,
                2944
            ],
            [
                2944,
                3038
            ],
            [
                3038,
                3134
            ],
            [
                3134,
                3170
            ],
            [
                3170,
                3257
            ],
            [
                3257,
                3416
            ],
            [
                3416,
                3549
            ],
            [
                3549,
                3622
            ],
            [
                3622,
                3693
            ],
            [
                3693,
                3805
            ],
            [
                3805,
                4068
            ],
            [
                4068,
                4146
            ],
            [
                4146,
                4199
            ],
            [
                4199,
                4226
            ],
            [
                4226,
                4270
            ],
            [
                4270,
                4337
            ],
            [
                4337,
                4413
            ],
            [
                4413,
                4447
            ],
            [
                4447,
                4458
            ],
            [
                4458,
                4506
            ],
            [
                4506,
                4644
            ],
            [
                4644,
                4717
            ],
            [
                4717,
                4754
            ],
            [
                4754,
                4900
            ],
            [
                4900,
                5105
            ],
            [
                5105,
                5175
            ],
            [
                5175,
                5209
            ],
            [
                5209,
                5374
            ],
            [
                5374,
                5428
            ],
            [
                5428,
                5467
            ],
            [
                5467,
                5553
            ],
            [
                5553,
                5590
            ],
            [
                5590,
                6188
            ],
            [
                6188,
                6489
            ],
            [
                6489,
                6879
            ],
            [
                6879,
                7023
            ],
            [
                7023,
                7170
            ],
            [
                7170,
                7389
            ],
            [
                7389,
                7561
            ],
            [
                7561,
                7606
            ],
            [
                7606,
                7772
            ],
            [
                7772,
                7929
            ],
            [
                7929,
                8240
            ],
            [
                8240,
                8344
            ],
            [
                8344,
                8403
            ],
            [
                8403,
                8515
            ],
            [
                8515,
                8573
            ],
            [
                8573,
                8612
            ],
            [
                8612,
                8751
            ],
            [
                8751,
                8817
            ],
            [
                8817,
                8913
            ],
            [
                8913,
                8990
            ],
            [
                8990,
                9091
            ],
            [
                9091,
                9121
            ],
            [
                9121,
                9162
            ],
            [
                9162,
                9191
            ],
            [
                9191,
                9336
            ],
            [
                9336,
                9401
            ],
            [
                9401,
                9437
            ],
            [
                9437,
                9516
            ],
            [
                9516,
                9598
            ],
            [
                9598,
                9681
            ],
            [
                9681,
                9815
            ],
            [
                9815,
                9943
            ],
            [
                9943,
                9993
            ],
            [
                9993,
                10009
            ],
            [
                10009,
                10039
            ],
            [
                10039,
                10074
            ],
            [
                10074,
                10264
            ],
            [
                10264,
                10505
            ],
            [
                10505,
                10527
            ],
            [
                10527,
                10539
            ],
            [
                10539,
                10633
            ],
            [
                10633,
                10817
            ],
            [
                10817,
                10874
            ],
            [
                10874,
                10924
            ],
            [
                10924,
                11071
            ],
            [
                11071,
                11259
            ]
        ]
    },
    "abridged": {
        "text": "Deronda, having provided new clothes for Mordecai, was pleased with the effect of the fine grey flannel shirts and a dressing-gown like a Franciscan's brown robe, with Mordecai's head above them. He knew that Mirah would see her brother's distinction through any appearance of poverty; but there were the Meyricks to be propitiated, and Deronda found himself putting out of sight everything that might feed their repugnance.\nThis inclination would have been confirmed if he had heard the dialogue round Mrs. Meyrick's fire in the evening, after Mirah had gone to her room. Hans had stayed late, and Mrs. Meyrick said-\n\"Now, Kate, put out your candle, and all come round the fire cosily. I have something wonderful to tell.\"\n\"As if I didn't know that, ma. I have seen it in your eye ever so long,\" said Kate, while the girls came up to put their feet on the fender, and Hans sat astride his chair.\n\"Well, then, if you are so wise, perhaps you know that Mirah's brother is found!\" said Mrs. Meyrick.\n\"Oh, confound it!\" said Hans.\n\"Hans, that is wicked,\" said Mab. \"Suppose we had lost you?\"\n\"I cannot help being rather sorry,\" said Kate. \"And her mother?- where is she?\"\n\"Her mother is dead.\"\n\"I hope the brother is not a bad man,\" said Amy.\n\"Nor a fellow all smiles and jewellery,\" said Hans, in the worst humour.\n\"Were there ever such unfeeling children?\" said Mrs. Meyrick. \"You don't think about Mirah's joy in the matter.\"\n\"Mirah hardly remembers her brother,\" said Kate.\n\"People who are lost for twelve years should never come back again,\" said Hans. \"They are in the way.\"\n\"Hans!\" said Mrs. Meyrick, reproachfully.\n\"But it's nice finding people - there is something to tell,\" said Mab, clasping her knees. \"Did Prince Camaralzaman find him?\"\nThen Mrs. Meyrick, in her neat way, told all she knew without interruption. \"Mr. Deronda has the highest admiration for him,\" she ended,- \"and he says Mirah is just the sister to understand this brother.\"\n\"Deronda is getting perfectly preposterous about those Jews,\" said Hans, standing up in disgust. \"He wants to do everything he can to encourage Mirah in her prejudices.\"\n\"Oh, for shame, Hans!- to speak in that way of Mr. Deronda,\" said Mab. And Mrs. Meyrick's face showed an under-current of expression not allowed to surface.\n\"And now we shall never be all together,\" Hans went on, walking about with his hands thrust into his pockets, \"but we must have this prophet Elijah to tea with us, and Mirah will think of nothing but sitting on the ruins of Jerusalem. Everything will be spoiled. I shall take to drinking.\"\n\"Oh, really, Hans,\" said Kate, impatiently. \"I do think men are the most contemptible animals in all creation. Every one of them must have everything to his mind, else he is unbearable.\"\n\"What is the good of going to university and knowing everything, if you are so childish, Hans?\" said Amy. \"You ought to be kind to a man that Providence sends you.\"\n\"I hope you will like the Lamentations of Jeremiah - that's all,\" said Hans, seizing his hat. \"I can't endure the company of those men with a fixed idea, staring blankly at you, and requiring all your remarks to be foot-notes to their text.\" Then abruptly, \"Good night, little mother,\" bending to kiss her brow, and condescendingly, on his way to the door, \"Good-night, girls.\"\n\"Suppose Mirah knew how you are behaving,\" said Kate. But her answer was a slam of the door. \"I should like to see Mirah when Mr. Deronda tells her,\" she went on to her mother. \"She will look so beautiful.\"\nBut Deronda, on second thoughts, had written a letter which Mrs. Meyrick received next morning, begging her to make the revelation instead of waiting for him. He shrank from telling a story in which he seemed to make himself important; but he told Mrs. Meyrick that he wished to remain with Mordecai while she brought Mirah on a visit to see him.\nDeronda secretly felt anxious as to how much tender interest in his sister Mordecai might be able to feel, after years of solitary preoccupation with ideas. He had shown affection for the Cohens, and especially little Jacob; but he had known them for years; and Deronda noticed that Mordecai asked no new questions about Mirah, but was unusually silent and submissive. He donned the new clothes obediently, but said to Deronda, with a faint smile, \"I must keep my old garments for a remembrance.\" And when they were seated, awaiting Mirah, he uttered no word, keeping his eyelids closed, but yet with restless hands and face.\nIn fact, Mordecai was undergoing that nervous upheaval only known to those whose minds have long moved in one direction, when they are suddenly compelled into a new channel. They may dread an interview that imperiously revives the past, as they would dread a threatening illness. Joy may be there, but joy, too, is terrible.\nWhen Deronda heard the doorbell, he went out to greet Mirah beforehand. He was startled to find that she had on the hat and cloak in which he had first seen her - the cloak that had been wetted for a winding-sheet. She had told Mrs. Meyrick, \"My brother is poor, and I want to look as much like him as I can, else he may feel distant from me\" - imagining that she should meet him in workman's dress. Deronda felt secretly rather ashamed of his own fastidious arrangements. They shook hands silently, for Mirah looked pale and awed.\nWhen Deronda opened the door, Mordecai had risen, and turned his eyes toward it with an eager gaze. Mirah took two or three steps, and then stood still. They looked at each other, motionless. They were meeting first in memories, compared with which touch was no union. Mirah was the first to break the silence.\n\"Ezra,\" she said, in exactly the same tone as when she was telling of her mother's call to him.\nMordecai suddenly advanced and laid his hands on her shoulders. He was a head taller, and looked down at her tenderly, saying, \"That was our mother's voice. You remember her calling me?\"\n\"Yes, and how you answered her - 'Mother!'- and I knew you loved her.\" Mirah threw her arms round her brother's neck, and kissed his face with childlike lavishness. Her hat fell backward on the ground, disclosing her curls.\n\"Ah, the dear head!\" said Mordecai, in a low loving tone, laying his thin hand gently on the curls.\n\"You are very ill, Ezra,\" said Mirah, with sad observation.\n\"Yes, dear child, I shall not be long with you in the body,\" was the quiet answer.\n\"Oh, I will love you and we will talk to each other,\" said Mirah, her words as sweet and spontaneous as bird-notes. \"I will tell you everything, and you will teach me to be a good Jewess - what she would have liked me to be. I shall always be with you when I am not working. For I work now. I shall get money to keep us. Oh, I have had such good friends.\"\nHere Mirah turned with the prettiest attitude to look at Mrs. Meyrick and Deronda. The little mother's happiness in witnessing this meeting had already won her to Mordecai, who had more dignity and refinement than she had expected.\n\"See this dear lady!\" said Mirah. \"I was a poor wanderer, and she believed in me, and has treated me as a daughter.\" Taking Mrs. Meyrick's hand and putting it in Mordecai's, she pressed them both with her own before lifting them to her lips.\n\"The Eternal Goodness has been with you,\" said Mordecai.\n\"I think we will go now, and return later,\" said Deronda, laying a gentle pressure on Mrs. Meyrick's arm. He felt no uneasiness now at the brother and sister being alone together.",
        "paragraph_chars": [
            [
                0,
                425
            ],
            [
                425,
                618
            ],
            [
                618,
                724
            ],
            [
                724,
                897
            ],
            [
                897,
                998
            ],
            [
                998,
                1028
            ],
            [
                1028,
                1089
            ],
            [
                1089,
                1169
            ],
            [
                1169,
                1191
            ],
            [
                1191,
                1240
            ],
            [
                1240,
                1313
            ],
            [
                1313,
                1426
            ],
            [
                1426,
                1475
            ],
            [
                1475,
                1578
            ],
            [
                1578,
                1620
            ],
            [
                1620,
                1747
            ],
            [
                1747,
                1952
            ],
            [
                1952,
                2122
            ],
            [
                2122,
                2279
            ],
            [
                2279,
                2569
            ],
            [
                2569,
                2756
            ],
            [
                2756,
                2921
            ],
            [
                2921,
                3299
            ],
            [
                3299,
                3506
            ],
            [
                3506,
                3853
            ],
            [
                3853,
                4479
            ],
            [
                4479,
                4804
            ],
            [
                4804,
                5336
            ],
            [
                5336,
                5647
            ],
            [
                5647,
                5743
            ],
            [
                5743,
                5930
            ],
            [
                5930,
                6154
            ],
            [
                6154,
                6254
            ],
            [
                6254,
                6314
            ],
            [
                6314,
                6397
            ],
            [
                6397,
                6753
            ],
            [
                6753,
                6985
            ],
            [
                6985,
                7227
            ],
            [
                7227,
                7284
            ],
            [
                7284,
                7463
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                425
            ],
            [
                425,
                573
            ],
            [
                573,
                618
            ],
            [
                618,
                687
            ],
            [
                687,
                724
            ],
            [
                724,
                755
            ],
            [
                755,
                897
            ],
            [
                897,
                979
            ],
            [
                979,
                998
            ],
            [
                998,
                1017
            ],
            [
                1017,
                1028
            ],
            [
                1028,
                1062
            ],
            [
                1062,
                1089
            ],
            [
                1089,
                1136
            ],
            [
                1136,
                1169
            ],
            [
                1169,
                1191
            ],
            [
                1191,
                1240
            ],
            [
                1240,
                1313
            ],
            [
                1313,
                1356
            ],
            [
                1356,
                1375
            ],
            [
                1375,
                1426
            ],
            [
                1426,
                1475
            ],
            [
                1475,
                1555
            ],
            [
                1555,
                1578
            ],
            [
                1578,
                1586
            ],
            [
                1586,
                1620
            ],
            [
                1620,
                1711
            ],
            [
                1711,
                1747
            ],
            [
                1747,
                1823
            ],
            [
                1823,
                1952
            ],
            [
                1952,
                2049
            ],
            [
                2049,
                2122
            ],
            [
                2122,
                2193
            ],
            [
                2193,
                2279
            ],
            [
                2279,
                2514
            ],
            [
                2514,
                2542
            ],
            [
                2542,
                2569
            ],
            [
                2569,
                2613
            ],
            [
                2613,
                2680
            ],
            [
                2680,
                2756
            ],
            [
                2756,
                2852
            ],
            [
                2852,
                2862
            ],
            [
                2862,
                2921
            ],
            [
                2921,
                3015
            ],
            [
                3015,
                3163
            ],
            [
                3163,
                3299
            ],
            [
                3299,
                3353
            ],
            [
                3353,
                3392
            ],
            [
                3392,
                3476
            ],
            [
                3476,
                3506
            ],
            [
                3506,
                3665
            ],
            [
                3665,
                3853
            ],
            [
                3853,
                4010
            ],
            [
                4010,
                4222
            ],
            [
                4222,
                4350
            ],
            [
                4350,
                4479
            ],
            [
                4479,
                4653
            ],
            [
                4653,
                4759
            ],
            [
                4759,
                4804
            ],
            [
                4804,
                4876
            ],
            [
                4876,
                5019
            ],
            [
                5019,
                5204
            ],
            [
                5204,
                5277
            ],
            [
                5277,
                5336
            ],
            [
                5336,
                5436
            ],
            [
                5436,
                5489
            ],
            [
                5489,
                5528
            ],
            [
                5528,
                5605
            ],
            [
                5605,
                5647
            ],
            [
                5647,
                5743
            ],
            [
                5743,
                5807
            ],
            [
                5807,
                5900
            ],
            [
                5900,
                5930
            ],
            [
                5930,
                5971
            ],
            [
                5971,
                6001
            ],
            [
                6001,
                6095
            ],
            [
                6095,
                6154
            ],
            [
                6154,
                6175
            ],
            [
                6175,
                6254
            ],
            [
                6254,
                6314
            ],
            [
                6314,
                6397
            ],
            [
                6397,
                6513
            ],
            [
                6513,
                6622
            ],
            [
                6622,
                6672
            ],
            [
                6672,
                6688
            ],
            [
                6688,
                6718
            ],
            [
                6718,
                6753
            ],
            [
                6753,
                6836
            ],
            [
                6836,
                6985
            ],
            [
                6985,
                7007
            ],
            [
                7007,
                7019
            ],
            [
                7019,
                7102
            ],
            [
                7102,
                7227
            ],
            [
                7227,
                7284
            ],
            [
                7284,
                7390
            ],
            [
                7390,
                7463
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                25,
                50
            ],
            [
                68,
                90
            ],
            [
                96,
                130
            ],
            [
                131,
                156
            ],
            [
                161,
                183
            ],
            [
                184,
                196
            ],
            [
                196,
                198
            ],
            [
                204,
                208
            ],
            [
                209,
                214
            ],
            [
                225,
                236
            ],
            [
                236,
                238
            ],
            [
                239,
                250
            ],
            [
                251,
                258
            ],
            [
                259,
                262
            ],
            [
                274,
                284
            ],
            [
                284,
                285
            ],
            [
                286,
                331
            ],
            [
                331,
                332
            ],
            [
                333,
                344
            ],
            [
                351,
                358
            ],
            [
                359,
                366
            ],
            [
                367,
                406
            ],
            [
                413,
                423
            ],
            [
                423,
                425
            ],
            [
                430,
                457
            ],
            [
                458,
                522
            ],
            [
                523,
                573
            ],
            [
                573,
                577
            ],
            [
                578,
                611
            ],
            [
                612,
                616
            ],
            [
                618,
                687
            ],
            [
                687,
                724
            ],
            [
                724,
                755
            ],
            [
                755,
                772
            ],
            [
                773,
                794
            ],
            [
                794,
                873
            ],
            [
                874,
                885
            ],
            [
                886,
                895
            ],
            [
                895,
                897
            ],
            [
                897,
                979
            ],
            [
                979,
                996
            ],
            [
                996,
                998
            ],
            [
                998,
                1017
            ],
            [
                1017,
                1026
            ],
            [
                1026,
                1028
            ],
            [
                1028,
                1062
            ],
            [
                1062,
                1089
            ],
            [
                1089,
                1091
            ],
            [
                1099,
                1136
            ],
            [
                1136,
                1152
            ],
            [
                1154,
                1169
            ],
            [
                1169,
                1191
            ],
            [
                1191,
                1240
            ],
            [
                1240,
                1268
            ],
            [
                1278,
                1304
            ],
            [
                1311,
                1313
            ],
            [
                1313,
                1356
            ],
            [
                1356,
                1373
            ],
            [
                1373,
                1375
            ],
            [
                1375,
                1391
            ],
            [
                1398,
                1426
            ],
            [
                1426,
                1427
            ],
            [
                1427,
                1475
            ],
            [
                1475,
                1555
            ],
            [
                1555,
                1564
            ],
            [
                1565,
                1578
            ],
            [
                1578,
                1586
            ],
            [
                1586,
                1619
            ],
            [
                1620,
                1621
            ],
            [
                1621,
                1649
            ],
            [
                1652,
                1711
            ],
            [
                1711,
                1747
            ],
            [
                1747,
                1777
            ],
            [
                1778,
                1823
            ],
            [
                1823,
                1882
            ],
            [
                1885,
                1886
            ],
            [
                1886,
                1952
            ],
            [
                1952,
                2023
            ],
            [
                2023,
                2024
            ],
            [
                2040,
                2047
            ],
            [
                2047,
                2049
            ],
            [
                2049,
                2122
            ],
            [
                2122,
                2142
            ],
            [
                2145,
                2193
            ],
            [
                2193,
                2223
            ],
            [
                2224,
                2269
            ],
            [
                2270,
                2279
            ],
            [
                2279,
                2375
            ],
            [
                2376,
                2379
            ],
            [
                2380,
                2387
            ],
            [
                2387,
                2514
            ],
            [
                2514,
                2540
            ],
            [
                2540,
                2542
            ],
            [
                2542,
                2569
            ],
            [
                2569,
                2613
            ],
            [
                2613,
                2680
            ],
            [
                2680,
                2756
            ],
            [
                2756,
                2757
            ],
            [
                2757,
                2776
            ],
            [
                2783,
                2785
            ],
            [
                2786,
                2849
            ],
            [
                2852,
                2862
            ],
            [
                2862,
                2875
            ],
            [
                2876,
                2886
            ],
            [
                2887,
                2918
            ],
            [
                2921,
                2937
            ],
            [
                2938,
                2946
            ],
            [
                2947,
                2971
            ],
            [
                2972,
                2973
            ],
            [
                2974,
                3009
            ],
            [
                3013,
                3015
            ],
            [
                3015,
                3016
            ],
            [
                3024,
                3135
            ],
            [
                3136,
                3160
            ],
            [
                3163,
                3231
            ],
            [
                3231,
                3299
            ],
            [
                3299,
                3353
            ],
            [
                3353,
                3392
            ],
            [
                3392,
                3394
            ],
            [
                3395,
                3401
            ],
            [
                3402,
                3476
            ],
            [
                3476,
                3477
            ],
            [
                3477,
                3506
            ],
            [
                3506,
                3559
            ],
            [
                3560,
                3587
            ],
            [
                3588,
                3663
            ],
            [
                3665,
                3679
            ],
            [
                3688,
                3689
            ],
            [
                3696,
                3717
            ],
            [
                3723,
                3740
            ],
            [
                3742,
                3745
            ],
            [
                3746,
                3748
            ],
            [
                3754,
                3766
            ],
            [
                3767,
                3811
            ],
            [
                3824,
                3832
            ],
            [
                3833,
                3840
            ],
            [
                3841,
                3843
            ],
            [
                3851,
                3853
            ],
            [
                3853,
                3874
            ],
            [
                3886,
                3888
            ],
            [
                3889,
                3892
            ],
            [
                3898,
                3927
            ],
            [
                3928,
                3936
            ],
            [
                3951,
                3958
            ],
            [
                3958,
                4008
            ],
            [
                4008,
                4010
            ],
            [
                4013,
                4016
            ],
            [
                4023,
                4032
            ],
            [
                4033,
                4063
            ],
            [
                4064,
                4076
            ],
            [
                4076,
                4081
            ],
            [
                4100,
                4122
            ],
            [
                4131,
                4180
            ],
            [
                4206,
                4209
            ],
            [
                4220,
                4222
            ],
            [
                4222,
                4268
            ],
            [
                4269,
                4329
            ],
            [
                4330,
                4350
            ],
            [
                4350,
                4448
            ],
            [
                4454,
                4462
            ],
            [
                4463,
                4468
            ],
            [
                4469,
                4472
            ],
            [
                4473,
                4477
            ],
            [
                4477,
                4478
            ],
            [
                4479,
                4516
            ],
            [
                4517,
                4524
            ],
            [
                4534,
                4565
            ],
            [
                4571,
                4575
            ],
            [
                4582,
                4588
            ],
            [
                4598,
                4599
            ],
            [
                4610,
                4643
            ],
            [
                4644,
                4653
            ],
            [
                4662,
                4759
            ],
            [
                4759,
                4804
            ],
            [
                4804,
                4808
            ],
            [
                4809,
                4816
            ],
            [
                4817,
                4826
            ],
            [
                4827,
                4831
            ],
            [
                4835,
                4848
            ],
            [
                4852,
                4876
            ],
            [
                4876,
                4964
            ],
            [
                4967,
                4970
            ],
            [
                4971,
                4985
            ],
            [
                4986,
                5019
            ],
            [
                5019,
                5026
            ],
            [
                5032,
                5044
            ],
            [
                5044,
                5146
            ],
            [
                5147,
                5148
            ],
            [
                5159,
                5186
            ],
            [
                5187,
                5204
            ],
            [
                5204,
                5211
            ],
            [
                5212,
                5277
            ],
            [
                5277,
                5336
            ],
            [
                5336,
                5364
            ],
            [
                5364,
                5389
            ],
            [
                5390,
                5396
            ],
            [
                5397,
                5405
            ],
            [
                5406,
                5436
            ],
            [
                5436,
                5446
            ],
            [
                5447,
                5489
            ],
            [
                5489,
                5528
            ],
            [
                5528,
                5605
            ],
            [
                5605,
                5645
            ],
            [
                5645,
                5647
            ],
            [
                5647,
                5743
            ],
            [
                5743,
                5751
            ],
            [
                5761,
                5782
            ],
            [
                5789,
                5807
            ],
            [
                5807,
                5813
            ],
            [
                5816,
                5860
            ],
            [
                5868,
                5900
            ],
            [
                5900,
                5930
            ],
            [
                5930,
                5960
            ],
            [
                5963,
                5970
            ],
            [
                5974,
                6001
            ],
            [
                6001,
                6047
            ],
            [
                6048,
                6051
            ],
            [
                6059,
                6067
            ],
            [
                6068,
                6095
            ],
            [
                6095,
                6130
            ],
            [
                6143,
                6154
            ],
            [
                6154,
                6172
            ],
            [
                6172,
                6175
            ],
            [
                6175,
                6254
            ],
            [
                6254,
                6291
            ],
            [
                6292,
                6296
            ],
            [
                6301,
                6314
            ],
            [
                6314,
                6397
            ],
            [
                6397,
                6462
            ],
            [
                6463,
                6472
            ],
            [
                6473,
                6475
            ],
            [
                6476,
                6481
            ],
            [
                6486,
                6513
            ],
            [
                6513,
                6563
            ],
            [
                6564,
                6583
            ],
            [
                6586,
                6622
            ],
            [
                6622,
                6672
            ],
            [
                6672,
                6688
            ],
            [
                6688,
                6718
            ],
            [
                6718,
                6753
            ],
            [
                6753,
                6757
            ],
            [
                6758,
                6763
            ],
            [
                6764,
                6798
            ],
            [
                6807,
                6836
            ],
            [
                6836,
                6855
            ],
            [
                6866,
                6892
            ],
            [
                6893,
                6929
            ],
            [
                6934,
                6974
            ],
            [
                6983,
                6985
            ],
            [
                6985,
                7007
            ],
            [
                7007,
                7019
            ],
            [
                7019,
                7025
            ],
            [
                7026,
                7099
            ],
            [
                7102,
                7158
            ],
            [
                7159,
                7162
            ],
            [
                7171,
                7193
            ],
            [
                7201,
                7227
            ],
            [
                7227,
                7283
            ],
            [
                7284,
                7308
            ],
            [
                7309,
                7388
            ],
            [
                7388,
                7390
            ],
            [
                7390,
                7415
            ],
            [
                7419,
                7463
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                196
            ],
            [
                196,
                425
            ],
            [
                425,
                573
            ],
            [
                573,
                618
            ],
            [
                618,
                687
            ],
            [
                687,
                687
            ],
            [
                687,
                724
            ],
            [
                724,
                755
            ],
            [
                755,
                897
            ],
            [
                897,
                979
            ],
            [
                979,
                998
            ],
            [
                998,
                1017
            ],
            [
                1017,
                1028
            ],
            [
                1028,
                1062
            ],
            [
                1062,
                1089
            ],
            [
                1089,
                1136
            ],
            [
                1136,
                1169
            ],
            [
                1169,
                1191
            ],
            [
                1191,
                1240
            ],
            [
                1240,
                1313
            ],
            [
                1313,
                1356
            ],
            [
                1356,
                1375
            ],
            [
                1375,
                1426
            ],
            [
                1426,
                1475
            ],
            [
                1475,
                1555
            ],
            [
                1555,
                1578
            ],
            [
                1578,
                1586
            ],
            [
                1586,
                1620
            ],
            [
                1620,
                1620
            ],
            [
                1620,
                1620
            ],
            [
                1620,
                1620
            ],
            [
                1620,
                1711
            ],
            [
                1711,
                1747
            ],
            [
                1747,
                1823
            ],
            [
                1823,
                1952
            ],
            [
                1952,
                2049
            ],
            [
                2049,
                2122
            ],
            [
                2122,
                2193
            ],
            [
                2193,
                2279
            ],
            [
                2279,
                2514
            ],
            [
                2514,
                2514
            ],
            [
                2514,
                2542
            ],
            [
                2542,
                2569
            ],
            [
                2569,
                2613
            ],
            [
                2613,
                2680
            ],
            [
                2680,
                2756
            ],
            [
                2756,
                2756
            ],
            [
                2756,
                2756
            ],
            [
                2756,
                2756
            ],
            [
                2756,
                2862
            ],
            [
                2862,
                2921
            ],
            [
                2921,
                2921
            ],
            [
                2921,
                3015
            ],
            [
                3015,
                3163
            ],
            [
                3163,
                3163
            ],
            [
                3163,
                3163
            ],
            [
                3163,
                3299
            ],
            [
                3299,
                3353
            ],
            [
                3353,
                3392
            ],
            [
                3392,
                3476
            ],
            [
                3476,
                3506
            ],
            [
                3506,
                3853
            ],
            [
                3853,
                4010
            ],
            [
                4010,
                4222
            ],
            [
                4222,
                4350
            ],
            [
                4350,
                4479
            ],
            [
                4479,
                4653
            ],
            [
                4653,
                4759
            ],
            [
                4759,
                4804
            ],
            [
                4804,
                4876
            ],
            [
                4876,
                5019
            ],
            [
                5019,
                5204
            ],
            [
                5204,
                5277
            ],
            [
                5277,
                5336
            ],
            [
                5336,
                5436
            ],
            [
                5436,
                5489
            ],
            [
                5489,
                5528
            ],
            [
                5528,
                5605
            ],
            [
                5605,
                5647
            ],
            [
                5647,
                5743
            ],
            [
                5743,
                5807
            ],
            [
                5807,
                5900
            ],
            [
                5900,
                5930
            ],
            [
                5930,
                5971
            ],
            [
                5971,
                6001
            ],
            [
                6001,
                6095
            ],
            [
                6095,
                6154
            ],
            [
                6154,
                6175
            ],
            [
                6175,
                6254
            ],
            [
                6254,
                6314
            ],
            [
                6314,
                6397
            ],
            [
                6397,
                6513
            ],
            [
                6513,
                6622
            ],
            [
                6622,
                6672
            ],
            [
                6672,
                6688
            ],
            [
                6688,
                6718
            ],
            [
                6718,
                6753
            ],
            [
                6753,
                6836
            ],
            [
                6836,
                6985
            ],
            [
                6985,
                7007
            ],
            [
                7007,
                7019
            ],
            [
                7019,
                7102
            ],
            [
                7102,
                7227
            ],
            [
                7227,
                7284
            ],
            [
                7284,
                7284
            ],
            [
                7284,
                7390
            ],
            [
                7390,
                7463
            ]
        ]
    }
}