{
    "original": {
        "text": "Ever in his soul That larger justice which makes gratitude Triumphed above resentment. 'Tis the mark Of regal natures, with the wider life. And fuller capability of joy:-- Not wits exultant in the strongest lens To show you goodness vanished into pulp Never worth \"thank you\"--they're the devil's friars, Vowed to be poor as he in love and trust, Yet must go begging of a world that keeps Some human property.\nDeronda, in parting from Gwendolen, had abstained from saying, \"I shall not see you again for a long while: I am going away,\" lest Grandcourt should understand him to imply that the fact was of importance to her.\nHe was actually going away under circumstances so momentous to himself that when he set out to fulfill his promise of calling on her, he was already under the shadow of a solemn emotion which revived the deepest experience of his life.\nSir Hugo had sent for him to his chambers with the note--\"Come immediately. Something has happened:\" a preparation that caused him some relief when, on entering the baronet's study, he was received with grave affection instead of the distress which he had apprehended.\n\"It is nothing to grieve you, sir?\" said Deronda, in a tone rather of restored confidence than question, as he took the hand held out to him. There was an unusual meaning in Sir Hugo's look, and a subdued emotion in his voice, as he said,\n\"No, Dan, no. Sit down. I have something to say.\"\nDeronda obeyed, not without presentiment. It was extremely rare for Sir Hugo to show so much serious feeling.\n\"Not to grieve me, my boy, no. At least, if there is nothing in it that will grieve you too much. But I hardly expected that this--just this--would ever happen. There have been reasons why I have never prepared you for it. There have been reasons why I have never told you anything about your parentage. But I have striven in every way not to make that an injury to you.\"\nSir Hugo paused, but Deronda could not speak. He could not say, \"I have never felt it an injury.\" Even if that had been true, he could not have trusted his voice to say anything. Far more than any one but himself could know of was hanging on this moment when the secrecy was to be broken. Sir Hugo had never seen the grand face he delighted in so pale--the lips pressed together with such a look of pain. He went on with a more anxious tenderness, as if he had a new fear of wounding.\n\"I have acted in obedience to your mother's wishes. The secrecy was her wish. But now she desires to remove it. She desires to see you. I will put this letter into your hands, which you can look at by-and-by. It will merely tell you what she wishes you to do, and where you will find her.\"\nSir Hugo held out a letter written on foreign paper, which Deronda thrust into his breast-pocket, with a sense of relief that he was not called on to read anything immediately. The emotion on Daniel's face had gained on the baronet, and was visibly shaking his composure. Sir Hugo found it difficult to say more. And Deronda's whole soul was possessed by a question which was the hardest in the world to utter. Yet he could not bear to delay it. This was a sacramental moment. If he let it pass, he could not recover the influences under which it was possible to utter the words and meet the answer. For some moments his eyes were cast down, and it seemed to both as if thoughts were in the air between them. But at last Deronda looked at Sir Hugo, and said, with a tremulous reverence in his voice--dreading to convey indirectly the reproach that affection had for years been stifling,\n\"Is my father also living?\"\nThe answer came immediately in a low emphatic tone--\"No.\"\nIn the mingled emotions which followed that answer it was impossible to distinguish joy from pain.\nSome new light had fallen on the past for Sir Hugo too in this interview. After a silence in which Deronda felt like one whose creed is gone before he has religiously embraced another, the baronet said, in a tone of confession,\n\"Perhaps I was wrong, Dan, to undertake what I did. And perhaps I liked it a little too well--having you all to myself. But if you have had any pain which I might have helped, I ask you to forgive me.\"\n\"The forgiveness has long been there,\" said Deronda \"The chief pain has always been on account of some one else--whom I never knew--whom I am now to know. It has not hindered me from feeling an affection for you which has made a large part of all the life I remember.\"\nIt seemed one impulse that made the two men clasp each other's hand for a moment.",
        "paragraph_chars": [
            [
                0,
                410
            ],
            [
                410,
                623
            ],
            [
                623,
                859
            ],
            [
                859,
                1128
            ],
            [
                1128,
                1367
            ],
            [
                1367,
                1417
            ],
            [
                1417,
                1527
            ],
            [
                1527,
                1899
            ],
            [
                1899,
                2384
            ],
            [
                2384,
                2674
            ],
            [
                2674,
                3561
            ],
            [
                3561,
                3589
            ],
            [
                3589,
                3647
            ],
            [
                3647,
                3746
            ],
            [
                3746,
                3974
            ],
            [
                3974,
                4176
            ],
            [
                4176,
                4445
            ],
            [
                4445,
                4526
            ]
        ],
        "segment_chars": [
            [
                0,
                87
            ],
            [
                87,
                140
            ],
            [
                140,
                410
            ],
            [
                410,
                623
            ],
            [
                623,
                859
            ],
            [
                859,
                935
            ],
            [
                935,
                1128
            ],
            [
                1128,
                1164
            ],
            [
                1164,
                1270
            ],
            [
                1270,
                1367
            ],
            [
                1367,
                1381
            ],
            [
                1381,
                1391
            ],
            [
                1391,
                1417
            ],
            [
                1417,
                1459
            ],
            [
                1459,
                1527
            ],
            [
                1527,
                1558
            ],
            [
                1558,
                1625
            ],
            [
                1625,
                1688
            ],
            [
                1688,
                1750
            ],
            [
                1750,
                1831
            ],
            [
                1831,
                1899
            ],
            [
                1899,
                1945
            ],
            [
                1945,
                1997
            ],
            [
                1997,
                2078
            ],
            [
                2078,
                2188
            ],
            [
                2188,
                2304
            ],
            [
                2304,
                2384
            ],
            [
                2384,
                2436
            ],
            [
                2436,
                2462
            ],
            [
                2462,
                2496
            ],
            [
                2496,
                2520
            ],
            [
                2520,
                2593
            ],
            [
                2593,
                2674
            ],
            [
                2674,
                2851
            ],
            [
                2851,
                2946
            ],
            [
                2946,
                2987
            ],
            [
                2987,
                3085
            ],
            [
                3085,
                3120
            ],
            [
                3120,
                3151
            ],
            [
                3151,
                3274
            ],
            [
                3274,
                3383
            ],
            [
                3383,
                3561
            ],
            [
                3561,
                3589
            ],
            [
                3589,
                3647
            ],
            [
                3647,
                3746
            ],
            [
                3746,
                3820
            ],
            [
                3820,
                3974
            ],
            [
                3974,
                4026
            ],
            [
                4026,
                4094
            ],
            [
                4094,
                4176
            ],
            [
                4176,
                4331
            ],
            [
                4331,
                4445
            ],
            [
                4445,
                4526
            ]
        ],
        "overlap_chars": [
            [
                410,
                445
            ],
            [
                482,
                485
            ],
            [
                523,
                533
            ],
            [
                471,
                472
            ],
            [
                536,
                558
            ],
            [
                583,
                600
            ],
            [
                615,
                623
            ],
            [
                623,
                644
            ],
            [
                650,
                682
            ],
            [
                694,
                706
            ],
            [
                749,
                771
            ],
            [
                794,
                808
            ],
            [
                857,
                859
            ],
            [
                859,
                876
            ],
            [
                910,
                914
            ],
            [
                885,
                900
            ],
            [
                916,
                935
            ],
            [
                935,
                957
            ],
            [
                1008,
                1047
            ],
            [
                1048,
                1061
            ],
            [
                1068,
                1077
            ],
            [
                1126,
                1127
            ],
            [
                1317,
                1318
            ],
            [
                1270,
                1279
            ],
            [
                1323,
                1340
            ],
            [
                1299,
                1312
            ],
            [
                1348,
                1365
            ],
            [
                1367,
                1368
            ],
            [
                1381,
                1389
            ],
            [
                1370,
                1375
            ],
            [
                1389,
                1391
            ],
            [
                1391,
                1417
            ],
            [
                1417,
                1459
            ],
            [
                1459,
                1527
            ],
            [
                1629,
                1656
            ],
            [
                1669,
                1688
            ],
            [
                1688,
                1748
            ],
            [
                1785,
                1829
            ],
            [
                1899,
                1937
            ],
            [
                2051,
                2063
            ],
            [
                1938,
                1943
            ],
            [
                1961,
                1962
            ],
            [
                2130,
                2188
            ],
            [
                2188,
                2196
            ],
            [
                2307,
                2319
            ],
            [
                2327,
                2345
            ],
            [
                2382,
                2384
            ],
            [
                2384,
                2436
            ],
            [
                2436,
                2462
            ],
            [
                2462,
                2469
            ],
            [
                2496,
                2520
            ],
            [
                2531,
                2542
            ],
            [
                2558,
                2573
            ],
            [
                2522,
                2526
            ],
            [
                2608,
                2674
            ],
            [
                2674,
                2771
            ],
            [
                2795,
                2828
            ],
            [
                2838,
                2851
            ],
            [
                2931,
                2944
            ],
            [
                2905,
                2906
            ],
            [
                2946,
                2987
            ],
            [
                2987,
                3085
            ],
            [
                3085,
                3120
            ],
            [
                3387,
                3394
            ],
            [
                3403,
                3472
            ],
            [
                3559,
                3560
            ],
            [
                3483,
                3492
            ],
            [
                3508,
                3516
            ],
            [
                3561,
                3589
            ],
            [
                3589,
                3604
            ],
            [
                3620,
                3634
            ],
            [
                3641,
                3647
            ],
            [
                3746,
                3750
            ],
            [
                3755,
                3820
            ],
            [
                3931,
                3972
            ],
            [
                3974,
                4026
            ],
            [
                4038,
                4045
            ],
            [
                4068,
                4094
            ],
            [
                4094,
                4122
            ],
            [
                4148,
                4176
            ],
            [
                4176,
                4227
            ],
            [
                4228,
                4273
            ],
            [
                4329,
                4331
            ],
            [
                4370,
                4387
            ],
            [
                4394,
                4418
            ],
            [
                4427,
                4431
            ],
            [
                4442,
                4445
            ],
            [
                4455,
                4466
            ],
            [
                4477,
                4494
            ],
            [
                4495,
                4507
            ],
            [
                4525,
                4526
            ]
        ],
        "row_chars": [
            [
                0,
                87
            ],
            [
                87,
                140
            ],
            [
                140,
                410
            ],
            [
                410,
                623
            ],
            [
                623,
                859
            ],
            [
                859,
                935
            ],
            [
                935,
                1128
            ],
            [
                1128,
                1164
            ],
            [
                1164,
                1270
            ],
            [
                1270,
                1367
            ],
            [
                1367,
                1391
            ],
            [
                1391,
                1417
            ],
            [
                1417,
                1459
            ],
            [
                1459,
                1527
            ],
            [
                1527,
                1558
            ],
            [
                1558,
                1625
            ],
            [
                1625,
                1688
            ],
            [
                1688,
                1831
            ],
            [
                1831,
                1899
            ],
            [
                1899,
                2188
            ],
            [
                2188,
                2384
            ],
            [
                2384,
                2436
            ],
            [
                2436,
                2462
            ],
            [
                2462,
                2520
            ],
            [
                2520,
                2674
            ],
            [
                2674,
                2851
            ],
            [
                2851,
                2987
            ],
            [
                2987,
                3085
            ],
            [
                3085,
                3120
            ],
            [
                3120,
                3151
            ],
            [
                3151,
                3274
            ],
            [
                3274,
                3383
            ],
            [
                3383,
                3561
            ],
            [
                3561,
                3589
            ],
            [
                3589,
                3647
            ],
            [
                3647,
                3746
            ],
            [
                3746,
                3820
            ],
            [
                3820,
                3974
            ],
            [
                3974,
                4026
            ],
            [
                4026,
                4094
            ],
            [
                4094,
                4176
            ],
            [
                4176,
                4331
            ],
            [
                4331,
                4445
            ],
            [
                4445,
                4526
            ]
        ]
    },
    "abridged": {
        "text": "Deronda, in parting from Gwendolen, did not tell her he was going away, lest Grandcourt should infer that the fact was important to her.\nHe was actually going abroad under circumstances so momentous that when he called on her, he was already affected by solemn emotion.\nSir Hugo had sent a note to his chambers- \"Come immediately. Something has happened.\" Expecting bad news on entering the baronet's study, he was relieved to be received with affection. However, there was a subdued emotion in Sir Hugo's voice, as he said-\n\"Sit down, Dan. I have something to say.\"\nDeronda obeyed, not without presentiment. It was extremely rare for Sir Hugo to show so much serious feeling.\n\"I hardly expected that this would ever happen. There have been reasons why I have never prepared you for it, and never told you anything about your parentage.\"\nSir Hugo paused, but Deronda could not trust his voice to speak, with so much hanging on this moment when the secrecy was to be broken. Sir Hugo went on with anxious tenderness.\n\"I have acted in obedience to your mother's wishes. The secrecy was her wish. But now she desires to see you. This letter, which you can read later, will tell you what she wishes you to do, and where you will find her.\"\nSir Hugo held out a letter written on foreign paper, which Deronda thrust into his breast-pocket, relieved that he was not called on to read it immediately. His composure shaken, Sir Hugo found it difficult to say more. And Deronda's whole soul was possessed by a question which was the hardest in the world to utter. Yet he could not bear to delay it. At last he looked at Sir Hugo, and said, with a tremulous reverence in his voice, dreading to convey any reproach-\n\"Is my father also living?\"\nThe answer came: a low emphatic \"No.\"\nSome light had fallen on the past for Sir Hugo too in this interview. The baronet said, in a tone of confession-\n\"Perhaps I was wrong, Dan, to undertake what I did. I liked having you all to myself. But if you have had any pain, I ask you to forgive me.\"\n\"The forgiveness has long been there,\" said Deronda. \"The chief pain has always been on account of my mother. But my affection for you has made a large part of my life.\"\nAnd with one impulse the two men clasped each other's hands.",
        "paragraph_chars": [
            [
                0,
                137
            ],
            [
                137,
                270
            ],
            [
                270,
                525
            ],
            [
                525,
                567
            ],
            [
                567,
                677
            ],
            [
                677,
                838
            ],
            [
                838,
                1016
            ],
            [
                1016,
                1236
            ],
            [
                1236,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1770
            ],
            [
                1770,
                1883
            ],
            [
                1883,
                2025
            ],
            [
                2025,
                2195
            ],
            [
                2195,
                2255
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                270
            ],
            [
                270,
                331
            ],
            [
                331,
                356
            ],
            [
                356,
                455
            ],
            [
                455,
                525
            ],
            [
                525,
                541
            ],
            [
                541,
                567
            ],
            [
                567,
                609
            ],
            [
                609,
                677
            ],
            [
                677,
                725
            ],
            [
                725,
                838
            ],
            [
                838,
                974
            ],
            [
                974,
                1016
            ],
            [
                1016,
                1068
            ],
            [
                1068,
                1094
            ],
            [
                1094,
                1126
            ],
            [
                1126,
                1236
            ],
            [
                1236,
                1393
            ],
            [
                1393,
                1456
            ],
            [
                1456,
                1554
            ],
            [
                1554,
                1589
            ],
            [
                1589,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1770
            ],
            [
                1770,
                1840
            ],
            [
                1840,
                1883
            ],
            [
                1883,
                1935
            ],
            [
                1935,
                1969
            ],
            [
                1969,
                2025
            ],
            [
                2025,
                2078
            ],
            [
                2078,
                2135
            ],
            [
                2135,
                2195
            ],
            [
                2195,
                2255
            ]
        ],
        "overlap_chars": [
            [
                0,
                35
            ],
            [
                40,
                43
            ],
            [
                60,
                70
            ],
            [
                70,
                71
            ],
            [
                72,
                94
            ],
            [
                101,
                118
            ],
            [
                129,
                137
            ],
            [
                137,
                158
            ],
            [
                166,
                198
            ],
            [
                199,
                211
            ],
            [
                219,
                241
            ],
            [
                254,
                268
            ],
            [
                268,
                270
            ],
            [
                270,
                287
            ],
            [
                290,
                294
            ],
            [
                295,
                310
            ],
            [
                312,
                331
            ],
            [
                331,
                353
            ],
            [
                375,
                414
            ],
            [
                430,
                443
            ],
            [
                444,
                453
            ],
            [
                453,
                454
            ],
            [
                462,
                463
            ],
            [
                464,
                473
            ],
            [
                474,
                491
            ],
            [
                492,
                505
            ],
            [
                506,
                523
            ],
            [
                525,
                526
            ],
            [
                526,
                534
            ],
            [
                534,
                539
            ],
            [
                539,
                541
            ],
            [
                541,
                567
            ],
            [
                567,
                609
            ],
            [
                609,
                677
            ],
            [
                678,
                705
            ],
            [
                706,
                725
            ],
            [
                725,
                785
            ],
            [
                791,
                835
            ],
            [
                838,
                876
            ],
            [
                883,
                895
            ],
            [
                896,
                901
            ],
            [
                901,
                902
            ],
            [
                916,
                974
            ],
            [
                974,
                982
            ],
            [
                983,
                995
            ],
            [
                996,
                1014
            ],
            [
                1014,
                1016
            ],
            [
                1016,
                1068
            ],
            [
                1068,
                1094
            ],
            [
                1094,
                1101
            ],
            [
                1102,
                1126
            ],
            [
                1126,
                1137
            ],
            [
                1137,
                1152
            ],
            [
                1165,
                1169
            ],
            [
                1170,
                1236
            ],
            [
                1236,
                1333
            ],
            [
                1343,
                1376
            ],
            [
                1380,
                1393
            ],
            [
                1393,
                1406
            ],
            [
                1413,
                1414
            ],
            [
                1415,
                1456
            ],
            [
                1456,
                1554
            ],
            [
                1554,
                1589
            ],
            [
                1589,
                1596
            ],
            [
                1600,
                1669
            ],
            [
                1669,
                1670
            ],
            [
                1680,
                1689
            ],
            [
                1694,
                1702
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1747
            ],
            [
                1749,
                1763
            ],
            [
                1764,
                1770
            ],
            [
                1770,
                1774
            ],
            [
                1775,
                1840
            ],
            [
                1840,
                1881
            ],
            [
                1883,
                1935
            ],
            [
                1935,
                1942
            ],
            [
                1943,
                1969
            ],
            [
                1969,
                1997
            ],
            [
                1997,
                2025
            ],
            [
                2025,
                2076
            ],
            [
                2078,
                2123
            ],
            [
                2133,
                2135
            ],
            [
                2142,
                2159
            ],
            [
                2160,
                2184
            ],
            [
                2188,
                2192
            ],
            [
                2192,
                2195
            ],
            [
                2204,
                2215
            ],
            [
                2216,
                2233
            ],
            [
                2236,
                2248
            ],
            [
                2254,
                2255
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                137
            ],
            [
                137,
                270
            ],
            [
                270,
                331
            ],
            [
                331,
                455
            ],
            [
                455,
                455
            ],
            [
                455,
                455
            ],
            [
                455,
                525
            ],
            [
                525,
                541
            ],
            [
                541,
                567
            ],
            [
                567,
                609
            ],
            [
                609,
                677
            ],
            [
                677,
                677
            ],
            [
                677,
                677
            ],
            [
                677,
                725
            ],
            [
                725,
                838
            ],
            [
                838,
                838
            ],
            [
                838,
                974
            ],
            [
                974,
                1016
            ],
            [
                1016,
                1068
            ],
            [
                1068,
                1094
            ],
            [
                1094,
                1126
            ],
            [
                1126,
                1236
            ],
            [
                1236,
                1393
            ],
            [
                1393,
                1456
            ],
            [
                1456,
                1554
            ],
            [
                1554,
                1589
            ],
            [
                1589,
                1589
            ],
            [
                1589,
                1589
            ],
            [
                1589,
                1589
            ],
            [
                1589,
                1704
            ],
            [
                1704,
                1732
            ],
            [
                1732,
                1770
            ],
            [
                1770,
                1770
            ],
            [
                1770,
                1840
            ],
            [
                1840,
                1883
            ],
            [
                1883,
                1935
            ],
            [
                1935,
                1969
            ],
            [
                1969,
                2025
            ],
            [
                2025,
                2135
            ],
            [
                2135,
                2195
            ],
            [
                2195,
                2255
            ]
        ]
    }
}