{
    "original": {
        "text": "\"If some mortal, born too soon, Were laid away in some great trance--the ages Coming and going all the while--till dawned His true time's advent; and could then record The words they spoke who kept watch by his bed, Then I might tell more of the breath so light Upon my eyelids, and the fingers warm Among my hair. Youth is confused; yet never So dull was I but, when that spirit passed, I turned to him, scarce consciously, as turns A water-snake when fairies cross his sleep.\" --BROWNING: _Paracelsus_.\nThis was the letter which Sir Hugo put into Deronda's hands:,\nTO MY SON, DANIEL DERONDA.\nMy good friend and yours, Sir Hugo Mallinger, will have told you that I wish to see you. My health is shaken, and I desire there should be no time lost before I deliver to you what I have long withheld. Let nothing hinder you from being at the _Albergo dell' Italia_ in Genoa by the fourteenth of this month. Wait for me there. I am uncertain when I shall be able to make the journey from Spezia, where I shall be staying. That will depend on several things. Wait for me--the Princess Halm-Eberstein. Bring with you the diamond ring that Sir Hugo gave you. I shall like to see it again.--Your unknown mother,\nLEONORA HALM-EBERSTEIN.\nThis letter with its colorless wording gave Deronda no clue to what was in reserve for him; but he could not do otherwise than accept Sir Hugo's reticence, which seemed to imply some pledge not to anticipate the mother's disclosures; and the discovery that his life-long conjectures had been mistaken checked further surmise. Deronda could not hinder his imagination from taking a quick flight over what seemed possibilities, but he refused to contemplate any of them as more likely than another, lest he should be nursing it into a dominant desire or repugnance, instead of simply preparing himself with resolve to meet the fact bravely, whatever it might turn out to be.\nIn this state of mind he could not have communicated to any one the reason for the absence which in some quarters he was obliged to mention beforehand, least of all to Mordecai, whom it would affect as powerfully as it did himself, only in rather a different way. If he were to say, \"I am going to learn the truth about my birth,\" Mordecai's hope would gather what might prove a painful, dangerous excitement. To exclude suppositions, he spoke of his journey as being undertaken by Sir Hugo's wish, and threw as much indifference as he could into his manner of announcing it, saying he was uncertain of its duration, but it would perhaps be very short.\n\"I will ask to have the child Jacob to stay with me,\" said Mordecai, comforting himself in this way, after the first mournful glances.\n\"I will drive round and ask Mrs. Cohen to let him come,\" said Mirah.\n\"The grandmother will deny you nothing,\" said Deronda. \"I'm glad you were a little wrong as well as I,\" he added, smiling at Mordecai. \"You thought that old Mrs. Cohen would not bear to see Mirah.\"\n\"I undervalued her heart,\" said Mordecai. \"She is capable of rejoicing that another's plant blooms though her own be withered.\"\n\"Oh, they are dear good people; I feel as if we all belonged to each other,\" said Mirah, with a tinge of merriment in her smile.\n\"What should you have felt if that Ezra had been your brother?\" said Deronda, mischievously--a little provoked that she had taken kindly at once to people who had caused him so much prospective annoyance on her account.\nMirah looked at him with a slight surprise for a moment, and then said, \"He is not a bad man--I think he would never forsake any one.\" But when she uttered the words she blushed deeply, and glancing timidly at Mordecai, turned away to some occupation. Her father was in her mind, and this was a subject on which she and her brother had a painful mutual consciousness. \"If he should come and find us!\" was a thought which to Mirah sometimes made the street daylight as shadowy as a haunted forest where each turn screened for her an imaginary apparition.\nDeronda felt what was her involuntary allusion, and understood the blush. How could he be slow to understand feelings which now seemed nearer than ever to his own? for the words of his mother's letter implied that his filial relation was not to be freed from painful conditions; indeed, singularly enough that letter which had brought his mother nearer as a living reality had thrown her into more remoteness for his affections. The tender yearning after a being whose life might have been the worse for not having his care and love, the image of a mother who had not had all her dues, whether of reverence or compassion, had long been secretly present with him in his observation of all the women he had come near. But it seemed now that this picturing of his mother might fit the facts no better than his former conceptions about Sir Hugo. He wondered to find that when this mother's very hand-writing had come to him with words holding her actual feeling, his affections had suddenly shrunk into a state of comparative neutrality toward her. A veiled figure with enigmatic speech had thrust away that image which, in spite of uncertainty, his clinging thought had gradually modeled and made the possessor of his tenderness and duteous longing. When he set off to Genoa, the interest really uppermost in his mind had hardly so much relation to his mother as to Mordecai and Mirah.\n\"God bless you, Dan!\" Sir Hugo had said, when they shook hands. \"Whatever else changes for you, it can't change my being the oldest friend you have known, and the one who has all along felt the most for you. I couldn't have loved you better if you'd been my own--only I should have been better pleased with thinking of you always as the future master of the Abbey instead of my fine nephew; and then you would have seen it necessary for you to take a political line. However--things must be as they may.\" It was a defensive movement of the baronet's to mingle purposeless remarks with the expression of serious feeling.\nWhen Deronda arrived at the _Italia_ in Genoa, no Princess Halm-Eberstein was there; but on the second day there was a letter for him, saying that her arrival might happen within a week, or might be deferred a fortnight and more; she was under circumstances which made it impossible for her to fix her journey more precisely, and she entreated him to wait as patiently as he could.\nWith this indefinite prospect of suspense on matters of supreme moment to him, Deronda set about the difficult task of seeking amusement on philosophic grounds, as a means of quieting excited feeling and giving patience a lift over a weary road. His former visit to the superb city had been only cursory, and left him much to learn beyond the prescribed round of sight-seeing, by spending the cooler hours in observant wandering about the streets, the quay, and the environs; and he often took a boat that he might enjoy the magnificent view of the city and harbor from the sea. All sights, all subjects, even the expected meeting with his mother, found a central union in Mordecai and Mirah, and the ideas immediately associated with them; and among the thoughts that most filled his mind while his boat was pushing about within view of the grand harbor was that of the multitudinous Spanish Jews centuries ago driven destitute from their Spanish homes, suffered to land from the crowded ships only for a brief rest on this grand quay of Genoa, overspreading it with a pall of famine and plague--dying mothers and dying children at their breasts--fathers and sons a-gaze at each other's haggardness, like groups from a hundred Hunger-towers turned out beneath the midday sun. Inevitably dreamy constructions of a possible ancestry for himself would weave themselves with historic memories which had begun to have a new interest for him on his discovery of Mirah, and now, under the influence of Mordecai, had become irresistibly dominant. He would have sealed his mind against such constructions if it had been possible, and he had never yet fully admitted to himself that he wished the facts to verify Mordecai's conviction: he inwardly repeated that he had no choice in the matter, and that wishing was folly--nay, on the question of parentage, wishing seemed part of that meanness which disowns kinship: it was a disowning by anticipation. What he had to do was simply to accept the fact; and he had really no strong presumption to go upon, now that he was assured of his mistake about Sir Hugo. There had been a resolved concealment which made all inference untrustworthy, and the very name he bore might be a false one. If Mordecai was wrong--if he, the so-called Daniel Deronda, were held by ties entirely aloof from any such course as his friend's pathetic hope had marked out?--he would not say \"I wish\"; but he could not help feeling on which side the sacrifice lay.\nAcross these two importunate thoughts, which he resisted as much as one can resist anything in that unstrung condition which belongs to suspense, there came continually an anxiety which he made no effort to banish--dwelling on it rather with a mournfulness, which often seems to us the best atonement we can make to one whose need we have been unable to meet. The anxiety was for Gwendolen. In the wonderful mixtures of our nature there is a feeling distinct from that exclusive passionate love of which some men and women (by no means all) are capable, which yet is not the same with friendship, nor with a merely benevolent regard, whether admiring or compassionate: a man, say--for it is a man who is here concerned--hardly represents to himself this shade of feeling toward a woman more nearly than in words, \"I should have loved her, if----\": the \"if\" covering some prior growth in the inclinations, or else some circumstances which have made an inward prohibitory law as a stay against the emotions ready to quiver out of balance. The \"if\" in Deronda's case carried reasons of both kinds; yet he had never throughout his relations with Gwendolen been free from the nervous consciousness that there was something to guard against not only on her account but on his own--some precipitancy in the manifestations of impulsive feeling--some ruinous inroad of what is but momentary on the permanent chosen treasure of the heart--some spoiling of her trust, which wrought upon him now as if it had been the retreating cry of a creature snatched and carried out of his reach by swift horsemen or swifter waves, while his own strength was only a stronger sense of weakness. How could his feelings for Gwendolen ever be exactly like his feelings for other women, even when there was one by whose side he desired to stand apart from them? Strangely the figure entered into the pictures of his present and future; strangely (and now it seemed sadly) their two lots had come in contact, hers narrowly personal, his charged with far-reaching sensibilities, perhaps with durable purposes, which were hardly more present to her than the reasons why men migrate are present to the birds that come as usual for the crumbs and find them no more. Not that Deronda was too ready to imagine himself of supreme importance to a woman; but her words of insistence that he must \"remain near her--must not forsake her\"--continually recurred to him with the clearness and importunity of imagined sounds, such as Dante has said pierce us like arrows whose points carry the sharpness of pity,\n\"Lamenti saettaron me diversi Che di pieta ferrati avean gli strali\".\nDay after day passed, and the very air of Italy seemed to carry the consciousness that war had been declared against Austria, and every day was a hurrying march of crowded Time toward the world-changing battle of Sadowa. Meanwhile, in Genoa, the noons were getting hotter, the converging outer roads getting deeper with white dust, the oleanders in the tubs along the wayside gardens looking more and more like fatigued holiday-makers, and the sweet evening changing her office--scattering abroad those whom the midday had sent under shelter, and sowing all paths with happy social sounds, little tinklings of mule-bells and whirrings of thrumbed strings, light footsteps and voices, if not leisurely, then with the hurry of pleasure in them; while the encircling heights, crowned with forts, skirted with fine dwellings and gardens, seemed also to come forth and gaze in fullness of beauty after their long siesta, till all strong color melted in the stream of moonlight which made the Streets a new spectacle with shadows, both still and moving, on cathedral steps and against the faades of massive palaces; and then slowly with the descending moon all sank in deep night and silence, and nothing shone but the port lights of the great Lanterna in the blackness below, and the glimmering stars in the blackness above. Deronda, in his suspense, watched this revolving of the days as he might have watched a wonderful clock where the striking of the hours was made solemn with antique figures advancing and retreating in monitory procession, while he still kept his ear open for another kind of signal which would have its solemnity too: He was beginning to sicken of occupation, and found himself contemplating all activity with the aloofness of a prisoner awaiting ransom. In his letters to Mordecai and Hans, he had avoided writing about himself, but he was really getting into that state of mind to which all subjects become personal; and the few books he had brought to make him a refuge in study were becoming unreadable, because the point of view that life would make for him was in that agitating moment of uncertainty which is close upon decision.\nMany nights were watched through by him in gazing from the open window of his room on the double, faintly pierced darkness of the sea and the heavens; often in struggling under the oppressive skepticism which represented his particular lot, with all the importance he was allowing Mordecai to give it, as of no more lasting effect than a dream--a set of changes which made passion to him, but beyond his consciousness were no more than an imperceptible difference of mass and shadow; sometimes with a reaction of emotive force which gave even to sustained disappointment, even to the fulfilled demand of sacrifice, the nature of a satisfied energy, and spread over his young future, whatever it might be, the attraction of devoted service; sometimes with a sweet irresistible hopefulness that the very best of human possibilities might befall him--the blending of a complete personal love in one current with a larger duty; and sometimes again in a mood of rebellion (what human creature escapes it?) against things in general because they are thus and not otherwise, a mood in which Gwendolen and her equivocal fate moved as busy images of what was amiss in the world along with the concealments which he had felt as a hardship in his own life, and which were acting in him now under the form of an afflicting doubtfulness about the mother who had announced herself coldly and still kept away.\nBut at last she was come. One morning in his third week of waiting there was a new kind of knock at the door. A servant in Chasseurs livery entered and delivered in French the verbal message that, the Princess Halm-Eberstein had arrived, that she was going to rest during the day, but would be obliged if Monsieur would dine early, so as to be at liberty at seven, when she would be able to receive him.",
        "paragraph_chars": [
            [
                0,
                505
            ],
            [
                505,
                567
            ],
            [
                567,
                594
            ],
            [
                594,
                1203
            ],
            [
                1203,
                1227
            ],
            [
                1227,
                1900
            ],
            [
                1900,
                2553
            ],
            [
                2553,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2955
            ],
            [
                2955,
                3083
            ],
            [
                3083,
                3212
            ],
            [
                3212,
                3432
            ],
            [
                3432,
                3986
            ],
            [
                3986,
                5369
            ],
            [
                5369,
                5989
            ],
            [
                5989,
                6371
            ],
            [
                6371,
                8848
            ],
            [
                8848,
                11417
            ],
            [
                11417,
                11487
            ],
            [
                11487,
                13644
            ],
            [
                13644,
                15039
            ],
            [
                15039,
                15442
            ]
        ],
        "segment_chars": [
            [
                0,
                315
            ],
            [
                315,
                479
            ],
            [
                479,
                505
            ],
            [
                505,
                567
            ],
            [
                567,
                594
            ],
            [
                594,
                683
            ],
            [
                683,
                797
            ],
            [
                797,
                903
            ],
            [
                903,
                922
            ],
            [
                922,
                1017
            ],
            [
                1017,
                1053
            ],
            [
                1053,
                1095
            ],
            [
                1095,
                1151
            ],
            [
                1151,
                1203
            ],
            [
                1203,
                1227
            ],
            [
                1227,
                1553
            ],
            [
                1553,
                1900
            ],
            [
                1900,
                2164
            ],
            [
                2164,
                2310
            ],
            [
                2310,
                2553
            ],
            [
                2553,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2812
            ],
            [
                2812,
                2892
            ],
            [
                2892,
                2955
            ],
            [
                2955,
                2997
            ],
            [
                2997,
                3083
            ],
            [
                3083,
                3212
            ],
            [
                3212,
                3276
            ],
            [
                3276,
                3432
            ],
            [
                3432,
                3567
            ],
            [
                3567,
                3684
            ],
            [
                3684,
                3800
            ],
            [
                3800,
                3833
            ],
            [
                3833,
                3986
            ],
            [
                3986,
                4060
            ],
            [
                4060,
                4150
            ],
            [
                4150,
                4415
            ],
            [
                4415,
                4702
            ],
            [
                4702,
                4828
            ],
            [
                4828,
                5031
            ],
            [
                5031,
                5233
            ],
            [
                5233,
                5369
            ],
            [
                5369,
                5391
            ],
            [
                5391,
                5433
            ],
            [
                5433,
                5577
            ],
            [
                5577,
                5836
            ],
            [
                5836,
                5874
            ],
            [
                5874,
                5989
            ],
            [
                5989,
                6371
            ],
            [
                6371,
                6617
            ],
            [
                6617,
                6950
            ],
            [
                6950,
                7648
            ],
            [
                7648,
                7911
            ],
            [
                7911,
                8315
            ],
            [
                8315,
                8471
            ],
            [
                8471,
                8597
            ],
            [
                8597,
                8848
            ],
            [
                8848,
                9208
            ],
            [
                9208,
                9239
            ],
            [
                9239,
                9885
            ],
            [
                9885,
                10519
            ],
            [
                10519,
                10682
            ],
            [
                10682,
                11081
            ],
            [
                11081,
                11417
            ],
            [
                11417,
                11487
            ],
            [
                11487,
                11708
            ],
            [
                11708,
                12807
            ],
            [
                12807,
                13262
            ],
            [
                13262,
                13644
            ],
            [
                13644,
                14645
            ],
            [
                14645,
                15039
            ],
            [
                15039,
                15065
            ],
            [
                15065,
                15149
            ],
            [
                15149,
                15442
            ]
        ],
        "overlap_chars": [
            [
                505,
                539
            ],
            [
                549,
                556
            ],
            [
                570,
                594
            ],
            [
                597,
                608
            ],
            [
                618,
                683
            ],
            [
                683,
                716
            ],
            [
                733,
                740
            ],
            [
                746,
                797
            ],
            [
                831,
                837
            ],
            [
                839,
                859
            ],
            [
                861,
                903
            ],
            [
                903,
                922
            ],
            [
                922,
                1017
            ],
            [
                1017,
                1053
            ],
            [
                1053,
                1064
            ],
            [
                1066,
                1095
            ],
            [
                1095,
                1151
            ],
            [
                1151,
                1179
            ],
            [
                1182,
                1203
            ],
            [
                1203,
                1225
            ],
            [
                1227,
                1247
            ],
            [
                1253,
                1294
            ],
            [
                1314,
                1317
            ],
            [
                1551,
                1553
            ],
            [
                1729,
                1731
            ],
            [
                1561,
                1570
            ],
            [
                1638,
                1670
            ],
            [
                1683,
                1697
            ],
            [
                1703,
                1709
            ],
            [
                1802,
                1808
            ],
            [
                1819,
                1826
            ],
            [
                1840,
                1900
            ],
            [
                1922,
                1934
            ],
            [
                1964,
                1978
            ],
            [
                1983,
                1990
            ],
            [
                2050,
                2064
            ],
            [
                2068,
                2139
            ],
            [
                2147,
                2164
            ],
            [
                2164,
                2241
            ],
            [
                2265,
                2270
            ],
            [
                2308,
                2310
            ],
            [
                2335,
                2398
            ],
            [
                2409,
                2429
            ],
            [
                2399,
                2402
            ],
            [
                2430,
                2441
            ],
            [
                2551,
                2553
            ],
            [
                2553,
                2620
            ],
            [
                2686,
                2688
            ],
            [
                2688,
                2695
            ],
            [
                2712,
                2757
            ],
            [
                2757,
                2812
            ],
            [
                2812,
                2830
            ],
            [
                2840,
                2845
            ],
            [
                2858,
                2892
            ],
            [
                2892,
                2955
            ],
            [
                2955,
                2997
            ],
            [
                2997,
                3083
            ],
            [
                3083,
                3176
            ],
            [
                3188,
                3197
            ],
            [
                3210,
                3212
            ],
            [
                3212,
                3276
            ],
            [
                3276,
                3288
            ],
            [
                3290,
                3303
            ],
            [
                3430,
                3432
            ],
            [
                3432,
                3456
            ],
            [
                3459,
                3474
            ],
            [
                3487,
                3492
            ],
            [
                3498,
                3524
            ],
            [
                3526,
                3556
            ],
            [
                3564,
                3567
            ],
            [
                3598,
                3617
            ],
            [
                3622,
                3650
            ],
            [
                3684,
                3710
            ],
            [
                3798,
                3800
            ],
            [
                3800,
                3813
            ],
            [
                3823,
                3833
            ],
            [
                3833,
                3852
            ],
            [
                3862,
                3871
            ],
            [
                3913,
                3920
            ],
            [
                3856,
                3861
            ],
            [
                3984,
                3986
            ],
            [
                3986,
                3993
            ],
            [
                4038,
                4058
            ],
            [
                4032,
                4033
            ],
            [
                4008,
                4011
            ],
            [
                4095,
                4103
            ],
            [
                4114,
                4120
            ],
            [
                4138,
                4148
            ],
            [
                4058,
                4059
            ],
            [
                4291,
                4338
            ],
            [
                4351,
                4362
            ],
            [
                4370,
                4373
            ],
            [
                4379,
                4383
            ],
            [
                4399,
                4415
            ],
            [
                4415,
                4440
            ],
            [
                4535,
                4541
            ],
            [
                4608,
                4638
            ],
            [
                4644,
                4673
            ],
            [
                4678,
                4683
            ],
            [
                4700,
                4702
            ],
            [
                4702,
                4729
            ],
            [
                4740,
                4759
            ],
            [
                4760,
                4773
            ],
            [
                4925,
                4928
            ],
            [
                5052,
                5061
            ],
            [
                5069,
                5095
            ],
            [
                4789,
                4792
            ],
            [
                5224,
                5232
            ],
            [
                5989,
                6016
            ],
            [
                6258,
                6260
            ],
            [
                6026,
                6077
            ],
            [
                6096,
                6135
            ],
            [
                6219,
                6222
            ],
            [
                6148,
                6153
            ],
            [
                6161,
                6174
            ],
            [
                6176,
                6178
            ],
            [
                6313,
                6318
            ],
            [
                6323,
                6326
            ],
            [
                6333,
                6344
            ],
            [
                6348,
                6357
            ],
            [
                6369,
                6371
            ],
            [
                6376,
                6380
            ],
            [
                6404,
                6412
            ],
            [
                6448,
                6507
            ],
            [
                6532,
                6554
            ],
            [
                6571,
                6617
            ],
            [
                6877,
                6879
            ],
            [
                6760,
                6779
            ],
            [
                6790,
                6805
            ],
            [
                6634,
                6636
            ],
            [
                6806,
                6817
            ],
            [
                6676,
                6679
            ],
            [
                6819,
                6827
            ],
            [
                6845,
                6871
            ],
            [
                6694,
                6696
            ],
            [
                6886,
                6924
            ],
            [
                6936,
                6949
            ],
            [
                7044,
                7062
            ],
            [
                7537,
                7538
            ],
            [
                7041,
                7043
            ],
            [
                7007,
                7010
            ],
            [
                7126,
                7134
            ],
            [
                7110,
                7115
            ],
            [
                7161,
                7218
            ],
            [
                6960,
                6961
            ],
            [
                7238,
                7282
            ],
            [
                6974,
                6975
            ],
            [
                7283,
                7299
            ],
            [
                7456,
                7459
            ],
            [
                7300,
                7310
            ],
            [
                7319,
                7324
            ],
            [
                7352,
                7365
            ],
            [
                7062,
                7067
            ],
            [
                7366,
                7370
            ],
            [
                7375,
                7415
            ],
            [
                7646,
                7648
            ],
            [
                7648,
                7658
            ],
            [
                7833,
                7834
            ],
            [
                7659,
                7682
            ],
            [
                7811,
                7814
            ],
            [
                7685,
                7702
            ],
            [
                7715,
                7742
            ],
            [
                7842,
                7843
            ],
            [
                7761,
                7770
            ],
            [
                7785,
                7807
            ],
            [
                7828,
                7833
            ],
            [
                7835,
                7838
            ],
            [
                7867,
                7875
            ],
            [
                7909,
                7911
            ],
            [
                7997,
                8182
            ],
            [
                8313,
                8315
            ],
            [
                8320,
                8326
            ],
            [
                8337,
                8362
            ],
            [
                8469,
                8470
            ],
            [
                8848,
                8860
            ],
            [
                8877,
                8885
            ],
            [
                8992,
                9016
            ],
            [
                9020,
                9061
            ],
            [
                9078,
                9084
            ],
            [
                8885,
                8886
            ],
            [
                8893,
                8895
            ],
            [
                9072,
                9077
            ],
            [
                9085,
                9104
            ],
            [
                9106,
                9167
            ],
            [
                9179,
                9201
            ],
            [
                9206,
                9208
            ],
            [
                9208,
                9239
            ],
            [
                9290,
                9297
            ],
            [
                9529,
                9532
            ],
            [
                9327,
                9342
            ],
            [
                9400,
                9401
            ],
            [
                9408,
                9411
            ],
            [
                9415,
                9427
            ],
            [
                9822,
                9824
            ],
            [
                9433,
                9444
            ],
            [
                9499,
                9501
            ],
            [
                9454,
                9480
            ],
            [
                9517,
                9522
            ],
            [
                9597,
                9601
            ],
            [
                9611,
                9618
            ],
            [
                9239,
                9245
            ],
            [
                9654,
                9689
            ],
            [
                9693,
                9718
            ],
            [
                9832,
                9884
            ],
            [
                9897,
                9904
            ],
            [
                9950,
                10082
            ],
            [
                10455,
                10456
            ],
            [
                10083,
                10121
            ],
            [
                10166,
                10175
            ],
            [
                10230,
                10232
            ],
            [
                10463,
                10466
            ],
            [
                10190,
                10194
            ],
            [
                10294,
                10303
            ],
            [
                9894,
                9896
            ],
            [
                10303,
                10310
            ],
            [
                10319,
                10331
            ],
            [
                10350,
                10420
            ],
            [
                10517,
                10519
            ],
            [
                10519,
                10664
            ],
            [
                10680,
                10682
            ],
            [
                11090,
                11097
            ],
            [
                11081,
                11084
            ],
            [
                11115,
                11130
            ],
            [
                11112,
                11114
            ],
            [
                11131,
                11155
            ],
            [
                11158,
                11163
            ],
            [
                11328,
                11329
            ],
            [
                11182,
                11222
            ],
            [
                11224,
                11245
            ],
            [
                11259,
                11279
            ],
            [
                11284,
                11293
            ],
            [
                11487,
                11512
            ],
            [
                11719,
                11763
            ],
            [
                11775,
                11944
            ],
            [
                12034,
                12040
            ],
            [
                11513,
                11516
            ],
            [
                12045,
                12061
            ],
            [
                12084,
                12111
            ],
            [
                12125,
                12128
            ],
            [
                11526,
                11528
            ],
            [
                12134,
                12169
            ],
            [
                12228,
                12292
            ],
            [
                12312,
                12327
            ],
            [
                12333,
                12346
            ],
            [
                12356,
                12418
            ],
            [
                12425,
                12438
            ],
            [
                12449,
                12458
            ],
            [
                11706,
                11707
            ],
            [
                12601,
                12806
            ],
            [
                12807,
                12904
            ],
            [
                12964,
                12971
            ],
            [
                12905,
                12910
            ],
            [
                13165,
                13262
            ],
            [
                13262,
                13301
            ],
            [
                13306,
                13354
            ],
            [
                13480,
                13482
            ],
            [
                13368,
                13386
            ],
            [
                13574,
                13576
            ],
            [
                13390,
                13458
            ],
            [
                13467,
                13470
            ],
            [
                13489,
                13493
            ],
            [
                13503,
                13513
            ],
            [
                13582,
                13591
            ],
            [
                13602,
                13613
            ],
            [
                13642,
                13644
            ],
            [
                13644,
                13655
            ],
            [
                13883,
                13884
            ],
            [
                13909,
                13911
            ],
            [
                13694,
                13800
            ],
            [
                13804,
                13835
            ],
            [
                14006,
                14016
            ],
            [
                13680,
                13683
            ],
            [
                13995,
                13997
            ],
            [
                13865,
                13868
            ],
            [
                13880,
                13883
            ],
            [
                13946,
                13987
            ],
            [
                14126,
                14142
            ],
            [
                14080,
                14082
            ],
            [
                14145,
                14153
            ],
            [
                14171,
                14189
            ],
            [
                14200,
                14214
            ],
            [
                14259,
                14490
            ],
            [
                14492,
                14532
            ],
            [
                14548,
                14610
            ],
            [
                14645,
                14745
            ],
            [
                14756,
                14840
            ],
            [
                14873,
                14889
            ],
            [
                13847,
                13852
            ],
            [
                14919,
                14922
            ],
            [
                14028,
                14031
            ],
            [
                13885,
                13889
            ],
            [
                14955,
                14960
            ],
            [
                14968,
                15039
            ],
            [
                15039,
                15065
            ],
            [
                15065,
                15117
            ],
            [
                15130,
                15149
            ],
            [
                15149,
                15150
            ],
            [
                15151,
                15158
            ],
            [
                15179,
                15200
            ],
            [
                15211,
                15214
            ],
            [
                15222,
                15234
            ],
            [
                15236,
                15358
            ],
            [
                15380,
                15442
            ]
        ],
        "row_chars": [
            [
                0,
                315
            ],
            [
                315,
                479
            ],
            [
                479,
                505
            ],
            [
                505,
                567
            ],
            [
                567,
                594
            ],
            [
                594,
                683
            ],
            [
                683,
                797
            ],
            [
                797,
                903
            ],
            [
                903,
                922
            ],
            [
                922,
                1017
            ],
            [
                1017,
                1053
            ],
            [
                1053,
                1095
            ],
            [
                1095,
                1151
            ],
            [
                1151,
                1203
            ],
            [
                1203,
                1227
            ],
            [
                1227,
                1553
            ],
            [
                1553,
                1900
            ],
            [
                1900,
                2164
            ],
            [
                2164,
                2310
            ],
            [
                2310,
                2553
            ],
            [
                2553,
                2688
            ],
            [
                2688,
                2757
            ],
            [
                2757,
                2812
            ],
            [
                2812,
                2892
            ],
            [
                2892,
                2955
            ],
            [
                2955,
                2997
            ],
            [
                2997,
                3083
            ],
            [
                3083,
                3212
            ],
            [
                3212,
                3276
            ],
            [
                3276,
                3432
            ],
            [
                3432,
                3567
            ],
            [
                3567,
                3800
            ],
            [
                3800,
                3833
            ],
            [
                3833,
                3986
            ],
            [
                3986,
                4150
            ],
            [
                4150,
                4415
            ],
            [
                4415,
                4702
            ],
            [
                4702,
                5233
            ],
            [
                5233,
                5369
            ],
            [
                5369,
                5391
            ],
            [
                5391,
                5433
            ],
            [
                5433,
                5577
            ],
            [
                5577,
                5836
            ],
            [
                5836,
                5874
            ],
            [
                5874,
                5989
            ],
            [
                5989,
                6371
            ],
            [
                6371,
                6617
            ],
            [
                6617,
                6950
            ],
            [
                6950,
                7648
            ],
            [
                7648,
                7911
            ],
            [
                7911,
                8315
            ],
            [
                8315,
                8471
            ],
            [
                8471,
                8597
            ],
            [
                8597,
                8848
            ],
            [
                8848,
                9208
            ],
            [
                9208,
                9239
            ],
            [
                9239,
                9885
            ],
            [
                9885,
                10519
            ],
            [
                10519,
                10682
            ],
            [
                10682,
                11081
            ],
            [
                11081,
                11417
            ],
            [
                11417,
                11487
            ],
            [
                11487,
                12807
            ],
            [
                12807,
                13262
            ],
            [
                13262,
                13644
            ],
            [
                13644,
                15039
            ],
            [
                15039,
                15065
            ],
            [
                15065,
                15149
            ],
            [
                15149,
                15442
            ]
        ]
    },
    "abridged": {
        "text": "This was the letter which Sir Hugo gave to Deronda:-\n'TO MY SON, DANIEL DERONDA.\n'My good friend, Sir Hugo Mallinger, will have told you that I wish to see you. My health is shaken, and I desire to lose no time before I deliver to you what I have long withheld. Be at the Albergo dell' Italia in Genoa by the fourteenth of this month. Wait for me there. I am uncertain when I shall be able to make the journey from Spezia, where I shall be staying. That will depend on several things. Wait for me: the Princess Halm-Eberstein. Bring with you the diamond ring that Sir Hugo gave you. I shall like to see it again. Your unknown mother,\n'LEONORA HALM-EBERSTEIN.'\nThis letter with its colourless wording gave Deronda no clue to what awaited him. He could not help imagining possibilities, but he refused to regard any of them as likely. He simply attempted to prepare himself to meet the fact bravely, whatever it might turn out to be.\nHe could not tell anyone the reason for his absence, least of all Mordecai, whom it would affect as powerfully as it did himself, only in a different way. If he were to say, \"I am going to learn the truth about my birth,\" Mordecai's hopes might be dangerously excited. So he spoke of his journey as being undertaken by Sir Hugo's wish, with as much indifference and vagueness as he could.\n\"I will ask to have the child Jacob to stay with me,\" said Mordecai.\n\"I will ask Mrs. Cohen to let him come,\" said Mirah.\n\"The grandmother will deny you nothing,\" said Deronda. \"I'm glad you were wrong,\" he added, smiling at Mordecai. \"You thought that old Mrs. Cohen would not bear to see Mirah.\"\n\"I undervalued her heart,\" said Mordecai. \"She is capable of rejoicing that another's plant blooms though her own be withered.\"\n\"Oh, they are dear good people; I feel as if we all belonged to each other,\" said Mirah, with merriment.\n\"What should you have felt if that Ezra had been your brother?\" said Deronda mischievously.\nMirah looked at him with slight surprise, and said, \"He is not a bad man - I think he would never forsake anyone.\" Then she blushed deeply, glancing timidly at Mordecai: her father was in her mind. \"If he should find us!\" was a thought which sometimes haunted Mirah.\nDeronda understood the blush, for her feelings about her parent seemed near to his own. That letter which had brought his mother nearer in reality had made her more remote in his affections. The tender yearning after an imagined mother had long been secretly present within him in his observation of all women. But it seemed now that this picture of his mother might not fit the facts: her enigmatic letter had thrust away that image created by his longing.\nWhen Deronda arrived at the Italia in Genoa, no Princess Halm-Eberstein was there; but there was a letter for him, saying that she might arrive within a week or two, and entreating him to wait patiently.\nUnder this suspense, Deronda set about the difficult task of seeking amusement as a means of quieting his excitement and giving patience a lift over a weary road. He spent the cooler hours in wandering about to observe the streets and the quay; and he often took a boat to enjoy the magnificent view of the city from the sea.\nMordecai and Mirah were ever-present in his thoughts; and while his boat was pushing about within view of the grand harbour, he imagined the multitudinous Spanish Jews centuries ago, driven destitute and starving from their homes into crowded ships, and allowed only a brief rest on this grand quay of Genoa. Inevitably, dreamy constructions of his possible ancestry would weave themselves with this history, which had acquired a new interest for him since meeting Mirah and Mordecai. He had never yet fully admitted to himself that he wished the facts to verify Mordecai's conviction: he inwardly repeated that he had no choice in the matter, and that wishing was folly. He had simply to accept the fact.\nAcross these thoughts, there came continually another anxiety which he made no effort to banish. Rather, he dwelt on it with a mournfulness which often seems to us the best atonement we can make to one whom we have been unable to help. The anxiety was for Gwendolen. His feeling for her was not passionate love, yet was not the same as friendship, or a merely benevolent regard. A man may express this feeling in the words, \"I should have loved her, if\": the \"if\" covering some circumstance set against the emotions ready to quiver out of balance.\nDeronda had never throughout his relations with Gwendolen been free from the nervous consciousness that there was something to guard against, not only on her account but on his own - that any impulsive action on his part would ruin her trust in him, which worked upon him now like the retreating cry of a creature snatched and carried out of his reach. How could his feelings for Gwendolen ever be exactly like his feelings for other women, even when there was one by whose side he desired to stand? Although Deronda did not imagine himself to be of supreme importance to any woman, Gwendolen's insistence that he must \"remain near her - must not forsake her\" continually recurred to him with piercing clearness.\nDay after day passed, and in Genoa, the noons were getting hotter, the outer roads getting deeper with white dust, the oleanders in the tubs along the wayside gardens looking more and more like fatigued holiday-makers, and the sweet evening sowing the paths with happy tinklings of mule-bells and thrumming of strings, light footsteps and voices; while the encircling heights, crowned with forts, skirted with gardens, seemed to come forth in fullness of beauty after their long siesta, till all strong colour melted in the moonlight. Then slowly with the descending moon all sank in deep night and silence, and nothing shone but the port lights of the great Lanterna in the blackness below, and the glimmering stars in the blackness above.\nDeronda, in his suspense, watched this revolving of the days as he might have watched a wonderful antique clock, and found himself contemplating all activity with the aloofness of a prisoner awaiting ransom. In his letters to Mordecai and Hans, he avoided writing about himself, but he was really in that state of mind in which all subjects become personal; and the few books he had brought with him were unreadable in his agitating uncertainty.\nOn many nights, he gazed from the open window of his room on the double, faintly pierced darkness of the sea and the heavens; often struggling under the oppressive scepticism which made him think of his lot as of no more lasting effect than a dream; sometimes with an emotional reaction which gave even to disappointment the nature of a satisfied energy, and spread over his young future, whatever it might be, the attraction of devoted service; sometimes with a sweet irresistible hopefulness that the very best of human possibilities might befall him - the blending of a complete personal love with a larger duty; and sometimes again in a mood of rebellion against things in general because they are thus and not otherwise, a mood in which Gwendolen and her fate moved as busy images of what was amiss in the world along with the concealments in his own life, which now afflicted him with doubt about the mother who had announced herself coldly and still kept away.\nBut at last she was come. One morning in his third week of waiting there was a knock at the door. A liveried servant entered and delivered the message that the Princess Halm-Eberstein had arrived, that she was going to rest during the day, but would be obliged if Monsieur would be at liberty at seven, when she would be able to receive him.",
        "paragraph_chars": [
            [
                0,
                53
            ],
            [
                53,
                81
            ],
            [
                81,
                634
            ],
            [
                634,
                660
            ],
            [
                660,
                932
            ],
            [
                932,
                1321
            ],
            [
                1321,
                1390
            ],
            [
                1390,
                1443
            ],
            [
                1443,
                1619
            ],
            [
                1619,
                1747
            ],
            [
                1747,
                1852
            ],
            [
                1852,
                1944
            ],
            [
                1944,
                2211
            ],
            [
                2211,
                2669
            ],
            [
                2669,
                2873
            ],
            [
                2873,
                3199
            ],
            [
                3199,
                3905
            ],
            [
                3905,
                4453
            ],
            [
                4453,
                5166
            ],
            [
                5166,
                5907
            ],
            [
                5907,
                6353
            ],
            [
                6353,
                7321
            ],
            [
                7321,
                7662
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                81
            ],
            [
                81,
                161
            ],
            [
                161,
                262
            ],
            [
                262,
                335
            ],
            [
                335,
                354
            ],
            [
                354,
                449
            ],
            [
                449,
                485
            ],
            [
                485,
                527
            ],
            [
                527,
                583
            ],
            [
                583,
                613
            ],
            [
                613,
                634
            ],
            [
                634,
                660
            ],
            [
                660,
                742
            ],
            [
                742,
                833
            ],
            [
                833,
                932
            ],
            [
                932,
                1087
            ],
            [
                1087,
                1201
            ],
            [
                1201,
                1321
            ],
            [
                1321,
                1390
            ],
            [
                1390,
                1443
            ],
            [
                1443,
                1498
            ],
            [
                1498,
                1556
            ],
            [
                1556,
                1619
            ],
            [
                1619,
                1661
            ],
            [
                1661,
                1747
            ],
            [
                1747,
                1852
            ],
            [
                1852,
                1916
            ],
            [
                1916,
                1944
            ],
            [
                1944,
                2059
            ],
            [
                2059,
                2142
            ],
            [
                2142,
                2166
            ],
            [
                2166,
                2211
            ],
            [
                2211,
                2299
            ],
            [
                2299,
                2402
            ],
            [
                2402,
                2522
            ],
            [
                2522,
                2669
            ],
            [
                2669,
                2873
            ],
            [
                2873,
                3036
            ],
            [
                3036,
                3199
            ],
            [
                3199,
                3508
            ],
            [
                3508,
                3684
            ],
            [
                3684,
                3871
            ],
            [
                3871,
                3905
            ],
            [
                3905,
                4002
            ],
            [
                4002,
                4141
            ],
            [
                4141,
                4172
            ],
            [
                4172,
                4284
            ],
            [
                4284,
                4453
            ],
            [
                4453,
                4806
            ],
            [
                4806,
                4953
            ],
            [
                4953,
                5166
            ],
            [
                5166,
                5701
            ],
            [
                5701,
                5907
            ],
            [
                5907,
                6115
            ],
            [
                6115,
                6353
            ],
            [
                6353,
                7321
            ],
            [
                7321,
                7347
            ],
            [
                7347,
                7419
            ],
            [
                7419,
                7662
            ]
        ],
        "overlap_chars": [
            [
                0,
                34
            ],
            [
                43,
                50
            ],
            [
                57,
                81
            ],
            [
                85,
                96
            ],
            [
                96,
                161
            ],
            [
                161,
                194
            ],
            [
                203,
                210
            ],
            [
                211,
                262
            ],
            [
                265,
                271
            ],
            [
                272,
                292
            ],
            [
                293,
                335
            ],
            [
                335,
                354
            ],
            [
                354,
                449
            ],
            [
                449,
                485
            ],
            [
                485,
                496
            ],
            [
                498,
                527
            ],
            [
                527,
                583
            ],
            [
                583,
                611
            ],
            [
                613,
                634
            ],
            [
                635,
                657
            ],
            [
                660,
                680
            ],
            [
                687,
                728
            ],
            [
                737,
                740
            ],
            [
                740,
                742
            ],
            [
                742,
                744
            ],
            [
                745,
                754
            ],
            [
                770,
                802
            ],
            [
                810,
                824
            ],
            [
                825,
                831
            ],
            [
                836,
                842
            ],
            [
                864,
                871
            ],
            [
                872,
                932
            ],
            [
                932,
                944
            ],
            [
                957,
                971
            ],
            [
                976,
                983
            ],
            [
                983,
                997
            ],
            [
                998,
                1069
            ],
            [
                1070,
                1087
            ],
            [
                1087,
                1164
            ],
            [
                1171,
                1176
            ],
            [
                1199,
                1201
            ],
            [
                1204,
                1267
            ],
            [
                1273,
                1293
            ],
            [
                1294,
                1297
            ],
            [
                1308,
                1319
            ],
            [
                1319,
                1321
            ],
            [
                1321,
                1388
            ],
            [
                1388,
                1390
            ],
            [
                1390,
                1397
            ],
            [
                1398,
                1443
            ],
            [
                1443,
                1498
            ],
            [
                1498,
                1516
            ],
            [
                1517,
                1522
            ],
            [
                1522,
                1556
            ],
            [
                1556,
                1619
            ],
            [
                1619,
                1661
            ],
            [
                1661,
                1747
            ],
            [
                1747,
                1840
            ],
            [
                1841,
                1850
            ],
            [
                1850,
                1852
            ],
            [
                1852,
                1916
            ],
            [
                1916,
                1928
            ],
            [
                1929,
                1942
            ],
            [
                1942,
                1944
            ],
            [
                1944,
                1968
            ],
            [
                1969,
                1984
            ],
            [
                1984,
                1989
            ],
            [
                1990,
                2016
            ],
            [
                2019,
                2049
            ],
            [
                2056,
                2059
            ],
            [
                2064,
                2083
            ],
            [
                2084,
                2112
            ],
            [
                2114,
                2140
            ],
            [
                2140,
                2142
            ],
            [
                2142,
                2155
            ],
            [
                2156,
                2166
            ],
            [
                2166,
                2185
            ],
            [
                2186,
                2195
            ],
            [
                2196,
                2203
            ],
            [
                2204,
                2209
            ],
            [
                2209,
                2211
            ],
            [
                2211,
                2218
            ],
            [
                2219,
                2239
            ],
            [
                2239,
                2240
            ],
            [
                2245,
                2248
            ],
            [
                2249,
                2257
            ],
            [
                2275,
                2281
            ],
            [
                2287,
                2297
            ],
            [
                2297,
                2298
            ],
            [
                2299,
                2346
            ],
            [
                2350,
                2361
            ],
            [
                2367,
                2370
            ],
            [
                2371,
                2375
            ],
            [
                2386,
                2402
            ],
            [
                2402,
                2427
            ],
            [
                2440,
                2446
            ],
            [
                2447,
                2477
            ],
            [
                2485,
                2514
            ],
            [
                2515,
                2520
            ],
            [
                2520,
                2522
            ],
            [
                2522,
                2549
            ],
            [
                2558,
                2577
            ],
            [
                2582,
                2595
            ],
            [
                2597,
                2600
            ],
            [
                2601,
                2610
            ],
            [
                2618,
                2644
            ],
            [
                2656,
                2659
            ],
            [
                2660,
                2668
            ],
            [
                2669,
                2696
            ],
            [
                2697,
                2699
            ],
            [
                2704,
                2755
            ],
            [
                2756,
                2795
            ],
            [
                2796,
                2799
            ],
            [
                2800,
                2805
            ],
            [
                2813,
                2826
            ],
            [
                2827,
                2829
            ],
            [
                2833,
                2838
            ],
            [
                2839,
                2842
            ],
            [
                2850,
                2861
            ],
            [
                2862,
                2871
            ],
            [
                2871,
                2873
            ],
            [
                2879,
                2883
            ],
            [
                2884,
                2892
            ],
            [
                2892,
                2951
            ],
            [
                2952,
                2974
            ],
            [
                2990,
                3036
            ],
            [
                3036,
                3038
            ],
            [
                3045,
                3064
            ],
            [
                3065,
                3080
            ],
            [
                3081,
                3083
            ],
            [
                3092,
                3103
            ],
            [
                3104,
                3107
            ],
            [
                3108,
                3116
            ],
            [
                3116,
                3142
            ],
            [
                3143,
                3145
            ],
            [
                3146,
                3184
            ],
            [
                3185,
                3198
            ],
            [
                3199,
                3217
            ],
            [
                3227,
                3228
            ],
            [
                3236,
                3238
            ],
            [
                3239,
                3242
            ],
            [
                3243,
                3251
            ],
            [
                3251,
                3256
            ],
            [
                3257,
                3314
            ],
            [
                3322,
                3323
            ],
            [
                3336,
                3380
            ],
            [
                3380,
                3381
            ],
            [
                3382,
                3398
            ],
            [
                3399,
                3402
            ],
            [
                3412,
                3422
            ],
            [
                3423,
                3428
            ],
            [
                3434,
                3447
            ],
            [
                3447,
                3452
            ],
            [
                3461,
                3465
            ],
            [
                3466,
                3506
            ],
            [
                3506,
                3508
            ],
            [
                3508,
                3518
            ],
            [
                3518,
                3519
            ],
            [
                3520,
                3543
            ],
            [
                3544,
                3547
            ],
            [
                3548,
                3565
            ],
            [
                3566,
                3593
            ],
            [
                3606,
                3607
            ],
            [
                3608,
                3617
            ],
            [
                3627,
                3649
            ],
            [
                3664,
                3669
            ],
            [
                3670,
                3673
            ],
            [
                3674,
                3682
            ],
            [
                3682,
                3684
            ],
            [
                3684,
                3869
            ],
            [
                3869,
                3871
            ],
            [
                3871,
                3877
            ],
            [
                3878,
                3903
            ],
            [
                3903,
                3904
            ],
            [
                3905,
                3917
            ],
            [
                3918,
                3926
            ],
            [
                3926,
                3950
            ],
            [
                3959,
                4000
            ],
            [
                4002,
                4008
            ],
            [
                4008,
                4009
            ],
            [
                4010,
                4012
            ],
            [
                4019,
                4024
            ],
            [
                4025,
                4044
            ],
            [
                4045,
                4106
            ],
            [
                4112,
                4134
            ],
            [
                4139,
                4141
            ],
            [
                4141,
                4172
            ],
            [
                4176,
                4183
            ],
            [
                4184,
                4187
            ],
            [
                4200,
                4215
            ],
            [
                4215,
                4216
            ],
            [
                4217,
                4220
            ],
            [
                4225,
                4237
            ],
            [
                4238,
                4240
            ],
            [
                4241,
                4252
            ],
            [
                4253,
                4255
            ],
            [
                4256,
                4282
            ],
            [
                4284,
                4289
            ],
            [
                4302,
                4306
            ],
            [
                4307,
                4314
            ],
            [
                4315,
                4321
            ],
            [
                4322,
                4357
            ],
            [
                4357,
                4382
            ],
            [
                4400,
                4452
            ],
            [
                4453,
                4460
            ],
            [
                4461,
                4593
            ],
            [
                4593,
                4594
            ],
            [
                4595,
                4633
            ],
            [
                4645,
                4654
            ],
            [
                4662,
                4664
            ],
            [
                4665,
                4668
            ],
            [
                4680,
                4684
            ],
            [
                4685,
                4694
            ],
            [
                4695,
                4697
            ],
            [
                4701,
                4708
            ],
            [
                4716,
                4728
            ],
            [
                4734,
                4804
            ],
            [
                4804,
                4806
            ],
            [
                4806,
                4951
            ],
            [
                4951,
                4953
            ],
            [
                4962,
                4969
            ],
            [
                4974,
                4977
            ],
            [
                4978,
                4993
            ],
            [
                4994,
                4996
            ],
            [
                5000,
                5024
            ],
            [
                5029,
                5034
            ],
            [
                5034,
                5035
            ],
            [
                5048,
                5088
            ],
            [
                5091,
                5112
            ],
            [
                5125,
                5145
            ],
            [
                5155,
                5164
            ],
            [
                5166,
                5191
            ],
            [
                5192,
                5236
            ],
            [
                5237,
                5406
            ],
            [
                5407,
                5413
            ],
            [
                5414,
                5417
            ],
            [
                5418,
                5434
            ],
            [
                5435,
                5462
            ],
            [
                5463,
                5466
            ],
            [
                5473,
                5475
            ],
            [
                5476,
                5511
            ],
            [
                5511,
                5575
            ],
            [
                5576,
                5591
            ],
            [
                5592,
                5605
            ],
            [
                5606,
                5668
            ],
            [
                5676,
                5689
            ],
            [
                5690,
                5699
            ],
            [
                5699,
                5700
            ],
            [
                5701,
                5906
            ],
            [
                5907,
                6004
            ],
            [
                6005,
                6012
            ],
            [
                6013,
                6018
            ],
            [
                6018,
                6115
            ],
            [
                6115,
                6154
            ],
            [
                6155,
                6203
            ],
            [
                6204,
                6206
            ],
            [
                6207,
                6225
            ],
            [
                6226,
                6228
            ],
            [
                6229,
                6297
            ],
            [
                6303,
                6306
            ],
            [
                6307,
                6311
            ],
            [
                6312,
                6322
            ],
            [
                6330,
                6339
            ],
            [
                6340,
                6351
            ],
            [
                6351,
                6353
            ],
            [
                6356,
                6367
            ],
            [
                6367,
                6368
            ],
            [
                6369,
                6371
            ],
            [
                6378,
                6484
            ],
            [
                6485,
                6516
            ],
            [
                6528,
                6538
            ],
            [
                6539,
                6542
            ],
            [
                6549,
                6551
            ],
            [
                6552,
                6555
            ],
            [
                6556,
                6559
            ],
            [
                6560,
                6601
            ],
            [
                6601,
                6617
            ],
            [
                6618,
                6620
            ],
            [
                6631,
                6639
            ],
            [
                6640,
                6658
            ],
            [
                6659,
                6673
            ],
            [
                6674,
                6905
            ],
            [
                6908,
                6948
            ],
            [
                6949,
                7011
            ],
            [
                7012,
                7112
            ],
            [
                7113,
                7197
            ],
            [
                7198,
                7214
            ],
            [
                7215,
                7220
            ],
            [
                7221,
                7224
            ],
            [
                7235,
                7238
            ],
            [
                7239,
                7243
            ],
            [
                7244,
                7249
            ],
            [
                7250,
                7321
            ],
            [
                7321,
                7347
            ],
            [
                7347,
                7399
            ],
            [
                7400,
                7419
            ],
            [
                7419,
                7420
            ],
            [
                7430,
                7437
            ],
            [
                7438,
                7459
            ],
            [
                7460,
                7463
            ],
            [
                7464,
                7476
            ],
            [
                7477,
                7599
            ],
            [
                7600,
                7662
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                53
            ],
            [
                53,
                81
            ],
            [
                81,
                161
            ],
            [
                161,
                262
            ],
            [
                262,
                335
            ],
            [
                335,
                354
            ],
            [
                354,
                449
            ],
            [
                449,
                485
            ],
            [
                485,
                527
            ],
            [
                527,
                583
            ],
            [
                583,
                634
            ],
            [
                634,
                660
            ],
            [
                660,
                742
            ],
            [
                742,
                932
            ],
            [
                932,
                1087
            ],
            [
                1087,
                1201
            ],
            [
                1201,
                1321
            ],
            [
                1321,
                1390
            ],
            [
                1390,
                1443
            ],
            [
                1443,
                1498
            ],
            [
                1498,
                1556
            ],
            [
                1556,
                1619
            ],
            [
                1619,
                1661
            ],
            [
                1661,
                1747
            ],
            [
                1747,
                1852
            ],
            [
                1852,
                1916
            ],
            [
                1916,
                1944
            ],
            [
                1944,
                2059
            ],
            [
                2059,
                2142
            ],
            [
                2142,
                2166
            ],
            [
                2166,
                2211
            ],
            [
                2211,
                2299
            ],
            [
                2299,
                2402
            ],
            [
                2402,
                2522
            ],
            [
                2522,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2669
            ],
            [
                2669,
                2873
            ],
            [
                2873,
                3036
            ],
            [
                3036,
                3199
            ],
            [
                3199,
                3508
            ],
            [
                3508,
                3684
            ],
            [
                3684,
                3871
            ],
            [
                3871,
                3905
            ],
            [
                3905,
                3905
            ],
            [
                3905,
                3905
            ],
            [
                3905,
                4141
            ],
            [
                4141,
                4172
            ],
            [
                4172,
                4453
            ],
            [
                4453,
                4806
            ],
            [
                4806,
                4953
            ],
            [
                4953,
                4953
            ],
            [
                4953,
                5166
            ],
            [
                5166,
                5166
            ],
            [
                5166,
                5907
            ],
            [
                5907,
                6115
            ],
            [
                6115,
                6353
            ],
            [
                6353,
                7321
            ],
            [
                7321,
                7347
            ],
            [
                7347,
                7419
            ],
            [
                7419,
                7662
            ]
        ]
    }
}