{
    "original": {
        "text": "\"La mme fermet qui sert rsister l'amour sert aussi le rendre violent et durable; et les personnes faibles qui sont toujours agites des passions n'en sont presque jamais vritablement remplies.\" --LA ROCHEFOUCAULD.\nAmong Deronda's letters the next morning was one from Hans Meyrick of four quarto pages, in the small, beautiful handwriting which ran in the Meyrick family.\nMY DEAR DERONDA,--In return for your sketch of Italian movements and your view of the world's affairs generally, I may say that here at home the most judicious opinion going as to the effects of present causes is that \"time will show.\" As to the present causes of past effects, it is now seen that the late swindling telegrams account for the last year's cattle plague--which is a refutation of philosophy falsely so called, and justifies the compensation to the farmers. My own idea that a murrain will shortly break out in the commercial class, and that the cause will subsequently disclose itself in the ready sale of all rejected pictures, has been called an unsound use of analogy; but there are minds that will not hesitate to rob even the neglected painter of his solace. To my feeling there is great beauty in the conception that some bad judge might give a high price for my Berenice series, and that the men in the city would have already been punished for my ill-merited luck.\nMeanwhile I am consoling myself for your absence by finding my advantage in it--shining like Hesperus when Hyperion has departed; sitting with our Hebrew prophet, and making a study of his head, in the hours when he used to be occupied with you--getting credit with him as a learned young Gentile, who would have been a Jew if he could --and agreeing with him in the general principle, that whatever is best is for that reason Jewish. I never held it my _forte_ to be a severe reasoner, but I can see that if whatever is best is A, and B happens to be best, B must be A, however little you might have expected it beforehand. On that principle I could see the force of a pamphlet I once read to prove that all good art was Protestant. However, our prophet is an uncommonly interesting sitter--a better model than Rembrandt had for his Rabbi--and I never come away from him without a new discovery. For one thing, it is a constant wonder to me that, with all his fiery feeling for his race and their traditions, he is no straight-laced Jew, spitting after the word Christian, and enjoying the prospect that the Gentile mouth will water in vain for a slice of the roasted Leviathan, while Israel will be sending up plates for more, _ad libitum_, (You perceive that my studies had taught me what to expect from the orthodox Jew.) I confess that I have always held lightly by your account of Mordecai, as apologetic, and merely part of your disposition to make an antedeluvian point of view lest you should do injustice to the megatherium. But now I have given ear to him in his proper person, I find him really a sort of philosophical-allegorical-mystical believer, and yet with a sharp dialectic point, so that any argumentative rattler of peas in a bladder might soon be pricked in silence by him. The mixture may be one of the Jewish prerogatives, for what I know. In fact, his mind seems so broad that I find my own correct opinions lying in it quite commodiously, and how they are to be brought into agreement with the vast remainder is his affair, not mine. I leave it to him to settle our basis, never yet having seen a basis which is not a world-supporting elephant, more or less powerful and expensive to keep. My means will not allow me to keep a private elephant. I go into mystery instead, as cheaper and more lasting--a sort of gas which is likely to be continually supplied by the decomposition of the elephants. And if I like the look of an opinion, I treat it civilly, without suspicious inquiries. I have quite a friendly feeling toward Mordecai's notion that a whole Christian is three-fourths a Jew, and that from the Alexandrian time downward the most comprehensive minds have been Jewish; for I think of pointing out to Mirah that, Arabic and other incidents of life apart, there is really little difference between me and--Maimonides. But I have lately been finding out that it is your shallow lover who can't help making a declaration. If Mirah's ways were less distracting, and it were less of a heaven to be in her presence and watch her, I must long ago have flung myself at her feet, and requested her to tell me, with less indirectness, whether she wished me to blow my brains out. I have a knack of hoping, which is as good as an estate in reversion, if one can keep from the temptation of turning it into certainty, which may spoil all. My Hope wanders among the orchard blossoms, feels the warm snow falling on it through the sunshine, and is in doubt of nothing; but, catching sight of Certainty in the distance, sees an ugly Janus-faced deity, with a dubious wink on the hither side of him, and turns quickly away. But you, with your supreme reasonableness, and self-nullification, and preparation for the worst--you know nothing about Hope, that immortal, delicious maiden forever courted forever propitious, whom fools have called deceitful, as if it were Hope that carried the cup of disappointment, whereas it is her deadly enemy, Certainty, whom she only escapes by transformation. (You observe my new vein of allegory?) Seriously, however, I must be permitted to allege that truth will prevail, that prejudice will melt before it, that diversity, accompanied by merit, will make itself felt as fascination, and that no virtuous aspiration will be frustrated--all which, if I mistake not, are doctrines of the schools, and they imply that the Jewess I prefer will prefer me. Any blockhead can cite generalities, but the mind-master discerns the particular cases they represent.\nI am less convinced that my society makes amends to Mordecai for your absence, but another substitute occasionally comes in the form of Jacob Cohen. It is worth while to catch our prophet's expression when he has that remarkable type of young Israel on his knee, and pours forth some Semitic inspiration with a sublime look of melancholy patience and devoutness. Sometimes it occurs to Jacob that Hebrew will be more edifying to him if he stops his ears with his palms, and imitates the venerable sounds as heard through that muffled medium. When Mordecai gently draws down the little fists and holds them fast, Jacob's features all take on an extraordinary activity, very much as if he was walking through a menagerie and trying to imitate every animal in turn, succeeding best with the owl and the peccary. But I dare say you have seen something of this. He treats me with the easiest familiarity, and seems in general to look at me as a second-hand Christian commodity, likely to come down in price; remarking on my disadvantages with a frankness which seems to imply some thoughts of future purchase. It is pretty, though, to see the change in him if Mirah happens to come in. He turns child suddenly--his age usually strikes one as being like the Israelitish garments in the desert, perhaps near forty, yet with an air of recent production. But, with Mirah, he reminds me of the dogs that have been brought up by women, and remain manageable by them only. Still, the dog is fond of Mordecai too, and brings sugar-plums to share with him, filling his own mouth to rather an embarrassing extent, and watching how Mordecai deals with a smaller supply. Judging from this modern Jacob at the age of six, my astonishment is that his race has not bought us all up long ago, and pocketed our feebler generations in the form of stock and scrip, as so much slave property. There is one Jewess I should not mind being slave to. But I wish I did not imagine that Mirah gets a little sadder, and tries all the while to hide it. It is natural enough, of course, while she has to watch the slow death of this brother, whom she has taken to worshipping with such looks of loving devoutness that I am ready to wish myself in his place.\nFor the rest, we are a little merrier than usual. Rex Gascoigne--you remember a head you admired among my sketches, a fellow with a good upper lip, reading law--has got some rooms in town now not far off us, and has had a neat sister (upper lip also good) staying with him the last fortnight. I have introduced them both to my mother and the girls, who have found out from Miss Gascoigne that she is cousin to your Vandyke duchess!!! I put the notes of exclamation to mark the surprise that the information at first produced on my feeble understanding. On reflection I discovered that there was not the least ground for surprise, unless I had beforehand believed that nobody could be anybody's cousin without my knowing it. This sort of surprise, I take it, depends on a liveliness of the spine, with a more or less constant nullity of brain. There was a fellow I used to meet at Rome who was in an effervescence of surprise at contact with the simplest information. Tell him what you would--that you were fond of easy boots--he would always say, \"No! are you?\" with the same energy of wonder: the very fellow of whom pastoral Browne wrote prophetically,\n\"A wretch so empty that if e'er there be In nature found the least vacuity 'Twill be in him.\"\nI have accounted for it all--he had a lively spine.\nHowever, this cousinship with the duchess came out by chance one day that Mirah was with them at home and they were talking about the Mallingers. _Apropos_; I am getting so important that I have rival invitations. Gascoigne wants me to go down with him to his father's rectory in August and see the country round there. But I think self-interest well understood will take me to Topping Abbey, for Sir Hugo has invited me, and proposes--God bless him for his rashness! --that I should make a picture of his three daughters sitting on a bank--as he says, in the Gainsborough style. He came to my studio the other day and recommended me to apply myself to portrait. Of course I know what that means.--\"My good fellow, your attempts at the historic and poetic are simply pitiable. Your brush is just that of a successful portrait-painter--it has a little truth and a great facility in falsehood--your idealism will never do for gods and goddesses and heroic story, but it may fetch a high price as flattery. Fate, my friend, has made you the hinder wheel--_rota posterior curras, et in axe secundo_--run behind, because you can't help it.\" --What great effort it evidently costs our friends to give us these candid opinions! I have even known a man to take the trouble to call, in order to tell me that I had irretrievably exposed my want of judgment in treating my subject, and that if I had asked him we would have lent me his own judgment. Such was my ingratitude and my readiness at composition, that even while he was speaking I inwardly sketched a Last Judgment with that candid friend's physiognomy on the left. But all this is away from Sir Hugo, whose manner of implying that one's gifts are not of the highest order is so exceedingly good-natured and comfortable that I begin to feel it an advantage not to be among those poor fellows at the tip-top. And his kindness to me tastes all the better because it comes out of his love for you, old boy. His chat is uncommonly amusing. By the way, he told me that your Vandyke duchess is gone with her husband yachting to the Mediterranean. I bethink me that it is possible to land from a yacht, or to be taken on to a yacht from the land. Shall you by chance have an opportunity of continuing your theological discussion with the fair Supralapsarian--I think you said her tenets were of that complexion? Is Duke Alphonso also theological?--perhaps an Arian who objects to triplicity. (Stage direction. While D. is reading, a profound scorn gathers in his face till at the last word he flings down the letter, grasps his coat-collar in a statuesque attitude and so remains with a look generally tremendous, throughout the following soliloquy, \"O night, O blackness, etc., etc.\")\nExcuse the brevity of this letter. You are not used to more from me than a bare statement of facts, without comment or digression. One fact I have omitted--that the Klesmers on the eve of departure have behaved magnificently, shining forth as might be expected from the planets of genius and fortune in conjunction. Mirah is rich with their oriental gifts.\nWhat luck it will be if you come back and present yourself at the Abbey while I am there! I am going to behave with consummate discretion and win golden opinions, But I shall run up to town now and then, just for a peep into Gad Eden. You see how far I have got in Hebrew lore--up with my Lord Bolingbroke, who knew no Hebrew, but \"understood that sort of learning and what is writ about it.\" If Mirah commanded, I would go to a depth below the tri-literal roots. Already it makes no difference to me whether the points are there or not. But while her brother's life lasts I suspect she would not listen to a lover, even one whose \"hair is like a flock of goats on Mount Gilead\"--and I flatter myself that few heads would bear that trying comparison better than mine. So I stay with my hope among the orchard-blossoms.\nYour devoted,\nHANS MEYRICK.\nSome months before, this letter from Hans would have divided Deronda's thoughts irritatingly: its romancing, about Mirah would have had an unpleasant edge, scarcely anointed with any commiseration for his friend's probable disappointment. But things had altered since March. Mirah was no longer so critically placed with regard to the Meyricks, and Deronda's own position had been undergoing a change which had just been crowned by the revelation of his birth. The new opening toward the future, though he would not trust in any definite visions, inevitably shed new lights, and influenced his mood toward past and present; hence, what Hans called his hope now seemed to Deronda, not a mischievous unreasonableness which roused his indignation, but an unusually persistent bird-dance of an extravagant fancy, and he would have felt quite able to pity any consequent suffering of his friend's, if he had believed in the suffering as probable. But some of the busy thought filling that long day, which passed without his receiving any new summons from his mother, was given to the argument that Hans Meyrick's nature was not one in which love could strike the deep roots that turn disappointment into sorrow: it was too restless, too readily excitable by novelty, too ready to turn itself into imaginative material, and wear its grief as a fantastic costume. \"Already he is beginning to play at love: he is taking the whole affair as a comedy,\" said Deronda to himself; \"he knows very well that there is no chance for him. Just like him--never opening his eyes on any possible objection I could have to receive his outpourings about Mirah. Poor old Hans! If we were under a fiery hail together he would howl like a Greek, and if I did not howl too it would never occur to him that I was as badly off as he. And yet he is tender-hearted and affectionate in intention, and I can't say that he is not active in imagining what goes on in other people--but then he always imagines it to fit his own inclination.\"\nWith this touch of causticity Deronda got rid of the slight heat at present raised by Hans's naive expansiveness. The nonsense about Gwendolen, conveying the fact that she was gone yachting with her husband, only suggested a disturbing sequel to his own strange parting with her. But there was one sentence in the letter which raised a more immediate, active anxiety. Hans's suspicion of a hidden sadness in Mirah was not in the direction of his wishes, and hence, instead of distrusting his observation here, Deronda began to conceive a cause for the sadness. Was it some event that had occurred during his absence, or only the growing fear of some event? Was it something, perhaps alterable, in the new position which had been made for her? Or--had Mordecai, against his habitual resolve, communicated to her those peculiar cherished hopes about him, Deronda, and had her quickly sensitive nature been hurt by the discovery that her brother's will or tenacity of visionary conviction had acted coercively on their friendship--been hurt by the fear that there was more of pitying self-suppression than of equal regard in Deronda's relation to him? For amidst all Mirah's quiet renunciation, the evident thirst of soul with which she received the tribute of equality implied a corresponding pain if she found that what she had taken for a purely reverential regard toward her brother had its mixture of condescension.\nIn this last conjecture of Deronda's he was not wrong as to the quality in Mirah's nature on which he was founding--the latent protest against the treatment she had all her life being subject to until she met him. For that gratitude which would not let her pass by any notice of their acquaintance without insisting on the depth of her debt to him, took half its fervor from the keen comparison with what others had thought enough to render to her. Deronda's affinity in feeling enabled him to penetrate such secrets. But he was not near the truth in admitting the idea that Mordecai had broken his characteristic reticence. To no soul but Deronda himself had he yet breathed the history of their relation to each other, or his confidence about his friend's origin: it was not only that these subjects were for him too sacred to be spoken of without weighty reason, but that he had discerned Deronda's shrinking at any mention of his birth; and the severity of reserve which had hindered Mordecai from answering a question on a private affair of the Cohen family told yet more strongly here.\n\"Ezra, how is it?\" Mirah one day said to him--\"I am continually going to speak to Mr. Deronda as if he were a Jew?\"\nHe smiled at her quietly, and said, \"I suppose it is because he treats us as if he were our brother. But he loves not to have the difference of birth dwelt upon.\"\n\"He has never lived with his parents, Mr. Hans, says,\" continued Mirah, to whom this was necessarily a question of interest about every one for whom she had a regard.\n\"Seek not to know such things from Mr. Hans,\" said Mordecai, gravely, laying his hand on her curls, as he was wont. \"What Daniel Deronda wishes us to know about himself is for him to tell us.\"\nAnd Mirah felt herself rebuked, as Deronda had done. But to be rebuked in this way by Mordecai made her rather proud.\n\"I see no one so great as my brother,\" she said to Mrs. Meyrick one day that she called at the Chelsea house on her way home, and, according to her hope, found the little mother alone. \"It is difficult to think that he belongs to the same world as those people I used to live amongst. I told you once that they made life seem like a madhouse; but when I am with Ezra he makes me feel that his life is a great good, though he has suffered so much; not like me, who wanted to die because I had suffered a little, and only for a little while. His soul is so full, it is impossible for him to wish for death as I did. I get the same sort of feeling from him that I got yesterday, when I was tired, and came home through the park after the sweet rain had fallen and the sunshine lay on the grass and flowers. Everything in the sky and under the sky looked so pure and beautiful that the weariness and trouble and folly seemed only a small part of what is, and I became more patient and hopeful.\"\nA dove-like note of melancholy in this speech caused Mrs. Meyrick to look at Mirah with new examination. After laying down her hat and pushing her curls flat, with an air of fatigue, she placed herself on a chair opposite her friend in her habitual attitude, her feet and hands just crossed; and at a distance she might have seemed a colored statue of serenity. But Mrs. Meyrick discerned a new look of suppressed suffering in her face, which corresponded to the hint that to be patient and hopeful required some extra influence.\n\"Is there any fresh trouble on your mind, my dear?\" said Mrs. Meyrick, giving up her needlework as a sign of concentrated attention.\nMirah hesitated before she said, \"I am too ready to speak of troubles, I think. It seems unkind to put anything painful into other people's minds, unless one were sure it would hinder something worse. And perhaps I am too hasty and fearful.\"\n\"Oh, my dear, mothers are made to like pain and trouble for the sake of their children. Is it because the singing lessons are so few, and are likely to fall off when the season comes to an end? Success in these things can't come all at once.\" Mrs. Meyrick did not believe that she was touching the real grief; but a guess that could be corrected would make an easier channel for confidence.\n\"No, not that,\" said Mirah, shaking her head gently. \"I have been a little disappointed because so many ladies said they wanted me to give them or their daughters lessons, and then I never heard of them again, But perhaps after the holidays I shall teach in some schools. Besides, you know, I am as rich as a princess now. I have not touched the hundred pounds that Mrs. Klesmer gave me; and I should never be afraid that Ezra would be in want of anything, because there Mr. Deronda,\" and he said, 'It is the chief honor of my life that your brother will share anything with me.' Oh, no! Ezra and I can have no fears for each other about such things as food and clothing.\"\n\"But there is some other fear on your mind,\" said Mrs. Meyrick not without divination--\"a fear of something that may disturb your peace. Don't be forecasting evil, dear child, unless it is what you can guard against. Anxiety is good for nothing if we can't turn it into a defense. But there's no defense against all the things that might be. Have you any more reason for being anxious now than you had a month ago?\"\n\"Yes, I have,\" said Mirah. \"I have kept it from Ezra. I have not dared to tell him. Pray forgive me that I can't do without telling you. I _have_ more reason for being anxious. It is five days ago now. I am quite sure I saw my father.\"\nMrs. Meyrick shrank into a smaller space, packing her arms across her chest and leaning forward--to hinder herself from pelting that father with her worst epithets.\n\"The year has changed him,\" Mirah went on. \"He had already been much altered and worn in the time before I left him. You remember I said how he used sometimes to cry. He was always excited one way or the other. I have told Ezra everything that I told you, and he says that my father had taken to gambling, which makes people easily distressed, and then again exalted. And now--it was only a moment that I saw him--his face was more haggard, and his clothes were shabby. He was with a much worse-looking man, who carried something, and they were hurrying along after an omnibus.\"\n\"Well, child, he did not see you, I hope?\"\n\"No. I had just come from Mrs. Raymond's, and I was waiting to cross near the Marble Arch. Soon he was on the omnibus and gone out of sight. It was a dreadful moment. My old life seemed to have come back again, and it was worse than it had ever been before. And I could not help feeling it a new deliverance that he was gone out of sight without knowing that I was there. And yet it hurt me that I was feeling so--it seemed hateful in me--almost like words I once had to speak in a play, that 'I had warmed my hands in the blood of my kindred.' For where might my father be going? What may become of him? And his having a daughter who would own him in spite of all, might have hindered the worst. Is there any pain like seeing what ought to be the best things in life turned into the worst? All those opposite feelings were meeting and pressing against each other, and took up all my strength. No one could act that. Acting is slow and poor to what we go through within. I don't know how I called a cab. I only remember that I was in it when I began to think, 'I cannot tell Ezra; he must not know.'\"\n\"You are afraid of grieving him?\" Mrs. Meyrick asked, when Mirah had paused a little.\n\"Yes--and there is something more,\" said Mirah, hesitatingly, as if she were examining her feeling before she would venture to speak of it. \"I want to tell you; I cannot tell any one else. I could not have told my own mother: I should have closed it up before her. I feel shame for my father, and it is perhaps strange--but the shame is greater before Ezra than before any one else in the world. He desired me to tell him all about my life, and I obeyed him. But it is always like a smart to me to know that those things about my father are in Ezra's mind. And--can you believe it? when the thought haunts me how it would be if my father were to come and show himself before us both, what seems as if it would scorch me most is seeing my father shrinking before Ezra. That is the truth. I don't know whether it is a right feeling. But I can't help thinking that I would rather try to maintain my father in secret, and bear a great deal in that way, if I could hinder him from meeting my brother.\"\n\"You must not encourage that feeling, Mirah,\" said Mrs. Meyrick, hastily. \"It would be very dangerous; it would be wrong. You must not have concealment of that sort.\"\n\"But ought I now to tell Ezra that I have seen my father?\" said Mirah, with deprecation in her tone.\n\"No,\" Mrs. Meyrick answered, dubitatively. \"I don't know that it is necessary to do that. Your father may go away with the birds. It is not clear that he came after you; you may never see him again. And then your brother will have been spared a useless anxiety. But promise me that if your father sees you--gets hold of you in any way again--and you will let us all know. Promise me that solemnly, Mirah. I have a right to ask it.\"\nMirah reflected a little, then leaned forward to put her hands in Mrs. Meyrick's, and said, \"Since you ask it, I do promise. I will bear this feeling of shame. I have been so long used to think that I must bear that sort of inward pain. But the shame for my father burns me more when I think of his meeting Ezra.\" She was silent a moment or two, and then said, in a new tone of yearning compassion, \"And we are his children--and he was once young like us--and my mother loved him. Oh! I cannot help seeing it all close, and it hurts me like a cruelty.\"\nMirah shed no tears: the discipline of her whole life had been against indulgence in such manifestation, which soon falls under the control of strong motives; but it seemed that the more intense expression of sorrow had entered into her voice. Mrs. Meyrick, with all her quickness and loving insight, did not quite understand that filial feeling in Mirah which had active roots deep below her indignation for the worst offenses. She could conceive that a mother would have a clinging pity and shame for a reprobate son, but she was out of patience with what she held an exaggerated susceptibility on behalf of this father, whose reappearance inclined her to wish him under the care of a turnkey. Mirah's promise, however, was some security against her weakness.\nThat incident was the only reason that Mirah herself could have stated for the hidden sadness which Hans had divined. Of one element in her changed mood she could have given no definite account: it was something as dim as the sense of approaching weather-change, and had extremely slight external promptings, such as we are often ashamed to find all we can allege in support of the busy constructions that go on within us, not only without effort, but even against it, under the influence of any blind emotional stirring. Perhaps the first leaven of uneasiness was laid by Gwendolen's behavior on that visit which was entirely superfluous as a means of engaging Mirah to sing, and could have no other motive than the excited and strange questioning about Deronda. Mirah had instinctively kept the visit a secret, but the active remembrance of it had raised a new susceptibility in her, and made her alive as she had never been before to the relations Deronda must have with that society which she herself was getting frequent glimpses of without belonging to it. Her peculiar life and education had produced in her an extraordinary mixture of unworldliness, with knowledge of the world's evil, and even this knowledge was a strange blending of direct observation with the effects of reading and theatrical study. Her memory was furnished with abundant passionate situation and intrigue, which she never made emotionally her own, but felt a repelled aloofness from, as she had done from the actual life around her. Some of that imaginative knowledge began now to weave itself around Mrs. Grandcourt; and though Mirah would admit no position likely to affect her reverence for Deronda, she could not avoid a new painfully vivid association of his general life with a world away from her own, where there might be some involvement of his feeling and action with a woman like Gwendolen, who was increasingly repugnant to her--increasingly, even after she had ceased to see her; for liking and disliking can grow in meditation as fast as in the more immediate kind of presence. Any disquietude consciously due to the idea that Deronda's deepest care might be for something remote not only from herself but even from his friendship for her brother, she would have checked with rebuking questions:--What was she but one who had shared his generous kindness with many others? and his attachment to her brother, was it not begun late to be soon ended? Other ties had come before, and others would remain after this had been cut by swift-coming death. But her uneasiness had not reached that point of self-recognition in which she would have been ashamed of it as an indirect, presumptuous claim on Deronda's feeling. That she or any one else should think of him as her possible lover was a conception which had never entered her mind; indeed it was equally out of the question with Mrs. Meyrick and the girls, who with Mirah herself regarded his intervention in her life as something exceptional, and were so impressed by his mission as her deliverer and guardian that they would have held it an offense to him at his holding any other relation toward her: a point of view which Hans also had readily adopted. It is a little hard upon some men that they appear to sink for us in becoming lovers. But precisely to this innocence of the Meyricks was owing the disturbance of Mirah's unconsciousness. The first occasion could hardly have been more trivial, but it prepared her emotive nature for a deeper effect from what happened afterward.\nIt was when Anna Gascoigne, visiting the Meyricks; was led to speak of her cousinship with Gwendolen. The visit had been arranged that Anna might see Mirah; the three girls were at home with their mother, and there was naturally a flux of talk among six feminine creatures, free from the presence of a distorting male standard. Anna Gascoigne felt herself much at home with the Meyrick girls, who knew what it was to have a brother, and to be generally regarded as of minor importance in the world; and she had told Rex that she thought the University very nice, because brothers made friends there whose families were not rich and grand, and yet (like the University) were very nice. The Meyricks seemed to her almost alarmingly clever, and she consulted them much on the best mode of teaching Lotta, confiding to them that she herself was the least clever of her family. Mirah had lately come in, and there was a complete bouquet of young faces around the tea-table--Hafiz, seated a little aloft with large eyes on the alert, regarding the whole scene as an apparatus for supplying his allowance of milk.\n\"Think of our surprise, Mirah,\" said Kate. \"We were speaking of Mr. Deronda and the Mallingers, and it turns out that Miss Gascoigne knows them.\"\n\"I only knew about them,\" said Anna, a little flushed with excitement, what she had heard and now saw of the lovely Jewess being an almost startling novelty to her. \"I have not even seen them. But some months ago, my cousin married Sir Hugo Mallinger's nephew, Mr. Grandcourt, who lived in Sir Hugo's place at Diplow, near us.\"\n\"There!\" exclaimed Mab, clasping her hands. \"Something must come of that. Mrs. Grandcourt, the Vandyke duchess, is your cousin?\"\n\"Oh, yes; I was her bridesmaid,\" said Anna. \"Her mamma and mine are sisters. My aunt was much richer before last year, but then she and mamma lost all their fortune. Papa is a clergyman, you know, so it makes very little difference to us, except that we keep no carriage, and have no dinner parties--and I like it better. But it was very sad for poor Aunt Davilow, for she could not live with us, because she has four daughters besides Gwendolen; but then, when she married Mr. Grandcourt, it did not signify so much, because of his being so rich.\"\n\"Oh, this finding out relationships is delightful!\" said Mab. \"It is like a Chinese puzzle that one has to fit together. I feel sure something wonderful may be made of it, but I can't tell what.\"\n\"Dear me, Mab,\" said Amy, \"relationships must branch out. The only difference is, that we happen to know some of the people concerned. Such things are going on every day.\"\n\"And pray, Amy, why do you insist on the number nine being so wonderful?\" said Mab. \"I am sure that is happening every day. Never mind, Miss Gascoigne; please go on. And Mr. Deronda?--have you never seen Mr. Deronda? You _must_ bring him in.\"\n\"No, I have not seen him,\" said Anna; \"but he was at Diplow before my cousin was married, and I have heard my aunt speaking of him to papa. She said what you have been saying about him--only not so much: I mean, about Mr. Deronda living with Sir Hugo Mallinger, and being so nice, she thought. We talk a great deal about every one who comes near Pennicote, because it is so seldom there is any one new. But I remember, when I asked Gwendolen what she thought of Mr. Deronda, she said, 'Don't mention it, Anna: but I think his hair is dark.' That was her droll way of answering: she was always so lively. It is really rather wonderful that I should come to hear so much about him, all through Mr. Hans knowing Rex, and then my having the pleasure of knowing you,\" Anna ended, looking at Mrs. Meyrick with a shy grace.\n\"The pleasure is on our side too; but the wonder would have been, if you had come to this house without hearing of Mr. Deronda--wouldn't it, Mirah?\" said Mrs. Meyrick.\nMirah smiled acquiescently, but had nothing to say. A confused discontent took possession of her at the mingling of names and images to which she had been listening.\n\"My son calls Mrs. Grandcourt the Vandyke duchess,\" continued Mrs. Meyrick, turning again to Anna; \"he thinks her so striking and picturesque.\"\n\"Yes,\" said Anna. \"Gwendolen was always so beautiful--people fell dreadfully in love with her. I thought it a pity, because it made them unhappy.\"\n\"And how do you like Mr. Grandcourt, the happy lover?\" said Mrs. Meyrick, who, in her way, was as much interested as Mab in the hints she had been hearing of vicissitude in the life of a widow with daughters.\n\"Papa approved of Gwendolen's accepting him, and my aunt says he is very generous,\" said Anna, beginning with a virtuous intention of repressing her own sentiments; but then, unable to resist a rare occasion for speaking them freely, she went on--\"else I should have thought he was not very nice--rather proud, and not at all lively, like Gwendolen. I should have thought some one younger and more lively would have suited her better. But, perhaps, having a brother who seems to us better than any one makes us think worse of others.\"\n\"Wait till you see Mr. Deronda,\" said Mab, nodding significantly. \"Nobody's brother will do after him.\"\n\"Our brothers _must_ do for people's husbands,\" said Kate, curtly, \"because they will not get Mr. Deronda. No woman will do for him to marry.\"\n\"No woman ought to want him to marry him,\" said Mab, with indignation. \"_I_ never should. Fancy finding out that he had a tailor's bill, and used boot-hooks, like Hans. Who ever thought of his marrying?\"\n\"I have,\" said Kate. \"When I drew a wedding for a frontispiece to 'Hearts and Diamonds,' I made a sort of likeness to him for the bridegroom, and I went about looking for a grand woman who would do for his countess, but I saw none that would not be poor creatures by the side of him.\"\n\"You should have seen this Mrs. Grandcourt then,\" said Mrs. Meyrick. \"Hans says that she and Mr. Deronda set each other off when they are side by side. She is tall and fair. But you know her, Mirah--you can always say something descriptive. What do _you_ think of Mrs. Grandcourt?\"\n\"I think she is the _Princess of Eboli_ in _Don Carlos_,\" said Mirah, with a quick intensity. She was pursuing an association in her own mind not intelligible to her hearers--an association with a certain actress as well as the part she represented.\n\"Your comparison is a riddle for me, my dear,\" said Mrs. Meyrick, smiling.\n\"You said that Mrs. Grandcourt was tall and fair,\" continued Mirah, slightly paler. \"That is quite true.\"\nMrs. Meyrick's quick eye and ear detected something unusual, but immediately explained it to herself. Fine ladies had often wounded Mirah by caprices of manner and intention.\n\"Mrs. Grandcourt had thought of having lessons of Mirah,\" she said turning to Anna. \"But many have talked of having lessons, and then have found no time. Fashionable ladies have too much work to do.\"\nAnd the chat went on without further insistence on the _Princess of Eboli_. That comparison escaped Mirah's lips under the urgency of a pang unlike anything she had felt before. The conversation from the beginning had revived unpleasant impressions, and Mrs. Meyrick's suggestion of Gwendolen's figure by the side of Deronda's had the stinging effect of a voice outside her, confirming her secret conviction that this tall and fair woman had some hold on his lot. For a long while afterward she felt as if she had had a jarring shock through her frame.\nIn the evening, putting her cheek against her brother's shoulder as she was sitting by him, while he sat propped up in bed under a new difficulty of breathing, she said,\n\"Ezra, does it ever hurt your love for Mr. Deronda that so much of his life was all hidden away from you--that he is amongst persons and cares about persons who are all so unlike us--I mean unlike you?\"\n\"No, assuredly no,\" said Mordecai. \"Rather it is a precious thought to me that he has a preparation which I lacked, and is an accomplished Egyptian.\" Then, recollecting that his words had reference which his sister must not yet understand, he added, \"I have the more to give him, since his treasure differs from mine. That is a blessedness in friendship.\"\nMirah mused a little.\n\"Still,\" she said, \"it would be a trial to your love for him if that other part of his life were like a crowd in which he had got entangled, so that he was carried away from you--I mean in his thoughts, and not merely carried out of sight as he is now--and not merely for a little while, but continually. How should you bear that! Our religion commands us to bear. But how should you bear it?\"\n\"Not well, my sister--not well; but it will never happen,\" said Mordecai, looking at her with a tender smile. He thought that her heart needed comfort on his account.\nMirah said no more. She mused over the difference between her own state of mind and her brother's, and felt her comparative pettiness. Why could she not be completely satisfied with what satisfied his larger judgment? She gave herself no fuller reason than a painful sense of unfitness--in what? Airy possibilities to which she could give no outline, but to which one name and one figure gave the wandering persistency of a blot in her vision. Here lay the vaguer source of the hidden sadness rendered noticeable to Hans by some diminution of that sweet ease, that ready joyousness of response in her speech and smile, which had come with the new sense of freedom and safety, and had made her presence like the freshly-opened daisies and clear bird-notes after the rain. She herself regarded her uneasiness as a sort of ingratitude and dullness of sensibility toward the great things that had been given her in her new life; and whenever she threw more energy than usual into her singing, it was the energy of indignation against the shallowness of her own content. In that mood she once said, \"Shall I tell you what is the difference between you and me, Ezra? You are a spring in the drought, and I am an acorn-cup; the waters of heaven fill me, but the least little shake leaves me empty.\"\n\"Why, what has shaken thee?\" said Mordecai. He fell into this antique form of speech habitually in talking to his sister and to the Cohen children.\n\"Thoughts,\" said Mirah; \"thoughts that come like the breeze and shake me--bad people, wrong things, misery--and how they might touch our life.\"\n\"We must take our portion, Mirah. It is there. On whose shoulder would we lay it, that we might be free?\"\nThe one voluntary sign she made of her inward care was this distant allusion.",
        "paragraph_chars": [
            [
                0,
                213
            ],
            [
                213,
                371
            ],
            [
                371,
                1359
            ],
            [
                1359,
                5871
            ],
            [
                5871,
                8095
            ],
            [
                8095,
                9250
            ],
            [
                9250,
                9344
            ],
            [
                9344,
                9396
            ],
            [
                9396,
                12124
            ],
            [
                12124,
                12481
            ],
            [
                12481,
                13300
            ],
            [
                13300,
                13314
            ],
            [
                13314,
                13328
            ],
            [
                13328,
                15334
            ],
            [
                15334,
                16752
            ],
            [
                16752,
                17844
            ],
            [
                17844,
                17960
            ],
            [
                17960,
                18123
            ],
            [
                18123,
                18290
            ],
            [
                18290,
                18483
            ],
            [
                18483,
                18601
            ],
            [
                18601,
                19592
            ],
            [
                19592,
                20122
            ],
            [
                20122,
                20255
            ],
            [
                20255,
                20497
            ],
            [
                20497,
                20888
            ],
            [
                20888,
                21561
            ],
            [
                21561,
                21977
            ],
            [
                21977,
                22213
            ],
            [
                22213,
                22378
            ],
            [
                22378,
                22957
            ],
            [
                22957,
                23000
            ],
            [
                23000,
                24101
            ],
            [
                24101,
                24187
            ],
            [
                24187,
                25184
            ],
            [
                25184,
                25351
            ],
            [
                25351,
                25452
            ],
            [
                25452,
                25884
            ],
            [
                25884,
                26437
            ],
            [
                26437,
                27199
            ],
            [
                27199,
                30729
            ],
            [
                30729,
                31836
            ],
            [
                31836,
                31982
            ],
            [
                31982,
                32310
            ],
            [
                32310,
                32439
            ],
            [
                32439,
                32988
            ],
            [
                32988,
                33184
            ],
            [
                33184,
                33356
            ],
            [
                33356,
                33599
            ],
            [
                33599,
                34416
            ],
            [
                34416,
                34584
            ],
            [
                34584,
                34750
            ],
            [
                34750,
                34894
            ],
            [
                34894,
                35041
            ],
            [
                35041,
                35250
            ],
            [
                35250,
                35785
            ],
            [
                35785,
                35889
            ],
            [
                35889,
                36032
            ],
            [
                36032,
                36236
            ],
            [
                36236,
                36521
            ],
            [
                36521,
                36803
            ],
            [
                36803,
                37053
            ],
            [
                37053,
                37128
            ],
            [
                37128,
                37234
            ],
            [
                37234,
                37409
            ],
            [
                37409,
                37609
            ],
            [
                37609,
                38162
            ],
            [
                38162,
                38332
            ],
            [
                38332,
                38535
            ],
            [
                38535,
                38891
            ],
            [
                38891,
                38913
            ],
            [
                38913,
                39307
            ],
            [
                39307,
                39474
            ],
            [
                39474,
                40766
            ],
            [
                40766,
                40914
            ],
            [
                40914,
                41058
            ],
            [
                41058,
                41164
            ],
            [
                41164,
                41241
            ]
        ],
        "segment_chars": [
            [
                0,
                193
            ],
            [
                193,
                213
            ],
            [
                213,
                371
            ],
            [
                371,
                607
            ],
            [
                607,
                843
            ],
            [
                843,
                1150
            ],
            [
                1150,
                1359
            ],
            [
                1359,
                1794
            ],
            [
                1794,
                1984
            ],
            [
                1984,
                2093
            ],
            [
                2093,
                2256
            ],
            [
                2256,
                2685
            ],
            [
                2685,
                2894
            ],
            [
                2894,
                3155
            ],
            [
                3155,
                3223
            ],
            [
                3223,
                3419
            ],
            [
                3419,
                3575
            ],
            [
                3575,
                3630
            ],
            [
                3630,
                3782
            ],
            [
                3782,
                3870
            ],
            [
                3870,
                4212
            ],
            [
                4212,
                4314
            ],
            [
                4314,
                4565
            ],
            [
                4565,
                4722
            ],
            [
                4722,
                5003
            ],
            [
                5003,
                5375
            ],
            [
                5375,
                5414
            ],
            [
                5414,
                5768
            ],
            [
                5768,
                5871
            ],
            [
                5871,
                6020
            ],
            [
                6020,
                6234
            ],
            [
                6234,
                6413
            ],
            [
                6413,
                6680
            ],
            [
                6680,
                6728
            ],
            [
                6728,
                6976
            ],
            [
                6976,
                7052
            ],
            [
                7052,
                7217
            ],
            [
                7217,
                7332
            ],
            [
                7332,
                7525
            ],
            [
                7525,
                7739
            ],
            [
                7739,
                7793
            ],
            [
                7793,
                7891
            ],
            [
                7891,
                8095
            ],
            [
                8095,
                8145
            ],
            [
                8145,
                8388
            ],
            [
                8388,
                8529
            ],
            [
                8529,
                8648
            ],
            [
                8648,
                8819
            ],
            [
                8819,
                8938
            ],
            [
                8938,
                9062
            ],
            [
                9062,
                9147
            ],
            [
                9147,
                9157
            ],
            [
                9157,
                9250
            ],
            [
                9250,
                9344
            ],
            [
                9344,
                9396
            ],
            [
                9396,
                9542
            ],
            [
                9542,
                9610
            ],
            [
                9610,
                9716
            ],
            [
                9716,
                9864
            ],
            [
                9864,
                9976
            ],
            [
                9976,
                10059
            ],
            [
                10059,
                10173
            ],
            [
                10173,
                10400
            ],
            [
                10400,
                10532
            ],
            [
                10532,
                10617
            ],
            [
                10617,
                10835
            ],
            [
                10835,
                11011
            ],
            [
                11011,
                11253
            ],
            [
                11253,
                11349
            ],
            [
                11349,
                11381
            ],
            [
                11381,
                11486
            ],
            [
                11486,
                11585
            ],
            [
                11585,
                11750
            ],
            [
                11750,
                11830
            ],
            [
                11830,
                11848
            ],
            [
                11848,
                12124
            ],
            [
                12124,
                12159
            ],
            [
                12159,
                12255
            ],
            [
                12255,
                12440
            ],
            [
                12440,
                12481
            ],
            [
                12481,
                12571
            ],
            [
                12571,
                12716
            ],
            [
                12716,
                12874
            ],
            [
                12874,
                12945
            ],
            [
                12945,
                13019
            ],
            [
                13019,
                13249
            ],
            [
                13249,
                13300
            ],
            [
                13300,
                13314
            ],
            [
                13314,
                13328
            ],
            [
                13328,
                13567
            ],
            [
                13567,
                13603
            ],
            [
                13603,
                13789
            ],
            [
                13789,
                14270
            ],
            [
                14270,
                14685
            ],
            [
                14685,
                14849
            ],
            [
                14849,
                14966
            ],
            [
                14966,
                14981
            ],
            [
                14981,
                15133
            ],
            [
                15133,
                15334
            ],
            [
                15334,
                15448
            ],
            [
                15448,
                15614
            ],
            [
                15614,
                15702
            ],
            [
                15702,
                15895
            ],
            [
                15895,
                15991
            ],
            [
                15991,
                16077
            ],
            [
                16077,
                16483
            ],
            [
                16483,
                16752
            ],
            [
                16752,
                16966
            ],
            [
                16966,
                17201
            ],
            [
                17201,
                17270
            ],
            [
                17270,
                17377
            ],
            [
                17377,
                17844
            ],
            [
                17844,
                17863
            ],
            [
                17863,
                17960
            ],
            [
                17960,
                18061
            ],
            [
                18061,
                18123
            ],
            [
                18123,
                18290
            ],
            [
                18290,
                18406
            ],
            [
                18406,
                18483
            ],
            [
                18483,
                18536
            ],
            [
                18536,
                18601
            ],
            [
                18601,
                18786
            ],
            [
                18786,
                18886
            ],
            [
                18886,
                19141
            ],
            [
                19141,
                19215
            ],
            [
                19215,
                19405
            ],
            [
                19405,
                19592
            ],
            [
                19592,
                19697
            ],
            [
                19697,
                19954
            ],
            [
                19954,
                20122
            ],
            [
                20122,
                20174
            ],
            [
                20174,
                20255
            ],
            [
                20255,
                20335
            ],
            [
                20335,
                20456
            ],
            [
                20456,
                20497
            ],
            [
                20497,
                20585
            ],
            [
                20585,
                20691
            ],
            [
                20691,
                20740
            ],
            [
                20740,
                20888
            ],
            [
                20888,
                20941
            ],
            [
                20941,
                21160
            ],
            [
                21160,
                21211
            ],
            [
                21211,
                21468
            ],
            [
                21468,
                21476
            ],
            [
                21476,
                21561
            ],
            [
                21561,
                21698
            ],
            [
                21698,
                21778
            ],
            [
                21778,
                21842
            ],
            [
                21842,
                21903
            ],
            [
                21903,
                21977
            ],
            [
                21977,
                22004
            ],
            [
                22004,
                22031
            ],
            [
                22031,
                22061
            ],
            [
                22061,
                22114
            ],
            [
                22114,
                22154
            ],
            [
                22154,
                22179
            ],
            [
                22179,
                22213
            ],
            [
                22213,
                22378
            ],
            [
                22378,
                22421
            ],
            [
                22421,
                22495
            ],
            [
                22495,
                22545
            ],
            [
                22545,
                22589
            ],
            [
                22589,
                22746
            ],
            [
                22746,
                22848
            ],
            [
                22848,
                22957
            ],
            [
                22957,
                23000
            ],
            [
                23000,
                23005
            ],
            [
                23005,
                23091
            ],
            [
                23091,
                23141
            ],
            [
                23141,
                23167
            ],
            [
                23167,
                23258
            ],
            [
                23258,
                23372
            ],
            [
                23372,
                23545
            ],
            [
                23545,
                23581
            ],
            [
                23581,
                23605
            ],
            [
                23605,
                23697
            ],
            [
                23697,
                23791
            ],
            [
                23791,
                23894
            ],
            [
                23894,
                23917
            ],
            [
                23917,
                23971
            ],
            [
                23971,
                24004
            ],
            [
                24004,
                24101
            ],
            [
                24101,
                24135
            ],
            [
                24135,
                24187
            ],
            [
                24187,
                24327
            ],
            [
                24327,
                24376
            ],
            [
                24376,
                24452
            ],
            [
                24452,
                24583
            ],
            [
                24583,
                24646
            ],
            [
                24646,
                24744
            ],
            [
                24744,
                24769
            ],
            [
                24769,
                24955
            ],
            [
                24955,
                24974
            ],
            [
                24974,
                25018
            ],
            [
                25018,
                25184
            ],
            [
                25184,
                25258
            ],
            [
                25258,
                25306
            ],
            [
                25306,
                25351
            ],
            [
                25351,
                25410
            ],
            [
                25410,
                25452
            ],
            [
                25452,
                25495
            ],
            [
                25495,
                25542
            ],
            [
                25542,
                25582
            ],
            [
                25582,
                25651
            ],
            [
                25651,
                25714
            ],
            [
                25714,
                25824
            ],
            [
                25824,
                25857
            ],
            [
                25857,
                25884
            ],
            [
                25884,
                26009
            ],
            [
                26009,
                26044
            ],
            [
                26044,
                26121
            ],
            [
                26121,
                26198
            ],
            [
                26198,
                26365
            ],
            [
                26365,
                26369
            ],
            [
                26369,
                26437
            ],
            [
                26437,
                26681
            ],
            [
                26681,
                26866
            ],
            [
                26866,
                27133
            ],
            [
                27133,
                27199
            ],
            [
                27199,
                27317
            ],
            [
                27317,
                27721
            ],
            [
                27721,
                27963
            ],
            [
                27963,
                28262
            ],
            [
                28262,
                28512
            ],
            [
                28512,
                28713
            ],
            [
                28713,
                29272
            ],
            [
                29272,
                29567
            ],
            [
                29567,
                29642
            ],
            [
                29642,
                29741
            ],
            [
                29741,
                29907
            ],
            [
                29907,
                30400
            ],
            [
                30400,
                30486
            ],
            [
                30486,
                30588
            ],
            [
                30588,
                30729
            ],
            [
                30729,
                30831
            ],
            [
                30831,
                31057
            ],
            [
                31057,
                31414
            ],
            [
                31414,
                31602
            ],
            [
                31602,
                31836
            ],
            [
                31836,
                31879
            ],
            [
                31879,
                31982
            ],
            [
                31982,
                32147
            ],
            [
                32147,
                32175
            ],
            [
                32175,
                32310
            ],
            [
                32310,
                32319
            ],
            [
                32319,
                32354
            ],
            [
                32354,
                32384
            ],
            [
                32384,
                32439
            ],
            [
                32439,
                32483
            ],
            [
                32483,
                32516
            ],
            [
                32516,
                32605
            ],
            [
                32605,
                32761
            ],
            [
                32761,
                32988
            ],
            [
                32988,
                33040
            ],
            [
                33040,
                33050
            ],
            [
                33050,
                33109
            ],
            [
                33109,
                33184
            ],
            [
                33184,
                33242
            ],
            [
                33242,
                33319
            ],
            [
                33319,
                33356
            ],
            [
                33356,
                33430
            ],
            [
                33430,
                33440
            ],
            [
                33440,
                33480
            ],
            [
                33480,
                33522
            ],
            [
                33522,
                33573
            ],
            [
                33573,
                33599
            ],
            [
                33599,
                33739
            ],
            [
                33739,
                33893
            ],
            [
                33893,
                34002
            ],
            [
                34002,
                34140
            ],
            [
                34140,
                34203
            ],
            [
                34203,
                34416
            ],
            [
                34416,
                34565
            ],
            [
                34565,
                34584
            ],
            [
                34584,
                34636
            ],
            [
                34636,
                34750
            ],
            [
                34750,
                34894
            ],
            [
                34894,
                34912
            ],
            [
                34912,
                34989
            ],
            [
                34989,
                35041
            ],
            [
                35041,
                35096
            ],
            [
                35096,
                35250
            ],
            [
                35250,
                35600
            ],
            [
                35600,
                35685
            ],
            [
                35685,
                35785
            ],
            [
                35785,
                35851
            ],
            [
                35851,
                35889
            ],
            [
                35889,
                35996
            ],
            [
                35996,
                36032
            ],
            [
                36032,
                36103
            ],
            [
                36103,
                36122
            ],
            [
                36122,
                36201
            ],
            [
                36201,
                36236
            ],
            [
                36236,
                36257
            ],
            [
                36257,
                36521
            ],
            [
                36521,
                36590
            ],
            [
                36590,
                36673
            ],
            [
                36673,
                36695
            ],
            [
                36695,
                36762
            ],
            [
                36762,
                36803
            ],
            [
                36803,
                36897
            ],
            [
                36897,
                37053
            ],
            [
                37053,
                37128
            ],
            [
                37128,
                37212
            ],
            [
                37212,
                37234
            ],
            [
                37234,
                37336
            ],
            [
                37336,
                37409
            ],
            [
                37409,
                37493
            ],
            [
                37493,
                37563
            ],
            [
                37563,
                37609
            ],
            [
                37609,
                37685
            ],
            [
                37685,
                37787
            ],
            [
                37787,
                38073
            ],
            [
                38073,
                38162
            ],
            [
                38162,
                38332
            ],
            [
                38332,
                38535
            ],
            [
                38535,
                38570
            ],
            [
                38570,
                38685
            ],
            [
                38685,
                38853
            ],
            [
                38853,
                38891
            ],
            [
                38891,
                38913
            ],
            [
                38913,
                39218
            ],
            [
                39218,
                39244
            ],
            [
                39244,
                39278
            ],
            [
                39278,
                39307
            ],
            [
                39307,
                39417
            ],
            [
                39417,
                39474
            ],
            [
                39474,
                39494
            ],
            [
                39494,
                39609
            ],
            [
                39609,
                39692
            ],
            [
                39692,
                39770
            ],
            [
                39770,
                39918
            ],
            [
                39918,
                40245
            ],
            [
                40245,
                40540
            ],
            [
                40540,
                40635
            ],
            [
                40635,
                40766
            ],
            [
                40766,
                40795
            ],
            [
                40795,
                40810
            ],
            [
                40810,
                40914
            ],
            [
                40914,
                41058
            ],
            [
                41058,
                41092
            ],
            [
                41092,
                41105
            ],
            [
                41105,
                41164
            ],
            [
                41164,
                41241
            ]
        ],
        "overlap_chars": [
            [
                213,
                279
            ],
            [
                300,
                371
            ],
            [
                1369,
                1437
            ],
            [
                1447,
                1603
            ],
            [
                1605,
                1656
            ],
            [
                1697,
                1794
            ],
            [
                2102,
                2149
            ],
            [
                2151,
                2198
            ],
            [
                2200,
                2255
            ],
            [
                2256,
                2377
            ],
            [
                2595,
                2597
            ],
            [
                2386,
                2431
            ],
            [
                2685,
                2754
            ],
            [
                2894,
                2928
            ],
            [
                2940,
                3028
            ],
            [
                3059,
                3061
            ],
            [
                3036,
                3041
            ],
            [
                3062,
                3135
            ],
            [
                3139,
                3155
            ],
            [
                3223,
                3322
            ],
            [
                3417,
                3419
            ],
            [
                3786,
                3870
            ],
            [
                3870,
                4106
            ],
            [
                4150,
                4198
            ],
            [
                4200,
                4212
            ],
            [
                4314,
                4403
            ],
            [
                4417,
                4494
            ],
            [
                4520,
                4565
            ],
            [
                4722,
                4931
            ],
            [
                4979,
                5002
            ],
            [
                5003,
                5068
            ],
            [
                5101,
                5161
            ],
            [
                5196,
                5332
            ],
            [
                5373,
                5375
            ],
            [
                5375,
                5414
            ],
            [
                5414,
                5529
            ],
            [
                5610,
                5651
            ],
            [
                5653,
                5656
            ],
            [
                5696,
                5698
            ],
            [
                5657,
                5662
            ],
            [
                5727,
                5767
            ],
            [
                5871,
                6020
            ],
            [
                6020,
                6099
            ],
            [
                6108,
                6113
            ],
            [
                6121,
                6208
            ],
            [
                6222,
                6234
            ],
            [
                6234,
                6296
            ],
            [
                6304,
                6413
            ],
            [
                6413,
                6461
            ],
            [
                6481,
                6499
            ],
            [
                6504,
                6538
            ],
            [
                6549,
                6680
            ],
            [
                6728,
                6730
            ],
            [
                6800,
                6976
            ],
            [
                7234,
                7236
            ],
            [
                7376,
                7408
            ],
            [
                7358,
                7366
            ],
            [
                7412,
                7524
            ],
            [
                6976,
                7031
            ],
            [
                7048,
                7051
            ],
            [
                7052,
                7075
            ],
            [
                7077,
                7113
            ],
            [
                7167,
                7177
            ],
            [
                7215,
                7216
            ],
            [
                7793,
                7864
            ],
            [
                7879,
                7891
            ],
            [
                7891,
                7987
            ],
            [
                8013,
                8022
            ],
            [
                8032,
                8095
            ],
            [
                8095,
                8145
            ],
            [
                8145,
                8158
            ],
            [
                8160,
                8210
            ],
            [
                8227,
                8241
            ],
            [
                8256,
                8282
            ],
            [
                8287,
                8298
            ],
            [
                8301,
                8388
            ],
            [
                8388,
                8410
            ],
            [
                8416,
                8529
            ],
            [
                8529,
                8648
            ],
            [
                8648,
                8733
            ],
            [
                8749,
                8818
            ],
            [
                9610,
                9682
            ],
            [
                9714,
                9716
            ],
            [
                9716,
                9741
            ],
            [
                9758,
                9816
            ],
            [
                9880,
                9935
            ],
            [
                9937,
                9976
            ],
            [
                9976,
                10048
            ],
            [
                10109,
                10110
            ],
            [
                10059,
                10068
            ],
            [
                10081,
                10085
            ],
            [
                10095,
                10097
            ],
            [
                10116,
                10173
            ],
            [
                11011,
                11014
            ],
            [
                11037,
                11045
            ],
            [
                11053,
                11148
            ],
            [
                11165,
                11253
            ],
            [
                11253,
                11349
            ],
            [
                11349,
                11381
            ],
            [
                11381,
                11486
            ],
            [
                11585,
                11680
            ],
            [
                11748,
                11750
            ],
            [
                11830,
                11848
            ],
            [
                11848,
                12050
            ],
            [
                12255,
                12278
            ],
            [
                12280,
                12311
            ],
            [
                12312,
                12423
            ],
            [
                12438,
                12440
            ],
            [
                12440,
                12481
            ],
            [
                12481,
                12518
            ],
            [
                12543,
                12571
            ],
            [
                12571,
                12642
            ],
            [
                12644,
                12705
            ],
            [
                12710,
                12716
            ],
            [
                12716,
                12757
            ],
            [
                12874,
                12909
            ],
            [
                12910,
                12915
            ],
            [
                12943,
                12945
            ],
            [
                13019,
                13159
            ],
            [
                13161,
                13196
            ],
            [
                13203,
                13212
            ],
            [
                13220,
                13249
            ],
            [
                13249,
                13300
            ],
            [
                13300,
                13314
            ],
            [
                13314,
                13326
            ],
            [
                13328,
                13380
            ],
            [
                13389,
                13396
            ],
            [
                13435,
                13436
            ],
            [
                13502,
                13506
            ],
            [
                13422,
                13435
            ],
            [
                13437,
                13448
            ],
            [
                13565,
                13567
            ],
            [
                13567,
                13603
            ],
            [
                13603,
                13728
            ],
            [
                13787,
                13789
            ],
            [
                13789,
                13792
            ],
            [
                14056,
                14059
            ],
            [
                13886,
                14042
            ],
            [
                14071,
                14114
            ],
            [
                14118,
                14154
            ],
            [
                14179,
                14239
            ],
            [
                13831,
                13839
            ],
            [
                14268,
                14270
            ],
            [
                14270,
                14273
            ],
            [
                14291,
                14298
            ],
            [
                14416,
                14468
            ],
            [
                14507,
                14521
            ],
            [
                14469,
                14481
            ],
            [
                14486,
                14496
            ],
            [
                14533,
                14559
            ],
            [
                14578,
                14593
            ],
            [
                14683,
                14684
            ],
            [
                14685,
                14686
            ],
            [
                14694,
                14699
            ],
            [
                14718,
                14849
            ],
            [
                14849,
                14862
            ],
            [
                14864,
                14869
            ],
            [
                14890,
                14893
            ],
            [
                14903,
                14928
            ],
            [
                14937,
                14966
            ],
            [
                14966,
                14981
            ],
            [
                15133,
                15146
            ],
            [
                15166,
                15178
            ],
            [
                15191,
                15196
            ],
            [
                15224,
                15230
            ],
            [
                15231,
                15272
            ],
            [
                15153,
                15154
            ],
            [
                15274,
                15277
            ],
            [
                15283,
                15334
            ],
            [
                15448,
                15451
            ],
            [
                15461,
                15476
            ],
            [
                15547,
                15614
            ],
            [
                15614,
                15684
            ],
            [
                15693,
                15702
            ],
            [
                15702,
                15755
            ],
            [
                15858,
                15860
            ],
            [
                15756,
                15758
            ],
            [
                15776,
                15779
            ],
            [
                15786,
                15791
            ],
            [
                15844,
                15851
            ],
            [
                15872,
                15877
            ],
            [
                15893,
                15895
            ],
            [
                15895,
                15991
            ],
            [
                15991,
                16007
            ],
            [
                16028,
                16077
            ],
            [
                16077,
                16079
            ],
            [
                16081,
                16093
            ],
            [
                16141,
                16144
            ],
            [
                16296,
                16298
            ],
            [
                16145,
                16150
            ],
            [
                16160,
                16181
            ],
            [
                16187,
                16207
            ],
            [
                16216,
                16249
            ],
            [
                16260,
                16264
            ],
            [
                16320,
                16323
            ],
            [
                16350,
                16360
            ],
            [
                16419,
                16420
            ],
            [
                16362,
                16388
            ],
            [
                16456,
                16463
            ],
            [
                16432,
                16436
            ],
            [
                16182,
                16185
            ],
            [
                16440,
                16445
            ],
            [
                16481,
                16483
            ],
            [
                16564,
                16567
            ],
            [
                16643,
                16647
            ],
            [
                16737,
                16744
            ],
            [
                16706,
                16717
            ],
            [
                16750,
                16752
            ],
            [
                16752,
                16775
            ],
            [
                16779,
                16786
            ],
            [
                16792,
                16805
            ],
            [
                16827,
                16832
            ],
            [
                16930,
                16935
            ],
            [
                17147,
                17151
            ],
            [
                16964,
                16965
            ],
            [
                16921,
                16924
            ],
            [
                16975,
                16984
            ],
            [
                17093,
                17099
            ],
            [
                16854,
                16857
            ],
            [
                16917,
                16920
            ],
            [
                16812,
                16815
            ],
            [
                16776,
                16778
            ],
            [
                16868,
                16871
            ],
            [
                17028,
                17030
            ],
            [
                16895,
                16916
            ],
            [
                16809,
                16811
            ],
            [
                16824,
                16826
            ],
            [
                17005,
                17008
            ],
            [
                16925,
                16929
            ],
            [
                17199,
                17201
            ],
            [
                17270,
                17302
            ],
            [
                17322,
                17377
            ],
            [
                17377,
                17399
            ],
            [
                17408,
                17431
            ],
            [
                17440,
                17490
            ],
            [
                17534,
                17538
            ],
            [
                17497,
                17507
            ],
            [
                17521,
                17524
            ],
            [
                17764,
                17765
            ],
            [
                17842,
                17844
            ],
            [
                17844,
                17863
            ],
            [
                17863,
                17888
            ],
            [
                17890,
                17960
            ],
            [
                17960,
                17969
            ],
            [
                17977,
                18061
            ],
            [
                18061,
                18085
            ],
            [
                18104,
                18123
            ],
            [
                18123,
                18169
            ],
            [
                18171,
                18193
            ],
            [
                18288,
                18290
            ],
            [
                18290,
                18388
            ],
            [
                18404,
                18406
            ],
            [
                18406,
                18483
            ],
            [
                18487,
                18513
            ],
            [
                18536,
                18601
            ],
            [
                18601,
                18672
            ],
            [
                18678,
                18709
            ],
            [
                18725,
                18730
            ],
            [
                18755,
                18786
            ],
            [
                18786,
                18886
            ],
            [
                18907,
                18947
            ],
            [
                18963,
                18967
            ],
            [
                18971,
                19110
            ],
            [
                19139,
                19141
            ],
            [
                19141,
                19215
            ],
            [
                19215,
                19254
            ],
            [
                19260,
                19261
            ],
            [
                19386,
                19403
            ],
            [
                19326,
                19346
            ],
            [
                19351,
                19357
            ],
            [
                19293,
                19298
            ],
            [
                19405,
                19415
            ],
            [
                19452,
                19473
            ],
            [
                19589,
                19592
            ],
            [
                19592,
                19593
            ],
            [
                19604,
                19660
            ],
            [
                19669,
                19674
            ],
            [
                19695,
                19697
            ],
            [
                19775,
                19778
            ],
            [
                19805,
                19850
            ],
            [
                19855,
                19869
            ],
            [
                19875,
                19882
            ],
            [
                19749,
                19750
            ],
            [
                19944,
                19954
            ],
            [
                19954,
                20027
            ],
            [
                20120,
                20122
            ],
            [
                20122,
                20174
            ],
            [
                20174,
                20178
            ],
            [
                20253,
                20255
            ],
            [
                20255,
                20335
            ],
            [
                20460,
                20497
            ],
            [
                20497,
                20535
            ],
            [
                20545,
                20556
            ],
            [
                20569,
                20583
            ],
            [
                20561,
                20565
            ],
            [
                20583,
                20585
            ],
            [
                20585,
                20629
            ],
            [
                20689,
                20691
            ],
            [
                20691,
                20740
            ],
            [
                20740,
                20888
            ],
            [
                20888,
                20914
            ],
            [
                20939,
                20941
            ],
            [
                20941,
                21026
            ],
            [
                21035,
                21096
            ],
            [
                21098,
                21160
            ],
            [
                21160,
                21209
            ],
            [
                21230,
                21331
            ],
            [
                21343,
                21352
            ],
            [
                21359,
                21370
            ],
            [
                21380,
                21402
            ],
            [
                21409,
                21465
            ],
            [
                21561,
                21623
            ],
            [
                21696,
                21698
            ],
            [
                21903,
                21977
            ],
            [
                21977,
                22004
            ],
            [
                22004,
                22031
            ],
            [
                22031,
                22061
            ],
            [
                22154,
                22179
            ],
            [
                22179,
                22213
            ],
            [
                22213,
                22254
            ],
            [
                22333,
                22378
            ],
            [
                22378,
                22421
            ],
            [
                22421,
                22454
            ],
            [
                22464,
                22495
            ],
            [
                22519,
                22521
            ],
            [
                22527,
                22536
            ],
            [
                22522,
                22526
            ],
            [
                22537,
                22545
            ],
            [
                22545,
                22589
            ],
            [
                22603,
                22605
            ],
            [
                22646,
                22730
            ],
            [
                22737,
                22746
            ],
            [
                22746,
                22753
            ],
            [
                22755,
                22790
            ],
            [
                22792,
                22848
            ],
            [
                22848,
                22885
            ],
            [
                22909,
                22931
            ],
            [
                22938,
                22957
            ],
            [
                22957,
                22958
            ],
            [
                22971,
                23000
            ],
            [
                23000,
                23005
            ],
            [
                23046,
                23091
            ],
            [
                23091,
                23121
            ],
            [
                23127,
                23141
            ],
            [
                23141,
                23167
            ],
            [
                23167,
                23210
            ],
            [
                23222,
                23232
            ],
            [
                23240,
                23244
            ],
            [
                23256,
                23258
            ],
            [
                23262,
                23286
            ],
            [
                23308,
                23324
            ],
            [
                23338,
                23372
            ],
            [
                23372,
                23397
            ],
            [
                23410,
                23412
            ],
            [
                23545,
                23581
            ],
            [
                23581,
                23605
            ],
            [
                23971,
                24004
            ],
            [
                24042,
                24061
            ],
            [
                24077,
                24079
            ],
            [
                24084,
                24101
            ],
            [
                24101,
                24135
            ],
            [
                24135,
                24153
            ],
            [
                24185,
                24187
            ],
            [
                24187,
                24191
            ],
            [
                24193,
                24247
            ],
            [
                24325,
                24327
            ],
            [
                24327,
                24361
            ],
            [
                24370,
                24376
            ],
            [
                24452,
                24489
            ],
            [
                24498,
                24505
            ],
            [
                24507,
                24523
            ],
            [
                24532,
                24543
            ],
            [
                24581,
                24583
            ],
            [
                24632,
                24633
            ],
            [
                24605,
                24627
            ],
            [
                24646,
                24652
            ],
            [
                24682,
                24744
            ],
            [
                24744,
                24747
            ],
            [
                24769,
                24795
            ],
            [
                24815,
                24824
            ],
            [
                24869,
                24881
            ],
            [
                24830,
                24832
            ],
            [
                24897,
                24955
            ],
            [
                25022,
                25100
            ],
            [
                25136,
                25146
            ],
            [
                25154,
                25184
            ],
            [
                25184,
                25258
            ],
            [
                25258,
                25306
            ],
            [
                25306,
                25323
            ],
            [
                25339,
                25343
            ],
            [
                25324,
                25335
            ],
            [
                25348,
                25351
            ],
            [
                25351,
                25363
            ],
            [
                25368,
                25409
            ],
            [
                25452,
                25480
            ],
            [
                25493,
                25495
            ],
            [
                25495,
                25503
            ],
            [
                25509,
                25513
            ],
            [
                25517,
                25529
            ],
            [
                25540,
                25542
            ],
            [
                25542,
                25580
            ],
            [
                25622,
                25651
            ],
            [
                25651,
                25677
            ],
            [
                25688,
                25714
            ],
            [
                25714,
                25748
            ],
            [
                25754,
                25757
            ],
            [
                25798,
                25813
            ],
            [
                25818,
                25824
            ],
            [
                25824,
                25855
            ],
            [
                25884,
                25899
            ],
            [
                25908,
                25914
            ],
            [
                25933,
                25965
            ],
            [
                25974,
                25977
            ],
            [
                25995,
                25996
            ],
            [
                26000,
                26009
            ],
            [
                26121,
                26124
            ],
            [
                26129,
                26157
            ],
            [
                26163,
                26198
            ],
            [
                26198,
                26221
            ],
            [
                26228,
                26244
            ],
            [
                26262,
                26307
            ],
            [
                26309,
                26330
            ],
            [
                26340,
                26365
            ],
            [
                26365,
                26369
            ],
            [
                26390,
                26392
            ],
            [
                26434,
                26437
            ],
            [
                26670,
                26681
            ],
            [
                26681,
                26707
            ],
            [
                26722,
                26762
            ],
            [
                26826,
                26829
            ],
            [
                26864,
                26866
            ],
            [
                26866,
                26925
            ],
            [
                26936,
                26960
            ],
            [
                26976,
                26989
            ],
            [
                27034,
                27059
            ],
            [
                26961,
                26964
            ],
            [
                27092,
                27094
            ],
            [
                27131,
                27132
            ],
            [
                27213,
                27243
            ],
            [
                27252,
                27273
            ],
            [
                27278,
                27292
            ],
            [
                27315,
                27317
            ],
            [
                27317,
                27319
            ],
            [
                27352,
                27400
            ],
            [
                27411,
                27433
            ],
            [
                27434,
                27460
            ],
            [
                27719,
                27721
            ],
            [
                27721,
                27738
            ],
            [
                27749,
                27763
            ],
            [
                27769,
                27783
            ],
            [
                27793,
                27812
            ],
            [
                27880,
                27915
            ],
            [
                27928,
                27963
            ],
            [
                27992,
                27995
            ],
            [
                28039,
                28041
            ],
            [
                28173,
                28177
            ],
            [
                27996,
                28001
            ],
            [
                28089,
                28093
            ],
            [
                27963,
                27968
            ],
            [
                28234,
                28236
            ],
            [
                28150,
                28157
            ],
            [
                28140,
                28149
            ],
            [
                28168,
                28172
            ],
            [
                28002,
                28003
            ],
            [
                28178,
                28195
            ],
            [
                28225,
                28231
            ],
            [
                28237,
                28262
            ],
            [
                28262,
                28355
            ],
            [
                28393,
                28396
            ],
            [
                28362,
                28392
            ],
            [
                28417,
                28420
            ],
            [
                28494,
                28511
            ],
            [
                28713,
                28820
            ],
            [
                28846,
                28908
            ],
            [
                29133,
                29134
            ],
            [
                28909,
                28943
            ],
            [
                28952,
                28963
            ],
            [
                28964,
                28969
            ],
            [
                28987,
                28994
            ],
            [
                29001,
                29006
            ],
            [
                29053,
                29119
            ],
            [
                29270,
                29272
            ],
            [
                29500,
                29503
            ],
            [
                29653,
                29656
            ],
            [
                29272,
                29275
            ],
            [
                29316,
                29349
            ],
            [
                29374,
                29377
            ],
            [
                29350,
                29356
            ],
            [
                29589,
                29592
            ],
            [
                29600,
                29601
            ],
            [
                29400,
                29404
            ],
            [
                29425,
                29456
            ],
            [
                29470,
                29473
            ],
            [
                29388,
                29395
            ],
            [
                29718,
                29720
            ],
            [
                29496,
                29499
            ],
            [
                29378,
                29382
            ],
            [
                29508,
                29511
            ],
            [
                29512,
                29530
            ],
            [
                29540,
                29548
            ],
            [
                29567,
                29588
            ],
            [
                29627,
                29629
            ],
            [
                29668,
                29673
            ],
            [
                29674,
                29686
            ],
            [
                29739,
                29740
            ],
            [
                29741,
                29819
            ],
            [
                29945,
                29973
            ],
            [
                29905,
                29906
            ],
            [
                29907,
                29911
            ],
            [
                29997,
                30023
            ],
            [
                29864,
                29865
            ],
            [
                30072,
                30098
            ],
            [
                30191,
                30240
            ],
            [
                30254,
                30285
            ],
            [
                30297,
                30300
            ],
            [
                30294,
                30296
            ],
            [
                29826,
                29830
            ],
            [
                30316,
                30345
            ],
            [
                30398,
                30400
            ],
            [
                30486,
                30489
            ],
            [
                30563,
                30570
            ],
            [
                30548,
                30559
            ],
            [
                30534,
                30543
            ],
            [
                30490,
                30533
            ],
            [
                30586,
                30588
            ],
            [
                30588,
                30663
            ],
            [
                30679,
                30682
            ],
            [
                30704,
                30729
            ],
            [
                30729,
                30778
            ],
            [
                30780,
                30799
            ],
            [
                30820,
                30831
            ],
            [
                30831,
                30858
            ],
            [
                30859,
                30957
            ],
            [
                30968,
                31001
            ],
            [
                31055,
                31057
            ],
            [
                31057,
                31084
            ],
            [
                31090,
                31171
            ],
            [
                31182,
                31226
            ],
            [
                31290,
                31291
            ],
            [
                31427,
                31440
            ],
            [
                31448,
                31465
            ],
            [
                31600,
                31602
            ],
            [
                31602,
                31696
            ],
            [
                31701,
                31711
            ],
            [
                31721,
                31756
            ],
            [
                31767,
                31836
            ],
            [
                31836,
                31879
            ],
            [
                31879,
                31982
            ],
            [
                32147,
                32158
            ],
            [
                32164,
                32168
            ],
            [
                32001,
                32035
            ],
            [
                32173,
                32175
            ],
            [
                32175,
                32268
            ],
            [
                32300,
                32310
            ],
            [
                32310,
                32319
            ],
            [
                32319,
                32354
            ],
            [
                32384,
                32439
            ],
            [
                32439,
                32483
            ],
            [
                32483,
                32516
            ],
            [
                32516,
                32605
            ],
            [
                32605,
                32676
            ],
            [
                32759,
                32761
            ],
            [
                32761,
                32803
            ],
            [
                32848,
                32900
            ],
            [
                32905,
                32988
            ],
            [
                32988,
                33040
            ],
            [
                33040,
                33050
            ],
            [
                33050,
                33078
            ],
            [
                33107,
                33109
            ],
            [
                33522,
                33538
            ],
            [
                33540,
                33571
            ],
            [
                33599,
                33602
            ],
            [
                33623,
                33641
            ],
            [
                33693,
                33737
            ],
            [
                33809,
                33816
            ],
            [
                33620,
                33623
            ],
            [
                33829,
                33878
            ],
            [
                33891,
                33893
            ],
            [
                34002,
                34140
            ],
            [
                34140,
                34175
            ],
            [
                34201,
                34203
            ],
            [
                34203,
                34237
            ],
            [
                34291,
                34299
            ],
            [
                34240,
                34246
            ],
            [
                34308,
                34316
            ],
            [
                34238,
                34239
            ],
            [
                34332,
                34373
            ],
            [
                34398,
                34402
            ],
            [
                34405,
                34416
            ],
            [
                34416,
                34542
            ],
            [
                34550,
                34565
            ],
            [
                34565,
                34584
            ],
            [
                34584,
                34596
            ],
            [
                34612,
                34615
            ],
            [
                34620,
                34627
            ],
            [
                34610,
                34611
            ],
            [
                34636,
                34657
            ],
            [
                34748,
                34750
            ],
            [
                34750,
                34824
            ],
            [
                34840,
                34875
            ],
            [
                34891,
                34894
            ],
            [
                34912,
                34913
            ],
            [
                34913,
                34933
            ],
            [
                34937,
                34946
            ],
            [
                34948,
                34989
            ],
            [
                34989,
                35041
            ],
            [
                35041,
                35076
            ],
            [
                35093,
                35096
            ],
            [
                35096,
                35113
            ],
            [
                35248,
                35250
            ],
            [
                35250,
                35344
            ],
            [
                35355,
                35402
            ],
            [
                35413,
                35470
            ],
            [
                35476,
                35495
            ],
            [
                35497,
                35545
            ],
            [
                35547,
                35568
            ],
            [
                35576,
                35600
            ],
            [
                35685,
                35743
            ],
            [
                35752,
                35785
            ],
            [
                35785,
                35851
            ],
            [
                35851,
                35886
            ],
            [
                36201,
                36204
            ],
            [
                36205,
                36209
            ],
            [
                36218,
                36236
            ],
            [
                36236,
                36257
            ],
            [
                36257,
                36298
            ],
            [
                36325,
                36333
            ],
            [
                36342,
                36350
            ],
            [
                36339,
                36341
            ],
            [
                36354,
                36383
            ],
            [
                36403,
                36477
            ],
            [
                36515,
                36521
            ],
            [
                36521,
                36590
            ],
            [
                36590,
                36673
            ],
            [
                36673,
                36695
            ],
            [
                36695,
                36718
            ],
            [
                36762,
                36769
            ],
            [
                36720,
                36723
            ],
            [
                36776,
                36803
            ],
            [
                36803,
                36822
            ],
            [
                36833,
                36841
            ],
            [
                36826,
                36828
            ],
            [
                36847,
                36857
            ],
            [
                36858,
                36872
            ],
            [
                36914,
                36928
            ],
            [
                36957,
                36976
            ],
            [
                37051,
                37053
            ],
            [
                37053,
                37081
            ],
            [
                37088,
                37128
            ],
            [
                37128,
                37212
            ],
            [
                37212,
                37234
            ],
            [
                37234,
                37336
            ],
            [
                37409,
                37470
            ],
            [
                37487,
                37493
            ],
            [
                37493,
                37563
            ],
            [
                37563,
                37609
            ],
            [
                37609,
                37645
            ],
            [
                37660,
                37663
            ],
            [
                37674,
                37682
            ],
            [
                37685,
                37787
            ],
            [
                37787,
                37803
            ],
            [
                37823,
                37826
            ],
            [
                37995,
                38026
            ],
            [
                38041,
                38063
            ],
            [
                37926,
                37935
            ],
            [
                38068,
                38073
            ],
            [
                38073,
                38162
            ],
            [
                38162,
                38277
            ],
            [
                38285,
                38330
            ],
            [
                38332,
                38411
            ],
            [
                38416,
                38422
            ],
            [
                38428,
                38436
            ],
            [
                38438,
                38445
            ],
            [
                38469,
                38474
            ],
            [
                38457,
                38464
            ],
            [
                38501,
                38513
            ],
            [
                38532,
                38535
            ],
            [
                38535,
                38536
            ],
            [
                38547,
                38570
            ],
            [
                38570,
                38649
            ],
            [
                38682,
                38684
            ],
            [
                38891,
                38912
            ],
            [
                38913,
                38941
            ],
            [
                38956,
                38976
            ],
            [
                39032,
                39034
            ],
            [
                39043,
                39052
            ],
            [
                39023,
                39025
            ],
            [
                38977,
                39004
            ],
            [
                39114,
                39119
            ],
            [
                39005,
                39009
            ],
            [
                39069,
                39090
            ],
            [
                39216,
                39218
            ],
            [
                39218,
                39242
            ],
            [
                39307,
                39327
            ],
            [
                39339,
                39380
            ],
            [
                39396,
                39416
            ],
            [
                39474,
                39494
            ],
            [
                39494,
                39497
            ],
            [
                39577,
                39581
            ],
            [
                39558,
                39569
            ],
            [
                39607,
                39609
            ],
            [
                39609,
                39629
            ],
            [
                39641,
                39692
            ],
            [
                39692,
                39695
            ],
            [
                39731,
                39759
            ],
            [
                39761,
                39770
            ],
            [
                39838,
                39861
            ],
            [
                39867,
                39918
            ],
            [
                39918,
                39966
            ],
            [
                39995,
                39997
            ],
            [
                39990,
                39994
            ],
            [
                40032,
                40033
            ],
            [
                39998,
                40021
            ],
            [
                40039,
                40048
            ],
            [
                40093,
                40112
            ],
            [
                40071,
                40074
            ],
            [
                40117,
                40148
            ],
            [
                40243,
                40244
            ],
            [
                40245,
                40248
            ],
            [
                40249,
                40256
            ],
            [
                40461,
                40462
            ],
            [
                40306,
                40309
            ],
            [
                40416,
                40421
            ],
            [
                40341,
                40344
            ],
            [
                40422,
                40433
            ],
            [
                40445,
                40461
            ],
            [
                40470,
                40503
            ],
            [
                40538,
                40540
            ],
            [
                40540,
                40556
            ],
            [
                40562,
                40585
            ],
            [
                40594,
                40635
            ],
            [
                40635,
                40766
            ],
            [
                40766,
                40795
            ],
            [
                40795,
                40809
            ],
            [
                40914,
                40986
            ],
            [
                41055,
                41058
            ],
            [
                41219,
                41223
            ],
            [
                41215,
                41218
            ],
            [
                41164,
                41167
            ],
            [
                41172,
                41214
            ],
            [
                41240,
                41241
            ]
        ],
        "row_chars": [
            [
                0,
                193
            ],
            [
                193,
                213
            ],
            [
                213,
                371
            ],
            [
                371,
                607
            ],
            [
                607,
                843
            ],
            [
                843,
                1150
            ],
            [
                1150,
                1359
            ],
            [
                1359,
                1794
            ],
            [
                1794,
                1984
            ],
            [
                1984,
                2093
            ],
            [
                2093,
                2256
            ],
            [
                2256,
                2685
            ],
            [
                2685,
                3155
            ],
            [
                3155,
                3223
            ],
            [
                3223,
                3419
            ],
            [
                3419,
                3575
            ],
            [
                3575,
                3630
            ],
            [
                3630,
                3782
            ],
            [
                3782,
                3870
            ],
            [
                3870,
                4212
            ],
            [
                4212,
                4314
            ],
            [
                4314,
                4565
            ],
            [
                4565,
                4722
            ],
            [
                4722,
                5003
            ],
            [
                5003,
                5375
            ],
            [
                5375,
                5414
            ],
            [
                5414,
                5768
            ],
            [
                5768,
                5871
            ],
            [
                5871,
                6020
            ],
            [
                6020,
                6234
            ],
            [
                6234,
                6413
            ],
            [
                6413,
                6680
            ],
            [
                6680,
                6728
            ],
            [
                6728,
                6976
            ],
            [
                6976,
                7525
            ],
            [
                7525,
                7739
            ],
            [
                7739,
                7793
            ],
            [
                7793,
                7891
            ],
            [
                7891,
                8095
            ],
            [
                8095,
                8145
            ],
            [
                8145,
                8388
            ],
            [
                8388,
                8529
            ],
            [
                8529,
                8648
            ],
            [
                8648,
                8819
            ],
            [
                8819,
                8938
            ],
            [
                8938,
                9062
            ],
            [
                9062,
                9147
            ],
            [
                9147,
                9157
            ],
            [
                9157,
                9250
            ],
            [
                9250,
                9344
            ],
            [
                9344,
                9396
            ],
            [
                9396,
                9542
            ],
            [
                9542,
                9610
            ],
            [
                9610,
                9716
            ],
            [
                9716,
                9976
            ],
            [
                9976,
                10173
            ],
            [
                10173,
                10400
            ],
            [
                10400,
                10532
            ],
            [
                10532,
                10617
            ],
            [
                10617,
                10835
            ],
            [
                10835,
                11011
            ],
            [
                11011,
                11253
            ],
            [
                11253,
                11349
            ],
            [
                11349,
                11381
            ],
            [
                11381,
                11486
            ],
            [
                11486,
                11585
            ],
            [
                11585,
                11750
            ],
            [
                11750,
                11830
            ],
            [
                11830,
                11848
            ],
            [
                11848,
                12124
            ],
            [
                12124,
                12159
            ],
            [
                12159,
                12255
            ],
            [
                12255,
                12440
            ],
            [
                12440,
                12481
            ],
            [
                12481,
                12571
            ],
            [
                12571,
                12716
            ],
            [
                12716,
                12874
            ],
            [
                12874,
                12945
            ],
            [
                12945,
                13019
            ],
            [
                13019,
                13249
            ],
            [
                13249,
                13300
            ],
            [
                13300,
                13314
            ],
            [
                13314,
                13328
            ],
            [
                13328,
                13567
            ],
            [
                13567,
                13603
            ],
            [
                13603,
                13789
            ],
            [
                13789,
                14270
            ],
            [
                14270,
                14685
            ],
            [
                14685,
                14849
            ],
            [
                14849,
                14966
            ],
            [
                14966,
                14981
            ],
            [
                14981,
                15133
            ],
            [
                15133,
                15334
            ],
            [
                15334,
                15448
            ],
            [
                15448,
                15614
            ],
            [
                15614,
                15702
            ],
            [
                15702,
                15895
            ],
            [
                15895,
                15991
            ],
            [
                15991,
                16077
            ],
            [
                16077,
                16483
            ],
            [
                16483,
                16752
            ],
            [
                16752,
                17201
            ],
            [
                17201,
                17270
            ],
            [
                17270,
                17377
            ],
            [
                17377,
                17844
            ],
            [
                17844,
                17863
            ],
            [
                17863,
                17960
            ],
            [
                17960,
                18061
            ],
            [
                18061,
                18123
            ],
            [
                18123,
                18290
            ],
            [
                18290,
                18406
            ],
            [
                18406,
                18483
            ],
            [
                18483,
                18601
            ],
            [
                18601,
                18786
            ],
            [
                18786,
                18886
            ],
            [
                18886,
                19141
            ],
            [
                19141,
                19215
            ],
            [
                19215,
                19592
            ],
            [
                19592,
                19697
            ],
            [
                19697,
                19954
            ],
            [
                19954,
                20122
            ],
            [
                20122,
                20174
            ],
            [
                20174,
                20255
            ],
            [
                20255,
                20335
            ],
            [
                20335,
                20456
            ],
            [
                20456,
                20497
            ],
            [
                20497,
                20585
            ],
            [
                20585,
                20691
            ],
            [
                20691,
                20740
            ],
            [
                20740,
                20888
            ],
            [
                20888,
                20941
            ],
            [
                20941,
                21160
            ],
            [
                21160,
                21468
            ],
            [
                21468,
                21476
            ],
            [
                21476,
                21561
            ],
            [
                21561,
                21698
            ],
            [
                21698,
                21778
            ],
            [
                21778,
                21842
            ],
            [
                21842,
                21903
            ],
            [
                21903,
                21977
            ],
            [
                21977,
                22004
            ],
            [
                22004,
                22031
            ],
            [
                22031,
                22061
            ],
            [
                22061,
                22114
            ],
            [
                22114,
                22154
            ],
            [
                22154,
                22179
            ],
            [
                22179,
                22213
            ],
            [
                22213,
                22378
            ],
            [
                22378,
                22421
            ],
            [
                22421,
                22495
            ],
            [
                22495,
                22545
            ],
            [
                22545,
                22589
            ],
            [
                22589,
                22746
            ],
            [
                22746,
                22848
            ],
            [
                22848,
                22957
            ],
            [
                22957,
                23000
            ],
            [
                23000,
                23005
            ],
            [
                23005,
                23091
            ],
            [
                23091,
                23141
            ],
            [
                23141,
                23167
            ],
            [
                23167,
                23258
            ],
            [
                23258,
                23372
            ],
            [
                23372,
                23545
            ],
            [
                23545,
                23581
            ],
            [
                23581,
                23605
            ],
            [
                23605,
                23697
            ],
            [
                23697,
                23791
            ],
            [
                23791,
                24004
            ],
            [
                24004,
                24101
            ],
            [
                24101,
                24135
            ],
            [
                24135,
                24187
            ],
            [
                24187,
                24327
            ],
            [
                24327,
                24376
            ],
            [
                24376,
                24452
            ],
            [
                24452,
                24583
            ],
            [
                24583,
                24744
            ],
            [
                24744,
                24955
            ],
            [
                24955,
                24974
            ],
            [
                24974,
                25018
            ],
            [
                25018,
                25184
            ],
            [
                25184,
                25258
            ],
            [
                25258,
                25306
            ],
            [
                25306,
                25351
            ],
            [
                25351,
                25410
            ],
            [
                25410,
                25452
            ],
            [
                25452,
                25495
            ],
            [
                25495,
                25542
            ],
            [
                25542,
                25651
            ],
            [
                25651,
                25714
            ],
            [
                25714,
                25824
            ],
            [
                25824,
                25857
            ],
            [
                25857,
                25884
            ],
            [
                25884,
                26009
            ],
            [
                26009,
                26044
            ],
            [
                26044,
                26121
            ],
            [
                26121,
                26198
            ],
            [
                26198,
                26365
            ],
            [
                26365,
                26369
            ],
            [
                26369,
                26437
            ],
            [
                26437,
                26681
            ],
            [
                26681,
                26866
            ],
            [
                26866,
                27133
            ],
            [
                27133,
                27199
            ],
            [
                27199,
                27317
            ],
            [
                27317,
                27721
            ],
            [
                27721,
                27963
            ],
            [
                27963,
                28262
            ],
            [
                28262,
                28512
            ],
            [
                28512,
                28713
            ],
            [
                28713,
                29272
            ],
            [
                29272,
                29741
            ],
            [
                29741,
                30400
            ],
            [
                30400,
                30486
            ],
            [
                30486,
                30588
            ],
            [
                30588,
                30729
            ],
            [
                30729,
                30831
            ],
            [
                30831,
                31057
            ],
            [
                31057,
                31602
            ],
            [
                31602,
                31836
            ],
            [
                31836,
                31879
            ],
            [
                31879,
                31982
            ],
            [
                31982,
                32175
            ],
            [
                32175,
                32310
            ],
            [
                32310,
                32319
            ],
            [
                32319,
                32354
            ],
            [
                32354,
                32384
            ],
            [
                32384,
                32439
            ],
            [
                32439,
                32483
            ],
            [
                32483,
                32516
            ],
            [
                32516,
                32605
            ],
            [
                32605,
                32761
            ],
            [
                32761,
                32988
            ],
            [
                32988,
                33040
            ],
            [
                33040,
                33050
            ],
            [
                33050,
                33109
            ],
            [
                33109,
                33184
            ],
            [
                33184,
                33242
            ],
            [
                33242,
                33319
            ],
            [
                33319,
                33356
            ],
            [
                33356,
                33430
            ],
            [
                33430,
                33440
            ],
            [
                33440,
                33480
            ],
            [
                33480,
                33522
            ],
            [
                33522,
                33573
            ],
            [
                33573,
                33599
            ],
            [
                33599,
                33893
            ],
            [
                33893,
                34002
            ],
            [
                34002,
                34140
            ],
            [
                34140,
                34203
            ],
            [
                34203,
                34416
            ],
            [
                34416,
                34565
            ],
            [
                34565,
                34584
            ],
            [
                34584,
                34750
            ],
            [
                34750,
                34894
            ],
            [
                34894,
                34912
            ],
            [
                34912,
                34989
            ],
            [
                34989,
                35041
            ],
            [
                35041,
                35096
            ],
            [
                35096,
                35250
            ],
            [
                35250,
                35600
            ],
            [
                35600,
                35685
            ],
            [
                35685,
                35785
            ],
            [
                35785,
                35851
            ],
            [
                35851,
                35889
            ],
            [
                35889,
                35996
            ],
            [
                35996,
                36032
            ],
            [
                36032,
                36103
            ],
            [
                36103,
                36122
            ],
            [
                36122,
                36201
            ],
            [
                36201,
                36236
            ],
            [
                36236,
                36257
            ],
            [
                36257,
                36521
            ],
            [
                36521,
                36590
            ],
            [
                36590,
                36673
            ],
            [
                36673,
                36695
            ],
            [
                36695,
                36803
            ],
            [
                36803,
                37053
            ],
            [
                37053,
                37128
            ],
            [
                37128,
                37212
            ],
            [
                37212,
                37234
            ],
            [
                37234,
                37336
            ],
            [
                37336,
                37409
            ],
            [
                37409,
                37493
            ],
            [
                37493,
                37563
            ],
            [
                37563,
                37609
            ],
            [
                37609,
                37685
            ],
            [
                37685,
                37787
            ],
            [
                37787,
                38073
            ],
            [
                38073,
                38162
            ],
            [
                38162,
                38332
            ],
            [
                38332,
                38535
            ],
            [
                38535,
                38570
            ],
            [
                38570,
                38685
            ],
            [
                38685,
                38853
            ],
            [
                38853,
                38891
            ],
            [
                38891,
                38913
            ],
            [
                38913,
                39218
            ],
            [
                39218,
                39244
            ],
            [
                39244,
                39278
            ],
            [
                39278,
                39307
            ],
            [
                39307,
                39417
            ],
            [
                39417,
                39474
            ],
            [
                39474,
                39494
            ],
            [
                39494,
                39609
            ],
            [
                39609,
                39692
            ],
            [
                39692,
                39770
            ],
            [
                39770,
                39918
            ],
            [
                39918,
                40245
            ],
            [
                40245,
                40540
            ],
            [
                40540,
                40635
            ],
            [
                40635,
                40766
            ],
            [
                40766,
                40795
            ],
            [
                40795,
                40810
            ],
            [
                40810,
                40914
            ],
            [
                40914,
                41058
            ],
            [
                41058,
                41092
            ],
            [
                41092,
                41105
            ],
            [
                41105,
                41164
            ],
            [
                41164,
                41241
            ]
        ]
    },
    "abridged": {
        "text": "Among Deronda's letters the next morning was one from Hans Meyrick, in the small, beautiful handwriting which ran in the Meyrick family.\n'MY DEAR DERONDA, I am consoling myself for your absence by finding my advantage in it - shining like Hesperus when Hyperion has departed; sitting with our Hebrew prophet, and making a study of his head, in the hours when he used to be occupied with you - getting credit with him as a learned young Gentile, and agreeing with him in the general principle, that whatever is best is for that reason Jewish. Our prophet is an uncommonly interesting sitter - a better model than Rembrandt had for his Rabbi - and I never come away from him without a new discovery.\n'For one thing, it is a constant wonder to me that, with all his fiery feeling for his race and their traditions, he is no strait-laced Jew, spitting after the word Christian. I confess that I have always held lightly by your account of Mordecai; but now I have given ear to him in person, I find him really a sort of philosophical-allegorical-mystical believer, and yet so sharp that any argumentative rattler of peas in a bladder might soon be pricked into silence by him. In fact, his mind seems so broad that I find my own correct opinions lying in it quite commodiously. If I like the look of an opinion, I treat it civilly, without suspicious inquiries. I have quite a friendly feeling toward Mordecai's notion that a whole Christian is three-fourths a Jew, and that from the Alexandrian time downward the most comprehensive minds have been Jewish; for I think of pointing out to Mirah that there is really little difference between me and Maimonides. If Mirah's ways were less distracting, and it were less of a heaven to be in her presence, I must long ago have flung myself at her feet, and requested her to tell me whether she wished me to blow my brains out. My Hope wanders among the orchard blossoms, feels the warm snow falling on it through the sunshine, and is in doubt of nothing; but, catching sight of Certainty in the distance, sees an ugly Janus-faced deity, and turns quickly away.\n'But you, with your supreme reasonableness, and self-nullification - you know nothing about Hope, that immortal, delicious maiden, whom fools have called deceitful, as if it were Hope that carried the cup of disappointment, whereas it is her deadly enemy, Certainty. (You observe my new vein of allegory?) Seriously, however, I must be permitted to allege that truth will prevail, that prejudice will melt before it, that no virtuous aspiration will be frustrated - all of which implies that the Jewess I prefer will prefer me.\n'I am less convinced that my society makes amends to Mordecai for your absence, but another substitute occasionally comes in the form of Jacob Cohen. It is worth while to catch our prophet's expression when he has that remarkable young man on his knee, and pours forth some Semitic inspiration with a sublime look of melancholy devoutness. Sometimes it occurs to Jacob that Hebrew will be more edifying if he stops his ears with his palms, and imitates the venerable sounds as heard through that muffled medium. When Mordecai gently draws down the little fists, Jacob's features take on an extraordinary activity, as if he was walking through a menagerie and trying to imitate every animal in turn, succeeding best with the owl and the peccary. He looks at me as a second-hand Christian commodity, likely to come down in price; remarking on my disadvantages with a frankness which seems to imply some thoughts of future purchase. He brings sugar-plums to share with Mordecai, filling his own mouth to rather an embarrassing extent, and watching how Mordecai deals with a smaller supply. It is pretty, though, to see the change in him if Mirah comes in. He turns child suddenly - his age usually strikes one as being near forty. But I wish I did not imagine that Mirah gets a little sadder, and tries to hide it. It is natural enough, of course, while she has to watch the slow death of this brother, whom she worships with such loving devoutness that I am ready to wish myself in his place.\n'For the rest, we are a little merrier than usual. Rex Gascoigne - you remember a head you admired among my sketches, good upper lip - has got some rooms in town not far off, and has had a neat sister (upper lip also good) staying with him the last fortnight. I have introduced them to my mother and the girls, who have found out from Miss Gascoigne that she is cousin to your Vandyke duchess!!! I put the notes of exclamation to mark the surprise that the information at first produced on my feeble understanding. On reflection I discovered that there was not the least ground for surprise, unless I believed that nobody could be anybody's cousin without my knowing it.\nGascoigne wants me to go down with him to his father's rectory in August. But I think self-interest will take me to Topping Abbey, for Sir Hugo has invited me to make a picture of his three daughters sitting on a bank - as he says, in the Gainsborough style. He came to my studio the other day and recommended me to apply myself to portraits, meaning, of course that my attempts at the historic and poetic are simply pitiable. But Sir Hugo's manner of implying that one's gifts are not of the highest order is so exceedingly good-natured that I begin to feel it an advantage not to be among those poor fellows at the tip-top. And his kindness to me tastes all the better because it comes out of his love for you, old boy. His chat is uncommonly amusing. By the way, he told me that your Vandyke duchess is gone with her husband yachting to the Mediterranean. Shall you by chance have an opportunity of continuing your theological discussion with the fair duchess? (Stage direction. While D. is reading, a profound scorn gathers in his face till at the last word he flings down the letter, grasps his coat-collar in a statuesque attitude and so remains with a look generally tremendous.)\n'One fact I have omitted - that the Klesmers on the eve of their departure have behaved magnificently, shining forth as might be expected from the planets of genius and fortune. Mirah is rich with their oriental gifts.\n'What luck it will be if you come back to the Abbey while I am there! I am going to behave with consummate discretion and win golden opinions. But I shall run up to town now and then, just for a peep into Gan Eden. You see how far I have got in Hebrew lore. If Mirah commanded, I would go to a greater depth. But while her brother's life lasts I suspect she would not listen to a lover, even one whose \"hair is like a flock of goats on Mount Gilead\" - and I flatter myself that few heads bear that comparison better than mine. So I stay with my hope among the orchard-blossoms.\n'Your devoted,\nHANS MEYRICK.'\nSome months before, this letter from Hans would have irritated Deronda, with its romancing about Mirah. But things had altered since March. Mirah was no longer so critically placed with regard to the Meyricks, and Deronda's own position had been undergoing a change. The revelation about his birth shed new lights, and influenced his mood toward past and present; hence, what Hans called his hope now seemed to Deronda, not a mischievous unreasonableness, but an unusually persistent bird-dance of extravagant fancy, and he would have pitied any consequent suffering of his friend's, if he had believed he would suffer. But he thought that Hans Meyrick's nature was not one in which love or disappointment could strike deep roots: it was too restless, too excited by novelty, too theatrical.\n\"He is playing at love: he is taking the whole affair as a comedy,\" said Deronda to himself; \"he knows very well that there is no chance for him. Just like him - never imagining any objection I could have to his outpourings about Mirah. Poor old Hans! And yet he is affectionate, and active enough in imagining what goes on in other people - but he always imagines it to fit his own inclination.\"\nThe news about Gwendolen suggested a disturbing sequel to his own strange parting with her. But there was one sentence in the letter which raised a more immediate anxiety. Hans's suspicion of a hidden sadness in Mirah was not likely to be in his imagination, and Deronda wondered about its cause. Was it some event that had occurred during his absence, or only the growing fear of some event? Was it something in the new position which had been made for her? Or had Mordecai told her of those cherished hopes about Deronda, and had her sensitive nature been hurt by the idea that he had been coerced into friendship - been hurt by the fear that Deronda pitied Mordecai rather than regarding him as an equal? She would be pained to think that Deronda condescended to her brother.\nIn this last conjecture Deronda was not wrong about how much Mirah valued being treated with equality. Her gratitude to him was all the greater because of the contrast of his behaviour with the treatment she had been used to in her former life. But he was not near the truth in guessing that Mordecai had broken his characteristic reticence. To no soul but Deronda had he yet breathed the story of their relation to each other, or his confidence that his friend was born a Jew.\n\"Ezra, how is it?\" Mirah one day said to him - \"I am continually going to speak to Mr. Deronda as if he were a Jew?\"\nHe smiled quietly, and said, \"I suppose it is because he treats us as if he were our brother. But he loves not to have his birth dwelt upon.\"\n\"He has never lived with his parents, Mr. Hans says,\" continued Mirah.\n\"Seek not to know such things from Mr. Hans,\" said Mordecai, gravely, laying his hand on her curls. \"What Daniel Deronda wishes us to know about himself is for him to tell us.\"\nMirah felt herself rebuked; but to be rebuked in this way by Mordecai made her rather proud.\n\"I see no one so great as my brother,\" she said to Mrs. Meyrick one day when she called at the Chelsea house, and found the little mother alone. \"It is difficult to think that he belongs to the same world as those people I used to live amongst. They made life seem like a madhouse; but Ezra makes me feel that his life is a great good, though he has suffered so much; not like me, who wanted to die because I had suffered a little. His soul is so full, it is impossible for him to wish for death as I did. I get the same sort of feeling from him as I do from sunlit grass and flowers after the sweet rain has fallen, and everything looks so pure and beautiful.\"\nA note of melancholy in this speech caused Mrs. Meyrick to examine Mirah. She sat opposite her friend in her habitual attitude, feet and hands crossed, in apparent serenity. But Mrs. Meyrick discerned a new look of suppressed suffering in her face.\n\"Is there any fresh trouble on your mind, my dear?\" she said.\nMirah hesitated before she said, \"I am too ready to speak of troubles, I think. Perhaps I am too hasty and fearful.\"\n\"Oh, my dear, mothers are made to like trouble for their children's sake. Is it because the singing lessons are so few? Success in these things can't come all at once.\" Mrs. Meyrick did not believe that she was touching the real grief; but a guess that could be corrected would make an easier channel for confidence.\n\"No, not that,\" said Mirah. \"I have been a little disappointed because so many ladies said they wanted me to give their daughters lessons, and then I never heard of them again. But perhaps after the holidays I shall teach in some schools. Besides, you know, I am as rich as a princess now, with the hundred pounds that Mrs. Klesmer gave me; and I should never be afraid that Ezra would be in want, because Mr. Deronda said, 'It is the chief honour of my life that your brother will share anything with me.'\"\n\"But there is some other fear on your mind,\" said Mrs. Meyrick. \"Have you any more reason for being anxious now than you had a month ago?\"\n\"Yes, I have,\" said Mirah. \"I have kept it from Ezra. I have not dared to tell him. It is five days ago now. I am quite sure I saw my father.\"\nMrs. Meyrick shrank into a smaller space, inwardly pelting that father with her worst epithets.\n\"The year has changed him,\" Mirah went on. \"He had already been much altered in the time before I left him. He sometimes used to cry. He was always excited one way or the other. Ezra said that my father had taken to gambling, which makes people easily distressed, and then exalted. And now - it was only a moment that I saw him - his face was more haggard, and his clothes were shabby. He was with a much worse-looking man, and they were hurrying after an omnibus.\"\n\"He did not see you, I hope?\"\n\"No. I was waiting to cross near the Marble Arch. Soon he was on the omnibus and out of sight. It was a dreadful moment. My old life seemed to have come back again, worse than ever. I could not help feeling glad that he was gone without knowing that I was there. And yet it hurt me that I felt so. For where might my father be going? What may become of him? I felt weak - I don't know how I called a cab. Then I began to think, 'Ezra must not know.'\"\n\"You are afraid of grieving him?\" Mrs. Meyrick asked.\n\"Yes - and there is something more,\" said Mirah, hesitatingly. \"I want to tell you; I cannot tell anyone else. I feel shame for my father, and it is strange, but the shame is greatest before Ezra. I told him all about my life, but it hurts to know that those things about my father are in Ezra's mind. And when the thought haunts me that my father might reappear, what seems to scorch me most is seeing my father shrinking before Ezra. I can't help thinking that I would rather try to maintain my father in secret, if I could prevent him from meeting my brother.\"\n\"You must not encourage that feeling, Mirah,\" said Mrs. Meyrick, hastily. \"It would be very dangerous; it would be wrong. You must not have that concealment.\"\n\"But ought I to tell Ezra that I have seen my father?\"\n\"No,\" Mrs. Meyrick answered, doubtfully. \"I don't think that is necessary. Your father may go away with the birds: you may never see him again. And then your brother will be spared a useless anxiety. But promise me that if your father finds you, you will let us know. Promise me that solemnly, Mirah.\"\nMirah reflected, then put her hands in Mrs. Meyrick's, saying, \"I promise. But shame for my father burns me when I think of his meeting Ezra.\" She was silent a moment, and then said, with yearning compassion, \"And we are his children - and he was once young - and my mother loved him. Oh! it is cruel.\"\nSorrow filled her voice. Mrs. Meyrick, with all her loving insight, did not quite understand her. She could conceive that a mother would have a clinging pity for a reprobate son, but had no patience with Mirah's feeling on behalf of this father, whom she would prefer to see locked up.\nThis was the only reason that Mirah could have stated for her hidden sadness. Of another reason she could have given no definite account: it was as dim as the sense of an approaching weather-change. Perhaps the first uneasiness was caused by Gwendolen's behaviour on that visit which could have no other motive than the strange questioning about Deronda. The memory of that visit made Mirah aware of Deronda's relations with a society which she glimpsed frequently without belonging to it. Her peculiar life and education had produced in her an extraordinary mixture of unworldliness and knowledge of the world's evil, which was supplemented by her theatrical study.\nSome of that imaginative knowledge began now to weave itself around Mrs. Grandcourt; and though Mirah would allow nothing to affect her reverence for Deronda, she could not avoid a new, painfully vivid association of his life with a different world, where he might become involved with a woman like Gwendolen, who was increasingly repugnant to her. If she had felt any unease that Deronda's deepest care might not be for her, nor even for her brother, she would have rebuked herself by telling herself that she was only one person who had shared his kindness; and his attachment to Mordecai would be short, and surely others would follow.\nBut her uneasiness had not reached that point of self-recognition in which she thought of him as her possible lover. That had never entered her mind. Likewise, Mrs. Meyrick and the girls were so impressed by his mission as her deliverer that they would have held it an offence for him to have any other relation toward her. But Mirah's disturbance was owing precisely to this innocence of the Meyricks. The first occasion could hardly have been more trivial, but it prepared her for what happened afterward.\nIt was when Anna Gascoigne, visiting the Meyricks, was led to speak of Gwendolen. The visit had been arranged so that Anna might see Mirah; the three girls were at home with their mother, and there was naturally much talk among six feminine creatures. Anna Gascoigne felt herself at home with the Meyrick girls, who knew what it was to have a brother, and to be regarded as of minor importance in the world, although they seemed to her alarmingly clever. Mirah had lately come in, and there was a complete bouquet of young faces around the tea-table. Hafiz, seated aloft with large eyes on the alert, regarded the whole scene as an apparatus for supplying his allowance of milk.\n\"Think of our surprise, Mirah,\" said Kate. \"We were speaking of Mr. Deronda and the Mallingers, and it turns out that Miss Gascoigne knows them.\"\n\"I have not seen them,\" said Anna, a little flushed. \"But some months ago, my cousin married Sir Hugo Mallinger's nephew, Mr. Grandcourt, who lived near us.\"\n\"There!\" exclaimed Mab, clasping her hands. \"Mrs. Grandcourt, the Vandyke duchess, is your cousin?\"\n\"Oh, yes; I was her bridesmaid,\" said Anna. \"Her mamma and mine are sisters. My aunt was much richer before last year, but then she and mamma lost all their fortune. Papa is a clergyman, you know, so it makes very little difference to us. But it was very sad for poor Aunt Davilow, who has four daughters besides Gwendolen; but then, when Gwendolen married Mr. Grandcourt, it did not signify so much, because of his being so rich.\"\n\"Oh, this finding out relationships is delightful!\" said Mab. \"It is like a Chinese puzzle. And Mr. Deronda? - have you never seen Mr. Deronda?\"\n\"No,\" said Anna; \"but I have heard my aunt speaking of him to papa, about him living with Sir Hugo Mallinger, and being so nice. But I remember, when I asked Gwendolen what she thought of Mr. Deronda, she said, 'Don't mention it, Anna: but I think his hair is dark.' That was her droll way of answering. It is really rather wonderful that Mr. Hans should know Rex, and I have the pleasure of knowing you,\" Anna ended, with shy grace.\n\"The pleasure is on our side too; but the wonder would have been, if you had come to this house without hearing of Mr. Deronda - wouldn't it, Mirah?\" said Mrs. Meyrick.\nMirah smiled but said nothing, feeling a confused discontent.\n\"My son calls Mrs. Grandcourt the Vandyke duchess,\" continued Mrs. Meyrick to Anna; \"he thinks her so striking.\"\n\"Yes, Gwendolen was always beautiful - people fell dreadfully in love with her. I thought it a pity, because it made them unhappy.\"\n\"And how do you like Mr. Grandcourt?\" said Mrs. Meyrick.\n\"Papa approved of Gwendolen's accepting him, and my aunt says he is very generous,\" said Anna, with a virtuous intention of repressing her own feelings; but then, unable to resist a rare occasion for speaking freely, she went on - \"else I should have thought he was not very nice - rather proud, and not lively, like Gwendolen. But, perhaps, having a brother who seems to us better than anyone makes us think worse of others.\"\n\"Wait till you see Mr. Deronda,\" said Mab, nodding significantly. \"Nobody's brother will do after him. Who would ever think of his marrying?\"\n\"I have,\" said Kate. \"When I drew a wedding for a frontispiece, I made a likeness of him for the bridegroom, and I looked for a grand woman who would do for his countess, but I saw none that would match him.\"\n\"You should have seen this Mrs. Grandcourt then,\" said Mrs. Meyrick. \"Hans says that she and Mr. Deronda set each other off when they are side by side. She is tall and fair. But you know her, Mirah - what do you think of Mrs. Grandcourt?\"\n\"I think she is the Princess of Eboli in Don Carlos,\" said Mirah, thinking of an association unintelligible to her hearers.\n\"Your comparison is a riddle, my dear,\" said Mrs. Meyrick, smiling.\n\"You said that Mrs. Grandcourt was tall and fair,\" continued Mirah, slightly paler. \"That is quite true.\"\nMrs. Meyrick's quick eye and ear detected something unusual, but immediately explained it to herself. \"Mrs. Grandcourt had thought of having lessons of Mirah,\" she told Anna. \"But many have talked of having lessons, and then have found no time. Fashionable ladies have too much work to do.\"\nAnd the chat went on without further mention of the Princess of Eboli. That comparison escaped Mirah's lips under the urgency of a pang unlike anything she had felt before. The conversation had confirmed her secret conviction that this woman had some hold on Deronda's lot. For a long while afterward she felt as if she had had a jarring shock through her frame.\nIn the evening, putting her cheek against her brother's shoulder as she was sitting by him, while he sat propped up under a new difficulty of breathing, she said-\n\"Ezra, does it ever hurt your love for Mr. Deronda that so much of his life was hidden from you - that he cares for persons so unlike us?\"\n\"Assuredly no,\" said Mordecai. \"Rather it is a precious thought to me that he has a preparation which I lacked.\"\nMirah mused a little. \"Still,\" she said, \"it would try your love for him if he became entangled in that other part of his life, and were carried away from you. How should you bear that?\"\n\"Not well, my sister - but it will never happen,\" said Mordecai, with a tender smile.\nMirah said no more. She felt petty compared to her brother. Why could she not be satisfied with what satisfied his larger judgment? She felt a painful sense of unfitness - but in what? One name and one figure had the wandering persistency of a blot in her vision. Here lay the vaguer source of the hidden sadness noted by Hans, some diminution of that ready joy which had come with her new sense of freedom and safety.\nShe thought herself ungrateful, and threw all the more energy into her singing - the energy of indignation against herself. In that mood she said, \"Shall I tell you the difference between you and me, Ezra? You are a spring in the drought, and I am an acorn-cup; the waters of heaven fill me, but the least little shake leaves me empty.\"\n\"Why, what has shaken thee?\" said Mordecai.\n\"Thoughts,\" said Mirah; \"thoughts that come like the breeze and shake me.\"\nThis was the only voluntary sign she made of her inward care.",
        "paragraph_chars": [
            [
                0,
                137
            ],
            [
                137,
                698
            ],
            [
                698,
                2102
            ],
            [
                2102,
                2630
            ],
            [
                2630,
                4121
            ],
            [
                4121,
                4792
            ],
            [
                4792,
                5979
            ],
            [
                5979,
                6198
            ],
            [
                6198,
                6776
            ],
            [
                6776,
                6791
            ],
            [
                6791,
                6806
            ],
            [
                6806,
                7598
            ],
            [
                7598,
                7995
            ],
            [
                7995,
                8774
            ],
            [
                8774,
                9252
            ],
            [
                9252,
                9369
            ],
            [
                9369,
                9511
            ],
            [
                9511,
                9582
            ],
            [
                9582,
                9759
            ],
            [
                9759,
                9852
            ],
            [
                9852,
                10514
            ],
            [
                10514,
                10763
            ],
            [
                10763,
                10825
            ],
            [
                10825,
                10942
            ],
            [
                10942,
                11259
            ],
            [
                11259,
                11767
            ],
            [
                11767,
                11906
            ],
            [
                11906,
                12049
            ],
            [
                12049,
                12145
            ],
            [
                12145,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                13092
            ],
            [
                13092,
                13146
            ],
            [
                13146,
                13710
            ],
            [
                13710,
                13869
            ],
            [
                13869,
                13924
            ],
            [
                13924,
                14226
            ],
            [
                14226,
                14529
            ],
            [
                14529,
                14815
            ],
            [
                14815,
                15482
            ],
            [
                15482,
                16121
            ],
            [
                16121,
                16629
            ],
            [
                16629,
                17308
            ],
            [
                17308,
                17454
            ],
            [
                17454,
                17612
            ],
            [
                17612,
                17712
            ],
            [
                17712,
                18144
            ],
            [
                18144,
                18289
            ],
            [
                18289,
                18723
            ],
            [
                18723,
                18892
            ],
            [
                18892,
                18954
            ],
            [
                18954,
                19067
            ],
            [
                19067,
                19199
            ],
            [
                19199,
                19256
            ],
            [
                19256,
                19683
            ],
            [
                19683,
                19825
            ],
            [
                19825,
                20034
            ],
            [
                20034,
                20273
            ],
            [
                20273,
                20397
            ],
            [
                20397,
                20465
            ],
            [
                20465,
                20571
            ],
            [
                20571,
                20862
            ],
            [
                20862,
                21225
            ],
            [
                21225,
                21388
            ],
            [
                21388,
                21527
            ],
            [
                21527,
                21640
            ],
            [
                21640,
                21827
            ],
            [
                21827,
                21913
            ],
            [
                21913,
                22332
            ],
            [
                22332,
                22669
            ],
            [
                22669,
                22713
            ],
            [
                22713,
                22788
            ],
            [
                22788,
                22849
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                542
            ],
            [
                542,
                698
            ],
            [
                698,
                874
            ],
            [
                874,
                1173
            ],
            [
                1173,
                1274
            ],
            [
                1274,
                1358
            ],
            [
                1358,
                1656
            ],
            [
                1656,
                1868
            ],
            [
                1868,
                2102
            ],
            [
                2102,
                2369
            ],
            [
                2369,
                2408
            ],
            [
                2408,
                2630
            ],
            [
                2630,
                2780
            ],
            [
                2780,
                2970
            ],
            [
                2970,
                3142
            ],
            [
                3142,
                3375
            ],
            [
                3375,
                3560
            ],
            [
                3560,
                3717
            ],
            [
                3717,
                3783
            ],
            [
                3783,
                3858
            ],
            [
                3858,
                3942
            ],
            [
                3942,
                4121
            ],
            [
                4121,
                4172
            ],
            [
                4172,
                4381
            ],
            [
                4381,
                4517
            ],
            [
                4517,
                4636
            ],
            [
                4636,
                4792
            ],
            [
                4792,
                4866
            ],
            [
                4866,
                5051
            ],
            [
                5051,
                5219
            ],
            [
                5219,
                5418
            ],
            [
                5418,
                5514
            ],
            [
                5514,
                5546
            ],
            [
                5546,
                5651
            ],
            [
                5651,
                5756
            ],
            [
                5756,
                5774
            ],
            [
                5774,
                5979
            ],
            [
                5979,
                6157
            ],
            [
                6157,
                6198
            ],
            [
                6198,
                6268
            ],
            [
                6268,
                6341
            ],
            [
                6341,
                6413
            ],
            [
                6413,
                6456
            ],
            [
                6456,
                6507
            ],
            [
                6507,
                6725
            ],
            [
                6725,
                6776
            ],
            [
                6776,
                6791
            ],
            [
                6791,
                6806
            ],
            [
                6806,
                6910
            ],
            [
                6910,
                6946
            ],
            [
                6946,
                7073
            ],
            [
                7073,
                7426
            ],
            [
                7426,
                7598
            ],
            [
                7598,
                7744
            ],
            [
                7744,
                7835
            ],
            [
                7835,
                7850
            ],
            [
                7850,
                7995
            ],
            [
                7995,
                8087
            ],
            [
                8087,
                8167
            ],
            [
                8167,
                8292
            ],
            [
                8292,
                8388
            ],
            [
                8388,
                8454
            ],
            [
                8454,
                8703
            ],
            [
                8703,
                8774
            ],
            [
                8774,
                8877
            ],
            [
                8877,
                9019
            ],
            [
                9019,
                9116
            ],
            [
                9116,
                9252
            ],
            [
                9252,
                9271
            ],
            [
                9271,
                9369
            ],
            [
                9369,
                9463
            ],
            [
                9463,
                9511
            ],
            [
                9511,
                9582
            ],
            [
                9582,
                9682
            ],
            [
                9682,
                9759
            ],
            [
                9759,
                9852
            ],
            [
                9852,
                9997
            ],
            [
                9997,
                10097
            ],
            [
                10097,
                10284
            ],
            [
                10284,
                10358
            ],
            [
                10358,
                10514
            ],
            [
                10514,
                10588
            ],
            [
                10588,
                10688
            ],
            [
                10688,
                10763
            ],
            [
                10763,
                10815
            ],
            [
                10815,
                10825
            ],
            [
                10825,
                10905
            ],
            [
                10905,
                10942
            ],
            [
                10942,
                11016
            ],
            [
                11016,
                11062
            ],
            [
                11062,
                11111
            ],
            [
                11111,
                11259
            ],
            [
                11259,
                11287
            ],
            [
                11287,
                11436
            ],
            [
                11436,
                11498
            ],
            [
                11498,
                11767
            ],
            [
                11767,
                11831
            ],
            [
                11831,
                11906
            ],
            [
                11906,
                11933
            ],
            [
                11933,
                11960
            ],
            [
                11960,
                11990
            ],
            [
                11990,
                12015
            ],
            [
                12015,
                12049
            ],
            [
                12049,
                12145
            ],
            [
                12145,
                12188
            ],
            [
                12188,
                12253
            ],
            [
                12253,
                12279
            ],
            [
                12279,
                12323
            ],
            [
                12323,
                12427
            ],
            [
                12427,
                12531
            ],
            [
                12531,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                12646
            ],
            [
                12646,
                12691
            ],
            [
                12691,
                12736
            ],
            [
                12736,
                12762
            ],
            [
                12762,
                12823
            ],
            [
                12823,
                12904
            ],
            [
                12904,
                12939
            ],
            [
                12939,
                12975
            ],
            [
                12975,
                12999
            ],
            [
                12999,
                13046
            ],
            [
                13046,
                13092
            ],
            [
                13092,
                13126
            ],
            [
                13126,
                13146
            ],
            [
                13146,
                13209
            ],
            [
                13209,
                13257
            ],
            [
                13257,
                13343
            ],
            [
                13343,
                13448
            ],
            [
                13448,
                13582
            ],
            [
                13582,
                13710
            ],
            [
                13710,
                13784
            ],
            [
                13784,
                13832
            ],
            [
                13832,
                13869
            ],
            [
                13869,
                13924
            ],
            [
                13924,
                13965
            ],
            [
                13965,
                13999
            ],
            [
                13999,
                14068
            ],
            [
                14068,
                14124
            ],
            [
                14124,
                14192
            ],
            [
                14192,
                14226
            ],
            [
                14226,
                14301
            ],
            [
                14301,
                14369
            ],
            [
                14369,
                14511
            ],
            [
                14511,
                14515
            ],
            [
                14515,
                14529
            ],
            [
                14529,
                14554
            ],
            [
                14554,
                14627
            ],
            [
                14627,
                14815
            ],
            [
                14815,
                14893
            ],
            [
                14893,
                15014
            ],
            [
                15014,
                15170
            ],
            [
                15170,
                15305
            ],
            [
                15305,
                15482
            ],
            [
                15482,
                15831
            ],
            [
                15831,
                16121
            ],
            [
                16121,
                16238
            ],
            [
                16238,
                16271
            ],
            [
                16271,
                16445
            ],
            [
                16445,
                16524
            ],
            [
                16524,
                16629
            ],
            [
                16629,
                16711
            ],
            [
                16711,
                16881
            ],
            [
                16881,
                17084
            ],
            [
                17084,
                17180
            ],
            [
                17180,
                17308
            ],
            [
                17308,
                17351
            ],
            [
                17351,
                17454
            ],
            [
                17454,
                17507
            ],
            [
                17507,
                17612
            ],
            [
                17612,
                17621
            ],
            [
                17621,
                17656
            ],
            [
                17656,
                17712
            ],
            [
                17712,
                17756
            ],
            [
                17756,
                17789
            ],
            [
                17789,
                17878
            ],
            [
                17878,
                17951
            ],
            [
                17951,
                18144
            ],
            [
                18144,
                18196
            ],
            [
                18196,
                18206
            ],
            [
                18206,
                18236
            ],
            [
                18236,
                18253
            ],
            [
                18253,
                18289
            ],
            [
                18289,
                18418
            ],
            [
                18418,
                18556
            ],
            [
                18556,
                18593
            ],
            [
                18593,
                18723
            ],
            [
                18723,
                18873
            ],
            [
                18873,
                18892
            ],
            [
                18892,
                18954
            ],
            [
                18954,
                19067
            ],
            [
                19067,
                19147
            ],
            [
                19147,
                19199
            ],
            [
                19199,
                19237
            ],
            [
                19237,
                19256
            ],
            [
                19256,
                19584
            ],
            [
                19584,
                19683
            ],
            [
                19683,
                19749
            ],
            [
                19749,
                19786
            ],
            [
                19786,
                19825
            ],
            [
                19825,
                19846
            ],
            [
                19846,
                20034
            ],
            [
                20034,
                20103
            ],
            [
                20103,
                20186
            ],
            [
                20186,
                20208
            ],
            [
                20208,
                20273
            ],
            [
                20273,
                20397
            ],
            [
                20397,
                20465
            ],
            [
                20465,
                20549
            ],
            [
                20549,
                20571
            ],
            [
                20571,
                20673
            ],
            [
                20673,
                20746
            ],
            [
                20746,
                20816
            ],
            [
                20816,
                20862
            ],
            [
                20862,
                20933
            ],
            [
                20933,
                21035
            ],
            [
                21035,
                21136
            ],
            [
                21136,
                21225
            ],
            [
                21225,
                21388
            ],
            [
                21388,
                21527
            ],
            [
                21527,
                21558
            ],
            [
                21558,
                21640
            ],
            [
                21640,
                21662
            ],
            [
                21662,
                21800
            ],
            [
                21800,
                21827
            ],
            [
                21827,
                21913
            ],
            [
                21913,
                21933
            ],
            [
                21933,
                21973
            ],
            [
                21973,
                22045
            ],
            [
                22045,
                22098
            ],
            [
                22098,
                22177
            ],
            [
                22177,
                22332
            ],
            [
                22332,
                22456
            ],
            [
                22456,
                22538
            ],
            [
                22538,
                22669
            ],
            [
                22669,
                22698
            ],
            [
                22698,
                22713
            ],
            [
                22713,
                22788
            ],
            [
                22788,
                22849
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                66,
                137
            ],
            [
                155,
                223
            ],
            [
                234,
                390
            ],
            [
                393,
                444
            ],
            [
                445,
                542
            ],
            [
                542,
                589
            ],
            [
                592,
                639
            ],
            [
                642,
                697
            ],
            [
                699,
                820
            ],
            [
                825,
                827
            ],
            [
                827,
                872
            ],
            [
                874,
                943
            ],
            [
                945,
                979
            ],
            [
                980,
                1068
            ],
            [
                1069,
                1071
            ],
            [
                1072,
                1077
            ],
            [
                1078,
                1151
            ],
            [
                1157,
                1173
            ],
            [
                1173,
                1272
            ],
            [
                1272,
                1274
            ],
            [
                1274,
                1358
            ],
            [
                1358,
                1594
            ],
            [
                1595,
                1643
            ],
            [
                1644,
                1656
            ],
            [
                1656,
                1745
            ],
            [
                1745,
                1822
            ],
            [
                1823,
                1868
            ],
            [
                1868,
                2077
            ],
            [
                2078,
                2101
            ],
            [
                2103,
                2168
            ],
            [
                2171,
                2231
            ],
            [
                2231,
                2367
            ],
            [
                2367,
                2369
            ],
            [
                2369,
                2408
            ],
            [
                2408,
                2523
            ],
            [
                2524,
                2565
            ],
            [
                2568,
                2571
            ],
            [
                2572,
                2574
            ],
            [
                2575,
                2580
            ],
            [
                2589,
                2629
            ],
            [
                2631,
                2780
            ],
            [
                2780,
                2859
            ],
            [
                2860,
                2865
            ],
            [
                2870,
                2957
            ],
            [
                2958,
                2970
            ],
            [
                2970,
                3032
            ],
            [
                3033,
                3142
            ],
            [
                3142,
                3190
            ],
            [
                3190,
                3208
            ],
            [
                3209,
                3243
            ],
            [
                3244,
                3375
            ],
            [
                3375,
                3377
            ],
            [
                3384,
                3560
            ],
            [
                3560,
                3562
            ],
            [
                3563,
                3595
            ],
            [
                3596,
                3604
            ],
            [
                3604,
                3716
            ],
            [
                3717,
                3772
            ],
            [
                3779,
                3782
            ],
            [
                3783,
                3806
            ],
            [
                3809,
                3845
            ],
            [
                3846,
                3856
            ],
            [
                3856,
                3857
            ],
            [
                3858,
                3929
            ],
            [
                3930,
                3942
            ],
            [
                3942,
                4038
            ],
            [
                4048,
                4057
            ],
            [
                4058,
                4121
            ],
            [
                4122,
                4172
            ],
            [
                4172,
                4185
            ],
            [
                4188,
                4238
            ],
            [
                4239,
                4253
            ],
            [
                4256,
                4282
            ],
            [
                4283,
                4294
            ],
            [
                4294,
                4381
            ],
            [
                4381,
                4403
            ],
            [
                4404,
                4517
            ],
            [
                4517,
                4636
            ],
            [
                4636,
                4721
            ],
            [
                4722,
                4791
            ],
            [
                4792,
                4864
            ],
            [
                4864,
                4866
            ],
            [
                4866,
                4891
            ],
            [
                4892,
                4950
            ],
            [
                4954,
                5009
            ],
            [
                5012,
                5051
            ],
            [
                5051,
                5123
            ],
            [
                5133,
                5134
            ],
            [
                5144,
                5153
            ],
            [
                5154,
                5158
            ],
            [
                5159,
                5161
            ],
            [
                5162,
                5219
            ],
            [
                5219,
                5222
            ],
            [
                5223,
                5231
            ],
            [
                5234,
                5329
            ],
            [
                5330,
                5418
            ],
            [
                5418,
                5514
            ],
            [
                5514,
                5546
            ],
            [
                5546,
                5651
            ],
            [
                5651,
                5746
            ],
            [
                5754,
                5756
            ],
            [
                5756,
                5774
            ],
            [
                5774,
                5976
            ],
            [
                5980,
                6003
            ],
            [
                6006,
                6037
            ],
            [
                6044,
                6155
            ],
            [
                6155,
                6157
            ],
            [
                6157,
                6198
            ],
            [
                6199,
                6236
            ],
            [
                6240,
                6268
            ],
            [
                6268,
                6339
            ],
            [
                6341,
                6402
            ],
            [
                6407,
                6413
            ],
            [
                6413,
                6454
            ],
            [
                6456,
                6491
            ],
            [
                6500,
                6505
            ],
            [
                6505,
                6507
            ],
            [
                6507,
                6647
            ],
            [
                6650,
                6685
            ],
            [
                6686,
                6695
            ],
            [
                6696,
                6725
            ],
            [
                6725,
                6776
            ],
            [
                6777,
                6791
            ],
            [
                6791,
                6803
            ],
            [
                6806,
                6858
            ],
            [
                6869,
                6876
            ],
            [
                6876,
                6877
            ],
            [
                6878,
                6882
            ],
            [
                6883,
                6896
            ],
            [
                6897,
                6908
            ],
            [
                6908,
                6910
            ],
            [
                6910,
                6946
            ],
            [
                6946,
                7071
            ],
            [
                7071,
                7073
            ],
            [
                7073,
                7076
            ],
            [
                7094,
                7097
            ],
            [
                7104,
                7260
            ],
            [
                7260,
                7303
            ],
            [
                7304,
                7340
            ],
            [
                7348,
                7408
            ],
            [
                7409,
                7417
            ],
            [
                7424,
                7426
            ],
            [
                7426,
                7429
            ],
            [
                7433,
                7440
            ],
            [
                7441,
                7493
            ],
            [
                7497,
                7511
            ],
            [
                7512,
                7524
            ],
            [
                7525,
                7535
            ],
            [
                7535,
                7561
            ],
            [
                7570,
                7585
            ],
            [
                7596,
                7597
            ],
            [
                7598,
                7599
            ],
            [
                7599,
                7604
            ],
            [
                7613,
                7744
            ],
            [
                7744,
                7757
            ],
            [
                7760,
                7765
            ],
            [
                7776,
                7779
            ],
            [
                7780,
                7805
            ],
            [
                7806,
                7835
            ],
            [
                7835,
                7850
            ],
            [
                7850,
                7863
            ],
            [
                7864,
                7876
            ],
            [
                7876,
                7881
            ],
            [
                7882,
                7888
            ],
            [
                7896,
                7937
            ],
            [
                7938,
                7939
            ],
            [
                7940,
                7943
            ],
            [
                7944,
                7995
            ],
            [
                7995,
                7998
            ],
            [
                8004,
                8019
            ],
            [
                8020,
                8087
            ],
            [
                8087,
                8157
            ],
            [
                8158,
                8167
            ],
            [
                8167,
                8220
            ],
            [
                8228,
                8230
            ],
            [
                8234,
                8236
            ],
            [
                8237,
                8240
            ],
            [
                8252,
                8257
            ],
            [
                8258,
                8265
            ],
            [
                8285,
                8290
            ],
            [
                8290,
                8292
            ],
            [
                8292,
                8388
            ],
            [
                8388,
                8404
            ],
            [
                8405,
                8454
            ],
            [
                8454,
                8456
            ],
            [
                8457,
                8469
            ],
            [
                8475,
                8478
            ],
            [
                8479,
                8481
            ],
            [
                8482,
                8487
            ],
            [
                8488,
                8509
            ],
            [
                8510,
                8530
            ],
            [
                8531,
                8564
            ],
            [
                8570,
                8574
            ],
            [
                8578,
                8581
            ],
            [
                8600,
                8610
            ],
            [
                8611,
                8612
            ],
            [
                8613,
                8639
            ],
            [
                8640,
                8647
            ],
            [
                8671,
                8675
            ],
            [
                8686,
                8689
            ],
            [
                8696,
                8701
            ],
            [
                8701,
                8703
            ],
            [
                8703,
                8706
            ],
            [
                8732,
                8736
            ],
            [
                8745,
                8752
            ],
            [
                8761,
                8772
            ],
            [
                8772,
                8774
            ],
            [
                8774,
                8797
            ],
            [
                8798,
                8805
            ],
            [
                8806,
                8819
            ],
            [
                8835,
                8840
            ],
            [
                8848,
                8853
            ],
            [
                8862,
                8866
            ],
            [
                8875,
                8876
            ],
            [
                8877,
                8880
            ],
            [
                8881,
                8890
            ],
            [
                8891,
                8897
            ],
            [
                8898,
                8901
            ],
            [
                8902,
                8905
            ],
            [
                8906,
                8909
            ],
            [
                8926,
                8928
            ],
            [
                8929,
                8932
            ],
            [
                8942,
                8944
            ],
            [
                8964,
                8985
            ],
            [
                8996,
                8998
            ],
            [
                8999,
                9001
            ],
            [
                9002,
                9005
            ],
            [
                9013,
                9017
            ],
            [
                9017,
                9019
            ],
            [
                9019,
                9051
            ],
            [
                9061,
                9116
            ],
            [
                9116,
                9138
            ],
            [
                9139,
                9162
            ],
            [
                9169,
                9219
            ],
            [
                9220,
                9224
            ],
            [
                9225,
                9235
            ],
            [
                9236,
                9239
            ],
            [
                9245,
                9246
            ],
            [
                9250,
                9252
            ],
            [
                9252,
                9271
            ],
            [
                9271,
                9296
            ],
            [
                9299,
                9369
            ],
            [
                9369,
                9378
            ],
            [
                9379,
                9463
            ],
            [
                9463,
                9487
            ],
            [
                9492,
                9511
            ],
            [
                9511,
                9557
            ],
            [
                9558,
                9580
            ],
            [
                9580,
                9582
            ],
            [
                9582,
                9680
            ],
            [
                9680,
                9682
            ],
            [
                9682,
                9759
            ],
            [
                9759,
                9785
            ],
            [
                9787,
                9852
            ],
            [
                9852,
                9923
            ],
            [
                9929,
                9960
            ],
            [
                9960,
                9965
            ],
            [
                9966,
                9997
            ],
            [
                9997,
                10097
            ],
            [
                10097,
                10137
            ],
            [
                10138,
                10142
            ],
            [
                10143,
                10282
            ],
            [
                10282,
                10284
            ],
            [
                10284,
                10358
            ],
            [
                10358,
                10397
            ],
            [
                10401,
                10402
            ],
            [
                10418,
                10435
            ],
            [
                10436,
                10456
            ],
            [
                10461,
                10467
            ],
            [
                10467,
                10472
            ],
            [
                10473,
                10483
            ],
            [
                10490,
                10511
            ],
            [
                10511,
                10514
            ],
            [
                10514,
                10515
            ],
            [
                10516,
                10572
            ],
            [
                10581,
                10586
            ],
            [
                10586,
                10588
            ],
            [
                10588,
                10591
            ],
            [
                10596,
                10641
            ],
            [
                10642,
                10656
            ],
            [
                10657,
                10664
            ],
            [
                10664,
                10665
            ],
            [
                10678,
                10688
            ],
            [
                10688,
                10761
            ],
            [
                10761,
                10763
            ],
            [
                10763,
                10815
            ],
            [
                10819,
                10823
            ],
            [
                10823,
                10825
            ],
            [
                10825,
                10905
            ],
            [
                10905,
                10942
            ],
            [
                10942,
                10980
            ],
            [
                10981,
                10992
            ],
            [
                10993,
                11007
            ],
            [
                11010,
                11014
            ],
            [
                11014,
                11016
            ],
            [
                11016,
                11060
            ],
            [
                11060,
                11062
            ],
            [
                11062,
                11111
            ],
            [
                11111,
                11259
            ],
            [
                11259,
                11285
            ],
            [
                11285,
                11287
            ],
            [
                11287,
                11372
            ],
            [
                11373,
                11434
            ],
            [
                11436,
                11498
            ],
            [
                11498,
                11547
            ],
            [
                11554,
                11655
            ],
            [
                11655,
                11664
            ],
            [
                11665,
                11676
            ],
            [
                11677,
                11699
            ],
            [
                11707,
                11763
            ],
            [
                11767,
                11829
            ],
            [
                11829,
                11831
            ],
            [
                11832,
                11906
            ],
            [
                11906,
                11933
            ],
            [
                11933,
                11960
            ],
            [
                11960,
                11990
            ],
            [
                11990,
                12015
            ],
            [
                12015,
                12049
            ],
            [
                12049,
                12090
            ],
            [
                12100,
                12145
            ],
            [
                12145,
                12188
            ],
            [
                12188,
                12221
            ],
            [
                12222,
                12253
            ],
            [
                12253,
                12255
            ],
            [
                12256,
                12265
            ],
            [
                12266,
                12270
            ],
            [
                12271,
                12279
            ],
            [
                12279,
                12323
            ],
            [
                12325,
                12327
            ],
            [
                12333,
                12417
            ],
            [
                12418,
                12427
            ],
            [
                12427,
                12434
            ],
            [
                12437,
                12472
            ],
            [
                12475,
                12531
            ],
            [
                12531,
                12568
            ],
            [
                12569,
                12591
            ],
            [
                12592,
                12611
            ],
            [
                12611,
                12612
            ],
            [
                12612,
                12641
            ],
            [
                12641,
                12646
            ],
            [
                12646,
                12691
            ],
            [
                12691,
                12721
            ],
            [
                12722,
                12736
            ],
            [
                12736,
                12762
            ],
            [
                12762,
                12805
            ],
            [
                12806,
                12816
            ],
            [
                12817,
                12821
            ],
            [
                12821,
                12823
            ],
            [
                12823,
                12847
            ],
            [
                12853,
                12869
            ],
            [
                12870,
                12904
            ],
            [
                12904,
                12929
            ],
            [
                12935,
                12937
            ],
            [
                12939,
                12975
            ],
            [
                12975,
                12999
            ],
            [
                13013,
                13046
            ],
            [
                13051,
                13070
            ],
            [
                13072,
                13074
            ],
            [
                13075,
                13092
            ],
            [
                13092,
                13126
            ],
            [
                13126,
                13144
            ],
            [
                13144,
                13146
            ],
            [
                13146,
                13150
            ],
            [
                13153,
                13207
            ],
            [
                13207,
                13209
            ],
            [
                13209,
                13243
            ],
            [
                13251,
                13257
            ],
            [
                13257,
                13294
            ],
            [
                13295,
                13302
            ],
            [
                13304,
                13320
            ],
            [
                13330,
                13341
            ],
            [
                13341,
                13343
            ],
            [
                13343,
                13344
            ],
            [
                13350,
                13372
            ],
            [
                13373,
                13379
            ],
            [
                13386,
                13448
            ],
            [
                13448,
                13451
            ],
            [
                13452,
                13478
            ],
            [
                13484,
                13493
            ],
            [
                13508,
                13520
            ],
            [
                13521,
                13523
            ],
            [
                13524,
                13582
            ],
            [
                13582,
                13660
            ],
            [
                13661,
                13671
            ],
            [
                13680,
                13710
            ],
            [
                13710,
                13784
            ],
            [
                13784,
                13832
            ],
            [
                13832,
                13849
            ],
            [
                13850,
                13854
            ],
            [
                13855,
                13866
            ],
            [
                13866,
                13869
            ],
            [
                13869,
                13881
            ],
            [
                13882,
                13923
            ],
            [
                13924,
                13952
            ],
            [
                13963,
                13965
            ],
            [
                13965,
                13973
            ],
            [
                13980,
                13984
            ],
            [
                13985,
                13997
            ],
            [
                13997,
                13999
            ],
            [
                13999,
                14037
            ],
            [
                14039,
                14068
            ],
            [
                14068,
                14094
            ],
            [
                14098,
                14124
            ],
            [
                14124,
                14158
            ],
            [
                14165,
                14168
            ],
            [
                14170,
                14185
            ],
            [
                14186,
                14192
            ],
            [
                14192,
                14223
            ],
            [
                14226,
                14241
            ],
            [
                14241,
                14247
            ],
            [
                14248,
                14280
            ],
            [
                14287,
                14290
            ],
            [
                14290,
                14291
            ],
            [
                14292,
                14301
            ],
            [
                14301,
                14304
            ],
            [
                14305,
                14333
            ],
            [
                14334,
                14369
            ],
            [
                14369,
                14392
            ],
            [
                14392,
                14408
            ],
            [
                14414,
                14459
            ],
            [
                14462,
                14483
            ],
            [
                14486,
                14511
            ],
            [
                14511,
                14515
            ],
            [
                14515,
                14517
            ],
            [
                14526,
                14529
            ],
            [
                14543,
                14554
            ],
            [
                14554,
                14580
            ],
            [
                14581,
                14621
            ],
            [
                14622,
                14625
            ],
            [
                14625,
                14627
            ],
            [
                14627,
                14686
            ],
            [
                14687,
                14711
            ],
            [
                14719,
                14732
            ],
            [
                14749,
                14774
            ],
            [
                14780,
                14783
            ],
            [
                14797,
                14799
            ],
            [
                14813,
                14814
            ],
            [
                14820,
                14850
            ],
            [
                14851,
                14872
            ],
            [
                14877,
                14891
            ],
            [
                14891,
                14893
            ],
            [
                14893,
                14895
            ],
            [
                14911,
                14959
            ],
            [
                14960,
                14982
            ],
            [
                14986,
                15012
            ],
            [
                15012,
                15014
            ],
            [
                15014,
                15031
            ],
            [
                15032,
                15046
            ],
            [
                15054,
                15068
            ],
            [
                15079,
                15098
            ],
            [
                15099,
                15134
            ],
            [
                15135,
                15170
            ],
            [
                15170,
                15173
            ],
            [
                15181,
                15183
            ],
            [
                15184,
                15188
            ],
            [
                15189,
                15194
            ],
            [
                15195,
                15199
            ],
            [
                15200,
                15205
            ],
            [
                15212,
                15214
            ],
            [
                15215,
                15222
            ],
            [
                15225,
                15234
            ],
            [
                15235,
                15239
            ],
            [
                15240,
                15241
            ],
            [
                15242,
                15259
            ],
            [
                15260,
                15266
            ],
            [
                15280,
                15305
            ],
            [
                15305,
                15398
            ],
            [
                15399,
                15402
            ],
            [
                15403,
                15433
            ],
            [
                15440,
                15443
            ],
            [
                15464,
                15481
            ],
            [
                15482,
                15589
            ],
            [
                15604,
                15666
            ],
            [
                15666,
                15667
            ],
            [
                15668,
                15702
            ],
            [
                15703,
                15714
            ],
            [
                15725,
                15730
            ],
            [
                15730,
                15737
            ],
            [
                15741,
                15746
            ],
            [
                15763,
                15829
            ],
            [
                15829,
                15831
            ],
            [
                15834,
                15837
            ],
            [
                15838,
                15841
            ],
            [
                15847,
                15850
            ],
            [
                15858,
                15891
            ],
            [
                15892,
                15895
            ],
            [
                15896,
                15902
            ],
            [
                15903,
                15906
            ],
            [
                15906,
                15907
            ],
            [
                15912,
                15916
            ],
            [
                15917,
                15948
            ],
            [
                15949,
                15952
            ],
            [
                15957,
                15964
            ],
            [
                15965,
                15967
            ],
            [
                15993,
                15996
            ],
            [
                15997,
                16001
            ],
            [
                16002,
                16005
            ],
            [
                16013,
                16031
            ],
            [
                16032,
                16040
            ],
            [
                16042,
                16063
            ],
            [
                16079,
                16081
            ],
            [
                16087,
                16092
            ],
            [
                16100,
                16112
            ],
            [
                16119,
                16120
            ],
            [
                16121,
                16199
            ],
            [
                16208,
                16236
            ],
            [
                16236,
                16237
            ],
            [
                16238,
                16242
            ],
            [
                16243,
                16269
            ],
            [
                16279,
                16280
            ],
            [
                16281,
                16307
            ],
            [
                16308,
                16357
            ],
            [
                16358,
                16389
            ],
            [
                16402,
                16405
            ],
            [
                16406,
                16408
            ],
            [
                16409,
                16413
            ],
            [
                16414,
                16443
            ],
            [
                16443,
                16445
            ],
            [
                16445,
                16448
            ],
            [
                16449,
                16456
            ],
            [
                16457,
                16468
            ],
            [
                16469,
                16478
            ],
            [
                16479,
                16522
            ],
            [
                16522,
                16524
            ],
            [
                16524,
                16599
            ],
            [
                16600,
                16603
            ],
            [
                16604,
                16629
            ],
            [
                16629,
                16678
            ],
            [
                16680,
                16699
            ],
            [
                16700,
                16711
            ],
            [
                16711,
                16738
            ],
            [
                16742,
                16840
            ],
            [
                16846,
                16879
            ],
            [
                16879,
                16881
            ],
            [
                16881,
                16908
            ],
            [
                16909,
                16990
            ],
            [
                16991,
                17035
            ],
            [
                17035,
                17036
            ],
            [
                17051,
                17064
            ],
            [
                17065,
                17082
            ],
            [
                17082,
                17084
            ],
            [
                17084,
                17178
            ],
            [
                17183,
                17193
            ],
            [
                17194,
                17229
            ],
            [
                17239,
                17308
            ],
            [
                17308,
                17351
            ],
            [
                17351,
                17454
            ],
            [
                17454,
                17465
            ],
            [
                17466,
                17470
            ],
            [
                17471,
                17505
            ],
            [
                17505,
                17507
            ],
            [
                17508,
                17601
            ],
            [
                17602,
                17612
            ],
            [
                17612,
                17621
            ],
            [
                17621,
                17656
            ],
            [
                17657,
                17712
            ],
            [
                17712,
                17756
            ],
            [
                17756,
                17789
            ],
            [
                17789,
                17878
            ],
            [
                17878,
                17949
            ],
            [
                17949,
                17951
            ],
            [
                17951,
                17993
            ],
            [
                17998,
                18050
            ],
            [
                18061,
                18144
            ],
            [
                18144,
                18196
            ],
            [
                18196,
                18206
            ],
            [
                18206,
                18234
            ],
            [
                18234,
                18236
            ],
            [
                18236,
                18252
            ],
            [
                18255,
                18286
            ],
            [
                18289,
                18292
            ],
            [
                18292,
                18310
            ],
            [
                18311,
                18355
            ],
            [
                18355,
                18362
            ],
            [
                18363,
                18366
            ],
            [
                18367,
                18416
            ],
            [
                18416,
                18418
            ],
            [
                18418,
                18556
            ],
            [
                18556,
                18591
            ],
            [
                18591,
                18593
            ],
            [
                18593,
                18627
            ],
            [
                18628,
                18636
            ],
            [
                18637,
                18643
            ],
            [
                18649,
                18657
            ],
            [
                18658,
                18659
            ],
            [
                18665,
                18706
            ],
            [
                18707,
                18711
            ],
            [
                18712,
                18723
            ],
            [
                18723,
                18849
            ],
            [
                18858,
                18873
            ],
            [
                18873,
                18892
            ],
            [
                18892,
                18904
            ],
            [
                18905,
                18908
            ],
            [
                18914,
                18921
            ],
            [
                18921,
                18922
            ],
            [
                18931,
                18952
            ],
            [
                18952,
                18954
            ],
            [
                18954,
                19028
            ],
            [
                19029,
                19064
            ],
            [
                19064,
                19067
            ],
            [
                19067,
                19068
            ],
            [
                19073,
                19093
            ],
            [
                19094,
                19103
            ],
            [
                19106,
                19147
            ],
            [
                19147,
                19199
            ],
            [
                19199,
                19234
            ],
            [
                19234,
                19237
            ],
            [
                19237,
                19254
            ],
            [
                19254,
                19256
            ],
            [
                19256,
                19350
            ],
            [
                19351,
                19398
            ],
            [
                19407,
                19464
            ],
            [
                19465,
                19484
            ],
            [
                19487,
                19535
            ],
            [
                19538,
                19559
            ],
            [
                19560,
                19584
            ],
            [
                19584,
                19642
            ],
            [
                19650,
                19683
            ],
            [
                19683,
                19749
            ],
            [
                19749,
                19784
            ],
            [
                19786,
                19789
            ],
            [
                19796,
                19800
            ],
            [
                19807,
                19825
            ],
            [
                19825,
                19846
            ],
            [
                19846,
                19887
            ],
            [
                19889,
                19897
            ],
            [
                19898,
                19906
            ],
            [
                19907,
                19909
            ],
            [
                19910,
                19939
            ],
            [
                19947,
                20021
            ],
            [
                20028,
                20034
            ],
            [
                20034,
                20103
            ],
            [
                20103,
                20186
            ],
            [
                20186,
                20208
            ],
            [
                20208,
                20231
            ],
            [
                20234,
                20241
            ],
            [
                20242,
                20245
            ],
            [
                20246,
                20273
            ],
            [
                20273,
                20292
            ],
            [
                20302,
                20310
            ],
            [
                20311,
                20313
            ],
            [
                20314,
                20324
            ],
            [
                20324,
                20338
            ],
            [
                20351,
                20365
            ],
            [
                20376,
                20395
            ],
            [
                20395,
                20397
            ],
            [
                20397,
                20425
            ],
            [
                20425,
                20465
            ],
            [
                20465,
                20549
            ],
            [
                20549,
                20571
            ],
            [
                20571,
                20673
            ],
            [
                20673,
                20734
            ],
            [
                20740,
                20746
            ],
            [
                20746,
                20816
            ],
            [
                20816,
                20862
            ],
            [
                20862,
                20898
            ],
            [
                20910,
                20913
            ],
            [
                20923,
                20931
            ],
            [
                20933,
                21035
            ],
            [
                21035,
                21051
            ],
            [
                21052,
                21055
            ],
            [
                21066,
                21097
            ],
            [
                21098,
                21120
            ],
            [
                21121,
                21130
            ],
            [
                21131,
                21136
            ],
            [
                21136,
                21225
            ],
            [
                21225,
                21340
            ],
            [
                21341,
                21386
            ],
            [
                21388,
                21467
            ],
            [
                21468,
                21474
            ],
            [
                21475,
                21483
            ],
            [
                21486,
                21493
            ],
            [
                21494,
                21499
            ],
            [
                21504,
                21511
            ],
            [
                21512,
                21524
            ],
            [
                21524,
                21527
            ],
            [
                21527,
                21528
            ],
            [
                21535,
                21558
            ],
            [
                21558,
                21637
            ],
            [
                21637,
                21639
            ],
            [
                21640,
                21661
            ],
            [
                21662,
                21690
            ],
            [
                21695,
                21715
            ],
            [
                21716,
                21718
            ],
            [
                21726,
                21735
            ],
            [
                21736,
                21738
            ],
            [
                21739,
                21766
            ],
            [
                21766,
                21771
            ],
            [
                21772,
                21776
            ],
            [
                21777,
                21798
            ],
            [
                21798,
                21800
            ],
            [
                21800,
                21824
            ],
            [
                21827,
                21847
            ],
            [
                21850,
                21891
            ],
            [
                21892,
                21912
            ],
            [
                21913,
                21933
            ],
            [
                21933,
                21936
            ],
            [
                21937,
                21941
            ],
            [
                21960,
                21971
            ],
            [
                21971,
                21973
            ],
            [
                21973,
                21993
            ],
            [
                21994,
                22045
            ],
            [
                22045,
                22048
            ],
            [
                22054,
                22082
            ],
            [
                22089,
                22098
            ],
            [
                22098,
                22121
            ],
            [
                22126,
                22177
            ],
            [
                22177,
                22225
            ],
            [
                22232,
                22234
            ],
            [
                22235,
                22239
            ],
            [
                22239,
                22240
            ],
            [
                22241,
                22264
            ],
            [
                22265,
                22274
            ],
            [
                22275,
                22294
            ],
            [
                22295,
                22298
            ],
            [
                22299,
                22330
            ],
            [
                22330,
                22331
            ],
            [
                22332,
                22335
            ],
            [
                22344,
                22351
            ],
            [
                22362,
                22363
            ],
            [
                22364,
                22367
            ],
            [
                22368,
                22373
            ],
            [
                22378,
                22381
            ],
            [
                22382,
                22393
            ],
            [
                22394,
                22410
            ],
            [
                22413,
                22446
            ],
            [
                22454,
                22456
            ],
            [
                22456,
                22472
            ],
            [
                22473,
                22496
            ],
            [
                22497,
                22538
            ],
            [
                22538,
                22669
            ],
            [
                22669,
                22698
            ],
            [
                22698,
                22712
            ],
            [
                22713,
                22785
            ],
            [
                22785,
                22788
            ],
            [
                22788,
                22792
            ],
            [
                22793,
                22796
            ],
            [
                22797,
                22800
            ],
            [
                22806,
                22848
            ],
            [
                22848,
                22849
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                137
            ],
            [
                137,
                137
            ],
            [
                137,
                137
            ],
            [
                137,
                137
            ],
            [
                137,
                137
            ],
            [
                137,
                542
            ],
            [
                542,
                542
            ],
            [
                542,
                542
            ],
            [
                542,
                698
            ],
            [
                698,
                874
            ],
            [
                874,
                1173
            ],
            [
                1173,
                1173
            ],
            [
                1173,
                1274
            ],
            [
                1274,
                1274
            ],
            [
                1274,
                1274
            ],
            [
                1274,
                1274
            ],
            [
                1274,
                1358
            ],
            [
                1358,
                1656
            ],
            [
                1656,
                1656
            ],
            [
                1656,
                1868
            ],
            [
                1868,
                1868
            ],
            [
                1868,
                2102
            ],
            [
                2102,
                2369
            ],
            [
                2369,
                2408
            ],
            [
                2408,
                2630
            ],
            [
                2630,
                2630
            ],
            [
                2630,
                2780
            ],
            [
                2780,
                2970
            ],
            [
                2970,
                3142
            ],
            [
                3142,
                3375
            ],
            [
                3375,
                3375
            ],
            [
                3375,
                3560
            ],
            [
                3560,
                3858
            ],
            [
                3858,
                3858
            ],
            [
                3858,
                3858
            ],
            [
                3858,
                3942
            ],
            [
                3942,
                4121
            ],
            [
                4121,
                4172
            ],
            [
                4172,
                4381
            ],
            [
                4381,
                4517
            ],
            [
                4517,
                4636
            ],
            [
                4636,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4792
            ],
            [
                4792,
                4866
            ],
            [
                4866,
                5051
            ],
            [
                5051,
                5219
            ],
            [
                5219,
                5219
            ],
            [
                5219,
                5219
            ],
            [
                5219,
                5219
            ],
            [
                5219,
                5219
            ],
            [
                5219,
                5219
            ],
            [
                5219,
                5418
            ],
            [
                5418,
                5514
            ],
            [
                5514,
                5546
            ],
            [
                5546,
                5651
            ],
            [
                5651,
                5651
            ],
            [
                5651,
                5756
            ],
            [
                5756,
                5756
            ],
            [
                5756,
                5774
            ],
            [
                5774,
                5979
            ],
            [
                5979,
                5979
            ],
            [
                5979,
                5979
            ],
            [
                5979,
                6157
            ],
            [
                6157,
                6198
            ],
            [
                6198,
                6268
            ],
            [
                6268,
                6413
            ],
            [
                6413,
                6456
            ],
            [
                6456,
                6507
            ],
            [
                6507,
                6507
            ],
            [
                6507,
                6725
            ],
            [
                6725,
                6776
            ],
            [
                6776,
                6791
            ],
            [
                6791,
                6806
            ],
            [
                6806,
                6910
            ],
            [
                6910,
                6946
            ],
            [
                6946,
                7073
            ],
            [
                7073,
                7426
            ],
            [
                7426,
                7598
            ],
            [
                7598,
                7744
            ],
            [
                7744,
                7835
            ],
            [
                7835,
                7850
            ],
            [
                7850,
                7850
            ],
            [
                7850,
                7995
            ],
            [
                7995,
                7995
            ],
            [
                7995,
                8087
            ],
            [
                8087,
                8167
            ],
            [
                8167,
                8292
            ],
            [
                8292,
                8388
            ],
            [
                8388,
                8454
            ],
            [
                8454,
                8703
            ],
            [
                8703,
                8774
            ],
            [
                8774,
                9019
            ],
            [
                9019,
                9019
            ],
            [
                9019,
                9116
            ],
            [
                9116,
                9252
            ],
            [
                9252,
                9271
            ],
            [
                9271,
                9369
            ],
            [
                9369,
                9463
            ],
            [
                9463,
                9511
            ],
            [
                9511,
                9582
            ],
            [
                9582,
                9682
            ],
            [
                9682,
                9759
            ],
            [
                9759,
                9852
            ],
            [
                9852,
                9997
            ],
            [
                9997,
                10097
            ],
            [
                10097,
                10284
            ],
            [
                10284,
                10358
            ],
            [
                10358,
                10514
            ],
            [
                10514,
                10588
            ],
            [
                10588,
                10688
            ],
            [
                10688,
                10763
            ],
            [
                10763,
                10815
            ],
            [
                10815,
                10825
            ],
            [
                10825,
                10905
            ],
            [
                10905,
                10905
            ],
            [
                10905,
                10942
            ],
            [
                10942,
                11016
            ],
            [
                11016,
                11062
            ],
            [
                11062,
                11111
            ],
            [
                11111,
                11259
            ],
            [
                11259,
                11287
            ],
            [
                11287,
                11498
            ],
            [
                11498,
                11767
            ],
            [
                11767,
                11767
            ],
            [
                11767,
                11767
            ],
            [
                11767,
                11831
            ],
            [
                11831,
                11831
            ],
            [
                11831,
                11831
            ],
            [
                11831,
                11831
            ],
            [
                11831,
                11906
            ],
            [
                11906,
                11933
            ],
            [
                11933,
                11960
            ],
            [
                11960,
                11990
            ],
            [
                11990,
                11990
            ],
            [
                11990,
                11990
            ],
            [
                11990,
                12015
            ],
            [
                12015,
                12049
            ],
            [
                12049,
                12145
            ],
            [
                12145,
                12188
            ],
            [
                12188,
                12253
            ],
            [
                12253,
                12279
            ],
            [
                12279,
                12323
            ],
            [
                12323,
                12427
            ],
            [
                12427,
                12531
            ],
            [
                12531,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                12646
            ],
            [
                12646,
                12691
            ],
            [
                12691,
                12736
            ],
            [
                12736,
                12762
            ],
            [
                12762,
                12823
            ],
            [
                12823,
                12904
            ],
            [
                12904,
                12939
            ],
            [
                12939,
                12975
            ],
            [
                12975,
                12999
            ],
            [
                12999,
                12999
            ],
            [
                12999,
                12999
            ],
            [
                12999,
                13046
            ],
            [
                13046,
                13092
            ],
            [
                13092,
                13126
            ],
            [
                13126,
                13146
            ],
            [
                13146,
                13209
            ],
            [
                13209,
                13257
            ],
            [
                13257,
                13257
            ],
            [
                13257,
                13343
            ],
            [
                13343,
                13448
            ],
            [
                13448,
                13582
            ],
            [
                13582,
                13582
            ],
            [
                13582,
                13582
            ],
            [
                13582,
                13710
            ],
            [
                13710,
                13784
            ],
            [
                13784,
                13832
            ],
            [
                13832,
                13869
            ],
            [
                13869,
                13924
            ],
            [
                13924,
                13924
            ],
            [
                13924,
                13965
            ],
            [
                13965,
                13999
            ],
            [
                13999,
                14068
            ],
            [
                14068,
                14124
            ],
            [
                14124,
                14192
            ],
            [
                14192,
                14226
            ],
            [
                14226,
                14226
            ],
            [
                14226,
                14301
            ],
            [
                14301,
                14301
            ],
            [
                14301,
                14301
            ],
            [
                14301,
                14369
            ],
            [
                14369,
                14511
            ],
            [
                14511,
                14515
            ],
            [
                14515,
                14529
            ],
            [
                14529,
                14554
            ],
            [
                14554,
                14627
            ],
            [
                14627,
                14815
            ],
            [
                14815,
                14815
            ],
            [
                14815,
                14893
            ],
            [
                14893,
                15014
            ],
            [
                15014,
                15170
            ],
            [
                15170,
                15305
            ],
            [
                15305,
                15482
            ],
            [
                15482,
                15482
            ],
            [
                15482,
                15831
            ],
            [
                15831,
                16121
            ],
            [
                16121,
                16445
            ],
            [
                16445,
                16445
            ],
            [
                16445,
                16524
            ],
            [
                16524,
                16629
            ],
            [
                16629,
                16711
            ],
            [
                16711,
                16881
            ],
            [
                16881,
                17084
            ],
            [
                17084,
                17308
            ],
            [
                17308,
                17351
            ],
            [
                17351,
                17454
            ],
            [
                17454,
                17507
            ],
            [
                17507,
                17612
            ],
            [
                17612,
                17621
            ],
            [
                17621,
                17656
            ],
            [
                17656,
                17656
            ],
            [
                17656,
                17712
            ],
            [
                17712,
                17756
            ],
            [
                17756,
                17789
            ],
            [
                17789,
                17878
            ],
            [
                17878,
                17951
            ],
            [
                17951,
                18144
            ],
            [
                18144,
                18196
            ],
            [
                18196,
                18206
            ],
            [
                18206,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18236
            ],
            [
                18236,
                18289
            ],
            [
                18289,
                18289
            ],
            [
                18289,
                18418
            ],
            [
                18418,
                18418
            ],
            [
                18418,
                18556
            ],
            [
                18556,
                18593
            ],
            [
                18593,
                18723
            ],
            [
                18723,
                18873
            ],
            [
                18873,
                18892
            ],
            [
                18892,
                18954
            ],
            [
                18954,
                19067
            ],
            [
                19067,
                19067
            ],
            [
                19067,
                19147
            ],
            [
                19147,
                19199
            ],
            [
                19199,
                19237
            ],
            [
                19237,
                19256
            ],
            [
                19256,
                19584
            ],
            [
                19584,
                19584
            ],
            [
                19584,
                19683
            ],
            [
                19683,
                19749
            ],
            [
                19749,
                19786
            ],
            [
                19786,
                19786
            ],
            [
                19786,
                19786
            ],
            [
                19786,
                19786
            ],
            [
                19786,
                19786
            ],
            [
                19786,
                19786
            ],
            [
                19786,
                19825
            ],
            [
                19825,
                19846
            ],
            [
                19846,
                20034
            ],
            [
                20034,
                20103
            ],
            [
                20103,
                20186
            ],
            [
                20186,
                20208
            ],
            [
                20208,
                20273
            ],
            [
                20273,
                20397
            ],
            [
                20397,
                20465
            ],
            [
                20465,
                20549
            ],
            [
                20549,
                20571
            ],
            [
                20571,
                20673
            ],
            [
                20673,
                20673
            ],
            [
                20673,
                20746
            ],
            [
                20746,
                20816
            ],
            [
                20816,
                20862
            ],
            [
                20862,
                20933
            ],
            [
                20933,
                21035
            ],
            [
                21035,
                21136
            ],
            [
                21136,
                21225
            ],
            [
                21225,
                21388
            ],
            [
                21388,
                21527
            ],
            [
                21527,
                21558
            ],
            [
                21558,
                21640
            ],
            [
                21640,
                21640
            ],
            [
                21640,
                21640
            ],
            [
                21640,
                21662
            ],
            [
                21662,
                21800
            ],
            [
                21800,
                21827
            ],
            [
                21827,
                21827
            ],
            [
                21827,
                21827
            ],
            [
                21827,
                21913
            ],
            [
                21913,
                21913
            ],
            [
                21913,
                21933
            ],
            [
                21933,
                21973
            ],
            [
                21973,
                22045
            ],
            [
                22045,
                22098
            ],
            [
                22098,
                22177
            ],
            [
                22177,
                22332
            ],
            [
                22332,
                22456
            ],
            [
                22456,
                22538
            ],
            [
                22538,
                22669
            ],
            [
                22669,
                22698
            ],
            [
                22698,
                22713
            ],
            [
                22713,
                22713
            ],
            [
                22713,
                22788
            ],
            [
                22788,
                22788
            ],
            [
                22788,
                22788
            ],
            [
                22788,
                22788
            ],
            [
                22788,
                22849
            ]
        ]
    }
}