{
    "original": {
        "text": "\"My desolation does begin to make A better life.\" --SHAKESPEARE: _Antony and Cleopatra._\nBefore Deronda was summoned to a second interview with his mother, a day had passed in which she had only sent him a message to say that she was not yet well enough to receive him again; but on the third morning he had a note saying, \"I leave to-day. Come and see me at once.\"\nHe was shown into the same room as before; but it was much darkened with blinds and curtains. The Princess was not there, but she presently entered, dressed in a loose wrap of some soft silk, in color a dusky orange, her head again with black lace floating about it, her arms showing themselves bare from under her wide sleeves. Her face seemed even more impressive in the sombre light, the eyes larger, the lines more vigorous. You might have imagined her a sorceress who would stretch forth her wonderful hand and arm to mix youth-potions for others, but scorned to mix them for herself, having had enough of youth.\nShe put her arms on her son's shoulders at once, and kissed him on both cheeks, then seated herself among her cushions with an air of assured firmness and dignity unlike her fitfulness in their first interview, and told Deronda to sit down by her. He obeyed, saying, \"You are quite relieved now, I trust?\"\n\"Yes, I am at ease again. Is there anything more that you would like to ask me?\" she said, with the matter of a queen rather than of a mother.\n\"Can I find the house in Genoa where you used to live with my grandfather?\" said Deronda.\n\"No,\" she answered, with a deprecating movement of her arm, \"it is pulled down--not to be found. But about our family, and where my father lived at various times--you will find all that among the papers in the chest, better than I can tell you. My father, I told you, was a physician. My mother was a Morteira. I used to hear all those things without listening. You will find them all. I was born amongst them without my will. I banished them as soon as I could.\"\nDeronda tried to hide his pained feeling, and said, \"Anything else that I should desire to know from you could only be what it is some satisfaction to your own feeling to tell me.\"\n\"I think I have told you everything that could be demanded of me,\" said the Princess, looking coldly meditative. It seemed as if she had exhausted her emotion in their former interview. The fact was, she had said to herself, \"I have done it all. I have confessed all. I will not go through it again. I will save myself from agitation.\" And she was acting out that scheme.\nBut to Deronda's nature the moment was cruel; it made the filial yearning of his life a disappointed pilgrimage to a shrine where there were no longer the symbols of sacredness. It seemed that all the woman lacking in her was present in him, as he said, with some tremor in his voice,\n\"Then are we to part and I never be anything to you?\"\n\"It is better so,\" said the Princess, in a softer, mellower voice. \"There could be nothing but hard duty for you, even if it were possible for you to take the place of my son. You would not love me. Don't deny it,\" she said, abruptly, putting up her hand. \"I know what is the truth. You don't like what I did. You are angry with me. You think I robbed you of something. You are on your grandfather's side, and you will always have a condemnation of me in your heart.\"\nDeronda felt himself under a ban of silence. He rose from his seat by her, preferring to stand, if he had to obey that imperious prohibition of any tenderness. But his mother now looked up at him with a new admiration in her glance, saying,\n\"You are wrong to be angry with me. You are the better for what I did.\" After pausing a little, she added, abruptly, \"And now tell me what you shall do?\"\n\"Do you mean now, immediately,\" said Deronda; \"or as to the course of my future life?\"\n\"I mean in the future. What difference will it make to you that I have told you about your birth?\"\n\"A very great difference,\" said Deronda, emphatically. \"I can hardly think of anything that would make a greater difference.\"\n\"What shall you do then?\" said the Princess, with more sharpness. \"Make yourself just like your grandfather--be what he wished you--turn yourself into a Jew like him?\"\n\"That is impossible. The effect of my education can never be done away with. The Christian sympathies in which my mind was reared can never die out of me,\" said Deronda, with increasing tenacity of tone. \"But I consider it my duty--it is the impulse of my feeling--to identify myself, as far as possible, with my hereditary people, and if I can see any work to be done for them that I can give my soul and hand to I shall choose to do it.\"\nHis mother had her eyes fixed on him with a wondering speculation, examining his face as if she thought that by close attention she could read a difficult language there. He bore her gaze very firmly, sustained by a resolute opposition, which was the expression of his fullest self. She bent toward him a little, and said, with a decisive emphasis,\n\"You are in love with a Jewess.\"\nDeronda colored and said, \"My reasons would be independent of any such fact.\"\n\"I know better. I have seen what men are,\" said the Princess, peremptorily. \"Tell me the truth. She is a Jewess who will not accept any one but a Jew. There _are_ a few such,\" she added, with a touch of scorn.\nDeronda had that objection to answer which we all have known in speaking to those who are too certain of their own fixed interpretations to be enlightened by anything we may say. But besides this, the point immediately in question was one on which he felt a repugnance either to deny or affirm. He remained silent, and she presently said,\n\"You love her as your father loved me, and she draws you after her as I drew him.\"\nThose words touched Deronda's filial imagination, and some tenderness in his glance was taken by his mother as an assent. She went on with rising passion: \"But I was leading him the other way. And now your grandfather is getting his revenge.\"\n\"Mother,\" said Deronda, remonstrantly, \"don't let us think of it in that way. I will admit that there may come some benefit from the education you chose for me. I prefer cherishing the benefit with gratitude, to dwelling with resentment on the injury. I think it would have been right that I should have been brought up with the consciousness that I was a Jew, but it must always have been a good to me to have as wide an instruction and sympathy as possible. And now, you have restored me my inheritance--events have brought a fuller restitution than you could have made--you have been saved from robbing my people of my service and me of my duty: can you not bring your whole soul to consent to this?\"\nDeronda paused in his pleading: his mother looked at him listeningly, as if the cadence of his voice were taking her ear, yet she shook her head slowly. He began again, even more urgently.\n\"You have told me that you sought what you held the best for me: open your heart to relenting and love toward my grandfather, who sought what he held the best for you.\"\n\"Not for me, no,\" she said, shaking her head with more absolute denial, and folding her arms tightly. \"I tell you, he never thought of his daughter except as an instrument. Because I had wants outside his purpose, I was to be put in a frame and tortured. If that is the right law for the world, I will not say that I love it. If my acts were wrong--if it is God who is exacting from me that I should deliver up what I withheld--who is punishing me because I deceived my father and did not warn him that I should contradict his trust--well, I have told everything. I have done what I could. And _your_ soul consents. That is enough. I have after all been the instrument my father wanted.--'I desire a grandson who shall have a true Jewish heart. Every Jew should rear his family as if he hoped that a Deliverer might spring from it.'\"\nIn uttering these last sentences the Princess narrowed her eyes, waved her head up and down, and spoke slowly with a new kind of chest-voice, as if she were quoting unwillingly.\n\"Were those my grandfather's words?\" said Deronda.\n\"Yes, yes; and you will find them written. I wanted to thwart him,\" said the Princess, with a sudden outburst of the passion she had shown in the former interview. Then she added more slowly, \"You would have me love what I have hated from the time I was so high\"--here she held her left hand a yard from the floor.--\"That can never be. But what does it matter? His yoke has been on me, whether I loved it or not. You are the grandson he wanted. You speak as men do--as if you felt yourself wise. What does it all mean?\"\nHer tone was abrupt and scornful. Deronda, in his pained feeling, and under the solemn urgency of the moment, had to keep a clutching remembrance of their relationship, lest his words should become cruel. He began in a deep entreating tone:\n\"Mother, don't say that I feel myself wise. We are set in the midst of difficulties. I see no other way to get any clearness than by being truthful--not by keeping back facts which may--which should carry obligation within them--which should make the only guidance toward duty. No wonder if such facts come to reveal themselves in spite of concealments. The effects prepared by generations are likely to triumph over a contrivance which would bend them all to the satisfaction of self. Your will was strong, but my grandfather's trust which you accepted and did not fulfill--what you call his yoke--is the expression of something stronger, with deeper, farther-spreading roots, knit into the foundations of sacredness for all men. You renounced me--you still banish me--as a son\"--there was an involuntary movement of indignation in Deronda's voice--\"But that stronger Something has determined that I shall be all the more the grandson whom also you willed to annihilate.\"\nHis mother was watching him fixedly, and again her face gathered admiration. After a moment's silence she said, in a low, persuasive tone,\n\"Sit down again,\" and he obeyed, placing himself beside her. She laid her hand on his shoulder and went on,\n\"You rebuke me. Well--I am the loser. And you are angry because I banish you. What could you do for me but weary your own patience? Your mother is a shattered woman. My sense of life is little more than a sense of what was--except when the pain is present. You reproach me that I parted with you. I had joy enough without you then. Now you are come back to me, and I cannot make you a joy. Have you the cursing spirit of the Jew in you? Are you not able to forgive me? Shall you be glad to think that I am punished because I was not a Jewish mother to you?\"\n\"How can you ask me that?\" said Deronda, remonstrantly. \"Have I not besought you that I might now at least be a son to you? My grief is that you have declared me helpless to comfort you. I would give up much that is dear for the sake of soothing your anguish.\"\n\"You shall give up nothing,\" said his mother, with the hurry of agitation. \"You shall be happy. You shall let me think of you as happy. I shall have done you no harm. You have no reason to curse me. You shall feel for me as they feel for the dead whom they say prayers for--you shall long that I may be freed from all suffering--from all punishment. And I shall see you instead of always seeing your grandfather. Will any harm come to me because I broke his trust in the daylight after he was gone into darkness? I cannot tell:--if you think _Kaddish_ will help me--say it, say it. You will come between me and the dead. When I am in your mind, you will look as you do now--always as if you were a tender son--always--as if I had been a tender mother.\"\nShe seemed resolved that her agitation should not conquer her, but he felt her hand trembling on his shoulder. Deep, deep compassion hemmed in all words. With a face of beseeching he put his arm around her and pressed her head tenderly under his. They sat so for some moments. Then she lifted her head again and rose from her seat with a great sigh, as if in that breath she were dismissing a weight of thoughts. Deronda, standing in front of her, felt that the parting was near. But one of her swift alternations had come upon his mother.\n\"Is she beautiful?\" she said, abruptly.\n\"Who?\" said Deronda, changing color.\n\"The woman you love.\"\nIt was not a moment for deliberate explanation. He was obliged to say, \"Yes.\"\n\"Not ambitious?\"\n\"No, I think not.\"\n\"Not one who must have a path of her own?\"\n\"I think her nature is not given to make great claims.\"\n\"She is not like that?\" said the Princess, taking from her wallet a miniature with jewels around it, and holding it before her son. It was her own in all the fire of youth, and as Deronda looked at it with admiring sadness, she said, \"Had I not a rightful claim to be something more than a mere daughter and mother? The voice and the genius matched the face. Whatever else was wrong, acknowledge that I had a right to be an artist, though my father's will was against it. My nature gave me a charter.\"\n\"I do acknowledge that,\" said Deronda, looking from the miniature to her face, which even in its worn pallor had an expression of living force beyond anything that the pencil could show.\n\"Will you take the portrait?\" said the Princess, more gently. \"If she is a kind woman, teach her to think of me kindly.\"\n\"I shall be grateful for the portrait,\" said Deronda, \"but--I ought to say, I have no assurance that she whom I love will have any love for me. I have kept silence.\"\n\"Who and what is she?\" said the mother. The question seemed a command.\n\"She was brought up as a singer for the stage,\" said Deronda, with inward reluctance. \"Her father took her away early from her mother, and her life has been unhappy. She is very young--only twenty. Her father wished to bring her up in disregard--even in dislike of her Jewish origin, but she has clung with all her affection to the memory of her mother and the fellowship of her people.\"\n\"Ah, like you. She is attached to the Judaism she knows nothing of,\" said the Princess, peremptorily. \"That is poetry--fit to last through an opera night. Is she fond of her artist's life--is her singing worth anything?\"\n\"Her singing is exquisite. But her voice is not suited to the stage. I think that the artist's life has been made repugnant to her.\"\n\"Why, she is made for you then. Sir Hugo said you were bitterly against being a singer, and I can see that you would never have let yourself be merged in a wife, as your father was.\"\n\"I repeat,\" said Deronda, emphatically--\"I repeat that I have no assurance of her love for me, of the possibility that we can ever be united. Other things--painful issues may lie before me. I have always felt that I should prepare myself to renounce, not cherish that prospect. But I suppose I might feel so of happiness in general. Whether it may come or not, one should try and prepare one's self to do without it.\"\n\"Do you feel in that way?\" said his mother, laying her hands on his shoulders, and perusing his face, while she spoke in a low meditative tone, pausing between her sentences. \"Poor boy!----I wonder how it would have been if I had kept you with me----whether you would have turned your heart to the old things against mine----and we should have quarreled----your grandfather would have been in you----and you would have hampered my life with your young growth from the old root.\"\n\"I think my affection might have lasted through all our quarreling,\" said Deronda, saddened more and more, \"and that would not have hampered--surely it would have enriched your life.\"\n\"Not then, not then----I did not want it then----I might have been glad of it now,\" said the mother, with a bitter melancholy, \"if I could have been glad of anything.\"\n\"But you love your other children, and they love you?\" said Deronda, anxiously.\n\"Oh, yes,\" she answered, as to a question about a matter of course, while she folded her arms again. \"But,\"----she added in a deeper tone,----\"I am not a loving woman. That is the truth. It is a talent to love--I lack it. Others have loved me--and I have acted their love. I know very well what love makes of men and women--it is subjection. It takes another for a larger self, enclosing this one,\"--she pointed to her own bosom. \"I was never willingly subject to any man. Men have been subject to me.\"\n\"Perhaps the man who was subject was the happier of the two,\" said Deronda--not with a smile, but with a grave, sad sense of his mother's privation.\n\"Perhaps--but I _was_ happy--for a few years I was happy. If I had not been afraid of defeat and failure, I might have gone on. I miscalculated. What then? It is all over. Another life! Men talk of 'another life,' as if it only began on the other side of the grave. I have long entered on another life.\" With the last words she raised her arms till they were bare to the elbow, her brow was contracted in one deep fold, her eyes were closed, her voice was smothered: in her dusky flame-colored garment, she looked like a dreamed visitant from some region of departed mortals.\nDeronda's feeling was wrought to a pitch of acuteness in which he was no longer quite master of himself. He gave an audible sob. His mother opened her eyes, and letting her hands again rest on his shoulders, said,\n\"Good-bye, my son, good-bye. We shall hear no more of each other. Kiss me.\"\nHe clasped his arms round her neck, and they kissed each other.\nDeronda did not know how he got out of the room. He felt an older man. All his boyish yearnings and anxieties about his mother had vanished. He had gone through a tragic experience which must forever solemnize his life and deepen the significance of the acts by which he bound himself to others.",
        "paragraph_chars": [
            [
                0,
                89
            ],
            [
                89,
                366
            ],
            [
                366,
                984
            ],
            [
                984,
                1290
            ],
            [
                1290,
                1433
            ],
            [
                1433,
                1523
            ],
            [
                1523,
                1987
            ],
            [
                1987,
                2168
            ],
            [
                2168,
                2540
            ],
            [
                2540,
                2825
            ],
            [
                2825,
                2879
            ],
            [
                2879,
                3347
            ],
            [
                3347,
                3588
            ],
            [
                3588,
                3742
            ],
            [
                3742,
                3829
            ],
            [
                3829,
                3928
            ],
            [
                3928,
                4054
            ],
            [
                4054,
                4222
            ],
            [
                4222,
                4662
            ],
            [
                4662,
                5011
            ],
            [
                5011,
                5044
            ],
            [
                5044,
                5122
            ],
            [
                5122,
                5332
            ],
            [
                5332,
                5671
            ],
            [
                5671,
                5754
            ],
            [
                5754,
                5997
            ],
            [
                5997,
                6701
            ],
            [
                6701,
                6890
            ],
            [
                6890,
                7059
            ],
            [
                7059,
                7893
            ],
            [
                7893,
                8071
            ],
            [
                8071,
                8122
            ],
            [
                8122,
                8642
            ],
            [
                8642,
                8883
            ],
            [
                8883,
                9856
            ],
            [
                9856,
                9995
            ],
            [
                9995,
                10103
            ],
            [
                10103,
                10661
            ],
            [
                10661,
                10922
            ],
            [
                10922,
                11675
            ],
            [
                11675,
                12215
            ],
            [
                12215,
                12255
            ],
            [
                12255,
                12292
            ],
            [
                12292,
                12314
            ],
            [
                12314,
                12392
            ],
            [
                12392,
                12409
            ],
            [
                12409,
                12428
            ],
            [
                12428,
                12471
            ],
            [
                12471,
                12527
            ],
            [
                12527,
                13029
            ],
            [
                13029,
                13216
            ],
            [
                13216,
                13337
            ],
            [
                13337,
                13503
            ],
            [
                13503,
                13574
            ],
            [
                13574,
                13962
            ],
            [
                13962,
                14183
            ],
            [
                14183,
                14316
            ],
            [
                14316,
                14499
            ],
            [
                14499,
                14917
            ],
            [
                14917,
                15396
            ],
            [
                15396,
                15580
            ],
            [
                15580,
                15748
            ],
            [
                15748,
                15828
            ],
            [
                15828,
                16331
            ],
            [
                16331,
                16480
            ],
            [
                16480,
                17056
            ],
            [
                17056,
                17270
            ],
            [
                17270,
                17346
            ],
            [
                17346,
                17410
            ],
            [
                17410,
                17705
            ]
        ],
        "segment_chars": [
            [
                0,
                50
            ],
            [
                50,
                89
            ],
            [
                89,
                340
            ],
            [
                340,
                366
            ],
            [
                366,
                460
            ],
            [
                460,
                695
            ],
            [
                695,
                795
            ],
            [
                795,
                984
            ],
            [
                984,
                1232
            ],
            [
                1232,
                1290
            ],
            [
                1290,
                1316
            ],
            [
                1316,
                1371
            ],
            [
                1371,
                1433
            ],
            [
                1433,
                1509
            ],
            [
                1509,
                1523
            ],
            [
                1523,
                1620
            ],
            [
                1620,
                1768
            ],
            [
                1768,
                1808
            ],
            [
                1808,
                1834
            ],
            [
                1834,
                1885
            ],
            [
                1885,
                1909
            ],
            [
                1909,
                1950
            ],
            [
                1950,
                1987
            ],
            [
                1987,
                2168
            ],
            [
                2168,
                2281
            ],
            [
                2281,
                2354
            ],
            [
                2354,
                2414
            ],
            [
                2414,
                2436
            ],
            [
                2436,
                2468
            ],
            [
                2468,
                2504
            ],
            [
                2504,
                2540
            ],
            [
                2540,
                2718
            ],
            [
                2718,
                2825
            ],
            [
                2825,
                2879
            ],
            [
                2879,
                2946
            ],
            [
                2946,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3162
            ],
            [
                3162,
                3189
            ],
            [
                3189,
                3212
            ],
            [
                3212,
                3249
            ],
            [
                3249,
                3347
            ],
            [
                3347,
                3392
            ],
            [
                3392,
                3507
            ],
            [
                3507,
                3588
            ],
            [
                3588,
                3624
            ],
            [
                3624,
                3660
            ],
            [
                3660,
                3742
            ],
            [
                3742,
                3829
            ],
            [
                3829,
                3852
            ],
            [
                3852,
                3928
            ],
            [
                3928,
                3983
            ],
            [
                3983,
                4054
            ],
            [
                4054,
                4080
            ],
            [
                4080,
                4120
            ],
            [
                4120,
                4222
            ],
            [
                4222,
                4243
            ],
            [
                4243,
                4299
            ],
            [
                4299,
                4426
            ],
            [
                4426,
                4662
            ],
            [
                4662,
                4833
            ],
            [
                4833,
                4945
            ],
            [
                4945,
                5011
            ],
            [
                5011,
                5044
            ],
            [
                5044,
                5122
            ],
            [
                5122,
                5138
            ],
            [
                5138,
                5198
            ],
            [
                5198,
                5218
            ],
            [
                5218,
                5273
            ],
            [
                5273,
                5332
            ],
            [
                5332,
                5511
            ],
            [
                5511,
                5627
            ],
            [
                5627,
                5671
            ],
            [
                5671,
                5754
            ],
            [
                5754,
                5876
            ],
            [
                5876,
                5947
            ],
            [
                5947,
                5997
            ],
            [
                5997,
                6075
            ],
            [
                6075,
                6158
            ],
            [
                6158,
                6249
            ],
            [
                6249,
                6457
            ],
            [
                6457,
                6701
            ],
            [
                6701,
                6854
            ],
            [
                6854,
                6890
            ],
            [
                6890,
                7059
            ],
            [
                7059,
                7161
            ],
            [
                7161,
                7232
            ],
            [
                7232,
                7314
            ],
            [
                7314,
                7385
            ],
            [
                7385,
                7623
            ],
            [
                7623,
                7649
            ],
            [
                7649,
                7675
            ],
            [
                7675,
                7691
            ],
            [
                7691,
                7804
            ],
            [
                7804,
                7893
            ],
            [
                7893,
                8071
            ],
            [
                8071,
                8108
            ],
            [
                8108,
                8122
            ],
            [
                8122,
                8165
            ],
            [
                8165,
                8286
            ],
            [
                8286,
                8458
            ],
            [
                8458,
                8483
            ],
            [
                8483,
                8535
            ],
            [
                8535,
                8567
            ],
            [
                8567,
                8618
            ],
            [
                8618,
                8642
            ],
            [
                8642,
                8676
            ],
            [
                8676,
                8847
            ],
            [
                8847,
                8883
            ],
            [
                8883,
                8927
            ],
            [
                8927,
                8968
            ],
            [
                8968,
                9161
            ],
            [
                9161,
                9237
            ],
            [
                9237,
                9369
            ],
            [
                9369,
                9614
            ],
            [
                9614,
                9856
            ],
            [
                9856,
                9933
            ],
            [
                9933,
                9995
            ],
            [
                9995,
                10056
            ],
            [
                10056,
                10103
            ],
            [
                10103,
                10119
            ],
            [
                10119,
                10141
            ],
            [
                10141,
                10181
            ],
            [
                10181,
                10235
            ],
            [
                10235,
                10269
            ],
            [
                10269,
                10360
            ],
            [
                10360,
                10400
            ],
            [
                10400,
                10435
            ],
            [
                10435,
                10493
            ],
            [
                10493,
                10540
            ],
            [
                10540,
                10572
            ],
            [
                10572,
                10661
            ],
            [
                10661,
                10688
            ],
            [
                10688,
                10717
            ],
            [
                10717,
                10785
            ],
            [
                10785,
                10848
            ],
            [
                10848,
                10922
            ],
            [
                10922,
                10997
            ],
            [
                10997,
                11018
            ],
            [
                11018,
                11058
            ],
            [
                11058,
                11089
            ],
            [
                11089,
                11121
            ],
            [
                11121,
                11272
            ],
            [
                11272,
                11335
            ],
            [
                11335,
                11435
            ],
            [
                11435,
                11504
            ],
            [
                11504,
                11543
            ],
            [
                11543,
                11675
            ],
            [
                11675,
                11786
            ],
            [
                11786,
                11829
            ],
            [
                11829,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                12088
            ],
            [
                12088,
                12155
            ],
            [
                12155,
                12215
            ],
            [
                12215,
                12235
            ],
            [
                12235,
                12255
            ],
            [
                12255,
                12262
            ],
            [
                12262,
                12292
            ],
            [
                12292,
                12314
            ],
            [
                12314,
                12362
            ],
            [
                12362,
                12392
            ],
            [
                12392,
                12409
            ],
            [
                12409,
                12428
            ],
            [
                12428,
                12471
            ],
            [
                12471,
                12527
            ],
            [
                12527,
                12551
            ],
            [
                12551,
                12659
            ],
            [
                12659,
                12843
            ],
            [
                12843,
                12886
            ],
            [
                12886,
                12999
            ],
            [
                12999,
                13029
            ],
            [
                13029,
                13216
            ],
            [
                13216,
                13246
            ],
            [
                13246,
                13278
            ],
            [
                13278,
                13337
            ],
            [
                13337,
                13481
            ],
            [
                13481,
                13503
            ],
            [
                13503,
                13526
            ],
            [
                13526,
                13543
            ],
            [
                13543,
                13574
            ],
            [
                13574,
                13660
            ],
            [
                13660,
                13740
            ],
            [
                13740,
                13772
            ],
            [
                13772,
                13962
            ],
            [
                13962,
                13977
            ],
            [
                13977,
                14064
            ],
            [
                14064,
                14117
            ],
            [
                14117,
                14183
            ],
            [
                14183,
                14210
            ],
            [
                14210,
                14252
            ],
            [
                14252,
                14316
            ],
            [
                14316,
                14348
            ],
            [
                14348,
                14499
            ],
            [
                14499,
                14641
            ],
            [
                14641,
                14689
            ],
            [
                14689,
                14777
            ],
            [
                14777,
                14832
            ],
            [
                14832,
                14917
            ],
            [
                14917,
                14944
            ],
            [
                14944,
                15092
            ],
            [
                15092,
                15396
            ],
            [
                15396,
                15580
            ],
            [
                15580,
                15748
            ],
            [
                15748,
                15803
            ],
            [
                15803,
                15828
            ],
            [
                15828,
                15929
            ],
            [
                15929,
                15996
            ],
            [
                15996,
                16015
            ],
            [
                16015,
                16050
            ],
            [
                16050,
                16101
            ],
            [
                16101,
                16170
            ],
            [
                16170,
                16258
            ],
            [
                16258,
                16301
            ],
            [
                16301,
                16331
            ],
            [
                16331,
                16480
            ],
            [
                16480,
                16538
            ],
            [
                16538,
                16608
            ],
            [
                16608,
                16625
            ],
            [
                16625,
                16636
            ],
            [
                16636,
                16652
            ],
            [
                16652,
                16666
            ],
            [
                16666,
                16746
            ],
            [
                16746,
                16784
            ],
            [
                16784,
                17056
            ],
            [
                17056,
                17161
            ],
            [
                17161,
                17185
            ],
            [
                17185,
                17270
            ],
            [
                17270,
                17299
            ],
            [
                17299,
                17336
            ],
            [
                17336,
                17346
            ],
            [
                17346,
                17410
            ],
            [
                17410,
                17459
            ],
            [
                17459,
                17481
            ],
            [
                17481,
                17551
            ],
            [
                17551,
                17705
            ]
        ],
        "overlap_chars": [
            [
                280,
                300
            ],
            [
                139,
                155
            ],
            [
                96,
                103
            ],
            [
                304,
                314
            ],
            [
                315,
                331
            ],
            [
                338,
                340
            ],
            [
                340,
                366
            ],
            [
                366,
                407
            ],
            [
                409,
                412
            ],
            [
                425,
                445
            ],
            [
                458,
                460
            ],
            [
                460,
                472
            ],
            [
                496,
                541
            ],
            [
                569,
                581
            ],
            [
                552,
                557
            ],
            [
                598,
                613
            ],
            [
                623,
                628
            ],
            [
                583,
                591
            ],
            [
                693,
                695
            ],
            [
                695,
                795
            ],
            [
                795,
                834
            ],
            [
                982,
                984
            ],
            [
                984,
                987
            ],
            [
                1037,
                1043
            ],
            [
                1048,
                1102
            ],
            [
                1193,
                1231
            ],
            [
                1316,
                1371
            ],
            [
                1371,
                1379
            ],
            [
                1381,
                1385
            ],
            [
                1400,
                1407
            ],
            [
                1431,
                1433
            ],
            [
                1433,
                1509
            ],
            [
                1509,
                1523
            ],
            [
                1523,
                1526
            ],
            [
                1541,
                1542
            ],
            [
                1584,
                1601
            ],
            [
                1618,
                1620
            ],
            [
                1620,
                1623
            ],
            [
                1686,
                1699
            ],
            [
                1624,
                1640
            ],
            [
                1715,
                1738
            ],
            [
                1766,
                1768
            ],
            [
                1768,
                1777
            ],
            [
                1791,
                1808
            ],
            [
                1808,
                1834
            ],
            [
                1885,
                1898
            ],
            [
                1904,
                1907
            ],
            [
                1907,
                1909
            ],
            [
                1909,
                1950
            ],
            [
                1950,
                1987
            ],
            [
                1987,
                2040
            ],
            [
                2114,
                2116
            ],
            [
                2040,
                2053
            ],
            [
                2088,
                2091
            ],
            [
                2155,
                2165
            ],
            [
                2168,
                2252
            ],
            [
                2262,
                2268
            ],
            [
                2279,
                2281
            ],
            [
                2281,
                2354
            ],
            [
                2354,
                2400
            ],
            [
                2409,
                2414
            ],
            [
                2436,
                2466
            ],
            [
                2540,
                2554
            ],
            [
                2564,
                2656
            ],
            [
                2657,
                2663
            ],
            [
                2716,
                2718
            ],
            [
                2785,
                2823
            ],
            [
                2825,
                2857
            ],
            [
                2858,
                2879
            ],
            [
                2879,
                2928
            ],
            [
                2939,
                2946
            ],
            [
                2946,
                2991
            ],
            [
                3053,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3142
            ],
            [
                3151,
                3162
            ],
            [
                3189,
                3212
            ],
            [
                3212,
                3249
            ],
            [
                3249,
                3304
            ],
            [
                3328,
                3347
            ],
            [
                3347,
                3354
            ],
            [
                3383,
                3391
            ],
            [
                3507,
                3532
            ],
            [
                3536,
                3586
            ],
            [
                3588,
                3614
            ],
            [
                3622,
                3624
            ],
            [
                3624,
                3657
            ],
            [
                3722,
                3726
            ],
            [
                3731,
                3736
            ],
            [
                3727,
                3730
            ],
            [
                3737,
                3739
            ],
            [
                3852,
                3880
            ],
            [
                3888,
                3928
            ],
            [
                3928,
                3982
            ],
            [
                4054,
                4080
            ],
            [
                4080,
                4098
            ],
            [
                4104,
                4108
            ],
            [
                4118,
                4120
            ],
            [
                4120,
                4125
            ],
            [
                4191,
                4210
            ],
            [
                4135,
                4161
            ],
            [
                4219,
                4222
            ],
            [
                4222,
                4243
            ],
            [
                4243,
                4297
            ],
            [
                4375,
                4390
            ],
            [
                4424,
                4426
            ],
            [
                4426,
                4430
            ],
            [
                4454,
                4459
            ],
            [
                4445,
                4452
            ],
            [
                4475,
                4477
            ],
            [
                4464,
                4471
            ],
            [
                4487,
                4566
            ],
            [
                4571,
                4579
            ],
            [
                4591,
                4635
            ],
            [
                4636,
                4643
            ],
            [
                4654,
                4662
            ],
            [
                4662,
                4672
            ],
            [
                4695,
                4728
            ],
            [
                4748,
                4753
            ],
            [
                4790,
                4825
            ],
            [
                4739,
                4747
            ],
            [
                4861,
                4862
            ],
            [
                4833,
                4849
            ],
            [
                4943,
                4945
            ],
            [
                4945,
                4948
            ],
            [
                4979,
                4983
            ],
            [
                5011,
                5044
            ],
            [
                5044,
                5051
            ],
            [
                5070,
                5122
            ],
            [
                5122,
                5138
            ],
            [
                5138,
                5182
            ],
            [
                5196,
                5198
            ],
            [
                5198,
                5218
            ],
            [
                5218,
                5253
            ],
            [
                5262,
                5273
            ],
            [
                5273,
                5278
            ],
            [
                5280,
                5283
            ],
            [
                5285,
                5332
            ],
            [
                5774,
                5781
            ],
            [
                5630,
                5670
            ],
            [
                5888,
                5907
            ],
            [
                5671,
                5751
            ],
            [
                5874,
                5875
            ],
            [
                5910,
                5947
            ],
            [
                5947,
                5997
            ],
            [
                5997,
                6004
            ],
            [
                6019,
                6020
            ],
            [
                6037,
                6075
            ],
            [
                6075,
                6076
            ],
            [
                6082,
                6158
            ],
            [
                6158,
                6189
            ],
            [
                6204,
                6249
            ],
            [
                6249,
                6316
            ],
            [
                6340,
                6361
            ],
            [
                6387,
                6393
            ],
            [
                6455,
                6457
            ],
            [
                6457,
                6483
            ],
            [
                6487,
                6501
            ],
            [
                6570,
                6602
            ],
            [
                6631,
                6663
            ],
            [
                6680,
                6701
            ],
            [
                6733,
                6743
            ],
            [
                6846,
                6852
            ],
            [
                6831,
                6845
            ],
            [
                6769,
                6770
            ],
            [
                6854,
                6856
            ],
            [
                6821,
                6822
            ],
            [
                6875,
                6888
            ],
            [
                6868,
                6869
            ],
            [
                6890,
                6970
            ],
            [
                6984,
                6987
            ],
            [
                6974,
                6980
            ],
            [
                6993,
                7059
            ],
            [
                7059,
                7103
            ],
            [
                7129,
                7161
            ],
            [
                7161,
                7162
            ],
            [
                7174,
                7232
            ],
            [
                7232,
                7245
            ],
            [
                7252,
                7314
            ],
            [
                7314,
                7385
            ],
            [
                7385,
                7406
            ],
            [
                7593,
                7623
            ],
            [
                7623,
                7649
            ],
            [
                7691,
                7744
            ],
            [
                7747,
                7802
            ],
            [
                8071,
                8108
            ],
            [
                8108,
                8122
            ],
            [
                8122,
                8131
            ],
            [
                8163,
                8165
            ],
            [
                8165,
                8234
            ],
            [
                8239,
                8246
            ],
            [
                8284,
                8286
            ],
            [
                8314,
                8355
            ],
            [
                8370,
                8375
            ],
            [
                8456,
                8458
            ],
            [
                8458,
                8483
            ],
            [
                8483,
                8535
            ],
            [
                8535,
                8567
            ],
            [
                8567,
                8586
            ],
            [
                8588,
                8618
            ],
            [
                8618,
                8642
            ],
            [
                8642,
                8676
            ],
            [
                8676,
                8684
            ],
            [
                8692,
                8698
            ],
            [
                8750,
                8758
            ],
            [
                8791,
                8846
            ],
            [
                8883,
                8927
            ],
            [
                8968,
                8969
            ],
            [
                9134,
                9138
            ],
            [
                9130,
                9133
            ],
            [
                9139,
                9161
            ],
            [
                9369,
                9417
            ],
            [
                9424,
                9427
            ],
            [
                9543,
                9544
            ],
            [
                9458,
                9480
            ],
            [
                9482,
                9534
            ],
            [
                9554,
                9559
            ],
            [
                9612,
                9614
            ],
            [
                9614,
                9630
            ],
            [
                9632,
                9635
            ],
            [
                9642,
                9651
            ],
            [
                9653,
                9661
            ],
            [
                9664,
                9688
            ],
            [
                9701,
                9731
            ],
            [
                9733,
                9792
            ],
            [
                9806,
                9823
            ],
            [
                9829,
                9856
            ],
            [
                9856,
                9932
            ],
            [
                9995,
                10012
            ],
            [
                10026,
                10027
            ],
            [
                10013,
                10026
            ],
            [
                10054,
                10056
            ],
            [
                10056,
                10101
            ],
            [
                10103,
                10119
            ],
            [
                10145,
                10181
            ],
            [
                10181,
                10235
            ],
            [
                10235,
                10269
            ],
            [
                10360,
                10400
            ],
            [
                10400,
                10428
            ],
            [
                10433,
                10435
            ],
            [
                10435,
                10493
            ],
            [
                10493,
                10540
            ],
            [
                10540,
                10572
            ],
            [
                10572,
                10617
            ],
            [
                10658,
                10661
            ],
            [
                10661,
                10688
            ],
            [
                10688,
                10717
            ],
            [
                10717,
                10728
            ],
            [
                10768,
                10785
            ],
            [
                10785,
                10848
            ],
            [
                10848,
                10868
            ],
            [
                10907,
                10922
            ],
            [
                10922,
                10967
            ],
            [
                10995,
                10997
            ],
            [
                10997,
                11018
            ],
            [
                11058,
                11089
            ],
            [
                11089,
                11121
            ],
            [
                11121,
                11130
            ],
            [
                11211,
                11235
            ],
            [
                11240,
                11249
            ],
            [
                11270,
                11272
            ],
            [
                11272,
                11335
            ],
            [
                11451,
                11463
            ],
            [
                11465,
                11472
            ],
            [
                11474,
                11486
            ],
            [
                11494,
                11504
            ],
            [
                11504,
                11543
            ],
            [
                11543,
                11594
            ],
            [
                11603,
                11630
            ],
            [
                11640,
                11675
            ],
            [
                11750,
                11758
            ],
            [
                11769,
                11786
            ],
            [
                11792,
                11817
            ],
            [
                11822,
                11829
            ],
            [
                11858,
                11861
            ],
            [
                11862,
                11880
            ],
            [
                11855,
                11857
            ],
            [
                11885,
                11910
            ],
            [
                11917,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                11976
            ],
            [
                11983,
                12012
            ],
            [
                12019,
                12023
            ],
            [
                12086,
                12087
            ],
            [
                12215,
                12235
            ],
            [
                12235,
                12255
            ],
            [
                12255,
                12261
            ],
            [
                12292,
                12314
            ],
            [
                12362,
                12392
            ],
            [
                12392,
                12409
            ],
            [
                12409,
                12428
            ],
            [
                12527,
                12551
            ],
            [
                12551,
                12604
            ],
            [
                12657,
                12659
            ],
            [
                12659,
                12673
            ],
            [
                12674,
                12676
            ],
            [
                12693,
                12794
            ],
            [
                12805,
                12843
            ],
            [
                12843,
                12886
            ],
            [
                12886,
                12957
            ],
            [
                13029,
                13066
            ],
            [
                13214,
                13216
            ],
            [
                13216,
                13246
            ],
            [
                13246,
                13278
            ],
            [
                13278,
                13279
            ],
            [
                13309,
                13337
            ],
            [
                13337,
                13395
            ],
            [
                13413,
                13481
            ],
            [
                13481,
                13503
            ],
            [
                13503,
                13525
            ],
            [
                13574,
                13621
            ],
            [
                13622,
                13626
            ],
            [
                13658,
                13660
            ],
            [
                13660,
                13740
            ],
            [
                13740,
                13746
            ],
            [
                13759,
                13772
            ],
            [
                13772,
                13818
            ],
            [
                13836,
                13880
            ],
            [
                13889,
                13930
            ],
            [
                13949,
                13962
            ],
            [
                13962,
                13977
            ],
            [
                13977,
                14064
            ],
            [
                14151,
                14183
            ],
            [
                14183,
                14210
            ],
            [
                14210,
                14250
            ],
            [
                14265,
                14316
            ],
            [
                14316,
                14348
            ],
            [
                14348,
                14402
            ],
            [
                14496,
                14499
            ],
            [
                14499,
                14537
            ],
            [
                14592,
                14593
            ],
            [
                14539,
                14540
            ],
            [
                14549,
                14592
            ],
            [
                14639,
                14641
            ],
            [
                14641,
                14646
            ],
            [
                14663,
                14669
            ],
            [
                14674,
                14689
            ],
            [
                14689,
                14777
            ],
            [
                14777,
                14780
            ],
            [
                14832,
                14839
            ],
            [
                14810,
                14819
            ],
            [
                14843,
                14870
            ],
            [
                14879,
                14917
            ],
            [
                14917,
                14944
            ],
            [
                14944,
                14959
            ],
            [
                15090,
                15092
            ],
            [
                15092,
                15102
            ],
            [
                15106,
                15163
            ],
            [
                15167,
                15174
            ],
            [
                15246,
                15267
            ],
            [
                15274,
                15313
            ],
            [
                15317,
                15352
            ],
            [
                15393,
                15396
            ],
            [
                15396,
                15443
            ],
            [
                15448,
                15458
            ],
            [
                15462,
                15487
            ],
            [
                15501,
                15512
            ],
            [
                15548,
                15580
            ],
            [
                15580,
                15590
            ],
            [
                15603,
                15625
            ],
            [
                15629,
                15705
            ],
            [
                15748,
                15803
            ],
            [
                15803,
                15828
            ],
            [
                15828,
                15836
            ],
            [
                15927,
                15929
            ],
            [
                15930,
                15933
            ],
            [
                15971,
                15996
            ],
            [
                15996,
                16015
            ],
            [
                16101,
                16107
            ],
            [
                16118,
                16150
            ],
            [
                16152,
                16170
            ],
            [
                16259,
                16301
            ],
            [
                16301,
                16328
            ],
            [
                16509,
                16538
            ],
            [
                16625,
                16636
            ],
            [
                16636,
                16652
            ],
            [
                16652,
                16666
            ],
            [
                16666,
                16746
            ],
            [
                16746,
                16784
            ],
            [
                16900,
                16966
            ],
            [
                16974,
                17000
            ],
            [
                17009,
                17027
            ],
            [
                17035,
                17037
            ],
            [
                16789,
                16792
            ],
            [
                17054,
                17056
            ],
            [
                17056,
                17063
            ],
            [
                17122,
                17161
            ],
            [
                17161,
                17185
            ],
            [
                17185,
                17195
            ],
            [
                17262,
                17263
            ],
            [
                17203,
                17212
            ],
            [
                17264,
                17268
            ],
            [
                17270,
                17299
            ],
            [
                17299,
                17336
            ],
            [
                17336,
                17346
            ],
            [
                17346,
                17410
            ],
            [
                17410,
                17459
            ],
            [
                17459,
                17481
            ],
            [
                17481,
                17505
            ],
            [
                17520,
                17551
            ],
            [
                17551,
                17628
            ],
            [
                17704,
                17705
            ]
        ],
        "row_chars": [
            [
                0,
                50
            ],
            [
                50,
                89
            ],
            [
                89,
                340
            ],
            [
                340,
                366
            ],
            [
                366,
                460
            ],
            [
                460,
                695
            ],
            [
                695,
                795
            ],
            [
                795,
                984
            ],
            [
                984,
                1232
            ],
            [
                1232,
                1290
            ],
            [
                1290,
                1316
            ],
            [
                1316,
                1371
            ],
            [
                1371,
                1433
            ],
            [
                1433,
                1509
            ],
            [
                1509,
                1523
            ],
            [
                1523,
                1620
            ],
            [
                1620,
                1768
            ],
            [
                1768,
                1808
            ],
            [
                1808,
                1834
            ],
            [
                1834,
                1885
            ],
            [
                1885,
                1909
            ],
            [
                1909,
                1950
            ],
            [
                1950,
                1987
            ],
            [
                1987,
                2168
            ],
            [
                2168,
                2281
            ],
            [
                2281,
                2354
            ],
            [
                2354,
                2414
            ],
            [
                2414,
                2436
            ],
            [
                2436,
                2468
            ],
            [
                2468,
                2504
            ],
            [
                2504,
                2540
            ],
            [
                2540,
                2718
            ],
            [
                2718,
                2825
            ],
            [
                2825,
                2879
            ],
            [
                2879,
                2946
            ],
            [
                2946,
                3055
            ],
            [
                3055,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3162
            ],
            [
                3162,
                3189
            ],
            [
                3189,
                3212
            ],
            [
                3212,
                3249
            ],
            [
                3249,
                3347
            ],
            [
                3347,
                3507
            ],
            [
                3507,
                3588
            ],
            [
                3588,
                3624
            ],
            [
                3624,
                3660
            ],
            [
                3660,
                3742
            ],
            [
                3742,
                3829
            ],
            [
                3829,
                3852
            ],
            [
                3852,
                3928
            ],
            [
                3928,
                3983
            ],
            [
                3983,
                4054
            ],
            [
                4054,
                4080
            ],
            [
                4080,
                4120
            ],
            [
                4120,
                4222
            ],
            [
                4222,
                4243
            ],
            [
                4243,
                4426
            ],
            [
                4426,
                4662
            ],
            [
                4662,
                4945
            ],
            [
                4945,
                5011
            ],
            [
                5011,
                5044
            ],
            [
                5044,
                5122
            ],
            [
                5122,
                5138
            ],
            [
                5138,
                5198
            ],
            [
                5198,
                5218
            ],
            [
                5218,
                5273
            ],
            [
                5273,
                5332
            ],
            [
                5332,
                5511
            ],
            [
                5511,
                5627
            ],
            [
                5627,
                5947
            ],
            [
                5947,
                5997
            ],
            [
                5997,
                6075
            ],
            [
                6075,
                6158
            ],
            [
                6158,
                6249
            ],
            [
                6249,
                6457
            ],
            [
                6457,
                6701
            ],
            [
                6701,
                6890
            ],
            [
                6890,
                7059
            ],
            [
                7059,
                7161
            ],
            [
                7161,
                7232
            ],
            [
                7232,
                7314
            ],
            [
                7314,
                7385
            ],
            [
                7385,
                7623
            ],
            [
                7623,
                7649
            ],
            [
                7649,
                7675
            ],
            [
                7675,
                7691
            ],
            [
                7691,
                7804
            ],
            [
                7804,
                7893
            ],
            [
                7893,
                8071
            ],
            [
                8071,
                8108
            ],
            [
                8108,
                8122
            ],
            [
                8122,
                8165
            ],
            [
                8165,
                8286
            ],
            [
                8286,
                8458
            ],
            [
                8458,
                8483
            ],
            [
                8483,
                8535
            ],
            [
                8535,
                8567
            ],
            [
                8567,
                8618
            ],
            [
                8618,
                8642
            ],
            [
                8642,
                8676
            ],
            [
                8676,
                8847
            ],
            [
                8847,
                8883
            ],
            [
                8883,
                8927
            ],
            [
                8927,
                8968
            ],
            [
                8968,
                9161
            ],
            [
                9161,
                9237
            ],
            [
                9237,
                9369
            ],
            [
                9369,
                9614
            ],
            [
                9614,
                9856
            ],
            [
                9856,
                9933
            ],
            [
                9933,
                9995
            ],
            [
                9995,
                10056
            ],
            [
                10056,
                10103
            ],
            [
                10103,
                10119
            ],
            [
                10119,
                10141
            ],
            [
                10141,
                10181
            ],
            [
                10181,
                10235
            ],
            [
                10235,
                10269
            ],
            [
                10269,
                10360
            ],
            [
                10360,
                10400
            ],
            [
                10400,
                10435
            ],
            [
                10435,
                10493
            ],
            [
                10493,
                10540
            ],
            [
                10540,
                10572
            ],
            [
                10572,
                10661
            ],
            [
                10661,
                10688
            ],
            [
                10688,
                10717
            ],
            [
                10717,
                10785
            ],
            [
                10785,
                10848
            ],
            [
                10848,
                10922
            ],
            [
                10922,
                10997
            ],
            [
                10997,
                11018
            ],
            [
                11018,
                11058
            ],
            [
                11058,
                11089
            ],
            [
                11089,
                11121
            ],
            [
                11121,
                11272
            ],
            [
                11272,
                11335
            ],
            [
                11335,
                11435
            ],
            [
                11435,
                11504
            ],
            [
                11504,
                11543
            ],
            [
                11543,
                11675
            ],
            [
                11675,
                11786
            ],
            [
                11786,
                11829
            ],
            [
                11829,
                11922
            ],
            [
                11922,
                11952
            ],
            [
                11952,
                12088
            ],
            [
                12088,
                12155
            ],
            [
                12155,
                12215
            ],
            [
                12215,
                12235
            ],
            [
                12235,
                12255
            ],
            [
                12255,
                12262
            ],
            [
                12262,
                12292
            ],
            [
                12292,
                12314
            ],
            [
                12314,
                12362
            ],
            [
                12362,
                12392
            ],
            [
                12392,
                12409
            ],
            [
                12409,
                12428
            ],
            [
                12428,
                12471
            ],
            [
                12471,
                12527
            ],
            [
                12527,
                12551
            ],
            [
                12551,
                12659
            ],
            [
                12659,
                12843
            ],
            [
                12843,
                12886
            ],
            [
                12886,
                12999
            ],
            [
                12999,
                13029
            ],
            [
                13029,
                13216
            ],
            [
                13216,
                13246
            ],
            [
                13246,
                13278
            ],
            [
                13278,
                13337
            ],
            [
                13337,
                13481
            ],
            [
                13481,
                13503
            ],
            [
                13503,
                13526
            ],
            [
                13526,
                13543
            ],
            [
                13543,
                13574
            ],
            [
                13574,
                13660
            ],
            [
                13660,
                13740
            ],
            [
                13740,
                13772
            ],
            [
                13772,
                13962
            ],
            [
                13962,
                13977
            ],
            [
                13977,
                14064
            ],
            [
                14064,
                14117
            ],
            [
                14117,
                14183
            ],
            [
                14183,
                14210
            ],
            [
                14210,
                14316
            ],
            [
                14316,
                14348
            ],
            [
                14348,
                14499
            ],
            [
                14499,
                14641
            ],
            [
                14641,
                14689
            ],
            [
                14689,
                14777
            ],
            [
                14777,
                14917
            ],
            [
                14917,
                14944
            ],
            [
                14944,
                15092
            ],
            [
                15092,
                15396
            ],
            [
                15396,
                15580
            ],
            [
                15580,
                15748
            ],
            [
                15748,
                15803
            ],
            [
                15803,
                15828
            ],
            [
                15828,
                15929
            ],
            [
                15929,
                15996
            ],
            [
                15996,
                16015
            ],
            [
                16015,
                16050
            ],
            [
                16050,
                16101
            ],
            [
                16101,
                16170
            ],
            [
                16170,
                16258
            ],
            [
                16258,
                16301
            ],
            [
                16301,
                16331
            ],
            [
                16331,
                16480
            ],
            [
                16480,
                16538
            ],
            [
                16538,
                16608
            ],
            [
                16608,
                16625
            ],
            [
                16625,
                16636
            ],
            [
                16636,
                16652
            ],
            [
                16652,
                16666
            ],
            [
                16666,
                16746
            ],
            [
                16746,
                16784
            ],
            [
                16784,
                17056
            ],
            [
                17056,
                17161
            ],
            [
                17161,
                17185
            ],
            [
                17185,
                17270
            ],
            [
                17270,
                17299
            ],
            [
                17299,
                17336
            ],
            [
                17336,
                17346
            ],
            [
                17346,
                17410
            ],
            [
                17410,
                17459
            ],
            [
                17459,
                17481
            ],
            [
                17481,
                17551
            ],
            [
                17551,
                17705
            ]
        ]
    },
    "abridged": {
        "text": "On the third morning after his meeting with his mother, Deronda had a note from her saying, \"I leave today. Come and see me at once.\"\nHe was shown into the same room as before, but darkened with blinds. The Princess presently entered, dressed in a loose wrap of dusky orange silk, with black lace about her head. Her face seemed even more impressive in the sombre light, the eyes larger, the lines more vigorous. You might have imagined her a sorceress.\nShe kissed Deronda on both cheeks, then seated herself among her cushions, and told Deronda to sit down by her.\n\"Is there anything more that you would like to ask me?\" she said with a queenly air.\n\"Can I find the house in Genoa where you used to live with my grandfather?\" said Deronda.\n\"No, it is pulled down. But you will find out about our family from the papers in the chest. My father was a physician. My mother was a Morteira. You will find all these things. I was born amongst them without my will. I banished them as soon as I could.\"\nDeronda tried to hide his pained feeling, and said, \"Is there anything else you wish to tell me?\"\n\"I think I have told you everything that could be demanded of me,\" said the Princess coldly. It seemed as if she had exhausted her emotion in their former interview. The fact was, she had said to herself, \"I have confessed all. I will not go through it again.\"\nBut to Deronda the moment was cruel; it made the filial yearning of his life a disappointed pilgrimage to a ruined shrine. He said, with some tremor in his voice-\n\"Then are we to part and I never to be anything to you?\"\n\"It is better so,\" said the Princess, in a softer voice. \"There could be nothing but hard duty for you. You would not love me. Don't deny it,\" she said, abruptly, putting up her hand. \"I know the truth. You are angry with me. You think I robbed you of something. You are on your grandfather's side, and you will always condemn me in your heart.\"\nDeronda stood up in silence. But his mother now looked at him with a new admiration in her glance, saying-\n\"You are wrong to be angry. You are the better for what I did. What shall you do? What difference will it make that I have told you about your birth?\"\n\"A very great difference,\" said Deronda, emphatically.\n\"What shall you do then?\" said the Princess, more sharply. \"Make yourself into a Jew just like your grandfather?\"\n\"That is impossible. The effect of my education can never be done away with,\" said Deronda. \"But it is my duty and my impulse to identify myself, as far as possible, with my hereditary people, and if I can do any work for them that I can give my soul and hand to, I shall do it.\"\nHis mother studied him with a wondering speculation, as if she could read a difficult language in his face, while he bore her gaze with firm resolution. She said-\n\"You are in love with a Jewess.\"\nDeronda coloured. \"My reasons would be independent of any such fact.\"\n\"I know better. I have seen what men are,\" said the Princess. \"Tell me the truth. She is a Jewess who will not accept anyone but a Jew. There are a few such,\" she added, with a touch of scorn.\nDeronda remained silent, and she presently said, with rising passion-\n\"You love her as your father loved me, and she draws you after her as I drew him. But I was leading him the other way. And now your grandfather is getting his revenge.\"\n\"Mother, don't let us think of it in that way. I admit that there may come some benefit from the education you chose for me. I prefer cherishing the benefit, to dwelling with resentment on the injury. I think it would have been right that I should have been brought up knowing that I was a Jew, but I had a good upbringing. And now, you have restored my inheritance - you have been saved from robbing me of my duty: can you not bring yourself to consent to this?\"\nHis mother slowly shook her head, and he said, more urgently,\n\"You have told me that you sought what you held the best for me: open your heart and relent toward my grandfather, who sought what he held the best for you.\"\n\"Not for me, no,\" she said, shaking her head, and folding her arms tightly. \"He never thought of his daughter except as an instrument. Because I had wishes outside his purpose, I was to be put in a frame and tortured. If that is the right law for the world, I will not say that I love it. If my acts were wrong - well, I have told everything. I have done what I could. I have after all been the instrument my father wanted - 'I desire a grandson who shall have a true Jewish heart.'\"\n\"Were those my grandfather's words?\" said Deronda.\n\"Yes, yes. I wanted to thwart him,\" said the Princess, with a sudden outburst of passion. \"You would have me love what I have hated since I was small. But what does it matter? His yoke has been on me, whether I loved it or not. You are the grandson he wanted. You speak as men do - as if you felt yourself wise. What does it all mean?\"\nHer tone was abrupt and scornful. Deronda, pained, had to remember their relationship, lest his words should become cruel.\n\"Mother, don't say that I feel myself wise. I think only the truth can bring us guidance toward duty. Your will was strong, but my grandfather's trust in you - what you call his yoke - is the expression of something stronger, with deeper roots. You renounced me - you banish me as a son\"- there was an involuntary indignation in Deronda's voice- \"but that stronger Something has determined that I shall be the grandson whom you willed to annihilate.\"\nHis mother was watching him fixedly, and again her face gathered admiration.\n\"Sit down again,\" she said, and he obeyed. She laid her hand on his shoulder and went on-\n\"You rebuke me. You are angry because I banish you. What could you do for me but weary your own patience? Your mother is a shattered woman. You reproach me that I parted with you. I had joy enough without you. Now you are come back to me, and I cannot make you a joy. Have you the cursing spirit of the Jew in you? Are you not able to forgive me? Shall you be glad to think that I am punished?\"\n\"How can you ask me that?\" said Deronda, remonstrantly. \"Have I not sought to be a son to you? My grief is that you have declared me helpless to comfort you. I would give up much to soothe your anguish.\"\n\"You shall give up nothing,\" said his mother, agitated. \"You shall be happy. I shall have done you no harm. You have no reason to curse me. You shall pray that I may be freed from suffering. And I shall see you instead of always seeing your grandfather. If you think Kaddish will help me, say it. You will come between me and the dead. When I am in your mind, you will look as you do now - as if you were a tender son - as if I had been a tender mother.\"\nHer hand trembled on his shoulder. Deep compassion hemmed in his words. Putting his arm around her, he pressed her head tenderly to his. They sat so for some moments. Then she lifted her head and rose from her seat with a sigh.\n\"Is she beautiful?\" she said, abruptly.\n\"Who?\"\n\"The woman you love.\"\nHe was obliged to say, \"Yes.\"\n\"Not ambitious?\"\n\"No, I think not.\"\n\"She is not like that?\" said the Princess, taking from her wallet a miniature. It was her own portrait in youth, and as Deronda looked at it with admiring sadness, she said, \"Had I not a rightful claim to be more than a mere daughter and mother? The voice and the genius matched the face. Whatever else was wrong, acknowledge that I had a right to be an artist.\"\n\"I do acknowledge that,\" said Deronda.\n\"Will you take the portrait?\" said the Princess, more gently. \"Teach her to think of me kindly.\"\n\"I shall be grateful for the portrait,\" said Deronda, \"but I have no assurance that she whom I love will have any love for me. I have kept silence.\"\n\"Who and what is she?\"\n\"She was brought up as a singer for the stage,\" he said reluctantly. \"Her father took her away early from her mother, and her life has been unhappy. She is only twenty. Her father wished to bring her up in disregard of her Jewish origin, but she has clung with affection to the memory of her mother and her people.\"\n\"Ah, like you. She is attached to the Judaism she knows nothing of,\" said the Princess, peremptorily. \"Is her singing worth anything?\"\n\"Her singing is exquisite. But her voice is not suited to the stage, and the artist's life has been made repugnant to her.\"\n\"Why, she is made for you then. Sir Hugo said you were bitterly against being a singer.\"\n\"I repeat,\" said Deronda, emphatically, \"that I have no assurance of her love for me. Other painful issues lie before me. I have always felt that I should prepare myself to renounce, not cherish that prospect. But whether happiness may come or not, one should prepare one's self to do without it.\"\n\"Do you feel in that way?\" said his mother. \"Poor boy! I wonder how it would have been if I had kept you with me - whether we should have quarrelled - your grandfather would have been in you - and you would have hampered my life.\"\n\"I think my affection might have lasted through our quarrelling,\" said Deronda, saddened, \"and that surely would have enriched your life.\"\n\"Not then, I did not want it then. I might have been glad of it now,\" said the mother, with a bitter melancholy.\n\"But you love your other children, and they love you?\" said Deronda, anxiously.\n\"Oh, yes. But I am not a loving woman. That is the truth. I know what love makes of men and women - it is subjection. I was never willingly subject to any man. Men have been subject to me. For a few years I was happy. What then? It is all over. Another life! Men talk of 'another life,' as if it only began on the other side of the grave. I have long entered on another life.\" Her eyes were closed, her voice was smothered: in her dusky flame-coloured garment, she looked like a visitant from some land of the dead.\nDeronda was no longer quite master of himself. He gave an audible sob. His mother, opening her eyes, said-\n\"Good-bye, my son, good-bye. We shall hear no more of each other. Kiss me.\"\nHe clasped his arms round her neck, and they kissed each other.\nDeronda did not know how he got out of the room. He felt an older man. All his boyish yearnings about his mother had vanished. He had gone through a tragic experience which must forever solemnize his life.",
        "paragraph_chars": [
            [
                0,
                134
            ],
            [
                134,
                454
            ],
            [
                454,
                566
            ],
            [
                566,
                651
            ],
            [
                651,
                741
            ],
            [
                741,
                997
            ],
            [
                997,
                1095
            ],
            [
                1095,
                1356
            ],
            [
                1356,
                1519
            ],
            [
                1519,
                1576
            ],
            [
                1576,
                1922
            ],
            [
                1922,
                2029
            ],
            [
                2029,
                2180
            ],
            [
                2180,
                2235
            ],
            [
                2235,
                2349
            ],
            [
                2349,
                2629
            ],
            [
                2629,
                2792
            ],
            [
                2792,
                2825
            ],
            [
                2825,
                2895
            ],
            [
                2895,
                3088
            ],
            [
                3088,
                3158
            ],
            [
                3158,
                3327
            ],
            [
                3327,
                3791
            ],
            [
                3791,
                3853
            ],
            [
                3853,
                4011
            ],
            [
                4011,
                4495
            ],
            [
                4495,
                4546
            ],
            [
                4546,
                4882
            ],
            [
                4882,
                5005
            ],
            [
                5005,
                5456
            ],
            [
                5456,
                5533
            ],
            [
                5533,
                5623
            ],
            [
                5623,
                6018
            ],
            [
                6018,
                6222
            ],
            [
                6222,
                6677
            ],
            [
                6677,
                6905
            ],
            [
                6905,
                6945
            ],
            [
                6945,
                6952
            ],
            [
                6952,
                6974
            ],
            [
                6974,
                7004
            ],
            [
                7004,
                7021
            ],
            [
                7021,
                7040
            ],
            [
                7040,
                7403
            ],
            [
                7403,
                7442
            ],
            [
                7442,
                7539
            ],
            [
                7539,
                7688
            ],
            [
                7688,
                7711
            ],
            [
                7711,
                8027
            ],
            [
                8027,
                8162
            ],
            [
                8162,
                8286
            ],
            [
                8286,
                8375
            ],
            [
                8375,
                8673
            ],
            [
                8673,
                8904
            ],
            [
                8904,
                9043
            ],
            [
                9043,
                9156
            ],
            [
                9156,
                9236
            ],
            [
                9236,
                9752
            ],
            [
                9752,
                9859
            ],
            [
                9859,
                9935
            ],
            [
                9935,
                9999
            ],
            [
                9999,
                10204
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                134
            ],
            [
                134,
                203
            ],
            [
                203,
                313
            ],
            [
                313,
                413
            ],
            [
                413,
                454
            ],
            [
                454,
                566
            ],
            [
                566,
                622
            ],
            [
                622,
                651
            ],
            [
                651,
                727
            ],
            [
                727,
                741
            ],
            [
                741,
                765
            ],
            [
                765,
                834
            ],
            [
                834,
                861
            ],
            [
                861,
                887
            ],
            [
                887,
                919
            ],
            [
                919,
                960
            ],
            [
                960,
                997
            ],
            [
                997,
                1095
            ],
            [
                1095,
                1188
            ],
            [
                1188,
                1261
            ],
            [
                1261,
                1323
            ],
            [
                1323,
                1356
            ],
            [
                1356,
                1479
            ],
            [
                1479,
                1519
            ],
            [
                1519,
                1576
            ],
            [
                1576,
                1633
            ],
            [
                1633,
                1680
            ],
            [
                1680,
                1703
            ],
            [
                1703,
                1760
            ],
            [
                1760,
                1779
            ],
            [
                1779,
                1802
            ],
            [
                1802,
                1839
            ],
            [
                1839,
                1922
            ],
            [
                1922,
                1951
            ],
            [
                1951,
                2029
            ],
            [
                2029,
                2057
            ],
            [
                2057,
                2092
            ],
            [
                2092,
                2111
            ],
            [
                2111,
                2180
            ],
            [
                2180,
                2235
            ],
            [
                2235,
                2261
            ],
            [
                2261,
                2294
            ],
            [
                2294,
                2349
            ],
            [
                2349,
                2370
            ],
            [
                2370,
                2441
            ],
            [
                2441,
                2629
            ],
            [
                2629,
                2782
            ],
            [
                2782,
                2792
            ],
            [
                2792,
                2825
            ],
            [
                2825,
                2843
            ],
            [
                2843,
                2895
            ],
            [
                2895,
                2911
            ],
            [
                2911,
                2957
            ],
            [
                2957,
                2977
            ],
            [
                2977,
                3031
            ],
            [
                3031,
                3088
            ],
            [
                3088,
                3158
            ],
            [
                3158,
                3240
            ],
            [
                3240,
                3277
            ],
            [
                3277,
                3327
            ],
            [
                3327,
                3374
            ],
            [
                3374,
                3452
            ],
            [
                3452,
                3528
            ],
            [
                3528,
                3651
            ],
            [
                3651,
                3791
            ],
            [
                3791,
                3853
            ],
            [
                3853,
                4011
            ],
            [
                4011,
                4087
            ],
            [
                4087,
                4146
            ],
            [
                4146,
                4229
            ],
            [
                4229,
                4300
            ],
            [
                4300,
                4354
            ],
            [
                4354,
                4380
            ],
            [
                4380,
                4495
            ],
            [
                4495,
                4532
            ],
            [
                4532,
                4546
            ],
            [
                4546,
                4557
            ],
            [
                4557,
                4636
            ],
            [
                4636,
                4697
            ],
            [
                4697,
                4722
            ],
            [
                4722,
                4774
            ],
            [
                4774,
                4806
            ],
            [
                4806,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4916
            ],
            [
                4916,
                5005
            ],
            [
                5005,
                5049
            ],
            [
                5049,
                5107
            ],
            [
                5107,
                5250
            ],
            [
                5250,
                5456
            ],
            [
                5456,
                5533
            ],
            [
                5533,
                5576
            ],
            [
                5576,
                5623
            ],
            [
                5623,
                5639
            ],
            [
                5639,
                5675
            ],
            [
                5675,
                5729
            ],
            [
                5729,
                5763
            ],
            [
                5763,
                5803
            ],
            [
                5803,
                5833
            ],
            [
                5833,
                5891
            ],
            [
                5891,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                6018
            ],
            [
                6018,
                6045
            ],
            [
                6045,
                6074
            ],
            [
                6074,
                6113
            ],
            [
                6113,
                6176
            ],
            [
                6176,
                6222
            ],
            [
                6222,
                6278
            ],
            [
                6278,
                6299
            ],
            [
                6299,
                6330
            ],
            [
                6330,
                6362
            ],
            [
                6362,
                6413
            ],
            [
                6413,
                6476
            ],
            [
                6476,
                6519
            ],
            [
                6519,
                6558
            ],
            [
                6558,
                6677
            ],
            [
                6677,
                6712
            ],
            [
                6712,
                6749
            ],
            [
                6749,
                6814
            ],
            [
                6814,
                6844
            ],
            [
                6844,
                6905
            ],
            [
                6905,
                6925
            ],
            [
                6925,
                6945
            ],
            [
                6945,
                6952
            ],
            [
                6952,
                6974
            ],
            [
                6974,
                7004
            ],
            [
                7004,
                7021
            ],
            [
                7021,
                7040
            ],
            [
                7040,
                7064
            ],
            [
                7064,
                7119
            ],
            [
                7119,
                7286
            ],
            [
                7286,
                7329
            ],
            [
                7329,
                7403
            ],
            [
                7403,
                7442
            ],
            [
                7442,
                7472
            ],
            [
                7472,
                7504
            ],
            [
                7504,
                7539
            ],
            [
                7539,
                7666
            ],
            [
                7666,
                7688
            ],
            [
                7688,
                7711
            ],
            [
                7711,
                7780
            ],
            [
                7780,
                7860
            ],
            [
                7860,
                7880
            ],
            [
                7880,
                8027
            ],
            [
                8027,
                8042
            ],
            [
                8042,
                8129
            ],
            [
                8129,
                8162
            ],
            [
                8162,
                8189
            ],
            [
                8189,
                8286
            ],
            [
                8286,
                8318
            ],
            [
                8318,
                8375
            ],
            [
                8375,
                8461
            ],
            [
                8461,
                8497
            ],
            [
                8497,
                8585
            ],
            [
                8585,
                8673
            ],
            [
                8673,
                8700
            ],
            [
                8700,
                8717
            ],
            [
                8717,
                8728
            ],
            [
                8728,
                8904
            ],
            [
                8904,
                9043
            ],
            [
                9043,
                9078
            ],
            [
                9078,
                9156
            ],
            [
                9156,
                9211
            ],
            [
                9211,
                9236
            ],
            [
                9236,
                9246
            ],
            [
                9246,
                9275
            ],
            [
                9275,
                9294
            ],
            [
                9294,
                9354
            ],
            [
                9354,
                9396
            ],
            [
                9396,
                9425
            ],
            [
                9425,
                9454
            ],
            [
                9454,
                9465
            ],
            [
                9465,
                9481
            ],
            [
                9481,
                9495
            ],
            [
                9495,
                9575
            ],
            [
                9575,
                9613
            ],
            [
                9613,
                9752
            ],
            [
                9752,
                9799
            ],
            [
                9799,
                9823
            ],
            [
                9823,
                9859
            ],
            [
                9859,
                9888
            ],
            [
                9888,
                9925
            ],
            [
                9925,
                9935
            ],
            [
                9935,
                9999
            ],
            [
                9999,
                10048
            ],
            [
                10048,
                10070
            ],
            [
                10070,
                10126
            ],
            [
                10126,
                10204
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                39,
                55
            ],
            [
                56,
                63
            ],
            [
                64,
                74
            ],
            [
                84,
                100
            ],
            [
                106,
                108
            ],
            [
                108,
                134
            ],
            [
                134,
                175
            ],
            [
                177,
                180
            ],
            [
                181,
                201
            ],
            [
                201,
                203
            ],
            [
                203,
                215
            ],
            [
                216,
                261
            ],
            [
                262,
                274
            ],
            [
                275,
                280
            ],
            [
                281,
                296
            ],
            [
                297,
                302
            ],
            [
                303,
                311
            ],
            [
                311,
                313
            ],
            [
                313,
                413
            ],
            [
                413,
                452
            ],
            [
                452,
                454
            ],
            [
                454,
                457
            ],
            [
                458,
                464
            ],
            [
                473,
                527
            ],
            [
                527,
                565
            ],
            [
                567,
                622
            ],
            [
                622,
                630
            ],
            [
                631,
                635
            ],
            [
                636,
                643
            ],
            [
                649,
                651
            ],
            [
                651,
                727
            ],
            [
                727,
                741
            ],
            [
                741,
                744
            ],
            [
                744,
                745
            ],
            [
                746,
                763
            ],
            [
                763,
                765
            ],
            [
                765,
                768
            ],
            [
                769,
                782
            ],
            [
                787,
                803
            ],
            [
                809,
                832
            ],
            [
                832,
                834
            ],
            [
                834,
                843
            ],
            [
                844,
                861
            ],
            [
                861,
                887
            ],
            [
                887,
                900
            ],
            [
                901,
                904
            ],
            [
                917,
                919
            ],
            [
                919,
                960
            ],
            [
                960,
                997
            ],
            [
                997,
                1050
            ],
            [
                1050,
                1052
            ],
            [
                1059,
                1072
            ],
            [
                1073,
                1076
            ],
            [
                1082,
                1092
            ],
            [
                1095,
                1179
            ],
            [
                1180,
                1186
            ],
            [
                1186,
                1188
            ],
            [
                1188,
                1261
            ],
            [
                1261,
                1307
            ],
            [
                1318,
                1323
            ],
            [
                1323,
                1353
            ],
            [
                1356,
                1370
            ],
            [
                1371,
                1463
            ],
            [
                1471,
                1477
            ],
            [
                1477,
                1479
            ],
            [
                1479,
                1517
            ],
            [
                1519,
                1551
            ],
            [
                1555,
                1576
            ],
            [
                1576,
                1625
            ],
            [
                1626,
                1633
            ],
            [
                1633,
                1678
            ],
            [
                1678,
                1680
            ],
            [
                1680,
                1703
            ],
            [
                1703,
                1760
            ],
            [
                1760,
                1767
            ],
            [
                1768,
                1779
            ],
            [
                1779,
                1802
            ],
            [
                1802,
                1839
            ],
            [
                1839,
                1894
            ],
            [
                1903,
                1922
            ],
            [
                1922,
                1929
            ],
            [
                1942,
                1950
            ],
            [
                1951,
                1976
            ],
            [
                1977,
                2027
            ],
            [
                2029,
                2055
            ],
            [
                2055,
                2057
            ],
            [
                2057,
                2090
            ],
            [
                2092,
                2096
            ],
            [
                2097,
                2102
            ],
            [
                2103,
                2106
            ],
            [
                2107,
                2109
            ],
            [
                2111,
                2139
            ],
            [
                2140,
                2180
            ],
            [
                2180,
                2234
            ],
            [
                2235,
                2261
            ],
            [
                2261,
                2279
            ],
            [
                2280,
                2284
            ],
            [
                2292,
                2294
            ],
            [
                2294,
                2299
            ],
            [
                2300,
                2319
            ],
            [
                2320,
                2346
            ],
            [
                2346,
                2349
            ],
            [
                2349,
                2370
            ],
            [
                2370,
                2424
            ],
            [
                2424,
                2439
            ],
            [
                2439,
                2441
            ],
            [
                2441,
                2445
            ],
            [
                2446,
                2451
            ],
            [
                2452,
                2459
            ],
            [
                2464,
                2466
            ],
            [
                2467,
                2474
            ],
            [
                2475,
                2554
            ],
            [
                2558,
                2566
            ],
            [
                2567,
                2611
            ],
            [
                2613,
                2620
            ],
            [
                2621,
                2629
            ],
            [
                2629,
                2639
            ],
            [
                2648,
                2681
            ],
            [
                2682,
                2687
            ],
            [
                2688,
                2723
            ],
            [
                2727,
                2735
            ],
            [
                2735,
                2736
            ],
            [
                2743,
                2759
            ],
            [
                2780,
                2782
            ],
            [
                2782,
                2785
            ],
            [
                2786,
                2790
            ],
            [
                2792,
                2825
            ],
            [
                2825,
                2832
            ],
            [
                2843,
                2895
            ],
            [
                2895,
                2911
            ],
            [
                2911,
                2955
            ],
            [
                2955,
                2957
            ],
            [
                2957,
                2977
            ],
            [
                2977,
                3012
            ],
            [
                3020,
                3031
            ],
            [
                3031,
                3036
            ],
            [
                3037,
                3040
            ],
            [
                3041,
                3088
            ],
            [
                3088,
                3095
            ],
            [
                3096,
                3136
            ],
            [
                3137,
                3156
            ],
            [
                3158,
                3238
            ],
            [
                3238,
                3239
            ],
            [
                3240,
                3277
            ],
            [
                3277,
                3327
            ],
            [
                3327,
                3334
            ],
            [
                3334,
                3335
            ],
            [
                3336,
                3374
            ],
            [
                3374,
                3375
            ],
            [
                3376,
                3452
            ],
            [
                3452,
                3483
            ],
            [
                3483,
                3528
            ],
            [
                3528,
                3595
            ],
            [
                3604,
                3625
            ],
            [
                3632,
                3638
            ],
            [
                3649,
                3651
            ],
            [
                3651,
                3677
            ],
            [
                3678,
                3692
            ],
            [
                3695,
                3727
            ],
            [
                3728,
                3760
            ],
            [
                3770,
                3791
            ],
            [
                3791,
                3801
            ],
            [
                3802,
                3808
            ],
            [
                3809,
                3823
            ],
            [
                3823,
                3824
            ],
            [
                3829,
                3831
            ],
            [
                3836,
                3837
            ],
            [
                3838,
                3851
            ],
            [
                3851,
                3852
            ],
            [
                3853,
                3933
            ],
            [
                3934,
                3937
            ],
            [
                3938,
                3944
            ],
            [
                3945,
                4011
            ],
            [
                4011,
                4055
            ],
            [
                4055,
                4087
            ],
            [
                4087,
                4088
            ],
            [
                4088,
                4146
            ],
            [
                4146,
                4159
            ],
            [
                4167,
                4229
            ],
            [
                4229,
                4300
            ],
            [
                4300,
                4321
            ],
            [
                4324,
                4354
            ],
            [
                4354,
                4380
            ],
            [
                4380,
                4433
            ],
            [
                4436,
                4491
            ],
            [
                4495,
                4532
            ],
            [
                4532,
                4546
            ],
            [
                4546,
                4555
            ],
            [
                4555,
                4557
            ],
            [
                4557,
                4626
            ],
            [
                4627,
                4634
            ],
            [
                4634,
                4636
            ],
            [
                4636,
                4677
            ],
            [
                4684,
                4689
            ],
            [
                4695,
                4697
            ],
            [
                4697,
                4722
            ],
            [
                4722,
                4774
            ],
            [
                4774,
                4806
            ],
            [
                4806,
                4825
            ],
            [
                4828,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4916
            ],
            [
                4916,
                4924
            ],
            [
                4925,
                4931
            ],
            [
                4931,
                4939
            ],
            [
                4949,
                5004
            ],
            [
                5005,
                5049
            ],
            [
                5049,
                5050
            ],
            [
                5057,
                5061
            ],
            [
                5062,
                5065
            ],
            [
                5085,
                5107
            ],
            [
                5107,
                5155
            ],
            [
                5159,
                5162
            ],
            [
                5163,
                5164
            ],
            [
                5165,
                5187
            ],
            [
                5190,
                5242
            ],
            [
                5243,
                5248
            ],
            [
                5248,
                5250
            ],
            [
                5250,
                5266
            ],
            [
                5269,
                5272
            ],
            [
                5273,
                5282
            ],
            [
                5283,
                5291
            ],
            [
                5294,
                5318
            ],
            [
                5319,
                5349
            ],
            [
                5351,
                5410
            ],
            [
                5411,
                5428
            ],
            [
                5429,
                5456
            ],
            [
                5456,
                5532
            ],
            [
                5533,
                5550
            ],
            [
                5559,
                5560
            ],
            [
                5561,
                5574
            ],
            [
                5574,
                5576
            ],
            [
                5576,
                5621
            ],
            [
                5623,
                5639
            ],
            [
                5639,
                5675
            ],
            [
                5675,
                5729
            ],
            [
                5729,
                5763
            ],
            [
                5763,
                5803
            ],
            [
                5803,
                5831
            ],
            [
                5831,
                5833
            ],
            [
                5833,
                5891
            ],
            [
                5891,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                6015
            ],
            [
                6015,
                6018
            ],
            [
                6018,
                6045
            ],
            [
                6045,
                6074
            ],
            [
                6074,
                6085
            ],
            [
                6096,
                6113
            ],
            [
                6113,
                6176
            ],
            [
                6176,
                6196
            ],
            [
                6207,
                6222
            ],
            [
                6222,
                6267
            ],
            [
                6276,
                6278
            ],
            [
                6278,
                6299
            ],
            [
                6299,
                6330
            ],
            [
                6330,
                6362
            ],
            [
                6362,
                6371
            ],
            [
                6377,
                6401
            ],
            [
                6402,
                6411
            ],
            [
                6411,
                6413
            ],
            [
                6413,
                6476
            ],
            [
                6476,
                6488
            ],
            [
                6489,
                6496
            ],
            [
                6497,
                6509
            ],
            [
                6509,
                6519
            ],
            [
                6519,
                6558
            ],
            [
                6558,
                6609
            ],
            [
                6612,
                6639
            ],
            [
                6642,
                6677
            ],
            [
                6677,
                6685
            ],
            [
                6695,
                6712
            ],
            [
                6712,
                6737
            ],
            [
                6742,
                6749
            ],
            [
                6749,
                6752
            ],
            [
                6757,
                6775
            ],
            [
                6777,
                6779
            ],
            [
                6780,
                6805
            ],
            [
                6809,
                6814
            ],
            [
                6814,
                6844
            ],
            [
                6844,
                6868
            ],
            [
                6869,
                6898
            ],
            [
                6899,
                6903
            ],
            [
                6903,
                6904
            ],
            [
                6905,
                6925
            ],
            [
                6925,
                6945
            ],
            [
                6945,
                6951
            ],
            [
                6952,
                6974
            ],
            [
                6974,
                7004
            ],
            [
                7004,
                7021
            ],
            [
                7021,
                7040
            ],
            [
                7040,
                7064
            ],
            [
                7064,
                7117
            ],
            [
                7117,
                7119
            ],
            [
                7119,
                7133
            ],
            [
                7143,
                7145
            ],
            [
                7146,
                7247
            ],
            [
                7248,
                7286
            ],
            [
                7286,
                7329
            ],
            [
                7329,
                7400
            ],
            [
                7403,
                7440
            ],
            [
                7440,
                7442
            ],
            [
                7442,
                7472
            ],
            [
                7472,
                7504
            ],
            [
                7504,
                7505
            ],
            [
                7511,
                7539
            ],
            [
                7539,
                7597
            ],
            [
                7598,
                7666
            ],
            [
                7666,
                7688
            ],
            [
                7688,
                7710
            ],
            [
                7711,
                7758
            ],
            [
                7762,
                7766
            ],
            [
                7778,
                7780
            ],
            [
                7780,
                7860
            ],
            [
                7860,
                7866
            ],
            [
                7867,
                7880
            ],
            [
                7880,
                7926
            ],
            [
                7927,
                7971
            ],
            [
                7972,
                8013
            ],
            [
                8014,
                8027
            ],
            [
                8027,
                8042
            ],
            [
                8042,
                8129
            ],
            [
                8130,
                8162
            ],
            [
                8162,
                8189
            ],
            [
                8189,
                8229
            ],
            [
                8235,
                8286
            ],
            [
                8286,
                8318
            ],
            [
                8318,
                8372
            ],
            [
                8372,
                8375
            ],
            [
                8375,
                8413
            ],
            [
                8413,
                8414
            ],
            [
                8415,
                8416
            ],
            [
                8416,
                8459
            ],
            [
                8459,
                8461
            ],
            [
                8461,
                8466
            ],
            [
                8475,
                8481
            ],
            [
                8482,
                8497
            ],
            [
                8497,
                8585
            ],
            [
                8585,
                8588
            ],
            [
                8589,
                8596
            ],
            [
                8597,
                8606
            ],
            [
                8607,
                8634
            ],
            [
                8635,
                8673
            ],
            [
                8673,
                8700
            ],
            [
                8700,
                8715
            ],
            [
                8715,
                8717
            ],
            [
                8717,
                8727
            ],
            [
                8728,
                8785
            ],
            [
                8788,
                8795
            ],
            [
                8796,
                8817
            ],
            [
                8824,
                8863
            ],
            [
                8866,
                8901
            ],
            [
                8901,
                8904
            ],
            [
                8904,
                8951
            ],
            [
                8952,
                8962
            ],
            [
                8967,
                8992
            ],
            [
                8992,
                9003
            ],
            [
                9011,
                9043
            ],
            [
                9043,
                9053
            ],
            [
                9054,
                9076
            ],
            [
                9078,
                9154
            ],
            [
                9156,
                9211
            ],
            [
                9211,
                9236
            ],
            [
                9236,
                9244
            ],
            [
                9244,
                9246
            ],
            [
                9246,
                9249
            ],
            [
                9250,
                9275
            ],
            [
                9275,
                9294
            ],
            [
                9294,
                9300
            ],
            [
                9301,
                9333
            ],
            [
                9336,
                9354
            ],
            [
                9354,
                9396
            ],
            [
                9396,
                9423
            ],
            [
                9425,
                9454
            ],
            [
                9454,
                9465
            ],
            [
                9465,
                9481
            ],
            [
                9481,
                9495
            ],
            [
                9495,
                9575
            ],
            [
                9575,
                9613
            ],
            [
                9613,
                9679
            ],
            [
                9688,
                9714
            ],
            [
                9715,
                9733
            ],
            [
                9739,
                9741
            ],
            [
                9742,
                9745
            ],
            [
                9750,
                9752
            ],
            [
                9752,
                9759
            ],
            [
                9760,
                9799
            ],
            [
                9799,
                9823
            ],
            [
                9823,
                9833
            ],
            [
                9833,
                9834
            ],
            [
                9843,
                9852
            ],
            [
                9853,
                9857
            ],
            [
                9859,
                9888
            ],
            [
                9888,
                9925
            ],
            [
                9925,
                9935
            ],
            [
                9935,
                9999
            ],
            [
                9999,
                10048
            ],
            [
                10048,
                10070
            ],
            [
                10070,
                10094
            ],
            [
                10095,
                10126
            ],
            [
                10126,
                10203
            ],
            [
                10203,
                10204
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                108
            ],
            [
                108,
                134
            ],
            [
                134,
                203
            ],
            [
                203,
                313
            ],
            [
                313,
                413
            ],
            [
                413,
                454
            ],
            [
                454,
                566
            ],
            [
                566,
                566
            ],
            [
                566,
                566
            ],
            [
                566,
                622
            ],
            [
                622,
                651
            ],
            [
                651,
                727
            ],
            [
                727,
                741
            ],
            [
                741,
                765
            ],
            [
                765,
                834
            ],
            [
                834,
                861
            ],
            [
                861,
                887
            ],
            [
                887,
                887
            ],
            [
                887,
                919
            ],
            [
                919,
                960
            ],
            [
                960,
                997
            ],
            [
                997,
                1095
            ],
            [
                1095,
                1188
            ],
            [
                1188,
                1261
            ],
            [
                1261,
                1323
            ],
            [
                1323,
                1323
            ],
            [
                1323,
                1356
            ],
            [
                1356,
                1356
            ],
            [
                1356,
                1356
            ],
            [
                1356,
                1479
            ],
            [
                1479,
                1519
            ],
            [
                1519,
                1576
            ],
            [
                1576,
                1633
            ],
            [
                1633,
                1680
            ],
            [
                1680,
                1703
            ],
            [
                1703,
                1760
            ],
            [
                1760,
                1779
            ],
            [
                1779,
                1779
            ],
            [
                1779,
                1802
            ],
            [
                1802,
                1839
            ],
            [
                1839,
                1922
            ],
            [
                1922,
                1951
            ],
            [
                1951,
                2029
            ],
            [
                2029,
                2057
            ],
            [
                2057,
                2092
            ],
            [
                2092,
                2111
            ],
            [
                2111,
                2111
            ],
            [
                2111,
                2111
            ],
            [
                2111,
                2180
            ],
            [
                2180,
                2235
            ],
            [
                2235,
                2235
            ],
            [
                2235,
                2261
            ],
            [
                2261,
                2294
            ],
            [
                2294,
                2349
            ],
            [
                2349,
                2370
            ],
            [
                2370,
                2441
            ],
            [
                2441,
                2629
            ],
            [
                2629,
                2782
            ],
            [
                2782,
                2792
            ],
            [
                2792,
                2825
            ],
            [
                2825,
                2895
            ],
            [
                2895,
                2911
            ],
            [
                2911,
                2957
            ],
            [
                2957,
                2977
            ],
            [
                2977,
                3031
            ],
            [
                3031,
                3088
            ],
            [
                3088,
                3088
            ],
            [
                3088,
                3088
            ],
            [
                3088,
                3277
            ],
            [
                3277,
                3327
            ],
            [
                3327,
                3374
            ],
            [
                3374,
                3452
            ],
            [
                3452,
                3528
            ],
            [
                3528,
                3651
            ],
            [
                3651,
                3791
            ],
            [
                3791,
                3853
            ],
            [
                3853,
                4011
            ],
            [
                4011,
                4087
            ],
            [
                4087,
                4146
            ],
            [
                4146,
                4229
            ],
            [
                4229,
                4300
            ],
            [
                4300,
                4354
            ],
            [
                4354,
                4380
            ],
            [
                4380,
                4380
            ],
            [
                4380,
                4380
            ],
            [
                4380,
                4495
            ],
            [
                4495,
                4495
            ],
            [
                4495,
                4495
            ],
            [
                4495,
                4532
            ],
            [
                4532,
                4546
            ],
            [
                4546,
                4557
            ],
            [
                4557,
                4636
            ],
            [
                4636,
                4697
            ],
            [
                4697,
                4722
            ],
            [
                4722,
                4774
            ],
            [
                4774,
                4806
            ],
            [
                4806,
                4858
            ],
            [
                4858,
                4882
            ],
            [
                4882,
                4916
            ],
            [
                4916,
                5005
            ],
            [
                5005,
                5005
            ],
            [
                5005,
                5049
            ],
            [
                5049,
                5049
            ],
            [
                5049,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5107
            ],
            [
                5107,
                5250
            ],
            [
                5250,
                5456
            ],
            [
                5456,
                5533
            ],
            [
                5533,
                5533
            ],
            [
                5533,
                5576
            ],
            [
                5576,
                5623
            ],
            [
                5623,
                5639
            ],
            [
                5639,
                5639
            ],
            [
                5639,
                5675
            ],
            [
                5675,
                5729
            ],
            [
                5729,
                5763
            ],
            [
                5763,
                5763
            ],
            [
                5763,
                5803
            ],
            [
                5803,
                5833
            ],
            [
                5833,
                5891
            ],
            [
                5891,
                5938
            ],
            [
                5938,
                5970
            ],
            [
                5970,
                6018
            ],
            [
                6018,
                6045
            ],
            [
                6045,
                6074
            ],
            [
                6074,
                6113
            ],
            [
                6113,
                6176
            ],
            [
                6176,
                6222
            ],
            [
                6222,
                6278
            ],
            [
                6278,
                6299
            ],
            [
                6299,
                6299
            ],
            [
                6299,
                6330
            ],
            [
                6330,
                6362
            ],
            [
                6362,
                6413
            ],
            [
                6413,
                6476
            ],
            [
                6476,
                6476
            ],
            [
                6476,
                6519
            ],
            [
                6519,
                6558
            ],
            [
                6558,
                6677
            ],
            [
                6677,
                6712
            ],
            [
                6712,
                6749
            ],
            [
                6749,
                6814
            ],
            [
                6814,
                6844
            ],
            [
                6844,
                6905
            ],
            [
                6905,
                6905
            ],
            [
                6905,
                6905
            ],
            [
                6905,
                6925
            ],
            [
                6925,
                6945
            ],
            [
                6945,
                6952
            ],
            [
                6952,
                6952
            ],
            [
                6952,
                6974
            ],
            [
                6974,
                6974
            ],
            [
                6974,
                7004
            ],
            [
                7004,
                7021
            ],
            [
                7021,
                7040
            ],
            [
                7040,
                7040
            ],
            [
                7040,
                7040
            ],
            [
                7040,
                7064
            ],
            [
                7064,
                7119
            ],
            [
                7119,
                7286
            ],
            [
                7286,
                7329
            ],
            [
                7329,
                7403
            ],
            [
                7403,
                7403
            ],
            [
                7403,
                7442
            ],
            [
                7442,
                7472
            ],
            [
                7472,
                7504
            ],
            [
                7504,
                7539
            ],
            [
                7539,
                7666
            ],
            [
                7666,
                7688
            ],
            [
                7688,
                7711
            ],
            [
                7711,
                7711
            ],
            [
                7711,
                7711
            ],
            [
                7711,
                7780
            ],
            [
                7780,
                7860
            ],
            [
                7860,
                7880
            ],
            [
                7880,
                8027
            ],
            [
                8027,
                8042
            ],
            [
                8042,
                8129
            ],
            [
                8129,
                8129
            ],
            [
                8129,
                8162
            ],
            [
                8162,
                8189
            ],
            [
                8189,
                8286
            ],
            [
                8286,
                8318
            ],
            [
                8318,
                8375
            ],
            [
                8375,
                8461
            ],
            [
                8461,
                8497
            ],
            [
                8497,
                8585
            ],
            [
                8585,
                8673
            ],
            [
                8673,
                8700
            ],
            [
                8700,
                8717
            ],
            [
                8717,
                8904
            ],
            [
                8904,
                9043
            ],
            [
                9043,
                9156
            ],
            [
                9156,
                9211
            ],
            [
                9211,
                9236
            ],
            [
                9236,
                9246
            ],
            [
                9246,
                9275
            ],
            [
                9275,
                9294
            ],
            [
                9294,
                9294
            ],
            [
                9294,
                9294
            ],
            [
                9294,
                9354
            ],
            [
                9354,
                9354
            ],
            [
                9354,
                9396
            ],
            [
                9396,
                9425
            ],
            [
                9425,
                9425
            ],
            [
                9425,
                9454
            ],
            [
                9454,
                9454
            ],
            [
                9454,
                9454
            ],
            [
                9454,
                9465
            ],
            [
                9465,
                9481
            ],
            [
                9481,
                9495
            ],
            [
                9495,
                9575
            ],
            [
                9575,
                9613
            ],
            [
                9613,
                9752
            ],
            [
                9752,
                9799
            ],
            [
                9799,
                9823
            ],
            [
                9823,
                9859
            ],
            [
                9859,
                9888
            ],
            [
                9888,
                9925
            ],
            [
                9925,
                9935
            ],
            [
                9935,
                9999
            ],
            [
                9999,
                10048
            ],
            [
                10048,
                10070
            ],
            [
                10070,
                10126
            ],
            [
                10126,
                10204
            ]
        ]
    }
}