{
    "original": {
        "text": "\"Ritorna a tua scienza Che vuol, quanto la cosa e pi perfetta Pi senta il bene, e cosi la doglienza.\" --DANTE.\nWhen Deronda met Gwendolen and Grandcourt on the staircase, his mind was seriously preoccupied. He had just been summoned to the second interview with his mother.\nIn two hours after his parting from her he knew that the Princess Halm-Eberstein had left the hotel, and so far as the purpose of his journey to Genoa was concerned, he might himself have set off on his way to Mainz, to deliver the letter from Joseph Kalonymos, and get possession of the family chest. But mixed mental conditions, which did not resolve themselves into definite reasons, hindered him from departure. Long after the farewell he was kept passive by a weight of retrospective feeling. He lived again, with the new keenness of emotive memory, through the exciting scenes which seemed past only in the sense of preparation for their actual presence in his soul. He allowed himself in his solitude to sob, with perhaps more than a woman's acuteness of compassion, over that woman's life so near to his, and yet so remote. He beheld the world changed for him by the certitude of ties that altered the poise of hopes and fears, and gave him a new sense of fellowship, as if under cover of the night he had joined the wrong band of wanderers, and found with the rise of morning that the tents of his kindred were grouped far off. He had a quivering imaginative sense of close relation to the grandfather who had been animated by strong impulses and beloved thoughts, which were now perhaps being roused from their slumber within himself. And through all this passionate meditation Mordecai and Mirah were always present, as beings who clasped hands with him in sympathetic silence.\nOf such quick, responsive fibre was Deronda made, under that mantle of self-controlled reserve into which early experience had thrown so much of his young strength.\nWhen the persistent ringing of a bell as a signal reminded him of the hour he thought of looking into _Bradshaw_, and making the brief necessary preparations for starting by the next train--thought of it, but made no movement in consequence. Wishes went to Mainz and what he was to get possession of there--to London and the beings there who made the strongest attachments of his life; but there were other wishes that clung in these moments to Genoa, and they kept him where he was by that force which urges us to linger over an interview that carries a presentiment of final farewell or of overshadowing sorrow. Deronda did not formally say, \"I will stay over to-night, because it is Friday, and I should like to go to the evening service at the synagogue where they must all have gone; and besides, I may see the Grandcourts again.\" But simply, instead of packing and ringing for his bill, he sat doing nothing at all, while his mind went to the synagogue and saw faces there probably little different from those of his grandfather's time, and heard the Spanish-Hebrew liturgy which had lasted through the seasons of wandering generations like a plant with wandering seed, that gives the far-off lands a kinship to the exile's home--while, also, his mind went toward Gwendolen, with anxious remembrance of what had been, and with a half-admitted impression that it would be hardness in him willingly to go away at once without making some effort, in spite of Grandcourt's probable dislike, to manifest the continuance of his sympathy with her since their abrupt parting.\nIn this state of mind he deferred departure, ate his dinner without sense of flavor, rose from it quickly to find the synagogue, and in passing the porter asked if Mr. and Mrs. Grandcourt were still in the hotel, and what was the number of their apartment. The porter gave him the number, but added that they were gone out boating. That information had somehow power enough over Deronda to divide his thoughts with the memories wakened among the sparse _talithim_ and keen dark faces of worshippers whose way of taking awful prayers and invocations with the easy familiarity which might be called Hebrew dyed Italian, made him reflect that his grandfather, according to the Princess's hints of his character, must have been almost as exceptional a Jew as Mordecai. But were not men of ardent zeal and far-reaching hope everywhere exceptional? the men who had the visions which, as Mordecai said, were the creators and feeders of the world--moulding and feeding the more passive life which without them would dwindle and shrivel into the narrow tenacity of insects, unshaken by thoughts beyond the reach of their antennae. Something of a mournful impatience perhaps added itself to the solicitude about Gwendolen (a solicitude that had room to grow in his present release from immediate cares) as an incitement to hasten from the synagogue and choose to take his evening walk toward the quay, always a favorite haunt with him, and just now attractive with the possibility that he might be in time to see the Grandcourts come in from their boating. In this case, he resolved that he would advance to greet them deliberately, and ignore any grounds that the husband might have for wishing him elsewhere.\nThe sun had set behind a bank of cloud, and only a faint yellow light was giving its farewell kisses to the waves, which were agitated by an active breeze. Deronda, sauntering slowly within sight of what took place on the strand, observed the groups there concentrating their attention on a sailing-boat which was advancing swiftly landward, being rowed by two men. Amidst the clamorous talk in various languages, Deronda held it the surer means of getting information not to ask questions, but to elbow his way to the foreground and be an unobstructed witness of what was occurring. Telescopes were being used, and loud statements made that the boat held somebody who had been drowned. One said it was the _milord_ who had gone out in a sailing boat; another maintained that the prostrate figure he discerned was _miladi_; a Frenchman who had no glass would rather say that it was _milord_ who had probably taken his wife out to drown her, according to the national practice--a remark which an English skipper immediately commented on in our native idiom (as nonsense which--had undergone a mining operation), and further dismissed by the decision that the reclining figure was a woman. For Deronda, terribly excited by fluctuating fears, the strokes of the oars as he watched them were divided by swift visions of events, possible and impossible, which might have brought about this issue, or this broken-off fragment of an issue, with a worse half undisclosed--if this woman apparently snatched from the waters were really Mrs. Grandcourt.\nBut soon there was no longer any doubt: the boat was being pulled to land, and he saw Gwendolen half raising herself on her hands, by her own effort, under her heavy covering of tarpaulin and pea-jackets--pale as one of the sheeted dead, shivering, with wet hair streaming, a wild amazed consciousness in her eyes, as if she had waked up in a world where some judgment was impending, and the beings she saw around were coming to seize her. The first rower who jumped to land was also wet through, and ran off; the sailors, close about the boat, hindered Deronda from advancing, and he could only look on while Gwendolen gave scared glances, and seemed to shrink with terror as she was carefully, tenderly helped out, and led on by the strong arms of those rough, bronzed men, her wet clothes clinging about her limbs, and adding to the impediment of her weakness. Suddenly her wandering eyes fell on Deronda, standing before her, and immediately, as if she had been expecting him and looking for him, she tried to stretch out her arms, which were held back by her supporters, saying, in a muffled voice,\n\"It is come, it is come! He is dead!\"\n\"Hush, hush!\" said Deronda, in a tone of authority; \"quiet yourself.\" Then to the men who were assisting her, \"I am a connection of this lady's husband. If you will get her on to the _Italia_ as quickly as possible, I will undertake everything else.\"\nHe stayed behind to hear from the remaining boatman that her husband had gone down irrecoverably, and that his boat was left floating empty. He and his comrade had heard a cry, had come up in time to see the lady jump in after her husband, and had got her out fast enough to save her from much damage.\nAfter this, Deronda hastened to the hotel to assure himself that the best medical help would be provided; and being satisfied on this point, he telegraphed the event to Sir Hugo, begging him to come forthwith, and also to Mr. Gascoigne, whose address at the rectory made his nearest known way of getting the information to Gwendolen's mother. Certain words of Gwendolen's in the past had come back to him with the effectiveness of an inspiration: in moments of agitated confession she had spoken of her mother's presence, as a possible help, if she could have had it.",
        "paragraph_chars": [
            [
                0,
                111
            ],
            [
                111,
                274
            ],
            [
                274,
                1763
            ],
            [
                1763,
                1928
            ],
            [
                1928,
                3502
            ],
            [
                3502,
                5203
            ],
            [
                5203,
                6746
            ],
            [
                6746,
                7850
            ],
            [
                7850,
                7888
            ],
            [
                7888,
                8139
            ],
            [
                8139,
                8441
            ],
            [
                8441,
                9008
            ]
        ],
        "segment_chars": [
            [
                0,
                102
            ],
            [
                102,
                111
            ],
            [
                111,
                207
            ],
            [
                207,
                274
            ],
            [
                274,
                576
            ],
            [
                576,
                690
            ],
            [
                690,
                772
            ],
            [
                772,
                947
            ],
            [
                947,
                1106
            ],
            [
                1106,
                1411
            ],
            [
                1411,
                1619
            ],
            [
                1619,
                1763
            ],
            [
                1763,
                1928
            ],
            [
                1928,
                2170
            ],
            [
                2170,
                2542
            ],
            [
                2542,
                2764
            ],
            [
                2764,
                3502
            ],
            [
                3502,
                3759
            ],
            [
                3759,
                3834
            ],
            [
                3834,
                4267
            ],
            [
                4267,
                4345
            ],
            [
                4345,
                4624
            ],
            [
                4624,
                5049
            ],
            [
                5049,
                5203
            ],
            [
                5203,
                5359
            ],
            [
                5359,
                5569
            ],
            [
                5569,
                5787
            ],
            [
                5787,
                5890
            ],
            [
                5890,
                6391
            ],
            [
                6391,
                6746
            ],
            [
                6746,
                7186
            ],
            [
                7186,
                7610
            ],
            [
                7610,
                7850
            ],
            [
                7850,
                7875
            ],
            [
                7875,
                7888
            ],
            [
                7888,
                7902
            ],
            [
                7902,
                7958
            ],
            [
                7958,
                8041
            ],
            [
                8041,
                8139
            ],
            [
                8139,
                8280
            ],
            [
                8280,
                8441
            ],
            [
                8441,
                8784
            ],
            [
                8784,
                9008
            ]
        ],
        "overlap_chars": [
            [
                111,
                170
            ],
            [
                180,
                207
            ],
            [
                207,
                274
            ],
            [
                277,
                313
            ],
            [
                438,
                439
            ],
            [
                327,
                354
            ],
            [
                359,
                378
            ],
            [
                440,
                469
            ],
            [
                481,
                576
            ],
            [
                576,
                579
            ],
            [
                652,
                659
            ],
            [
                670,
                678
            ],
            [
                688,
                689
            ],
            [
                690,
                748
            ],
            [
                770,
                772
            ],
            [
                772,
                786
            ],
            [
                829,
                947
            ],
            [
                947,
                968
            ],
            [
                973,
                984
            ],
            [
                1048,
                1106
            ],
            [
                1106,
                1148
            ],
            [
                1162,
                1179
            ],
            [
                1193,
                1208
            ],
            [
                1210,
                1255
            ],
            [
                1281,
                1393
            ],
            [
                1402,
                1411
            ],
            [
                1411,
                1413
            ],
            [
                1469,
                1497
            ],
            [
                1507,
                1509
            ],
            [
                1510,
                1525
            ],
            [
                1554,
                1562
            ],
            [
                1571,
                1588
            ],
            [
                1595,
                1619
            ],
            [
                1619,
                1661
            ],
            [
                1700,
                1701
            ],
            [
                1662,
                1700
            ],
            [
                1761,
                1763
            ],
            [
                1928,
                1965
            ],
            [
                1978,
                2002
            ],
            [
                2040,
                2041
            ],
            [
                2003,
                2024
            ],
            [
                2053,
                2056
            ],
            [
                2131,
                2153
            ],
            [
                2168,
                2170
            ],
            [
                2200,
                2206
            ],
            [
                2182,
                2190
            ],
            [
                2191,
                2194
            ],
            [
                2235,
                2248
            ],
            [
                2304,
                2307
            ],
            [
                2289,
                2300
            ],
            [
                2228,
                2233
            ],
            [
                2312,
                2317
            ],
            [
                2329,
                2341
            ],
            [
                2347,
                2352
            ],
            [
                2370,
                2379
            ],
            [
                2249,
                2252
            ],
            [
                2419,
                2424
            ],
            [
                2225,
                2227
            ],
            [
                2499,
                2513
            ],
            [
                2540,
                2542
            ],
            [
                2550,
                2589
            ],
            [
                2598,
                2764
            ],
            [
                2764,
                2767
            ],
            [
                2821,
                2849
            ],
            [
                2784,
                2786
            ],
            [
                2873,
                2890
            ],
            [
                3171,
                3175
            ],
            [
                2944,
                2946
            ],
            [
                3198,
                3207
            ],
            [
                2993,
                2995
            ],
            [
                3263,
                3267
            ],
            [
                3288,
                3304
            ],
            [
                3331,
                3341
            ],
            [
                3350,
                3402
            ],
            [
                3412,
                3423
            ],
            [
                3452,
                3473
            ],
            [
                3500,
                3502
            ],
            [
                3502,
                3526
            ],
            [
                3547,
                3561
            ],
            [
                3585,
                3713
            ],
            [
                3757,
                3759
            ],
            [
                3759,
                3769
            ],
            [
                3775,
                3778
            ],
            [
                3806,
                3833
            ],
            [
                3834,
                3947
            ],
            [
                3970,
                4013
            ],
            [
                4120,
                4157
            ],
            [
                4211,
                4267
            ],
            [
                4267,
                4302
            ],
            [
                4316,
                4345
            ],
            [
                4398,
                4440
            ],
            [
                4447,
                4509
            ],
            [
                4522,
                4623
            ],
            [
                4687,
                4713
            ],
            [
                4923,
                4926
            ],
            [
                4812,
                4893
            ],
            [
                4973,
                5049
            ],
            [
                5049,
                5074
            ],
            [
                5097,
                5203
            ],
            [
                5203,
                5246
            ],
            [
                5307,
                5316
            ],
            [
                5324,
                5359
            ],
            [
                5359,
                5385
            ],
            [
                5431,
                5452
            ],
            [
                5421,
                5431
            ],
            [
                5492,
                5569
            ],
            [
                5569,
                5624
            ],
            [
                5707,
                5732
            ],
            [
                5676,
                5678
            ],
            [
                5767,
                5775
            ],
            [
                5785,
                5786
            ],
            [
                5787,
                5890
            ],
            [
                5890,
                5909
            ],
            [
                5911,
                5917
            ],
            [
                5919,
                6002
            ],
            [
                6013,
                6016
            ],
            [
                6018,
                6024
            ],
            [
                6025,
                6038
            ],
            [
                6073,
                6077
            ],
            [
                6086,
                6092
            ],
            [
                6098,
                6178
            ],
            [
                6180,
                6225
            ],
            [
                6260,
                6271
            ],
            [
                6389,
                6391
            ],
            [
                6395,
                6402
            ],
            [
                6473,
                6480
            ],
            [
                6402,
                6403
            ],
            [
                6502,
                6518
            ],
            [
                6527,
                6535
            ],
            [
                6519,
                6525
            ],
            [
                6552,
                6568
            ],
            [
                6609,
                6610
            ],
            [
                6667,
                6746
            ],
            [
                6746,
                6767
            ],
            [
                6779,
                6798
            ],
            [
                6805,
                6862
            ],
            [
                6896,
                6933
            ],
            [
                6941,
                6942
            ],
            [
                6956,
                7018
            ],
            [
                6934,
                6937
            ],
            [
                7022,
                7033
            ],
            [
                7055,
                7186
            ],
            [
                7256,
                7365
            ],
            [
                7241,
                7242
            ],
            [
                7398,
                7419
            ],
            [
                7385,
                7386
            ],
            [
                7221,
                7224
            ],
            [
                7442,
                7461
            ],
            [
                7474,
                7562
            ],
            [
                7608,
                7610
            ],
            [
                7610,
                7679
            ],
            [
                7693,
                7721
            ],
            [
                7742,
                7781
            ],
            [
                7822,
                7828
            ],
            [
                7850,
                7875
            ],
            [
                7875,
                7888
            ],
            [
                7888,
                7902
            ],
            [
                7902,
                7958
            ],
            [
                7958,
                8041
            ],
            [
                8041,
                8060
            ],
            [
                8064,
                8070
            ],
            [
                8080,
                8139
            ],
            [
                8139,
                8163
            ],
            [
                8169,
                8172
            ],
            [
                8183,
                8187
            ],
            [
                8191,
                8240
            ],
            [
                8246,
                8280
            ],
            [
                8280,
                8441
            ],
            [
                8453,
                8460
            ],
            [
                8461,
                8550
            ],
            [
                8582,
                8618
            ],
            [
                8651,
                8677
            ],
            [
                8695,
                8698
            ],
            [
                8716,
                8723
            ],
            [
                8730,
                8784
            ],
            [
                8813,
                8815
            ],
            [
                8902,
                8910
            ],
            [
                8891,
                8898
            ],
            [
                8961,
                8962
            ],
            [
                8801,
                8810
            ],
            [
                8926,
                8961
            ],
            [
                8963,
                9008
            ]
        ],
        "row_chars": [
            [
                0,
                102
            ],
            [
                102,
                111
            ],
            [
                111,
                207
            ],
            [
                207,
                274
            ],
            [
                274,
                576
            ],
            [
                576,
                690
            ],
            [
                690,
                772
            ],
            [
                772,
                947
            ],
            [
                947,
                1106
            ],
            [
                1106,
                1411
            ],
            [
                1411,
                1619
            ],
            [
                1619,
                1763
            ],
            [
                1763,
                1928
            ],
            [
                1928,
                2170
            ],
            [
                2170,
                2542
            ],
            [
                2542,
                2764
            ],
            [
                2764,
                3502
            ],
            [
                3502,
                3759
            ],
            [
                3759,
                3834
            ],
            [
                3834,
                4267
            ],
            [
                4267,
                4345
            ],
            [
                4345,
                4624
            ],
            [
                4624,
                5049
            ],
            [
                5049,
                5203
            ],
            [
                5203,
                5359
            ],
            [
                5359,
                5569
            ],
            [
                5569,
                5787
            ],
            [
                5787,
                5890
            ],
            [
                5890,
                6391
            ],
            [
                6391,
                6746
            ],
            [
                6746,
                7186
            ],
            [
                7186,
                7610
            ],
            [
                7610,
                7850
            ],
            [
                7850,
                7875
            ],
            [
                7875,
                7888
            ],
            [
                7888,
                7902
            ],
            [
                7902,
                7958
            ],
            [
                7958,
                8041
            ],
            [
                8041,
                8139
            ],
            [
                8139,
                8280
            ],
            [
                8280,
                8441
            ],
            [
                8441,
                8784
            ],
            [
                8784,
                9008
            ]
        ]
    },
    "abridged": {
        "text": "When Deronda met Gwendolen and Grandcourt on the staircase, he was seriously preoccupied. He had just been summoned to the second interview with his mother.\nTwo hours after his parting from her, the Princess Halm-Eberstein left the hotel, and he might himself have set off to Mainz, to deliver the letter from Joseph Kalonymos, and get possession of the family chest. But indefinite reasons stopped him from departing.\nLong after the farewell he was kept passive by a weight of memory. He lived again through the exciting scenes which seemed past only in the sense of preparation for their actual presence in his soul. He allowed himself in solitude to weep over that woman's life so near to his, and yet so remote. He beheld the world changed for him by the ties that altered his hopes and fears and gave him a new sense of fellowship, as if by darkness he had joined the wrong band of wanderers, and found with the rise of morning that the tents of his kindred were far off. He imagined the grandfather who had been moved by the same strong impulses as were now being roused from slumber within himself. And through all this passionate meditation, Mordecai and Mirah were always present.\nWhen the persistent ringing of a bell reminded him of the hour, he thought of looking at the railway timetable, but made no movement. He was drawn to Mainz, and to London and his strong attachments there; but other wishes clung to Genoa, with the force of lingering final farewell. He did not formally say, \"I will stay over tonight, because it is Friday, and I should like to go to the evening service at the synagogue where they must all have gone; and besides, I may see the Grandcourts again.\" But he sat doing nothing at all, thinking of the synagogue and also of Gwendolen. He half admitted that it would be cruel to go away without making some effort, in spite of Grandcourt's dislike, to show his sympathy with her.\nIn this state of mind he ate his dinner, rose from it quickly to find the synagogue, and in passing the porter asked if Mr. and Mrs. Grandcourt were still in the hotel. The porter told him they were gone out boating.\nThat information had somehow power enough over Deronda to divide his thoughts with the memories wakened among the keen dark faces of worshippers whose way of praying made him reflect that his grandfather must have been almost as exceptional a Jew as Mordecai. But were not men of ardent zeal and hope everywhere exceptional? They were the creators and feeders of the world - moulding and feeding the more passive life which without them would shrivel into the narrow tenacity of insects, unshaken by thoughts beyond the reach of their antennae.\nSome solicitude about Gwendolen caused him to hasten from the synagogue and choose to take his evening walk toward the quay, thinking it possible that he might be in time to see the Grandcourts come in from their boating. In this case, he resolved to greet them deliberately, and ignore any grounds that the husband might have for wishing him elsewhere.\nThe sun had set behind a bank of cloud, and the waves were agitated by an active breeze. Deronda, sauntering slowly, observed the groups upon the strand watching a sailing-boat which was advancing swiftly landward, being rowed by two men. Amidst the clamorous talk in various languages, Deronda elbowed his way to the foreground to see what was happening.\nTelescopes were being used, and loud statements made that the boat held somebody who had been drowned. One said it was the milord who had gone out in a sailing boat; another maintained that the prostrate figure he could see was miladi; a Frenchman said that milord had probably taken his wife out to drown her, according to the national practice - a remark which an English skipper immediately condemned as nonsense. Deronda watched in fear, seeing swift visions of possible events which might have happened - if this woman apparently snatched from the waters were really Mrs. Grandcourt.\nBut soon there was no doubt: the boat was pulled to land, and he saw Gwendolen half raising herself under her heavy covering of tarpaulin - pale as one of the sheeted dead, shivering, with wet hair streaming and wild amazed eyes, as if she had waked up in a world where some judgment was impending, and the beings she saw around were coming to seize her. The sailors, close about the boat, hindered Deronda from advancing, and he could only look on while Gwendolen, seeming to shrink with terror, was tenderly helped out by the strong arms of those rough, bronzed men, her wet clothes clinging about her limbs. Suddenly her wandering eyes fell on Deronda, standing before her, and as if she had been expecting him, she tried to stretch out her arms, saying-\n\"It is come, it is come! He is dead!\"\n\"Hush, hush!\" said Deronda, in a tone of authority; \"quiet yourself.\" Then to the men who were assisting her, \"I am a connection of this lady's husband. If you will get her to the Italia as quickly as possible, I will undertake everything else.\"\nHe stayed behind to hear the account of one of the boatmen, who told Deronda that her husband had gone down irrecoverably, and his boat was left floating empty. He and his comrade had heard a cry, had come up in time to see the lady jump in after her husband, and had got her out fast enough to save her from much damage.\nDeronda then hastened to the hotel to assure himself that the best medical help would be provided; and he telegraphed the event to Sir Hugo and also to Mr. Gascoigne, as the nearest way of getting the information to Gwendolen's mother. He remembered that in agitated moments, Gwendolen had spoken of her mother's presence as a possible help, if she could have had it.",
        "paragraph_chars": [
            [
                0,
                157
            ],
            [
                157,
                419
            ],
            [
                419,
                1190
            ],
            [
                1190,
                1914
            ],
            [
                1914,
                2131
            ],
            [
                2131,
                2676
            ],
            [
                2676,
                3030
            ],
            [
                3030,
                3386
            ],
            [
                3386,
                3975
            ],
            [
                3975,
                4733
            ],
            [
                4733,
                4771
            ],
            [
                4771,
                5017
            ],
            [
                5017,
                5339
            ],
            [
                5339,
                5706
            ]
        ],
        "segment_chars": [
            [
                0,
                90
            ],
            [
                90,
                157
            ],
            [
                157,
                368
            ],
            [
                368,
                419
            ],
            [
                419,
                486
            ],
            [
                486,
                619
            ],
            [
                619,
                716
            ],
            [
                716,
                977
            ],
            [
                977,
                1106
            ],
            [
                1106,
                1190
            ],
            [
                1190,
                1324
            ],
            [
                1324,
                1472
            ],
            [
                1472,
                1688
            ],
            [
                1688,
                1770
            ],
            [
                1770,
                1914
            ],
            [
                1914,
                2083
            ],
            [
                2083,
                2131
            ],
            [
                2131,
                2391
            ],
            [
                2391,
                2456
            ],
            [
                2456,
                2676
            ],
            [
                2676,
                2898
            ],
            [
                2898,
                3030
            ],
            [
                3030,
                3119
            ],
            [
                3119,
                3269
            ],
            [
                3269,
                3386
            ],
            [
                3386,
                3489
            ],
            [
                3489,
                3803
            ],
            [
                3803,
                3975
            ],
            [
                3975,
                4330
            ],
            [
                4330,
                4586
            ],
            [
                4586,
                4733
            ],
            [
                4733,
                4758
            ],
            [
                4758,
                4771
            ],
            [
                4771,
                4785
            ],
            [
                4785,
                4841
            ],
            [
                4841,
                4924
            ],
            [
                4924,
                5017
            ],
            [
                5017,
                5178
            ],
            [
                5178,
                5339
            ],
            [
                5339,
                5575
            ],
            [
                5575,
                5706
            ]
        ],
        "overlap_chars": [
            [
                0,
                59
            ],
            [
                63,
                90
            ],
            [
                90,
                157
            ],
            [
                157,
                193
            ],
            [
                193,
                194
            ],
            [
                195,
                222
            ],
            [
                223,
                242
            ],
            [
                243,
                272
            ],
            [
                273,
                368
            ],
            [
                368,
                371
            ],
            [
                383,
                390
            ],
            [
                399,
                407
            ],
            [
                417,
                418
            ],
            [
                419,
                477
            ],
            [
                484,
                486
            ],
            [
                486,
                500
            ],
            [
                501,
                619
            ],
            [
                619,
                640
            ],
            [
                641,
                652
            ],
            [
                658,
                716
            ],
            [
                716,
                758
            ],
            [
                759,
                776
            ],
            [
                781,
                796
            ],
            [
                797,
                842
            ],
            [
                855,
                967
            ],
            [
                968,
                977
            ],
            [
                977,
                979
            ],
            [
                989,
                1017
            ],
            [
                1024,
                1026
            ],
            [
                1036,
                1051
            ],
            [
                1055,
                1063
            ],
            [
                1064,
                1081
            ],
            [
                1082,
                1106
            ],
            [
                1106,
                1148
            ],
            [
                1148,
                1149
            ],
            [
                1150,
                1188
            ],
            [
                1188,
                1190
            ],
            [
                1190,
                1227
            ],
            [
                1228,
                1252
            ],
            [
                1252,
                1253
            ],
            [
                1254,
                1275
            ],
            [
                1279,
                1282
            ],
            [
                1300,
                1322
            ],
            [
                1322,
                1324
            ],
            [
                1324,
                1330
            ],
            [
                1337,
                1345
            ],
            [
                1347,
                1350
            ],
            [
                1351,
                1364
            ],
            [
                1365,
                1368
            ],
            [
                1376,
                1387
            ],
            [
                1388,
                1393
            ],
            [
                1393,
                1398
            ],
            [
                1399,
                1411
            ],
            [
                1412,
                1417
            ],
            [
                1418,
                1427
            ],
            [
                1433,
                1436
            ],
            [
                1437,
                1442
            ],
            [
                1443,
                1445
            ],
            [
                1456,
                1470
            ],
            [
                1470,
                1472
            ],
            [
                1475,
                1514
            ],
            [
                1522,
                1688
            ],
            [
                1688,
                1691
            ],
            [
                1692,
                1720
            ],
            [
                1730,
                1732
            ],
            [
                1733,
                1750
            ],
            [
                1751,
                1755
            ],
            [
                1756,
                1758
            ],
            [
                1759,
                1768
            ],
            [
                1770,
                1772
            ],
            [
                1773,
                1777
            ],
            [
                1787,
                1803
            ],
            [
                1810,
                1820
            ],
            [
                1821,
                1873
            ],
            [
                1874,
                1885
            ],
            [
                1891,
                1912
            ],
            [
                1912,
                1914
            ],
            [
                1914,
                1938
            ],
            [
                1939,
                1953
            ],
            [
                1953,
                2081
            ],
            [
                2081,
                2083
            ],
            [
                2083,
                2093
            ],
            [
                2099,
                2102
            ],
            [
                2103,
                2130
            ],
            [
                2131,
                2244
            ],
            [
                2245,
                2288
            ],
            [
                2297,
                2334
            ],
            [
                2335,
                2391
            ],
            [
                2391,
                2426
            ],
            [
                2427,
                2456
            ],
            [
                2461,
                2503
            ],
            [
                2511,
                2573
            ],
            [
                2574,
                2675
            ],
            [
                2681,
                2707
            ],
            [
                2715,
                2718
            ],
            [
                2719,
                2800
            ],
            [
                2822,
                2898
            ],
            [
                2898,
                2923
            ],
            [
                2924,
                3030
            ],
            [
                3030,
                3073
            ],
            [
                3074,
                3083
            ],
            [
                3084,
                3119
            ],
            [
                3119,
                3145
            ],
            [
                3145,
                3166
            ],
            [
                3172,
                3182
            ],
            [
                3192,
                3269
            ],
            [
                3269,
                3324
            ],
            [
                3333,
                3358
            ],
            [
                3359,
                3361
            ],
            [
                3366,
                3374
            ],
            [
                3384,
                3385
            ],
            [
                3386,
                3489
            ],
            [
                3489,
                3508
            ],
            [
                3509,
                3515
            ],
            [
                3516,
                3599
            ],
            [
                3610,
                3613
            ],
            [
                3614,
                3620
            ],
            [
                3620,
                3633
            ],
            [
                3639,
                3643
            ],
            [
                3644,
                3650
            ],
            [
                3651,
                3731
            ],
            [
                3734,
                3779
            ],
            [
                3790,
                3801
            ],
            [
                3801,
                3803
            ],
            [
                3803,
                3810
            ],
            [
                3811,
                3818
            ],
            [
                3826,
                3827
            ],
            [
                3835,
                3851
            ],
            [
                3852,
                3860
            ],
            [
                3861,
                3867
            ],
            [
                3868,
                3884
            ],
            [
                3894,
                3895
            ],
            [
                3896,
                3975
            ],
            [
                3975,
                3996
            ],
            [
                3997,
                4016
            ],
            [
                4017,
                4074
            ],
            [
                4075,
                4112
            ],
            [
                4113,
                4114
            ],
            [
                4120,
                4182
            ],
            [
                4183,
                4186
            ],
            [
                4187,
                4198
            ],
            [
                4199,
                4330
            ],
            [
                4330,
                4439
            ],
            [
                4439,
                4440
            ],
            [
                4449,
                4470
            ],
            [
                4470,
                4471
            ],
            [
                4472,
                4475
            ],
            [
                4476,
                4495
            ],
            [
                4496,
                4584
            ],
            [
                4584,
                4586
            ],
            [
                4586,
                4655
            ],
            [
                4656,
                4684
            ],
            [
                4685,
                4724
            ],
            [
                4725,
                4731
            ],
            [
                4733,
                4758
            ],
            [
                4758,
                4771
            ],
            [
                4771,
                4785
            ],
            [
                4785,
                4841
            ],
            [
                4841,
                4924
            ],
            [
                4924,
                4943
            ],
            [
                4944,
                4950
            ],
            [
                4958,
                5017
            ],
            [
                5017,
                5041
            ],
            [
                5042,
                5045
            ],
            [
                5068,
                5072
            ],
            [
                5094,
                5143
            ],
            [
                5144,
                5178
            ],
            [
                5178,
                5339
            ],
            [
                5339,
                5346
            ],
            [
                5352,
                5441
            ],
            [
                5442,
                5478
            ],
            [
                5479,
                5505
            ],
            [
                5509,
                5512
            ],
            [
                5513,
                5520
            ],
            [
                5521,
                5575
            ],
            [
                5594,
                5596
            ],
            [
                5597,
                5605
            ],
            [
                5606,
                5613
            ],
            [
                5613,
                5614
            ],
            [
                5615,
                5624
            ],
            [
                5625,
                5660
            ],
            [
                5661,
                5706
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                90
            ],
            [
                90,
                157
            ],
            [
                157,
                368
            ],
            [
                368,
                419
            ],
            [
                419,
                486
            ],
            [
                486,
                619
            ],
            [
                619,
                716
            ],
            [
                716,
                977
            ],
            [
                977,
                1106
            ],
            [
                1106,
                1190
            ],
            [
                1190,
                1190
            ],
            [
                1190,
                1324
            ],
            [
                1324,
                1472
            ],
            [
                1472,
                1688
            ],
            [
                1688,
                1914
            ],
            [
                1914,
                2083
            ],
            [
                2083,
                2131
            ],
            [
                2131,
                2391
            ],
            [
                2391,
                2456
            ],
            [
                2456,
                2676
            ],
            [
                2676,
                2898
            ],
            [
                2898,
                3030
            ],
            [
                3030,
                3119
            ],
            [
                3119,
                3269
            ],
            [
                3269,
                3386
            ],
            [
                3386,
                3489
            ],
            [
                3489,
                3803
            ],
            [
                3803,
                3975
            ],
            [
                3975,
                4330
            ],
            [
                4330,
                4586
            ],
            [
                4586,
                4733
            ],
            [
                4733,
                4758
            ],
            [
                4758,
                4771
            ],
            [
                4771,
                4785
            ],
            [
                4785,
                4841
            ],
            [
                4841,
                4924
            ],
            [
                4924,
                5017
            ],
            [
                5017,
                5178
            ],
            [
                5178,
                5339
            ],
            [
                5339,
                5575
            ],
            [
                5575,
                5706
            ]
        ]
    }
}