{
    "original": {
        "text": "\"But I shall say no more of this at this time; for this is to be felt and not to be talked of; and they who never touched it with their fingers may secretly perhaps laugh at it in their hearts and be never the wiser.\"--JEREMY TAYLOR.\nThe Roman Emperor in the legend put to death ten learned Israelites to avenge the sale of Joseph by his brethren. And there have always been enough of his kidney, whose piety lies in punishing who can see the justice of grudges but not of gratitude. For you shall never convince the stronger feeling that it hath not the stronger reason, or incline him who hath no love to believe that there is good ground for loving. As we may learn from the order of word-making, wherein _love_ precedeth _lovable_.\nWhen Deronda presented his letter at the banking-house in the _Schuster Strasse_ at Mainz, and asked for Joseph Kalonymos, he was presently shown into an inner room, where, seated at a table arranging open letters, was the white-bearded man whom he had seen the year before in the synagogue at Frankfort. He wore his hat--it seemed to be the same old felt hat as before--and near him was a packed portmanteau with a wrap and overcoat upon it. On seeing Deronda enter he rose, but did not advance or put out his hand. Looking at him with small penetrating eyes which glittered like black gems in the midst of his yellowish face and white hair, he said in German,\n\"Good! It is now you who seek me, young man.\"\n\"Yes; I seek you with gratitude, as a friend of my grandfather's,\" said Deronda, \"and I am under an obligation to you for giving yourself much trouble on my account.\" He spoke without difficulty in that liberal German tongue which takes many strange accents to its maternal bosom.\nKalonymos now put out his hand and said cordially, \"So you are no longer angry at being something more than an Englishman?\"\n\"On the contrary. I thank you heartily for helping to save me from remaining in ignorance of my parentage, and for taking care of the chest that my grandfather left in trust for me.\"\n\"Sit down, sit down,\" said Kalonymos, in a quick undertone, seating himself again, and pointing to a chair near him. Then deliberately laying aside his hat and showing a head thickly covered, with white hair, he stroked and clutched his beard while he looked examiningly at the young face before him. The moment wrought strongly on Deronda's imaginative susceptibility: in the presence of one linked still in zealous friendship with the grandfather whose hope had yearned toward him when he was unborn, and who, though dead, was yet to speak with him in those written memorials which, says Milton, \"contain a potency of life in them to be as active as that soul whose progeny they are,\" he seemed to himself to be touching the electric chain of his own ancestry; and he bore the scrutinizing look of Kalonymos with a delighted awe, something like what one feels in the solemn commemoration of acts done long ago but still telling markedly on the life of to-day. Impossible for men of duller fibre--men whose affection is not ready to diffuse itself through the wide travel of imagination, to comprehend, perhaps even to credit this sensibility of Deronda's; but it subsisted, like their own dullness, notwithstanding their lack of belief in it--and it gave his face an expression which seemed very satisfactory to the observer.\nHe said in Hebrew, quoting from one of the fine hymns in the Hebrew liturgy, \"As thy goodness has been great to the former generations, even so may it be to the latter.\" Then after pausing a little he began, \"Young man, I rejoice that I was not yet set off again on my travels, and that you are come in time for me to see the image of my friend as he was in his youth--no longer perverted from the fellowship of your people--no longer shrinking in proud wrath from the touch of him who seemed to be claiming you as a Jew. You come with thankfulness yourself to claim the kindred and heritage that wicked contrivance would have robbed you of. You come with a willing soul to declare, 'I am the grandson of Daniel Charisi.' Is it not so?\"\n\"Assuredly it is,\" said Deronda. \"But let me say that I should at no time have been inclined to treat a Jew with incivility simply because he was a Jew. You can understand that I shrank from saying to a stranger, 'I know nothing of my mother.'\"\n\"A sin, a sin!\" said Kalonymos, putting up his hand and closing his eyes in disgust. \"A robbery of our people--as when our youths and maidens were reared for the Roman Edom. But it is frustrated. I have frustrated it. When Daniel Charisi--may his Rock and his Redeemer guard him!--when Daniel Charisi was a stripling and I was a lad little above his shoulder, we made a solemn vow always to be friends. He said, 'Let us bind ourselves with duty, as if we were sons of the same mother.' That was his bent from first to last--as he said, to fortify his soul with bonds. It was a saying of his, 'Let us bind love with duty; for duty is the love of law; and law is the nature of the Eternal.' So we bound ourselves. And though we were much apart in our later life, the bond has never been broken. When he was dead, they sought to rob him; but they could not rob him of me. I rescued that remainder of him which he had prized and preserved for his offspring. And I have restored to him the offspring they had robbed him of. I will bring you the chest forthwith.\"\nKalonymos left the room for a few minutes, and returned with a clerk who carried the chest, set it down on the floor, drew off a leather cover, and went out again. It was not very large, but was made heavy by ornamental bracers and handles of gilt iron. The wood was beautifully incised with Arabic lettering.\n\"So!\" said Kalonymos, returning to his seat. \"And here is the curious key,\" he added, taking it from a small leathern bag. \"Bestow it carefully. I trust you are methodic and wary.\" He gave Deronda the monitory and slightly suspicious look with which age is apt to commit any object to the keeping of youth.\n\"I shall be more careful of this than of any other property,\" said Deronda, smiling and putting the key in his breast-pocket. \"I never before possessed anything that was a sign to me of so much cherished hope and effort. And I shall never forget that the effort was partly yours. Have you time to tell me more of my grandfather? Or shall I be trespassing in staying longer?\"\n\"Stay yet a while. In an hour and eighteen minutes I start for Trieste,\" said Kalonymos, looking at his watch, \"and presently my sons will expect my attention. Will you let me make you known to them, so that they may have the pleasure of showing hospitality to my friend's grandson? They dwell here in ease and luxury, though I choose to be a wanderer.\"\n\"I shall be glad if you will commend me to their acquaintance for some future opportunity,\" said Deronda. \"There are pressing claims calling me to England--friends who may be much in need of my presence. I have been kept away from them too long by unexpected circumstances. But to know more of you and your family would be motive enough to bring me again to Mainz.\"\n\"Good! Me you will hardly find, for I am beyond my threescore years and ten, and I am a wanderer, carrying my shroud with me. But my sons and their children dwell here in wealth and unity. The days are changed for us since Karl the Great fetched my ancestors from Italy to bring some tincture of knowledge to our rough German brethren. I and my contemporaries have had to fight for it too. Our youth fell on evil days; but this we have won; we increase our wealth in safety, and the learning of all Germany is fed and fattened by Jewish brains--though they keep not always their Jewish hearts. Have you been left altogether ignorant of your people's life, young man?\"\n\"No,\" said Deronda, \"I have lately, before I had any true suspicion of my parentage, been led to study everything belonging to their history with more interest than any other subject. It turns out that I have been making myself ready to understand my grandfather a little.\" He was anxious less the time should be consumed before this circuitous course of talk could lead them back to the topic he most cared about. Age does not easily distinguish between what it needs to express and what youth needs to know--distance seeming to level the objects of memory; and keenly active as Joseph Kalonymos showed himself, an inkstand in the wrong place would have hindered his imagination from getting to Beyrout: he had been used to unite restless travel with punctilious observation. But Deronda's last sentence answered its purpose.\n\"So--you would perhaps have been such a man as he if your education had not hindered; for you are like him in features:--yet not altogether, young man. He had an iron will in his face: it braced up everybody about him. When he was quite young he had already got one deep upright line in his brow. I see none of that in you. Daniel Charisi used to say, 'Better, a wrong will than a wavering; better a steadfast enemy than an uncertain friend; better a false belief than no belief at all.' What he despised most was indifference. He had longer reasons than I can give you.\"\n\"Yet his knowledge was not narrow?\" said Deronda, with a tacit reference to the usual excuse for indecision--that it comes from knowing too much.\n\"Narrow? no,\" said Kalonymos, shaking his head with a compassionate smile \"From his childhood upward, he drank in learning as easily as the plant sucks up water. But he early took to medicine and theories about life and health. He traveled to many countries, and spent much of his substance in seeing and knowing. What he used to insist on was that the strength and wealth of mankind depended on the balance of separateness and communication, and he was bitterly against our people losing themselves among the Gentiles; 'It's no better,' said he, 'than the many sorts of grain going back from their variety into sameness.' He mingled all sorts of learning; and in that he was like our Arabic writers in the golden time. We studied together, but he went beyond me. Though we were bosom friends, and he poured himself out to me, we were as different as the inside and outside of the bowl. I stood up for two notions of my own: I took Charisi's sayings as I took the shape of the trees: they were there, not to be disputed about. It came to the same thing in both of us; we were both faithful Jews, thankful not to be Gentiles. And since I was a ripe man, I have been what I am now, for all but age--loving to wander, loving transactions, loving to behold all things, and caring nothing about hardship. Charisi thought continually of our people's future: he went with all his soul into that part of our religion: I, not. So we have freedom, I am content. Our people wandered before they were driven. Young man when I am in the East, I lie much on deck and watch the greater stars. The sight of them satisfies me. I know them as they rise, and hunger not to know more. Charisi was satisfied with no sight, but pieced it out with what had been before and what would come after. Yet we loved each other, and as he said, he bound our love with duty; we solemnly pledged ourselves to help and defend each other to the last. I have fulfilled my pledge.\" Here Kalonymos rose, and Deronda, rising also, said,\n\"And in being faithful to him you have caused justice to be done to me. It would have been a robbery of me too that I should never have known of the inheritance he had prepared for me. I thank you with my whole soul.\"\n\"Be worthy of him, young man. What is your vocation?\" This question was put with a quick abruptness which embarrassed Deronda, who did not feel it quite honest to allege his law-reading as a vocation. He answered,\n\"I cannot say that I have any.\"\n\"Get one, get one. The Jew must be diligent. You will call yourself a Jew and profess the faith of your fathers?\" said Kalonymos, putting his hand on Deronda's shoulder and looking sharply in his face.\n\"I shall call myself a Jew,\" said Deronda, deliberately, becoming slightly paler under the piercing eyes of his questioner. \"But I will not say that I shall profess to believe exactly as my fathers have believed. Our fathers themselves changed the horizon of their belief and learned of other races. But I think I can maintain my grandfather's notion of separateness with communication. I hold that my first duty is to my own people, and if there is anything to be done toward restoring or perfecting their common life, I shall make that my vocation.\"\nIt happened to Deronda at that moment, as it has often happened to others, that the need for speech made an epoch in resolve. His respect for the questioner would not let him decline to answer, and by the necessity to answer he found out the truth for himself.\n\"Ah, you argue and you look forward--you are Daniel Charisi's grandson,\" said Kalonymos, adding a benediction in Hebrew.\nWith that they parted; and almost as soon as Deronda was in London, the aged man was again on shipboard, greeting the friendly stars without any eager curiosity.",
        "paragraph_chars": [
            [
                0,
                234
            ],
            [
                234,
                736
            ],
            [
                736,
                1398
            ],
            [
                1398,
                1444
            ],
            [
                1444,
                1725
            ],
            [
                1725,
                1849
            ],
            [
                1849,
                2032
            ],
            [
                2032,
                3360
            ],
            [
                3360,
                4097
            ],
            [
                4097,
                4342
            ],
            [
                4342,
                5400
            ],
            [
                5400,
                5710
            ],
            [
                5710,
                6017
            ],
            [
                6017,
                6392
            ],
            [
                6392,
                6746
            ],
            [
                6746,
                7112
            ],
            [
                7112,
                7780
            ],
            [
                7780,
                8607
            ],
            [
                8607,
                9179
            ],
            [
                9179,
                9325
            ],
            [
                9325,
                11323
            ],
            [
                11323,
                11541
            ],
            [
                11541,
                11755
            ],
            [
                11755,
                11787
            ],
            [
                11787,
                11989
            ],
            [
                11989,
                12541
            ],
            [
                12541,
                12802
            ],
            [
                12802,
                12923
            ],
            [
                12923,
                13084
            ]
        ],
        "segment_chars": [
            [
                0,
                217
            ],
            [
                217,
                234
            ],
            [
                234,
                348
            ],
            [
                348,
                484
            ],
            [
                484,
                653
            ],
            [
                653,
                736
            ],
            [
                736,
                1041
            ],
            [
                1041,
                1179
            ],
            [
                1179,
                1253
            ],
            [
                1253,
                1398
            ],
            [
                1398,
                1405
            ],
            [
                1405,
                1444
            ],
            [
                1444,
                1611
            ],
            [
                1611,
                1725
            ],
            [
                1725,
                1849
            ],
            [
                1849,
                1867
            ],
            [
                1867,
                2032
            ],
            [
                2032,
                2149
            ],
            [
                2149,
                2333
            ],
            [
                2333,
                2994
            ],
            [
                2994,
                3360
            ],
            [
                3360,
                3530
            ],
            [
                3530,
                3882
            ],
            [
                3882,
                4002
            ],
            [
                4002,
                4082
            ],
            [
                4082,
                4097
            ],
            [
                4097,
                4130
            ],
            [
                4130,
                4250
            ],
            [
                4250,
                4342
            ],
            [
                4342,
                4358
            ],
            [
                4358,
                4427
            ],
            [
                4427,
                4516
            ],
            [
                4516,
                4538
            ],
            [
                4538,
                4560
            ],
            [
                4560,
                4745
            ],
            [
                4745,
                4828
            ],
            [
                4828,
                4910
            ],
            [
                4910,
                5031
            ],
            [
                5031,
                5054
            ],
            [
                5054,
                5135
            ],
            [
                5135,
                5211
            ],
            [
                5211,
                5296
            ],
            [
                5296,
                5361
            ],
            [
                5361,
                5400
            ],
            [
                5400,
                5564
            ],
            [
                5564,
                5654
            ],
            [
                5654,
                5710
            ],
            [
                5710,
                5716
            ],
            [
                5716,
                5755
            ],
            [
                5755,
                5833
            ],
            [
                5833,
                5855
            ],
            [
                5855,
                5891
            ],
            [
                5891,
                6017
            ],
            [
                6017,
                6143
            ],
            [
                6143,
                6238
            ],
            [
                6238,
                6297
            ],
            [
                6297,
                6346
            ],
            [
                6346,
                6392
            ],
            [
                6392,
                6411
            ],
            [
                6411,
                6552
            ],
            [
                6552,
                6675
            ],
            [
                6675,
                6746
            ],
            [
                6746,
                6852
            ],
            [
                6852,
                6950
            ],
            [
                6950,
                7020
            ],
            [
                7020,
                7112
            ],
            [
                7112,
                7119
            ],
            [
                7119,
                7238
            ],
            [
                7238,
                7301
            ],
            [
                7301,
                7448
            ],
            [
                7448,
                7502
            ],
            [
                7502,
                7706
            ],
            [
                7706,
                7780
            ],
            [
                7780,
                7964
            ],
            [
                7964,
                8054
            ],
            [
                8054,
                8195
            ],
            [
                8195,
                8557
            ],
            [
                8557,
                8607
            ],
            [
                8607,
                8759
            ],
            [
                8759,
                8826
            ],
            [
                8826,
                8904
            ],
            [
                8904,
                8931
            ],
            [
                8931,
                9095
            ],
            [
                9095,
                9135
            ],
            [
                9135,
                9179
            ],
            [
                9179,
                9215
            ],
            [
                9215,
                9325
            ],
            [
                9325,
                9334
            ],
            [
                9334,
                9487
            ],
            [
                9487,
                9553
            ],
            [
                9553,
                9639
            ],
            [
                9639,
                9948
            ],
            [
                9948,
                10045
            ],
            [
                10045,
                10089
            ],
            [
                10089,
                10212
            ],
            [
                10212,
                10352
            ],
            [
                10352,
                10450
            ],
            [
                10450,
                10625
            ],
            [
                10625,
                10743
            ],
            [
                10743,
                10777
            ],
            [
                10777,
                10822
            ],
            [
                10822,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                10990
            ],
            [
                10990,
                11098
            ],
            [
                11098,
                11241
            ],
            [
                11241,
                11270
            ],
            [
                11270,
                11323
            ],
            [
                11323,
                11395
            ],
            [
                11395,
                11508
            ],
            [
                11508,
                11541
            ],
            [
                11541,
                11571
            ],
            [
                11571,
                11595
            ],
            [
                11595,
                11742
            ],
            [
                11742,
                11755
            ],
            [
                11755,
                11787
            ],
            [
                11787,
                11806
            ],
            [
                11806,
                11832
            ],
            [
                11832,
                11901
            ],
            [
                11901,
                11989
            ],
            [
                11989,
                12113
            ],
            [
                12113,
                12202
            ],
            [
                12202,
                12289
            ],
            [
                12289,
                12376
            ],
            [
                12376,
                12541
            ],
            [
                12541,
                12667
            ],
            [
                12667,
                12802
            ],
            [
                12802,
                12923
            ],
            [
                12923,
                13084
            ]
        ],
        "overlap_chars": [
            [
                736,
                793
            ],
            [
                820,
                865
            ],
            [
                876,
                900
            ],
            [
                907,
                936
            ],
            [
                942,
                1041
            ],
            [
                1111,
                1132
            ],
            [
                1145,
                1179
            ],
            [
                1179,
                1202
            ],
            [
                1396,
                1397
            ],
            [
                1203,
                1211
            ],
            [
                1363,
                1366
            ],
            [
                1253,
                1295
            ],
            [
                1377,
                1396
            ],
            [
                1398,
                1405
            ],
            [
                1405,
                1444
            ],
            [
                1444,
                1524
            ],
            [
                1639,
                1641
            ],
            [
                1655,
                1661
            ],
            [
                1723,
                1725
            ],
            [
                1725,
                1734
            ],
            [
                1739,
                1849
            ],
            [
                1849,
                1867
            ],
            [
                1867,
                2032
            ],
            [
                2032,
                2068
            ],
            [
                2147,
                2149
            ],
            [
                2174,
                2187
            ],
            [
                2239,
                2243
            ],
            [
                2306,
                2333
            ],
            [
                2405,
                2420
            ],
            [
                2469,
                2480
            ],
            [
                2371,
                2373
            ],
            [
                2364,
                2371
            ],
            [
                2793,
                2794
            ],
            [
                2719,
                2728
            ],
            [
                2740,
                2793
            ],
            [
                2533,
                2534
            ],
            [
                2795,
                2810
            ],
            [
                2829,
                2846
            ],
            [
                2849,
                2862
            ],
            [
                2992,
                2994
            ],
            [
                3159,
                3188
            ],
            [
                3284,
                3345
            ],
            [
                3350,
                3360
            ],
            [
                3363,
                3391
            ],
            [
                3408,
                3410
            ],
            [
                3435,
                3530
            ],
            [
                3530,
                3534
            ],
            [
                3558,
                3589
            ],
            [
                3642,
                3727
            ],
            [
                3785,
                3855
            ],
            [
                3868,
                3882
            ],
            [
                3882,
                3908
            ],
            [
                3918,
                3930
            ],
            [
                3943,
                4002
            ],
            [
                4002,
                4082
            ],
            [
                4082,
                4097
            ],
            [
                4097,
                4107
            ],
            [
                4113,
                4130
            ],
            [
                4130,
                4159
            ],
            [
                4171,
                4250
            ],
            [
                4274,
                4342
            ],
            [
                4342,
                4358
            ],
            [
                4358,
                4372
            ],
            [
                4415,
                4427
            ],
            [
                4427,
                4451
            ],
            [
                4516,
                4538
            ],
            [
                4623,
                4745
            ],
            [
                4745,
                4828
            ],
            [
                5031,
                5054
            ],
            [
                5054,
                5135
            ],
            [
                5135,
                5211
            ],
            [
                5211,
                5296
            ],
            [
                5361,
                5400
            ],
            [
                5400,
                5423
            ],
            [
                5441,
                5490
            ],
            [
                5544,
                5547
            ],
            [
                5492,
                5516
            ],
            [
                5562,
                5564
            ],
            [
                5564,
                5654
            ],
            [
                5654,
                5710
            ],
            [
                5710,
                5716
            ],
            [
                5716,
                5730
            ],
            [
                5753,
                5755
            ],
            [
                5755,
                5756
            ],
            [
                5760,
                5771
            ],
            [
                5780,
                5833
            ],
            [
                5833,
                5855
            ],
            [
                5855,
                5877
            ],
            [
                5880,
                5891
            ],
            [
                5891,
                5910
            ],
            [
                5924,
                6017
            ],
            [
                6017,
                6143
            ],
            [
                6143,
                6193
            ],
            [
                6200,
                6238
            ],
            [
                6297,
                6344
            ],
            [
                6746,
                6747
            ],
            [
                6411,
                6504
            ],
            [
                7193,
                7238
            ],
            [
                7238,
                7301
            ],
            [
                7301,
                7395
            ],
            [
                7408,
                7448
            ],
            [
                7502,
                7625
            ],
            [
                7639,
                7655
            ],
            [
                7704,
                7706
            ],
            [
                7706,
                7780
            ],
            [
                7780,
                7814
            ],
            [
                7865,
                7882
            ],
            [
                7907,
                7925
            ],
            [
                7931,
                7939
            ],
            [
                7962,
                7964
            ],
            [
                7964,
                8042
            ],
            [
                8051,
                8054
            ],
            [
                8054,
                8068
            ],
            [
                8161,
                8163
            ],
            [
                8188,
                8193
            ],
            [
                8444,
                8447
            ],
            [
                8391,
                8392
            ],
            [
                8260,
                8263
            ],
            [
                8571,
                8607
            ],
            [
                8607,
                8608
            ],
            [
                8612,
                8691
            ],
            [
                8691,
                8725
            ],
            [
                8728,
                8746
            ],
            [
                8757,
                8759
            ],
            [
                8759,
                8790
            ],
            [
                8824,
                8826
            ],
            [
                8904,
                8931
            ],
            [
                8931,
                8966
            ],
            [
                8968,
                8996
            ],
            [
                9047,
                9095
            ],
            [
                9095,
                9133
            ],
            [
                9179,
                9215
            ],
            [
                9215,
                9227
            ],
            [
                9323,
                9325
            ],
            [
                9325,
                9334
            ],
            [
                9334,
                9353
            ],
            [
                9399,
                9400
            ],
            [
                9427,
                9487
            ],
            [
                9487,
                9553
            ],
            [
                9644,
                9646
            ],
            [
                9652,
                9654
            ],
            [
                9766,
                9948
            ],
            [
                9948,
                10045
            ],
            [
                10045,
                10089
            ],
            [
                10089,
                10117
            ],
            [
                10150,
                10212
            ],
            [
                10625,
                10743
            ],
            [
                10746,
                10777
            ],
            [
                10777,
                10822
            ],
            [
                10990,
                11001
            ],
            [
                11002,
                11016
            ],
            [
                11025,
                11030
            ],
            [
                11075,
                11098
            ],
            [
                11098,
                11126
            ],
            [
                11142,
                11187
            ],
            [
                11198,
                11241
            ],
            [
                11241,
                11270
            ],
            [
                11270,
                11321
            ],
            [
                11508,
                11541
            ],
            [
                11541,
                11571
            ],
            [
                11571,
                11595
            ],
            [
                11595,
                11608
            ],
            [
                11647,
                11687
            ],
            [
                11694,
                11742
            ],
            [
                11742,
                11753
            ],
            [
                11755,
                11787
            ],
            [
                11787,
                11806
            ],
            [
                11806,
                11832
            ],
            [
                11832,
                11901
            ],
            [
                11901,
                11916
            ],
            [
                11960,
                11989
            ],
            [
                11989,
                12075
            ],
            [
                12080,
                12093
            ],
            [
                12111,
                12113
            ],
            [
                12113,
                12202
            ],
            [
                12202,
                12289
            ],
            [
                12376,
                12541
            ],
            [
                12541,
                12578
            ],
            [
                12614,
                12667
            ],
            [
                12739,
                12802
            ],
            [
                12802,
                12837
            ],
            [
                12839,
                12923
            ],
            [
                12923,
                12944
            ],
            [
                13083,
                13084
            ]
        ],
        "row_chars": [
            [
                0,
                217
            ],
            [
                217,
                234
            ],
            [
                234,
                348
            ],
            [
                348,
                484
            ],
            [
                484,
                653
            ],
            [
                653,
                736
            ],
            [
                736,
                1041
            ],
            [
                1041,
                1179
            ],
            [
                1179,
                1398
            ],
            [
                1398,
                1405
            ],
            [
                1405,
                1444
            ],
            [
                1444,
                1725
            ],
            [
                1725,
                1849
            ],
            [
                1849,
                1867
            ],
            [
                1867,
                2032
            ],
            [
                2032,
                2149
            ],
            [
                2149,
                2333
            ],
            [
                2333,
                2994
            ],
            [
                2994,
                3360
            ],
            [
                3360,
                3530
            ],
            [
                3530,
                3882
            ],
            [
                3882,
                4002
            ],
            [
                4002,
                4082
            ],
            [
                4082,
                4097
            ],
            [
                4097,
                4130
            ],
            [
                4130,
                4250
            ],
            [
                4250,
                4342
            ],
            [
                4342,
                4358
            ],
            [
                4358,
                4427
            ],
            [
                4427,
                4538
            ],
            [
                4538,
                4560
            ],
            [
                4560,
                4745
            ],
            [
                4745,
                4828
            ],
            [
                4828,
                4910
            ],
            [
                4910,
                5031
            ],
            [
                5031,
                5054
            ],
            [
                5054,
                5135
            ],
            [
                5135,
                5211
            ],
            [
                5211,
                5296
            ],
            [
                5296,
                5361
            ],
            [
                5361,
                5400
            ],
            [
                5400,
                5564
            ],
            [
                5564,
                5654
            ],
            [
                5654,
                5710
            ],
            [
                5710,
                5716
            ],
            [
                5716,
                5755
            ],
            [
                5755,
                5833
            ],
            [
                5833,
                5855
            ],
            [
                5855,
                5891
            ],
            [
                5891,
                6017
            ],
            [
                6017,
                6143
            ],
            [
                6143,
                6238
            ],
            [
                6238,
                6297
            ],
            [
                6297,
                6346
            ],
            [
                6346,
                6392
            ],
            [
                6392,
                6411
            ],
            [
                6411,
                7238
            ],
            [
                7238,
                7301
            ],
            [
                7301,
                7448
            ],
            [
                7448,
                7502
            ],
            [
                7502,
                7706
            ],
            [
                7706,
                7780
            ],
            [
                7780,
                7964
            ],
            [
                7964,
                8054
            ],
            [
                8054,
                8607
            ],
            [
                8607,
                8759
            ],
            [
                8759,
                8826
            ],
            [
                8826,
                8904
            ],
            [
                8904,
                8931
            ],
            [
                8931,
                9095
            ],
            [
                9095,
                9135
            ],
            [
                9135,
                9179
            ],
            [
                9179,
                9215
            ],
            [
                9215,
                9325
            ],
            [
                9325,
                9334
            ],
            [
                9334,
                9487
            ],
            [
                9487,
                9553
            ],
            [
                9553,
                9639
            ],
            [
                9639,
                9948
            ],
            [
                9948,
                10045
            ],
            [
                10045,
                10089
            ],
            [
                10089,
                10212
            ],
            [
                10212,
                10352
            ],
            [
                10352,
                10450
            ],
            [
                10450,
                10625
            ],
            [
                10625,
                10743
            ],
            [
                10743,
                10777
            ],
            [
                10777,
                10822
            ],
            [
                10822,
                10903
            ],
            [
                10903,
                10935
            ],
            [
                10935,
                10990
            ],
            [
                10990,
                11098
            ],
            [
                11098,
                11241
            ],
            [
                11241,
                11270
            ],
            [
                11270,
                11323
            ],
            [
                11323,
                11395
            ],
            [
                11395,
                11508
            ],
            [
                11508,
                11541
            ],
            [
                11541,
                11571
            ],
            [
                11571,
                11595
            ],
            [
                11595,
                11742
            ],
            [
                11742,
                11755
            ],
            [
                11755,
                11787
            ],
            [
                11787,
                11806
            ],
            [
                11806,
                11832
            ],
            [
                11832,
                11901
            ],
            [
                11901,
                11989
            ],
            [
                11989,
                12113
            ],
            [
                12113,
                12202
            ],
            [
                12202,
                12289
            ],
            [
                12289,
                12376
            ],
            [
                12376,
                12541
            ],
            [
                12541,
                12667
            ],
            [
                12667,
                12802
            ],
            [
                12802,
                12923
            ],
            [
                12923,
                13084
            ]
        ]
    },
    "abridged": {
        "text": "When Deronda presented his letter at the banking-house in Mainz, and asked for Joseph Kalonymos, he was shown into an inner room. There, seated at a table arranging letters, was the white-bearded man whom he had seen the year before in the synagogue at Frankfort. Near him was a packed suitcase with a wrap and overcoat upon it. On seeing Deronda enter, he rose, and looking at him with small penetrating eyes, he said in German-\n\"Good! It is now you who seek me, young man.\"\n\"Yes; I seek you with gratitude, as a friend of my grandfather's,\" said Deronda, speaking in fluent German.\nKalonymos put out his hand and said cordially, \"So you are no longer angry at being something more than an Englishman?\"\n\"On the contrary. I thank you heartily for helping to save me from remaining in ignorance of my parentage, and for taking care of the chest that my grandfather left in trust for me.\"\n\"Sit down, sit down,\" said Kalonymos. Laying aside his hat, he examined the young face before him. The presence of his grandfather's friend affected Deronda deeply; he seemed to be touching the electric chain of his own ancestry, and he bore the scrutiny of Kalonymos with delighted awe. This sensibility of Deronda's gave his face an expression which seemed very satisfactory to his observer.\nKalonymos said in Hebrew, quoting from a hymn, \"As thy goodness has been great to the former generations, even so may it be to the latter.\" Then he began, \"Young man, I rejoice that you are come in time for me to see the image of my friend as he was in his youth - no longer shrinking in proud wrath from the touch of him who seemed to claim you as a Jew. You come with thankfulness to claim the heritage that wicked contrivance would have robbed you of. You come with a willing soul to declare, 'I am the grandson of Daniel Charisi.' Is it not so?\"\n\"Assuredly,\" said Deronda. \"But let me say that I should never have been inclined to treat a Jew with incivility simply because he was a Jew. I shrank from saying to a stranger, 'I know nothing of my mother.'\"\n\"A sin, a sin!\" said Kalonymos in disgust. \"A robbery of our people - but it is frustrated. When Daniel Charisi was a stripling and I was a lad little above his shoulder, we made a solemn vow always to be friends. He said, 'Let us bind ourselves with duty, as if we were sons of the same mother.' So we bound ourselves. And though we were much apart in our later life, the bond has never been broken. When he was dead, they sought to rob him; but they could not rob him of me. I rescued that remainder of him which he had prized and preserved for his offspring. I will bring you the chest forthwith.\"\nKalonymos left the room, and returned with a clerk who carried the chest and set it down on the floor. It was not very large, but was made heavy by ornamental bracers and handles of gilt iron. The wood was beautifully incised with Arabic lettering.\n\"So!\" said Kalonymos. \"Here is the key,\" he added, taking it from a small leathern bag. \"Bestow it carefully. I trust you are methodical and wary.\" He gave Deronda the slightly suspicious look with which age is apt to commit any object to the keeping of youth.\n\"I shall be more careful of this than of any other property,\" said Deronda, smiling and putting the key in his breast-pocket. \"I never before possessed anything that was a sign of so much cherished hope and effort. Have you time to tell me more of my grandfather?\"\n\"In an hour and eighteen minutes I start for Trieste,\" said Kalonymos, looking at his watch, \"I am a wanderer, carrying my shroud with me. But my sons and their children dwell here in wealth and unity. The days are changed for us since Karl the Great fetched my ancestors from Italy to bring some knowledge to our rough German brethren. Our youth fell on evil days; but this we have won; we increase our wealth in safety, and the learning of all Germany is fed by Jewish brains. Have you been left altogether ignorant of your people's life, young man?\"\n\"No,\" said Deronda, \"I have lately been led to study their history with interest. It turns out that I have been making myself ready to understand my grandfather.\" He was anxious to learn more about his grandfather, and his last sentence answered its purpose.\n\"You would perhaps have been such a man as he if your education had not hindered it; for you are like him in features:- yet not altogether. He had an iron will in his face. I see none of that in you. Daniel Charisi used to say, 'Better a wrong will than a wavering; better a false belief than no belief at all.' What he despised most was indifference.\"\n\"Yet his knowledge was not narrow?\" said Deronda.\n\"Narrow? no,\" said Kalonymos. \"He drank in learning as easily as the plant sucks up water. But he early took to medicine and theories about life and health. He travelled to many countries, and he was bitterly against our people losing themselves among the Gentiles; 'It's no better,' said he, 'than the many sorts of grain going back from their variety into sameness.' He mingled all sorts of learning; and in that he was like our Arabic writers in the golden time. We studied together, but he went beyond me. Though we were bosom friends, we were as different as the inside and outside of the bowl. Charisi thought continually of our people's future: he went with all his soul into that part of our religion: I, not. If we have freedom, I am content. Our people wandered before they were driven. But Charisi was not satisfied with that, but thought of what would come after. Yet we loved each other, and bound our love with duty; we solemnly pledged to help and defend each other to the last. I have fulfilled my pledge.\" Here Kalonymos rose, and Deronda, rising also, said-\n\"I thank you with my whole soul.\"\n\"Be worthy of him, young man. What is your vocation?\" This question embarrassed Deronda, who did not feel it honest to allege his law-reading as a vocation. He answered-\n\"I cannot say that I have any.\"\n\"Get one, get one. The Jew must be diligent. You will call yourself a Jew and profess the faith of your fathers?\" said Kalonymos, looking sharply in his face.\n\"I shall call myself a Jew,\" said Deronda, deliberately, becoming slightly paler under those piercing eyes. \"But I will not say that I shall profess to believe exactly as my fathers have believed. Our fathers themselves changed the horizon of their belief and learned of other races. I hold that my first duty is to my own people, and if there is anything to be done toward restoring or perfecting their common life, I shall make that my vocation.\"\nIt happened to Deronda at that moment, that the need for speech made an epoch in resolve. By the necessity to answer he found out the truth for himself.\n\"Ah, you argue and you look forward - you are Daniel Charisi's grandson,\" said Kalonymos, adding a benediction in Hebrew.\nWith that they parted.",
        "paragraph_chars": [
            [
                0,
                430
            ],
            [
                430,
                476
            ],
            [
                476,
                584
            ],
            [
                584,
                704
            ],
            [
                704,
                887
            ],
            [
                887,
                1281
            ],
            [
                1281,
                1831
            ],
            [
                1831,
                2041
            ],
            [
                2041,
                2642
            ],
            [
                2642,
                2891
            ],
            [
                2891,
                3152
            ],
            [
                3152,
                3417
            ],
            [
                3417,
                3970
            ],
            [
                3970,
                4229
            ],
            [
                4229,
                4582
            ],
            [
                4582,
                4632
            ],
            [
                4632,
                5708
            ],
            [
                5708,
                5742
            ],
            [
                5742,
                5912
            ],
            [
                5912,
                5944
            ],
            [
                5944,
                6103
            ],
            [
                6103,
                6552
            ],
            [
                6552,
                6705
            ],
            [
                6705,
                6827
            ],
            [
                6827,
                6849
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                264
            ],
            [
                264,
                329
            ],
            [
                329,
                430
            ],
            [
                430,
                437
            ],
            [
                437,
                476
            ],
            [
                476,
                584
            ],
            [
                584,
                704
            ],
            [
                704,
                722
            ],
            [
                722,
                887
            ],
            [
                887,
                925
            ],
            [
                925,
                986
            ],
            [
                986,
                1175
            ],
            [
                1175,
                1281
            ],
            [
                1281,
                1421
            ],
            [
                1421,
                1637
            ],
            [
                1637,
                1736
            ],
            [
                1736,
                1816
            ],
            [
                1816,
                1831
            ],
            [
                1831,
                1858
            ],
            [
                1858,
                1973
            ],
            [
                1973,
                2041
            ],
            [
                2041,
                2057
            ],
            [
                2057,
                2084
            ],
            [
                2084,
                2133
            ],
            [
                2133,
                2255
            ],
            [
                2255,
                2338
            ],
            [
                2338,
                2361
            ],
            [
                2361,
                2442
            ],
            [
                2442,
                2518
            ],
            [
                2518,
                2603
            ],
            [
                2603,
                2642
            ],
            [
                2642,
                2745
            ],
            [
                2745,
                2835
            ],
            [
                2835,
                2891
            ],
            [
                2891,
                2897
            ],
            [
                2897,
                2913
            ],
            [
                2913,
                2979
            ],
            [
                2979,
                3001
            ],
            [
                3001,
                3039
            ],
            [
                3039,
                3152
            ],
            [
                3152,
                3278
            ],
            [
                3278,
                3367
            ],
            [
                3367,
                3417
            ],
            [
                3417,
                3556
            ],
            [
                3556,
                3619
            ],
            [
                3619,
                3754
            ],
            [
                3754,
                3896
            ],
            [
                3896,
                3970
            ],
            [
                3970,
                4052
            ],
            [
                4052,
                4133
            ],
            [
                4133,
                4229
            ],
            [
                4229,
                4369
            ],
            [
                4369,
                4402
            ],
            [
                4402,
                4429
            ],
            [
                4429,
                4541
            ],
            [
                4541,
                4582
            ],
            [
                4582,
                4618
            ],
            [
                4618,
                4632
            ],
            [
                4632,
                4641
            ],
            [
                4641,
                4662
            ],
            [
                4662,
                4723
            ],
            [
                4723,
                4789
            ],
            [
                4789,
                5001
            ],
            [
                5001,
                5098
            ],
            [
                5098,
                5142
            ],
            [
                5142,
                5232
            ],
            [
                5232,
                5350
            ],
            [
                5350,
                5384
            ],
            [
                5384,
                5429
            ],
            [
                5429,
                5508
            ],
            [
                5508,
                5626
            ],
            [
                5626,
                5655
            ],
            [
                5655,
                5708
            ],
            [
                5708,
                5742
            ],
            [
                5742,
                5772
            ],
            [
                5772,
                5796
            ],
            [
                5796,
                5899
            ],
            [
                5899,
                5912
            ],
            [
                5912,
                5944
            ],
            [
                5944,
                5963
            ],
            [
                5963,
                5989
            ],
            [
                5989,
                6058
            ],
            [
                6058,
                6103
            ],
            [
                6103,
                6211
            ],
            [
                6211,
                6300
            ],
            [
                6300,
                6387
            ],
            [
                6387,
                6552
            ],
            [
                6552,
                6642
            ],
            [
                6642,
                6705
            ],
            [
                6705,
                6827
            ],
            [
                6827,
                6849
            ]
        ],
        "overlap_chars": [
            [
                0,
                57
            ],
            [
                58,
                103
            ],
            [
                104,
                128
            ],
            [
                135,
                164
            ],
            [
                165,
                264
            ],
            [
                264,
                285
            ],
            [
                295,
                329
            ],
            [
                329,
                352
            ],
            [
                352,
                353
            ],
            [
                354,
                362
            ],
            [
                363,
                366
            ],
            [
                367,
                409
            ],
            [
                409,
                428
            ],
            [
                430,
                437
            ],
            [
                437,
                476
            ],
            [
                476,
                556
            ],
            [
                566,
                568
            ],
            [
                576,
                582
            ],
            [
                582,
                584
            ],
            [
                584,
                593
            ],
            [
                594,
                704
            ],
            [
                704,
                722
            ],
            [
                722,
                887
            ],
            [
                887,
                923
            ],
            [
                923,
                925
            ],
            [
                932,
                945
            ],
            [
                945,
                949
            ],
            [
                959,
                986
            ],
            [
                986,
                1001
            ],
            [
                1006,
                1017
            ],
            [
                1017,
                1019
            ],
            [
                1036,
                1043
            ],
            [
                1050,
                1051
            ],
            [
                1052,
                1061
            ],
            [
                1062,
                1115
            ],
            [
                1115,
                1116
            ],
            [
                1117,
                1132
            ],
            [
                1142,
                1159
            ],
            [
                1160,
                1173
            ],
            [
                1173,
                1175
            ],
            [
                1175,
                1204
            ],
            [
                1205,
                1266
            ],
            [
                1271,
                1281
            ],
            [
                1291,
                1319
            ],
            [
                1322,
                1324
            ],
            [
                1326,
                1421
            ],
            [
                1421,
                1425
            ],
            [
                1426,
                1457
            ],
            [
                1458,
                1543
            ],
            [
                1546,
                1616
            ],
            [
                1623,
                1637
            ],
            [
                1637,
                1663
            ],
            [
                1664,
                1676
            ],
            [
                1677,
                1736
            ],
            [
                1736,
                1816
            ],
            [
                1816,
                1831
            ],
            [
                1831,
                1841
            ],
            [
                1841,
                1858
            ],
            [
                1858,
                1887
            ],
            [
                1894,
                1973
            ],
            [
                1973,
                2041
            ],
            [
                2041,
                2057
            ],
            [
                2057,
                2071
            ],
            [
                2072,
                2084
            ],
            [
                2084,
                2108
            ],
            [
                2111,
                2133
            ],
            [
                2133,
                2255
            ],
            [
                2255,
                2338
            ],
            [
                2338,
                2361
            ],
            [
                2361,
                2442
            ],
            [
                2442,
                2518
            ],
            [
                2518,
                2603
            ],
            [
                2603,
                2642
            ],
            [
                2642,
                2665
            ],
            [
                2665,
                2714
            ],
            [
                2715,
                2718
            ],
            [
                2719,
                2743
            ],
            [
                2743,
                2745
            ],
            [
                2745,
                2835
            ],
            [
                2835,
                2891
            ],
            [
                2891,
                2897
            ],
            [
                2897,
                2911
            ],
            [
                2911,
                2913
            ],
            [
                2913,
                2914
            ],
            [
                2914,
                2925
            ],
            [
                2926,
                2979
            ],
            [
                2979,
                3001
            ],
            [
                3001,
                3023
            ],
            [
                3028,
                3039
            ],
            [
                3039,
                3058
            ],
            [
                3059,
                3152
            ],
            [
                3152,
                3278
            ],
            [
                3278,
                3328
            ],
            [
                3329,
                3367
            ],
            [
                3367,
                3414
            ],
            [
                3417,
                3418
            ],
            [
                3418,
                3511
            ],
            [
                3511,
                3556
            ],
            [
                3556,
                3619
            ],
            [
                3619,
                3713
            ],
            [
                3714,
                3754
            ],
            [
                3754,
                3877
            ],
            [
                3878,
                3894
            ],
            [
                3894,
                3896
            ],
            [
                3896,
                3970
            ],
            [
                3970,
                4004
            ],
            [
                4005,
                4022
            ],
            [
                4023,
                4041
            ],
            [
                4042,
                4050
            ],
            [
                4050,
                4052
            ],
            [
                4052,
                4130
            ],
            [
                4130,
                4133
            ],
            [
                4133,
                4147
            ],
            [
                4148,
                4150
            ],
            [
                4162,
                4167
            ],
            [
                4168,
                4171
            ],
            [
                4183,
                4184
            ],
            [
                4185,
                4188
            ],
            [
                4193,
                4229
            ],
            [
                4229,
                4230
            ],
            [
                4230,
                4309
            ],
            [
                4312,
                4346
            ],
            [
                4349,
                4367
            ],
            [
                4367,
                4369
            ],
            [
                4369,
                4400
            ],
            [
                4400,
                4402
            ],
            [
                4402,
                4429
            ],
            [
                4429,
                4464
            ],
            [
                4465,
                4493
            ],
            [
                4493,
                4541
            ],
            [
                4541,
                4579
            ],
            [
                4582,
                4618
            ],
            [
                4618,
                4630
            ],
            [
                4630,
                4632
            ],
            [
                4632,
                4641
            ],
            [
                4641,
                4660
            ],
            [
                4662,
                4663
            ],
            [
                4663,
                4723
            ],
            [
                4723,
                4789
            ],
            [
                4789,
                4791
            ],
            [
                4802,
                4804
            ],
            [
                4819,
                5001
            ],
            [
                5001,
                5098
            ],
            [
                5098,
                5142
            ],
            [
                5142,
                5170
            ],
            [
                5170,
                5232
            ],
            [
                5232,
                5350
            ],
            [
                5353,
                5384
            ],
            [
                5384,
                5429
            ],
            [
                5433,
                5444
            ],
            [
                5449,
                5463
            ],
            [
                5468,
                5473
            ],
            [
                5485,
                5508
            ],
            [
                5508,
                5536
            ],
            [
                5537,
                5582
            ],
            [
                5583,
                5626
            ],
            [
                5626,
                5655
            ],
            [
                5655,
                5706
            ],
            [
                5709,
                5742
            ],
            [
                5742,
                5772
            ],
            [
                5772,
                5796
            ],
            [
                5796,
                5809
            ],
            [
                5810,
                5850
            ],
            [
                5851,
                5899
            ],
            [
                5899,
                5910
            ],
            [
                5912,
                5944
            ],
            [
                5944,
                5963
            ],
            [
                5963,
                5989
            ],
            [
                5989,
                6058
            ],
            [
                6058,
                6073
            ],
            [
                6074,
                6103
            ],
            [
                6103,
                6189
            ],
            [
                6196,
                6209
            ],
            [
                6209,
                6211
            ],
            [
                6211,
                6300
            ],
            [
                6300,
                6387
            ],
            [
                6387,
                6552
            ],
            [
                6552,
                6589
            ],
            [
                6589,
                6642
            ],
            [
                6642,
                6705
            ],
            [
                6705,
                6740
            ],
            [
                6743,
                6827
            ],
            [
                6827,
                6848
            ],
            [
                6848,
                6849
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                264
            ],
            [
                264,
                329
            ],
            [
                329,
                430
            ],
            [
                430,
                437
            ],
            [
                437,
                476
            ],
            [
                476,
                584
            ],
            [
                584,
                704
            ],
            [
                704,
                722
            ],
            [
                722,
                887
            ],
            [
                887,
                925
            ],
            [
                925,
                986
            ],
            [
                986,
                1175
            ],
            [
                1175,
                1281
            ],
            [
                1281,
                1421
            ],
            [
                1421,
                1637
            ],
            [
                1637,
                1736
            ],
            [
                1736,
                1816
            ],
            [
                1816,
                1831
            ],
            [
                1831,
                1858
            ],
            [
                1858,
                1973
            ],
            [
                1973,
                2041
            ],
            [
                2041,
                2057
            ],
            [
                2057,
                2084
            ],
            [
                2084,
                2133
            ],
            [
                2133,
                2133
            ],
            [
                2133,
                2255
            ],
            [
                2255,
                2338
            ],
            [
                2338,
                2338
            ],
            [
                2338,
                2338
            ],
            [
                2338,
                2361
            ],
            [
                2361,
                2442
            ],
            [
                2442,
                2518
            ],
            [
                2518,
                2603
            ],
            [
                2603,
                2603
            ],
            [
                2603,
                2642
            ],
            [
                2642,
                2745
            ],
            [
                2745,
                2835
            ],
            [
                2835,
                2891
            ],
            [
                2891,
                2897
            ],
            [
                2897,
                2913
            ],
            [
                2913,
                2979
            ],
            [
                2979,
                3001
            ],
            [
                3001,
                3039
            ],
            [
                3039,
                3152
            ],
            [
                3152,
                3278
            ],
            [
                3278,
                3367
            ],
            [
                3367,
                3367
            ],
            [
                3367,
                3417
            ],
            [
                3417,
                3417
            ],
            [
                3417,
                3417
            ],
            [
                3417,
                3556
            ],
            [
                3556,
                3619
            ],
            [
                3619,
                3754
            ],
            [
                3754,
                3754
            ],
            [
                3754,
                3896
            ],
            [
                3896,
                3970
            ],
            [
                3970,
                4052
            ],
            [
                4052,
                4133
            ],
            [
                4133,
                4229
            ],
            [
                4229,
                4369
            ],
            [
                4369,
                4402
            ],
            [
                4402,
                4402
            ],
            [
                4402,
                4429
            ],
            [
                4429,
                4541
            ],
            [
                4541,
                4582
            ],
            [
                4582,
                4582
            ],
            [
                4582,
                4618
            ],
            [
                4618,
                4632
            ],
            [
                4632,
                4641
            ],
            [
                4641,
                4723
            ],
            [
                4723,
                4789
            ],
            [
                4789,
                4789
            ],
            [
                4789,
                5001
            ],
            [
                5001,
                5098
            ],
            [
                5098,
                5142
            ],
            [
                5142,
                5232
            ],
            [
                5232,
                5232
            ],
            [
                5232,
                5232
            ],
            [
                5232,
                5232
            ],
            [
                5232,
                5350
            ],
            [
                5350,
                5384
            ],
            [
                5384,
                5429
            ],
            [
                5429,
                5429
            ],
            [
                5429,
                5429
            ],
            [
                5429,
                5429
            ],
            [
                5429,
                5508
            ],
            [
                5508,
                5626
            ],
            [
                5626,
                5655
            ],
            [
                5655,
                5708
            ],
            [
                5708,
                5708
            ],
            [
                5708,
                5708
            ],
            [
                5708,
                5742
            ],
            [
                5742,
                5772
            ],
            [
                5772,
                5796
            ],
            [
                5796,
                5899
            ],
            [
                5899,
                5912
            ],
            [
                5912,
                5944
            ],
            [
                5944,
                5963
            ],
            [
                5963,
                5989
            ],
            [
                5989,
                6058
            ],
            [
                6058,
                6103
            ],
            [
                6103,
                6211
            ],
            [
                6211,
                6300
            ],
            [
                6300,
                6387
            ],
            [
                6387,
                6387
            ],
            [
                6387,
                6552
            ],
            [
                6552,
                6642
            ],
            [
                6642,
                6705
            ],
            [
                6705,
                6827
            ],
            [
                6827,
                6849
            ]
        ]
    }
}