{
    "original": {
        "text": "\"Das Gluck ist eine leichte Dirne, Und weilt nicht gern am selben Ort; Sie streicht das Haar dir von der Stirne Und kusst dich rasch und flattert fort\nFrau Ungluck hat im Gegentheile Dich liebefest an's Herz gedruckt; Sie sagt, sie habe keine Eile, Setzt sich zu dir an's Bett und strickt.\" --HEINE.\nSomething which Mirah had lately been watching for as the fulfilment of a threat, seemed now the continued visit of that familiar sorrow which had lately come back, bringing abundant luggage.\nTurning out of Knightsbridge, after singing at a charitable morning concert in a wealthy house, where she had been recommended by Klesmer, and where there had been the usual groups outside to see the departing company, she began to feel herself dogged by footsteps that kept an even pace with her own. Her concert dress being simple black, over which she had thrown a dust cloak, could not make her an object of unpleasant attention, and render walking an imprudence; but this reflection did not occur to Mirah: another kind of alarm lay uppermost in her mind. She immediately thought of her father, and could no more look round than if she had felt herself tracked by a ghost. To turn and face him would be voluntarily to meet the rush of emotions which beforehand seemed intolerable. If it were her father he must mean to claim recognition, and he would oblige her to face him. She must wait for that compulsion. She walked on, not quickening her pace--of what use was that?--but picturing what was about to happen as if she had the full certainty that the man behind her was her father; and along with her picturing went a regret that she had given her word to Mrs. Meyrick not to use any concealment about him. The regret at last urged her, at least, to try and hinder any sudden betrayal that would cause her brother an unnecessary shock. Under the pressure of this motive, she resolved to turn before she reached her own door, and firmly will the encounter instead of merely submitting to it. She had already reached the entrance of the small square where her home lay, and had made up her mind to turn, when she felt her embodied presentiment getting closer to her, then slipping to her side, grasping her wrist, and saying, with a persuasive curl of accent, \"Mirah!\"\nShe paused at once without any start; it was the voice she expected, and she was meeting the expected eyes. Her face was as grave as if she had been looking at her executioner, while his was adjusted to the intention of soothing and propitiating her. Once a handsome face, with bright color, it was now sallow and deep-lined, and had that peculiar impress of impudent suavity which comes from courting favor while accepting disrespect. He was lightly made and active, with something of youth about him which made the signs of age seem a disguise; and in reality he was hardly fifty-seven. His dress was shabby, as when she had seen him before. The presence of this unreverend father now, more than ever, affected Mirah with the mingled anguish of shame and grief, repulsion and pity--more than ever, now that her own world was changed into one where there was no comradeship to fence him from scorn and contempt.\nSlowly, with a sad, tremulous voice, she said, \"It is you, father.\"\n\"Why did you run away from me, child?\" he began with rapid speech which was meant to have a tone of tender remonstrance, accompanied with various quick gestures like an abbreviated finger-language. \"What were you afraid of? You knew I never made you do anything against your will. It was for your sake I broke up your engagement in the Vorstadt, because I saw it didn't suit you, and you repaid me by leaving me to the bad times that came in consequence. I had made an easier engagement for you at the Vorstadt Theater in Dresden: I didn't tell you, because I wanted to take you by surprise. And you left me planted there--obliged to make myself scarce because I had broken contract. That was hard lines for me, after I had given up everything for the sake of getting you an education which was to be a fortune to you. What father devoted himself to his daughter more than I did to you? You know how I bore that disappointment in your voice, and made the best of it: and when I had nobody besides you, and was getting broken, as a man must who has had to fight his way with his brains--you chose that time to leave me. Who else was it you owed everything to, if not to me? and where was your feeling in return? For what my daughter cared, I might have died in a ditch.\"\nLapidoth stopped short here, not from lack of invention, but because he had reached a pathetic climax, and gave a sudden sob, like a woman's, taking out hastily an old yellow silk handkerchief. He really felt that his daughter had treated him ill--a sort of sensibility which is naturally strong in unscrupulous persons, who put down what is owing to them, without any _per contra_. Mirah, in spite of that sob, had energy enough not to let him suppose that he deceived her. She answered more firmly, though it was the first time she had ever used accusing words to him.\n\"You know why I left you, father; and I had reason to distrust you, because I felt sure that you had deceived my mother. If I could have trusted you, I would have stayed with you and worked for you.\"\n\"I never meant to deceive your mother, Mirah,\" said Lapidoth, putting back his handkerchief, but beginning with a voice that seemed to struggle against further sobbing. \"I meant to take you back to her, but chances hindered me just at the time, and then there came information of her death. It was better for you that I should stay where I was, and your brother could take care of himself. Nobody had any claim on me but you. I had word of your mother's death from a particular friend, who had undertaken to manage things for me, and I sent him over money to pay expenses. There's one chance to be sure--\" Lapidoth had quickly conceived that he must guard against something unlikely, yet possible--\"he may have written me lies for the sake of getting the money out of me.\"\nMirah made no answer; she could not bear to utter the only true one--\"I don't believe one word of what you say\"--and she simply showed a wish that they should walk on, feeling that their standing still might draw down unpleasant notice. Even as they walked along, their companionship might well have made a passer-by turn back to look at them. The figure of Mirah, with her beauty set off by the quiet, careful dress of an English lady, made a strange pendant to this shabby, foreign-looking, eager, and gesticulating man, who withal had an ineffaceable jauntiness of air, perhaps due to the bushy curls of his grizzled hair, the smallness of his hands and feet, and his light walk.\n\"You seem to have done well for yourself, Mirah? _You_ are in no want, I see,\" said the father, looking at her with emphatic examination.\n\"Good friends who found me in distress have helped me to get work,\" said Mirah, hardly knowing what she actually said, from being occupied with what she would presently have to say. \"I give lessons. I have sung in private houses. I have just been singing at a private concert.\" She paused, and then added, with significance, \"I have very good friends, who know all about me.\"\n\"And you would be ashamed they should see your father in this plight? No wonder. I came to England with no prospect, but the chance of finding you. It was a mad quest; but a father's heart is superstitious--feels a loadstone drawing it somewhere or other. I might have done very well, staying abroad: when I hadn't you to take care of, I could have rolled or settled as easily as a ball; but it's hard being lonely in the world, when your spirit's beginning to break. And I thought my little Mirah would repent leaving her father when she came to look back. I've had a sharp pinch to work my way; I don't know what I shall come down to next. Talents like mine are no use in this country. When a man's getting out at elbows nobody will believe in him. I couldn't get any decent employ with my appearance. I've been obliged to get pretty low for a shilling already.\"\nMirah's anxiety was quick enough to imagine her father's sinking into a further degradation, which she was bound to hinder if she could. But before she could answer his string of inventive sentences, delivered with as much glibness as if they had been learned by rote, he added promptly,\n\"Where do you live, Mirah?\"\n\"Here, in this square. We are not far from the house.\"\n\"In lodgings?\"\n\"Yes.\"\n\"Any one to take care of you?\"\n\"Yes,\" said Mirah again, looking full at the keen face which was turned toward hers--\"my brother.\"\nThe father's eyelids fluttered as if the lightning had come across them, and there was a slight movement of the shoulders. But he said, after a just perceptible pause: \"Ezra? How did you know--how did you find him?\"\n\"That would take long to tell. Here we are at the door. My brother would not wish me to close it on you.\"\nMirah was already on the doorstep, but had her face turned toward her father, who stood below her on the pavement. Her heart had begun to beat faster with the prospect of what was coming in the presence of Ezra; and already in this attitude of giving leave to the father whom she had been used to obey--in this sight of him standing below her, with a perceptible shrinking from the admission which he had been indirectly asking for, she had a pang of the peculiar, sympathetic humiliation and shame--the stabbed heart of reverence--which belongs to a nature intensely filial.\n\"Stay a minute, _Liebchen_,\" said Lapidoth, speaking in a lowered tone; \"what sort of man has Ezra turned out?\"\n\"A good man--a wonderful man,\" said Mirah, with slow emphasis, trying to master the agitation which made her voice more tremulous as she went on. She felt urged to prepare her father for the complete penetration of himself which awaited him. \"But he was very poor when my friends found him for me--a poor workman. Once--twelve years ago--he was strong and happy, going to the East, which he loved to think of; and my mother called him back because--because she had lost me. And he went to her, and took care of her through great trouble, and worked for her till she died--died in grief. And Ezra, too, had lost his health and strength. The cold had seized him coming back to my mother, because she was forsaken. For years he has been getting weaker--always poor, always working--but full of knowledge, and great-minded. All who come near him honor him. To stand before him is like standing before a prophet of God\"--Mirah ended with difficulty, her heart throbbing--\"falsehoods are no use.\"\nShe had cast down her eyes that she might not see her father while she spoke the last words--unable to bear the ignoble look of frustration that gathered in his face. But he was none the less quick in invention and decision.\n\"Mirah, _Liebchen_,\" he said, in the old caressing way, \"shouldn't you like me to make myself a little more respectable before my son sees me? If I had a little sum of money, I could fit myself out and come home to you as your father ought, and then I could offer myself for some decent place. With a good shirt and coat on my back, people would be glad enough to have me. I could offer myself for a courier, if I didn't look like a broken-down mountebank. I should like to be with my children, and forget and forgive. But you have never seen your father look like this before. If you had ten pounds at hand--or I could appoint you to bring it me somewhere--I could fit myself out by the day after to-morrow.\"\nMirah felt herself under a temptation which she must try to overcome. She answered, obliging herself to look at him again,\n\"I don't like to deny you what you ask, father; but I have given a promise not to do things for you in secret. It _is_ hard to see you looking needy; but we will bear that for a little while; and then you can have new clothes, and we can pay for them.\" Her practical sense made her see now what was Mrs. Meyrick's wisdom in exacting a promise from her.\nLapidoth's good humor gave way a little. He said, with a sneer, \"You are a hard and fast young lady--you have been learning useful virtues--keeping promises not to help your father with a pound or two when you are getting money to dress yourself in silk--your father who made an idol of you, and gave up the best part of his life to providing for you.\"\n\"It seems cruel--I know it seems cruel,\" said Mirah, feeling this a worse moment than when she meant to drown herself. Her lips were suddenly pale. \"But, father, it is more cruel to break the promises people trust in. That broke my mother's heart--it has broken Ezra's life. You and I must eat now this bitterness from what has been. Bear it. Bear to come in and be cared for as you are.\"\n\"To-morrow, then,\" said Lapidoth, almost turning on his heel away from this pale, trembling daughter, who seemed now to have got the inconvenient world to back her; but he quickly turned on it again, with his hands feeling about restlessly in his pockets, and said, with some return to his appealing tone, \"I'm a little cut up with all this, Mirah. I shall get up my spirits by to-morrow. If you've a little money in your pocket, I suppose it isn't against your promise to give me a trifle--to buy a cigar with.\"\nMirah could not ask herself another question--could not do anything else than put her cold trembling hands in her pocket for her _portemonnaie_ and hold it out. Lapidoth grasped it at once, pressed her fingers the while, said, \"Good-bye, my little girl--to-morrow then!\" and left her. He had not taken many steps before he looked carefully into all the folds of the purse, found two half-sovereigns and odd silver, and, pasted against the folding cover, a bit of paper on which Ezra had inscribed, in a beautiful Hebrew character, the name of his mother, the days of her birth, marriage, and death, and the prayer, \"May Mirah be delivered from evil.\" It was Mirah's liking to have this little inscription on many articles that she used. The father read it, and had a quick vision of his marriage day, and the bright, unblamed young fellow he was at that time; teaching many things, but expecting by-and-by to get money more easily by writing; and very fond of his beautiful bride Sara--crying when she expected him to cry, and reflecting every phase of her feeling with mimetic susceptibility. Lapidoth had traveled a long way from that young self, and thought of all that this inscription signified with an unemotional memory, which was like the ocular perception of a touch to one who has lost the sense of touch, or like morsels on an untasting palate, having shape and grain, but no flavor. Among the things we may gamble away in a lazy selfish life is the capacity for ruth, compunction, or any unselfish regret--which we may come to long for as one in slow death longs to feel laceration, rather than be conscious of a widening margin where consciousness once was. Mirah's purse was a handsome one--a gift to her, which she had been unable to reflect about giving away--and Lapidoth presently found himself outside of his reverie, considering what the purse would fetch in addition to the sum it contained, and what prospect there was of his being able to get more from his daughter without submitting to adopt a penitential form of life under the eyes of that formidable son. On such a subject his susceptibilities were still lively.\nMeanwhile Mirah had entered the house with her power of reticence overcome by the cruelty of her pain. She found her brother quietly reading and sifting old manuscripts of his own, which he meant to consign to Deronda. In the reaction from the long effort to master herself, she fell down before him and clasped his knees, sobbing, and crying, \"Ezra, Ezra!\"\nHe did not speak. His alarm for her spending itself on conceiving the cause of her distress, the more striking from the novelty in her of this violent manifestation. But Mirah's own longing was to be able to speak and tell him the cause. Presently she raised her hand, and still sobbing, said brokenly,\n\"Ezra, my father! our father! He followed me. I wanted him to come in. I said you would let him come in. And he said No, he would not--not now, but to-morrow. And he begged for money from me. And I gave him my purse, and he went away.\"\nMirah's words seemed to herself to express all the misery she felt in them. Her brother found them less grievous than his preconceptions, and said gently, \"Wait for calm, Mirah, and then tell me all,\"--putting off her hat and laying his hands tenderly on her head. She felt the soothing influence, and in a few minutes told him as exactly as she could all that had happened.\n\"He will not come to-morrow,\" said Mordecai. Neither of them said to the other what they both thought, namely, that he might watch for Mirah's outgoings and beg from her again.\n\"Seest thou,\" he presently added, \"our lot is the lot of Israel. The grief and the glory are mingled as the smoke and the flame. It is because we children have inherited the good that we feel the evil. These things are wedded for us, as our father was wedded to our mother.\"\nThe surroundings were of Brompton, but the voice might have come from a Rabbi transmitting the sentences of an elder time to be registered in _Babli_--by which (to our ears) affectionate-sounding diminutive is meant the voluminous Babylonian Talmud. \"The Omnipresent,\" said a Rabbi, \"is occupied in making marriages.\" The levity of the saying lies in the ear of him who hears it; for by marriages the speaker meant all the wondrous combinations of the universe whose issue makes our good and evil.",
        "paragraph_chars": [
            [
                0,
                151
            ],
            [
                151,
                300
            ],
            [
                300,
                492
            ],
            [
                492,
                2267
            ],
            [
                2267,
                3180
            ],
            [
                3180,
                3248
            ],
            [
                3248,
                4518
            ],
            [
                4518,
                5089
            ],
            [
                5089,
                5289
            ],
            [
                5289,
                6062
            ],
            [
                6062,
                6745
            ],
            [
                6745,
                6883
            ],
            [
                6883,
                7259
            ],
            [
                7259,
                8124
            ],
            [
                8124,
                8412
            ],
            [
                8412,
                8440
            ],
            [
                8440,
                8495
            ],
            [
                8495,
                8510
            ],
            [
                8510,
                8517
            ],
            [
                8517,
                8548
            ],
            [
                8548,
                8647
            ],
            [
                8647,
                8863
            ],
            [
                8863,
                8969
            ],
            [
                8969,
                9545
            ],
            [
                9545,
                9657
            ],
            [
                9657,
                10648
            ],
            [
                10648,
                10873
            ],
            [
                10873,
                11583
            ],
            [
                11583,
                11706
            ],
            [
                11706,
                12059
            ],
            [
                12059,
                12412
            ],
            [
                12412,
                12801
            ],
            [
                12801,
                13314
            ],
            [
                13314,
                15455
            ],
            [
                15455,
                15813
            ],
            [
                15813,
                16116
            ],
            [
                16116,
                16352
            ],
            [
                16352,
                16727
            ],
            [
                16727,
                16904
            ],
            [
                16904,
                17179
            ],
            [
                17179,
                17676
            ]
        ],
        "segment_chars": [
            [
                0,
                151
            ],
            [
                151,
                291
            ],
            [
                291,
                300
            ],
            [
                300,
                492
            ],
            [
                492,
                794
            ],
            [
                794,
                1053
            ],
            [
                1053,
                1170
            ],
            [
                1170,
                1278
            ],
            [
                1278,
                1372
            ],
            [
                1372,
                1407
            ],
            [
                1407,
                1707
            ],
            [
                1707,
                1836
            ],
            [
                1836,
                1991
            ],
            [
                1991,
                2267
            ],
            [
                2267,
                2375
            ],
            [
                2375,
                2518
            ],
            [
                2518,
                2703
            ],
            [
                2703,
                2856
            ],
            [
                2856,
                2911
            ],
            [
                2911,
                3180
            ],
            [
                3180,
                3248
            ],
            [
                3248,
                3287
            ],
            [
                3287,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3472,
                3529
            ],
            [
                3529,
                3703
            ],
            [
                3703,
                3840
            ],
            [
                3840,
                3932
            ],
            [
                3932,
                4067
            ],
            [
                4067,
                4135
            ],
            [
                4135,
                4367
            ],
            [
                4367,
                4421
            ],
            [
                4421,
                4459
            ],
            [
                4459,
                4518
            ],
            [
                4518,
                4712
            ],
            [
                4712,
                4901
            ],
            [
                4901,
                4993
            ],
            [
                4993,
                5089
            ],
            [
                5089,
                5210
            ],
            [
                5210,
                5289
            ],
            [
                5289,
                5458
            ],
            [
                5458,
                5580
            ],
            [
                5580,
                5679
            ],
            [
                5679,
                5715
            ],
            [
                5715,
                5862
            ],
            [
                5862,
                6062
            ],
            [
                6062,
                6299
            ],
            [
                6299,
                6406
            ],
            [
                6406,
                6745
            ],
            [
                6745,
                6794
            ],
            [
                6794,
                6883
            ],
            [
                6883,
                7065
            ],
            [
                7065,
                7082
            ],
            [
                7082,
                7113
            ],
            [
                7113,
                7161
            ],
            [
                7161,
                7259
            ],
            [
                7259,
                7329
            ],
            [
                7329,
                7340
            ],
            [
                7340,
                7407
            ],
            [
                7407,
                7515
            ],
            [
                7515,
                7727
            ],
            [
                7727,
                7817
            ],
            [
                7817,
                7901
            ],
            [
                7901,
                7947
            ],
            [
                7947,
                8010
            ],
            [
                8010,
                8063
            ],
            [
                8063,
                8124
            ],
            [
                8124,
                8261
            ],
            [
                8261,
                8412
            ],
            [
                8412,
                8440
            ],
            [
                8440,
                8463
            ],
            [
                8463,
                8495
            ],
            [
                8495,
                8510
            ],
            [
                8510,
                8517
            ],
            [
                8517,
                8548
            ],
            [
                8548,
                8647
            ],
            [
                8647,
                8770
            ],
            [
                8770,
                8822
            ],
            [
                8822,
                8863
            ],
            [
                8863,
                8894
            ],
            [
                8894,
                8919
            ],
            [
                8919,
                8969
            ],
            [
                8969,
                9084
            ],
            [
                9084,
                9545
            ],
            [
                9545,
                9657
            ],
            [
                9657,
                9803
            ],
            [
                9803,
                9899
            ],
            [
                9899,
                9971
            ],
            [
                9971,
                10131
            ],
            [
                10131,
                10244
            ],
            [
                10244,
                10293
            ],
            [
                10293,
                10369
            ],
            [
                10369,
                10477
            ],
            [
                10477,
                10510
            ],
            [
                10510,
                10648
            ],
            [
                10648,
                10815
            ],
            [
                10815,
                10873
            ],
            [
                10873,
                11016
            ],
            [
                11016,
                11167
            ],
            [
                11167,
                11246
            ],
            [
                11246,
                11330
            ],
            [
                11330,
                11392
            ],
            [
                11392,
                11451
            ],
            [
                11451,
                11583
            ],
            [
                11583,
                11653
            ],
            [
                11653,
                11706
            ],
            [
                11706,
                11817
            ],
            [
                11817,
                11959
            ],
            [
                11959,
                12059
            ],
            [
                12059,
                12100
            ],
            [
                12100,
                12412
            ],
            [
                12412,
                12531
            ],
            [
                12531,
                12560
            ],
            [
                12560,
                12630
            ],
            [
                12630,
                12687
            ],
            [
                12687,
                12746
            ],
            [
                12746,
                12755
            ],
            [
                12755,
                12801
            ],
            [
                12801,
                13150
            ],
            [
                13150,
                13190
            ],
            [
                13190,
                13314
            ],
            [
                13314,
                13475
            ],
            [
                13475,
                13585
            ],
            [
                13585,
                13599
            ],
            [
                13599,
                13965
            ],
            [
                13965,
                14051
            ],
            [
                14051,
                14408
            ],
            [
                14408,
                14709
            ],
            [
                14709,
                14985
            ],
            [
                14985,
                15397
            ],
            [
                15397,
                15455
            ],
            [
                15455,
                15558
            ],
            [
                15558,
                15674
            ],
            [
                15674,
                15813
            ],
            [
                15813,
                15831
            ],
            [
                15831,
                15979
            ],
            [
                15979,
                16051
            ],
            [
                16051,
                16116
            ],
            [
                16116,
                16134
            ],
            [
                16134,
                16146
            ],
            [
                16146,
                16162
            ],
            [
                16162,
                16187
            ],
            [
                16187,
                16221
            ],
            [
                16221,
                16275
            ],
            [
                16275,
                16308
            ],
            [
                16308,
                16352
            ],
            [
                16352,
                16428
            ],
            [
                16428,
                16617
            ],
            [
                16617,
                16727
            ],
            [
                16727,
                16772
            ],
            [
                16772,
                16904
            ],
            [
                16904,
                16969
            ],
            [
                16969,
                17033
            ],
            [
                17033,
                17106
            ],
            [
                17106,
                17179
            ],
            [
                17179,
                17429
            ],
            [
                17429,
                17497
            ],
            [
                17497,
                17676
            ]
        ],
        "overlap_chars": [
            [
                300,
                350
            ],
            [
                389,
                392
            ],
            [
                490,
                492
            ],
            [
                492,
                520
            ],
            [
                522,
                567
            ],
            [
                709,
                766
            ],
            [
                775,
                794
            ],
            [
                1053,
                1170
            ],
            [
                1407,
                1445
            ],
            [
                1447,
                1468
            ],
            [
                1470,
                1473
            ],
            [
                1542,
                1580
            ],
            [
                1705,
                1707
            ],
            [
                1747,
                1749
            ],
            [
                1765,
                1768
            ],
            [
                1817,
                1834
            ],
            [
                1802,
                1813
            ],
            [
                1869,
                1891
            ],
            [
                1984,
                1986
            ],
            [
                1732,
                1735
            ],
            [
                1892,
                1914
            ],
            [
                1919,
                1923
            ],
            [
                1989,
                1991
            ],
            [
                1991,
                1994
            ],
            [
                2093,
                2095
            ],
            [
                2015,
                2067
            ],
            [
                2096,
                2100
            ],
            [
                2107,
                2115
            ],
            [
                2192,
                2267
            ],
            [
                2267,
                2277
            ],
            [
                2286,
                2334
            ],
            [
                2373,
                2375
            ],
            [
                2375,
                2406
            ],
            [
                2416,
                2453
            ],
            [
                2407,
                2410
            ],
            [
                2500,
                2512
            ],
            [
                2516,
                2518
            ],
            [
                2518,
                2538
            ],
            [
                2557,
                2592
            ],
            [
                2540,
                2544
            ],
            [
                2626,
                2642
            ],
            [
                2701,
                2703
            ],
            [
                2703,
                2749
            ],
            [
                2759,
                2812
            ],
            [
                2854,
                2856
            ],
            [
                2856,
                2877
            ],
            [
                3166,
                3169
            ],
            [
                2980,
                2985
            ],
            [
                2995,
                3002
            ],
            [
                3014,
                3049
            ],
            [
                3178,
                3180
            ],
            [
                3180,
                3248
            ],
            [
                3248,
                3287
            ],
            [
                3287,
                3367
            ],
            [
                3444,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3481,
                3529
            ],
            [
                3550,
                3592
            ],
            [
                3594,
                3659
            ],
            [
                3701,
                3703
            ],
            [
                3703,
                3742
            ],
            [
                3777,
                3817
            ],
            [
                3830,
                3838
            ],
            [
                3823,
                3826
            ],
            [
                3838,
                3840
            ],
            [
                3840,
                3869
            ],
            [
                3958,
                4032
            ],
            [
                4065,
                4067
            ],
            [
                4067,
                4126
            ],
            [
                4133,
                4135
            ],
            [
                4135,
                4249
            ],
            [
                4334,
                4343
            ],
            [
                4354,
                4367
            ],
            [
                4367,
                4375
            ],
            [
                4383,
                4386
            ],
            [
                4392,
                4421
            ],
            [
                4421,
                4459
            ],
            [
                4459,
                4518
            ],
            [
                4518,
                4643
            ],
            [
                4660,
                4670
            ],
            [
                4679,
                4712
            ],
            [
                4712,
                4764
            ],
            [
                4766,
                4775
            ],
            [
                4788,
                4796
            ],
            [
                4807,
                4837
            ],
            [
                4901,
                4907
            ],
            [
                4920,
                4929
            ],
            [
                4997,
                5005
            ],
            [
                5011,
                5089
            ],
            [
                5089,
                5208
            ],
            [
                5289,
                5350
            ],
            [
                5396,
                5413
            ],
            [
                5433,
                5448
            ],
            [
                5456,
                5458
            ],
            [
                5458,
                5495
            ],
            [
                5538,
                5542
            ],
            [
                5715,
                5728
            ],
            [
                5569,
                5572
            ],
            [
                5743,
                5774
            ],
            [
                5819,
                5833
            ],
            [
                5839,
                5851
            ],
            [
                5852,
                5862
            ],
            [
                5881,
                5891
            ],
            [
                5895,
                5985
            ],
            [
                5987,
                6039
            ],
            [
                6044,
                6062
            ],
            [
                6062,
                6129
            ],
            [
                6131,
                6156
            ],
            [
                6165,
                6173
            ],
            [
                6175,
                6189
            ],
            [
                6226,
                6228
            ],
            [
                6297,
                6299
            ],
            [
                6307,
                6311
            ],
            [
                6346,
                6361
            ],
            [
                6375,
                6378
            ],
            [
                6647,
                6649
            ],
            [
                6379,
                6383
            ],
            [
                6389,
                6404
            ],
            [
                6406,
                6554
            ],
            [
                6566,
                6584
            ],
            [
                6589,
                6593
            ],
            [
                6729,
                6738
            ],
            [
                6324,
                6325
            ],
            [
                6616,
                6617
            ],
            [
                6739,
                6745
            ],
            [
                6745,
                6794
            ],
            [
                6795,
                6798
            ],
            [
                6800,
                6823
            ],
            [
                6824,
                6828
            ],
            [
                6881,
                6883
            ],
            [
                6883,
                6962
            ],
            [
                7065,
                7082
            ],
            [
                7113,
                7161
            ],
            [
                7161,
                7259
            ],
            [
                7259,
                7329
            ],
            [
                7329,
                7340
            ],
            [
                7340,
                7407
            ],
            [
                7407,
                7464
            ],
            [
                7513,
                7515
            ],
            [
                7515,
                7559
            ],
            [
                7647,
                7727
            ],
            [
                7727,
                7817
            ],
            [
                7817,
                7854
            ],
            [
                7899,
                7901
            ],
            [
                7901,
                7947
            ],
            [
                8063,
                8124
            ],
            [
                8124,
                8129
            ],
            [
                8168,
                8193
            ],
            [
                8196,
                8239
            ],
            [
                8247,
                8261
            ],
            [
                8265,
                8288
            ],
            [
                8391,
                8395
            ],
            [
                8410,
                8412
            ],
            [
                8412,
                8440
            ],
            [
                8440,
                8461
            ],
            [
                8495,
                8510
            ],
            [
                8510,
                8517
            ],
            [
                8517,
                8548
            ],
            [
                8548,
                8602
            ],
            [
                8633,
                8647
            ],
            [
                8647,
                8677
            ],
            [
                8718,
                8770
            ],
            [
                8770,
                8790
            ],
            [
                8808,
                8822
            ],
            [
                8840,
                8863
            ],
            [
                8863,
                8894
            ],
            [
                8894,
                8919
            ],
            [
                8919,
                8969
            ],
            [
                9088,
                9184
            ],
            [
                9402,
                9423
            ],
            [
                9434,
                9467
            ],
            [
                9469,
                9499
            ],
            [
                9501,
                9545
            ],
            [
                9545,
                9560
            ],
            [
                9562,
                9570
            ],
            [
                9571,
                9587
            ],
            [
                9615,
                9657
            ],
            [
                9657,
                9668
            ],
            [
                9670,
                9736
            ],
            [
                9762,
                9765
            ],
            [
                9741,
                9750
            ],
            [
                9801,
                9803
            ],
            [
                9803,
                9847
            ],
            [
                9857,
                9899
            ],
            [
                9899,
                9946
            ],
            [
                9969,
                9971
            ],
            [
                9971,
                9975
            ],
            [
                9984,
                9993
            ],
            [
                9995,
                10037
            ],
            [
                10065,
                10104
            ],
            [
                10114,
                10131
            ],
            [
                10131,
                10171
            ],
            [
                10193,
                10227
            ],
            [
                10234,
                10244
            ],
            [
                10244,
                10293
            ],
            [
                10369,
                10405
            ],
            [
                10407,
                10434
            ],
            [
                10436,
                10477
            ],
            [
                10477,
                10498
            ],
            [
                10505,
                10510
            ],
            [
                10510,
                10570
            ],
            [
                10573,
                10621
            ],
            [
                10623,
                10648
            ],
            [
                10648,
                10674
            ],
            [
                10709,
                10724
            ],
            [
                10748,
                10787
            ],
            [
                10802,
                10815
            ],
            [
                10815,
                10825
            ],
            [
                10840,
                10858
            ],
            [
                10871,
                10873
            ],
            [
                10873,
                10880
            ],
            [
                10882,
                10890
            ],
            [
                10891,
                11016
            ],
            [
                11016,
                11033
            ],
            [
                11041,
                11070
            ],
            [
                11167,
                11178
            ],
            [
                11189,
                11193
            ],
            [
                11112,
                11117
            ],
            [
                11244,
                11246
            ],
            [
                11330,
                11392
            ],
            [
                11392,
                11451
            ],
            [
                11451,
                11480
            ],
            [
                11531,
                11570
            ],
            [
                11580,
                11583
            ],
            [
                11583,
                11588
            ],
            [
                11657,
                11665
            ],
            [
                11706,
                11817
            ],
            [
                11817,
                11819
            ],
            [
                11821,
                11823
            ],
            [
                11825,
                11906
            ],
            [
                11937,
                11951
            ],
            [
                11920,
                11931
            ],
            [
                11956,
                11959
            ],
            [
                11959,
                11987
            ],
            [
                11992,
                11995
            ],
            [
                11988,
                11991
            ],
            [
                12005,
                12059
            ],
            [
                12059,
                12074
            ],
            [
                12081,
                12100
            ],
            [
                12100,
                12158
            ],
            [
                12160,
                12197
            ],
            [
                12216,
                12268
            ],
            [
                12290,
                12312
            ],
            [
                12314,
                12329
            ],
            [
                12355,
                12412
            ],
            [
                12412,
                12413
            ],
            [
                12429,
                12464
            ],
            [
                12465,
                12531
            ],
            [
                12560,
                12630
            ],
            [
                12630,
                12658
            ],
            [
                12660,
                12687
            ],
            [
                12687,
                12705
            ],
            [
                12710,
                12725
            ],
            [
                12744,
                12746
            ],
            [
                12746,
                12755
            ],
            [
                12763,
                12801
            ],
            [
                12801,
                12802
            ],
            [
                12811,
                12849
            ],
            [
                12862,
                12876
            ],
            [
                12883,
                12987
            ],
            [
                12994,
                12999
            ],
            [
                13055,
                13065
            ],
            [
                13041,
                13043
            ],
            [
                13087,
                13150
            ],
            [
                13190,
                13290
            ],
            [
                13292,
                13314
            ],
            [
                13314,
                13319
            ],
            [
                13360,
                13442
            ],
            [
                13458,
                13475
            ],
            [
                13475,
                13494
            ],
            [
                13502,
                13503
            ],
            [
                13512,
                13523
            ],
            [
                13533,
                13566
            ],
            [
                13570,
                13571
            ],
            [
                13578,
                13585
            ],
            [
                13585,
                13598
            ],
            [
                13599,
                13658
            ],
            [
                13676,
                13752
            ],
            [
                13761,
                13965
            ],
            [
                13972,
                13977
            ],
            [
                13987,
                14051
            ],
            [
                14051,
                14173
            ],
            [
                14261,
                14298
            ],
            [
                14212,
                14213
            ],
            [
                14307,
                14383
            ],
            [
                14406,
                14407
            ],
            [
                14408,
                14420
            ],
            [
                14430,
                14466
            ],
            [
                14487,
                14491
            ],
            [
                14540,
                14541
            ],
            [
                14552,
                14556
            ],
            [
                14582,
                14583
            ],
            [
                14638,
                14641
            ],
            [
                14475,
                14477
            ],
            [
                14542,
                14547
            ],
            [
                14698,
                14700
            ],
            [
                14590,
                14592
            ],
            [
                14707,
                14709
            ],
            [
                14709,
                14787
            ],
            [
                14792,
                14809
            ],
            [
                14814,
                14830
            ],
            [
                14832,
                14896
            ],
            [
                14907,
                14920
            ],
            [
                14937,
                14947
            ],
            [
                14955,
                14984
            ],
            [
                14985,
                15017
            ],
            [
                15032,
                15033
            ],
            [
                15090,
                15102
            ],
            [
                15113,
                15126
            ],
            [
                15151,
                15167
            ],
            [
                15336,
                15338
            ],
            [
                15178,
                15324
            ],
            [
                15333,
                15336
            ],
            [
                15358,
                15396
            ],
            [
                15455,
                15470
            ],
            [
                15521,
                15532
            ],
            [
                15548,
                15558
            ],
            [
                15558,
                15587
            ],
            [
                15600,
                15623
            ],
            [
                15636,
                15653
            ],
            [
                15662,
                15672
            ],
            [
                15634,
                15635
            ],
            [
                15596,
                15599
            ],
            [
                15734,
                15743
            ],
            [
                15755,
                15813
            ],
            [
                15813,
                15829
            ],
            [
                15904,
                15905
            ],
            [
                15835,
                15840
            ],
            [
                15977,
                15979
            ],
            [
                15979,
                15982
            ],
            [
                16051,
                16075
            ],
            [
                16080,
                16085
            ],
            [
                16101,
                16114
            ],
            [
                16116,
                16134
            ],
            [
                16134,
                16146
            ],
            [
                16146,
                16162
            ],
            [
                16162,
                16187
            ],
            [
                16221,
                16249
            ],
            [
                16255,
                16263
            ],
            [
                16273,
                16275
            ],
            [
                16275,
                16298
            ],
            [
                16306,
                16308
            ],
            [
                16308,
                16352
            ],
            [
                16352,
                16365
            ],
            [
                16395,
                16398
            ],
            [
                16566,
                16569
            ],
            [
                16403,
                16409
            ],
            [
                16428,
                16552
            ],
            [
                16578,
                16617
            ],
            [
                16630,
                16649
            ],
            [
                16617,
                16620
            ],
            [
                16671,
                16679
            ],
            [
                16713,
                16727
            ],
            [
                16727,
                16744
            ],
            [
                16754,
                16772
            ],
            [
                16772,
                16867
            ],
            [
                16880,
                16904
            ],
            [
                16904,
                16969
            ],
            [
                16969,
                17033
            ],
            [
                17033,
                17106
            ],
            [
                17106,
                17179
            ],
            [
                17179,
                17256
            ],
            [
                17427,
                17429
            ],
            [
                17555,
                17557
            ],
            [
                17527,
                17529
            ],
            [
                17566,
                17575
            ],
            [
                17588,
                17676
            ]
        ],
        "row_chars": [
            [
                0,
                151
            ],
            [
                151,
                291
            ],
            [
                291,
                300
            ],
            [
                300,
                492
            ],
            [
                492,
                794
            ],
            [
                794,
                1053
            ],
            [
                1053,
                1170
            ],
            [
                1170,
                1278
            ],
            [
                1278,
                1372
            ],
            [
                1372,
                1407
            ],
            [
                1407,
                1707
            ],
            [
                1707,
                1991
            ],
            [
                1991,
                2267
            ],
            [
                2267,
                2375
            ],
            [
                2375,
                2518
            ],
            [
                2518,
                2703
            ],
            [
                2703,
                2856
            ],
            [
                2856,
                3180
            ],
            [
                3180,
                3248
            ],
            [
                3248,
                3287
            ],
            [
                3287,
                3446
            ],
            [
                3446,
                3472
            ],
            [
                3472,
                3529
            ],
            [
                3529,
                3703
            ],
            [
                3703,
                3840
            ],
            [
                3840,
                4067
            ],
            [
                4067,
                4135
            ],
            [
                4135,
                4367
            ],
            [
                4367,
                4421
            ],
            [
                4421,
                4459
            ],
            [
                4459,
                4518
            ],
            [
                4518,
                4712
            ],
            [
                4712,
                4901
            ],
            [
                4901,
                5089
            ],
            [
                5089,
                5210
            ],
            [
                5210,
                5289
            ],
            [
                5289,
                5458
            ],
            [
                5458,
                5862
            ],
            [
                5862,
                6062
            ],
            [
                6062,
                6299
            ],
            [
                6299,
                6745
            ],
            [
                6745,
                6794
            ],
            [
                6794,
                6883
            ],
            [
                6883,
                7082
            ],
            [
                7082,
                7113
            ],
            [
                7113,
                7161
            ],
            [
                7161,
                7259
            ],
            [
                7259,
                7329
            ],
            [
                7329,
                7340
            ],
            [
                7340,
                7407
            ],
            [
                7407,
                7515
            ],
            [
                7515,
                7727
            ],
            [
                7727,
                7817
            ],
            [
                7817,
                7901
            ],
            [
                7901,
                7947
            ],
            [
                7947,
                8010
            ],
            [
                8010,
                8063
            ],
            [
                8063,
                8124
            ],
            [
                8124,
                8261
            ],
            [
                8261,
                8412
            ],
            [
                8412,
                8440
            ],
            [
                8440,
                8463
            ],
            [
                8463,
                8495
            ],
            [
                8495,
                8510
            ],
            [
                8510,
                8517
            ],
            [
                8517,
                8548
            ],
            [
                8548,
                8647
            ],
            [
                8647,
                8770
            ],
            [
                8770,
                8822
            ],
            [
                8822,
                8863
            ],
            [
                8863,
                8894
            ],
            [
                8894,
                8919
            ],
            [
                8919,
                8969
            ],
            [
                8969,
                9084
            ],
            [
                9084,
                9545
            ],
            [
                9545,
                9657
            ],
            [
                9657,
                9803
            ],
            [
                9803,
                9899
            ],
            [
                9899,
                9971
            ],
            [
                9971,
                10131
            ],
            [
                10131,
                10244
            ],
            [
                10244,
                10293
            ],
            [
                10293,
                10369
            ],
            [
                10369,
                10477
            ],
            [
                10477,
                10510
            ],
            [
                10510,
                10648
            ],
            [
                10648,
                10815
            ],
            [
                10815,
                10873
            ],
            [
                10873,
                11016
            ],
            [
                11016,
                11246
            ],
            [
                11246,
                11330
            ],
            [
                11330,
                11392
            ],
            [
                11392,
                11451
            ],
            [
                11451,
                11583
            ],
            [
                11583,
                11706
            ],
            [
                11706,
                11817
            ],
            [
                11817,
                11959
            ],
            [
                11959,
                12059
            ],
            [
                12059,
                12100
            ],
            [
                12100,
                12412
            ],
            [
                12412,
                12531
            ],
            [
                12531,
                12560
            ],
            [
                12560,
                12630
            ],
            [
                12630,
                12687
            ],
            [
                12687,
                12746
            ],
            [
                12746,
                12755
            ],
            [
                12755,
                12801
            ],
            [
                12801,
                13150
            ],
            [
                13150,
                13190
            ],
            [
                13190,
                13314
            ],
            [
                13314,
                13475
            ],
            [
                13475,
                13585
            ],
            [
                13585,
                13599
            ],
            [
                13599,
                13965
            ],
            [
                13965,
                14051
            ],
            [
                14051,
                14408
            ],
            [
                14408,
                14709
            ],
            [
                14709,
                14985
            ],
            [
                14985,
                15397
            ],
            [
                15397,
                15455
            ],
            [
                15455,
                15558
            ],
            [
                15558,
                15813
            ],
            [
                15813,
                15979
            ],
            [
                15979,
                16116
            ],
            [
                16116,
                16134
            ],
            [
                16134,
                16146
            ],
            [
                16146,
                16162
            ],
            [
                16162,
                16187
            ],
            [
                16187,
                16221
            ],
            [
                16221,
                16275
            ],
            [
                16275,
                16308
            ],
            [
                16308,
                16352
            ],
            [
                16352,
                16617
            ],
            [
                16617,
                16727
            ],
            [
                16727,
                16772
            ],
            [
                16772,
                16904
            ],
            [
                16904,
                16969
            ],
            [
                16969,
                17033
            ],
            [
                17033,
                17106
            ],
            [
                17106,
                17179
            ],
            [
                17179,
                17429
            ],
            [
                17429,
                17497
            ],
            [
                17497,
                17676
            ]
        ]
    },
    "abridged": {
        "text": "Something which Mirah had lately been watching for now came about.\nTurning out of Knightsbridge after singing at a charitable morning concert, she began to feel herself dogged by footsteps that kept pace with her own. She immediately thought of her father, and could no more look round than if she had felt herself tracked by a ghost. She walked on, not quickening her pace - of what use was that? - but certain that the man behind her was her father. Hoping to prevent any unnecessary shock for her brother, she resolved to turn to meet her father before she reached her door. She came to the entrance of the small square where her home lay, but before she could turn she felt him grasping her wrist, and saying, with a persuasive curl of accent, \"Mirah!\"\nShe paused without any start; it was the voice she expected. Her face was as grave as if she were looking at her executioner, while his had a propitiating expression. Once a handsome face, it was now sallow and deep-lined, with an impudent suavity. He was lightly made and active, with something youthful about him which made the signs of age seem a disguise. His dress was shabby, and Mirah felt mingled shame and grief, repulsion and pity.\nSlowly, with a sad, tremulous voice, she said, \"It is you, father.\"\n\"Why did you run away from me, child?\" he began with rapid speech which was meant to have a tone of tender remonstrance. \"What were you afraid of? I never made you do anything against your will. I broke up your engagement in the Vorstadt because I saw it didn't suit you, and you repaid me by leaving me. I had made an easier engagement for you: I didn't tell you, because I wanted to surprise you. And you left me planted there, after I had given up everything for the sake of getting you an education. What father devoted himself to his daughter more than I did? You know how I bore that disappointment in your voice, and made the best of it: and when I had nobody besides you, you chose to leave me. Who else did you owe everything to, if not to me? and where was your feeling in return? For what my daughter cared, I might have died in a ditch.\"\nLapidoth stopped short here, not from lack of invention, but because he had reached a pathetic climax, and gave a sudden sob, taking out an old yellow silk handkerchief. He really felt that his daughter had treated him ill - a sort of feeling which is strong in unscrupulous persons. Mirah, despite that sob, answered firmly, though it was the first time she had ever used accusing words to him.\n\"You know why I left you, father; and I had reason to distrust you, because I felt sure that you had deceived my mother.\"\n\"I never meant to deceive your mother, Mirah,\" said Lapidoth, with a voice that struggled against further sobs. \"I meant to take you back to her, but then I had word of her death from a particular friend, and I sent him money to pay necessary expenses. To be sure-\" Lapidoth had quickly conceived that he must guard against something unlikely, yet possible - \"he may have written me lies for the sake of getting money out of me.\"\nMirah made no answer; she could not bear to utter the only true one - \"I don't believe one word you say\" - and she simply walked on. They might well have caused passers-by to turn to look at them: the figure of Mirah, with her beauty set off by the quiet, careful dress of an English lady, made a strange pendant to this shabby, foreign-looking, eagerly gesticulating man, with his light, jaunty walk.\n\"You seem to have done well for yourself, Mirah? You are in no want, I see,\" he said.\n\"Good friends who found me in distress have helped me to get work,\" said Mirah, \"I give lessons. I have just been singing at a private concert.\" She paused, and then added, with significance, \"I have very good friends, who know all about me.\"\n\"And you would be ashamed they should see your father in this plight? No wonder. I came to England with no prospect, but the chance of finding you. It was a mad quest; but a father's heart is superstitious. I might have done very well, staying abroad: but it's hard being lonely in the world, when your spirit's beginning to break. And I thought my little Mirah would repent leaving her father when she came to look back. I've had a sharp pinch to work my way. Talents like mine are no use in this country. I've been obliged to get pretty low for a shilling already.\"\nMirah anxiously imagined her father's sinking into further degradation, which she was bound to prevent if she could. Before she could answer, he said,\n\"Where do you live, Mirah?\"\n\"Here, in this square.\"\n\"In lodgings?\"\n\"Yes.\"\n\"Anyone to take care of you?\"\n\"Yes,\" said Mirah again, looking full at the keen face - \"my brother.\"\nThe father's eyelids fluttered, and there was a slight movement of the shoulders. But he said, after a brief pause: \"Ezra? How did you find him?\"\n\"That would take long to tell. Here we are at the door. My brother would not wish me to close it on you.\"\nMirah's heart had begun to beat faster with the prospect of what was coming in the presence of Ezra; and she had a pang of the sympathetic humiliation and shame - the stabbed heart of reverence - which belongs to a nature intensely filial.\n\"Stay a minute, Liebchen,\" said Lapidoth; \"what sort of man has Ezra turned out?\"\n\"A good man - a wonderful man,\" said Mirah, with slow emphasis, trying to master her agitation. She felt urged to prepare her father for the penetration of himself which awaited him. \"But he was very poor when my friends found him. Once - twelve years ago - he was strong and happy, going to the East; and my mother called him back because she had lost me. And he went to her, and took care of her, and worked for her till she died in grief. And Ezra, too, had lost his health and strength. For years he has been getting weaker - always poor, always working - but full of knowledge, and great-minded. All who come near him honour him. To stand before him is like standing before a prophet of God\"- Mirah ended with difficulty, her heart throbbing- \"falsehoods are no use.\"\nShe had cast down her eyes while she spoke, unable to bear the ignoble look of frustration in his face. But he was quick in invention.\n\"Mirah, Liebchen,\" he said, in the old caressing way, \"shouldn't you like me to make myself a little more respectable before my son sees me? If I had a little money, I could fit myself out decently with a good coat, and find work. I should like to be with my children, and forget and forgive. But you have never seen your father look like this before. If you had ten pounds at hand, I could fit myself out by the day after tomorrow.\"\nMirah answered-\n\"I don't like to deny you what you ask, father; but I have given a promise not to do things for you in secret. It is hard to see you looking needy; but we will bear that for a little while; and then we can pay for new clothes.\" Her practical sense made her now see Mrs. Meyrick's wisdom in exacting a promise from her.\nLapidoth's good humour gave way a little. He said, with a sneer, \"You are a hard and fast young lady - you have been learning useful virtues - promising not to help your father with a pound or two when you dress yourself in silk - your father who gave up the best part of his life to providing for you.\"\n\"I know it seems cruel,\" said Mirah, pale, and feeling this a worse moment than when she meant to drown herself. \"But, father, it is more cruel to break the promises people trust in. That broke my mother's heart - it has broken Ezra's life. You and I must eat this bitterness. Bear it. Come in and be cared for as you are.\"\n\"Tomorrow, then,\" said Lapidoth, almost turning away from this trembling daughter, who seemed now to have got the inconvenient world to back her; but he quickly turned again, and said in his appealing tone, \"I'm a little cut up with all this, Mirah. If you've a little money in your pocket, I suppose it isn't against your promise to give me a trifle - to buy a cigar with.\"\nMirah could not do anything else than put her cold trembling hands in her pocket for her purse and hold it out. Lapidoth grasped it, pressing her fingers, said, \"Good-bye, my little girl - tomorrow then!\" and left her.\nHe had not taken many steps before he looked carefully into the purse, found two half-sovereigns and odd silver, and, pasted against the cover, a bit of paper on which Ezra had inscribed, in a beautiful Hebrew character, the name of his mother, the days of her birth, marriage, and death, and the prayer, \"May Mirah be delivered from evil.\" Mirah liked to have this little inscription on many articles that she used. The father read it, and had a quick vision of his marriage day, and the bright, unblamed young fellow he was at that time; very fond of his beautiful bride Sara - crying when she expected him to cry, and reflecting every phase of her feeling with perfect mimicry.\nLapidoth had travelled a long way from that young self, and remembered this without emotion, like a morsel of food which had no taste to him. Among the things we may gamble away in a lazy selfish life is the capacity for pity, compunction, or unselfish regret - which we may come to long for as one in slow death longs to feel pain, rather than a widening space where consciousness once was.\nMirah's purse was a handsome one, and Lapidoth found himself considering what it would fetch in addition to the sum it contained, and what prospect there was of his being able to get more from his daughter without submitting to penance under the eyes of that formidable son.\nMeanwhile Mirah was overcome by her pain. She found her brother quietly sifting old manuscripts which he meant to give to Deronda, and fell down and clasped his knees, sobbing, and crying, \"Ezra, Ezra!\"\nHe did not speak, though he was stricken with alarm. But presently she raised her head, and said brokenly-\n\"Ezra, my father! our father! He followed me. I wanted him to come in. And he said No, he would not now, but tomorrow. And he begged for money. And I gave him my purse, and he went away.\"\nAlthough Mirah's words expressed all her misery, her brother found them less grievous than his preconceptions, and said gently, \"Wait for calm, Mirah, and then tell me all,\" laying his hands tenderly on her head. Under this soothing influence, she told him what had happened.\n\"He will not come tomorrow,\" said Mordecai. Neither of them said to the other what they both thought, namely, that he might watch for Mirah and beg from her again.\n\"Seest thou,\" he presently added, \"our lot is the lot of Israel. The grief and the glory are mingled as the smoke and the flame. It is because we children have inherited the good that we feel the evil. These things are wedded for us, as our father was wedded to our mother.\"\nThe surroundings were of Brompton, but the voice might have come from a Rabbi. It is said, \"God is occupied in making marriages\": whereby are meant all the wondrous combinations of the universe whose issue makes our good and evil.",
        "paragraph_chars": [
            [
                0,
                67
            ],
            [
                67,
                757
            ],
            [
                757,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                2117
            ],
            [
                2117,
                2513
            ],
            [
                2513,
                2635
            ],
            [
                2635,
                3065
            ],
            [
                3065,
                3467
            ],
            [
                3467,
                3553
            ],
            [
                3553,
                3796
            ],
            [
                3796,
                4364
            ],
            [
                4364,
                4515
            ],
            [
                4515,
                4543
            ],
            [
                4543,
                4567
            ],
            [
                4567,
                4582
            ],
            [
                4582,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4690
            ],
            [
                4690,
                4836
            ],
            [
                4836,
                4942
            ],
            [
                4942,
                5182
            ],
            [
                5182,
                5264
            ],
            [
                5264,
                6037
            ],
            [
                6037,
                6172
            ],
            [
                6172,
                6606
            ],
            [
                6606,
                6622
            ],
            [
                6622,
                6941
            ],
            [
                6941,
                7245
            ],
            [
                7245,
                7569
            ],
            [
                7569,
                7944
            ],
            [
                7944,
                8163
            ],
            [
                8163,
                8844
            ],
            [
                8844,
                9236
            ],
            [
                9236,
                9511
            ],
            [
                9511,
                9714
            ],
            [
                9714,
                9821
            ],
            [
                9821,
                10009
            ],
            [
                10009,
                10285
            ],
            [
                10285,
                10449
            ],
            [
                10449,
                10724
            ],
            [
                10724,
                10954
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                218
            ],
            [
                218,
                335
            ],
            [
                335,
                398
            ],
            [
                398,
                452
            ],
            [
                452,
                578
            ],
            [
                578,
                757
            ],
            [
                757,
                818
            ],
            [
                818,
                924
            ],
            [
                924,
                1006
            ],
            [
                1006,
                1117
            ],
            [
                1117,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1306
            ],
            [
                1306,
                1388
            ],
            [
                1388,
                1414
            ],
            [
                1414,
                1462
            ],
            [
                1462,
                1572
            ],
            [
                1572,
                1666
            ],
            [
                1666,
                1771
            ],
            [
                1771,
                1832
            ],
            [
                1832,
                1970
            ],
            [
                1970,
                2020
            ],
            [
                2020,
                2058
            ],
            [
                2058,
                2117
            ],
            [
                2117,
                2287
            ],
            [
                2287,
                2401
            ],
            [
                2401,
                2513
            ],
            [
                2513,
                2635
            ],
            [
                2635,
                2747
            ],
            [
                2747,
                2888
            ],
            [
                2888,
                3065
            ],
            [
                3065,
                3198
            ],
            [
                3198,
                3467
            ],
            [
                3467,
                3516
            ],
            [
                3516,
                3553
            ],
            [
                3553,
                3650
            ],
            [
                3650,
                3698
            ],
            [
                3698,
                3796
            ],
            [
                3796,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3944
            ],
            [
                3944,
                4003
            ],
            [
                4003,
                4128
            ],
            [
                4128,
                4218
            ],
            [
                4218,
                4257
            ],
            [
                4257,
                4303
            ],
            [
                4303,
                4364
            ],
            [
                4364,
                4481
            ],
            [
                4481,
                4515
            ],
            [
                4515,
                4543
            ],
            [
                4543,
                4567
            ],
            [
                4567,
                4582
            ],
            [
                4582,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4690
            ],
            [
                4690,
                4772
            ],
            [
                4772,
                4813
            ],
            [
                4813,
                4836
            ],
            [
                4836,
                4867
            ],
            [
                4867,
                4892
            ],
            [
                4892,
                4942
            ],
            [
                4942,
                5182
            ],
            [
                5182,
                5264
            ],
            [
                5264,
                5360
            ],
            [
                5360,
                5447
            ],
            [
                5447,
                5496
            ],
            [
                5496,
                5621
            ],
            [
                5621,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5865
            ],
            [
                5865,
                5899
            ],
            [
                5899,
                6037
            ],
            [
                6037,
                6141
            ],
            [
                6141,
                6172
            ],
            [
                6172,
                6313
            ],
            [
                6313,
                6403
            ],
            [
                6403,
                6465
            ],
            [
                6465,
                6524
            ],
            [
                6524,
                6606
            ],
            [
                6606,
                6622
            ],
            [
                6622,
                6733
            ],
            [
                6733,
                6850
            ],
            [
                6850,
                6941
            ],
            [
                6941,
                6983
            ],
            [
                6983,
                7245
            ],
            [
                7245,
                7358
            ],
            [
                7358,
                7428
            ],
            [
                7428,
                7486
            ],
            [
                7486,
                7522
            ],
            [
                7522,
                7531
            ],
            [
                7531,
                7569
            ],
            [
                7569,
                7819
            ],
            [
                7819,
                7944
            ],
            [
                7944,
                8056
            ],
            [
                8056,
                8149
            ],
            [
                8149,
                8163
            ],
            [
                8163,
                8504
            ],
            [
                8504,
                8580
            ],
            [
                8580,
                8844
            ],
            [
                8844,
                8986
            ],
            [
                8986,
                9236
            ],
            [
                9236,
                9511
            ],
            [
                9511,
                9553
            ],
            [
                9553,
                9714
            ],
            [
                9714,
                9767
            ],
            [
                9767,
                9821
            ],
            [
                9821,
                9839
            ],
            [
                9839,
                9851
            ],
            [
                9851,
                9867
            ],
            [
                9867,
                9892
            ],
            [
                9892,
                9940
            ],
            [
                9940,
                9965
            ],
            [
                9965,
                10009
            ],
            [
                10009,
                10222
            ],
            [
                10222,
                10285
            ],
            [
                10285,
                10329
            ],
            [
                10329,
                10449
            ],
            [
                10449,
                10514
            ],
            [
                10514,
                10578
            ],
            [
                10578,
                10651
            ],
            [
                10651,
                10724
            ],
            [
                10724,
                10803
            ],
            [
                10803,
                10954
            ]
        ],
        "overlap_chars": [
            [
                0,
                50
            ],
            [
                51,
                54
            ],
            [
                65,
                67
            ],
            [
                67,
                95
            ],
            [
                96,
                141
            ],
            [
                141,
                198
            ],
            [
                199,
                218
            ],
            [
                218,
                335
            ],
            [
                335,
                373
            ],
            [
                376,
                397
            ],
            [
                400,
                403
            ],
            [
                412,
                450
            ],
            [
                450,
                452
            ],
            [
                459,
                461
            ],
            [
                470,
                473
            ],
            [
                474,
                491
            ],
            [
                496,
                507
            ],
            [
                507,
                529
            ],
            [
                530,
                532
            ],
            [
                538,
                541
            ],
            [
                549,
                571
            ],
            [
                572,
                576
            ],
            [
                576,
                578
            ],
            [
                578,
                581
            ],
            [
                587,
                589
            ],
            [
                590,
                642
            ],
            [
                664,
                668
            ],
            [
                669,
                677
            ],
            [
                682,
                757
            ],
            [
                757,
                767
            ],
            [
                768,
                816
            ],
            [
                816,
                818
            ],
            [
                818,
                849
            ],
            [
                855,
                892
            ],
            [
                893,
                896
            ],
            [
                899,
                911
            ],
            [
                922,
                924
            ],
            [
                924,
                944
            ],
            [
                944,
                979
            ],
            [
                980,
                984
            ],
            [
                988,
                1004
            ],
            [
                1004,
                1006
            ],
            [
                1006,
                1052
            ],
            [
                1062,
                1115
            ],
            [
                1115,
                1117
            ],
            [
                1117,
                1138
            ],
            [
                1139,
                1142
            ],
            [
                1143,
                1148
            ],
            [
                1154,
                1161
            ],
            [
                1162,
                1197
            ],
            [
                1197,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1306
            ],
            [
                1306,
                1386
            ],
            [
                1386,
                1388
            ],
            [
                1388,
                1414
            ],
            [
                1414,
                1462
            ],
            [
                1462,
                1504
            ],
            [
                1505,
                1570
            ],
            [
                1570,
                1572
            ],
            [
                1572,
                1611
            ],
            [
                1611,
                1651
            ],
            [
                1652,
                1660
            ],
            [
                1661,
                1664
            ],
            [
                1664,
                1666
            ],
            [
                1666,
                1695
            ],
            [
                1695,
                1769
            ],
            [
                1769,
                1771
            ],
            [
                1771,
                1830
            ],
            [
                1830,
                1832
            ],
            [
                1832,
                1946
            ],
            [
                1947,
                1956
            ],
            [
                1957,
                1970
            ],
            [
                1970,
                1978
            ],
            [
                1983,
                1986
            ],
            [
                1991,
                2020
            ],
            [
                2020,
                2058
            ],
            [
                2058,
                2117
            ],
            [
                2117,
                2242
            ],
            [
                2243,
                2253
            ],
            [
                2254,
                2287
            ],
            [
                2287,
                2339
            ],
            [
                2342,
                2351
            ],
            [
                2360,
                2368
            ],
            [
                2369,
                2399
            ],
            [
                2401,
                2407
            ],
            [
                2416,
                2425
            ],
            [
                2426,
                2434
            ],
            [
                2435,
                2513
            ],
            [
                2513,
                2632
            ],
            [
                2635,
                2696
            ],
            [
                2697,
                2714
            ],
            [
                2725,
                2740
            ],
            [
                2745,
                2747
            ],
            [
                2747,
                2784
            ],
            [
                2785,
                2789
            ],
            [
                2790,
                2803
            ],
            [
                2804,
                2807
            ],
            [
                2808,
                2839
            ],
            [
                2840,
                2854
            ],
            [
                2855,
                2867
            ],
            [
                2878,
                2888
            ],
            [
                2888,
                2898
            ],
            [
                2901,
                2991
            ],
            [
                2994,
                3046
            ],
            [
                3047,
                3065
            ],
            [
                3065,
                3132
            ],
            [
                3135,
                3160
            ],
            [
                3161,
                3169
            ],
            [
                3172,
                3186
            ],
            [
                3194,
                3196
            ],
            [
                3196,
                3198
            ],
            [
                3198,
                3202
            ],
            [
                3203,
                3218
            ],
            [
                3233,
                3236
            ],
            [
                3237,
                3239
            ],
            [
                3240,
                3244
            ],
            [
                3245,
                3260
            ],
            [
                3262,
                3410
            ],
            [
                3419,
                3437
            ],
            [
                3438,
                3442
            ],
            [
                3443,
                3452
            ],
            [
                3452,
                3453
            ],
            [
                3454,
                3455
            ],
            [
                3461,
                3467
            ],
            [
                3467,
                3516
            ],
            [
                3516,
                3519
            ],
            [
                3520,
                3543
            ],
            [
                3547,
                3551
            ],
            [
                3551,
                3553
            ],
            [
                3553,
                3632
            ],
            [
                3633,
                3650
            ],
            [
                3650,
                3698
            ],
            [
                3698,
                3796
            ],
            [
                3796,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3944
            ],
            [
                3944,
                4001
            ],
            [
                4001,
                4003
            ],
            [
                4003,
                4047
            ],
            [
                4048,
                4128
            ],
            [
                4128,
                4218
            ],
            [
                4218,
                4255
            ],
            [
                4255,
                4257
            ],
            [
                4257,
                4303
            ],
            [
                4303,
                4364
            ],
            [
                4364,
                4369
            ],
            [
                4389,
                4414
            ],
            [
                4415,
                4458
            ],
            [
                4467,
                4481
            ],
            [
                4481,
                4504
            ],
            [
                4504,
                4508
            ],
            [
                4513,
                4515
            ],
            [
                4515,
                4543
            ],
            [
                4543,
                4564
            ],
            [
                4567,
                4582
            ],
            [
                4582,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4673
            ],
            [
                4676,
                4690
            ],
            [
                4690,
                4720
            ],
            [
                4720,
                4772
            ],
            [
                4772,
                4792
            ],
            [
                4799,
                4813
            ],
            [
                4813,
                4836
            ],
            [
                4836,
                4867
            ],
            [
                4867,
                4892
            ],
            [
                4892,
                4942
            ],
            [
                4950,
                5046
            ],
            [
                5047,
                5068
            ],
            [
                5069,
                5102
            ],
            [
                5105,
                5135
            ],
            [
                5138,
                5182
            ],
            [
                5182,
                5197
            ],
            [
                5198,
                5206
            ],
            [
                5206,
                5222
            ],
            [
                5222,
                5264
            ],
            [
                5264,
                5275
            ],
            [
                5278,
                5344
            ],
            [
                5345,
                5348
            ],
            [
                5349,
                5358
            ],
            [
                5358,
                5360
            ],
            [
                5360,
                5404
            ],
            [
                5405,
                5447
            ],
            [
                5447,
                5494
            ],
            [
                5494,
                5496
            ],
            [
                5496,
                5500
            ],
            [
                5510,
                5519
            ],
            [
                5522,
                5564
            ],
            [
                5564,
                5603
            ],
            [
                5604,
                5621
            ],
            [
                5621,
                5661
            ],
            [
                5661,
                5695
            ],
            [
                5696,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5791
            ],
            [
                5794,
                5821
            ],
            [
                5824,
                5865
            ],
            [
                5865,
                5886
            ],
            [
                5894,
                5899
            ],
            [
                5899,
                5959
            ],
            [
                5962,
                6010
            ],
            [
                6012,
                6037
            ],
            [
                6037,
                6063
            ],
            [
                6064,
                6079
            ],
            [
                6088,
                6127
            ],
            [
                6128,
                6141
            ],
            [
                6141,
                6151
            ],
            [
                6152,
                6170
            ],
            [
                6170,
                6172
            ],
            [
                6172,
                6179
            ],
            [
                6180,
                6188
            ],
            [
                6188,
                6313
            ],
            [
                6313,
                6330
            ],
            [
                6331,
                6360
            ],
            [
                6370,
                6381
            ],
            [
                6382,
                6386
            ],
            [
                6386,
                6391
            ],
            [
                6401,
                6403
            ],
            [
                6403,
                6465
            ],
            [
                6465,
                6524
            ],
            [
                6524,
                6553
            ],
            [
                6555,
                6594
            ],
            [
                6603,
                6606
            ],
            [
                6606,
                6611
            ],
            [
                6612,
                6620
            ],
            [
                6622,
                6733
            ],
            [
                6733,
                6735
            ],
            [
                6736,
                6738
            ],
            [
                6739,
                6820
            ],
            [
                6821,
                6835
            ],
            [
                6836,
                6847
            ],
            [
                6847,
                6850
            ],
            [
                6850,
                6878
            ],
            [
                6879,
                6882
            ],
            [
                6883,
                6886
            ],
            [
                6887,
                6941
            ],
            [
                6941,
                6956
            ],
            [
                6964,
                6983
            ],
            [
                6983,
                7041
            ],
            [
                7044,
                7081
            ],
            [
                7094,
                7146
            ],
            [
                7147,
                7169
            ],
            [
                7172,
                7187
            ],
            [
                7188,
                7245
            ],
            [
                7245,
                7246
            ],
            [
                7246,
                7281
            ],
            [
                7292,
                7358
            ],
            [
                7358,
                7428
            ],
            [
                7428,
                7456
            ],
            [
                7459,
                7486
            ],
            [
                7486,
                7504
            ],
            [
                7505,
                7520
            ],
            [
                7520,
                7522
            ],
            [
                7522,
                7531
            ],
            [
                7531,
                7569
            ],
            [
                7569,
                7570
            ],
            [
                7578,
                7616
            ],
            [
                7617,
                7631
            ],
            [
                7632,
                7736
            ],
            [
                7737,
                7742
            ],
            [
                7742,
                7752
            ],
            [
                7753,
                7755
            ],
            [
                7756,
                7819
            ],
            [
                7819,
                7919
            ],
            [
                7922,
                7944
            ],
            [
                7944,
                7949
            ],
            [
                7950,
                8032
            ],
            [
                8039,
                8056
            ],
            [
                8056,
                8075
            ],
            [
                8075,
                8076
            ],
            [
                8086,
                8097
            ],
            [
                8097,
                8130
            ],
            [
                8131,
                8132
            ],
            [
                8142,
                8149
            ],
            [
                8149,
                8162
            ],
            [
                8163,
                8222
            ],
            [
                8223,
                8299
            ],
            [
                8300,
                8504
            ],
            [
                8504,
                8509
            ],
            [
                8516,
                8580
            ],
            [
                8580,
                8702
            ],
            [
                8703,
                8740
            ],
            [
                8741,
                8742
            ],
            [
                8750,
                8826
            ],
            [
                8842,
                8843
            ],
            [
                8844,
                8856
            ],
            [
                8867,
                8903
            ],
            [
                8915,
                8919
            ],
            [
                8935,
                8936
            ],
            [
                8937,
                8941
            ],
            [
                8942,
                8943
            ],
            [
                8944,
                8947
            ],
            [
                8951,
                8953
            ],
            [
                8959,
                8964
            ],
            [
                8969,
                8971
            ],
            [
                8978,
                8980
            ],
            [
                8984,
                8986
            ],
            [
                8986,
                9064
            ],
            [
                9069,
                9086
            ],
            [
                9087,
                9103
            ],
            [
                9106,
                9170
            ],
            [
                9175,
                9188
            ],
            [
                9189,
                9199
            ],
            [
                9206,
                9235
            ],
            [
                9236,
                9268
            ],
            [
                9268,
                9269
            ],
            [
                9270,
                9282
            ],
            [
                9283,
                9296
            ],
            [
                9297,
                9313
            ],
            [
                9314,
                9316
            ],
            [
                9317,
                9463
            ],
            [
                9464,
                9467
            ],
            [
                9472,
                9510
            ],
            [
                9511,
                9526
            ],
            [
                9531,
                9542
            ],
            [
                9543,
                9553
            ],
            [
                9553,
                9582
            ],
            [
                9583,
                9606
            ],
            [
                9607,
                9624
            ],
            [
                9630,
                9640
            ],
            [
                9640,
                9641
            ],
            [
                9642,
                9645
            ],
            [
                9646,
                9655
            ],
            [
                9656,
                9714
            ],
            [
                9714,
                9730
            ],
            [
                9730,
                9731
            ],
            [
                9760,
                9765
            ],
            [
                9765,
                9767
            ],
            [
                9767,
                9770
            ],
            [
                9771,
                9795
            ],
            [
                9800,
                9805
            ],
            [
                9806,
                9819
            ],
            [
                9821,
                9839
            ],
            [
                9839,
                9851
            ],
            [
                9851,
                9867
            ],
            [
                9867,
                9892
            ],
            [
                9892,
                9920
            ],
            [
                9921,
                9929
            ],
            [
                9938,
                9940
            ],
            [
                9940,
                9963
            ],
            [
                9963,
                9965
            ],
            [
                9965,
                10009
            ],
            [
                10018,
                10031
            ],
            [
                10042,
                10045
            ],
            [
                10046,
                10049
            ],
            [
                10050,
                10056
            ],
            [
                10058,
                10182
            ],
            [
                10183,
                10222
            ],
            [
                10233,
                10252
            ],
            [
                10253,
                10256
            ],
            [
                10257,
                10265
            ],
            [
                10271,
                10285
            ],
            [
                10285,
                10302
            ],
            [
                10311,
                10329
            ],
            [
                10329,
                10424
            ],
            [
                10425,
                10449
            ],
            [
                10449,
                10514
            ],
            [
                10514,
                10578
            ],
            [
                10578,
                10651
            ],
            [
                10651,
                10724
            ],
            [
                10724,
                10801
            ],
            [
                10801,
                10803
            ],
            [
                10803,
                10805
            ],
            [
                10832,
                10834
            ],
            [
                10842,
                10851
            ],
            [
                10866,
                10954
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                67
            ],
            [
                67,
                218
            ],
            [
                218,
                218
            ],
            [
                218,
                335
            ],
            [
                335,
                335
            ],
            [
                335,
                335
            ],
            [
                335,
                335
            ],
            [
                335,
                452
            ],
            [
                452,
                578
            ],
            [
                578,
                757
            ],
            [
                757,
                818
            ],
            [
                818,
                924
            ],
            [
                924,
                1006
            ],
            [
                1006,
                1117
            ],
            [
                1117,
                1199
            ],
            [
                1199,
                1267
            ],
            [
                1267,
                1306
            ],
            [
                1306,
                1388
            ],
            [
                1388,
                1414
            ],
            [
                1414,
                1462
            ],
            [
                1462,
                1572
            ],
            [
                1572,
                1666
            ],
            [
                1666,
                1771
            ],
            [
                1771,
                1832
            ],
            [
                1832,
                1970
            ],
            [
                1970,
                2020
            ],
            [
                2020,
                2058
            ],
            [
                2058,
                2117
            ],
            [
                2117,
                2287
            ],
            [
                2287,
                2401
            ],
            [
                2401,
                2513
            ],
            [
                2513,
                2635
            ],
            [
                2635,
                2635
            ],
            [
                2635,
                2747
            ],
            [
                2747,
                2888
            ],
            [
                2888,
                3065
            ],
            [
                3065,
                3198
            ],
            [
                3198,
                3467
            ],
            [
                3467,
                3516
            ],
            [
                3516,
                3553
            ],
            [
                3553,
                3650
            ],
            [
                3650,
                3650
            ],
            [
                3650,
                3698
            ],
            [
                3698,
                3796
            ],
            [
                3796,
                3866
            ],
            [
                3866,
                3877
            ],
            [
                3877,
                3944
            ],
            [
                3944,
                4003
            ],
            [
                4003,
                4128
            ],
            [
                4128,
                4218
            ],
            [
                4218,
                4257
            ],
            [
                4257,
                4303
            ],
            [
                4303,
                4303
            ],
            [
                4303,
                4303
            ],
            [
                4303,
                4364
            ],
            [
                4364,
                4481
            ],
            [
                4481,
                4515
            ],
            [
                4515,
                4543
            ],
            [
                4543,
                4567
            ],
            [
                4567,
                4567
            ],
            [
                4567,
                4582
            ],
            [
                4582,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4690
            ],
            [
                4690,
                4772
            ],
            [
                4772,
                4813
            ],
            [
                4813,
                4836
            ],
            [
                4836,
                4867
            ],
            [
                4867,
                4892
            ],
            [
                4892,
                4942
            ],
            [
                4942,
                4942
            ],
            [
                4942,
                5182
            ],
            [
                5182,
                5264
            ],
            [
                5264,
                5360
            ],
            [
                5360,
                5447
            ],
            [
                5447,
                5496
            ],
            [
                5496,
                5621
            ],
            [
                5621,
                5706
            ],
            [
                5706,
                5755
            ],
            [
                5755,
                5755
            ],
            [
                5755,
                5865
            ],
            [
                5865,
                5899
            ],
            [
                5899,
                6037
            ],
            [
                6037,
                6141
            ],
            [
                6141,
                6172
            ],
            [
                6172,
                6313
            ],
            [
                6313,
                6403
            ],
            [
                6403,
                6403
            ],
            [
                6403,
                6465
            ],
            [
                6465,
                6524
            ],
            [
                6524,
                6606
            ],
            [
                6606,
                6622
            ],
            [
                6622,
                6733
            ],
            [
                6733,
                6850
            ],
            [
                6850,
                6941
            ],
            [
                6941,
                6983
            ],
            [
                6983,
                7245
            ],
            [
                7245,
                7358
            ],
            [
                7358,
                7358
            ],
            [
                7358,
                7428
            ],
            [
                7428,
                7486
            ],
            [
                7486,
                7522
            ],
            [
                7522,
                7531
            ],
            [
                7531,
                7569
            ],
            [
                7569,
                7819
            ],
            [
                7819,
                7819
            ],
            [
                7819,
                7944
            ],
            [
                7944,
                8056
            ],
            [
                8056,
                8149
            ],
            [
                8149,
                8163
            ],
            [
                8163,
                8504
            ],
            [
                8504,
                8580
            ],
            [
                8580,
                8844
            ],
            [
                8844,
                8986
            ],
            [
                8986,
                9236
            ],
            [
                9236,
                9511
            ],
            [
                9511,
                9511
            ],
            [
                9511,
                9553
            ],
            [
                9553,
                9714
            ],
            [
                9714,
                9767
            ],
            [
                9767,
                9821
            ],
            [
                9821,
                9839
            ],
            [
                9839,
                9851
            ],
            [
                9851,
                9867
            ],
            [
                9867,
                9892
            ],
            [
                9892,
                9892
            ],
            [
                9892,
                9940
            ],
            [
                9940,
                9965
            ],
            [
                9965,
                10009
            ],
            [
                10009,
                10222
            ],
            [
                10222,
                10285
            ],
            [
                10285,
                10329
            ],
            [
                10329,
                10449
            ],
            [
                10449,
                10514
            ],
            [
                10514,
                10578
            ],
            [
                10578,
                10651
            ],
            [
                10651,
                10724
            ],
            [
                10724,
                10803
            ],
            [
                10803,
                10803
            ],
            [
                10803,
                10954
            ]
        ]
    }
}