{
    "original": {
        "text": "\"Questa montagna e tale, Che sempre al cominciar di sotto a grave. E quanto uom piu va su e men fa male.\" --DANTE: _Il Purgatorio_.\nIt was not many days after her mother's arrival that Gwendolen would consent to remain at Genoa. Her desire to get away from that gem of the sea, helped to rally her strength and courage. For what place, though it were the flowery vale of Enna, may not the inward sense turn into a circle of punishment where the flowers are no better than a crop of flame-tongues burning the soles of our feet?\n\"I shall never like to see the Mediterranean again,\" said Gwendolen, to her mother, who thought that she quite understood her child's feeling--even in her tacit prohibition of any express reference to her late husband.\nMrs. Davilow, indeed, though compelled formally to regard this time as one of severe calamity, was virtually enjoying her life more than she had ever done since her daughter's marriage. It seemed that her darling was brought back to her not merely with all the old affection, but with a conscious cherishing of her mother's nearness, such as we give to a possession that we have been on the brink of losing.\n\"Are you there, mamma?\" cried Gwendolen, in the middle of the night (a bed had been made for her mother in the same room with hers), very much as she would have done in her early girlhood, if she had felt frightened in lying awake.\n\"Yes, dear; can I do anything for you?\"\n\"No, thank you; only I like so to know you are there. Do you mind my waking you?\" (This question would hardly have been Gwendolen's in her early girlhood.)\n\"I was not asleep, darling.\"\n\"It seemed not real that you were with me. I wanted to make it real. I can bear things if you are with me. But you must not lie awake, anxious about me. You must be happy now. You must let me make you happy now at last--else what shall I do?\"\n\"God bless you, dear; I have the best happiness I can have, when you make much of me.\"\nBut the next night, hearing that she was sighing and restless Mrs. Davilow said, \"Let me give you your sleeping-draught, Gwendolen.\"\n\"No, mamma, thank you; I don't want to sleep.\"\n\"It would be so good for you to sleep more, my darling.\"\n\"Don't say what would be good for me, mamma,\" Gwendolen answered, impetuously. \"You don't know what would be good for me. You and my uncle must not contradict me and tell me anything is good for me when I feel it is not good.\"\nMrs. Davilow was silent, not wondering that the poor child was irritable. Presently Gwendolen said,\n\"I was always naughty to you, mamma.\"\n\"No, dear, no.\"\n\"Yes, I was,\" said Gwendolen insistently. \"It is because I was always wicked that I am miserable now.\"\nShe burst into sobs and cries. The determination to be silent about all the facts of her married life and its close, reacted in these escapes of enigmatic excitement.\nBut dim lights of interpretation were breaking on the mother's mind through the information that came from Sir Hugo to Mr. Gascoigne, and, with some omissions, from Mr. Gascoigne to herself. The good-natured baronet, while he was attending to all decent measures in relation to his nephew's death, and the possible washing ashore of the body, thought it the kindest thing he could do to use his present friendly intercourse with the rector as an opportunity for communicating with him, in the mildest way, the purport of Grandcourt's will, so as to save him the additional shock that would be in store for him if he carried his illusions all the way home. Perhaps Sir Hugo would have been communicable enough without that kind motive, but he really felt the motive. He broke the unpleasant news to the rector by degrees: at first he only implied his fear that the widow was not so splendidly provided for as Mr. Gascoigne, nay, as the baronet himself had expected; and only at last, after some previous vague reference to large claims on Grandcourt, he disclosed the prior relations which, in the unfortunate absence of a legitimate heir, had determined all the splendor in another direction.\nThe rector was deeply hurt, and remembered, more vividly than he had ever done before, how offensively proud and repelling the manners of the deceased had been toward him--remembered also that he himself, in that interesting period just before the arrival of the new occupant at Diplow, had received hints of former entangling dissipations, and an undue addiction to pleasure, though he had not foreseen that the pleasure which had probably, so to speak, been swept into private rubbish-heaps, would ever present itself as an array of live caterpillars, disastrous to the green meat of respectable people. But he did not make these retrospective thoughts audible to Sir Hugo, or lower himself by expressing any indignation on merely personal grounds, but behaved like a man of the world who had become a conscientious clergyman. His first remark was,\n\"When a young man makes his will in health, he usually counts on living a long while. Probably Mr. Grandcourt did not believe that this will would ever have its present effect.\" After a moment, he added, \"The effect is painful in more ways than one. Female morality is likely to suffer from this marked advantage and prominence being given to illegitimate offspring.\"\n\"Well, in point of fact,\" said Sir Hugo, in his comfortable way, \"since the boy is there, this was really the best alternative for the disposal of the estates. Grandcourt had nobody nearer than his cousin. And it's a chilling thought that you go out of this life only for the benefit of a cousin. A man gets a little pleasure in making his will, if it's for the good of his own curly heads; but it's a nuisance when you're giving the bequeathing to a used-up fellow like yourself, and one you don't care two straws for. It's the next worse thing to having only a life interest in your estates. No; I forgive Grandcourt for that part of his will. But, between ourselves, what I don't forgive him for, is the shabby way he has provided for your niece--_our_ niece, I will say--no better a position than if she had been a doctor's widow. Nothing grates on me more than that posthumous grudgingness toward a wife. A man ought to have some pride and fondness for his widow. _I_ should, I know. I take it as a test of a man, that he feels the easier about his death when he can think of his wife and daughters being comfortable after it. I like that story of the fellows in the Crimean war, who were ready to go to the bottom of the sea if their widows were provided for.\"\n\"It has certainly taken me by surprise,\" said Mr. Gascoigne, \"all the more because, as the one who stood in the place of father to my niece, I had shown my reliance on Mr. Grandcourt's apparent liberality in money matters by making no claims for her beforehand. That seemed to me due to him under the circumstances. Probably you think me blamable.\"\n\"Not blamable exactly. I respect a man for trusting another. But take my advice. If you marry another niece, though it may be to the Archbishop of Canterbury, bind him down. Your niece can't be married for the first time twice over. And if he's a good fellow, he'll wish to be bound. But as to Mrs. Grandcourt, I can only say that I feel my relation to her all the nearer because I think that she has not been well treated. And I hope you will urge her to rely on me as a friend.\"\nThus spake the chivalrous Sir Hugo, in his disgust at the young and beautiful widow of a Mallinger Grandcourt being left with only two thousand a year and a house in a coal-mining district. To the rector that income naturally appeared less shabby and less accompanied with mortifying privations; but in this conversation he had devoured a much keener sense than the baronet's of the humiliation cast over his niece, and also over her nearest friends, by the conspicuous publishing of her husband's relation to Mrs. Glasher. And like all men who are good husbands and fathers, he felt the humiliation through the minds of the women who would be chiefly affected by it; so that the annoyance of first hearing the facts was far slighter than what he felt in communicating them to Mrs. Davilow, and in anticipating Gwendolen's feeling whenever her mother saw fit to tell her of them. For the good rector had an innocent conviction that his niece was unaware of Mrs. Glasher's existence, arguing with masculine soundness from what maidens and wives were likely to know, do, and suffer, and having had a most imperfect observation of the particular maiden and wife in question. Not so Gwendolen's mother, who now thought that she saw an explanation of much that had been enigmatic in her child's conduct and words before and after her engagement, concluding that in some inconceivable way Gwendolen had been informed of this left-handed marriage and the existence of the children. She trusted to opportunities that would arise in moments of affectionate confidence before and during their journey to England, when she might gradually learn how far the actual state of things was clear to Gwendolen, and prepare her for anything that might be a disappointment. But she was spared from devices on the subject.\n\"I hope you don't expect that I am going to be rich and grand, mamma,\" said Gwendolen, not long after the rector's communication; \"perhaps I shall have nothing at all.\"\nShe was dressed, and had been sitting long in quiet meditation. Mrs. Davilow was startled, but said, after a moment's reflection,\n\"Oh yes, dear, you will have something. Sir Hugo knows all about the will.\"\n\"That will not decide,\" said Gwendolen, abruptly.\n\"Surely, dear: Sir Hugo says you are to have two thousand a year and the house at Gadsmere.\"\n\"What I have will depend on what I accept,\" said Gwendolen. \"You and my uncle must not attempt to cross me and persuade me about this. I will do everything I can do to make you happy, but in anything about my husband I must not be interfered with. Is eight hundred a year enough for you, mamma?\"\n\"More than enough, dear. You must not think of giving me so much.\" Mrs. Davilow paused a little, and then said, \"Do you know who is to have the estates and the rest of the money?\"\n\"Yes,\" said Gwendolen, waving her hand in dismissal of the subject. \"I know everything. It is all perfectly right, and I wish never to have it mentioned.\"\nThe mother was silent, looked away, and rose to fetch a fan-screen, with a slight flush on her delicate cheeks. Wondering, imagining, she did not like to meet her daughter's eyes, and sat down again under a sad constraint. What wretchedness her child had perhaps gone through, which yet must remain as it always had been, locked away from their mutual speech. But Gwendolen was watching her mother with that new divination which experience had given her; and in tender relenting at her own peremptoriness, said, \"Come and sit nearer to me, mamma, and don't be unhappy.\"\nMrs. Davilow did as she was told, but bit her lips in the vain attempt to hinder smarting tears. Gwendolen leaned toward her caressingly and said, \"I mean to be very wise; I do, really. And good--oh, so good to you, dear, old, sweet mamma, you won't know me. Only you must not cry.\"\nThe resolve that Gwendolen had in her mind was that she would ask Deronda whether she ought to accept any of her husband's money--whether she might accept what would enable her to provide for her mother. The poor thing felt strong enough to do anything that would give her a higher place in Deronda's mind.\nAn invitation that Sir Hugo pressed on her with kind urgency was that she and Mrs. Davilow should go straight with him to Park Lane, and make his house their abode as long as mourning and other details needed attending to in London. Town, he insisted, was just then the most retired of places; and he proposed to exert himself at once in getting all articles belonging to Gwendolen away from the house in Grosvenor Square. No proposal could have suited her better than this of staying a little while in Park Lane. It would be easy for her there to have an interview with Deronda, if she only knew how to get a letter into his hands, asking him to come to her. During the journey, Sir Hugo, having understood that she was acquainted with the purport of her husband's will, ventured to talk before her and to her about her future arrangements, referring here and there to mildly agreeable prospects as matters of course, and otherwise shedding a decorous cheerfulness over her widowed position. It seemed to him really the more graceful course for a widow to recover her spirits on finding that her husband had not dealt as handsomely by her as he might have done; it was the testator's fault if he compromised all her grief at his departure by giving a testamentary reason for it, so that she might be supposed to look sad, not because he had left her, but because he had left her poor. The baronet, having his kindliness doubly fanned by the favorable wind on his fortunes and by compassion for Gwendolen, had become quite fatherly in his behavior to her, called her \"my dear,\" and in mentioning Gadsmere to Mr. Gascoigne, with its various advantages and disadvantages, spoke of what \"we\" might do to make the best of that property. Gwendolen sat by in pale silence while Sir Hugo, with his face turned toward Mrs. Davilow or Mr. Gascoigne, conjectured that Mrs. Grandcourt might perhaps prefer letting Gadsmere to residing there during any part of the year, in which case he thought that it might be leased on capital terms to one of the fellows engaged with the coal: Sir Hugo had seen enough of the place to know that it was as comfortable and picturesque a box as any man need desire, providing his desires were circumscribed within a coal area.\n\"_I_ shouldn't mind about the soot myself,\" said the baronet, with that dispassionateness which belongs to the potential mood. \"Nothing is more healthy. And if one's business lay there, Gadsmere would be a paradise. It makes quite a feature in Scrogg's history of the county, with the little tower and the fine piece of water--the prettiest print in the book.\"\n\"A more important place than Offendene, I suppose?\" said Mr. Gascoigne.\n\"Much,\" said the baronet, decisively. \"I was there with my poor brother--it is more than a quarter of a century ago, but I remember it very well. The rooms may not be larger, but the grounds are on a different scale.\"\n\"Our poor dear Offendene is empty after all,\" said Mrs. Davilow. \"When it came to the point, Mr. Haynes declared off, and there has been no one to take it since. I might as well have accepted Lord Brackenshaw's kind offer that I should remain in it another year rent-free: for I should have kept the place aired and warmed.\"\n\"I hope you've something snug instead,\" said Sir Hugo.\n\"A little too snug,\" said Mr. Gascoigne, smiling at his sister-in-law. \"You are rather thick upon the ground.\"\nGwendolen had turned with a changed glance when her mother spoke of Offendene being empty. This conversation passed during one of the long unaccountable pauses often experienced in foreign trains at some country station. There was a dreamy, sunny stillness over the hedgeless fields stretching to the boundary of poplars; and to Gwendolen the talk within the carriage seemed only to make the dreamland larger with an indistinct region of coal-pits, and a purgatorial Gadsmere which she would never visit; till at her mother's words, this mingled, dozing view seemed to dissolve and give way to a more wakeful vision of Offendene and Pennicote under their cooler lights. She saw the gray shoulders of the downs, the cattle-specked fields, the shadowy plantations with rutted lanes where the barked timber lay for a wayside seat, the neatly-clipped hedges on the road from the parsonage to Offendene, the avenue where she was gradually discerned from the window, the hall-door opening, and her mother or one of the troublesome sisters coming out to meet her. All that brief experience of a quiet home which had once seemed a dullness to be fled from, now came back to her as a restful escape, a station where she found the breath of morning and the unreproaching voice of birds after following a lure through a long Satanic masquerade, which she had entered on with an intoxicated belief in its disguises, and had seen the end of in shrieking fear lest she herself had become one of the evil spirits who were dropping their human mummery and hissing around her with serpent tongues.\nIn this way Gwendolen's mind paused over Offendene and made it the scene of many thoughts; but she gave no further outward sign of interest in this conversation, any more than in Sir Hugo's opinion on the telegraphic cable or her uncle's views of the Church Rate Abolition Bill. What subjects will not our talk embrace in leisurely day-journeying from Genoa to London? Even strangers, after glancing from China to Peru and opening their mental stores with a liberality threatening a mutual impression of poverty on any future meeting, are liable to become excessively confidential. But the baronet and the rector were under a still stronger pressure toward cheerful communication: they were like acquaintances compelled to a long drive in a mourning-coach who having first remarked that the occasion is a melancholy one, naturally proceed to enliven it by the most miscellaneous discourse. \"I don't mind telling _you_,\" said Sir Hugo to the rector, in mentioning some private details; while the rector, without saying so, did not mind telling the baronet about his sons, and the difficulty of placing them in the world. By the dint of discussing all persons and things within driving-reach of Diplow, Sir Hugo got himself wrought to a pitch of interest in that former home, and of conviction that it was his pleasant duty to regain and strengthen his personal influence in the neighborhood, that made him declare his intention of taking his family to the place for a month or two before the autumn was over; and Mr. Gascoigne cordially rejoiced in that prospect. Altogether, the journey was continued and ended with mutual liking between the male fellow-travellers.\nMeanwhile Gwendolen sat by like one who had visited the spirit-world and was full to the lips of an unutterable experience that threw a strange unreality over all the talk she was hearing of her own and the world's business; and Mrs. Davilow was chiefly occupied in imagining what her daughter was feeling, and in wondering what was signified by her hinted doubt whether she would accept her husband's bequest. Gwendolen in fact had before her the unsealed wall of an immediate purpose shutting off every other resolution. How to scale the wall? She wanted again to see and consult Deronda, that she might secure herself against any act he would disapprove. Would her remorse have maintained its power within her, or would she have felt absolved by secrecy, if it had not been for that outer conscience which was made for her by Deronda? It is hard to say how much we could forgive ourselves if we were secure from judgment by another whose opinion is the breathing-medium of all our joy--who brings to us with close pressure and immediate sequence that judgment of the Invisible and Universal which self-flattery and the world's tolerance would easily melt and disperse. In this way our brother may be in the stead of God to us, and his opinion which has pierced even to the joints and marrow, may be our virtue in the making. That mission of Deronda to Gwendolen had begun with what she had felt to be his judgment of her at the gaming-table. He might easily have spoiled it:--much of our lives is spent in marring our own influence and turning others' belief in us into a widely concluding unbelief which they call knowledge of the world, while it is really disappointment in you or me. Deronda had not spoiled his mission.\nBut Gwendolen had forgotten to ask him for his address in case she wanted to write, and her only way of reaching him was through Sir Hugo. She was not in the least blind to the construction that all witnesses might put on her giving signs of dependence on Deronda, and her seeking him more than he sought her: Grandcourt's rebukes had sufficiently enlightened her pride. But the force, the tenacity of her nature had thrown itself into that dependence, and she would no more let go her hold on Deronda's help, or deny herself the interview her soul needed, because of witnesses, than if she had been in prison in danger of being condemned to death. When she was in Park Lane and knew that the baronet would be going down to the Abbey immediately (just to see his family for a couple of days and then return to transact needful business for Gwendolen), she said to him without any air of hesitation, while her mother was present,\n\"Sir Hugo, I wish to see Mr. Deronda again as soon as possible. I don't know his address. Will you tell it me, or let him know that I want to see him?\"\nA quick thought passed across Sir Hugo's face, but made no difference to the ease with which he said, \"Upon my word, I don't know whether he's at his chambers or the Abbey at this moment. But I'll make sure of him. I'll send a note now to his chambers telling him to come, and if he's at the Abbey I can give him your message and send him up at once. I am sure he will want to obey your wish,\" the baronet ended, with grave kindness, as if nothing could seem to him more in the appropriate course of things than that she should send such a message.\nBut he was convinced that Gwendolen had a passionate attachment to Deronda, the seeds of which had been laid long ago, and his former suspicion now recurred to him with more strength than ever, that her feeling was likely to lead her into imprudences--in which kind-hearted Sir Hugo was determined to screen and defend her as far as lay in his power. To him it was as pretty a story as need be that this fine creature and his favorite Dan should have turned out to be formed for each other, and that the unsuitable husband should have made his exit in such excellent time. Sir Hugo liked that a charming woman should be made as happy as possible. In truth, what most vexed his mind in this matter at present was a doubt whether the too lofty and inscrutable Dan had not got some scheme or other in his head, which would prove to be dearer to him than the lovely Mrs. Grandcourt, and put that neatly-prepared marriage with her out of the question. It was among the usual paradoxes of feeling that Sir Hugo, who had given his fatherly cautions to Deronda against too much tenderness in his relations with the bride, should now feel rather irritated against him by the suspicion that he had not fallen in love as he ought to have done. Of course all this thinking on Sir Hugo's part was eminently premature, only a fortnight or so after Grandcourt's death. But it is the trick of thinking to be either premature or behind-hand.\nHowever, he sent the note to Deronda's chambers, and it found him there.",
        "paragraph_chars": [
            [
                0,
                132
            ],
            [
                132,
                527
            ],
            [
                527,
                746
            ],
            [
                746,
                1154
            ],
            [
                1154,
                1386
            ],
            [
                1386,
                1426
            ],
            [
                1426,
                1582
            ],
            [
                1582,
                1611
            ],
            [
                1611,
                1854
            ],
            [
                1854,
                1941
            ],
            [
                1941,
                2074
            ],
            [
                2074,
                2121
            ],
            [
                2121,
                2178
            ],
            [
                2178,
                2405
            ],
            [
                2405,
                2505
            ],
            [
                2505,
                2543
            ],
            [
                2543,
                2559
            ],
            [
                2559,
                2662
            ],
            [
                2662,
                2829
            ],
            [
                2829,
                4022
            ],
            [
                4022,
                4873
            ],
            [
                4873,
                5241
            ],
            [
                5241,
                6508
            ],
            [
                6508,
                6857
            ],
            [
                6857,
                7338
            ],
            [
                7338,
                9140
            ],
            [
                9140,
                9309
            ],
            [
                9309,
                9439
            ],
            [
                9439,
                9515
            ],
            [
                9515,
                9565
            ],
            [
                9565,
                9658
            ],
            [
                9658,
                9954
            ],
            [
                9954,
                10134
            ],
            [
                10134,
                10289
            ],
            [
                10289,
                10859
            ],
            [
                10859,
                11142
            ],
            [
                11142,
                11449
            ],
            [
                11449,
                13699
            ],
            [
                13699,
                14060
            ],
            [
                14060,
                14132
            ],
            [
                14132,
                14350
            ],
            [
                14350,
                14675
            ],
            [
                14675,
                14730
            ],
            [
                14730,
                14841
            ],
            [
                14841,
                16422
            ],
            [
                16422,
                18088
            ],
            [
                18088,
                19815
            ],
            [
                19815,
                20744
            ],
            [
                20744,
                20896
            ],
            [
                20896,
                21445
            ],
            [
                21445,
                22870
            ],
            [
                22870,
                22942
            ]
        ],
        "segment_chars": [
            [
                0,
                67
            ],
            [
                67,
                106
            ],
            [
                106,
                132
            ],
            [
                132,
                229
            ],
            [
                229,
                320
            ],
            [
                320,
                527
            ],
            [
                527,
                746
            ],
            [
                746,
                932
            ],
            [
                932,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1386
            ],
            [
                1386,
                1426
            ],
            [
                1426,
                1480
            ],
            [
                1480,
                1508
            ],
            [
                1508,
                1582
            ],
            [
                1582,
                1611
            ],
            [
                1611,
                1654
            ],
            [
                1654,
                1680
            ],
            [
                1680,
                1718
            ],
            [
                1718,
                1764
            ],
            [
                1764,
                1787
            ],
            [
                1787,
                1854
            ],
            [
                1854,
                1941
            ],
            [
                1941,
                2074
            ],
            [
                2074,
                2121
            ],
            [
                2121,
                2178
            ],
            [
                2178,
                2257
            ],
            [
                2257,
                2300
            ],
            [
                2300,
                2405
            ],
            [
                2405,
                2479
            ],
            [
                2479,
                2505
            ],
            [
                2505,
                2543
            ],
            [
                2543,
                2559
            ],
            [
                2559,
                2601
            ],
            [
                2601,
                2662
            ],
            [
                2662,
                2693
            ],
            [
                2693,
                2829
            ],
            [
                2829,
                3020
            ],
            [
                3020,
                3485
            ],
            [
                3485,
                3595
            ],
            [
                3595,
                4022
            ],
            [
                4022,
                4628
            ],
            [
                4628,
                4851
            ],
            [
                4851,
                4873
            ],
            [
                4873,
                4959
            ],
            [
                4959,
                5051
            ],
            [
                5051,
                5123
            ],
            [
                5123,
                5241
            ],
            [
                5241,
                5401
            ],
            [
                5401,
                5447
            ],
            [
                5447,
                5538
            ],
            [
                5538,
                5761
            ],
            [
                5761,
                5835
            ],
            [
                5835,
                5887
            ],
            [
                5887,
                6076
            ],
            [
                6076,
                6151
            ],
            [
                6151,
                6210
            ],
            [
                6210,
                6230
            ],
            [
                6230,
                6373
            ],
            [
                6373,
                6508
            ],
            [
                6508,
                6770
            ],
            [
                6770,
                6824
            ],
            [
                6824,
                6857
            ],
            [
                6857,
                6880
            ],
            [
                6880,
                6918
            ],
            [
                6918,
                6938
            ],
            [
                6938,
                7031
            ],
            [
                7031,
                7090
            ],
            [
                7090,
                7141
            ],
            [
                7141,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7528
            ],
            [
                7528,
                7862
            ],
            [
                7862,
                8218
            ],
            [
                8218,
                8510
            ],
            [
                8510,
                8813
            ],
            [
                8813,
                9092
            ],
            [
                9092,
                9140
            ],
            [
                9140,
                9309
            ],
            [
                9309,
                9373
            ],
            [
                9373,
                9439
            ],
            [
                9439,
                9479
            ],
            [
                9479,
                9515
            ],
            [
                9515,
                9565
            ],
            [
                9565,
                9658
            ],
            [
                9658,
                9718
            ],
            [
                9718,
                9793
            ],
            [
                9793,
                9906
            ],
            [
                9906,
                9954
            ],
            [
                9954,
                9979
            ],
            [
                9979,
                10021
            ],
            [
                10021,
                10134
            ],
            [
                10134,
                10202
            ],
            [
                10202,
                10222
            ],
            [
                10222,
                10289
            ],
            [
                10289,
                10401
            ],
            [
                10401,
                10512
            ],
            [
                10512,
                10649
            ],
            [
                10649,
                10859
            ],
            [
                10859,
                10956
            ],
            [
                10956,
                11045
            ],
            [
                11045,
                11118
            ],
            [
                11118,
                11142
            ],
            [
                11142,
                11346
            ],
            [
                11346,
                11449
            ],
            [
                11449,
                11682
            ],
            [
                11682,
                11872
            ],
            [
                11872,
                11963
            ],
            [
                11963,
                12109
            ],
            [
                12109,
                12442
            ],
            [
                12442,
                12835
            ],
            [
                12835,
                13182
            ],
            [
                13182,
                13699
            ],
            [
                13699,
                13826
            ],
            [
                13826,
                13852
            ],
            [
                13852,
                13915
            ],
            [
                13915,
                14060
            ],
            [
                14060,
                14112
            ],
            [
                14112,
                14132
            ],
            [
                14132,
                14170
            ],
            [
                14170,
                14278
            ],
            [
                14278,
                14350
            ],
            [
                14350,
                14415
            ],
            [
                14415,
                14512
            ],
            [
                14512,
                14675
            ],
            [
                14675,
                14730
            ],
            [
                14730,
                14801
            ],
            [
                14801,
                14841
            ],
            [
                14841,
                14932
            ],
            [
                14932,
                15062
            ],
            [
                15062,
                15511
            ],
            [
                15511,
                15898
            ],
            [
                15898,
                16422
            ],
            [
                16422,
                16701
            ],
            [
                16701,
                16791
            ],
            [
                16791,
                17004
            ],
            [
                17004,
                17312
            ],
            [
                17312,
                17542
            ],
            [
                17542,
                17985
            ],
            [
                17985,
                18088
            ],
            [
                18088,
                18499
            ],
            [
                18499,
                18611
            ],
            [
                18611,
                18634
            ],
            [
                18634,
                18746
            ],
            [
                18746,
                18926
            ],
            [
                18926,
                19260
            ],
            [
                19260,
                19416
            ],
            [
                19416,
                19533
            ],
            [
                19533,
                19778
            ],
            [
                19778,
                19815
            ],
            [
                19815,
                19954
            ],
            [
                19954,
                20186
            ],
            [
                20186,
                20464
            ],
            [
                20464,
                20744
            ],
            [
                20744,
                20808
            ],
            [
                20808,
                20834
            ],
            [
                20834,
                20896
            ],
            [
                20896,
                21084
            ],
            [
                21084,
                21111
            ],
            [
                21111,
                21247
            ],
            [
                21247,
                21445
            ],
            [
                21445,
                21796
            ],
            [
                21796,
                22018
            ],
            [
                22018,
                22092
            ],
            [
                22092,
                22392
            ],
            [
                22392,
                22678
            ],
            [
                22678,
                22799
            ],
            [
                22799,
                22870
            ],
            [
                22870,
                22942
            ]
        ],
        "overlap_chars": [
            [
                185,
                200
            ],
            [
                139,
                142
            ],
            [
                201,
                227
            ],
            [
                153,
                179
            ],
            [
                227,
                229
            ],
            [
                229,
                251
            ],
            [
                278,
                306
            ],
            [
                318,
                320
            ],
            [
                320,
                323
            ],
            [
                368,
                370
            ],
            [
                351,
                354
            ],
            [
                407,
                413
            ],
            [
                329,
                334
            ],
            [
                421,
                434
            ],
            [
                527,
                579
            ],
            [
                580,
                584
            ],
            [
                596,
                668
            ],
            [
                744,
                746
            ],
            [
                746,
                844
            ],
            [
                855,
                932
            ],
            [
                932,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1221
            ],
            [
                1341,
                1342
            ],
            [
                1297,
                1303
            ],
            [
                1350,
                1353
            ],
            [
                1320,
                1326
            ],
            [
                1333,
                1341
            ],
            [
                1384,
                1385
            ],
            [
                1222,
                1284
            ],
            [
                1386,
                1426
            ],
            [
                1426,
                1480
            ],
            [
                1480,
                1508
            ],
            [
                1508,
                1509
            ],
            [
                1546,
                1555
            ],
            [
                1523,
                1540
            ],
            [
                1509,
                1513
            ],
            [
                1558,
                1582
            ],
            [
                1582,
                1611
            ],
            [
                1611,
                1654
            ],
            [
                1654,
                1680
            ],
            [
                1680,
                1718
            ],
            [
                1718,
                1744
            ],
            [
                1746,
                1753
            ],
            [
                1762,
                1764
            ],
            [
                1764,
                1787
            ],
            [
                1787,
                1829
            ],
            [
                1854,
                1901
            ],
            [
                1912,
                1941
            ],
            [
                1941,
                2002
            ],
            [
                2003,
                2074
            ],
            [
                2074,
                2121
            ],
            [
                2121,
                2133
            ],
            [
                2137,
                2178
            ],
            [
                2178,
                2242
            ],
            [
                2244,
                2257
            ],
            [
                2257,
                2300
            ],
            [
                2300,
                2351
            ],
            [
                2364,
                2375
            ],
            [
                2402,
                2405
            ],
            [
                2405,
                2479
            ],
            [
                2479,
                2503
            ],
            [
                2505,
                2543
            ],
            [
                2543,
                2552
            ],
            [
                2556,
                2559
            ],
            [
                2559,
                2601
            ],
            [
                2601,
                2662
            ],
            [
                2662,
                2681
            ],
            [
                2691,
                2693
            ],
            [
                2693,
                2729
            ],
            [
                2734,
                2763
            ],
            [
                2779,
                2803
            ],
            [
                2827,
                2829
            ],
            [
                2829,
                2832
            ],
            [
                2867,
                2930
            ],
            [
                2945,
                2947
            ],
            [
                2931,
                2944
            ],
            [
                2961,
                2962
            ],
            [
                2948,
                2961
            ],
            [
                3018,
                3020
            ],
            [
                3020,
                3044
            ],
            [
                3172,
                3182
            ],
            [
                3069,
                3071
            ],
            [
                3258,
                3268
            ],
            [
                3335,
                3390
            ],
            [
                3402,
                3438
            ],
            [
                3483,
                3484
            ],
            [
                4022,
                4083
            ],
            [
                4101,
                4181
            ],
            [
                4508,
                4509
            ],
            [
                4205,
                4225
            ],
            [
                4309,
                4361
            ],
            [
                4626,
                4628
            ],
            [
                4696,
                4697
            ],
            [
                4632,
                4642
            ],
            [
                4648,
                4653
            ],
            [
                4668,
                4676
            ],
            [
                4771,
                4776
            ],
            [
                4873,
                4959
            ],
            [
                4959,
                5050
            ],
            [
                5241,
                5401
            ],
            [
                5839,
                5887
            ],
            [
                5887,
                5890
            ],
            [
                5911,
                5989
            ],
            [
                6074,
                6076
            ],
            [
                7237,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7528
            ],
            [
                7528,
                7584
            ],
            [
                7632,
                7637
            ],
            [
                7659,
                7665
            ],
            [
                7675,
                7676
            ],
            [
                7682,
                7694
            ],
            [
                7714,
                7795
            ],
            [
                7808,
                7862
            ],
            [
                7914,
                7925
            ],
            [
                7956,
                7958
            ],
            [
                8093,
                8106
            ],
            [
                8045,
                8054
            ],
            [
                8112,
                8128
            ],
            [
                7879,
                7882
            ],
            [
                8197,
                8204
            ],
            [
                8149,
                8158
            ],
            [
                8216,
                8217
            ],
            [
                8218,
                8319
            ],
            [
                8508,
                8510
            ],
            [
                8510,
                8635
            ],
            [
                8677,
                8702
            ],
            [
                8717,
                8813
            ],
            [
                8813,
                8824
            ],
            [
                8842,
                8846
            ],
            [
                9020,
                9029
            ],
            [
                8950,
                8955
            ],
            [
                8859,
                8861
            ],
            [
                8908,
                8940
            ],
            [
                9060,
                9064
            ],
            [
                8946,
                8949
            ],
            [
                9035,
                9050
            ],
            [
                9076,
                9092
            ],
            [
                9092,
                9140
            ],
            [
                9140,
                9225
            ],
            [
                9268,
                9299
            ],
            [
                9306,
                9309
            ],
            [
                9373,
                9437
            ],
            [
                9439,
                9479
            ],
            [
                9584,
                9658
            ],
            [
                9658,
                9718
            ],
            [
                9718,
                9764
            ],
            [
                9791,
                9793
            ],
            [
                9793,
                9906
            ],
            [
                9906,
                9954
            ],
            [
                9954,
                9977
            ],
            [
                10021,
                10040
            ],
            [
                10049,
                10097
            ],
            [
                10114,
                10134
            ],
            [
                10134,
                10202
            ],
            [
                10202,
                10222
            ],
            [
                10222,
                10289
            ],
            [
                10289,
                10310
            ],
            [
                10399,
                10401
            ],
            [
                10423,
                10510
            ],
            [
                10410,
                10411
            ],
            [
                10512,
                10564
            ],
            [
                10647,
                10649
            ],
            [
                10649,
                10747
            ],
            [
                10795,
                10799
            ],
            [
                10751,
                10757
            ],
            [
                10799,
                10821
            ],
            [
                10827,
                10858
            ],
            [
                10859,
                10875
            ],
            [
                10891,
                10892
            ],
            [
                10956,
                11045
            ],
            [
                11045,
                11048
            ],
            [
                11059,
                11118
            ],
            [
                11118,
                11142
            ],
            [
                11159,
                11172
            ],
            [
                11204,
                11270
            ],
            [
                11272,
                11296
            ],
            [
                11319,
                11346
            ],
            [
                11346,
                11449
            ],
            [
                11472,
                11476
            ],
            [
                11523,
                11539
            ],
            [
                11568,
                11581
            ],
            [
                11668,
                11670
            ],
            [
                11613,
                11623
            ],
            [
                11651,
                11657
            ],
            [
                11680,
                11682
            ],
            [
                11872,
                11901
            ],
            [
                11906,
                11912
            ],
            [
                11961,
                11963
            ],
            [
                11963,
                12035
            ],
            [
                12036,
                12040
            ],
            [
                12053,
                12065
            ],
            [
                12050,
                12052
            ],
            [
                12089,
                12092
            ],
            [
                12107,
                12108
            ],
            [
                12109,
                12137
            ],
            [
                12221,
                12237
            ],
            [
                12253,
                12289
            ],
            [
                12440,
                12442
            ],
            [
                12955,
                12980
            ],
            [
                13000,
                13004
            ],
            [
                13012,
                13053
            ],
            [
                13117,
                13182
            ],
            [
                13182,
                13195
            ],
            [
                13199,
                13230
            ],
            [
                13259,
                13328
            ],
            [
                13337,
                13378
            ],
            [
                13406,
                13456
            ],
            [
                13474,
                13517
            ],
            [
                13697,
                13699
            ],
            [
                13856,
                13913
            ],
            [
                13913,
                13914
            ],
            [
                14060,
                14112
            ],
            [
                14112,
                14132
            ],
            [
                14132,
                14170
            ],
            [
                14311,
                14350
            ],
            [
                14350,
                14415
            ],
            [
                14415,
                14416
            ],
            [
                14445,
                14453
            ],
            [
                14463,
                14471
            ],
            [
                14487,
                14489
            ],
            [
                14490,
                14493
            ],
            [
                14478,
                14481
            ],
            [
                14502,
                14510
            ],
            [
                14841,
                14899
            ],
            [
                14932,
                14936
            ],
            [
                14957,
                15062
            ],
            [
                15062,
                15106
            ],
            [
                15117,
                15123
            ],
            [
                15161,
                15345
            ],
            [
                15374,
                15378
            ],
            [
                15388,
                15399
            ],
            [
                15435,
                15436
            ],
            [
                15450,
                15469
            ],
            [
                15509,
                15511
            ],
            [
                15511,
                15522
            ],
            [
                15528,
                15582
            ],
            [
                15673,
                15706
            ],
            [
                15726,
                15750
            ],
            [
                15800,
                15839
            ],
            [
                15874,
                15898
            ],
            [
                15898,
                15961
            ],
            [
                15964,
                15968
            ],
            [
                15988,
                16030
            ],
            [
                16420,
                16422
            ],
            [
                16582,
                16583
            ],
            [
                16434,
                16443
            ],
            [
                16521,
                16528
            ],
            [
                16537,
                16564
            ],
            [
                16485,
                16488
            ],
            [
                16570,
                16582
            ],
            [
                16699,
                16701
            ],
            [
                17008,
                17039
            ],
            [
                17477,
                17482
            ],
            [
                17540,
                17542
            ],
            [
                17627,
                17631
            ],
            [
                17835,
                17872
            ],
            [
                17615,
                17621
            ],
            [
                17883,
                17901
            ],
            [
                17675,
                17677
            ],
            [
                17913,
                17919
            ],
            [
                17928,
                17985
            ],
            [
                17985,
                18022
            ],
            [
                18033,
                18088
            ],
            [
                18088,
                18160
            ],
            [
                18200,
                18210
            ],
            [
                18216,
                18250
            ],
            [
                18255,
                18259
            ],
            [
                18311,
                18411
            ],
            [
                18451,
                18498
            ],
            [
                18499,
                18520
            ],
            [
                18566,
                18611
            ],
            [
                18634,
                18653
            ],
            [
                18662,
                18678
            ],
            [
                18679,
                18746
            ],
            [
                18746,
                18801
            ],
            [
                18846,
                18873
            ],
            [
                18880,
                18926
            ],
            [
                19322,
                19325
            ],
            [
                19453,
                19532
            ],
            [
                19815,
                19828
            ],
            [
                19858,
                19869
            ],
            [
                19897,
                19954
            ],
            [
                19954,
                19957
            ],
            [
                19988,
                20009
            ],
            [
                20024,
                20029
            ],
            [
                20030,
                20040
            ],
            [
                20088,
                20095
            ],
            [
                20071,
                20078
            ],
            [
                20186,
                20189
            ],
            [
                20272,
                20281
            ],
            [
                19962,
                19965
            ],
            [
                20290,
                20296
            ],
            [
                20214,
                20220
            ],
            [
                20057,
                20067
            ],
            [
                20462,
                20464
            ],
            [
                20464,
                20515
            ],
            [
                20567,
                20569
            ],
            [
                20531,
                20548
            ],
            [
                20742,
                20743
            ],
            [
                20667,
                20690
            ],
            [
                20702,
                20742
            ],
            [
                20744,
                20808
            ],
            [
                20834,
                20842
            ],
            [
                20858,
                20896
            ],
            [
                20896,
                20946
            ],
            [
                20989,
                20996
            ],
            [
                20996,
                21084
            ],
            [
                21111,
                21127
            ],
            [
                21132,
                21147
            ],
            [
                21167,
                21237
            ],
            [
                21245,
                21247
            ],
            [
                21247,
                21287
            ],
            [
                21290,
                21301
            ],
            [
                21309,
                21354
            ],
            [
                21362,
                21366
            ],
            [
                21374,
                21385
            ],
            [
                21443,
                21444
            ],
            [
                21445,
                21520
            ],
            [
                21564,
                21567
            ],
            [
                21639,
                21643
            ],
            [
                21670,
                21695
            ],
            [
                21562,
                21563
            ],
            [
                21728,
                21752
            ],
            [
                21764,
                21796
            ],
            [
                21796,
                21809
            ],
            [
                21820,
                21821
            ],
            [
                21813,
                21819
            ],
            [
                21822,
                21827
            ],
            [
                21839,
                21870
            ],
            [
                21880,
                22018
            ],
            [
                22092,
                22126
            ],
            [
                22153,
                22172
            ],
            [
                22203,
                22391
            ],
            [
                22678,
                22728
            ],
            [
                22739,
                22766
            ],
            [
                22773,
                22799
            ],
            [
                22799,
                22870
            ],
            [
                22870,
                22942
            ]
        ],
        "row_chars": [
            [
                0,
                67
            ],
            [
                67,
                106
            ],
            [
                106,
                132
            ],
            [
                132,
                229
            ],
            [
                229,
                320
            ],
            [
                320,
                527
            ],
            [
                527,
                746
            ],
            [
                746,
                932
            ],
            [
                932,
                1154
            ],
            [
                1154,
                1178
            ],
            [
                1178,
                1386
            ],
            [
                1386,
                1426
            ],
            [
                1426,
                1480
            ],
            [
                1480,
                1508
            ],
            [
                1508,
                1582
            ],
            [
                1582,
                1611
            ],
            [
                1611,
                1654
            ],
            [
                1654,
                1680
            ],
            [
                1680,
                1718
            ],
            [
                1718,
                1764
            ],
            [
                1764,
                1787
            ],
            [
                1787,
                1854
            ],
            [
                1854,
                1941
            ],
            [
                1941,
                2074
            ],
            [
                2074,
                2121
            ],
            [
                2121,
                2178
            ],
            [
                2178,
                2257
            ],
            [
                2257,
                2300
            ],
            [
                2300,
                2405
            ],
            [
                2405,
                2479
            ],
            [
                2479,
                2505
            ],
            [
                2505,
                2543
            ],
            [
                2543,
                2559
            ],
            [
                2559,
                2601
            ],
            [
                2601,
                2662
            ],
            [
                2662,
                2693
            ],
            [
                2693,
                2829
            ],
            [
                2829,
                3020
            ],
            [
                3020,
                3485
            ],
            [
                3485,
                3595
            ],
            [
                3595,
                4022
            ],
            [
                4022,
                4628
            ],
            [
                4628,
                4873
            ],
            [
                4873,
                4959
            ],
            [
                4959,
                5051
            ],
            [
                5051,
                5123
            ],
            [
                5123,
                5241
            ],
            [
                5241,
                5401
            ],
            [
                5401,
                5447
            ],
            [
                5447,
                5538
            ],
            [
                5538,
                5761
            ],
            [
                5761,
                5835
            ],
            [
                5835,
                5887
            ],
            [
                5887,
                6076
            ],
            [
                6076,
                6151
            ],
            [
                6151,
                6210
            ],
            [
                6210,
                6230
            ],
            [
                6230,
                6373
            ],
            [
                6373,
                6508
            ],
            [
                6508,
                6770
            ],
            [
                6770,
                6824
            ],
            [
                6824,
                6857
            ],
            [
                6857,
                6880
            ],
            [
                6880,
                6918
            ],
            [
                6918,
                6938
            ],
            [
                6938,
                7031
            ],
            [
                7031,
                7090
            ],
            [
                7090,
                7141
            ],
            [
                7141,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7528
            ],
            [
                7528,
                7862
            ],
            [
                7862,
                8218
            ],
            [
                8218,
                8510
            ],
            [
                8510,
                8813
            ],
            [
                8813,
                9092
            ],
            [
                9092,
                9140
            ],
            [
                9140,
                9309
            ],
            [
                9309,
                9373
            ],
            [
                9373,
                9439
            ],
            [
                9439,
                9479
            ],
            [
                9479,
                9515
            ],
            [
                9515,
                9565
            ],
            [
                9565,
                9658
            ],
            [
                9658,
                9718
            ],
            [
                9718,
                9793
            ],
            [
                9793,
                9906
            ],
            [
                9906,
                9954
            ],
            [
                9954,
                9979
            ],
            [
                9979,
                10021
            ],
            [
                10021,
                10134
            ],
            [
                10134,
                10202
            ],
            [
                10202,
                10222
            ],
            [
                10222,
                10289
            ],
            [
                10289,
                10401
            ],
            [
                10401,
                10649
            ],
            [
                10649,
                10859
            ],
            [
                10859,
                11045
            ],
            [
                11045,
                11118
            ],
            [
                11118,
                11142
            ],
            [
                11142,
                11346
            ],
            [
                11346,
                11449
            ],
            [
                11449,
                11682
            ],
            [
                11682,
                11872
            ],
            [
                11872,
                11963
            ],
            [
                11963,
                12109
            ],
            [
                12109,
                12442
            ],
            [
                12442,
                12835
            ],
            [
                12835,
                13182
            ],
            [
                13182,
                13699
            ],
            [
                13699,
                13826
            ],
            [
                13826,
                13852
            ],
            [
                13852,
                13915
            ],
            [
                13915,
                14060
            ],
            [
                14060,
                14112
            ],
            [
                14112,
                14132
            ],
            [
                14132,
                14170
            ],
            [
                14170,
                14278
            ],
            [
                14278,
                14350
            ],
            [
                14350,
                14415
            ],
            [
                14415,
                14512
            ],
            [
                14512,
                14675
            ],
            [
                14675,
                14730
            ],
            [
                14730,
                14801
            ],
            [
                14801,
                14841
            ],
            [
                14841,
                15062
            ],
            [
                15062,
                15511
            ],
            [
                15511,
                15898
            ],
            [
                15898,
                16422
            ],
            [
                16422,
                16701
            ],
            [
                16701,
                16791
            ],
            [
                16791,
                17004
            ],
            [
                17004,
                17542
            ],
            [
                17542,
                17985
            ],
            [
                17985,
                18088
            ],
            [
                18088,
                18499
            ],
            [
                18499,
                18611
            ],
            [
                18611,
                18634
            ],
            [
                18634,
                18746
            ],
            [
                18746,
                18926
            ],
            [
                18926,
                19260
            ],
            [
                19260,
                19533
            ],
            [
                19533,
                19778
            ],
            [
                19778,
                19815
            ],
            [
                19815,
                19954
            ],
            [
                19954,
                20464
            ],
            [
                20464,
                20744
            ],
            [
                20744,
                20808
            ],
            [
                20808,
                20834
            ],
            [
                20834,
                20896
            ],
            [
                20896,
                21084
            ],
            [
                21084,
                21111
            ],
            [
                21111,
                21247
            ],
            [
                21247,
                21445
            ],
            [
                21445,
                21796
            ],
            [
                21796,
                22018
            ],
            [
                22018,
                22092
            ],
            [
                22092,
                22392
            ],
            [
                22392,
                22678
            ],
            [
                22678,
                22799
            ],
            [
                22799,
                22870
            ],
            [
                22870,
                22942
            ]
        ]
    },
    "abridged": {
        "text": "Gwendolen would not consent to remain at Genoa after her mother's arrival. Her desire to get away helped to rally her strength. For that gem of the sea had turned into a place of punishment.\n\"I shall never like to see the Mediterranean again,\" she said to her mother, who thought that she quite understood her child's feeling.\nMrs. Davilow, indeed, though compelled formally to regard this time as one of severe calamity, was enjoying her life more than she had ever done since her daughter's marriage. It seemed that her darling was brought back to her not merely with all the old affection, but with a conscious cherishing of her mother's nearness, such as we give to a possession that we have been on the brink of losing.\n\"Are you there, mamma?\" cried Gwendolen, in the middle of the night, as she had in her young girlhood. (A bed had been made for her mother in the same room with hers.)\n\"Yes, dear; can I do anything for you?\"\n\"No, thank you; only I like so to know you are there. Do you mind my waking you?\" (Gwendolen would hardly have asked this in her early girlhood.)\n\"I was not asleep, darling.\"\n\"It seemed not real that you were with me. I wanted to make it real. I can bear things if you are with me. But you must not lie awake and anxious. You must be happy now. You must let me make you happy now at last.\"\n\"God bless you, dear; I have the best happiness possible, when you make much of me.\"\nBut the next night, hearing that she was sighing and restless, Mrs. Davilow said, \"Let me give you your sleeping-draught, Gwendolen.\"\n\"No, mamma, thank you; I don't want to sleep.\"\n\"It would be good for you to sleep more, my darling.\"\n\"Don't say what would be good for me, mamma,\" Gwendolen answered impetuously. \"You don't know what would be good for me. You and my uncle must not contradict me and tell me what would be good for me.\"\nMrs. Davilow was silent, not wondering that the poor child was irritable. Presently Gwendolen said-\n\"I was always naughty to you, mamma.\"\n\"No, dear.\"\n\"Yes, I was,\" said Gwendolen insistently. \"It is because I was always wicked that I am miserable now.\"\nShe burst into sobs. The determination to be silent about the facts of her married life reacted in these escapes.\nBut light was breaking on the mother's mind through the information that came to her from Sir Hugo, through Mr. Gascoigne. The good-natured baronet thought it best to tell the rector the purport of Grandcourt's will, so as to save him the shock that would be in store for him otherwise.\nThe rector was deeply hurt, and remembered, more vividly than before, how offensively proud and repelling the manners of the deceased had been - remembered also that he himself had received hints of former entangling dissipations. However, he did not express these thoughts, but remarked-\n\"When a young man makes his will in health, he usually counts on living a long while. Probably Mr. Grandcourt did not believe that this will would ever have its present effect.\"\n\"Well, in point of fact,\" said Sir Hugo, in his comfortable way, \"since the boy is there, this was really the best alternative for the disposal of the estates. I forgive Grandcourt for that part of his will. But what I don't forgive him for, is the shabby way he has provided for your niece. I think that she has not been well treated. And I hope you will urge her to rely on me as a friend.\"\nThus spake the chivalrous Sir Hugo, in his disgust at the young and beautiful widow of a Mallinger Grandcourt being left with only two thousand a year and a house in a coal-mining district. To the rector that income naturally appeared less shabby; but he had a keener sense of the humiliation cast over his niece, and also over her nearest friends, by the publishing of her husband's relation to Mrs. Glasher. He felt the unpleasantness of communicating the facts to Mrs. Davilow, who had to tell Gwendolen.\nFor the good rector had an innocent conviction that his niece was unaware of Mrs. Glasher's existence. Not so Gwendolen's mother, who now thought that she saw an explanation of much that had been enigmatic in her child's conduct, concluding that in some way Gwendolen had been informed of this left-handed marriage and the existence of the children. She trusted that Gwendolen might confide in her during their journey to England, so that she could prepare her for any disappointment. But she was spared from devices on the subject.\n\"I hope you don't expect that I am going to be rich and grand, mamma,\" said Gwendolen; \"perhaps I shall have nothing.\"\nMrs. Davilow was startled, but said, after a moment's reflection-\n\"Oh yes, dear, you will have something. Sir Hugo says you are to have two thousand a year and the house at Gadsmere.\"\n\"What I have will depend on what I accept,\" said Gwendolen. \"You and my uncle must not attempt to cross me. I will do everything I can do to make you happy, but in anything about my husband I must not be interfered with. Is eight hundred a year enough for you, mamma?\"\n\"More than enough, dear.\" Mrs. Davilow paused, and then said, \"Do you know who is to have the rest of the money?\"\n\"Yes,\" said Gwendolen, waving her hand in dismissal of the subject. \"I know everything. It is all perfectly right, and I wish never to have it mentioned.\"\nThe mother was silent. She did not like to meet her daughter's eyes, and sat down again under a sad constraint, wondering what wretchedness her child had perhaps gone through. But Gwendolen was watching her mother with that new divination which experience had given her; and said tenderly, \"Come and sit nearer, mamma, and don't be unhappy.\" When Mrs. Davilow did so, Gwendolen leaned toward her caressingly and said, \"I mean to be very wise; I do, really. And so good to you, dear, old, sweet mamma, you won't know me. Only you must not cry.\"\nGwendolen had resolved to ask Deronda whether she ought to accept any of her husband's money - whether she might accept enough to provide for her mother. The poor thing felt strong enough to do anything that would give her a higher place in Deronda's mind.\nSir Hugo kindly invited Gwendolen and Mrs. Davilow to Park Lane, to stay for as long as they needed. No proposal could have suited Gwendolen better. It would be easy for her there to have an interview with Deronda, if she could only get a letter to him.\nDuring the journey, Sir Hugo ventured to talk to her about her future arrangements. He had become quite fatherly towards her, calling her \"my dear,\" and in mentioning Gadsmere, spoke of what \"we\" might do to make the best of that property. Gwendolen sat in pale silence while Sir Hugo, addressing Mrs. Davilow or Mr. Gascoigne, conjectured that Mrs. Grandcourt might prefer letting Gadsmere to residing there, in which case he thought that it might be leased to one of the fellows engaged with the coal.\n\"If one's business lay there, Gadsmere would be a paradise,\" he said.\n\"A more important place than Offendene, I suppose?\" said Mr. Gascoigne.\n\"Much,\" said the baronet, decisively. \"The grounds are on a different scale.\"\n\"Our poor dear Offendene is empty after all,\" said Mrs. Davilow. \"Mr. Haynes cried off, and no-one has taken it since.\"\nGwendolen had turned with a changed glance when her mother said this; it was during one of the long unaccountable pauses often experienced in foreign trains at some country station. There was a dreamy, sunny stillness over the fields; and to Gwendolen the talk within the carriage seemed only to make the dreamland larger with an indistinct region of coal-pits, and a purgatorial Gadsmere which she would never visit; then this dozing view dissolved into a vision of Offendene. She saw the grey shoulders of the downs, the cattle-specked fields, the neatly-clipped hedges on the road to Offendene, the avenue, the hall-door opening, and her mother coming out to meet her. All that brief experience of a quiet home which had once seemed dull, now came back to her as a restful escape.\nHowever, Gwendolen gave no outward sign of interest in the conversation. The baronet and the rector were talking about their families. Sir Hugo declared his intention of taking his family to Diplow for a month or two in autumn; and Mr. Gascoigne cordially rejoiced in that prospect. Altogether, the journey was continued with mutual liking between the male fellow-travellers.\nMeanwhile Gwendolen sat by like one who had visited the spirit-world and whose experience threw a strange unreality over all worldly talk; and Mrs. Davilow was chiefly occupied in imagining what her daughter was feeling, and in wondering whether she would accept her husband's bequest.\nGwendolen in fact had a purpose shutting off every other resolution. She wanted again to consult Deronda, so that she might secure herself against any act he would disapprove. Would her remorse have maintained its power within her, if it had not been for that conscience which was made for her by Deronda? His influence had begun with what she had felt to be his judgment of her at the gaming-table.\nBut Gwendolen did not know his address, and her only way of reaching him was through Sir Hugo. She knew the construction that might be put on her seeking out Deronda; but she would not let go of her dependence. When she was in Park Lane and knew that the baronet was about to go down to the Abbey, she said to him without hesitation, while her mother was present-\n\"Sir Hugo, I wish to see Mr. Deronda again as soon as possible. Will you let him know that I want to see him?\"\nA quick thought passed across Sir Hugo's face, but he said easily, \"Upon my word, I don't know whether he's at his chambers or the Abbey at this moment. But I'll send a note to his chambers, and if he's at the Abbey I can give him your message and send him up. I am sure he will want to obey your wish.\"\nThe baronet spoke with grave kindness, as if nothing could seem more appropriate. But he was convinced that Gwendolen had a passionate attachment to Deronda, and thinking that this might lead her into imprudences, he was determined to screen her as far as lay in his power. To him it was a pretty story that this fine creature and his favourite Dan should have turned out to be formed for each other, and that the unsuitable husband should have made his exit in such excellent time. In truth, what most vexed his mind was a doubt whether Dan had not got some scheme or other in his head, which would prove to be dearer to him than the lovely Mrs. Grandcourt, and put that neatly-prepared marriage with her out of the question.\nOf course all this thinking on Sir Hugo's part was premature, only a fortnight after Grandcourt's death. But it is the trick of thinking to be either premature or behind-hand.\nHowever, he sent the note to Deronda's chambers, and it found him there.",
        "paragraph_chars": [
            [
                0,
                191
            ],
            [
                191,
                327
            ],
            [
                327,
                725
            ],
            [
                725,
                893
            ],
            [
                893,
                933
            ],
            [
                933,
                1079
            ],
            [
                1079,
                1108
            ],
            [
                1108,
                1323
            ],
            [
                1323,
                1408
            ],
            [
                1408,
                1542
            ],
            [
                1542,
                1589
            ],
            [
                1589,
                1643
            ],
            [
                1643,
                1844
            ],
            [
                1844,
                1944
            ],
            [
                1944,
                1982
            ],
            [
                1982,
                1994
            ],
            [
                1994,
                2097
            ],
            [
                2097,
                2211
            ],
            [
                2211,
                2498
            ],
            [
                2498,
                2787
            ],
            [
                2787,
                2965
            ],
            [
                2965,
                3358
            ],
            [
                3358,
                3866
            ],
            [
                3866,
                4399
            ],
            [
                4399,
                4518
            ],
            [
                4518,
                4584
            ],
            [
                4584,
                4702
            ],
            [
                4702,
                4971
            ],
            [
                4971,
                5085
            ],
            [
                5085,
                5240
            ],
            [
                5240,
                5784
            ],
            [
                5784,
                6041
            ],
            [
                6041,
                6295
            ],
            [
                6295,
                6799
            ],
            [
                6799,
                6869
            ],
            [
                6869,
                6941
            ],
            [
                6941,
                7019
            ],
            [
                7019,
                7139
            ],
            [
                7139,
                7923
            ],
            [
                7923,
                8299
            ],
            [
                8299,
                8585
            ],
            [
                8585,
                8985
            ],
            [
                8985,
                9349
            ],
            [
                9349,
                9460
            ],
            [
                9460,
                9764
            ],
            [
                9764,
                10491
            ],
            [
                10491,
                10667
            ],
            [
                10667,
                10739
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                128
            ],
            [
                128,
                191
            ],
            [
                191,
                327
            ],
            [
                327,
                503
            ],
            [
                503,
                725
            ],
            [
                725,
                749
            ],
            [
                749,
                828
            ],
            [
                828,
                893
            ],
            [
                893,
                933
            ],
            [
                933,
                987
            ],
            [
                987,
                1015
            ],
            [
                1015,
                1079
            ],
            [
                1079,
                1108
            ],
            [
                1108,
                1151
            ],
            [
                1151,
                1177
            ],
            [
                1177,
                1215
            ],
            [
                1215,
                1255
            ],
            [
                1255,
                1278
            ],
            [
                1278,
                1323
            ],
            [
                1323,
                1408
            ],
            [
                1408,
                1542
            ],
            [
                1542,
                1589
            ],
            [
                1589,
                1643
            ],
            [
                1643,
                1721
            ],
            [
                1721,
                1764
            ],
            [
                1764,
                1844
            ],
            [
                1844,
                1918
            ],
            [
                1918,
                1944
            ],
            [
                1944,
                1982
            ],
            [
                1982,
                1994
            ],
            [
                1994,
                2036
            ],
            [
                2036,
                2097
            ],
            [
                2097,
                2118
            ],
            [
                2118,
                2211
            ],
            [
                2211,
                2334
            ],
            [
                2334,
                2498
            ],
            [
                2498,
                2729
            ],
            [
                2729,
                2787
            ],
            [
                2787,
                2873
            ],
            [
                2873,
                2965
            ],
            [
                2965,
                3125
            ],
            [
                3125,
                3173
            ],
            [
                3173,
                3257
            ],
            [
                3257,
                3301
            ],
            [
                3301,
                3358
            ],
            [
                3358,
                3548
            ],
            [
                3548,
                3768
            ],
            [
                3768,
                3866
            ],
            [
                3866,
                3969
            ],
            [
                3969,
                4216
            ],
            [
                4216,
                4351
            ],
            [
                4351,
                4399
            ],
            [
                4399,
                4518
            ],
            [
                4518,
                4584
            ],
            [
                4584,
                4624
            ],
            [
                4624,
                4702
            ],
            [
                4702,
                4762
            ],
            [
                4762,
                4810
            ],
            [
                4810,
                4923
            ],
            [
                4923,
                4971
            ],
            [
                4971,
                4997
            ],
            [
                4997,
                5085
            ],
            [
                5085,
                5153
            ],
            [
                5153,
                5173
            ],
            [
                5173,
                5240
            ],
            [
                5240,
                5263
            ],
            [
                5263,
                5416
            ],
            [
                5416,
                5582
            ],
            [
                5582,
                5697
            ],
            [
                5697,
                5760
            ],
            [
                5760,
                5784
            ],
            [
                5784,
                5938
            ],
            [
                5938,
                6041
            ],
            [
                6041,
                6142
            ],
            [
                6142,
                6190
            ],
            [
                6190,
                6295
            ],
            [
                6295,
                6379
            ],
            [
                6379,
                6535
            ],
            [
                6535,
                6799
            ],
            [
                6799,
                6869
            ],
            [
                6869,
                6921
            ],
            [
                6921,
                6941
            ],
            [
                6941,
                6979
            ],
            [
                6979,
                7019
            ],
            [
                7019,
                7084
            ],
            [
                7084,
                7139
            ],
            [
                7139,
                7321
            ],
            [
                7321,
                7617
            ],
            [
                7617,
                7811
            ],
            [
                7811,
                7923
            ],
            [
                7923,
                7996
            ],
            [
                7996,
                8058
            ],
            [
                8058,
                8206
            ],
            [
                8206,
                8299
            ],
            [
                8299,
                8585
            ],
            [
                8585,
                8654
            ],
            [
                8654,
                8761
            ],
            [
                8761,
                8891
            ],
            [
                8891,
                8985
            ],
            [
                8985,
                9080
            ],
            [
                9080,
                9196
            ],
            [
                9196,
                9349
            ],
            [
                9349,
                9413
            ],
            [
                9413,
                9460
            ],
            [
                9460,
                9613
            ],
            [
                9613,
                9721
            ],
            [
                9721,
                9764
            ],
            [
                9764,
                9846
            ],
            [
                9846,
                10038
            ],
            [
                10038,
                10247
            ],
            [
                10247,
                10491
            ],
            [
                10491,
                10596
            ],
            [
                10596,
                10667
            ],
            [
                10667,
                10739
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                16,
                19
            ],
            [
                20,
                46
            ],
            [
                47,
                73
            ],
            [
                73,
                75
            ],
            [
                75,
                97
            ],
            [
                98,
                126
            ],
            [
                126,
                128
            ],
            [
                128,
                131
            ],
            [
                141,
                143
            ],
            [
                144,
                147
            ],
            [
                163,
                169
            ],
            [
                170,
                175
            ],
            [
                176,
                189
            ],
            [
                191,
                243
            ],
            [
                248,
                252
            ],
            [
                253,
                325
            ],
            [
                325,
                327
            ],
            [
                327,
                425
            ],
            [
                426,
                503
            ],
            [
                503,
                725
            ],
            [
                725,
                749
            ],
            [
                749,
                792
            ],
            [
                792,
                793
            ],
            [
                794,
                800
            ],
            [
                801,
                804
            ],
            [
                805,
                811
            ],
            [
                818,
                826
            ],
            [
                826,
                827
            ],
            [
                828,
                890
            ],
            [
                893,
                933
            ],
            [
                933,
                987
            ],
            [
                987,
                1015
            ],
            [
                1015,
                1016
            ],
            [
                1016,
                1025
            ],
            [
                1026,
                1043
            ],
            [
                1050,
                1054
            ],
            [
                1055,
                1079
            ],
            [
                1079,
                1108
            ],
            [
                1108,
                1151
            ],
            [
                1151,
                1177
            ],
            [
                1177,
                1215
            ],
            [
                1215,
                1241
            ],
            [
                1246,
                1253
            ],
            [
                1253,
                1255
            ],
            [
                1255,
                1278
            ],
            [
                1278,
                1320
            ],
            [
                1323,
                1370
            ],
            [
                1379,
                1408
            ],
            [
                1408,
                1469
            ],
            [
                1471,
                1542
            ],
            [
                1542,
                1589
            ],
            [
                1589,
                1601
            ],
            [
                1602,
                1643
            ],
            [
                1643,
                1707
            ],
            [
                1708,
                1721
            ],
            [
                1721,
                1764
            ],
            [
                1764,
                1815
            ],
            [
                1830,
                1841
            ],
            [
                1841,
                1844
            ],
            [
                1844,
                1918
            ],
            [
                1918,
                1942
            ],
            [
                1944,
                1982
            ],
            [
                1982,
                1991
            ],
            [
                1991,
                1994
            ],
            [
                1994,
                2036
            ],
            [
                2036,
                2097
            ],
            [
                2097,
                2116
            ],
            [
                2116,
                2118
            ],
            [
                2118,
                2154
            ],
            [
                2155,
                2184
            ],
            [
                2185,
                2209
            ],
            [
                2209,
                2211
            ],
            [
                2211,
                2214
            ],
            [
                2225,
                2288
            ],
            [
                2289,
                2291
            ],
            [
                2296,
                2309
            ],
            [
                2309,
                2310
            ],
            [
                2319,
                2332
            ],
            [
                2332,
                2334
            ],
            [
                2334,
                2358
            ],
            [
                2359,
                2369
            ],
            [
                2375,
                2377
            ],
            [
                2383,
                2393
            ],
            [
                2394,
                2449
            ],
            [
                2450,
                2486
            ],
            [
                2496,
                2497
            ],
            [
                2498,
                2559
            ],
            [
                2560,
                2640
            ],
            [
                2641,
                2642
            ],
            [
                2654,
                2674
            ],
            [
                2675,
                2727
            ],
            [
                2727,
                2729
            ],
            [
                2736,
                2737
            ],
            [
                2738,
                2748
            ],
            [
                2757,
                2762
            ],
            [
                2763,
                2771
            ],
            [
                2771,
                2776
            ],
            [
                2787,
                2873
            ],
            [
                2873,
                2964
            ],
            [
                2965,
                3125
            ],
            [
                3125,
                3173
            ],
            [
                3173,
                3176
            ],
            [
                3177,
                3255
            ],
            [
                3255,
                3257
            ],
            [
                3257,
                3301
            ],
            [
                3301,
                3358
            ],
            [
                3358,
                3548
            ],
            [
                3548,
                3604
            ],
            [
                3604,
                3609
            ],
            [
                3610,
                3616
            ],
            [
                3617,
                3618
            ],
            [
                3619,
                3631
            ],
            [
                3632,
                3713
            ],
            [
                3714,
                3768
            ],
            [
                3768,
                3779
            ],
            [
                3795,
                3797
            ],
            [
                3798,
                3811
            ],
            [
                3812,
                3821
            ],
            [
                3822,
                3838
            ],
            [
                3839,
                3842
            ],
            [
                3847,
                3854
            ],
            [
                3855,
                3864
            ],
            [
                3864,
                3865
            ],
            [
                3866,
                3967
            ],
            [
                3967,
                3969
            ],
            [
                3969,
                4094
            ],
            [
                4094,
                4119
            ],
            [
                4120,
                4216
            ],
            [
                4216,
                4227
            ],
            [
                4228,
                4232
            ],
            [
                4233,
                4242
            ],
            [
                4243,
                4248
            ],
            [
                4257,
                4259
            ],
            [
                4264,
                4296
            ],
            [
                4300,
                4304
            ],
            [
                4305,
                4308
            ],
            [
                4315,
                4330
            ],
            [
                4335,
                4351
            ],
            [
                4351,
                4399
            ],
            [
                4399,
                4484
            ],
            [
                4484,
                4515
            ],
            [
                4515,
                4518
            ],
            [
                4518,
                4582
            ],
            [
                4584,
                4624
            ],
            [
                4628,
                4702
            ],
            [
                4702,
                4762
            ],
            [
                4762,
                4808
            ],
            [
                4808,
                4810
            ],
            [
                4810,
                4923
            ],
            [
                4923,
                4971
            ],
            [
                4971,
                4994
            ],
            [
                4997,
                5016
            ],
            [
                5016,
                5064
            ],
            [
                5065,
                5085
            ],
            [
                5085,
                5153
            ],
            [
                5153,
                5173
            ],
            [
                5173,
                5240
            ],
            [
                5240,
                5261
            ],
            [
                5261,
                5263
            ],
            [
                5263,
                5350
            ],
            [
                5350,
                5351
            ],
            [
                5362,
                5414
            ],
            [
                5414,
                5416
            ],
            [
                5416,
                5514
            ],
            [
                5515,
                5519
            ],
            [
                5520,
                5526
            ],
            [
                5528,
                5550
            ],
            [
                5550,
                5581
            ],
            [
                5587,
                5603
            ],
            [
                5606,
                5607
            ],
            [
                5608,
                5697
            ],
            [
                5697,
                5700
            ],
            [
                5701,
                5760
            ],
            [
                5760,
                5784
            ],
            [
                5784,
                5797
            ],
            [
                5810,
                5876
            ],
            [
                5879,
                5903
            ],
            [
                5911,
                5938
            ],
            [
                5938,
                6041
            ],
            [
                6045,
                6049
            ],
            [
                6075,
                6091
            ],
            [
                6092,
                6105
            ],
            [
                6106,
                6108
            ],
            [
                6118,
                6128
            ],
            [
                6134,
                6140
            ],
            [
                6140,
                6142
            ],
            [
                6142,
                6171
            ],
            [
                6182,
                6188
            ],
            [
                6188,
                6190
            ],
            [
                6190,
                6262
            ],
            [
                6269,
                6273
            ],
            [
                6274,
                6286
            ],
            [
                6287,
                6289
            ],
            [
                6290,
                6293
            ],
            [
                6293,
                6294
            ],
            [
                6295,
                6323
            ],
            [
                6324,
                6340
            ],
            [
                6341,
                6377
            ],
            [
                6377,
                6379
            ],
            [
                6382,
                6407
            ],
            [
                6416,
                6420
            ],
            [
                6429,
                6470
            ],
            [
                6470,
                6535
            ],
            [
                6535,
                6548
            ],
            [
                6549,
                6580
            ],
            [
                6592,
                6661
            ],
            [
                6662,
                6703
            ],
            [
                6703,
                6753
            ],
            [
                6754,
                6797
            ],
            [
                6797,
                6799
            ],
            [
                6800,
                6857
            ],
            [
                6867,
                6868
            ],
            [
                6869,
                6921
            ],
            [
                6921,
                6941
            ],
            [
                6941,
                6979
            ],
            [
                6980,
                7019
            ],
            [
                7019,
                7084
            ],
            [
                7084,
                7085
            ],
            [
                7087,
                7095
            ],
            [
                7102,
                7110
            ],
            [
                7111,
                7113
            ],
            [
                7114,
                7117
            ],
            [
                7118,
                7121
            ],
            [
                7128,
                7136
            ],
            [
                7139,
                7197
            ],
            [
                7203,
                7207
            ],
            [
                7216,
                7321
            ],
            [
                7321,
                7365
            ],
            [
                7366,
                7372
            ],
            [
                7372,
                7556
            ],
            [
                7562,
                7566
            ],
            [
                7567,
                7578
            ],
            [
                7594,
                7595
            ],
            [
                7596,
                7615
            ],
            [
                7615,
                7617
            ],
            [
                7617,
                7628
            ],
            [
                7634,
                7688
            ],
            [
                7689,
                7722
            ],
            [
                7723,
                7747
            ],
            [
                7747,
                7786
            ],
            [
                7787,
                7811
            ],
            [
                7811,
                7874
            ],
            [
                7875,
                7879
            ],
            [
                7879,
                7921
            ],
            [
                7921,
                7923
            ],
            [
                7930,
                7931
            ],
            [
                7932,
                7941
            ],
            [
                7942,
                7949
            ],
            [
                7950,
                7977
            ],
            [
                7978,
                7981
            ],
            [
                7982,
                7994
            ],
            [
                7994,
                7996
            ],
            [
                7996,
                8027
            ],
            [
                8036,
                8041
            ],
            [
                8056,
                8058
            ],
            [
                8062,
                8066
            ],
            [
                8076,
                8113
            ],
            [
                8114,
                8120
            ],
            [
                8121,
                8139
            ],
            [
                8140,
                8142
            ],
            [
                8143,
                8149
            ],
            [
                8149,
                8206
            ],
            [
                8206,
                8243
            ],
            [
                8244,
                8299
            ],
            [
                8299,
                8371
            ],
            [
                8378,
                8388
            ],
            [
                8389,
                8423
            ],
            [
                8432,
                8436
            ],
            [
                8436,
                8536
            ],
            [
                8537,
                8584
            ],
            [
                8585,
                8606
            ],
            [
                8609,
                8654
            ],
            [
                8654,
                8673
            ],
            [
                8674,
                8690
            ],
            [
                8694,
                8761
            ],
            [
                8761,
                8816
            ],
            [
                8817,
                8844
            ],
            [
                8845,
                8891
            ],
            [
                8891,
                8894
            ],
            [
                8905,
                8984
            ],
            [
                8985,
                8998
            ],
            [
                9012,
                9023
            ],
            [
                9023,
                9080
            ],
            [
                9080,
                9083
            ],
            [
                9089,
                9110
            ],
            [
                9111,
                9116
            ],
            [
                9120,
                9130
            ],
            [
                9131,
                9138
            ],
            [
                9143,
                9150
            ],
            [
                9152,
                9155
            ],
            [
                9156,
                9165
            ],
            [
                9166,
                9169
            ],
            [
                9170,
                9176
            ],
            [
                9177,
                9183
            ],
            [
                9184,
                9194
            ],
            [
                9194,
                9196
            ],
            [
                9196,
                9247
            ],
            [
                9258,
                9260
            ],
            [
                9264,
                9281
            ],
            [
                9281,
                9282
            ],
            [
                9283,
                9306
            ],
            [
                9307,
                9347
            ],
            [
                9349,
                9413
            ],
            [
                9413,
                9421
            ],
            [
                9422,
                9460
            ],
            [
                9460,
                9510
            ],
            [
                9511,
                9518
            ],
            [
                9525,
                9613
            ],
            [
                9617,
                9633
            ],
            [
                9634,
                9649
            ],
            [
                9649,
                9719
            ],
            [
                9719,
                9721
            ],
            [
                9721,
                9761
            ],
            [
                9764,
                9775
            ],
            [
                9782,
                9827
            ],
            [
                9828,
                9832
            ],
            [
                9833,
                9844
            ],
            [
                9844,
                9845
            ],
            [
                9846,
                9921
            ],
            [
                9922,
                9925
            ],
            [
                9935,
                9939
            ],
            [
                9951,
                9976
            ],
            [
                9976,
                9977
            ],
            [
                9981,
                10005
            ],
            [
                10006,
                10038
            ],
            [
                10038,
                10051
            ],
            [
                10052,
                10053
            ],
            [
                10054,
                10060
            ],
            [
                10061,
                10066
            ],
            [
                10067,
                10098
            ],
            [
                10109,
                10247
            ],
            [
                10247,
                10281
            ],
            [
                10282,
                10301
            ],
            [
                10302,
                10490
            ],
            [
                10491,
                10541
            ],
            [
                10542,
                10569
            ],
            [
                10570,
                10596
            ],
            [
                10596,
                10667
            ],
            [
                10667,
                10739
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                75
            ],
            [
                75,
                128
            ],
            [
                128,
                191
            ],
            [
                191,
                327
            ],
            [
                327,
                503
            ],
            [
                503,
                725
            ],
            [
                725,
                749
            ],
            [
                749,
                893
            ],
            [
                893,
                933
            ],
            [
                933,
                987
            ],
            [
                987,
                1015
            ],
            [
                1015,
                1079
            ],
            [
                1079,
                1108
            ],
            [
                1108,
                1151
            ],
            [
                1151,
                1177
            ],
            [
                1177,
                1215
            ],
            [
                1215,
                1255
            ],
            [
                1255,
                1278
            ],
            [
                1278,
                1323
            ],
            [
                1323,
                1408
            ],
            [
                1408,
                1542
            ],
            [
                1542,
                1589
            ],
            [
                1589,
                1643
            ],
            [
                1643,
                1721
            ],
            [
                1721,
                1764
            ],
            [
                1764,
                1844
            ],
            [
                1844,
                1918
            ],
            [
                1918,
                1944
            ],
            [
                1944,
                1982
            ],
            [
                1982,
                1994
            ],
            [
                1994,
                2036
            ],
            [
                2036,
                2097
            ],
            [
                2097,
                2118
            ],
            [
                2118,
                2211
            ],
            [
                2211,
                2334
            ],
            [
                2334,
                2498
            ],
            [
                2498,
                2498
            ],
            [
                2498,
                2498
            ],
            [
                2498,
                2729
            ],
            [
                2729,
                2787
            ],
            [
                2787,
                2873
            ],
            [
                2873,
                2965
            ],
            [
                2965,
                2965
            ],
            [
                2965,
                2965
            ],
            [
                2965,
                3125
            ],
            [
                3125,
                3125
            ],
            [
                3125,
                3125
            ],
            [
                3125,
                3125
            ],
            [
                3125,
                3125
            ],
            [
                3125,
                3173
            ],
            [
                3173,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3257
            ],
            [
                3257,
                3301
            ],
            [
                3301,
                3358
            ],
            [
                3358,
                3548
            ],
            [
                3548,
                3768
            ],
            [
                3768,
                3866
            ],
            [
                3866,
                3969
            ],
            [
                3969,
                4216
            ],
            [
                4216,
                4351
            ],
            [
                4351,
                4399
            ],
            [
                4399,
                4518
            ],
            [
                4518,
                4518
            ],
            [
                4518,
                4584
            ],
            [
                4584,
                4624
            ],
            [
                4624,
                4624
            ],
            [
                4624,
                4624
            ],
            [
                4624,
                4702
            ],
            [
                4702,
                4762
            ],
            [
                4762,
                4810
            ],
            [
                4810,
                4923
            ],
            [
                4923,
                4971
            ],
            [
                4971,
                4997
            ],
            [
                4997,
                4997
            ],
            [
                4997,
                5085
            ],
            [
                5085,
                5153
            ],
            [
                5153,
                5173
            ],
            [
                5173,
                5240
            ],
            [
                5240,
                5263
            ],
            [
                5263,
                5416
            ],
            [
                5416,
                5582
            ],
            [
                5582,
                5697
            ],
            [
                5697,
                5760
            ],
            [
                5760,
                5784
            ],
            [
                5784,
                5938
            ],
            [
                5938,
                6041
            ],
            [
                6041,
                6142
            ],
            [
                6142,
                6142
            ],
            [
                6142,
                6190
            ],
            [
                6190,
                6295
            ],
            [
                6295,
                6379
            ],
            [
                6379,
                6379
            ],
            [
                6379,
                6535
            ],
            [
                6535,
                6799
            ],
            [
                6799,
                6799
            ],
            [
                6799,
                6799
            ],
            [
                6799,
                6869
            ],
            [
                6869,
                6869
            ],
            [
                6869,
                6921
            ],
            [
                6921,
                6941
            ],
            [
                6941,
                6979
            ],
            [
                6979,
                6979
            ],
            [
                6979,
                7019
            ],
            [
                7019,
                7084
            ],
            [
                7084,
                7139
            ],
            [
                7139,
                7139
            ],
            [
                7139,
                7139
            ],
            [
                7139,
                7139
            ],
            [
                7139,
                7139
            ],
            [
                7139,
                7321
            ],
            [
                7321,
                7617
            ],
            [
                7617,
                7811
            ],
            [
                7811,
                7923
            ],
            [
                7923,
                7996
            ],
            [
                7996,
                7996
            ],
            [
                7996,
                7996
            ],
            [
                7996,
                8058
            ],
            [
                8058,
                8206
            ],
            [
                8206,
                8299
            ],
            [
                8299,
                8585
            ],
            [
                8585,
                8654
            ],
            [
                8654,
                8654
            ],
            [
                8654,
                8761
            ],
            [
                8761,
                8891
            ],
            [
                8891,
                8891
            ],
            [
                8891,
                8985
            ],
            [
                8985,
                8985
            ],
            [
                8985,
                8985
            ],
            [
                8985,
                9080
            ],
            [
                9080,
                9196
            ],
            [
                9196,
                9349
            ],
            [
                9349,
                9413
            ],
            [
                9413,
                9413
            ],
            [
                9413,
                9460
            ],
            [
                9460,
                9613
            ],
            [
                9613,
                9613
            ],
            [
                9613,
                9721
            ],
            [
                9721,
                9846
            ],
            [
                9846,
                10038
            ],
            [
                10038,
                10247
            ],
            [
                10247,
                10247
            ],
            [
                10247,
                10491
            ],
            [
                10491,
                10491
            ],
            [
                10491,
                10596
            ],
            [
                10596,
                10667
            ],
            [
                10667,
                10739
            ]
        ]
    }
}