{
    "original": {
        "text": "\"O, welcome, pure-eyed Faith, white-handed Hope, Thou hovering angel, girt with golden wings!\" --MILTON.\nDeronda did not obey Gwendolen's new summons without some agitation. Not his vanity, but his keen sympathy made him susceptible to the danger that another's heart might feel larger demands on him than he would be able to fulfill; and it was no longer a matter of argument with him, but of penetrating consciousness, that Gwendolen's soul clung to his with a passionate need. We do not argue the existence of the anger or the scorn that thrills through us in a voice; we simply feel it, and it admits of no disproof. Deronda felt this woman's destiny hanging on his over a precipice of despair. Any one who knows him cannot wonder at his inward confession, that if all this had happened little more than a year ago, he would hardly have asked himself whether he loved her; the impetuous determining impulse which would have moved him would have been to save her from sorrow, to shelter her life forevermore from the dangers of loneliness, and carry out to the last the rescue he had begun in that monitory redemption of the necklace. But now, love and duty had thrown other bonds around him, and that impulse could no longer determine his life; still, it was present in him as a compassionate yearning, a painful quivering at the very imagination of having again and again to meet the appeal of her eyes and words. The very strength of the bond, the certainty of the resolve, that kept him asunder from her, made him gaze at her lot apart with the more aching pity.\nHe awaited her coming in the back drawing-room--part of that white and crimson space where they had sat together at the musical party, where Gwendolen had said for the first time that her lot depended on his not forsaking her, and her appeal had seemed to melt into the melodic cry--_Per piet non dirmi addio_. But the melody had come from Mirah's dear voice.\nDeronda walked about this room, which he had for years known by heart, with a strange sense of metamorphosis in his own life. The familiar objects around him, from Lady Mallinger's gently smiling portrait to the also human and urbane faces of the lions on the pilasters of the chimney-piece, seemed almost to belong to a previous state of existence which he was revisiting in memory only, not in reality; so deep and transforming had been the impressions he had lately experienced, so new were the conditions under which he found himself in the house he had been accustomed to think of as a home--standing with his hat in his hand awaiting the entrance of a young creature whose life had also been undergoing a transformation--a tragic transformation toward a wavering result, in which he felt with apprehensiveness that his own action was still bound up.\nBut Gwendolen was come in, looking changed; not only by her mourning dress, but by a more satisfied quietude of expression than he had seen in her face at Genoa. Her satisfaction was that Deronda was there; but there was no smile between them as they met and clasped hands; each was full of remembrance--full of anxious prevision. She said, \"It was good of you to come. Let us sit down,\" immediately seating herself in the nearest chair. He placed himself opposite to her.\n\"I asked you to come because I want you to tell me what I ought to do,\" she began, at once. \"Don't be afraid of telling me what you think is right, because it seems hard. I have made up my mind to do it. I was afraid once of being poor; I could not bear to think of being under other people; and that was why I did something--why I married. I have borne worse things now. I think I could bear to be poor, if you think I ought. Do you know about my husband's will?\"\n\"Yes, Sir Hugo told me,\" said Deronda, already guessing the question she had to ask.\n\"Ought I to take anything he has left me? I will tell you what I have been thinking,\" said Gwendolen, with a more nervous eagerness. \"Perhaps you may not quite know that I really did think a good deal about my mother when I married. I _was_ selfish, but I did love her, and feel about her poverty; and what comforted me most at first, when I was miserable, was her being better off because I had married. The thing that would be hardest to me now would be to see her in poverty again; and I have been thinking that if I took enough to provide for her, and no more--nothing for myself--it would not be wrong; for I was very precious to my mother--and he took me from her--and he meant--and if she had known--\"\nGwendolen broke off. She had been preparing herself for this interview by thinking of hardly anything else than this question of right toward her mother; but the question had carried with it thoughts and reasons which it was impossible for her to utter, and these perilous remembrances swarmed between her words, making her speech more and more agitated and tremulous. She looked down helplessly at her hands, now unladen of all rings except her wedding-ring.\n\"Do not hurt yourself by speaking of that,\" said Deronda, tenderly. \"There is no need; the case is very simple. I think I can hardly judge wrongly about it. You consult me because I am the only person to whom you have confided the most painful part of your experience: and I can understand your scruples.\" He did not go on immediately, waiting for her to recover herself. The silence seemed to Gwendolen full of the tenderness that she heard in his voice, and she had courage to lift up her eyes and look at him as he said, \"You are conscious of something which you feel to be a crime toward one who is dead. You think that you have forfeited all claim as a wife. You shrink from taking what was his. You want to keep yourself from profiting by his death. Your feeling even urges you to some self-punishment--some scourging of the self that disobeyed your better will--the will that struggled against temptation. I have known something of that myself. Do I understand you?\"\n\"Yes--at least, I want to be good--not like what I have been,\" said Gwendolen. \"I will try to bear what you think I ought to bear. I have tried to tell you the worst about myself. What ought I to do?\"\n\"If no one but yourself were concerned in this question of income,\" said Deronda, \"I should hardly dare to urge you against any remorseful prompting; but I take as a guide now, your feeling about Mrs. Davilow, which seems to me quite just. I cannot think that your husband's dues even to yourself are nullified by any act you have committed. He voluntarily entered into your life, and affected its course in what is always the most momentous way. But setting that aside, it was due from him in his position that he should provide for your mother, and he of course understood that if this will took effect she would share the provision he had made for you.\"\n\"She has had eight hundred a year. What I thought of was to take that and leave the rest,\" said Gwendolen. She had been so long inwardly arguing for this as a permission, that her mind could not at once take another attitude.\n\"I think it is not your duty to fix a limit in that way,\" said Deronda. \"You would be making a painful enigma for Mrs. Davilow; an income from which you shut yourself out must be embittered to her. And your own course would become too difficult. We agreed at Genoa that the burden on your conscience is one what no one ought to be admitted to the knowledge of. The future beneficence of your life will be best furthered by your saving all others from the pain of that knowledge. In my opinion you ought simply to abide by the provisions of your husband's will, and let your remorse tell only on the use that you will make of your monetary independence.\"\nIn uttering the last sentence Deronda automatically took up his hat which he had laid on the floor beside him. Gwendolen, sensitive to his slightest movement, felt her heart giving a great leap, as if it too had a consciousness of its own, and would hinder him from going: in the same moment she rose from her chair, unable to reflect that the movement was an acceptance of his apparent intention to leave her; and Deronda, of course, also rose, advancing a little.\n\"I will do what you tell me,\" said Gwendolen, hurriedly; \"but what else shall I do?\" No other than these simple words were possible to her; and even these were too much for her in a state of emotion where her proud secrecy was disenthroned: as the child-like sentences fell from her lips they re-acted on her like a picture of her own helplessness, and she could not check the sob which sent the large tears to her eyes. Deronda, too, felt a crushing pain; but imminent consequences were visible to him, and urged him to the utmost exertion of conscience. When she had pressed her tears away, he said, in a gently questioning tone,\n\"You will probably be soon going with Mrs. Davilow into the country.\"\n\"Yes, in a week or ten days.\" Gwendolen waited an instant, turning her eyes vaguely toward the window, as if looking at some imagined prospect. \"I want to be kind to them all--they can be happier than I can. Is that the best I can do?\"\n\"I think so. It is a duty that cannot be doubtful,\" said Deronda. He paused a little between his sentences, feeling a weight of anxiety on all his words. \"Other duties will spring from it. Looking at your life as a debt may seem the dreariest view of things at a distance; but it cannot really be so. What makes life dreary is the want of motive: but once beginning to act with that penitential, loving purpose you have in your mind, there will be unexpected satisfactions--there will be newly-opening needs--continually coming to carry you on from day to day. You will find your life growing like a plant.\"\nGwendolen turned her eyes on him with the look of one athirst toward the sound of unseen waters. Deronda felt the look as if she had been stretching her arms toward him from a forsaken shore. His voice took an affectionate imploringness when he said,\n\"This sorrow, which has cut down to the root, has come to you while you are so young--try to think of it not as a spoiling of your life, but as a preparation for it. Let it be a preparation----\" Any one overhearing his tones would have thought he was entreating for his own happiness. \"See! you have been saved from the worst evils that might have come from your marriage, which you feel was wrong. You have had a vision of injurious, selfish action--a vision of possible degradation; think that a severe angel, seeing you along the road of error, grasped you by the wrist and showed you the horror of the life you must avoid. And it has come to you in your spring-time. Think of it as a preparation. You can, you will, be among the best of women, such as make others glad that they were born.\"\nThe words were like the touch of a miraculous hand to Gwendolen. Mingled emotions streamed through her frame with a strength that seemed the beginning of a new existence, having some new power or other which stirred in her vaguely. So pregnant is the divine hope of moral recovery with the energy that fulfills it. So potent in us is the infused action of another soul, before which we bow in complete love. But the new existence seemed inseparable from Deronda: the hope seemed to make his presence permanent. It was not her thought, that he loved her, and would cling to her--a thought would have tottered with improbability; it was her spiritual breath. For the first time since that terrible moment on the sea a flush rose and spread over her cheek, brow and neck, deepened an instant or two, and then gradually disappeared. She did not speak.\nDeronda advanced and put out his hand, saying, \"I must not weary you.\"\nShe was startled by the sense that he was going, and put her hand in his, still without speaking.\n\"You look ill yet--unlike yourself,\" he added, while he held her hand.\n\"I can't sleep much,\" she answered, with some return of her dispirited manner. \"Things repeat themselves in me so. They come back--they will all come back,\" she ended, shudderingly, a chill fear threatening her.\n\"By degrees they will be less insistent,\" said Deronda. He could not drop her hand or move away from her abruptly.\n\"Sir Hugo says he shall come to stay at Diplow,\" said Gwendolen, snatching at previously intended words which had slipped away from her. \"You will come too.\"\n\"Probably,\" said Deronda, and then feeling that the word was cold, he added, correctively, \"Yes, I shall come,\" and then released her hand, with the final friendly pressure of one who has virtually said good-bye.\n\"And not again here, before I leave town?\" said Gwendolen, with timid sadness, looking as pallid as ever.\nWhat could Deronda say? \"If I can be of any use--if you wish me--certainly I will.\"\n\"I must wish it,\" said Gwendolen, impetuously; \"you know I must wish it. What strength have I? Who else is there?\" Again a sob was rising.\nDeronda felt a pang, which showed itself in his face. He looked miserable as he said, \"I will certainly come.\"\nGwendolen perceived the change in his face; but the intense relief of expecting him to come again could not give way to any other feeling, and there was a recovery of the inspired hope and courage in her.\n\"Don't be unhappy about me,\" she said, in a tone of affectionate assurance. \"I shall remember your words--every one of them. I shall remember what you believe about me; I shall try.\"\nShe looked at him firmly, and put out her hand again as if she had forgotten what had passed since those words of his which she promised to remember. But there was no approach to a smile on her lips. She had never smiled since her husband's death. When she stood still and in silence, she looked like a melancholy statue of the Gwendolen whose laughter had once been so ready when others were grave.\nIt is only by remembering the searching anguish which had changed the aspect of the world for her that we can understand her behavior to Deronda--the unreflecting openness, nay, the importunate pleading, with which she expressed her dependence on him. Considerations such as would have filled the minds of indifferent spectators could not occur to her, any more than if flames had been mounting around her, and she had flung herself into his open arms and clung about his neck that he might carry her into safety. She identified him with the struggling regenerative process in her which had begun with his action. Is it any wonder that she saw her own necessity reflected in his feeling? She was in that state of unconscious reliance and expectation which is a common experience with us when we are preoccupied with our own trouble or our own purposes. We diffuse our feeling over others, and count on their acting from our motives. Her imagination had not been turned to a future union with Deronda by any other than the spiritual tie which had been continually strengthening; but also it had not been turned toward a future separation from him. Love-making and marriage--how could they now be the imagery in which poor Gwendolen's deepest attachment could spontaneously clothe itself? Mighty Love had laid his hand upon her; but what had he demanded of her? Acceptance of rebuke--the hard task of self-change--confession--endurance. If she cried toward him, what then? She cried as the child cries whose little feet have fallen backward--cried to be taken by the hand, lest she should lose herself.\nThe cry pierced Deronda. What position could have been more difficult for a man full of tenderness, yet with clear foresight? He was the only creature who knew the real nature of Gwendolen's trouble: to withdraw himself from any appeal of hers would be to consign her to a dangerous loneliness. He could not reconcile himself to the cruelty of apparently rejecting her dependence on him; and yet in the nearer or farther distance he saw a coming wrench, which all present strengthening of their bond would make the harder.\nHe was obliged to risk that. He went once and again to Park Lane before Gwendolen left; but their interviews were in the presence of Mrs. Davilow, and were therefore less agitating. Gwendolen, since she had determined to accept her income, had conceived a project which she liked to speak of: it was to place her mother and sisters with herself in Offendene again, and, as she said, piece back her life unto that time when they first went there, and when everything was happiness about her, only she did not know it. The idea had been mentioned to Sir Hugo, who was going to exert himself about the letting of Gadsmere for a rent which would more than pay the rent of Offendene. All this was told to Deronda, who willingly dwelt on a subject that seemed to give some soothing occupation to Gwendolen. He said nothing and she asked nothing, of what chiefly occupied himself. Her mind was fixed on his coming to Diplow before the autumn was over; and she no more thought of the Lapidoths--the little Jewess and her brother--as likely to make a difference in her destiny, than of the fermenting political and social leaven which was making a difference in the history of the world. In fact poor Gwendolen's memory had been stunned, and all outside the lava-lit track of her troubled conscience, and her effort to get deliverance from it, lay for her in dim forgetfulness.",
        "paragraph_chars": [
            [
                0,
                105
            ],
            [
                105,
                1570
            ],
            [
                1570,
                1930
            ],
            [
                1930,
                2786
            ],
            [
                2786,
                3259
            ],
            [
                3259,
                3724
            ],
            [
                3724,
                3809
            ],
            [
                3809,
                4518
            ],
            [
                4518,
                4978
            ],
            [
                4978,
                5952
            ],
            [
                5952,
                6153
            ],
            [
                6153,
                6810
            ],
            [
                6810,
                7036
            ],
            [
                7036,
                7690
            ],
            [
                7690,
                8156
            ],
            [
                8156,
                8788
            ],
            [
                8788,
                8858
            ],
            [
                8858,
                9094
            ],
            [
                9094,
                9702
            ],
            [
                9702,
                9953
            ],
            [
                9953,
                10748
            ],
            [
                10748,
                11596
            ],
            [
                11596,
                11667
            ],
            [
                11667,
                11765
            ],
            [
                11765,
                11836
            ],
            [
                11836,
                12048
            ],
            [
                12048,
                12163
            ],
            [
                12163,
                12321
            ],
            [
                12321,
                12534
            ],
            [
                12534,
                12640
            ],
            [
                12640,
                12724
            ],
            [
                12724,
                12863
            ],
            [
                12863,
                12974
            ],
            [
                12974,
                13179
            ],
            [
                13179,
                13362
            ],
            [
                13362,
                13762
            ],
            [
                13762,
                15363
            ],
            [
                15363,
                15886
            ],
            [
                15886,
                17254
            ]
        ],
        "segment_chars": [
            [
                0,
                95
            ],
            [
                95,
                105
            ],
            [
                105,
                174
            ],
            [
                174,
                480
            ],
            [
                480,
                621
            ],
            [
                621,
                699
            ],
            [
                699,
                1138
            ],
            [
                1138,
                1419
            ],
            [
                1419,
                1570
            ],
            [
                1570,
                1881
            ],
            [
                1881,
                1930
            ],
            [
                1930,
                2056
            ],
            [
                2056,
                2786
            ],
            [
                2786,
                2948
            ],
            [
                2948,
                3117
            ],
            [
                3117,
                3156
            ],
            [
                3156,
                3224
            ],
            [
                3224,
                3259
            ],
            [
                3259,
                3351
            ],
            [
                3351,
                3430
            ],
            [
                3430,
                3463
            ],
            [
                3463,
                3600
            ],
            [
                3600,
                3631
            ],
            [
                3631,
                3686
            ],
            [
                3686,
                3724
            ],
            [
                3724,
                3809
            ],
            [
                3809,
                3851
            ],
            [
                3851,
                3942
            ],
            [
                3942,
                4042
            ],
            [
                4042,
                4214
            ],
            [
                4214,
                4518
            ],
            [
                4518,
                4539
            ],
            [
                4539,
                4887
            ],
            [
                4887,
                4978
            ],
            [
                4978,
                5046
            ],
            [
                5046,
                5090
            ],
            [
                5090,
                5135
            ],
            [
                5135,
                5284
            ],
            [
                5284,
                5350
            ],
            [
                5350,
                5587
            ],
            [
                5587,
                5642
            ],
            [
                5642,
                5679
            ],
            [
                5679,
                5734
            ],
            [
                5734,
                5891
            ],
            [
                5891,
                5930
            ],
            [
                5930,
                5952
            ],
            [
                5952,
                6031
            ],
            [
                6031,
                6083
            ],
            [
                6083,
                6132
            ],
            [
                6132,
                6153
            ],
            [
                6153,
                6393
            ],
            [
                6393,
                6495
            ],
            [
                6495,
                6600
            ],
            [
                6600,
                6810
            ],
            [
                6810,
                6845
            ],
            [
                6845,
                6917
            ],
            [
                6917,
                7036
            ],
            [
                7036,
                7108
            ],
            [
                7108,
                7234
            ],
            [
                7234,
                7282
            ],
            [
                7282,
                7397
            ],
            [
                7397,
                7515
            ],
            [
                7515,
                7690
            ],
            [
                7690,
                7801
            ],
            [
                7801,
                8156
            ],
            [
                8156,
                8241
            ],
            [
                8241,
                8577
            ],
            [
                8577,
                8712
            ],
            [
                8712,
                8788
            ],
            [
                8788,
                8858
            ],
            [
                8858,
                8888
            ],
            [
                8888,
                9002
            ],
            [
                9002,
                9066
            ],
            [
                9066,
                9094
            ],
            [
                9094,
                9107
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9248
            ],
            [
                9248,
                9283
            ],
            [
                9283,
                9395
            ],
            [
                9395,
                9655
            ],
            [
                9655,
                9702
            ],
            [
                9702,
                9799
            ],
            [
                9799,
                9894
            ],
            [
                9894,
                9953
            ],
            [
                9953,
                10119
            ],
            [
                10119,
                10238
            ],
            [
                10238,
                10244
            ],
            [
                10244,
                10352
            ],
            [
                10352,
                10580
            ],
            [
                10580,
                10624
            ],
            [
                10624,
                10654
            ],
            [
                10654,
                10748
            ],
            [
                10748,
                10813
            ],
            [
                10813,
                10980
            ],
            [
                10980,
                11063
            ],
            [
                11063,
                11156
            ],
            [
                11156,
                11259
            ],
            [
                11259,
                11405
            ],
            [
                11405,
                11577
            ],
            [
                11577,
                11596
            ],
            [
                11596,
                11667
            ],
            [
                11667,
                11765
            ],
            [
                11765,
                11836
            ],
            [
                11836,
                11915
            ],
            [
                11915,
                11951
            ],
            [
                11951,
                12048
            ],
            [
                12048,
                12104
            ],
            [
                12104,
                12163
            ],
            [
                12163,
                12300
            ],
            [
                12300,
                12321
            ],
            [
                12321,
                12534
            ],
            [
                12534,
                12577
            ],
            [
                12577,
                12640
            ],
            [
                12640,
                12664
            ],
            [
                12664,
                12724
            ],
            [
                12724,
                12797
            ],
            [
                12797,
                12819
            ],
            [
                12819,
                12839
            ],
            [
                12839,
                12863
            ],
            [
                12863,
                12917
            ],
            [
                12917,
                12974
            ],
            [
                12974,
                13179
            ],
            [
                13179,
                13255
            ],
            [
                13255,
                13304
            ],
            [
                13304,
                13362
            ],
            [
                13362,
                13512
            ],
            [
                13512,
                13562
            ],
            [
                13562,
                13610
            ],
            [
                13610,
                13762
            ],
            [
                13762,
                14014
            ],
            [
                14014,
                14276
            ],
            [
                14276,
                14376
            ],
            [
                14376,
                14450
            ],
            [
                14450,
                14615
            ],
            [
                14615,
                14695
            ],
            [
                14695,
                14909
            ],
            [
                14909,
                15049
            ],
            [
                15049,
                15122
            ],
            [
                15122,
                15197
            ],
            [
                15197,
                15233
            ],
            [
                15233,
                15363
            ],
            [
                15363,
                15388
            ],
            [
                15388,
                15489
            ],
            [
                15489,
                15658
            ],
            [
                15658,
                15886
            ],
            [
                15886,
                15915
            ],
            [
                15915,
                16068
            ],
            [
                16068,
                16403
            ],
            [
                16403,
                16565
            ],
            [
                16565,
                16687
            ],
            [
                16687,
                16760
            ],
            [
                16760,
                17065
            ],
            [
                17065,
                17254
            ]
        ],
        "overlap_chars": [
            [
                105,
                174
            ],
            [
                236,
                251
            ],
            [
                262,
                273
            ],
            [
                279,
                308
            ],
            [
                333,
                338
            ],
            [
                421,
                480
            ],
            [
                621,
                699
            ],
            [
                761,
                790
            ],
            [
                808,
                876
            ],
            [
                738,
                741
            ],
            [
                903,
                910
            ],
            [
                938,
                1015
            ],
            [
                1031,
                1046
            ],
            [
                1057,
                1059
            ],
            [
                1069,
                1100
            ],
            [
                1110,
                1137
            ],
            [
                1138,
                1306
            ],
            [
                1367,
                1370
            ],
            [
                1399,
                1402
            ],
            [
                1548,
                1556
            ],
            [
                1568,
                1570
            ],
            [
                1570,
                1584
            ],
            [
                1592,
                1598
            ],
            [
                1604,
                1616
            ],
            [
                1655,
                1704
            ],
            [
                1711,
                1724
            ],
            [
                1730,
                1753
            ],
            [
                1778,
                1786
            ],
            [
                1792,
                1839
            ],
            [
                1881,
                1930
            ],
            [
                1930,
                1955
            ],
            [
                1956,
                1960
            ],
            [
                2001,
                2038
            ],
            [
                2054,
                2056
            ],
            [
                2056,
                2059
            ],
            [
                2069,
                2087
            ],
            [
                2222,
                2368
            ],
            [
                2541,
                2544
            ],
            [
                2153,
                2156
            ],
            [
                2385,
                2387
            ],
            [
                2561,
                2655
            ],
            [
                2214,
                2215
            ],
            [
                2657,
                2723
            ],
            [
                2729,
                2738
            ],
            [
                2746,
                2750
            ],
            [
                2451,
                2453
            ],
            [
                2766,
                2786
            ],
            [
                2790,
                2799
            ],
            [
                2809,
                2948
            ],
            [
                2948,
                3058
            ],
            [
                3115,
                3117
            ],
            [
                3117,
                3156
            ],
            [
                3156,
                3171
            ],
            [
                3224,
                3250
            ],
            [
                3254,
                3259
            ],
            [
                3259,
                3340
            ],
            [
                3349,
                3351
            ],
            [
                3351,
                3430
            ],
            [
                3430,
                3463
            ],
            [
                3463,
                3495
            ],
            [
                3555,
                3563
            ],
            [
                3585,
                3600
            ],
            [
                3600,
                3629
            ],
            [
                3639,
                3686
            ],
            [
                3686,
                3724
            ],
            [
                3724,
                3761
            ],
            [
                3807,
                3809
            ],
            [
                3809,
                3851
            ],
            [
                3851,
                3915
            ],
            [
                3923,
                3942
            ],
            [
                3942,
                3943
            ],
            [
                3979,
                3991
            ],
            [
                4010,
                4042
            ],
            [
                4042,
                4043
            ],
            [
                4045,
                4048
            ],
            [
                4050,
                4077
            ],
            [
                4105,
                4190
            ],
            [
                4212,
                4214
            ],
            [
                4214,
                4372
            ],
            [
                4394,
                4453
            ],
            [
                4455,
                4478
            ],
            [
                4480,
                4492
            ],
            [
                4494,
                4514
            ],
            [
                4518,
                4537
            ],
            [
                4782,
                4862
            ],
            [
                4876,
                4887
            ],
            [
                4887,
                4978
            ],
            [
                4978,
                5046
            ],
            [
                5046,
                5047
            ],
            [
                5065,
                5090
            ],
            [
                5090,
                5133
            ],
            [
                5284,
                5286
            ],
            [
                5372,
                5381
            ],
            [
                5442,
                5473
            ],
            [
                5493,
                5495
            ],
            [
                5500,
                5503
            ],
            [
                5587,
                5642
            ],
            [
                5642,
                5679
            ],
            [
                5679,
                5734
            ],
            [
                5734,
                5785
            ],
            [
                5787,
                5845
            ],
            [
                5889,
                5891
            ],
            [
                5930,
                5952
            ],
            [
                5952,
                5956
            ],
            [
                5968,
                5985
            ],
            [
                6012,
                6031
            ],
            [
                6031,
                6083
            ],
            [
                6083,
                6132
            ],
            [
                6132,
                6153
            ],
            [
                6153,
                6393
            ],
            [
                6413,
                6432
            ],
            [
                6450,
                6453
            ],
            [
                6454,
                6495
            ],
            [
                6495,
                6532
            ],
            [
                6624,
                6643
            ],
            [
                6660,
                6810
            ],
            [
                6810,
                6845
            ],
            [
                6845,
                6915
            ],
            [
                6921,
                6929
            ],
            [
                6938,
                6963
            ],
            [
                6930,
                6937
            ],
            [
                6979,
                7036
            ],
            [
                7036,
                7108
            ],
            [
                7108,
                7234
            ],
            [
                7234,
                7282
            ],
            [
                7282,
                7305
            ],
            [
                7348,
                7350
            ],
            [
                7339,
                7342
            ],
            [
                7393,
                7395
            ],
            [
                7306,
                7335
            ],
            [
                7395,
                7397
            ],
            [
                7441,
                7445
            ],
            [
                7471,
                7515
            ],
            [
                7515,
                7557
            ],
            [
                7576,
                7617
            ],
            [
                7623,
                7665
            ],
            [
                7687,
                7690
            ],
            [
                7690,
                7757
            ],
            [
                7799,
                7801
            ],
            [
                7801,
                7810
            ],
            [
                7849,
                7893
            ],
            [
                7934,
                7962
            ],
            [
                7982,
                8095
            ],
            [
                8099,
                8134
            ],
            [
                8154,
                8156
            ],
            [
                8156,
                8241
            ],
            [
                8241,
                8295
            ],
            [
                8397,
                8448
            ],
            [
                8452,
                8528
            ],
            [
                8336,
                8337
            ],
            [
                8533,
                8536
            ],
            [
                8575,
                8577
            ],
            [
                8577,
                8616
            ],
            [
                8677,
                8712
            ],
            [
                8749,
                8756
            ],
            [
                8763,
                8769
            ],
            [
                8788,
                8858
            ],
            [
                8858,
                8876
            ],
            [
                8885,
                8888
            ],
            [
                8888,
                8897
            ],
            [
                8925,
                8959
            ],
            [
                9000,
                9002
            ],
            [
                9002,
                9032
            ],
            [
                9034,
                9066
            ],
            [
                9066,
                9094
            ],
            [
                9094,
                9107
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9169
            ],
            [
                9200,
                9248
            ],
            [
                9248,
                9283
            ],
            [
                9283,
                9395
            ],
            [
                9395,
                9552
            ],
            [
                9587,
                9588
            ],
            [
                9568,
                9581
            ],
            [
                9596,
                9601
            ],
            [
                9631,
                9655
            ],
            [
                9655,
                9702
            ],
            [
                9702,
                9799
            ],
            [
                9799,
                9811
            ],
            [
                9821,
                9894
            ],
            [
                9944,
                9951
            ],
            [
                9925,
                9934
            ],
            [
                9953,
                9980
            ],
            [
                9986,
                10028
            ],
            [
                10032,
                10037
            ],
            [
                10039,
                10117
            ],
            [
                10148,
                10155
            ],
            [
                10178,
                10238
            ],
            [
                10238,
                10244
            ],
            [
                10244,
                10352
            ],
            [
                10352,
                10376
            ],
            [
                10425,
                10475
            ],
            [
                10482,
                10508
            ],
            [
                10520,
                10580
            ],
            [
                10580,
                10624
            ],
            [
                10624,
                10654
            ],
            [
                10654,
                10748
            ],
            [
                10748,
                10813
            ],
            [
                10813,
                10861
            ],
            [
                10885,
                10888
            ],
            [
                10864,
                10872
            ],
            [
                10899,
                10917
            ],
            [
                10978,
                10980
            ],
            [
                11063,
                11156
            ],
            [
                11156,
                11259
            ],
            [
                11259,
                11300
            ],
            [
                11374,
                11405
            ],
            [
                11405,
                11577
            ],
            [
                11577,
                11596
            ],
            [
                11596,
                11603
            ],
            [
                11617,
                11667
            ],
            [
                11684,
                11715
            ],
            [
                11667,
                11670
            ],
            [
                11720,
                11739
            ],
            [
                11747,
                11765
            ],
            [
                11765,
                11778
            ],
            [
                11799,
                11810
            ],
            [
                11834,
                11836
            ],
            [
                11836,
                11915
            ],
            [
                11915,
                11922
            ],
            [
                11956,
                11965
            ],
            [
                11967,
                11990
            ],
            [
                11993,
                11996
            ],
            [
                12046,
                12048
            ],
            [
                12048,
                12104
            ],
            [
                12104,
                12130
            ],
            [
                12153,
                12163
            ],
            [
                12163,
                12226
            ],
            [
                12298,
                12300
            ],
            [
                12300,
                12321
            ],
            [
                12321,
                12332
            ],
            [
                12333,
                12337
            ],
            [
                12345,
                12397
            ],
            [
                12412,
                12430
            ],
            [
                12442,
                12465
            ],
            [
                12470,
                12493
            ],
            [
                12532,
                12534
            ],
            [
                12534,
                12577
            ],
            [
                12577,
                12611
            ],
            [
                12638,
                12640
            ],
            [
                12640,
                12664
            ],
            [
                12664,
                12687
            ],
            [
                12689,
                12700
            ],
            [
                12715,
                12724
            ],
            [
                12724,
                12756
            ],
            [
                12758,
                12797
            ],
            [
                12797,
                12819
            ],
            [
                12819,
                12839
            ],
            [
                12839,
                12863
            ],
            [
                12863,
                12875
            ],
            [
                12920,
                12974
            ],
            [
                12984,
                13021
            ],
            [
                13026,
                13040
            ],
            [
                13072,
                13140
            ],
            [
                13154,
                13179
            ],
            [
                13179,
                13255
            ],
            [
                13255,
                13283
            ],
            [
                13302,
                13304
            ],
            [
                13304,
                13362
            ],
            [
                13362,
                13414
            ],
            [
                13512,
                13515
            ],
            [
                13541,
                13548
            ],
            [
                13560,
                13562
            ],
            [
                13562,
                13610
            ],
            [
                13647,
                13762
            ],
            [
                13762,
                13787
            ],
            [
                13856,
                13859
            ],
            [
                13802,
                13809
            ],
            [
                13860,
                13886
            ],
            [
                13896,
                13906
            ],
            [
                13908,
                13934
            ],
            [
                13788,
                13791
            ],
            [
                13956,
                14014
            ],
            [
                14097,
                14100
            ],
            [
                14037,
                14042
            ],
            [
                14107,
                14109
            ],
            [
                14113,
                14156
            ],
            [
                14167,
                14203
            ],
            [
                14209,
                14275
            ],
            [
                14376,
                14413
            ],
            [
                14424,
                14450
            ],
            [
                14450,
                14520
            ],
            [
                14523,
                14529
            ],
            [
                14549,
                14593
            ],
            [
                14613,
                14615
            ],
            [
                14615,
                14695
            ],
            [
                14711,
                14718
            ],
            [
                14765,
                14768
            ],
            [
                14736,
                14761
            ],
            [
                14769,
                14797
            ],
            [
                14838,
                14848
            ],
            [
                14852,
                14859
            ],
            [
                14879,
                14898
            ],
            [
                14907,
                14909
            ],
            [
                14909,
                14933
            ],
            [
                15003,
                15013
            ],
            [
                14978,
                14992
            ],
            [
                14950,
                14953
            ],
            [
                15049,
                15122
            ],
            [
                15122,
                15142
            ],
            [
                15144,
                15172
            ],
            [
                15195,
                15197
            ],
            [
                15197,
                15209
            ],
            [
                15220,
                15233
            ],
            [
                15233,
                15291
            ],
            [
                15308,
                15363
            ],
            [
                15363,
                15388
            ],
            [
                15489,
                15587
            ],
            [
                15592,
                15598
            ],
            [
                15607,
                15658
            ],
            [
                15658,
                15670
            ],
            [
                15728,
                15765
            ],
            [
                15784,
                15886
            ],
            [
                15886,
                15915
            ],
            [
                15915,
                15922
            ],
            [
                15932,
                16068
            ],
            [
                16068,
                16129
            ],
            [
                16166,
                16168
            ],
            [
                16218,
                16222
            ],
            [
                16195,
                16217
            ],
            [
                16186,
                16188
            ],
            [
                16234,
                16331
            ],
            [
                16336,
                16365
            ],
            [
                16375,
                16403
            ],
            [
                16438,
                16442
            ],
            [
                16448,
                16460
            ],
            [
                16481,
                16564
            ],
            [
                16565,
                16642
            ],
            [
                16676,
                16687
            ],
            [
                16760,
                16838
            ],
            [
                16847,
                16871
            ],
            [
                16908,
                16953
            ],
            [
                17063,
                17065
            ],
            [
                17065,
                17072
            ],
            [
                17176,
                17177
            ],
            [
                17073,
                17176
            ],
            [
                17221,
                17254
            ]
        ],
        "row_chars": [
            [
                0,
                95
            ],
            [
                95,
                105
            ],
            [
                105,
                174
            ],
            [
                174,
                480
            ],
            [
                480,
                621
            ],
            [
                621,
                699
            ],
            [
                699,
                1138
            ],
            [
                1138,
                1570
            ],
            [
                1570,
                1881
            ],
            [
                1881,
                1930
            ],
            [
                1930,
                2056
            ],
            [
                2056,
                2786
            ],
            [
                2786,
                2948
            ],
            [
                2948,
                3117
            ],
            [
                3117,
                3156
            ],
            [
                3156,
                3224
            ],
            [
                3224,
                3259
            ],
            [
                3259,
                3351
            ],
            [
                3351,
                3430
            ],
            [
                3430,
                3463
            ],
            [
                3463,
                3600
            ],
            [
                3600,
                3686
            ],
            [
                3686,
                3724
            ],
            [
                3724,
                3809
            ],
            [
                3809,
                3851
            ],
            [
                3851,
                3942
            ],
            [
                3942,
                4042
            ],
            [
                4042,
                4214
            ],
            [
                4214,
                4518
            ],
            [
                4518,
                4887
            ],
            [
                4887,
                4978
            ],
            [
                4978,
                5046
            ],
            [
                5046,
                5090
            ],
            [
                5090,
                5135
            ],
            [
                5135,
                5284
            ],
            [
                5284,
                5642
            ],
            [
                5642,
                5679
            ],
            [
                5679,
                5734
            ],
            [
                5734,
                5891
            ],
            [
                5891,
                5930
            ],
            [
                5930,
                5952
            ],
            [
                5952,
                6031
            ],
            [
                6031,
                6083
            ],
            [
                6083,
                6132
            ],
            [
                6132,
                6153
            ],
            [
                6153,
                6393
            ],
            [
                6393,
                6495
            ],
            [
                6495,
                6810
            ],
            [
                6810,
                6845
            ],
            [
                6845,
                7036
            ],
            [
                7036,
                7108
            ],
            [
                7108,
                7234
            ],
            [
                7234,
                7282
            ],
            [
                7282,
                7397
            ],
            [
                7397,
                7515
            ],
            [
                7515,
                7690
            ],
            [
                7690,
                7801
            ],
            [
                7801,
                8156
            ],
            [
                8156,
                8241
            ],
            [
                8241,
                8577
            ],
            [
                8577,
                8712
            ],
            [
                8712,
                8788
            ],
            [
                8788,
                8858
            ],
            [
                8858,
                8888
            ],
            [
                8888,
                9002
            ],
            [
                9002,
                9066
            ],
            [
                9066,
                9094
            ],
            [
                9094,
                9107
            ],
            [
                9107,
                9160
            ],
            [
                9160,
                9248
            ],
            [
                9248,
                9283
            ],
            [
                9283,
                9395
            ],
            [
                9395,
                9655
            ],
            [
                9655,
                9702
            ],
            [
                9702,
                9799
            ],
            [
                9799,
                9894
            ],
            [
                9894,
                9953
            ],
            [
                9953,
                10119
            ],
            [
                10119,
                10238
            ],
            [
                10238,
                10244
            ],
            [
                10244,
                10352
            ],
            [
                10352,
                10580
            ],
            [
                10580,
                10624
            ],
            [
                10624,
                10654
            ],
            [
                10654,
                10748
            ],
            [
                10748,
                10813
            ],
            [
                10813,
                10980
            ],
            [
                10980,
                11063
            ],
            [
                11063,
                11156
            ],
            [
                11156,
                11259
            ],
            [
                11259,
                11405
            ],
            [
                11405,
                11577
            ],
            [
                11577,
                11596
            ],
            [
                11596,
                11667
            ],
            [
                11667,
                11765
            ],
            [
                11765,
                11836
            ],
            [
                11836,
                11915
            ],
            [
                11915,
                12048
            ],
            [
                12048,
                12104
            ],
            [
                12104,
                12163
            ],
            [
                12163,
                12300
            ],
            [
                12300,
                12321
            ],
            [
                12321,
                12534
            ],
            [
                12534,
                12577
            ],
            [
                12577,
                12640
            ],
            [
                12640,
                12664
            ],
            [
                12664,
                12724
            ],
            [
                12724,
                12797
            ],
            [
                12797,
                12819
            ],
            [
                12819,
                12839
            ],
            [
                12839,
                12863
            ],
            [
                12863,
                12974
            ],
            [
                12974,
                13179
            ],
            [
                13179,
                13255
            ],
            [
                13255,
                13304
            ],
            [
                13304,
                13362
            ],
            [
                13362,
                13562
            ],
            [
                13562,
                13610
            ],
            [
                13610,
                13762
            ],
            [
                13762,
                14014
            ],
            [
                14014,
                14276
            ],
            [
                14276,
                14376
            ],
            [
                14376,
                14450
            ],
            [
                14450,
                14615
            ],
            [
                14615,
                14695
            ],
            [
                14695,
                14909
            ],
            [
                14909,
                15049
            ],
            [
                15049,
                15122
            ],
            [
                15122,
                15197
            ],
            [
                15197,
                15233
            ],
            [
                15233,
                15363
            ],
            [
                15363,
                15388
            ],
            [
                15388,
                15489
            ],
            [
                15489,
                15658
            ],
            [
                15658,
                15886
            ],
            [
                15886,
                15915
            ],
            [
                15915,
                16068
            ],
            [
                16068,
                16403
            ],
            [
                16403,
                16565
            ],
            [
                16565,
                16687
            ],
            [
                16687,
                16760
            ],
            [
                16760,
                17065
            ],
            [
                17065,
                17254
            ]
        ]
    },
    "abridged": {
        "text": "Deronda did not obey Gwendolen's new summons without some agitation. He felt the danger that her heart might make larger demands on him than he could fulfil; and he knew that Gwendolen's soul clung to his with a passionate need. Deronda felt this woman's destiny hanging on his over a precipice of despair. Inwardly he confessed that if all this had happened a year ago, he would hardly have asked himself whether he loved her; his impulse would have been to save her from sorrow, to shelter her life forevermore from loneliness, and to complete the rescue he had begun in that redemption of the necklace.\nBut now, love and duty had thrown other bonds around him, and that impulse could no longer determine his life; still, it was present in him as a compassionate yearning, and he pitied her all the more.\nHe awaited her in the drawing-room where they had sat together at the musical party, when Gwendolen had asked for the first time that he should not forsake her, and her appeal had seemed to melt into the song. But the melody had come from Mirah's dear voice.\nDeronda walked about this familiar room with a strange sense of metamorphosis. The objects around him seemed almost to belong to a previous state of existence which he was revisiting in memory only, not in reality; so deep and transforming had been his recent experiences. And he was awaiting the entrance of a young creature whose life had also been undergoing a transformation - a tragic transformation toward a wavering result, in which he felt apprehensively that he was still bound up.\nGwendolen came in, looking changed; not only by her mourning dress, but by a more satisfied quietude of expression than he had seen in her face at Genoa. Her satisfaction was that Deronda was there; but there was no smile between them as they met and clasped hands. She said, \"It was good of you to come. Let us sit down.\" He placed himself opposite her.\n\"I asked you to come because I want you to tell me what I ought to do,\" she began. \"Don't be afraid of telling me what you think is right, because it seems hard. I have made up my mind to do it. I was afraid once of being poor; that was why I married. I have borne worse things now, and I could bear to be poor, if you think I ought. Do you know about my husband's will?\"\n\"Yes, Sir Hugo told me,\" said Deronda.\n\"Ought I to take anything he has left me? I will tell you what I have been thinking,\" said Gwendolen, with nervous eagerness. \"I really did care about my mother when I married. I was selfish, but I did love her; and what comforted me most at first, when I was miserable, was her being better off. The thing that would be hardest to me now would be to see her in poverty again; and I have been thinking that if I took enough to provide for her, and no more, it would not be wrong; for I was very precious to my mother - and he took me from her - and he meant - and if she had known-\"\nGwendolen broke off as perilous remembrances swarmed between her words, making her speech more and more tremulous. She looked down helplessly at her hands, now unladen of all rings except her wedding-ring.\n\"Do not hurt yourself by speaking of that,\" said Deronda, tenderly. \"The case is very simple. I think I can hardly judge wrongly about it.\" He waited until Gwendolen had courage to lift up her eyes before he continued, \"You think that you have forfeited all claim as a wife. You shrink from taking what was his. You want to keep yourself from profiting by his death. Your feeling even urges you to some self-punishment - some scourging of the self that disobeyed your better will. Do I understand you?\"\n\"Yes - I want to be good,\" said Gwendolen. \"I will try to bear what you think I ought to bear. I have tried to tell you the worst about myself. What ought I to do?\"\n\"If no one but yourself were concerned in this question of income,\" said Deronda, \"I should hardly dare to urge you against any remorseful prompting; but I take as a guide now, your feeling about Mrs. Davilow, which seems to me quite just. Your husband's dues are not nullified by any act you have committed. He voluntarily entered into your life: it was due from him that he should provide for your mother, and he of course understood that if this will took effect she would share the provision he had made for you.\"\n\"She has had eight hundred a year. What I thought of was to take that and leave the rest,\" said Gwendolen, who had been inwardly arguing for this so long, that her mind could not at once take another attitude.\n\"I think it is not your duty to fix a limit in that way,\" said Deronda. \"You would be making a painful enigma for Mrs. Davilow; an income from which you shut yourself out must be embittered to her. And your own course would become too difficult. We agreed at Genoa that no-one else should know of the burden on your conscience. It is best if you save all others from the pain of that knowledge. In my opinion you ought simply to abide by your husband's will, and let your remorse decide only on the use that you will make of your money.\"\nIn uttering the last sentence Deronda automatically took up his hat to go. Gwendolen felt her heart giving a great leap, as if it would hinder him from going: she rose from her chair, unable to reflect that the movement was an acceptance of his apparent intention to leave; and Deronda, of course, also rose.\n\"I will do what you tell me,\" said Gwendolen, hurriedly; \"but what else shall I do?\" No other than these simple words were possible to her; as the child-like sentences fell from her lips they acted on her like a picture of her own helplessness, and she could not check a sob. Deronda, too, felt a crushing pain; but knew the need of the utmost exertion of conscience. He said gently-\n\"You will probably be soon going with Mrs. Davilow into the country.\"\n\"Yes, in a week or so.\" Gwendolen turned her eyes vaguely toward the window. \"I want to be kind to them all - they can be happier than I can. Is that the best I can do?\"\n\"I think so. It is a duty that cannot be doubtful,\" said Deronda. He paused, feeling a weight of anxiety on all his words. \"Other duties will spring from it. Looking at your life as a debt may seem the dreariest view of things at a distance; but it cannot really be so. What makes life dreary is the want of motive: but once beginning to act with that penitential, loving purpose you have in your mind, there will be unexpected satisfaction - there will be new needs - continually carrying you on from day to day. You will find your life growing like a plant.\"\nGwendolen turned her eyes on him with the look of one athirst toward the sound of unseen waters. Deronda felt as if she had been stretching her arms toward him from a forsaken shore. He said imploringly-\n\"This sorrow, which has cut to the root, has come to you while you are young - try to think of it not as a spoiling of your life, but as a preparation for it.\" Anyone listening would have thought he was entreating for his own happiness. \"See! you have been saved from the worst evils that might have come from your marriage, which you feel was wrong. You have had a vision of degradation; think that a severe angel, seeing you on the road of error, grasped your wrist and showed you the horror of the life you must avoid. And it has come to you in your spring-time. Think of it as a preparation. You can, you will, be among the best of women, such as make others glad that they were born.\"\nThe words were like the touch of a miraculous hand to Gwendolen. Mingled emotions streamed through her frame with the strength of a new existence. So potent in us is the infused action of another soul, before which we bow in complete love. But the new existence seemed inseparable from Deronda: the hope seemed to make his presence permanent. It was not her thought, that he loved her; it was her spiritual breath. For the first time since that terrible moment on the sea a flush rose and spread over her cheek, brow and neck, deepened an instant or two, and then gradually disappeared. She did not speak.\nDeronda put out his hand, saying, \"I must not weary you.\"\nStartled by the sense that he was going, she put her hand in his without speaking.\n\"You look ill,\" he added.\n\"I can't sleep much,\" she answered, with some return of her dispirited manner. \"Things come back - they will all come back.\" She shuddered.\n\"By degrees they will be less insistent,\" said Deronda. He could not drop her hand abruptly.\n\"Sir Hugo says he shall come to stay at Diplow,\" said Gwendolen. \"You will come too.\"\n\"Probably,\" he said, and then feeling that the word was cold, he added, \"Yes, I shall come.\" He released her hand, with a final friendly pressure.\n\"And not again here, before I leave town?\" said Gwendolen, with timid sadness.\nWhat could Deronda say? \"If I can be of any use - if you wish - certainly I will.\"\n\"I must wish it,\" said Gwendolen impetuously; \"you know I must wish it. What strength have I? Who else is there?\" Again a sob was rising.\nDeronda felt and looked miserable as he said, \"I will certainly come.\"\nShe perceived the change in his face; but her intense relief could not give way to any other feeling, and there was a recovery of hope and courage in her.\n\"Don't be unhappy about me,\" she said, in a tone of affectionate assurance. \"I shall remember your words. I shall remember what you believe about me; I shall try.\"\nShe looked at him firmly, and put out her hand again, but without a smile. She had never smiled since her husband's death. She looked like a melancholy statue of the Gwendolen whose laughter had once been so ready when others were grave.\nIt is only by remembering her life-changing anguish that we can understand her behaviour to Deronda - the unreflecting openness, the pleading, with which she expressed her dependence on him. She did not think about how it would appear to others, any more than if flames had been mounting, and she had flung herself into his arms and clung about his neck that he might carry her into safety.\nIs it any wonder that she saw her own need reflected in his feeling? She was in that state of unconscious reliance and expectation which is common when we are preoccupied with our own trouble. We diffuse our feeling over others, and count on their acting from our motives. She had not imagined any future union with Deronda other than the spiritual tie between them; but also she had not envisaged a future separation. Love-making and marriage had no connection with attachment for poor Gwendolen now. Mighty Love had laid his hand upon her; but what had he demanded of her? Acceptance of rebuke - the hard task of self-change - confession - endurance. If she cried, what then? She cried as the child cries whose little feet have fallen behind - cries to be taken by the hand, lest she should lose herself.\nThe cry pierced Deronda. He was the only creature who knew the real nature of Gwendolen's trouble: to withdraw himself from her appeal would be to consign her to a dangerous loneliness. He could not cruelly reject her dependence on him; and yet in the distance he saw a coming wrench, which all present strengthening of their bond would make the harder.\nHe was obliged to risk that. He went again to Park Lane before Gwendolen left; but their interviews were in the presence of Mrs. Davilow, and were therefore less agitating. Gwendolen, since she had determined to accept her income, had decided to move with her mother and sisters to Offendene again, and, as she said, piece back her life unto that time when they first went there, when everything was happiness, only she did not know it. Sir Hugo was going to arrange the letting of Gadsmere for a rent which would more than pay the rent of Offendene.\nAll this was told to Deronda, who willingly dwelt on a subject that seemed to soothe Gwendolen. Her mind was fixed on his coming to Diplow before the autumn was over; and she never thought of the Lapidoths as likely to make a difference in her destiny. In fact, poor Gwendolen's memory had been stunned, and all outside the lava-lit track of her troubled conscience lay for her in dim forgetfulness.",
        "paragraph_chars": [
            [
                0,
                606
            ],
            [
                606,
                807
            ],
            [
                807,
                1066
            ],
            [
                1066,
                1557
            ],
            [
                1557,
                1912
            ],
            [
                1912,
                2284
            ],
            [
                2284,
                2323
            ],
            [
                2323,
                2906
            ],
            [
                2906,
                3112
            ],
            [
                3112,
                3615
            ],
            [
                3615,
                3780
            ],
            [
                3780,
                4298
            ],
            [
                4298,
                4508
            ],
            [
                4508,
                5046
            ],
            [
                5046,
                5355
            ],
            [
                5355,
                5739
            ],
            [
                5739,
                5809
            ],
            [
                5809,
                5979
            ],
            [
                5979,
                6540
            ],
            [
                6540,
                6744
            ],
            [
                6744,
                7434
            ],
            [
                7434,
                8040
            ],
            [
                8040,
                8098
            ],
            [
                8098,
                8181
            ],
            [
                8181,
                8207
            ],
            [
                8207,
                8347
            ],
            [
                8347,
                8440
            ],
            [
                8440,
                8526
            ],
            [
                8526,
                8673
            ],
            [
                8673,
                8752
            ],
            [
                8752,
                8835
            ],
            [
                8835,
                8973
            ],
            [
                8973,
                9044
            ],
            [
                9044,
                9199
            ],
            [
                9199,
                9363
            ],
            [
                9363,
                9601
            ],
            [
                9601,
                9992
            ],
            [
                9992,
                10799
            ],
            [
                10799,
                11153
            ],
            [
                11153,
                11704
            ],
            [
                11704,
                12103
            ]
        ],
        "segment_chars": [
            [
                0,
                69
            ],
            [
                69,
                229
            ],
            [
                229,
                307
            ],
            [
                307,
                606
            ],
            [
                606,
                807
            ],
            [
                807,
                1017
            ],
            [
                1017,
                1066
            ],
            [
                1066,
                1145
            ],
            [
                1145,
                1339
            ],
            [
                1339,
                1557
            ],
            [
                1557,
                1711
            ],
            [
                1711,
                1823
            ],
            [
                1823,
                1862
            ],
            [
                1862,
                1880
            ],
            [
                1880,
                1912
            ],
            [
                1912,
                1995
            ],
            [
                1995,
                2074
            ],
            [
                2074,
                2107
            ],
            [
                2107,
                2164
            ],
            [
                2164,
                2246
            ],
            [
                2246,
                2284
            ],
            [
                2284,
                2323
            ],
            [
                2323,
                2365
            ],
            [
                2365,
                2449
            ],
            [
                2449,
                2500
            ],
            [
                2500,
                2620
            ],
            [
                2620,
                2906
            ],
            [
                2906,
                3021
            ],
            [
                3021,
                3112
            ],
            [
                3112,
                3180
            ],
            [
                3180,
                3206
            ],
            [
                3206,
                3252
            ],
            [
                3252,
                3387
            ],
            [
                3387,
                3424
            ],
            [
                3424,
                3479
            ],
            [
                3479,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3658
            ],
            [
                3658,
                3710
            ],
            [
                3710,
                3759
            ],
            [
                3759,
                3780
            ],
            [
                3780,
                4020
            ],
            [
                4020,
                4089
            ],
            [
                4089,
                4298
            ],
            [
                4298,
                4333
            ],
            [
                4333,
                4508
            ],
            [
                4508,
                4580
            ],
            [
                4580,
                4706
            ],
            [
                4706,
                4754
            ],
            [
                4754,
                4836
            ],
            [
                4836,
                4903
            ],
            [
                4903,
                5046
            ],
            [
                5046,
                5121
            ],
            [
                5121,
                5355
            ],
            [
                5355,
                5440
            ],
            [
                5440,
                5631
            ],
            [
                5631,
                5723
            ],
            [
                5723,
                5739
            ],
            [
                5739,
                5809
            ],
            [
                5809,
                5833
            ],
            [
                5833,
                5886
            ],
            [
                5886,
                5951
            ],
            [
                5951,
                5979
            ],
            [
                5979,
                5992
            ],
            [
                5992,
                6045
            ],
            [
                6045,
                6102
            ],
            [
                6102,
                6137
            ],
            [
                6137,
                6249
            ],
            [
                6249,
                6493
            ],
            [
                6493,
                6540
            ],
            [
                6540,
                6637
            ],
            [
                6637,
                6723
            ],
            [
                6723,
                6744
            ],
            [
                6744,
                6904
            ],
            [
                6904,
                6981
            ],
            [
                6981,
                6987
            ],
            [
                6987,
                7095
            ],
            [
                7095,
                7266
            ],
            [
                7266,
                7310
            ],
            [
                7310,
                7340
            ],
            [
                7340,
                7434
            ],
            [
                7434,
                7499
            ],
            [
                7499,
                7581
            ],
            [
                7581,
                7674
            ],
            [
                7674,
                7777
            ],
            [
                7777,
                7849
            ],
            [
                7849,
                8021
            ],
            [
                8021,
                8040
            ],
            [
                8040,
                8098
            ],
            [
                8098,
                8181
            ],
            [
                8181,
                8207
            ],
            [
                8207,
                8286
            ],
            [
                8286,
                8332
            ],
            [
                8332,
                8347
            ],
            [
                8347,
                8403
            ],
            [
                8403,
                8440
            ],
            [
                8440,
                8505
            ],
            [
                8505,
                8526
            ],
            [
                8526,
                8619
            ],
            [
                8619,
                8673
            ],
            [
                8673,
                8716
            ],
            [
                8716,
                8752
            ],
            [
                8752,
                8776
            ],
            [
                8776,
                8835
            ],
            [
                8835,
                8907
            ],
            [
                8907,
                8929
            ],
            [
                8929,
                8949
            ],
            [
                8949,
                8973
            ],
            [
                8973,
                9044
            ],
            [
                9044,
                9199
            ],
            [
                9199,
                9275
            ],
            [
                9275,
                9305
            ],
            [
                9305,
                9363
            ],
            [
                9363,
                9438
            ],
            [
                9438,
                9486
            ],
            [
                9486,
                9601
            ],
            [
                9601,
                9792
            ],
            [
                9792,
                9992
            ],
            [
                9992,
                10061
            ],
            [
                10061,
                10185
            ],
            [
                10185,
                10265
            ],
            [
                10265,
                10411
            ],
            [
                10411,
                10494
            ],
            [
                10494,
                10567
            ],
            [
                10567,
                10645
            ],
            [
                10645,
                10670
            ],
            [
                10670,
                10799
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10985
            ],
            [
                10985,
                11153
            ],
            [
                11153,
                11182
            ],
            [
                11182,
                11326
            ],
            [
                11326,
                11590
            ],
            [
                11590,
                11704
            ],
            [
                11704,
                11800
            ],
            [
                11800,
                11957
            ],
            [
                11957,
                12103
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                77,
                92
            ],
            [
                97,
                108
            ],
            [
                114,
                143
            ],
            [
                156,
                161
            ],
            [
                170,
                229
            ],
            [
                229,
                307
            ],
            [
                329,
                358
            ],
            [
                359,
                427
            ],
            [
                428,
                431
            ],
            [
                432,
                439
            ],
            [
                440,
                517
            ],
            [
                518,
                533
            ],
            [
                534,
                536
            ],
            [
                546,
                577
            ],
            [
                578,
                605
            ],
            [
                606,
                774
            ],
            [
                775,
                778
            ],
            [
                789,
                792
            ],
            [
                797,
                805
            ],
            [
                805,
                807
            ],
            [
                807,
                821
            ],
            [
                822,
                828
            ],
            [
                829,
                841
            ],
            [
                842,
                891
            ],
            [
                897,
                910
            ],
            [
                917,
                940
            ],
            [
                951,
                959
            ],
            [
                963,
                1010
            ],
            [
                1017,
                1066
            ],
            [
                1066,
                1091
            ],
            [
                1101,
                1105
            ],
            [
                1106,
                1143
            ],
            [
                1143,
                1145
            ],
            [
                1145,
                1148
            ],
            [
                1149,
                1167
            ],
            [
                1168,
                1314
            ],
            [
                1315,
                1318
            ],
            [
                1339,
                1342
            ],
            [
                1343,
                1345
            ],
            [
                1350,
                1444
            ],
            [
                1445,
                1446
            ],
            [
                1447,
                1513
            ],
            [
                1514,
                1523
            ],
            [
                1529,
                1533
            ],
            [
                1534,
                1536
            ],
            [
                1537,
                1557
            ],
            [
                1557,
                1566
            ],
            [
                1572,
                1711
            ],
            [
                1711,
                1821
            ],
            [
                1821,
                1823
            ],
            [
                1823,
                1862
            ],
            [
                1862,
                1877
            ],
            [
                1880,
                1906
            ],
            [
                1907,
                1912
            ],
            [
                1912,
                1993
            ],
            [
                1993,
                1995
            ],
            [
                1995,
                2074
            ],
            [
                2074,
                2107
            ],
            [
                2107,
                2139
            ],
            [
                2140,
                2148
            ],
            [
                2149,
                2164
            ],
            [
                2164,
                2193
            ],
            [
                2199,
                2246
            ],
            [
                2246,
                2284
            ],
            [
                2284,
                2321
            ],
            [
                2321,
                2323
            ],
            [
                2323,
                2365
            ],
            [
                2365,
                2429
            ],
            [
                2430,
                2449
            ],
            [
                2449,
                2450
            ],
            [
                2450,
                2462
            ],
            [
                2468,
                2500
            ],
            [
                2500,
                2501
            ],
            [
                2502,
                2505
            ],
            [
                2506,
                2533
            ],
            [
                2533,
                2618
            ],
            [
                2618,
                2620
            ],
            [
                2620,
                2778
            ],
            [
                2780,
                2839
            ],
            [
                2842,
                2865
            ],
            [
                2868,
                2880
            ],
            [
                2883,
                2903
            ],
            [
                2906,
                2925
            ],
            [
                2929,
                3009
            ],
            [
                3010,
                3021
            ],
            [
                3021,
                3112
            ],
            [
                3112,
                3180
            ],
            [
                3180,
                3181
            ],
            [
                3181,
                3206
            ],
            [
                3206,
                3249
            ],
            [
                3252,
                3254
            ],
            [
                3268,
                3277
            ],
            [
                3278,
                3309
            ],
            [
                3317,
                3319
            ],
            [
                3329,
                3332
            ],
            [
                3332,
                3387
            ],
            [
                3387,
                3424
            ],
            [
                3424,
                3479
            ],
            [
                3479,
                3530
            ],
            [
                3533,
                3591
            ],
            [
                3591,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3619
            ],
            [
                3622,
                3639
            ],
            [
                3639,
                3658
            ],
            [
                3658,
                3710
            ],
            [
                3710,
                3759
            ],
            [
                3759,
                3780
            ],
            [
                3780,
                4020
            ],
            [
                4020,
                4039
            ],
            [
                4040,
                4043
            ],
            [
                4048,
                4089
            ],
            [
                4089,
                4126
            ],
            [
                4128,
                4147
            ],
            [
                4148,
                4298
            ],
            [
                4298,
                4333
            ],
            [
                4333,
                4403
            ],
            [
                4409,
                4417
            ],
            [
                4418,
                4443
            ],
            [
                4444,
                4451
            ],
            [
                4451,
                4508
            ],
            [
                4508,
                4580
            ],
            [
                4580,
                4706
            ],
            [
                4706,
                4754
            ],
            [
                4754,
                4777
            ],
            [
                4778,
                4780
            ],
            [
                4781,
                4784
            ],
            [
                4802,
                4804
            ],
            [
                4805,
                4834
            ],
            [
                4834,
                4836
            ],
            [
                4842,
                4846
            ],
            [
                4859,
                4903
            ],
            [
                4903,
                4945
            ],
            [
                4946,
                4987
            ],
            [
                4995,
                5037
            ],
            [
                5043,
                5046
            ],
            [
                5046,
                5113
            ],
            [
                5119,
                5121
            ],
            [
                5121,
                5130
            ],
            [
                5131,
                5175
            ],
            [
                5176,
                5204
            ],
            [
                5205,
                5318
            ],
            [
                5318,
                5353
            ],
            [
                5353,
                5355
            ],
            [
                5355,
                5440
            ],
            [
                5440,
                5494
            ],
            [
                5495,
                5546
            ],
            [
                5547,
                5623
            ],
            [
                5624,
                5625
            ],
            [
                5626,
                5629
            ],
            [
                5629,
                5631
            ],
            [
                5631,
                5670
            ],
            [
                5688,
                5723
            ],
            [
                5723,
                5730
            ],
            [
                5731,
                5737
            ],
            [
                5739,
                5809
            ],
            [
                5809,
                5827
            ],
            [
                5830,
                5833
            ],
            [
                5833,
                5842
            ],
            [
                5850,
                5884
            ],
            [
                5884,
                5886
            ],
            [
                5886,
                5916
            ],
            [
                5919,
                5951
            ],
            [
                5951,
                5979
            ],
            [
                5979,
                5992
            ],
            [
                5992,
                6045
            ],
            [
                6045,
                6054
            ],
            [
                6054,
                6102
            ],
            [
                6102,
                6137
            ],
            [
                6137,
                6249
            ],
            [
                6249,
                6406
            ],
            [
                6420,
                6421
            ],
            [
                6422,
                6435
            ],
            [
                6440,
                6445
            ],
            [
                6469,
                6493
            ],
            [
                6493,
                6540
            ],
            [
                6540,
                6637
            ],
            [
                6637,
                6649
            ],
            [
                6650,
                6723
            ],
            [
                6723,
                6730
            ],
            [
                6731,
                6740
            ],
            [
                6744,
                6771
            ],
            [
                6772,
                6814
            ],
            [
                6815,
                6820
            ],
            [
                6823,
                6901
            ],
            [
                6904,
                6910
            ],
            [
                6921,
                6981
            ],
            [
                6981,
                6987
            ],
            [
                6987,
                7095
            ],
            [
                7095,
                7119
            ],
            [
                7120,
                7170
            ],
            [
                7174,
                7200
            ],
            [
                7206,
                7266
            ],
            [
                7266,
                7310
            ],
            [
                7310,
                7340
            ],
            [
                7340,
                7434
            ],
            [
                7434,
                7499
            ],
            [
                7499,
                7547
            ],
            [
                7548,
                7551
            ],
            [
                7552,
                7560
            ],
            [
                7561,
                7579
            ],
            [
                7579,
                7581
            ],
            [
                7581,
                7674
            ],
            [
                7674,
                7777
            ],
            [
                7777,
                7818
            ],
            [
                7818,
                7849
            ],
            [
                7849,
                8021
            ],
            [
                8021,
                8040
            ],
            [
                8040,
                8047
            ],
            [
                8048,
                8098
            ],
            [
                8107,
                8138
            ],
            [
                8139,
                8142
            ],
            [
                8143,
                8162
            ],
            [
                8163,
                8181
            ],
            [
                8181,
                8194
            ],
            [
                8194,
                8205
            ],
            [
                8205,
                8207
            ],
            [
                8207,
                8286
            ],
            [
                8286,
                8293
            ],
            [
                8294,
                8303
            ],
            [
                8306,
                8329
            ],
            [
                8332,
                8335
            ],
            [
                8345,
                8347
            ],
            [
                8347,
                8403
            ],
            [
                8403,
                8429
            ],
            [
                8430,
                8440
            ],
            [
                8440,
                8503
            ],
            [
                8503,
                8505
            ],
            [
                8505,
                8526
            ],
            [
                8526,
                8537
            ],
            [
                8541,
                8545
            ],
            [
                8545,
                8597
            ],
            [
                8598,
                8616
            ],
            [
                8622,
                8645
            ],
            [
                8648,
                8671
            ],
            [
                8671,
                8673
            ],
            [
                8673,
                8716
            ],
            [
                8716,
                8750
            ],
            [
                8750,
                8752
            ],
            [
                8752,
                8776
            ],
            [
                8776,
                8799
            ],
            [
                8802,
                8813
            ],
            [
                8826,
                8835
            ],
            [
                8835,
                8867
            ],
            [
                8868,
                8907
            ],
            [
                8907,
                8929
            ],
            [
                8929,
                8949
            ],
            [
                8949,
                8973
            ],
            [
                8973,
                8985
            ],
            [
                8990,
                9044
            ],
            [
                9048,
                9085
            ],
            [
                9090,
                9104
            ],
            [
                9105,
                9173
            ],
            [
                9174,
                9199
            ],
            [
                9199,
                9275
            ],
            [
                9275,
                9303
            ],
            [
                9303,
                9305
            ],
            [
                9305,
                9363
            ],
            [
                9363,
                9415
            ],
            [
                9417,
                9420
            ],
            [
                9429,
                9436
            ],
            [
                9436,
                9438
            ],
            [
                9438,
                9486
            ],
            [
                9486,
                9601
            ],
            [
                9601,
                9626
            ],
            [
                9627,
                9630
            ],
            [
                9645,
                9652
            ],
            [
                9653,
                9679
            ],
            [
                9690,
                9700
            ],
            [
                9703,
                9729
            ],
            [
                9730,
                9733
            ],
            [
                9734,
                9792
            ],
            [
                9800,
                9803
            ],
            [
                9823,
                9828
            ],
            [
                9836,
                9838
            ],
            [
                9845,
                9888
            ],
            [
                9888,
                9924
            ],
            [
                9925,
                9991
            ],
            [
                9992,
                10029
            ],
            [
                10035,
                10061
            ],
            [
                10061,
                10131
            ],
            [
                10132,
                10138
            ],
            [
                10139,
                10183
            ],
            [
                10183,
                10185
            ],
            [
                10185,
                10265
            ],
            [
                10269,
                10276
            ],
            [
                10286,
                10289
            ],
            [
                10290,
                10315
            ],
            [
                10316,
                10344
            ],
            [
                10357,
                10367
            ],
            [
                10372,
                10379
            ],
            [
                10390,
                10409
            ],
            [
                10409,
                10411
            ],
            [
                10411,
                10435
            ],
            [
                10459,
                10469
            ],
            [
                10474,
                10488
            ],
            [
                10489,
                10492
            ],
            [
                10494,
                10567
            ],
            [
                10567,
                10587
            ],
            [
                10590,
                10618
            ],
            [
                10643,
                10645
            ],
            [
                10645,
                10657
            ],
            [
                10657,
                10670
            ],
            [
                10670,
                10728
            ],
            [
                10744,
                10799
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10922
            ],
            [
                10927,
                10933
            ],
            [
                10934,
                10985
            ],
            [
                10985,
                10997
            ],
            [
                11013,
                11050
            ],
            [
                11051,
                11153
            ],
            [
                11153,
                11182
            ],
            [
                11182,
                11189
            ],
            [
                11190,
                11326
            ],
            [
                11326,
                11387
            ],
            [
                11396,
                11398
            ],
            [
                11404,
                11408
            ],
            [
                11409,
                11431
            ],
            [
                11432,
                11434
            ],
            [
                11435,
                11532
            ],
            [
                11533,
                11562
            ],
            [
                11562,
                11590
            ],
            [
                11594,
                11598
            ],
            [
                11599,
                11611
            ],
            [
                11620,
                11703
            ],
            [
                11704,
                11781
            ],
            [
                11789,
                11800
            ],
            [
                11800,
                11878
            ],
            [
                11885,
                11909
            ],
            [
                11910,
                11955
            ],
            [
                11955,
                11957
            ],
            [
                11957,
                11964
            ],
            [
                11964,
                11965
            ],
            [
                11966,
                12069
            ],
            [
                12070,
                12103
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                69
            ],
            [
                69,
                229
            ],
            [
                229,
                229
            ],
            [
                229,
                307
            ],
            [
                307,
                606
            ],
            [
                606,
                807
            ],
            [
                807,
                1017
            ],
            [
                1017,
                1066
            ],
            [
                1066,
                1145
            ],
            [
                1145,
                1557
            ],
            [
                1557,
                1711
            ],
            [
                1711,
                1823
            ],
            [
                1823,
                1862
            ],
            [
                1862,
                1880
            ],
            [
                1880,
                1912
            ],
            [
                1912,
                1995
            ],
            [
                1995,
                2074
            ],
            [
                2074,
                2107
            ],
            [
                2107,
                2164
            ],
            [
                2164,
                2246
            ],
            [
                2246,
                2284
            ],
            [
                2284,
                2323
            ],
            [
                2323,
                2365
            ],
            [
                2365,
                2449
            ],
            [
                2449,
                2500
            ],
            [
                2500,
                2620
            ],
            [
                2620,
                2906
            ],
            [
                2906,
                3021
            ],
            [
                3021,
                3112
            ],
            [
                3112,
                3180
            ],
            [
                3180,
                3206
            ],
            [
                3206,
                3252
            ],
            [
                3252,
                3252
            ],
            [
                3252,
                3387
            ],
            [
                3387,
                3424
            ],
            [
                3424,
                3479
            ],
            [
                3479,
                3593
            ],
            [
                3593,
                3593
            ],
            [
                3593,
                3615
            ],
            [
                3615,
                3658
            ],
            [
                3658,
                3710
            ],
            [
                3710,
                3759
            ],
            [
                3759,
                3780
            ],
            [
                3780,
                4020
            ],
            [
                4020,
                4089
            ],
            [
                4089,
                4298
            ],
            [
                4298,
                4333
            ],
            [
                4333,
                4508
            ],
            [
                4508,
                4580
            ],
            [
                4580,
                4706
            ],
            [
                4706,
                4754
            ],
            [
                4754,
                4836
            ],
            [
                4836,
                4903
            ],
            [
                4903,
                5046
            ],
            [
                5046,
                5121
            ],
            [
                5121,
                5355
            ],
            [
                5355,
                5440
            ],
            [
                5440,
                5631
            ],
            [
                5631,
                5723
            ],
            [
                5723,
                5739
            ],
            [
                5739,
                5809
            ],
            [
                5809,
                5833
            ],
            [
                5833,
                5886
            ],
            [
                5886,
                5951
            ],
            [
                5951,
                5979
            ],
            [
                5979,
                5992
            ],
            [
                5992,
                6045
            ],
            [
                6045,
                6102
            ],
            [
                6102,
                6137
            ],
            [
                6137,
                6249
            ],
            [
                6249,
                6493
            ],
            [
                6493,
                6540
            ],
            [
                6540,
                6637
            ],
            [
                6637,
                6723
            ],
            [
                6723,
                6744
            ],
            [
                6744,
                6904
            ],
            [
                6904,
                6981
            ],
            [
                6981,
                6987
            ],
            [
                6987,
                7095
            ],
            [
                7095,
                7266
            ],
            [
                7266,
                7310
            ],
            [
                7310,
                7340
            ],
            [
                7340,
                7434
            ],
            [
                7434,
                7499
            ],
            [
                7499,
                7581
            ],
            [
                7581,
                7581
            ],
            [
                7581,
                7674
            ],
            [
                7674,
                7777
            ],
            [
                7777,
                7849
            ],
            [
                7849,
                8021
            ],
            [
                8021,
                8040
            ],
            [
                8040,
                8098
            ],
            [
                8098,
                8181
            ],
            [
                8181,
                8207
            ],
            [
                8207,
                8286
            ],
            [
                8286,
                8347
            ],
            [
                8347,
                8403
            ],
            [
                8403,
                8440
            ],
            [
                8440,
                8505
            ],
            [
                8505,
                8526
            ],
            [
                8526,
                8673
            ],
            [
                8673,
                8716
            ],
            [
                8716,
                8752
            ],
            [
                8752,
                8776
            ],
            [
                8776,
                8835
            ],
            [
                8835,
                8907
            ],
            [
                8907,
                8929
            ],
            [
                8929,
                8949
            ],
            [
                8949,
                8973
            ],
            [
                8973,
                9044
            ],
            [
                9044,
                9199
            ],
            [
                9199,
                9275
            ],
            [
                9275,
                9305
            ],
            [
                9305,
                9363
            ],
            [
                9363,
                9438
            ],
            [
                9438,
                9486
            ],
            [
                9486,
                9601
            ],
            [
                9601,
                9792
            ],
            [
                9792,
                9992
            ],
            [
                9992,
                9992
            ],
            [
                9992,
                10061
            ],
            [
                10061,
                10185
            ],
            [
                10185,
                10265
            ],
            [
                10265,
                10411
            ],
            [
                10411,
                10494
            ],
            [
                10494,
                10567
            ],
            [
                10567,
                10645
            ],
            [
                10645,
                10670
            ],
            [
                10670,
                10799
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10824
            ],
            [
                10824,
                10985
            ],
            [
                10985,
                11153
            ],
            [
                11153,
                11182
            ],
            [
                11182,
                11326
            ],
            [
                11326,
                11590
            ],
            [
                11590,
                11704
            ],
            [
                11704,
                11800
            ],
            [
                11800,
                11800
            ],
            [
                11800,
                11957
            ],
            [
                11957,
                12103
            ]
        ]
    }
}