{
    "original": {
        "text": "The godhead in us wrings our noble deeds From our reluctant selves.\nIt was an unpleasant surprise to Deronda when he returned from the Abbey to find the undesirable father installed in the lodgings at Brompton. Mirah had felt it necessary to speak of Deronda to her father, and even to make him as fully aware as she could of the way in which the friendship with Ezra had begun, and of the sympathy which had cemented it. She passed more lightly over what Deronda had done for her, omitting altogether the rescue from drowning, and speaking of the shelter she had found in Mrs. Meyrick's family so as to leave her father to suppose that it was through these friends Deronda had become acquainted with her. She could not persuade herself to more completeness in her narrative: she could not let the breath of her father's soul pass over her relation to Deronda. And Lapidoth, for reasons, was not eager in his questioning about the circumstances of her flight and arrival in England. But he was much interested in the fact of his children having a beneficent friend apparently high in the world.\nIt was the brother who told Deronda of this new condition added to their life. \"I am become calm in beholding him now,\" Ezra ended, \"and I try to think it possible that my sister's tenderness, and the daily tasting a life of peace, may win him to remain aloof from temptation. I have enjoined her, and she has promised, to trust him with no money. I have convinced her that he will buy with it his own destruction.\"\nDeronda first came on the third day from Ladipoth's arrival. The new clothes for which he had been measured were not yet ready, and wishing to make a favorable impression, he did not choose to present himself in the old ones. He watched for Deronda's departure, and, getting a view of him from the window, was rather surprised at his youthfulness, which Mirah had not mentioned, and which he had somehow thought out of the question in a personage who had taken up a grave friendship and hoary studies with the sepulchral Ezra. Lapidoth began to imagine that Deronda's real or chief motive must be that he was in love with Mirah. And so much the better; for a tie to Mirah had more promise of indulgence for her father than a tie to Ezra: and Lapidoth was not without the hope of recommending himself to Deronda, and of softening any hard prepossessions. He was behaving with much amiability, and trying in all ways at his command to get himself into easy domestication with his children--entering into Mirah's music, showing himself docile about smoking, which Mrs. Adam could not tolerate in her parlor, and walking out in the square with his German pipe, and the tobacco with which Mirah supplied him. He was too acute to offer any present remonstrance against the refusal of money, which Mirah told him that she must persist in as a solemn duty promised to her brother. He was comfortable enough to wait.\nThe next time Deronda came, Lapidoth, equipped in his new clothes, and satisfied with his own appearance, was in the room with Ezra, who was teaching himself, as a part of his severe duty, to tolerate his father's presence whenever it was imposed. Deronda was cold and distant, the first sight of this man, who had blighted the lives of his wife and children, creating in him a repulsion that was even a physical discomfort. But Lapidoth did not let himself be discouraged, asked leave to stay and hear the reading of papers from the old chest, and actually made himself useful in helping to decipher some difficult German manuscript. This led him to suggest that it might be desirable to make a transcription of the manuscript, and he offered his services for this purpose, and also to make copies of any papers in Roman characters. Though Ezra's young eyes he observed were getting weak, his own were still strong. Deronda accepted the offer, thinking that Lapidoth showed a sign of grace in the willingness to be employed usefully; and he saw a gratified expression in Ezra's face, who, however, presently said, \"Let all the writing be done here; for I cannot trust the papers out of my sight, lest there be an accident by burning or otherwise.\" Poor Ezra felt very much as if he had a convict on leave under his charge. Unless he saw his father working, it was not possible to believe that he would work in good faith. But by this arrangement he fastened on himself the burden of his father's presence, which was made painful not only through his deepest, longest associations, but also through Lapidoth's restlessness of temperament, which showed itself the more as he become familiarized with his situation, and lost any awe he had felt of his son. The fact was, he was putting a strong constraint on himself in confining his attention for the sake of winning Deronda's favor; and like a man in an uncomfortable garment he gave himself relief at every opportunity, going out to smoke, or moving about and talking, or throwing himself back in his chair and remaining silent, but incessantly carrying on a dumb language of facial movement or gesticulation: and if Mirah were in the room, he would fall into his old habit of talk with her, gossiping about their former doings and companions, or repeating quirks and stories, and plots of the plays he used to adapt, in the belief that he could at will command the vivacity of his earlier time. All this was a mortal infliction to Ezra; and when Mirah was at home she tried to relieve him, by getting her father down into the parlor and keeping watch over him there. What duty is made of a single difficult resolve? The difficulty lies in the daily unflinching support of consequences that mar the blessed return of morning with the prospect of irritation to be suppressed or shame to be endured. And such consequences were being borne by these, as by many other heroic children of an unworthy father--with the prospect, at least to Mirah, of their stretching onward through the solid part of life.\nMeanwhile Lapidoth's presence had raised a new impalpable partition between Deronda and Mirah--each of them dreading the soiling inferences of his mind, each of them interpreting mistakenly the increased reserve and diffidence of the other. But it was not very long before some light came to Deronda.\nAs soon as he could, after returning from his brief visit to the Abbey, he had called at Hans Meyrick's rooms, feeling it, on more grounds than one, a due of friendship that Hans should be at once acquainted with the reasons of his late journey, and the changes of intention it had brought about. Hans was not there; he was said to be in the country for a few days; and Deronda, after leaving a note, waited a week, rather expecting a note in return. But receiving no word, and fearing some freak of feeling in the incalculably susceptible Hans, whose proposed sojourn at the Abbey he knew had been deferred, he at length made a second call, and was admitted into the painting-room, where he found his friend in a light coat, without a waistcoat, his long hair still wet from a bath, but with a face looking worn and wizened--anything but country-like. He had taken up his palette and brushes, and stood before his easel when Deronda entered, but the equipment and attitude seemed to have been got up on short notice.\nAs they shook hands, Deronda said, \"You don't look much as if you had been in the country, old fellow. Is it Cambridge you have been to?\"\n\"No,\" said Hans, curtly, throwing down his palette with the air of one who has begun to feign by mistake; then pushing forward a chair for Deronda, he threw himself into another, and leaned backward with his hands behind his head, while he went on, \"I've been to I-don't-know-where--No man's land--and a mortally unpleasant country it is.\"\n\"You don't mean to say you have been drinking, Hans,\" said Deronda, who had seated himself opposite, in anxious survey.\n\"Nothing so good. I've been smoking opium. I always meant to do it some time or other, to try how much bliss could be got by it; and having found myself just now rather out of other bliss, I thought it judicious to seize the opportunity. But I pledge you my word I shall never tap a cask of that bliss again. It disagrees with my constitution.\"\n\"What has been the matter? You were in good spirits enough when you wrote to me.\"\n\"Oh, nothing in particular. The world began to look seedy--a sort of cabbage-garden with all the cabbages cut. A malady of genius, you may be sure,\" said Hans, creasing his face into a smile; \"and, in fact, I was tired of being virtuous without reward, especially in this hot London weather.\"\n\"Nothing else? No real vexation?\" said Deronda.\nHans shook his head.\n\"I came to tell you of my own affairs, but I can't do it with a good grace if you are to hide yours.\"\n\"Haven't an affair in the world,\" said Hans, in a flighty way, \"except a quarrel with a bric--brac man. Besides, as it is the first time in our lives that you ever spoke to me about your own affairs, you are only beginning to pay a pretty long debt.\"\nDeronda felt convinced that Hans was behaving artificially, but he trusted to a return of the old frankness by-and-by if he gave his own confidence.\n\"You laughed at the mystery of my journey to Italy, Hans,\" he began. \"It was for an object that touched my happiness at the very roots. I had never known anything about my parents, and I really went to Genoa to meet my mother. My father has been long dead--died when I was an infant. My mother was the daughter of an eminent Jew; my father was her cousin. Many things had caused me to think of this origin as almost a probability before I set out. I was so far prepared for the result that I was glad of it--glad to find myself a Jew.\"\n\"You must not expect me to look surprised, Deronda,\" said Hans, who had changed his attitude, laying one leg across the other and examining the heel of his slipper.\n\"You knew it?\"\n\"My mother told me. She went to the house the morning after you had been there--brother and sister both told her. You may imagine we can't rejoice as they do. But whatever you are glad of, I shall come to be glad of in the end--_when_ exactly the end may be I can't predict,\" said Hans, speaking in a low tone, which was as usual with him as it was to be out of humor with his lot, and yet bent on making no fuss about it.\n\"I quite understand that you can't share my feeling,\" said Deronda; \"but I could not let silence lie between us on what casts quite a new light over my future. I have taken up some of Mordecai's ideas, and I mean to try and carry them out, so far as one man's efforts can go. I dare say I shall by and by travel to the East and be away for some years.\"\nHans said nothing, but rose, seized his palette and began to work his brush on it, standing before his picture with his back to Deronda, who also felt himself at a break in his path embarrassed by Hans's embarrassment.\nPresently Hans said, again speaking low, and without turning, \"Excuse the question, but does Mrs. Grandcourt know of all this?\"\n\"No; and I must beg of you, Hans,\" said Deronda, rather angrily, \"to cease joking on that subject. Any notions you have are wide of the truth--are the very reverse of the truth.\"\n\"I am no more inclined to joke than I shall be at my own funeral,\" said Hans. \"But I am not at all sure that you are aware what are my notions on that subject.\"\n\"Perhaps not,\" said Deronda. \"But let me say, once for all, that in relation to Mrs. Grandcourt, I never have had, and never shall have the position of a lover. If you have ever seriously put that interpretation on anything you have observed, you are supremely mistaken.\"\nThere was silence a little while, and to each the silence was like an irritating air, exaggerating discomfort.\n\"Perhaps I have been mistaken in another interpretation, also,\" said Hans, presently.\n\"What is that?\"\n\"That you had no wish to hold the position of a lover toward another woman, who is neither wife nor widow.\"\n\"I can't pretend not to understand you, Meyrick. It is painful that our wishes should clash. I hope you will tell me if you have any ground for supposing that you would succeed.\"\n\"That seems rather a superfluous inquiry on your part, Deronda,\" said Hans, with some irritation.\n\"Why superfluous?\"\n\"Because you are perfectly convinced on the subject--and probably have had the very best evidence to convince you.\"\n\"I will be more frank with you than you are with me,\" said Deronda, still heated by Hans' show of temper, and yet sorry for him. \"I have never had the slightest evidence that I should succeed myself. In fact, I have very little hope.\"\nHans looked round hastily at his friend, but immediately turned to his picture again.\n\"And in our present situation,\" said Deronda, hurt by the idea that Hans suspected him of insincerity, and giving an offended emphasis to his words, \"I don't see how I can deliberately make known my feeling to her. If she could not return it, I should have embittered her best comfort; for neither she nor I can be parted from her brother, and we should have to meet continually. If I were to cause her that sort of pain by an unwilling betrayal of my feeling, I should be no better than a mischievous animal.\"\n\"I don't know that I have ever betrayed _my_ feeling to her,\" said Hans, as if he were vindicating himself.\n\"You mean that we are on a level, then; you have no reason to envy me.\"\n\"Oh, not the slightest,\" said Hans, with bitter irony. \"You have measured my conceit and know that it out-tops all your advantages.\"\n\"I am a nuisance to you, Meyrick. I am sorry, but I can't help it,\" said Deronda, rising. \"After what passed between us before, I wished to have this explanation; and I don't see that any pretensions of mine have made a real difference to you. They are not likely to make any pleasant difference to myself under present circumstances. Now the father is there--did you know that the father is there?\"\n\"Yes. If he were not a Jew I would permit myself to damn him--with faint praise, I mean,\" said Hans, but with no smile.\n\"She and I meet under greater constraint than ever. Things might go on in this way for two years without my getting any insight into her feeling toward me. That is the whole state of affairs, Hans. Neither you nor I have injured the other, that I can see. We must put up with this sort of rivalry in a hope that is likely enough to come to nothing. Our friendship can bear that strain, surely.\"\n\"No, it can't,\" said Hans, impetuously, throwing down his tools, thrusting his hands into his coat-pockets, and turning round to face Deronda, who drew back a little and looked at him with amazement. Hans went on in the same tone,\n\"Our friendship--my friendship--can't bear the strain of behaving to you like an ungrateful dastard and grudging you your happiness. For you _are_ the happiest dog in the world. If Mirah loves anybody better than her brother, _you are the man_.\"\nHans turned on his heel and threw himself into his chair, looking up at Deronda with an expression the reverse of tender. Something like a shock passed through Deronda, and, after an instant, he said,\n\"It is a good-natured fiction of yours, Hans.\"\n\"I am not in a good-natured mood. I assure you I found the fact disagreeable when it was thrust on me--all the more, or perhaps all the less, because I believed then that your heart was pledged to the duchess. But now, confound you! you turn out to be in love in the right place--a Jew--and everything eligible.\"\n\"Tell me what convinced you--there's a good fellow,\" said Deronda, distrusting a delight that he was unused to.\n\"Don't ask. Little mother was witness. The upshot is, that Mirah is jealous of the duchess, and the sooner you relieve your mind the better. There! I've cleared off a score or two, and may be allowed to swear at you for getting what you deserve--which is just the very best luck I know of.\"\n\"God bless you, Hans!\" said Deronda, putting out his hand, which the other took and wrung in silence.",
        "paragraph_chars": [
            [
                0,
                68
            ],
            [
                68,
                1095
            ],
            [
                1095,
                1511
            ],
            [
                1511,
                2919
            ],
            [
                2919,
                5970
            ],
            [
                5970,
                6271
            ],
            [
                6271,
                7289
            ],
            [
                7289,
                7427
            ],
            [
                7427,
                7767
            ],
            [
                7767,
                7887
            ],
            [
                7887,
                8232
            ],
            [
                8232,
                8314
            ],
            [
                8314,
                8607
            ],
            [
                8607,
                8655
            ],
            [
                8655,
                8676
            ],
            [
                8676,
                8778
            ],
            [
                8778,
                9029
            ],
            [
                9029,
                9178
            ],
            [
                9178,
                9714
            ],
            [
                9714,
                9879
            ],
            [
                9879,
                9894
            ],
            [
                9894,
                10317
            ],
            [
                10317,
                10670
            ],
            [
                10670,
                10889
            ],
            [
                10889,
                11017
            ],
            [
                11017,
                11196
            ],
            [
                11196,
                11357
            ],
            [
                11357,
                11629
            ],
            [
                11629,
                11740
            ],
            [
                11740,
                11826
            ],
            [
                11826,
                11842
            ],
            [
                11842,
                11950
            ],
            [
                11950,
                12129
            ],
            [
                12129,
                12227
            ],
            [
                12227,
                12246
            ],
            [
                12246,
                12362
            ],
            [
                12362,
                12597
            ],
            [
                12597,
                12683
            ],
            [
                12683,
                13194
            ],
            [
                13194,
                13302
            ],
            [
                13302,
                13374
            ],
            [
                13374,
                13507
            ],
            [
                13507,
                13907
            ],
            [
                13907,
                14027
            ],
            [
                14027,
                14422
            ],
            [
                14422,
                14653
            ],
            [
                14653,
                14899
            ],
            [
                14899,
                15100
            ],
            [
                15100,
                15147
            ],
            [
                15147,
                15460
            ],
            [
                15460,
                15572
            ],
            [
                15572,
                15863
            ],
            [
                15863,
                15964
            ]
        ],
        "segment_chars": [
            [
                0,
                68
            ],
            [
                68,
                211
            ],
            [
                211,
                422
            ],
            [
                422,
                706
            ],
            [
                706,
                861
            ],
            [
                861,
                983
            ],
            [
                983,
                1095
            ],
            [
                1095,
                1174
            ],
            [
                1174,
                1372
            ],
            [
                1372,
                1443
            ],
            [
                1443,
                1511
            ],
            [
                1511,
                1572
            ],
            [
                1572,
                1737
            ],
            [
                1737,
                2038
            ],
            [
                2038,
                2140
            ],
            [
                2140,
                2365
            ],
            [
                2365,
                2715
            ],
            [
                2715,
                2884
            ],
            [
                2884,
                2919
            ],
            [
                2919,
                3167
            ],
            [
                3167,
                3344
            ],
            [
                3344,
                3554
            ],
            [
                3554,
                3753
            ],
            [
                3753,
                3836
            ],
            [
                3836,
                4168
            ],
            [
                4168,
                4243
            ],
            [
                4243,
                4342
            ],
            [
                4342,
                4674
            ],
            [
                4674,
                5366
            ],
            [
                5366,
                5538
            ],
            [
                5538,
                5587
            ],
            [
                5587,
                5768
            ],
            [
                5768,
                5970
            ],
            [
                5970,
                6211
            ],
            [
                6211,
                6271
            ],
            [
                6271,
                6568
            ],
            [
                6568,
                6722
            ],
            [
                6722,
                7124
            ],
            [
                7124,
                7289
            ],
            [
                7289,
                7392
            ],
            [
                7392,
                7427
            ],
            [
                7427,
                7767
            ],
            [
                7767,
                7887
            ],
            [
                7887,
                7905
            ],
            [
                7905,
                7930
            ],
            [
                7930,
                8125
            ],
            [
                8125,
                8196
            ],
            [
                8196,
                8232
            ],
            [
                8232,
                8259
            ],
            [
                8259,
                8314
            ],
            [
                8314,
                8342
            ],
            [
                8342,
                8425
            ],
            [
                8425,
                8607
            ],
            [
                8607,
                8622
            ],
            [
                8622,
                8641
            ],
            [
                8641,
                8655
            ],
            [
                8655,
                8676
            ],
            [
                8676,
                8778
            ],
            [
                8778,
                8882
            ],
            [
                8882,
                9029
            ],
            [
                9029,
                9178
            ],
            [
                9178,
                9247
            ],
            [
                9247,
                9314
            ],
            [
                9314,
                9405
            ],
            [
                9405,
                9462
            ],
            [
                9462,
                9534
            ],
            [
                9534,
                9626
            ],
            [
                9626,
                9714
            ],
            [
                9714,
                9879
            ],
            [
                9879,
                9894
            ],
            [
                9894,
                9914
            ],
            [
                9914,
                10008
            ],
            [
                10008,
                10053
            ],
            [
                10053,
                10317
            ],
            [
                10317,
                10477
            ],
            [
                10477,
                10593
            ],
            [
                10593,
                10670
            ],
            [
                10670,
                10889
            ],
            [
                10889,
                11017
            ],
            [
                11017,
                11116
            ],
            [
                11116,
                11196
            ],
            [
                11196,
                11274
            ],
            [
                11274,
                11357
            ],
            [
                11357,
                11386
            ],
            [
                11386,
                11518
            ],
            [
                11518,
                11629
            ],
            [
                11629,
                11740
            ],
            [
                11740,
                11826
            ],
            [
                11826,
                11842
            ],
            [
                11842,
                11950
            ],
            [
                11950,
                11999
            ],
            [
                11999,
                12043
            ],
            [
                12043,
                12129
            ],
            [
                12129,
                12227
            ],
            [
                12227,
                12246
            ],
            [
                12246,
                12362
            ],
            [
                12362,
                12491
            ],
            [
                12491,
                12562
            ],
            [
                12562,
                12597
            ],
            [
                12597,
                12683
            ],
            [
                12683,
                12898
            ],
            [
                12898,
                13063
            ],
            [
                13063,
                13194
            ],
            [
                13194,
                13302
            ],
            [
                13302,
                13374
            ],
            [
                13374,
                13429
            ],
            [
                13429,
                13507
            ],
            [
                13507,
                13541
            ],
            [
                13541,
                13597
            ],
            [
                13597,
                13751
            ],
            [
                13751,
                13842
            ],
            [
                13842,
                13907
            ],
            [
                13907,
                13913
            ],
            [
                13913,
                14027
            ],
            [
                14027,
                14079
            ],
            [
                14079,
                14183
            ],
            [
                14183,
                14225
            ],
            [
                14225,
                14283
            ],
            [
                14283,
                14376
            ],
            [
                14376,
                14422
            ],
            [
                14422,
                14622
            ],
            [
                14622,
                14653
            ],
            [
                14653,
                14786
            ],
            [
                14786,
                14831
            ],
            [
                14831,
                14899
            ],
            [
                14899,
                15021
            ],
            [
                15021,
                15100
            ],
            [
                15100,
                15147
            ],
            [
                15147,
                15181
            ],
            [
                15181,
                15357
            ],
            [
                15357,
                15380
            ],
            [
                15380,
                15460
            ],
            [
                15460,
                15572
            ],
            [
                15572,
                15584
            ],
            [
                15584,
                15611
            ],
            [
                15611,
                15713
            ],
            [
                15713,
                15720
            ],
            [
                15720,
                15863
            ],
            [
                15863,
                15886
            ],
            [
                15886,
                15964
            ]
        ],
        "overlap_chars": [
            [
                68,
                125
            ],
            [
                141,
                211
            ],
            [
                211,
                273
            ],
            [
                291,
                294
            ],
            [
                304,
                309
            ],
            [
                323,
                325
            ],
            [
                343,
                378
            ],
            [
                482,
                531
            ],
            [
                610,
                620
            ],
            [
                624,
                636
            ],
            [
                556,
                563
            ],
            [
                456,
                463
            ],
            [
                644,
                651
            ],
            [
                326,
                329
            ],
            [
                578,
                580
            ],
            [
                704,
                706
            ],
            [
                990,
                1046
            ],
            [
                1058,
                1064
            ],
            [
                1076,
                1095
            ],
            [
                1174,
                1219
            ],
            [
                1225,
                1286
            ],
            [
                1327,
                1330
            ],
            [
                1335,
                1338
            ],
            [
                1355,
                1372
            ],
            [
                1374,
                1378
            ],
            [
                1415,
                1441
            ],
            [
                1391,
                1392
            ],
            [
                1469,
                1511
            ],
            [
                1533,
                1536
            ],
            [
                1519,
                1524
            ],
            [
                1511,
                1518
            ],
            [
                1525,
                1529
            ],
            [
                1572,
                1575
            ],
            [
                1560,
                1570
            ],
            [
                1637,
                1638
            ],
            [
                1557,
                1560
            ],
            [
                1686,
                1693
            ],
            [
                1704,
                1719
            ],
            [
                1681,
                1682
            ],
            [
                1588,
                1591
            ],
            [
                1576,
                1587
            ],
            [
                1619,
                1637
            ],
            [
                1735,
                1737
            ],
            [
                1800,
                1816
            ],
            [
                1737,
                1739
            ],
            [
                1817,
                1820
            ],
            [
                1828,
                1840
            ],
            [
                1752,
                1761
            ],
            [
                1845,
                1857
            ],
            [
                2162,
                2163
            ],
            [
                1900,
                1906
            ],
            [
                1796,
                1799
            ],
            [
                1958,
                1993
            ],
            [
                2012,
                2036
            ],
            [
                1771,
                1776
            ],
            [
                2047,
                2083
            ],
            [
                2093,
                2138
            ],
            [
                1859,
                1864
            ],
            [
                1748,
                1751
            ],
            [
                2038,
                2046
            ],
            [
                2174,
                2176
            ],
            [
                2303,
                2313
            ],
            [
                2036,
                2037
            ],
            [
                2365,
                2380
            ],
            [
                2391,
                2393
            ],
            [
                2401,
                2413
            ],
            [
                2441,
                2497
            ],
            [
                2508,
                2565
            ],
            [
                2616,
                2654
            ],
            [
                2662,
                2666
            ],
            [
                2668,
                2683
            ],
            [
                2689,
                2700
            ],
            [
                2710,
                2715
            ],
            [
                2715,
                2734
            ],
            [
                2753,
                2758
            ],
            [
                2766,
                2794
            ],
            [
                2884,
                2919
            ],
            [
                2919,
                2956
            ],
            [
                2990,
                3023
            ],
            [
                2966,
                2984
            ],
            [
                3023,
                3141
            ],
            [
                3165,
                3167
            ],
            [
                3167,
                3200
            ],
            [
                3207,
                3224
            ],
            [
                3226,
                3259
            ],
            [
                3279,
                3296
            ],
            [
                3323,
                3331
            ],
            [
                3297,
                3306
            ],
            [
                3342,
                3343
            ],
            [
                3344,
                3356
            ],
            [
                3361,
                3364
            ],
            [
                3380,
                3391
            ],
            [
                3393,
                3554
            ],
            [
                3554,
                3692
            ],
            [
                3751,
                3752
            ],
            [
                3836,
                3912
            ],
            [
                3917,
                4017
            ],
            [
                4028,
                4141
            ],
            [
                4165,
                4168
            ],
            [
                4168,
                4182
            ],
            [
                4193,
                4215
            ],
            [
                4225,
                4243
            ],
            [
                4342,
                4425
            ],
            [
                4529,
                4541
            ],
            [
                4556,
                4577
            ],
            [
                4582,
                4589
            ],
            [
                4518,
                4526
            ],
            [
                4593,
                4641
            ],
            [
                4466,
                4469
            ],
            [
                4646,
                4649
            ],
            [
                4662,
                4673
            ],
            [
                4674,
                4733
            ],
            [
                4761,
                4794
            ],
            [
                4800,
                4937
            ],
            [
                5080,
                5146
            ],
            [
                5162,
                5171
            ],
            [
                5212,
                5226
            ],
            [
                5238,
                5245
            ],
            [
                5286,
                5315
            ],
            [
                5324,
                5331
            ],
            [
                4747,
                4750
            ],
            [
                5336,
                5344
            ],
            [
                5364,
                5366
            ],
            [
                5366,
                5463
            ],
            [
                5472,
                5500
            ],
            [
                5536,
                5538
            ],
            [
                5700,
                5715
            ],
            [
                5543,
                5547
            ],
            [
                5727,
                5729
            ],
            [
                5853,
                5871
            ],
            [
                5901,
                5909
            ],
            [
                5753,
                5755
            ],
            [
                5931,
                5945
            ],
            [
                5964,
                5970
            ],
            [
                5970,
                6016
            ],
            [
                6028,
                6063
            ],
            [
                6065,
                6127
            ],
            [
                6136,
                6181
            ],
            [
                6197,
                6211
            ],
            [
                6211,
                6225
            ],
            [
                6231,
                6271
            ],
            [
                6343,
                6380
            ],
            [
                6329,
                6331
            ],
            [
                6332,
                6335
            ],
            [
                6496,
                6502
            ],
            [
                6508,
                6515
            ],
            [
                6566,
                6568
            ],
            [
                6568,
                6586
            ],
            [
                6635,
                6685
            ],
            [
                6720,
                6722
            ],
            [
                6722,
                6743
            ],
            [
                6878,
                6979
            ],
            [
                7071,
                7095
            ],
            [
                7122,
                7124
            ],
            [
                7124,
                7126
            ],
            [
                7169,
                7217
            ],
            [
                7245,
                7251
            ],
            [
                7252,
                7254
            ],
            [
                7287,
                7289
            ],
            [
                7289,
                7339
            ],
            [
                7378,
                7392
            ],
            [
                7392,
                7427
            ],
            [
                7427,
                7442
            ],
            [
                7444,
                7460
            ],
            [
                7584,
                7596
            ],
            [
                7554,
                7561
            ],
            [
                7676,
                7689
            ],
            [
                7710,
                7723
            ],
            [
                7691,
                7692
            ],
            [
                7725,
                7767
            ],
            [
                7767,
                7768
            ],
            [
                7794,
                7798
            ],
            [
                7768,
                7771
            ],
            [
                7799,
                7818
            ],
            [
                7821,
                7833
            ],
            [
                7866,
                7887
            ],
            [
                7905,
                7930
            ],
            [
                7930,
                7947
            ],
            [
                7977,
                7980
            ],
            [
                7951,
                7973
            ],
            [
                8076,
                8077
            ],
            [
                8123,
                8125
            ],
            [
                8125,
                8128
            ],
            [
                8150,
                8163
            ],
            [
                8189,
                8196
            ],
            [
                8196,
                8213
            ],
            [
                8229,
                8232
            ],
            [
                8232,
                8259
            ],
            [
                8259,
                8314
            ],
            [
                8314,
                8342
            ],
            [
                8342,
                8371
            ],
            [
                8373,
                8425
            ],
            [
                8425,
                8504
            ],
            [
                8607,
                8620
            ],
            [
                8641,
                8654
            ],
            [
                8676,
                8757
            ],
            [
                8765,
                8778
            ],
            [
                8778,
                8839
            ],
            [
                8880,
                8882
            ],
            [
                8882,
                8985
            ],
            [
                8991,
                9029
            ],
            [
                9029,
                9136
            ],
            [
                9147,
                9178
            ],
            [
                9178,
                9247
            ],
            [
                9314,
                9364
            ],
            [
                9372,
                9405
            ],
            [
                9405,
                9414
            ],
            [
                9440,
                9462
            ],
            [
                9462,
                9534
            ],
            [
                9534,
                9626
            ],
            [
                9626,
                9647
            ],
            [
                9663,
                9684
            ],
            [
                9691,
                9714
            ],
            [
                9714,
                9777
            ],
            [
                9808,
                9853
            ],
            [
                9866,
                9879
            ],
            [
                9879,
                9894
            ],
            [
                9894,
                9912
            ],
            [
                9948,
                9953
            ],
            [
                9982,
                9985
            ],
            [
                9998,
                10008
            ],
            [
                10024,
                10053
            ],
            [
                10053,
                10120
            ],
            [
                10167,
                10203
            ],
            [
                10315,
                10317
            ],
            [
                10317,
                10431
            ],
            [
                10466,
                10477
            ],
            [
                10477,
                10593
            ],
            [
                10604,
                10611
            ],
            [
                10622,
                10670
            ],
            [
                10670,
                10761
            ],
            [
                10781,
                10810
            ],
            [
                10816,
                10828
            ],
            [
                10852,
                10889
            ],
            [
                10889,
                10909
            ],
            [
                10934,
                10952
            ],
            [
                10977,
                11017
            ],
            [
                11017,
                11116
            ],
            [
                11116,
                11136
            ],
            [
                11160,
                11196
            ],
            [
                11274,
                11275
            ],
            [
                11279,
                11287
            ],
            [
                11295,
                11357
            ],
            [
                11357,
                11386
            ],
            [
                11386,
                11518
            ],
            [
                11518,
                11534
            ],
            [
                11549,
                11553
            ],
            [
                11598,
                11629
            ],
            [
                11629,
                11638
            ],
            [
                11696,
                11698
            ],
            [
                11639,
                11646
            ],
            [
                11738,
                11740
            ],
            [
                11740,
                11813
            ],
            [
                11824,
                11826
            ],
            [
                11826,
                11842
            ],
            [
                11842,
                11950
            ],
            [
                11950,
                11999
            ],
            [
                11999,
                12043
            ],
            [
                12043,
                12129
            ],
            [
                12129,
                12226
            ],
            [
                12246,
                12247
            ],
            [
                12255,
                12297
            ],
            [
                12299,
                12302
            ],
            [
                12303,
                12362
            ],
            [
                12362,
                12442
            ],
            [
                12489,
                12491
            ],
            [
                12491,
                12553
            ],
            [
                12560,
                12562
            ],
            [
                12562,
                12594
            ],
            [
                12684,
                12712
            ],
            [
                12727,
                12728
            ],
            [
                12833,
                12854
            ],
            [
                12868,
                12898
            ],
            [
                12898,
                12972
            ],
            [
                13027,
                13061
            ],
            [
                13010,
                13021
            ],
            [
                13061,
                13063
            ],
            [
                13342,
                13374
            ],
            [
                13374,
                13429
            ],
            [
                13429,
                13507
            ],
            [
                13507,
                13541
            ],
            [
                13541,
                13597
            ],
            [
                13597,
                13598
            ],
            [
                13674,
                13726
            ],
            [
                13732,
                13751
            ],
            [
                13751,
                13812
            ],
            [
                13840,
                13842
            ],
            [
                13842,
                13865
            ],
            [
                13986,
                13987
            ],
            [
                14028,
                14079
            ],
            [
                14079,
                14183
            ],
            [
                14183,
                14225
            ],
            [
                14225,
                14283
            ],
            [
                14283,
                14285
            ],
            [
                14329,
                14333
            ],
            [
                14376,
                14422
            ],
            [
                14422,
                14448
            ],
            [
                14462,
                14486
            ],
            [
                14530,
                14541
            ],
            [
                14548,
                14568
            ],
            [
                14592,
                14622
            ],
            [
                14622,
                14634
            ],
            [
                14651,
                14652
            ],
            [
                14653,
                14668
            ],
            [
                14685,
                14709
            ],
            [
                14670,
                14672
            ],
            [
                14710,
                14786
            ],
            [
                14831,
                14878
            ],
            [
                14880,
                14895
            ],
            [
                14896,
                14899
            ],
            [
                15036,
                15066
            ],
            [
                15073,
                15098
            ],
            [
                15100,
                15147
            ],
            [
                15147,
                15181
            ],
            [
                15194,
                15248
            ],
            [
                15297,
                15357
            ],
            [
                15357,
                15380
            ],
            [
                15380,
                15425
            ],
            [
                15427,
                15432
            ],
            [
                15434,
                15460
            ],
            [
                15460,
                15487
            ],
            [
                15489,
                15538
            ],
            [
                15541,
                15548
            ],
            [
                15570,
                15572
            ],
            [
                15572,
                15584
            ],
            [
                15584,
                15611
            ],
            [
                15611,
                15667
            ],
            [
                15720,
                15721
            ],
            [
                15757,
                15816
            ],
            [
                15818,
                15850
            ],
            [
                15860,
                15863
            ],
            [
                15863,
                15886
            ],
            [
                15886,
                15937
            ],
            [
                15953,
                15964
            ]
        ],
        "row_chars": [
            [
                0,
                68
            ],
            [
                68,
                211
            ],
            [
                211,
                706
            ],
            [
                706,
                861
            ],
            [
                861,
                983
            ],
            [
                983,
                1095
            ],
            [
                1095,
                1174
            ],
            [
                1174,
                1372
            ],
            [
                1372,
                1511
            ],
            [
                1511,
                1737
            ],
            [
                1737,
                2365
            ],
            [
                2365,
                2715
            ],
            [
                2715,
                2919
            ],
            [
                2919,
                3167
            ],
            [
                3167,
                3344
            ],
            [
                3344,
                3554
            ],
            [
                3554,
                3753
            ],
            [
                3753,
                3836
            ],
            [
                3836,
                4168
            ],
            [
                4168,
                4243
            ],
            [
                4243,
                4342
            ],
            [
                4342,
                4674
            ],
            [
                4674,
                5366
            ],
            [
                5366,
                5538
            ],
            [
                5538,
                5970
            ],
            [
                5970,
                6211
            ],
            [
                6211,
                6271
            ],
            [
                6271,
                6568
            ],
            [
                6568,
                6722
            ],
            [
                6722,
                7124
            ],
            [
                7124,
                7289
            ],
            [
                7289,
                7392
            ],
            [
                7392,
                7427
            ],
            [
                7427,
                7767
            ],
            [
                7767,
                7887
            ],
            [
                7887,
                7905
            ],
            [
                7905,
                7930
            ],
            [
                7930,
                8125
            ],
            [
                8125,
                8196
            ],
            [
                8196,
                8232
            ],
            [
                8232,
                8259
            ],
            [
                8259,
                8314
            ],
            [
                8314,
                8342
            ],
            [
                8342,
                8425
            ],
            [
                8425,
                8607
            ],
            [
                8607,
                8622
            ],
            [
                8622,
                8641
            ],
            [
                8641,
                8655
            ],
            [
                8655,
                8676
            ],
            [
                8676,
                8778
            ],
            [
                8778,
                8882
            ],
            [
                8882,
                9029
            ],
            [
                9029,
                9178
            ],
            [
                9178,
                9247
            ],
            [
                9247,
                9314
            ],
            [
                9314,
                9405
            ],
            [
                9405,
                9462
            ],
            [
                9462,
                9534
            ],
            [
                9534,
                9626
            ],
            [
                9626,
                9714
            ],
            [
                9714,
                9879
            ],
            [
                9879,
                9894
            ],
            [
                9894,
                10008
            ],
            [
                10008,
                10053
            ],
            [
                10053,
                10317
            ],
            [
                10317,
                10477
            ],
            [
                10477,
                10593
            ],
            [
                10593,
                10670
            ],
            [
                10670,
                10889
            ],
            [
                10889,
                11017
            ],
            [
                11017,
                11116
            ],
            [
                11116,
                11196
            ],
            [
                11196,
                11274
            ],
            [
                11274,
                11357
            ],
            [
                11357,
                11386
            ],
            [
                11386,
                11518
            ],
            [
                11518,
                11629
            ],
            [
                11629,
                11740
            ],
            [
                11740,
                11826
            ],
            [
                11826,
                11842
            ],
            [
                11842,
                11950
            ],
            [
                11950,
                11999
            ],
            [
                11999,
                12043
            ],
            [
                12043,
                12129
            ],
            [
                12129,
                12227
            ],
            [
                12227,
                12246
            ],
            [
                12246,
                12362
            ],
            [
                12362,
                12491
            ],
            [
                12491,
                12562
            ],
            [
                12562,
                12597
            ],
            [
                12597,
                12683
            ],
            [
                12683,
                12898
            ],
            [
                12898,
                13063
            ],
            [
                13063,
                13194
            ],
            [
                13194,
                13302
            ],
            [
                13302,
                13374
            ],
            [
                13374,
                13429
            ],
            [
                13429,
                13507
            ],
            [
                13507,
                13541
            ],
            [
                13541,
                13597
            ],
            [
                13597,
                13751
            ],
            [
                13751,
                13842
            ],
            [
                13842,
                14079
            ],
            [
                14079,
                14183
            ],
            [
                14183,
                14225
            ],
            [
                14225,
                14283
            ],
            [
                14283,
                14422
            ],
            [
                14422,
                14622
            ],
            [
                14622,
                14653
            ],
            [
                14653,
                14786
            ],
            [
                14786,
                14831
            ],
            [
                14831,
                14899
            ],
            [
                14899,
                15021
            ],
            [
                15021,
                15100
            ],
            [
                15100,
                15147
            ],
            [
                15147,
                15181
            ],
            [
                15181,
                15357
            ],
            [
                15357,
                15380
            ],
            [
                15380,
                15460
            ],
            [
                15460,
                15572
            ],
            [
                15572,
                15584
            ],
            [
                15584,
                15611
            ],
            [
                15611,
                15863
            ],
            [
                15863,
                15886
            ],
            [
                15886,
                15964
            ]
        ]
    },
    "abridged": {
        "text": "It was an unpleasant surprise to Deronda when he returned to find the undesirable father installed in the lodgings at Brompton. Mirah had felt it necessary to speak of Deronda to her father, making him aware of how the friendship with Ezra had begun, but omitting altogether the rescue from drowning, and letting her father suppose that she had met Deronda through the Meyricks. Lapidoth was much interested in the fact of his children having a friend high in the world.\n\"I am become calm in beholding him now,\" Ezra told Deronda, \"and I try to think it possible that my sister's tenderness may keep him from temptation. We have agreed to trust him with no money, for he will buy with it his own destruction.\"\nThe first time Deronda came after the father's arrival, Lapidoth did not present himself, for his new clothes were not yet ready. Watching from the window, he was surprised at Deronda's youthfulness; he had assumed him an older man who had taken up a grave friendship with the sepulchral Ezra, and began to imagine that Deronda's real motive must be that he was in love with Mirah; which might make it easier for Lapidoth to recommend himself to him.\nHe was behaving amiably, and trying to get himself into easy domestication with his children - entering into Mirah's music, showing himself docile about smoking, and walking out in the square with his pipe and the tobacco which Mirah gave him. He was too acute to remonstrate against the refusal of money: he was comfortable enough to wait.\nThe next time Deronda came, Lapidoth, satisfied with his own appearance in his new clothes, was in the room with Ezra, who was teaching himself, as a part of his severe duty, to tolerate his father's presence. Deronda was cold and distant, the sight of this man who had blighted the lives of his family creating in him a physical repulsion.\nBut Lapidoth was not discouraged: he asked leave to stay and hear the reading of papers from the old chest, and actually made himself useful in helping to decipher some difficult German manuscript. This led him to suggest that it might be desirable to make a transcription of the manuscript, and he offered his services for this purpose.\nDeronda accepted the offer, thinking that Lapidoth showed a sign of grace in this willingness to be employed usefully; and he saw a gratified expression in Ezra's face, who, however, said, \"Let all the writing be done here; for I cannot trust the papers out of my sight, lest there be an accident.\" Poor Ezra felt as if he had a convict under his charge. But by this arrangement he fastened on himself the burden of his father's presence, with all its restlessness, which showed itself more as Lapidoth become familiarized with his situation, and lost his awe of his son.\nThe fact was, he was putting a strong constraint on himself for the sake of winning Deronda's favour; and like a man in an uncomfortable garment he gave himself relief at every opportunity, going out to smoke, or moving about and talking; and if Mirah were in the room, he would fall into his old habit of gossiping, or repeating stories, in the belief that he could command his old vivacity. All this was a mortal infliction to Ezra; and when Mirah was at home she tried to relieve him, by taking her father down into the parlour. The prospect of this duty to an unworthy father seemed to Mirah to stretch onward through her life.\nMeanwhile Lapidoth's presence had raised a new partition between Deronda and Mirah - each of them dreading the soiling inferences of his mind, each interpreting mistakenly the increased reserve of the other. But it was not long before some light came to Deronda.\nHe had called at Hans Meyrick's rooms to let him know the outcome of his recent journey. Hans was not there; and Deronda, after leaving a note, waited a week. But receiving no word, he at length made a second call, and was admitted into the painting-room, where he found his friend looking worn and wizened. He stood before his easel when Deronda entered, but seemed not to be painting.\nAs they shook hands, Deronda said, \"You don't look well, old fellow. Is it Cambridge you have been to?\"\n\"No,\" said Hans curtly, throwing himself into a chair. \"I've been to No man's land - and a mortally unpleasant country it is.\"\n\"Have you been drinking, Hans?\" said Deronda, in anxious survey.\n\"I've been smoking opium. I always meant to try it some time or other, when I was feeling low. But I shall never do it again. It disagrees with me.\"\n\"What has been the matter? You were in good spirits enough when you wrote to me.\"\n\"Oh, nothing in particular. The world began to look seedy - a sort of cabbage-garden with all the cabbages cut. A malady of genius, you may be sure,\" said Hans, creasing his face into a smile.\n\"Nothing else?\" said Deronda. \"I came to tell you of my own affairs, but I can't do it with a good grace if you hide yours.\"\n\"Haven't an affair in the world,\" said Hans, in a flighty way. \"Besides, as it is the first time in our lives that you ever spoke to me about your own affairs, you are beginning to pay a pretty long debt.\"\nDeronda felt convinced that Hans was behaving artificially, but he trusted to a return of the old frankness if he gave his own confidence.\n\"You laughed at the mystery of my journey to Italy, Hans,\" he began. \"I had never known anything about my parents, and I went to Genoa to meet my mother. My father died when I was an infant. My mother was the daughter of an eminent Jew; my father was her cousin. Many things had caused me to think of this origin as almost a probability before I set out. I was so far prepared that I was glad of it - glad to find myself a Jew.\"\n\"You must not expect me to look surprised, Deronda,\" said Hans, laying one leg across the other and examining his slipper.\n\"You knew it?\"\n\"My mother told me, after Mirah and Ezra told her. We can't rejoice as they do. But whatever you are glad of, I shall come to be glad of in the end,\" said Hans, speaking in a low tone.\n\"I quite understand that you can't share my feeling,\" said Deronda; \"but I could not let silence lie between us on my future. I have taken up some of Mordecai's ideas, and I mean to try and carry them out, so far as one man's efforts can go. I shall travel to the East and be away for some years.\"\nHans said nothing, but rose, seized his palette and began to work his brush on it, standing with his back to Deronda, who felt himself embarrassed by Hans's embarrassment.\nPresently Hans said, without turning, \"Does Mrs. Grandcourt know of all this?\"\n\"No; and I must beg of you, Hans,\" said Deronda, rather angrily, \"to cease joking on that subject. Any notions you have are the very reverse of the truth.\"\n\"I am not sure that you are aware what are my notions on that subject.\"\n\"Perhaps not,\" said Deronda. \"But let me say, once for all, that in relation to Mrs. Grandcourt, I never have had, and never shall have the position of a lover. If you have ever thought that, you are supremely mistaken.\"\nThere was an uncomfortable silence.\n\"Perhaps I have been mistaken in another interpretation, also,\" said Hans.\n\"What is that?\"\n\"That you had no wish to hold the position of a lover toward another woman, who is neither wife nor widow.\"\n\"I can't pretend not to understand you, Meyrick. It is painful that our wishes should clash. I hope you will tell me if you have any ground for supposing that you would succeed.\"\n\"That seems rather a superfluous inquiry on your part, Deronda,\" said Hans, with some irritation. \"You are perfectly convinced on the subject - and you probably have had the very best evidence to convince you.\"\n\"I will be more frank with you than you are with me,\" said Deronda, still heated. \"I have never had the slightest evidence that I should succeed. In fact, I have very little hope. And in our present situation, I don't see how I can make known my feeling to her. If she could not return it, I should have embittered her best comfort; for we should have to meet continually to tend to her brother. You have no reason to envy me.\"\n\"Oh, not the slightest,\" said Hans, with bitter irony. \"You have measured my conceit and know that it out-tops all your advantages.\"\n\"I am a nuisance to you, Meyrick. I am sorry, but I can't help it,\" said Deronda, rising. \"I don't see that any pretensions of mine have made a difference to you. They are not likely to make any pleasant difference to myself. Now the father is there, she and I meet under greater constraint than ever. Things might go on in this way for two years without my getting any insight into her feeling toward me. That is the whole state of affairs, Hans. Neither you nor I have injured the other, that I can see. We are rivals without hope: our friendship can bear that strain, surely.\"\n\"No, it can't,\" said Hans, throwing down his tools, and turning to face Deronda, who looked at him with amazement. Hans went on, with a fierce expression-\n\"Our friendship can't bear the strain of my behaving to you like an ungrateful dastard and grudging you your happiness. If Mirah loves anybody better than her brother, you are the man.\"\nA shock passed through Deronda. After an instant, he said-\n\"It is a good-natured fiction of yours, Hans.\"\n\"I am not in a good-natured mood. I found the fact disagreeable when it was thrust on me: I believed then that your heart was pledged to the duchess. But now, confound you! you turn out to be in love in the right place - a Jew - and everything eligible.\"\n\"Tell me what convinced you - there's a good fellow,\" said Deronda, distrusting his unfamiliar delight.\n\"Don't ask. Little mother was witness. The upshot is, that Mirah is jealous of the duchess, and I may be allowed to swear at you for getting what you deserve - which is just the very best luck.\"\n\"God bless you, Hans!\" said Deronda, putting out his hand, which the other shook in silence.",
        "paragraph_chars": [
            [
                0,
                471
            ],
            [
                471,
                710
            ],
            [
                710,
                1161
            ],
            [
                1161,
                1502
            ],
            [
                1502,
                1843
            ],
            [
                1843,
                2181
            ],
            [
                2181,
                2753
            ],
            [
                2753,
                3385
            ],
            [
                3385,
                3648
            ],
            [
                3648,
                4035
            ],
            [
                4035,
                4139
            ],
            [
                4139,
                4266
            ],
            [
                4266,
                4331
            ],
            [
                4331,
                4480
            ],
            [
                4480,
                4562
            ],
            [
                4562,
                4755
            ],
            [
                4755,
                4880
            ],
            [
                4880,
                5086
            ],
            [
                5086,
                5225
            ],
            [
                5225,
                5654
            ],
            [
                5654,
                5777
            ],
            [
                5777,
                5792
            ],
            [
                5792,
                5977
            ],
            [
                5977,
                6275
            ],
            [
                6275,
                6447
            ],
            [
                6447,
                6526
            ],
            [
                6526,
                6682
            ],
            [
                6682,
                6754
            ],
            [
                6754,
                6975
            ],
            [
                6975,
                7011
            ],
            [
                7011,
                7086
            ],
            [
                7086,
                7102
            ],
            [
                7102,
                7210
            ],
            [
                7210,
                7389
            ],
            [
                7389,
                7600
            ],
            [
                7600,
                8028
            ],
            [
                8028,
                8161
            ],
            [
                8161,
                8741
            ],
            [
                8741,
                8896
            ],
            [
                8896,
                9082
            ],
            [
                9082,
                9141
            ],
            [
                9141,
                9188
            ],
            [
                9188,
                9443
            ],
            [
                9443,
                9547
            ],
            [
                9547,
                9742
            ],
            [
                9742,
                9834
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                379
            ],
            [
                379,
                471
            ],
            [
                471,
                621
            ],
            [
                621,
                710
            ],
            [
                710,
                840
            ],
            [
                840,
                1161
            ],
            [
                1161,
                1405
            ],
            [
                1405,
                1502
            ],
            [
                1502,
                1712
            ],
            [
                1712,
                1843
            ],
            [
                1843,
                2041
            ],
            [
                2041,
                2181
            ],
            [
                2181,
                2480
            ],
            [
                2480,
                2536
            ],
            [
                2536,
                2753
            ],
            [
                2753,
                3146
            ],
            [
                3146,
                3285
            ],
            [
                3285,
                3385
            ],
            [
                3385,
                3593
            ],
            [
                3593,
                3648
            ],
            [
                3648,
                3737
            ],
            [
                3737,
                3807
            ],
            [
                3807,
                3956
            ],
            [
                3956,
                4035
            ],
            [
                4035,
                4104
            ],
            [
                4104,
                4139
            ],
            [
                4139,
                4194
            ],
            [
                4194,
                4266
            ],
            [
                4266,
                4298
            ],
            [
                4298,
                4331
            ],
            [
                4331,
                4357
            ],
            [
                4357,
                4426
            ],
            [
                4426,
                4457
            ],
            [
                4457,
                4480
            ],
            [
                4480,
                4507
            ],
            [
                4507,
                4562
            ],
            [
                4562,
                4590
            ],
            [
                4590,
                4674
            ],
            [
                4674,
                4755
            ],
            [
                4755,
                4771
            ],
            [
                4771,
                4785
            ],
            [
                4785,
                4880
            ],
            [
                4880,
                4943
            ],
            [
                4943,
                5086
            ],
            [
                5086,
                5225
            ],
            [
                5225,
                5294
            ],
            [
                5294,
                5379
            ],
            [
                5379,
                5416
            ],
            [
                5416,
                5488
            ],
            [
                5488,
                5580
            ],
            [
                5580,
                5654
            ],
            [
                5654,
                5777
            ],
            [
                5777,
                5792
            ],
            [
                5792,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                5977
            ],
            [
                5977,
                6103
            ],
            [
                6103,
                6219
            ],
            [
                6219,
                6275
            ],
            [
                6275,
                6447
            ],
            [
                6447,
                6526
            ],
            [
                6526,
                6625
            ],
            [
                6625,
                6682
            ],
            [
                6682,
                6754
            ],
            [
                6754,
                6783
            ],
            [
                6783,
                6915
            ],
            [
                6915,
                6975
            ],
            [
                6975,
                7011
            ],
            [
                7011,
                7086
            ],
            [
                7086,
                7102
            ],
            [
                7102,
                7210
            ],
            [
                7210,
                7259
            ],
            [
                7259,
                7303
            ],
            [
                7303,
                7389
            ],
            [
                7389,
                7487
            ],
            [
                7487,
                7600
            ],
            [
                7600,
                7682
            ],
            [
                7682,
                7746
            ],
            [
                7746,
                7780
            ],
            [
                7780,
                7862
            ],
            [
                7862,
                7996
            ],
            [
                7996,
                8028
            ],
            [
                8028,
                8083
            ],
            [
                8083,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8324
            ],
            [
                8324,
                8387
            ],
            [
                8387,
                8463
            ],
            [
                8463,
                8567
            ],
            [
                8567,
                8609
            ],
            [
                8609,
                8667
            ],
            [
                8667,
                8741
            ],
            [
                8741,
                8856
            ],
            [
                8856,
                8896
            ],
            [
                8896,
                9016
            ],
            [
                9016,
                9082
            ],
            [
                9082,
                9114
            ],
            [
                9114,
                9141
            ],
            [
                9141,
                9188
            ],
            [
                9188,
                9222
            ],
            [
                9222,
                9338
            ],
            [
                9338,
                9361
            ],
            [
                9361,
                9443
            ],
            [
                9443,
                9547
            ],
            [
                9547,
                9559
            ],
            [
                9559,
                9586
            ],
            [
                9586,
                9742
            ],
            [
                9742,
                9765
            ],
            [
                9765,
                9834
            ]
        ],
        "overlap_chars": [
            [
                0,
                57
            ],
            [
                58,
                128
            ],
            [
                128,
                190
            ],
            [
                198,
                201
            ],
            [
                202,
                207
            ],
            [
                208,
                210
            ],
            [
                215,
                250
            ],
            [
                255,
                304
            ],
            [
                313,
                323
            ],
            [
                324,
                336
            ],
            [
                337,
                344
            ],
            [
                349,
                356
            ],
            [
                357,
                364
            ],
            [
                365,
                368
            ],
            [
                369,
                371
            ],
            [
                377,
                379
            ],
            [
                388,
                444
            ],
            [
                445,
                451
            ],
            [
                452,
                471
            ],
            [
                471,
                516
            ],
            [
                529,
                590
            ],
            [
                591,
                594
            ],
            [
                600,
                603
            ],
            [
                604,
                621
            ],
            [
                624,
                628
            ],
            [
                636,
                662
            ],
            [
                662,
                663
            ],
            [
                668,
                710
            ],
            [
                710,
                713
            ],
            [
                714,
                719
            ],
            [
                725,
                732
            ],
            [
                733,
                737
            ],
            [
                744,
                747
            ],
            [
                754,
                764
            ],
            [
                764,
                765
            ],
            [
                771,
                774
            ],
            [
                775,
                782
            ],
            [
                783,
                798
            ],
            [
                798,
                799
            ],
            [
                800,
                803
            ],
            [
                808,
                819
            ],
            [
                820,
                838
            ],
            [
                838,
                840
            ],
            [
                849,
                865
            ],
            [
                866,
                868
            ],
            [
                869,
                872
            ],
            [
                873,
                885
            ],
            [
                886,
                895
            ],
            [
                896,
                908
            ],
            [
                908,
                909
            ],
            [
                910,
                916
            ],
            [
                925,
                928
            ],
            [
                942,
                977
            ],
            [
                978,
                1002
            ],
            [
                1002,
                1007
            ],
            [
                1008,
                1044
            ],
            [
                1045,
                1090
            ],
            [
                1092,
                1097
            ],
            [
                1119,
                1122
            ],
            [
                1123,
                1131
            ],
            [
                1132,
                1134
            ],
            [
                1145,
                1155
            ],
            [
                1159,
                1160
            ],
            [
                1161,
                1176
            ],
            [
                1177,
                1179
            ],
            [
                1184,
                1196
            ],
            [
                1197,
                1253
            ],
            [
                1265,
                1322
            ],
            [
                1323,
                1361
            ],
            [
                1362,
                1366
            ],
            [
                1367,
                1382
            ],
            [
                1383,
                1394
            ],
            [
                1400,
                1405
            ],
            [
                1405,
                1424
            ],
            [
                1425,
                1430
            ],
            [
                1437,
                1465
            ],
            [
                1467,
                1502
            ],
            [
                1502,
                1539
            ],
            [
                1540,
                1573
            ],
            [
                1574,
                1592
            ],
            [
                1592,
                1710
            ],
            [
                1710,
                1712
            ],
            [
                1712,
                1745
            ],
            [
                1746,
                1763
            ],
            [
                1764,
                1797
            ],
            [
                1805,
                1822
            ],
            [
                1823,
                1831
            ],
            [
                1832,
                1841
            ],
            [
                1841,
                1842
            ],
            [
                1843,
                1855
            ],
            [
                1860,
                1863
            ],
            [
                1864,
                1875
            ],
            [
                1880,
                2041
            ],
            [
                2041,
                2179
            ],
            [
                2179,
                2180
            ],
            [
                2181,
                2257
            ],
            [
                2263,
                2363
            ],
            [
                2364,
                2477
            ],
            [
                2477,
                2480
            ],
            [
                2480,
                2494
            ],
            [
                2495,
                2517
            ],
            [
                2518,
                2536
            ],
            [
                2536,
                2619
            ],
            [
                2633,
                2645
            ],
            [
                2645,
                2666
            ],
            [
                2667,
                2674
            ],
            [
                2675,
                2683
            ],
            [
                2684,
                2732
            ],
            [
                2733,
                2736
            ],
            [
                2737,
                2740
            ],
            [
                2741,
                2752
            ],
            [
                2753,
                2812
            ],
            [
                2813,
                2846
            ],
            [
                2853,
                2990
            ],
            [
                2992,
                3058
            ],
            [
                3059,
                3068
            ],
            [
                3068,
                3082
            ],
            [
                3083,
                3090
            ],
            [
                3090,
                3119
            ],
            [
                3120,
                3127
            ],
            [
                3128,
                3131
            ],
            [
                3136,
                3144
            ],
            [
                3144,
                3146
            ],
            [
                3146,
                3243
            ],
            [
                3251,
                3279
            ],
            [
                3283,
                3285
            ],
            [
                3285,
                3300
            ],
            [
                3306,
                3310
            ],
            [
                3311,
                3313
            ],
            [
                3314,
                3332
            ],
            [
                3340,
                3348
            ],
            [
                3349,
                3351
            ],
            [
                3360,
                3374
            ],
            [
                3379,
                3385
            ],
            [
                3385,
                3431
            ],
            [
                3432,
                3467
            ],
            [
                3470,
                3532
            ],
            [
                3533,
                3578
            ],
            [
                3579,
                3593
            ],
            [
                3593,
                3607
            ],
            [
                3608,
                3648
            ],
            [
                3648,
                3685
            ],
            [
                3686,
                3688
            ],
            [
                3702,
                3705
            ],
            [
                3714,
                3720
            ],
            [
                3728,
                3735
            ],
            [
                3735,
                3737
            ],
            [
                3737,
                3755
            ],
            [
                3755,
                3805
            ],
            [
                3805,
                3807
            ],
            [
                3807,
                3828
            ],
            [
                3828,
                3929
            ],
            [
                3930,
                3954
            ],
            [
                3954,
                3956
            ],
            [
                3956,
                3958
            ],
            [
                3959,
                4007
            ],
            [
                4008,
                4014
            ],
            [
                4019,
                4021
            ],
            [
                4033,
                4035
            ],
            [
                4035,
                4085
            ],
            [
                4090,
                4104
            ],
            [
                4104,
                4139
            ],
            [
                4139,
                4154
            ],
            [
                4155,
                4171
            ],
            [
                4172,
                4184
            ],
            [
                4185,
                4192
            ],
            [
                4194,
                4207
            ],
            [
                4208,
                4221
            ],
            [
                4222,
                4223
            ],
            [
                4224,
                4266
            ],
            [
                4266,
                4267
            ],
            [
                4267,
                4271
            ],
            [
                4272,
                4275
            ],
            [
                4276,
                4295
            ],
            [
                4298,
                4310
            ],
            [
                4310,
                4331
            ],
            [
                4332,
                4357
            ],
            [
                4357,
                4374
            ],
            [
                4375,
                4378
            ],
            [
                4379,
                4401
            ],
            [
                4407,
                4408
            ],
            [
                4424,
                4426
            ],
            [
                4426,
                4429
            ],
            [
                4430,
                4443
            ],
            [
                4450,
                4457
            ],
            [
                4457,
                4474
            ],
            [
                4477,
                4480
            ],
            [
                4480,
                4507
            ],
            [
                4507,
                4562
            ],
            [
                4562,
                4590
            ],
            [
                4590,
                4619
            ],
            [
                4622,
                4674
            ],
            [
                4674,
                4753
            ],
            [
                4755,
                4768
            ],
            [
                4771,
                4784
            ],
            [
                4785,
                4866
            ],
            [
                4867,
                4880
            ],
            [
                4880,
                4941
            ],
            [
                4941,
                4943
            ],
            [
                4944,
                5047
            ],
            [
                5048,
                5086
            ],
            [
                5086,
                5193
            ],
            [
                5194,
                5225
            ],
            [
                5225,
                5294
            ],
            [
                5295,
                5345
            ],
            [
                5346,
                5379
            ],
            [
                5379,
                5388
            ],
            [
                5394,
                5416
            ],
            [
                5416,
                5488
            ],
            [
                5488,
                5580
            ],
            [
                5580,
                5601
            ],
            [
                5602,
                5623
            ],
            [
                5631,
                5654
            ],
            [
                5654,
                5717
            ],
            [
                5718,
                5763
            ],
            [
                5764,
                5777
            ],
            [
                5777,
                5792
            ],
            [
                5792,
                5810
            ],
            [
                5812,
                5817
            ],
            [
                5824,
                5827
            ],
            [
                5833,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                5939
            ],
            [
                5939,
                5975
            ],
            [
                5975,
                5977
            ],
            [
                5977,
                6091
            ],
            [
                6092,
                6103
            ],
            [
                6103,
                6219
            ],
            [
                6219,
                6226
            ],
            [
                6227,
                6275
            ],
            [
                6275,
                6366
            ],
            [
                6367,
                6396
            ],
            [
                6397,
                6409
            ],
            [
                6410,
                6447
            ],
            [
                6447,
                6467
            ],
            [
                6468,
                6486
            ],
            [
                6486,
                6526
            ],
            [
                6526,
                6625
            ],
            [
                6625,
                6645
            ],
            [
                6646,
                6682
            ],
            [
                6682,
                6683
            ],
            [
                6683,
                6691
            ],
            [
                6692,
                6754
            ],
            [
                6754,
                6783
            ],
            [
                6783,
                6915
            ],
            [
                6915,
                6931
            ],
            [
                6940,
                6944
            ],
            [
                6944,
                6975
            ],
            [
                6975,
                6984
            ],
            [
                6985,
                6987
            ],
            [
                7002,
                7009
            ],
            [
                7009,
                7011
            ],
            [
                7011,
                7084
            ],
            [
                7084,
                7086
            ],
            [
                7086,
                7102
            ],
            [
                7102,
                7210
            ],
            [
                7210,
                7259
            ],
            [
                7259,
                7303
            ],
            [
                7303,
                7389
            ],
            [
                7389,
                7486
            ],
            [
                7487,
                7488
            ],
            [
                7488,
                7530
            ],
            [
                7533,
                7536
            ],
            [
                7541,
                7600
            ],
            [
                7600,
                7680
            ],
            [
                7680,
                7682
            ],
            [
                7682,
                7744
            ],
            [
                7744,
                7746
            ],
            [
                7746,
                7778
            ],
            [
                7780,
                7808
            ],
            [
                7808,
                7809
            ],
            [
                7810,
                7831
            ],
            [
                7832,
                7862
            ],
            [
                7862,
                7936
            ],
            [
                7937,
                7971
            ],
            [
                7983,
                7994
            ],
            [
                7994,
                7996
            ],
            [
                7996,
                8028
            ],
            [
                8028,
                8083
            ],
            [
                8083,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8252
            ],
            [
                8252,
                8304
            ],
            [
                8305,
                8324
            ],
            [
                8324,
                8385
            ],
            [
                8385,
                8387
            ],
            [
                8387,
                8410
            ],
            [
                8410,
                8411
            ],
            [
                8412,
                8463
            ],
            [
                8463,
                8567
            ],
            [
                8567,
                8609
            ],
            [
                8609,
                8667
            ],
            [
                8667,
                8669
            ],
            [
                8689,
                8693
            ],
            [
                8695,
                8741
            ],
            [
                8741,
                8767
            ],
            [
                8768,
                8792
            ],
            [
                8793,
                8804
            ],
            [
                8805,
                8825
            ],
            [
                8826,
                8856
            ],
            [
                8856,
                8868
            ],
            [
                8868,
                8869
            ],
            [
                8896,
                8911
            ],
            [
                8912,
                8936
            ],
            [
                8937,
                8939
            ],
            [
                8940,
                9016
            ],
            [
                9016,
                9063
            ],
            [
                9064,
                9079
            ],
            [
                9079,
                9082
            ],
            [
                9082,
                9112
            ],
            [
                9114,
                9139
            ],
            [
                9141,
                9188
            ],
            [
                9188,
                9222
            ],
            [
                9222,
                9276
            ],
            [
                9278,
                9338
            ],
            [
                9338,
                9361
            ],
            [
                9361,
                9406
            ],
            [
                9409,
                9414
            ],
            [
                9417,
                9443
            ],
            [
                9443,
                9470
            ],
            [
                9473,
                9522
            ],
            [
                9538,
                9545
            ],
            [
                9545,
                9547
            ],
            [
                9547,
                9559
            ],
            [
                9559,
                9586
            ],
            [
                9586,
                9642
            ],
            [
                9643,
                9644
            ],
            [
                9645,
                9704
            ],
            [
                9707,
                9739
            ],
            [
                9739,
                9742
            ],
            [
                9742,
                9765
            ],
            [
                9765,
                9816
            ],
            [
                9823,
                9834
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                128
            ],
            [
                128,
                379
            ],
            [
                379,
                379
            ],
            [
                379,
                379
            ],
            [
                379,
                471
            ],
            [
                471,
                471
            ],
            [
                471,
                621
            ],
            [
                621,
                710
            ],
            [
                710,
                840
            ],
            [
                840,
                1161
            ],
            [
                1161,
                1405
            ],
            [
                1405,
                1502
            ],
            [
                1502,
                1712
            ],
            [
                1712,
                1843
            ],
            [
                1843,
                2041
            ],
            [
                2041,
                2181
            ],
            [
                2181,
                2181
            ],
            [
                2181,
                2480
            ],
            [
                2480,
                2536
            ],
            [
                2536,
                2536
            ],
            [
                2536,
                2753
            ],
            [
                2753,
                3146
            ],
            [
                3146,
                3285
            ],
            [
                3285,
                3385
            ],
            [
                3385,
                3593
            ],
            [
                3593,
                3648
            ],
            [
                3648,
                3737
            ],
            [
                3737,
                3807
            ],
            [
                3807,
                3956
            ],
            [
                3956,
                4035
            ],
            [
                4035,
                4104
            ],
            [
                4104,
                4139
            ],
            [
                4139,
                4266
            ],
            [
                4266,
                4331
            ],
            [
                4331,
                4331
            ],
            [
                4331,
                4357
            ],
            [
                4357,
                4426
            ],
            [
                4426,
                4457
            ],
            [
                4457,
                4480
            ],
            [
                4480,
                4507
            ],
            [
                4507,
                4562
            ],
            [
                4562,
                4590
            ],
            [
                4590,
                4674
            ],
            [
                4674,
                4755
            ],
            [
                4755,
                4771
            ],
            [
                4771,
                4771
            ],
            [
                4771,
                4785
            ],
            [
                4785,
                4785
            ],
            [
                4785,
                4880
            ],
            [
                4880,
                4943
            ],
            [
                4943,
                5086
            ],
            [
                5086,
                5225
            ],
            [
                5225,
                5294
            ],
            [
                5294,
                5294
            ],
            [
                5294,
                5379
            ],
            [
                5379,
                5416
            ],
            [
                5416,
                5488
            ],
            [
                5488,
                5580
            ],
            [
                5580,
                5654
            ],
            [
                5654,
                5777
            ],
            [
                5777,
                5792
            ],
            [
                5792,
                5843
            ],
            [
                5843,
                5872
            ],
            [
                5872,
                5977
            ],
            [
                5977,
                6103
            ],
            [
                6103,
                6219
            ],
            [
                6219,
                6275
            ],
            [
                6275,
                6447
            ],
            [
                6447,
                6526
            ],
            [
                6526,
                6625
            ],
            [
                6625,
                6682
            ],
            [
                6682,
                6682
            ],
            [
                6682,
                6754
            ],
            [
                6754,
                6783
            ],
            [
                6783,
                6915
            ],
            [
                6915,
                6975
            ],
            [
                6975,
                7011
            ],
            [
                7011,
                7086
            ],
            [
                7086,
                7102
            ],
            [
                7102,
                7210
            ],
            [
                7210,
                7259
            ],
            [
                7259,
                7303
            ],
            [
                7303,
                7389
            ],
            [
                7389,
                7487
            ],
            [
                7487,
                7487
            ],
            [
                7487,
                7600
            ],
            [
                7600,
                7682
            ],
            [
                7682,
                7746
            ],
            [
                7746,
                7780
            ],
            [
                7780,
                7780
            ],
            [
                7780,
                7862
            ],
            [
                7862,
                7996
            ],
            [
                7996,
                7996
            ],
            [
                7996,
                7996
            ],
            [
                7996,
                8028
            ],
            [
                8028,
                8083
            ],
            [
                8083,
                8161
            ],
            [
                8161,
                8195
            ],
            [
                8195,
                8251
            ],
            [
                8251,
                8324
            ],
            [
                8324,
                8387
            ],
            [
                8387,
                8463
            ],
            [
                8463,
                8567
            ],
            [
                8567,
                8609
            ],
            [
                8609,
                8667
            ],
            [
                8667,
                8741
            ],
            [
                8741,
                8856
            ],
            [
                8856,
                8896
            ],
            [
                8896,
                9016
            ],
            [
                9016,
                9016
            ],
            [
                9016,
                9082
            ],
            [
                9082,
                9082
            ],
            [
                9082,
                9141
            ],
            [
                9141,
                9188
            ],
            [
                9188,
                9222
            ],
            [
                9222,
                9338
            ],
            [
                9338,
                9361
            ],
            [
                9361,
                9443
            ],
            [
                9443,
                9547
            ],
            [
                9547,
                9559
            ],
            [
                9559,
                9586
            ],
            [
                9586,
                9742
            ],
            [
                9742,
                9765
            ],
            [
                9765,
                9834
            ]
        ]
    }
}