{
    "original": {
        "text": "\"The human nature unto which I felt That I belonged, and reverenced with love, Was not a punctual presence, but a spirit Diffused through time and space, with aid derived Of evidence from monuments, erect, Prostrate, or leaning toward their common rest In earth, the widely scattered wreck sublime Of vanished nations.\" --WORDSWORTH: _The Prelude_.\nSir Hugo carried out his plan of spending part of the autumn at Diplow, and by the beginning of October his presence was spreading some cheerfulness in the neighborhood, among all ranks and persons concerned, from the stately home of Brackenshaw and Quetcham to the respectable shop-parlors in Wanchester. For Sir Hugo was a man who liked to show himself and be affable, a Liberal of good lineage, who confided entirely in reform as not likely to make any serious difference in English habits of feeling, one of which undoubtedly is the liking to behold society well fenced and adorned with hereditary rank. Hence he made Diplow a most agreeable house, extending his invitations to old Wanchester solicitors and young village curates, but also taking some care in the combination of the guests, and not feeding all the common poultry together, so that they should think their meal no particular compliment. Easy-going Lord Brackenshaw, for example, would not mind meeting Robinson the attorney, but Robinson would have been naturally piqued if he had been asked to meet a set of people who passed for his equals. On all these points Sir Hugo was well informed enough at once to gain popularity for himself and give pleasure to others--two results which eminently suited his disposition. The rector of Pennicote now found a reception at Diplow very different from the haughty tolerance he had undergone during the reign of Grandcourt. It was not that the baronet liked Mr. Gascoigne; it was that he desired to keep up a marked relation of friendliness with him on account of Mrs. Grandcourt, for whom Sir Hugo's chivalry had become more and more engaged. Why? The chief reason was one that he could not fully communicate, even to Lady Mallinger--for he would not tell what he thought one woman's secret to another, even though the other was his wife--which shows that his chivalry included a rare reticence.\nDeronda, after he had become engaged to Mirah, felt it right to make a full statement of his position and purposes to Sir Hugo, and he chose to make it by letter. He had more than a presentiment that his fatherly friend would feel some dissatisfaction, if not pain, at this turn of his destiny. In reading unwelcome news, instead of hearing it, there is the advantage that one avoids a hasty expression of impatience which may afterward be repented of. Deronda dreaded that verbal collision which makes otherwise pardonable feeling lastingly offensive.\nAnd Sir Hugo, though not altogether surprised, was thoroughly vexed. His immediate resource was to take the letter to Lady Mallinger, who would be sure to express an astonishment which her husband could argue against as unreasonable, and in this way divide the stress of his discontent. And in fact when she showed herself astonished and distressed that all Daniel's wonderful talents, and the comfort of having him in the house, should have ended in his going mad in this way about the Jews, the baronet could say,\n\"Oh, nonsense, my dear! depend upon it, Dan will not make a fool of himself. He has large notions about Judaism--political views which you can't understand. No fear but Dan will keep himself head uppermost.\"\nBut with regard to the prospective marriage she afforded him no counter-irritant. The gentle lady observed, without rancor, that she had little dreamed of what was coming when she had Mirah to sing at her musical party and give lessons to Amabel. After some hesitation, indeed, she confessed it _had_ passed through her mind that after a proper time Daniel might marry Mrs. Grandcourt--because it seemed so remarkable that he should be at Genoa just at that time--and although she herself was not fond of widows she could not help thinking that such a marriage would have been better than his going altogether with the Jews. But Sir Hugo was so strongly of the same opinion that he could not correct it as a feminine mistake; and his ill-humor at the disproof of his disagreeable conclusions on behalf of Gwendolen was left without vent. He desired Lady Mallinger not to breathe a word about the affair till further notice, saying to himself, \"If it is an unkind cut to the poor thing (meaning Gwendolen), the longer she is without knowing it the better, in her present nervous state. And she will best learn it from Dan himself.\" Sir Hugo's conjectures had worked so industriously with his knowledge, that he fancied himself well informed concerning the whole situation.\nMeanwhile his residence with his family at Diplow enabled him to continue his fatherly attentions to Gwendolen; and in these Lady Mallinger, notwithstanding her small liking for widows, was quite willing to second him.\nThe plan of removal to Offendene had been carried out; and Gwendolen, in settling there, maintained a calm beyond her mother's hopes. She was experiencing some of that peaceful melancholy which comes from the renunciation of demands for self, and from taking the ordinary good of existence, and especially kindness, even from a dog, as a gift above expectation. Does one who has been all but lost in a pit of darkness complain of the sweet air and the daylight? There is a way of looking at our life daily as an escape, and taking the quiet return of morn and evening--still more the star-like out-glowing of some pure fellow-feeling, some generous impulse breaking our inward darkness--as a salvation that reconciles us to hardship. Those who have a self-knowledge prompting such self-accusation as Hamlet's, can understand this habitual feeling of rescue. And it was felt by Gwendolen as she lived through and through again the terrible history of her temptations, from their first form of illusory self-pleasing when she struggled away from the hold of conscience, to their latest form of an urgent hatred dragging her toward its satisfaction, while she prayed and cried for the help of that conscience which she had once forsaken. She was now dwelling on every word of Deronda's that pointed to her past deliverance from the worst evil in herself, and the worst infliction of it on others, and on every word that carried a force to resist self-despair.\nBut she was also upborne by the prospect of soon seeing him again: she did not imagine him otherwise than always within her reach, her supreme need of him blinding her to the separateness of his life, the whole scene of which she filled with his relation to her--no unique preoccupation of Gwendolen's, for we are all apt to fall into this passionate egoism of imagination, not only toward our fellow-men, but toward God. And the future which she turned her face to with a willing step was one where she would be continually assimilating herself to some type that he would hold before her. Had he not first risen on her vision as a corrective presence which she had recognized in the beginning with resentment, and at last with entire love and trust? She could not spontaneously think of an end to that reliance, which had become to her imagination like the firmness of the earth, the only condition of her walking.\nAnd Deronda was not long before he came to Diplow, which was a more convenient distance from town than the Abbey. He had wished to carry out a plan for taking Ezra and Mirah to a mild spot on the coast, while he prepared another home which Mirah might enter as his bride, and where they might unitedly watch over her brother. But Ezra begged not to be removed, unless it were to go with them to the East. All outward solicitations were becoming more and more of a burden to him; but his mind dwelt on the possibility of this voyage with a visionary joy. Deronda, in his preparations for the marriage, which he hoped might not be deferred beyond a couple of months, wished to have fuller consultation as to his resources and affairs generally with Sir Hugo, and here was a reason for not delaying his visit to Diplow. But he thought quite as much of another reason--his promise to Gwendolen. The sense of blessedness in his own lot had yet an aching anxiety at his heart: this may be held paradoxical, for the beloved lover is always called happy, and happiness is considered as a well-fleshed indifference to sorrow outside it. But human experience is usually paradoxical, if that means incongruous with the phrases of current talk or even current philosophy. It was no treason to Mirah, but a part of that full nature which made his love for her the more worthy, that his joy in her could hold by its side the care for another. For what is love itself, for the one we love best?--an enfolding of immeasurable cares which yet are better than any joys outside our love.\nDeronda came twice to Diplow, and saw Gwendolen twice--and yet he went back to town without having told her anything about the change in his lot and prospects. He blamed himself; but in all momentous communication likely to give pain we feel dependent on some preparatory turn of words or associations, some agreement of the other's mood with the probable effect of what we have to impart. In the first interview Gwendolen was so absorbed in what she had to say to him, so full of questions which he must answer, about the arrangement of her life, what she could do to make herself less ignorant, how she could be kindest to everybody, and make amends for her selfishness and try to be rid of it, that Deronda utterly shrank from waiving her immediate wants in order to speak of himself, nay, from inflicting a wound on her in these moments when she was leaning on him for help in her path. In the second interview, when he went with new resolve to command the conversation into some preparatory track, he found her in a state of deep depression, overmastered by some distasteful miserable memories which forced themselves on her as something more real and ample than any new material out of which she could mould her future. She cried hysterically, and said that he would always despise her. He could only seek words of soothing and encouragement: and when she gradually revived under them, with that pathetic look of renewed childlike interest which we see in eyes where the lashes are still beaded with tears, it was impossible to lay another burden on her.\nBut time went on, and he felt it a pressing duty to make the difficult disclosure. Gwendolen, it was true, never recognized his having any affairs; and it had never even occurred to her to ask him why he happened to be at Genoa. But this unconsciousness of hers would make a sudden revelation of affairs that were determining his course in life all the heavier blow to her; and if he left the revelation to be made by different persons, she would feel that he had treated her with cruel inconsiderateness. He could not make the communication in writing: his tenderness could not bear to think of her reading his virtual farewell in solitude, and perhaps feeling his words full of a hard gladness for himself and indifference for her. He went down to Diplow again, feeling that every other peril was to be incurred rather than that of returning and leaving her still in ignorance.\nOn this third visit Deronda found Hans Meyrick installed with his easel at Diplow, beginning his picture of the three daughters sitting on a bank, \"in the Gainsborough style,\" and varying his work by rambling to Pennicote to sketch the village children and improve his acquaintance with the Gascoignes. Hans appeared to have recovered his vivacity, but Deronda detected some feigning in it, as we detect the artificiality of a lady's bloom from its being a little too high-toned and steadily persistent (a \"Fluctuating Rouge\" not having yet appeared among the advertisements). Also with all his grateful friendship and admiration for Deronda, Hans could not help a certain irritation against him, such as extremely incautious, open natures are apt to feel when the breaking of a friend's reserve discloses a state of things not merely unsuspected but the reverse of what had been hoped and ingeniously conjectured. It is true that poor Hans had always cared chiefly to confide in Deronda, and had been quite incurious as to any confidence that might have been given in return; but what outpourer of his own affairs is not tempted to think any hint of his friend's affairs is an egotistic irrelevance? That was no reason why it was not rather a sore reflection to Hans that while he had been all along naively opening his heart about Mirah, Deronda had kept secret a feeling of rivalry which now revealed itself as the important determining fact. Moreover, it is always at their peril that our friends turn out to be something more than we were aware of. Hans must be excused for these promptings of bruised sensibility, since he had not allowed them to govern his substantial conduct: he had the consciousness of having done right by his fortunate friend; or, as he told himself, \"his metal had given a better ring than he would have sworn to beforehand.\" For Hans had always said that in point of virtue he was a _dilettante_: which meant that he was very fond of it in other people, but if he meddled with it himself he cut a poor figure. Perhaps in reward of his good behavior he gave his tongue the more freedom; and he was too fully possessed by the notion of Deronda's happiness to have a conception of what he was feeling about Gwendolen, so that he spoke of her without hesitation.\n\"When did you come down, Hans?\" said Deronda, joining him in the grounds where he was making a study of the requisite bank and trees.\n\"Oh, ten days ago; before the time Sir Hugo fixed. I ran down with Rex Gascoigne and stayed at the rectory a day or two. I'm up in all the gossip of these parts; I know the state of the wheelwright's interior, and have assisted at an infant school examination. Sister Anna, with the good upper lip, escorted me, else I should have been mobbed by three urchins and an idiot, because of my long hair and a general appearance which departs from the Pennicote type of the beautiful. Altogether, the village is idyllic. Its only fault is a dark curate with broad shoulders and broad trousers who ought to have gone into the heavy drapery line. The Gascoignes are perfect--besides being related to the Vandyke duchess. I caught a glimpse of her in her black robes at a distance, though she doesn't show to visitors.\"\n\"She was not staying at the rectory?\" said Deronda.\n\"No; but I was taken to Offendene to see the old house, and as a consequence I saw the duchess' family. I suppose you have been there and know all about them?\"\n\"Yes, I have been there,\" said Deronda, quietly.\n\"A fine old place. An excellent setting for a widow with romantic fortunes. And she seems to have had several romances. I think I have found out that there was one between her and my friend Rex.\"\n\"Not long before her marriage, then?\" said Deronda, really interested, \"for they had only been a year at Offendene. How came you to know anything of it?\"\n\"Oh--not ignorant of what it is to be a miserable devil, I learn to gloat on the signs of misery in others. I found out that Rex never goes to Offendene, and has never seen the duchess since she came back; and Miss Gascoigne let fall something in our talk about charade-acting--for I went through some of my nonsense to please the young ones--something that proved to me that Rex was once hovering about his fair cousin close enough to get singed. I don't know what was her part in the affair. Perhaps the duke came in and carried her off. That is always the way when an exceptionally worthy young man forms an attachment. I understand now why Gascoigne talks of making the law his mistress and remaining a bachelor. But these are green resolves. Since the duke did not get himself drowned for your sake, it may turn out to be for my friend Rex's sake. Who knows?\"\n\"Is it absolutely necessary that Mrs. Grandcourt should marry again?\" said Deronda, ready to add that Hans's success in constructing her fortunes hitherto had not been enough to warrant a new attempt.\n\"You monster!\" retorted Hans, \"do you want her to wear weeds for _you_ all her life--burn herself in perpetual suttee while you are alive and merry?\"\nDeronda could say nothing, but he looked so much annoyed that Hans turned the current of his chat, and when he was alone shrugged his shoulders a little over the thought that there really had been some stronger feeling between Deronda and the duchess than Mirah would like to know of. \"Why didn't she fall in love with me?\" thought Hans, laughing at himself. \"She would have had no rivals. No woman ever wanted to discuss theology with me.\"\nNo wonder that Deronda winced under that sort of joking with a whip-lash. It touched sensibilities that were already quivering with the anticipation of witnessing some of that pain to which even Hans's light words seemed to give more reality:--any sort of recognition by another giving emphasis to the subject of our anxiety. And now he had come down with the firm resolve that he would not again evade the trial. The next day he rode to Offendene. He had sent word that he intended to call and to ask if Gwendolen could receive him; and he found her awaiting him in the old drawing-room where some chief crises of her life had happened. She seemed less sad than he had seen her since her husband's death; there was no smile on her face, but a placid self-possession, in contrast with the mood in which he had last found her. She was all the more alive to the sadness perceptible in Deronda; and they were no sooner seated--he at a little distance opposite to her--than she said:\n\"You were afraid of coming to see me, because I was so full of grief and despair the last time. But I am not so today. I have been sorry ever since. I have been making it a reason why I should keep up my hope and be as cheerful as I can, because I would not give you any pain about me.\"\nThere was an unwonted sweetness in Gwendolen's tone and look as she uttered these words that seemed to Deronda to infuse the utmost cruelty into the task now laid upon him. But he felt obliged to make his answer a beginning of the task.\n\"I _am_ in some trouble to-day,\" he said, looking at her rather mournfully; \"but it is because I have things to tell you which you will almost think it a want of confidence on my part not to have spoken of before. They are things affecting my own life--my own future. I shall seem to have made an ill return to you for the trust you have placed in me--never to have given you an idea of events that make great changes for me. But when we have been together we have hardly had time to enter into subjects which at the moment were really less pressing to me than the trials you have been going through.\" There was a sort of timid tenderness in Deronda's deep tones, and he paused with a pleading look, as if it had been Gwendolen only who had conferred anything in her scenes of beseeching and confession.\nA thrill of surprise was visible in her. Such meaning as she found in his words had shaken her, but without causing fear. Her mind had flown at once to some change in his position with regard to Sir Hugo and Sir Hugo's property. She said, with a sense of comfort from Deronda's way of asking her pardon,\n\"You never thought of anything but what you could do to help me; and I was so troublesome. How could you tell me things?\"\n\"It will perhaps astonish you,\" said Deronda, \"that I have only quite lately known who were my parents.\"\nGwendolen was not astonished: she felt the more assured that her expectations of what was coming were right. Deronda went on without check.\n\"The reason why you found me in Italy was that I had gone there to learn that--in fact, to meet my mother. It was by her wish that I was brought up in ignorance of my parentage. She parted with me after my father's death, when I was a little creature. But she is now very ill, and she felt that the secrecy ought not to be any longer maintained. Her chief reason had been that she did not wish me to know I was a Jew.\"\n\"_A Jew_!\" Gwendolen exclaimed, in a low tone of amazement, with an utterly frustrated look, as if some confusing potion were creeping through her system.\nDeronda colored, and did not speak, while Gwendolen, with her eyes fixed on the floor, was struggling to find her way in the dark by the aid of various reminiscences. She seemed at last to have arrived at some judgment, for she looked up at Deronda again and said, as if remonstrating against the mother's conduct,\n\"What difference need that have made?\"\n\"It has made a great difference to me that I have known it,\" said Deronda, emphatically; but he could not go on easily--the distance between her ideas and his acted like a difference of native language, making him uncertain what force his words would carry.\nGwendolen meditated again, and then said feelingly, \"I hope there is nothing to make you mind. _You_ are just the same as if you were not a Jew.\"\nShe meant to assure him that nothing of that external sort could affect the way in which she regarded him, or the way in which he could influence her. Deronda was a little helped by this misunderstanding.\n\"The discovery was far from being painful to me,\" he said, \"I had been gradually prepared for it, and I was glad of it. I had been prepared for it by becoming intimate with a very remarkable Jew, whose ideas have attracted me so much that I think of devoting the best part of my life to some effort at giving them effect.\"\nAgain Gwendolen seemed shaken--again there was a look of frustration, but this time it was mingled with alarm. She looked at Deronda with lips childishly parted. It was not that she had yet connected his words with Mirah and her brother, but that they had inspired her with a dreadful presentiment of mountainous travel for her mind before it could reach Deronda's. Great ideas in general which she had attributed to him seemed to make no great practical difference, and were not formidable in the same way as these mysteriously-shadowed particular ideas. He could not quite divine what was going on within her; he could only seek the least abrupt path of disclosure.\n\"That is an object,\" he said, after a moment, \"which will by-and-by force me to leave England for some time--for some years. I have purposes which will take me to the East.\"\nHere was something clearer, but all the more immediately agitating. Gwendolen's lips began to tremble. \"But you will come back?\" she said, tasting her own tears as they fell, before she thought of drying them.\nDeronda could not sit still. He rose, and went to prop himself against the corner of the mantel-piece, at a different angle from her face. But when she had pressed her handkerchief against her cheeks, she turned and looked up at him, awaiting an answer.\n\"If I live,\" said Deronda--\"_some time_.\"\nThey were both silent. He could not persuade himself to say more unless she led up to it by a question; and she was apparently meditating something that she had to say.\n\"What are you going to do?\" she asked, at last, very mildly. \"Can I understand the ideas, or am I too ignorant?\"\n\"I am going to the East to become better acquainted with the condition of my race in various countries there,\" said Deronda, gently--anxious to be as explanatory as he could on what was the impersonal part of their separateness from each other. \"The idea that I am possessed with is that of restoring a political existence to my people, making them a nation again, giving them a national center, such as the English have, though they too are scattered over the face of the globe. That is a task which presents itself to me as a duty; I am resolved to begin it, however feebly. I am resolved to devote my life to it. At the least, I may awaken a movement in other minds, such as has been awakened in my own.\"\nThere was a long silence between them. The world seemed getting larger round poor Gwendolen, and she more solitary and helpless in the midst. The thought that he might come back after going to the East, sank before the bewildering vision of these wild-stretching purposes in which she felt herself reduced to a mere speck. There comes a terrible moment to many souls when the great movements of the world, the larger destinies of mankind, which have lain aloof in newspapers and other neglected reading, enter like an earthquake into their own lives--where the slow urgency of growing generations turns into the tread of an invading army or the dire clash of civil war, and gray fathers know nothing to seek for but the corpses of their blooming sons, and girls forget all vanity to make lint and bandages which may serve for the shattered limbs of their betrothed husbands. Then it is as if the Invisible Power that had been the object of lip-worship and lip-resignation became visible, according to the imagery of the Hebrew poet, making the flames his chariot, and riding on the wings of the wind, till the mountains smoke and the plains shudder under the rolling fiery visitations. Often the good cause seems to lie prostrate under the thunder of unrelenting force, the martyrs live reviled, they die, and no angel is seen holding forth the crown and the palm branch. Then it is that the submission of the soul to the Highest is tested, and even in the eyes of frivolity life looks out from the scene of human struggle with the awful face of duty, and a religion shows itself which is something else than a private consolation.\nThat was the sort of crisis which was at this moment beginning in Gwendolen's small life: she was for the first time feeling the pressure of a vast mysterious movement, for the first time being dislodged from her supremacy in her own world, and getting a sense that her horizon was but a dipping onward of an existence with which her own was revolving. All the troubles of her wifehood and widowhood had still left her with the implicit impression which had accompanied her from childhood, that whatever surrounded her was somehow specially for her, and it was because of this that no personal jealousy had been roused in her relation to Deronda: she could not spontaneously think of him as rightfully belonging to others more than to her. But here had come a shock which went deeper than personal jealousy--something spiritual and vaguely tremendous that thrust her away, and yet quelled all her anger into self-humiliation.\nThere had been a long silence. Deronda had stood still, even thankful for an interval before he needed to say more, and Gwendolen had sat like a statue with her wrists lying over each other and her eyes fixed--the intensity of her mental action arresting all other excitation. At length something occurred to her that made her turn her face to Deronda and say in a trembling voice,\n\"Is that all you can tell me?\"\nThe question was like a dart to him. \"The Jew whom I mentioned just now,\" he answered, not without a certain tremor in his tones too, \"the remarkable man who has greatly influenced my mind, has not perhaps been totally unheard of by you. He is the brother of Miss Lapidoth, whom you have often heard sing.\"\nA great wave of remembrance passed through Gwendolen and spread as a deep, painful flush over neck and face. It had come first at the scene of that morning when she had called on Mirah, and heard Deronda's voice reading, and been told, without then heeding it, that he was reading Hebrew with Mirah's brother.\n\"He is very ill--very near death now,\" Deronda went on, nervously, and then stopped short. He felt that he must wait. Would she divine the rest?\n\"Did she tell you that I went to her?\" said Gwendolen, abruptly, looking up at him.\n\"No,\" said Deronda. \"I don't understand you.\"\nShe turned away her eyes again, and sat thinking. Slowly the color dried out of face and neck, and she was as pale as before--with that almost withered paleness which is seen after a painful flush. At last she said--without turning toward him--in a low, measured voice, as if she were only thinking aloud in preparation for future speech,\n\"But _can_ you marry?\"\n\"Yes,\" said Deronda, also in a low voice. \"I am going to marry.\"\nAt first there was no change in Gwendolen's attitude: she only began to tremble visibly; then she looked before her with dilated eyes, as at something lying in front of her, till she stretched her arms out straight, and cried with a smothered voice,\n\"I said I should be forsaken. I have been a cruel woman. And I am forsaken.\"\nDeronda's anguish was intolerable. He could not help himself. He seized her outstretched hands and held them together, and kneeled at her feet. She was the victim of his happiness.\n\"I am cruel, too, I am cruel,\" he repeated, with a sort of groan, looking up at her imploringly.\nHis presence and touch seemed to dispel a horrible vision, and she met his upward look of sorrow with something like the return of consciousness after fainting. Then she dwelt on it with that growing pathetic movement of the brow which accompanies the revival of some tender recollection. The look of sorrow brought back what seemed a very far-off moment--the first time she had ever seen it, in the library at the Abbey. Sobs rose, and great tears fell fast. Deronda would not let her hands go--held them still with one of his, and himself pressed her handkerchief against her eyes. She submitted like a half-soothed child, making an effort to speak, which was hindered by struggling sobs. At last she succeeded in saying, brokenly,\n\"I said--I said--it should be better--better with me--for having known you.\"\nHis eyes too were larger with tears. She wrested one of her hands from his, and returned his action, pressing his tears away.\n\"We shall not be quite parted,\" he said. \"I will write to you always, when I can, and you will answer?\"\nHe waited till she said in a whisper, \"I will try.\"\n\"I shall be more with you than I used to be,\" Deronda said with gentle urgency, releasing her hands and rising from his kneeling posture. \"If we had been much together before, we should have felt our differences more, and seemed to get farther apart. Now we can perhaps never see each other again. But our minds may get nearer.\"\nGwendolen said nothing, but rose too, automatically. Her withered look of grief, such as the sun often shines on when the blinds are drawn up after the burial of life's joy, made him hate his own words: they seemed to have the hardness of easy consolation in them. She felt that he was going, and that nothing could hinder it. The sense of it was like a dreadful whisper in her ear, which dulled all other consciousness; and she had not known that she was rising.\nDeronda could not speak again. He thought that they must part in silence, but it was difficult to move toward the parting, till she looked at him with a sort of intention in her eyes, which helped him. He advanced to put out his hand silently, and when she had placed hers within it, she said what her mind had been laboring with,\n\"You have been very good to me. I have deserved nothing. I will try--try to live. I shall think of you. What good have I been? Only harm. Don't let me be harm to _you_. It shall be the better for me--\"\nShe could not finish. It was not that she was sobbing, but that the intense effort with which she spoke made her too tremulous. The burden of that difficult rectitude toward him was a weight her frame tottered under.\nShe bent forward to kiss his cheek, and he kissed hers. Then they looked at each other for an instant with clasped hands, and he turned away.\nWhen he was quite gone, her mother came in and found her sitting motionless.\n\"Gwendolen, dearest, you look very ill,\" she said, bending over her and touching her cold hands.\n\"Yes, mamma. But don't be afraid. I am going to live,\" said Gwendolen, bursting out hysterically.\nHer mother persuaded her to go to bed, and watched by her. Through the day and half the night she fell continually into fits of shrieking, but cried in the midst of them to her mother, \"Don't be afraid. I shall live. I mean to live.\"\nAfter all, she slept; and when she waked in the morning light, she looked up fixedly at her mother and said tenderly, \"Ah, poor mamma! You have been sitting up with me. Don't be unhappy. I shall live. I shall be better.\"",
        "paragraph_chars": [
            [
                0,
                349
            ],
            [
                349,
                2256
            ],
            [
                2256,
                2809
            ],
            [
                2809,
                3325
            ],
            [
                3325,
                3533
            ],
            [
                3533,
                4805
            ],
            [
                4805,
                5024
            ],
            [
                5024,
                6481
            ],
            [
                6481,
                7397
            ],
            [
                7397,
                8966
            ],
            [
                8966,
                10527
            ],
            [
                10527,
                11407
            ],
            [
                11407,
                13697
            ],
            [
                13697,
                13831
            ],
            [
                13831,
                14642
            ],
            [
                14642,
                14694
            ],
            [
                14694,
                14854
            ],
            [
                14854,
                14903
            ],
            [
                14903,
                15099
            ],
            [
                15099,
                15253
            ],
            [
                15253,
                16118
            ],
            [
                16118,
                16319
            ],
            [
                16319,
                16469
            ],
            [
                16469,
                16910
            ],
            [
                16910,
                17890
            ],
            [
                17890,
                18177
            ],
            [
                18177,
                18414
            ],
            [
                18414,
                19218
            ],
            [
                19218,
                19522
            ],
            [
                19522,
                19644
            ],
            [
                19644,
                19749
            ],
            [
                19749,
                19889
            ],
            [
                19889,
                20308
            ],
            [
                20308,
                20463
            ],
            [
                20463,
                20778
            ],
            [
                20778,
                20817
            ],
            [
                20817,
                21075
            ],
            [
                21075,
                21221
            ],
            [
                21221,
                21426
            ],
            [
                21426,
                21749
            ],
            [
                21749,
                22417
            ],
            [
                22417,
                22591
            ],
            [
                22591,
                22801
            ],
            [
                22801,
                23055
            ],
            [
                23055,
                23097
            ],
            [
                23097,
                23266
            ],
            [
                23266,
                23379
            ],
            [
                23379,
                24087
            ],
            [
                24087,
                25719
            ],
            [
                25719,
                26645
            ],
            [
                26645,
                27027
            ],
            [
                27027,
                27058
            ],
            [
                27058,
                27365
            ],
            [
                27365,
                27675
            ],
            [
                27675,
                27820
            ],
            [
                27820,
                27904
            ],
            [
                27904,
                27950
            ],
            [
                27950,
                28289
            ],
            [
                28289,
                28312
            ],
            [
                28312,
                28377
            ],
            [
                28377,
                28627
            ],
            [
                28627,
                28704
            ],
            [
                28704,
                28885
            ],
            [
                28885,
                28982
            ],
            [
                28982,
                29716
            ],
            [
                29716,
                29793
            ],
            [
                29793,
                29919
            ],
            [
                29919,
                30023
            ],
            [
                30023,
                30075
            ],
            [
                30075,
                30404
            ],
            [
                30404,
                30868
            ],
            [
                30868,
                31199
            ],
            [
                31199,
                31401
            ],
            [
                31401,
                31618
            ],
            [
                31618,
                31760
            ],
            [
                31760,
                31837
            ],
            [
                31837,
                31934
            ],
            [
                31934,
                32032
            ],
            [
                32032,
                32266
            ],
            [
                32266,
                32486
            ]
        ],
        "segment_chars": [
            [
                0,
                320
            ],
            [
                320,
                349
            ],
            [
                349,
                655
            ],
            [
                655,
                957
            ],
            [
                957,
                1256
            ],
            [
                1256,
                1462
            ],
            [
                1462,
                1636
            ],
            [
                1636,
                1783
            ],
            [
                1783,
                2003
            ],
            [
                2003,
                2008
            ],
            [
                2008,
                2256
            ],
            [
                2256,
                2419
            ],
            [
                2419,
                2551
            ],
            [
                2551,
                2709
            ],
            [
                2709,
                2809
            ],
            [
                2809,
                2878
            ],
            [
                2878,
                3096
            ],
            [
                3096,
                3325
            ],
            [
                3325,
                3349
            ],
            [
                3349,
                3402
            ],
            [
                3402,
                3482
            ],
            [
                3482,
                3533
            ],
            [
                3533,
                3615
            ],
            [
                3615,
                3780
            ],
            [
                3780,
                4158
            ],
            [
                4158,
                4371
            ],
            [
                4371,
                4618
            ],
            [
                4618,
                4664
            ],
            [
                4664,
                4805
            ],
            [
                4805,
                5024
            ],
            [
                5024,
                5158
            ],
            [
                5158,
                5386
            ],
            [
                5386,
                5486
            ],
            [
                5486,
                5758
            ],
            [
                5758,
                5882
            ],
            [
                5882,
                6259
            ],
            [
                6259,
                6481
            ],
            [
                6481,
                6903
            ],
            [
                6903,
                7071
            ],
            [
                7071,
                7232
            ],
            [
                7232,
                7397
            ],
            [
                7397,
                7511
            ],
            [
                7511,
                7723
            ],
            [
                7723,
                7802
            ],
            [
                7802,
                7951
            ],
            [
                7951,
                8214
            ],
            [
                8214,
                8288
            ],
            [
                8288,
                8525
            ],
            [
                8525,
                8657
            ],
            [
                8657,
                8826
            ],
            [
                8826,
                8966
            ],
            [
                8966,
                9126
            ],
            [
                9126,
                9356
            ],
            [
                9356,
                9857
            ],
            [
                9857,
                10192
            ],
            [
                10192,
                10259
            ],
            [
                10259,
                10527
            ],
            [
                10527,
                10610
            ],
            [
                10610,
                10756
            ],
            [
                10756,
                11033
            ],
            [
                11033,
                11261
            ],
            [
                11261,
                11407
            ],
            [
                11407,
                11710
            ],
            [
                11710,
                11984
            ],
            [
                11984,
                12322
            ],
            [
                12322,
                12608
            ],
            [
                12608,
                12853
            ],
            [
                12853,
                12961
            ],
            [
                12961,
                13263
            ],
            [
                13263,
                13448
            ],
            [
                13448,
                13697
            ],
            [
                13697,
                13729
            ],
            [
                13729,
                13831
            ],
            [
                13831,
                13882
            ],
            [
                13882,
                13952
            ],
            [
                13952,
                14092
            ],
            [
                14092,
                14310
            ],
            [
                14310,
                14346
            ],
            [
                14346,
                14470
            ],
            [
                14470,
                14544
            ],
            [
                14544,
                14642
            ],
            [
                14642,
                14680
            ],
            [
                14680,
                14694
            ],
            [
                14694,
                14798
            ],
            [
                14798,
                14854
            ],
            [
                14854,
                14903
            ],
            [
                14903,
                14922
            ],
            [
                14922,
                14979
            ],
            [
                14979,
                15023
            ],
            [
                15023,
                15099
            ],
            [
                15099,
                15137
            ],
            [
                15137,
                15215
            ],
            [
                15215,
                15253
            ],
            [
                15253,
                15361
            ],
            [
                15361,
                15701
            ],
            [
                15701,
                15747
            ],
            [
                15747,
                15793
            ],
            [
                15793,
                15876
            ],
            [
                15876,
                15970
            ],
            [
                15970,
                16000
            ],
            [
                16000,
                16106
            ],
            [
                16106,
                16118
            ],
            [
                16118,
                16188
            ],
            [
                16188,
                16319
            ],
            [
                16319,
                16334
            ],
            [
                16334,
                16469
            ],
            [
                16469,
                16754
            ],
            [
                16754,
                16793
            ],
            [
                16793,
                16828
            ],
            [
                16828,
                16859
            ],
            [
                16859,
                16910
            ],
            [
                16910,
                16984
            ],
            [
                16984,
                17236
            ],
            [
                17236,
                17324
            ],
            [
                17324,
                17359
            ],
            [
                17359,
                17548
            ],
            [
                17548,
                17736
            ],
            [
                17736,
                17890
            ],
            [
                17890,
                17986
            ],
            [
                17986,
                18009
            ],
            [
                18009,
                18039
            ],
            [
                18039,
                18177
            ],
            [
                18177,
                18350
            ],
            [
                18350,
                18414
            ],
            [
                18414,
                18628
            ],
            [
                18628,
                18682
            ],
            [
                18682,
                18840
            ],
            [
                18840,
                19016
            ],
            [
                19016,
                19218
            ],
            [
                19218,
                19259
            ],
            [
                19259,
                19340
            ],
            [
                19340,
                19447
            ],
            [
                19447,
                19522
            ],
            [
                19522,
                19613
            ],
            [
                19613,
                19644
            ],
            [
                19644,
                19749
            ],
            [
                19749,
                19858
            ],
            [
                19858,
                19889
            ],
            [
                19889,
                19996
            ],
            [
                19996,
                20067
            ],
            [
                20067,
                20141
            ],
            [
                20141,
                20235
            ],
            [
                20235,
                20308
            ],
            [
                20308,
                20319
            ],
            [
                20319,
                20463
            ],
            [
                20463,
                20630
            ],
            [
                20630,
                20778
            ],
            [
                20778,
                20817
            ],
            [
                20817,
                21075
            ],
            [
                21075,
                21170
            ],
            [
                21170,
                21221
            ],
            [
                21221,
                21372
            ],
            [
                21372,
                21426
            ],
            [
                21426,
                21546
            ],
            [
                21546,
                21749
            ],
            [
                21749,
                21860
            ],
            [
                21860,
                21911
            ],
            [
                21911,
                22115
            ],
            [
                22115,
                22305
            ],
            [
                22305,
                22417
            ],
            [
                22417,
                22542
            ],
            [
                22542,
                22591
            ],
            [
                22591,
                22659
            ],
            [
                22659,
                22694
            ],
            [
                22694,
                22720
            ],
            [
                22720,
                22801
            ],
            [
                22801,
                22830
            ],
            [
                22830,
                22940
            ],
            [
                22940,
                23055
            ],
            [
                23055,
                23097
            ],
            [
                23097,
                23120
            ],
            [
                23120,
                23266
            ],
            [
                23266,
                23294
            ],
            [
                23294,
                23327
            ],
            [
                23327,
                23379
            ],
            [
                23379,
                23624
            ],
            [
                23624,
                23859
            ],
            [
                23859,
                23956
            ],
            [
                23956,
                23995
            ],
            [
                23995,
                24087
            ],
            [
                24087,
                24126
            ],
            [
                24126,
                24229
            ],
            [
                24229,
                24410
            ],
            [
                24410,
                24962
            ],
            [
                24962,
                25273
            ],
            [
                25273,
                25459
            ],
            [
                25459,
                25719
            ],
            [
                25719,
                26072
            ],
            [
                26072,
                26459
            ],
            [
                26459,
                26645
            ],
            [
                26645,
                26676
            ],
            [
                26676,
                26922
            ],
            [
                26922,
                27027
            ],
            [
                27027,
                27058
            ],
            [
                27058,
                27095
            ],
            [
                27095,
                27296
            ],
            [
                27296,
                27365
            ],
            [
                27365,
                27474
            ],
            [
                27474,
                27675
            ],
            [
                27675,
                27766
            ],
            [
                27766,
                27793
            ],
            [
                27793,
                27820
            ],
            [
                27820,
                27859
            ],
            [
                27859,
                27904
            ],
            [
                27904,
                27924
            ],
            [
                27924,
                27950
            ],
            [
                27950,
                28000
            ],
            [
                28000,
                28148
            ],
            [
                28148,
                28289
            ],
            [
                28289,
                28312
            ],
            [
                28312,
                28354
            ],
            [
                28354,
                28377
            ],
            [
                28377,
                28627
            ],
            [
                28627,
                28657
            ],
            [
                28657,
                28684
            ],
            [
                28684,
                28704
            ],
            [
                28704,
                28739
            ],
            [
                28739,
                28766
            ],
            [
                28766,
                28848
            ],
            [
                28848,
                28885
            ],
            [
                28885,
                28982
            ],
            [
                28982,
                29143
            ],
            [
                29143,
                29271
            ],
            [
                29271,
                29404
            ],
            [
                29404,
                29442
            ],
            [
                29442,
                29566
            ],
            [
                29566,
                29673
            ],
            [
                29673,
                29716
            ],
            [
                29716,
                29793
            ],
            [
                29793,
                29830
            ],
            [
                29830,
                29919
            ],
            [
                29919,
                29960
            ],
            [
                29960,
                30023
            ],
            [
                30023,
                30075
            ],
            [
                30075,
                30213
            ],
            [
                30213,
                30326
            ],
            [
                30326,
                30373
            ],
            [
                30373,
                30404
            ],
            [
                30404,
                30457
            ],
            [
                30457,
                30669
            ],
            [
                30669,
                30731
            ],
            [
                30731,
                30868
            ],
            [
                30868,
                30899
            ],
            [
                30899,
                31070
            ],
            [
                31070,
                31199
            ],
            [
                31199,
                31231
            ],
            [
                31231,
                31256
            ],
            [
                31256,
                31281
            ],
            [
                31281,
                31303
            ],
            [
                31303,
                31326
            ],
            [
                31326,
                31337
            ],
            [
                31337,
                31368
            ],
            [
                31368,
                31401
            ],
            [
                31401,
                31423
            ],
            [
                31423,
                31529
            ],
            [
                31529,
                31618
            ],
            [
                31618,
                31674
            ],
            [
                31674,
                31760
            ],
            [
                31760,
                31837
            ],
            [
                31837,
                31934
            ],
            [
                31934,
                31947
            ],
            [
                31947,
                31968
            ],
            [
                31968,
                32032
            ],
            [
                32032,
                32091
            ],
            [
                32091,
                32235
            ],
            [
                32235,
                32249
            ],
            [
                32249,
                32266
            ],
            [
                32266,
                32401
            ],
            [
                32401,
                32435
            ],
            [
                32435,
                32453
            ],
            [
                32453,
                32467
            ],
            [
                32467,
                32486
            ]
        ],
        "overlap_chars": [
            [
                349,
                419
            ],
            [
                653,
                655
            ],
            [
                963,
                965
            ],
            [
                1016,
                1083
            ],
            [
                1093,
                1099
            ],
            [
                1105,
                1131
            ],
            [
                1136,
                1142
            ],
            [
                1196,
                1200
            ],
            [
                1393,
                1395
            ],
            [
                1532,
                1558
            ],
            [
                1564,
                1582
            ],
            [
                1634,
                1636
            ],
            [
                1636,
                1711
            ],
            [
                1771,
                1781
            ],
            [
                1716,
                1718
            ],
            [
                1781,
                1783
            ],
            [
                1953,
                1957
            ],
            [
                1847,
                1874
            ],
            [
                1887,
                1948
            ],
            [
                1844,
                1846
            ],
            [
                2124,
                2131
            ],
            [
                1969,
                1972
            ],
            [
                2238,
                2239
            ],
            [
                2254,
                2256
            ],
            [
                2256,
                2273
            ],
            [
                2285,
                2302
            ],
            [
                2325,
                2382
            ],
            [
                2417,
                2419
            ],
            [
                2419,
                2421
            ],
            [
                2451,
                2549
            ],
            [
                2576,
                2577
            ],
            [
                2436,
                2437
            ],
            [
                2642,
                2647
            ],
            [
                2673,
                2678
            ],
            [
                2683,
                2709
            ],
            [
                2809,
                2877
            ],
            [
                3615,
                3618
            ],
            [
                3769,
                3771
            ],
            [
                3626,
                3630
            ],
            [
                3639,
                3640
            ],
            [
                3655,
                3656
            ],
            [
                3641,
                3653
            ],
            [
                3657,
                3751
            ],
            [
                3778,
                3780
            ],
            [
                3809,
                3827
            ],
            [
                3829,
                3832
            ],
            [
                3834,
                3862
            ],
            [
                3883,
                3917
            ],
            [
                4156,
                4158
            ],
            [
                4374,
                4381
            ],
            [
                4397,
                4502
            ],
            [
                4507,
                4511
            ],
            [
                4527,
                4536
            ],
            [
                4539,
                4618
            ],
            [
                4618,
                4663
            ],
            [
                5024,
                5092
            ],
            [
                5113,
                5158
            ],
            [
                5158,
                5223
            ],
            [
                5271,
                5386
            ],
            [
                5386,
                5407
            ],
            [
                5416,
                5486
            ],
            [
                5486,
                5518
            ],
            [
                5524,
                5529
            ],
            [
                5519,
                5523
            ],
            [
                5530,
                5591
            ],
            [
                5711,
                5725
            ],
            [
                5756,
                5758
            ],
            [
                5849,
                5853
            ],
            [
                5863,
                5880
            ],
            [
                6092,
                6094
            ],
            [
                5901,
                5995
            ],
            [
                6002,
                6007
            ],
            [
                6016,
                6038
            ],
            [
                6126,
                6259
            ],
            [
                6259,
                6326
            ],
            [
                6332,
                6374
            ],
            [
                6416,
                6481
            ],
            [
                6481,
                6551
            ],
            [
                6568,
                6571
            ],
            [
                6587,
                6681
            ],
            [
                6701,
                6742
            ],
            [
                6788,
                6838
            ],
            [
                6853,
                6903
            ],
            [
                6903,
                6906
            ],
            [
                6924,
                6927
            ],
            [
                6944,
                6946
            ],
            [
                6952,
                6953
            ],
            [
                6911,
                6917
            ],
            [
                6975,
                6993
            ],
            [
                7069,
                7071
            ],
            [
                7071,
                7074
            ],
            [
                7078,
                7081
            ],
            [
                7082,
                7087
            ],
            [
                7108,
                7232
            ],
            [
                7232,
                7245
            ],
            [
                7269,
                7292
            ],
            [
                7395,
                7397
            ],
            [
                7397,
                7400
            ],
            [
                7401,
                7408
            ],
            [
                7432,
                7446
            ],
            [
                7509,
                7511
            ],
            [
                7511,
                7527
            ],
            [
                7556,
                7689
            ],
            [
                7699,
                7723
            ],
            [
                7723,
                7800
            ],
            [
                7880,
                7950
            ],
            [
                7951,
                8012
            ],
            [
                8019,
                8022
            ],
            [
                8100,
                8102
            ],
            [
                8035,
                8071
            ],
            [
                8144,
                8152
            ],
            [
                8103,
                8106
            ],
            [
                8121,
                8128
            ],
            [
                8212,
                8213
            ],
            [
                8214,
                8220
            ],
            [
                8246,
                8260
            ],
            [
                8203,
                8205
            ],
            [
                8197,
                8202
            ],
            [
                8206,
                8212
            ],
            [
                8262,
                8288
            ],
            [
                8357,
                8360
            ],
            [
                8292,
                8331
            ],
            [
                8336,
                8356
            ],
            [
                8361,
                8367
            ],
            [
                8657,
                8721
            ],
            [
                8396,
                8397
            ],
            [
                8596,
                8600
            ],
            [
                8766,
                8780
            ],
            [
                8442,
                8443
            ],
            [
                8781,
                8825
            ],
            [
                8966,
                9019
            ],
            [
                9021,
                9106
            ],
            [
                9115,
                9126
            ],
            [
                9126,
                9148
            ],
            [
                9356,
                9477
            ],
            [
                9479,
                9513
            ],
            [
                9563,
                9576
            ],
            [
                9535,
                9561
            ],
            [
                9602,
                9605
            ],
            [
                9626,
                9633
            ],
            [
                9661,
                9675
            ],
            [
                9684,
                9695
            ],
            [
                9622,
                9625
            ],
            [
                9718,
                9723
            ],
            [
                9724,
                9789
            ],
            [
                9807,
                9843
            ],
            [
                9354,
                9355
            ],
            [
                9857,
                9880
            ],
            [
                9967,
                10028
            ],
            [
                10046,
                10064
            ],
            [
                10190,
                10192
            ],
            [
                10192,
                10259
            ],
            [
                10259,
                10295
            ],
            [
                10300,
                10362
            ],
            [
                10368,
                10411
            ],
            [
                10477,
                10527
            ],
            [
                10527,
                10530
            ],
            [
                10549,
                10610
            ],
            [
                10610,
                10756
            ],
            [
                10756,
                10780
            ],
            [
                10789,
                10819
            ],
            [
                10872,
                10887
            ],
            [
                10888,
                10904
            ],
            [
                10968,
                10973
            ],
            [
                10934,
                10936
            ],
            [
                11008,
                11013
            ],
            [
                10931,
                10933
            ],
            [
                10999,
                11002
            ],
            [
                10781,
                10783
            ],
            [
                11031,
                11033
            ],
            [
                11033,
                11045
            ],
            [
                11069,
                11188
            ],
            [
                11256,
                11260
            ],
            [
                11261,
                11263
            ],
            [
                11546,
                11547
            ],
            [
                11415,
                11426
            ],
            [
                11405,
                11406
            ],
            [
                11410,
                11414
            ],
            [
                11289,
                11290
            ],
            [
                11435,
                11534
            ],
            [
                11554,
                11631
            ],
            [
                11694,
                11710
            ],
            [
                11710,
                11781
            ],
            [
                11815,
                11828
            ],
            [
                11791,
                11796
            ],
            [
                11989,
                12001
            ],
            [
                12026,
                12103
            ],
            [
                12168,
                12171
            ],
            [
                12215,
                12223
            ],
            [
                12320,
                12321
            ],
            [
                12322,
                12351
            ],
            [
                12376,
                12380
            ],
            [
                12384,
                12394
            ],
            [
                12431,
                12434
            ],
            [
                12425,
                12430
            ],
            [
                12446,
                12487
            ],
            [
                12686,
                12688
            ],
            [
                12966,
                12985
            ],
            [
                12506,
                12509
            ],
            [
                13006,
                13032
            ],
            [
                13092,
                13161
            ],
            [
                12851,
                12852
            ],
            [
                13448,
                13477
            ],
            [
                13487,
                13505
            ],
            [
                13510,
                13538
            ],
            [
                13569,
                13599
            ],
            [
                13613,
                13697
            ],
            [
                13697,
                13729
            ],
            [
                13729,
                13782
            ],
            [
                13829,
                13831
            ],
            [
                13831,
                13849
            ],
            [
                13882,
                13952
            ],
            [
                13952,
                13991
            ],
            [
                14039,
                14078
            ],
            [
                14254,
                14259
            ],
            [
                14092,
                14103
            ],
            [
                14130,
                14141
            ],
            [
                14308,
                14310
            ],
            [
                14322,
                14344
            ],
            [
                14320,
                14321
            ],
            [
                14399,
                14402
            ],
            [
                14470,
                14496
            ],
            [
                14506,
                14544
            ],
            [
                14544,
                14602
            ],
            [
                14703,
                14748
            ],
            [
                14796,
                14798
            ],
            [
                14798,
                14827
            ],
            [
                14904,
                14922
            ],
            [
                14922,
                14979
            ],
            [
                14979,
                15023
            ],
            [
                15023,
                15030
            ],
            [
                15053,
                15099
            ],
            [
                15099,
                15137
            ],
            [
                15137,
                15150
            ],
            [
                15158,
                15168
            ],
            [
                15213,
                15215
            ],
            [
                15215,
                15235
            ],
            [
                15245,
                15253
            ],
            [
                15522,
                15523
            ],
            [
                15361,
                15462
            ],
            [
                15478,
                15481
            ],
            [
                15596,
                15701
            ],
            [
                15701,
                15747
            ],
            [
                15747,
                15793
            ],
            [
                15876,
                15970
            ],
            [
                16000,
                16099
            ],
            [
                16104,
                16106
            ],
            [
                16106,
                16118
            ],
            [
                16118,
                16188
            ],
            [
                16188,
                16200
            ],
            [
                16317,
                16319
            ],
            [
                16319,
                16334
            ],
            [
                16334,
                16373
            ],
            [
                16380,
                16383
            ],
            [
                16385,
                16388
            ],
            [
                16390,
                16402
            ],
            [
                16466,
                16469
            ],
            [
                16469,
                16512
            ],
            [
                16518,
                16535
            ],
            [
                16543,
                16546
            ],
            [
                16752,
                16753
            ],
            [
                16910,
                16939
            ],
            [
                16982,
                16984
            ],
            [
                17208,
                17211
            ],
            [
                16987,
                17072
            ],
            [
                17109,
                17111
            ],
            [
                17086,
                17090
            ],
            [
                17234,
                17236
            ],
            [
                17244,
                17255
            ],
            [
                17261,
                17322
            ],
            [
                17236,
                17239
            ],
            [
                17324,
                17358
            ],
            [
                17448,
                17456
            ],
            [
                17415,
                17424
            ],
            [
                17461,
                17480
            ],
            [
                17485,
                17497
            ],
            [
                17546,
                17548
            ],
            [
                17548,
                17736
            ],
            [
                17736,
                17739
            ],
            [
                17793,
                17800
            ],
            [
                17770,
                17777
            ],
            [
                17800,
                17832
            ],
            [
                17875,
                17890
            ],
            [
                17890,
                17952
            ],
            [
                17963,
                17970
            ],
            [
                17975,
                17986
            ],
            [
                17986,
                17989
            ],
            [
                18009,
                18039
            ],
            [
                18039,
                18082
            ],
            [
                18103,
                18177
            ],
            [
                18177,
                18189
            ],
            [
                18199,
                18228
            ],
            [
                18265,
                18321
            ],
            [
                18326,
                18330
            ],
            [
                18348,
                18350
            ],
            [
                18350,
                18372
            ],
            [
                18412,
                18414
            ],
            [
                18414,
                18416
            ],
            [
                18418,
                18420
            ],
            [
                18422,
                18491
            ],
            [
                18501,
                18549
            ],
            [
                18557,
                18562
            ],
            [
                18605,
                18628
            ],
            [
                18628,
                18660
            ],
            [
                18674,
                18682
            ],
            [
                18682,
                18764
            ],
            [
                18766,
                18840
            ],
            [
                18840,
                18908
            ],
            [
                18950,
                18963
            ],
            [
                18909,
                18917
            ],
            [
                18970,
                18989
            ],
            [
                18938,
                18942
            ],
            [
                19000,
                19016
            ],
            [
                19016,
                19041
            ],
            [
                19076,
                19077
            ],
            [
                19099,
                19107
            ],
            [
                19042,
                19076
            ],
            [
                19216,
                19218
            ],
            [
                19218,
                19253
            ],
            [
                19312,
                19317
            ],
            [
                19275,
                19278
            ],
            [
                19334,
                19340
            ],
            [
                19340,
                19348
            ],
            [
                19359,
                19366
            ],
            [
                19370,
                19447
            ],
            [
                19447,
                19455
            ],
            [
                19522,
                19585
            ],
            [
                19644,
                19749
            ],
            [
                19749,
                19826
            ],
            [
                19846,
                19858
            ],
            [
                19858,
                19873
            ],
            [
                19887,
                19889
            ],
            [
                19889,
                19890
            ],
            [
                19936,
                19937
            ],
            [
                19953,
                19955
            ],
            [
                19921,
                19926
            ],
            [
                19977,
                19996
            ],
            [
                19996,
                20067
            ],
            [
                20067,
                20123
            ],
            [
                20139,
                20141
            ],
            [
                20141,
                20235
            ],
            [
                20235,
                20251
            ],
            [
                20252,
                20308
            ],
            [
                20308,
                20309
            ],
            [
                20310,
                20315
            ],
            [
                20316,
                20319
            ],
            [
                20319,
                20463
            ],
            [
                20463,
                20470
            ],
            [
                20478,
                20576
            ],
            [
                20628,
                20630
            ],
            [
                20698,
                20700
            ],
            [
                20681,
                20682
            ],
            [
                20630,
                20633
            ],
            [
                20722,
                20726
            ],
            [
                20778,
                20817
            ],
            [
                20817,
                20904
            ],
            [
                21018,
                21019
            ],
            [
                20906,
                20909
            ],
            [
                21031,
                21075
            ],
            [
                21075,
                21170
            ],
            [
                21171,
                21174
            ],
            [
                21176,
                21220
            ],
            [
                21221,
                21233
            ],
            [
                21241,
                21326
            ],
            [
                21370,
                21371
            ],
            [
                21426,
                21483
            ],
            [
                21485,
                21486
            ],
            [
                21528,
                21546
            ],
            [
                21546,
                21684
            ],
            [
                21702,
                21712
            ],
            [
                21735,
                21739
            ],
            [
                21746,
                21749
            ],
            [
                21749,
                21778
            ],
            [
                21823,
                21832
            ],
            [
                21806,
                21817
            ],
            [
                21836,
                21860
            ],
            [
                21860,
                21911
            ],
            [
                21927,
                21934
            ],
            [
                22023,
                22033
            ],
            [
                22047,
                22114
            ],
            [
                22417,
                22445
            ],
            [
                22461,
                22524
            ],
            [
                22526,
                22542
            ],
            [
                22542,
                22591
            ],
            [
                22659,
                22694
            ],
            [
                22694,
                22720
            ],
            [
                22720,
                22764
            ],
            [
                22799,
                22801
            ],
            [
                22801,
                22830
            ],
            [
                22830,
                22850
            ],
            [
                22886,
                22896
            ],
            [
                22897,
                22902
            ],
            [
                22938,
                22940
            ],
            [
                23055,
                23067
            ],
            [
                23068,
                23072
            ],
            [
                23082,
                23083
            ],
            [
                23084,
                23093
            ],
            [
                23094,
                23097
            ],
            [
                23097,
                23119
            ],
            [
                23266,
                23294
            ],
            [
                23294,
                23303
            ],
            [
                23305,
                23327
            ],
            [
                23327,
                23379
            ],
            [
                23379,
                23510
            ],
            [
                23520,
                23522
            ],
            [
                23553,
                23555
            ],
            [
                23569,
                23579
            ],
            [
                23622,
                23624
            ],
            [
                23624,
                23766
            ],
            [
                23799,
                23812
            ],
            [
                23817,
                23859
            ],
            [
                23956,
                23990
            ],
            [
                23859,
                23863
            ],
            [
                23869,
                23873
            ],
            [
                24087,
                24111
            ],
            [
                24124,
                24126
            ],
            [
                24126,
                24229
            ],
            [
                24295,
                24358
            ],
            [
                24288,
                24289
            ],
            [
                24368,
                24410
            ],
            [
                24410,
                24541
            ],
            [
                24572,
                24581
            ],
            [
                24548,
                24561
            ],
            [
                24589,
                24636
            ],
            [
                24960,
                24962
            ],
            [
                25719,
                26071
            ],
            [
                26072,
                26075
            ],
            [
                26092,
                26095
            ],
            [
                26080,
                26088
            ],
            [
                26119,
                26146
            ],
            [
                26156,
                26166
            ],
            [
                26209,
                26303
            ],
            [
                26313,
                26379
            ],
            [
                26394,
                26459
            ],
            [
                26459,
                26525
            ],
            [
                26527,
                26550
            ],
            [
                26559,
                26607
            ],
            [
                26612,
                26615
            ],
            [
                26622,
                26645
            ],
            [
                26765,
                26774
            ],
            [
                26779,
                26796
            ],
            [
                26855,
                26875
            ],
            [
                26920,
                26922
            ],
            [
                26922,
                26976
            ],
            [
                26986,
                27025
            ],
            [
                27027,
                27035
            ],
            [
                27055,
                27058
            ],
            [
                27058,
                27095
            ],
            [
                27095,
                27144
            ],
            [
                27157,
                27158
            ],
            [
                27167,
                27193
            ],
            [
                27299,
                27365
            ],
            [
                27365,
                27474
            ],
            [
                27508,
                27589
            ],
            [
                27477,
                27480
            ],
            [
                27590,
                27599
            ],
            [
                27626,
                27675
            ],
            [
                27675,
                27690
            ],
            [
                27692,
                27707
            ],
            [
                27711,
                27729
            ],
            [
                27731,
                27766
            ],
            [
                27793,
                27820
            ],
            [
                27820,
                27859
            ],
            [
                27859,
                27883
            ],
            [
                27902,
                27904
            ],
            [
                27904,
                27924
            ],
            [
                27924,
                27950
            ],
            [
                27950,
                27998
            ],
            [
                28043,
                28044
            ],
            [
                28148,
                28164
            ],
            [
                28289,
                28293
            ],
            [
                28295,
                28298
            ],
            [
                28300,
                28312
            ],
            [
                28312,
                28331
            ],
            [
                28352,
                28354
            ],
            [
                28354,
                28377
            ],
            [
                28409,
                28418
            ],
            [
                28440,
                28511
            ],
            [
                28560,
                28569
            ],
            [
                28579,
                28582
            ],
            [
                28570,
                28578
            ],
            [
                28591,
                28625
            ],
            [
                28627,
                28657
            ],
            [
                28657,
                28684
            ],
            [
                28684,
                28704
            ],
            [
                28704,
                28739
            ],
            [
                28739,
                28766
            ],
            [
                28766,
                28798
            ],
            [
                28821,
                28848
            ],
            [
                28848,
                28885
            ],
            [
                28885,
                28949
            ],
            [
                28980,
                28982
            ],
            [
                28982,
                29048
            ],
            [
                29084,
                29143
            ],
            [
                29148,
                29160
            ],
            [
                29164,
                29168
            ],
            [
                29250,
                29269
            ],
            [
                29275,
                29302
            ],
            [
                29315,
                29336
            ],
            [
                29375,
                29389
            ],
            [
                29373,
                29374
            ],
            [
                29390,
                29404
            ],
            [
                29404,
                29442
            ],
            [
                29442,
                29449
            ],
            [
                29478,
                29482
            ],
            [
                29464,
                29473
            ],
            [
                29488,
                29566
            ],
            [
                29566,
                29606
            ],
            [
                29617,
                29632
            ],
            [
                29644,
                29673
            ],
            [
                29673,
                29684
            ],
            [
                29704,
                29714
            ],
            [
                29716,
                29723
            ],
            [
                29733,
                29752
            ],
            [
                29754,
                29768
            ],
            [
                29770,
                29793
            ],
            [
                29793,
                29810
            ],
            [
                29818,
                29830
            ],
            [
                29830,
                29833
            ],
            [
                29842,
                29919
            ],
            [
                29919,
                29960
            ],
            [
                29960,
                30023
            ],
            [
                30023,
                30075
            ],
            [
                30075,
                30133
            ],
            [
                30153,
                30194
            ],
            [
                30211,
                30213
            ],
            [
                30337,
                30344
            ],
            [
                30330,
                30336
            ],
            [
                30345,
                30373
            ],
            [
                30373,
                30404
            ],
            [
                30404,
                30457
            ],
            [
                30457,
                30483
            ],
            [
                30578,
                30669
            ],
            [
                30669,
                30731
            ],
            [
                30731,
                30785
            ],
            [
                30866,
                30868
            ],
            [
                30868,
                30897
            ],
            [
                30946,
                31070
            ],
            [
                31070,
                31072
            ],
            [
                31085,
                31183
            ],
            [
                31193,
                31197
            ],
            [
                31199,
                31231
            ],
            [
                31231,
                31256
            ],
            [
                31256,
                31266
            ],
            [
                31268,
                31281
            ],
            [
                31281,
                31303
            ],
            [
                31303,
                31326
            ],
            [
                31326,
                31337
            ],
            [
                31337,
                31360
            ],
            [
                31362,
                31365
            ],
            [
                31368,
                31397
            ],
            [
                31401,
                31421
            ],
            [
                31465,
                31483
            ],
            [
                31527,
                31529
            ],
            [
                31529,
                31567
            ],
            [
                31579,
                31618
            ],
            [
                31618,
                31674
            ],
            [
                31674,
                31760
            ],
            [
                31760,
                31837
            ],
            [
                31837,
                31887
            ],
            [
                31909,
                31934
            ],
            [
                31934,
                31947
            ],
            [
                31947,
                31968
            ],
            [
                31968,
                32032
            ],
            [
                32032,
                32091
            ],
            [
                32091,
                32134
            ],
            [
                32147,
                32235
            ],
            [
                32235,
                32249
            ],
            [
                32249,
                32266
            ],
            [
                32266,
                32306
            ],
            [
                32327,
                32342
            ],
            [
                32351,
                32401
            ],
            [
                32401,
                32435
            ],
            [
                32435,
                32453
            ],
            [
                32453,
                32467
            ],
            [
                32467,
                32486
            ]
        ],
        "row_chars": [
            [
                0,
                320
            ],
            [
                320,
                349
            ],
            [
                349,
                655
            ],
            [
                655,
                957
            ],
            [
                957,
                1636
            ],
            [
                1636,
                1783
            ],
            [
                1783,
                2256
            ],
            [
                2256,
                2419
            ],
            [
                2419,
                2709
            ],
            [
                2709,
                2809
            ],
            [
                2809,
                2878
            ],
            [
                2878,
                3096
            ],
            [
                3096,
                3325
            ],
            [
                3325,
                3349
            ],
            [
                3349,
                3402
            ],
            [
                3402,
                3482
            ],
            [
                3482,
                3533
            ],
            [
                3533,
                3615
            ],
            [
                3615,
                3780
            ],
            [
                3780,
                4158
            ],
            [
                4158,
                4371
            ],
            [
                4371,
                4618
            ],
            [
                4618,
                4664
            ],
            [
                4664,
                4805
            ],
            [
                4805,
                5024
            ],
            [
                5024,
                5158
            ],
            [
                5158,
                5386
            ],
            [
                5386,
                5486
            ],
            [
                5486,
                5758
            ],
            [
                5758,
                6259
            ],
            [
                6259,
                6481
            ],
            [
                6481,
                6903
            ],
            [
                6903,
                7071
            ],
            [
                7071,
                7232
            ],
            [
                7232,
                7397
            ],
            [
                7397,
                7511
            ],
            [
                7511,
                7723
            ],
            [
                7723,
                7951
            ],
            [
                7951,
                8288
            ],
            [
                8288,
                8826
            ],
            [
                8826,
                8966
            ],
            [
                8966,
                9126
            ],
            [
                9126,
                9857
            ],
            [
                9857,
                10192
            ],
            [
                10192,
                10259
            ],
            [
                10259,
                10527
            ],
            [
                10527,
                10610
            ],
            [
                10610,
                10756
            ],
            [
                10756,
                11033
            ],
            [
                11033,
                11261
            ],
            [
                11261,
                11710
            ],
            [
                11710,
                11984
            ],
            [
                11984,
                12322
            ],
            [
                12322,
                13263
            ],
            [
                13263,
                13448
            ],
            [
                13448,
                13697
            ],
            [
                13697,
                13729
            ],
            [
                13729,
                13831
            ],
            [
                13831,
                13952
            ],
            [
                13952,
                14310
            ],
            [
                14310,
                14544
            ],
            [
                14544,
                14798
            ],
            [
                14798,
                14854
            ],
            [
                14854,
                14903
            ],
            [
                14903,
                14922
            ],
            [
                14922,
                14979
            ],
            [
                14979,
                15023
            ],
            [
                15023,
                15099
            ],
            [
                15099,
                15137
            ],
            [
                15137,
                15215
            ],
            [
                15215,
                15253
            ],
            [
                15253,
                15361
            ],
            [
                15361,
                15701
            ],
            [
                15701,
                15747
            ],
            [
                15747,
                15793
            ],
            [
                15793,
                15876
            ],
            [
                15876,
                15970
            ],
            [
                15970,
                16000
            ],
            [
                16000,
                16106
            ],
            [
                16106,
                16118
            ],
            [
                16118,
                16188
            ],
            [
                16188,
                16319
            ],
            [
                16319,
                16334
            ],
            [
                16334,
                16469
            ],
            [
                16469,
                16754
            ],
            [
                16754,
                16793
            ],
            [
                16793,
                16828
            ],
            [
                16828,
                16859
            ],
            [
                16859,
                16910
            ],
            [
                16910,
                16984
            ],
            [
                16984,
                17236
            ],
            [
                17236,
                17359
            ],
            [
                17359,
                17548
            ],
            [
                17548,
                17736
            ],
            [
                17736,
                17890
            ],
            [
                17890,
                17986
            ],
            [
                17986,
                18039
            ],
            [
                18039,
                18177
            ],
            [
                18177,
                18350
            ],
            [
                18350,
                18414
            ],
            [
                18414,
                18628
            ],
            [
                18628,
                18682
            ],
            [
                18682,
                18840
            ],
            [
                18840,
                19016
            ],
            [
                19016,
                19218
            ],
            [
                19218,
                19340
            ],
            [
                19340,
                19447
            ],
            [
                19447,
                19522
            ],
            [
                19522,
                19613
            ],
            [
                19613,
                19644
            ],
            [
                19644,
                19749
            ],
            [
                19749,
                19858
            ],
            [
                19858,
                19889
            ],
            [
                19889,
                19996
            ],
            [
                19996,
                20067
            ],
            [
                20067,
                20141
            ],
            [
                20141,
                20235
            ],
            [
                20235,
                20308
            ],
            [
                20308,
                20319
            ],
            [
                20319,
                20463
            ],
            [
                20463,
                20630
            ],
            [
                20630,
                20778
            ],
            [
                20778,
                20817
            ],
            [
                20817,
                21075
            ],
            [
                21075,
                21170
            ],
            [
                21170,
                21221
            ],
            [
                21221,
                21372
            ],
            [
                21372,
                21426
            ],
            [
                21426,
                21546
            ],
            [
                21546,
                21749
            ],
            [
                21749,
                21860
            ],
            [
                21860,
                21911
            ],
            [
                21911,
                22115
            ],
            [
                22115,
                22305
            ],
            [
                22305,
                22417
            ],
            [
                22417,
                22542
            ],
            [
                22542,
                22591
            ],
            [
                22591,
                22659
            ],
            [
                22659,
                22694
            ],
            [
                22694,
                22720
            ],
            [
                22720,
                22801
            ],
            [
                22801,
                22830
            ],
            [
                22830,
                22940
            ],
            [
                22940,
                23055
            ],
            [
                23055,
                23097
            ],
            [
                23097,
                23120
            ],
            [
                23120,
                23266
            ],
            [
                23266,
                23294
            ],
            [
                23294,
                23327
            ],
            [
                23327,
                23379
            ],
            [
                23379,
                23624
            ],
            [
                23624,
                23859
            ],
            [
                23859,
                23995
            ],
            [
                23995,
                24087
            ],
            [
                24087,
                24126
            ],
            [
                24126,
                24229
            ],
            [
                24229,
                24410
            ],
            [
                24410,
                24962
            ],
            [
                24962,
                25273
            ],
            [
                25273,
                25459
            ],
            [
                25459,
                25719
            ],
            [
                25719,
                26072
            ],
            [
                26072,
                26459
            ],
            [
                26459,
                26645
            ],
            [
                26645,
                26676
            ],
            [
                26676,
                26922
            ],
            [
                26922,
                27027
            ],
            [
                27027,
                27058
            ],
            [
                27058,
                27095
            ],
            [
                27095,
                27365
            ],
            [
                27365,
                27474
            ],
            [
                27474,
                27675
            ],
            [
                27675,
                27766
            ],
            [
                27766,
                27793
            ],
            [
                27793,
                27820
            ],
            [
                27820,
                27859
            ],
            [
                27859,
                27904
            ],
            [
                27904,
                27924
            ],
            [
                27924,
                27950
            ],
            [
                27950,
                28289
            ],
            [
                28289,
                28312
            ],
            [
                28312,
                28354
            ],
            [
                28354,
                28377
            ],
            [
                28377,
                28627
            ],
            [
                28627,
                28657
            ],
            [
                28657,
                28684
            ],
            [
                28684,
                28704
            ],
            [
                28704,
                28739
            ],
            [
                28739,
                28766
            ],
            [
                28766,
                28848
            ],
            [
                28848,
                28885
            ],
            [
                28885,
                28982
            ],
            [
                28982,
                29143
            ],
            [
                29143,
                29404
            ],
            [
                29404,
                29442
            ],
            [
                29442,
                29566
            ],
            [
                29566,
                29673
            ],
            [
                29673,
                29716
            ],
            [
                29716,
                29793
            ],
            [
                29793,
                29830
            ],
            [
                29830,
                29919
            ],
            [
                29919,
                29960
            ],
            [
                29960,
                30023
            ],
            [
                30023,
                30075
            ],
            [
                30075,
                30213
            ],
            [
                30213,
                30326
            ],
            [
                30326,
                30373
            ],
            [
                30373,
                30404
            ],
            [
                30404,
                30457
            ],
            [
                30457,
                30669
            ],
            [
                30669,
                30731
            ],
            [
                30731,
                30868
            ],
            [
                30868,
                31070
            ],
            [
                31070,
                31199
            ],
            [
                31199,
                31231
            ],
            [
                31231,
                31256
            ],
            [
                31256,
                31281
            ],
            [
                31281,
                31303
            ],
            [
                31303,
                31326
            ],
            [
                31326,
                31337
            ],
            [
                31337,
                31368
            ],
            [
                31368,
                31401
            ],
            [
                31401,
                31529
            ],
            [
                31529,
                31618
            ],
            [
                31618,
                31674
            ],
            [
                31674,
                31760
            ],
            [
                31760,
                31837
            ],
            [
                31837,
                31934
            ],
            [
                31934,
                31947
            ],
            [
                31947,
                31968
            ],
            [
                31968,
                32032
            ],
            [
                32032,
                32091
            ],
            [
                32091,
                32235
            ],
            [
                32235,
                32249
            ],
            [
                32249,
                32266
            ],
            [
                32266,
                32401
            ],
            [
                32401,
                32435
            ],
            [
                32435,
                32453
            ],
            [
                32453,
                32467
            ],
            [
                32467,
                32486
            ]
        ]
    },
    "abridged": {
        "text": "Sir Hugo carried out his plan of spending part of the autumn at Diplow. He extended invitations to old Wanchester solicitors and young village curates, taking such care in the combination of guests that he both gained popularity for himself and gave pleasure to others. The rector of Pennicote now found a reception at Diplow very different from Grandcourt's haughtiness. Sir Hugo desired to keep up a marked friendliness with him on account of Mrs. Grandcourt, for whom he secretly thought Deronda had a preference.\nBut Deronda, after he became engaged to Mirah, wrote a full statement of his position and purposes to Sir Hugo. He feared that his fatherly friend would feel some dissatisfaction, if not pain, at this turn of his destiny, and thought a letter would avoid any hasty response which might afterward be repented of. And Sir Hugo, though not altogether surprised, was thoroughly vexed.\nHe took the letter to Lady Mallinger, who professed herself astonished, observing without rancour that she had little dreamed of what was coming when she had Mirah to sing at her musical party. Indeed, she confessed it had passed through her mind that Daniel might marry Mrs. Grandcourt. Sir Hugo desired his wife not to breathe a word about the affair till further notice, saying to himself, \"If it is an unkind cut to poor Gwendolen, the longer she is without knowing it the better, in her present nervous state. And she will best learn it from Dan himself.\"\nThe plan of removal to Offendene had been carried out; and Gwendolen maintained a calm beyond her mother's hopes. She was experiencing some of that peaceful melancholy which comes from taking the ordinary good of existence, and especially kindness, even from a dog, as a gift above expectation. Does one who has been lost in a pit of darkness complain of the sweet air and the daylight? There is a way of looking at our daily life as an escape, and taking the quiet return of morn and evening as a salvation. This feeling of rescue came to Gwendolen as she lived through and through again the terrible history of her temptations, from her first illusory self-pleasing to her final hatred dragging her toward its satisfaction, while she prayed and cried for the help of that conscience which she had once forsaken. She was now dwelling on every word of Deronda's that pointed to her deliverance from the worst evil in herself, and on every word that carried a force to resist self-despair.\nBut she was also upborne by the prospect of soon seeing him again: she imagined him always within her reach, her supreme need of him blinding her to the separateness of his life, which she filled with his relation to her. We are all apt to fall into this passionate egoism, not only toward our fellow-men, but toward God. And she looked to a future where she would be guided by him. Had she not seen him first as a corrective presence which she had recognized in the beginning with resentment, and at last with entire love and trust? She could not imagine an end to that reliance.\nAnd soon Deronda came to Diplow. He had wished to take Ezra and Mirah to a mild spot on the coast, while he prepared another home which Mirah might enter as his bride, and where they might watch over her brother. But Ezra begged not to be removed, unless it were to go with them to the East: his mind dwelt on the possibility of this voyage with a visionary joy.\nDeronda, in his preparations for the marriage, which he hoped not to defer beyond a couple of months, wished to consult Sir Hugo about his affairs. But he had another reason to visit Diplow - his promise to Gwendolen. His sense of blessedness in his own lot had an aching anxiety at its heart: it was no treason to Mirah, but a part of that full nature which, along with his joy in her, could hold by its side the care for another.\nDeronda came twice to Diplow, and saw Gwendolen twice - and yet he went back to town without having told her anything about the change in his prospects. He blamed himself; but in the first interview Gwendolen was so absorbed in what she had to say to him, so full of questions which he must answer about the arrangement of her life, how she could make herself less ignorant and selfish, that Deronda shrank from brushing her wants aside in order to speak of himself, nay, from inflicting a wound on her when she was leaning on him for help.\nIn the second interview, he found her in a state of deep depression, overmastered by miserable memories. She cried hysterically, and said that he would always despise her. He could only seek words of soothing encouragement: and when she gradually revived under them, with a pathetic look of renewed childlike interest, it was impossible to lay another burden on her.\nBut he felt it a pressing duty to make the difficult disclosure. Gwendolen, it was true, never recognized his having any affairs; and it had never even occurred to her to ask him why he happened to be at Genoa. But this unconsciousness would make a sudden revelation all the heavier a blow to her; and it would be cruel to let her hear of it from others. He could not tell her in writing: his tenderness could not bear to think of her reading his virtual farewell in solitude, and perhaps feeling him indifferent to her.\nSo he made a third visit. This time, he found Hans Meyrick installed with his easel at Diplow, beginning his picture of the three daughters \"in the Gainsborough style,\" and varying his work by rambling to Pennicote to see the Gascoignes. Hans appeared to have recovered his vivacity, but Deronda detected some artificiality in it. With all his admiration for Deronda, Hans could not help a certain irritation against him, for keeping the true state of his feelings hidden.\nIt is true that poor Hans had confided in Deronda without any curiosity as to confidences that might have been given in return; but he must be excused for his bruised sensibility, since he had the consciousness of having done right by his fortunate friend. Perhaps in reward of his good behaviour he gave his tongue more freedom; and he was too convinced of Deronda's happiness to have any idea of what he was feeling about Gwendolen, so that he spoke of her without hesitation.\n\"When did you come down, Hans?\" said Deronda, joining him in the grounds where he was sketching.\n\"Oh, ten days ago; I ran down with Rex Gascoigne and stayed at the rectory a day or two. I'm up in all the gossip of these parts, and have assisted at an infant school to which sister Anna escorted me. The village is idyllic, and the Gascoignes are perfect - besides being related to the Vandyke duchess. I caught a glimpse of her in her black robes at a distance when I was taken to Offendene to see the old house. I suppose you have been there? A fine old place. An excellent setting for a widow with romantic fortunes. And she seems to have had several romances. I think there was one between her and my friend Rex.\"\n\"Not long before her marriage, then?\" said Deronda, interested. \"How came you to know of it?\"\n\"Oh - I found out that Rex never goes to Offendene, and has never seen the duchess since she came back; and Anna let slip something that proved to me that Rex was once hovering about his fair cousin close enough to get singed. I don't know what was her part in the affair. Perhaps the duke came in and carried her off. I understand now why Gascoigne talks of making the law his mistress and remaining a bachelor. But since the duke did not get himself drowned for your sake, it may turn out to be for my friend Rex's. Who knows?\"\n\"Is it absolutely necessary that Mrs. Grandcourt should marry again?\" said Deronda.\n\"You monster!\" retorted Hans, \"do you want her to wear mourning clothes for you all her life?\"\nDeronda could say nothing, but he looked so annoyed that Hans changed the subject.\nNo wonder that Deronda winced. The joke touched sensibilities that were already quivering with the anticipation of witnessing Gwendolen's pain. But he had come with the firm resolve that he would not again evade the trial, and the next day he rode to Offendene.\nHe found Gwendolen awaiting him in the drawing-room. She seemed less sad than he had seen her since her husband's death; there was no smile on her face, but a placid self-possession, in contrast with the mood in which he had last found her. She noticed Deronda's sadness; and they were no sooner seated than she said:\n\"You were afraid of coming to see me, because I was so full of despair last time. But I have been sorry ever since. I have been making it a reason why I should be as cheerful as I can, because I would not give you any pain about me.\"\nThere was an unusual sweetness in Gwendolen's tone that seemed to Deronda to infuse the utmost cruelty into his task. But he felt obliged to begin.\n\"I am in some trouble to-day,\" he said, looking at her rather mournfully; \"because I have things to tell you which you will think I should have spoken of before. They are things affecting my own future. I shall seem to have made an ill return to you for the trust you have placed in me - never to have given you an idea of events that make great changes for me. But when we have been together we have hardly had time to enter into less pressing subjects than the trials you were going through.\" There was a sort of timid, pleading tenderness in Deronda's deep tones.\nA thrill of surprise was visible in Gwendolen, but she did not feel any fear. Her mind flew at once of some change in his position with regard to Sir Hugo and Sir Hugo's property. She said-\n\"You never thought of anything but what you could do to help me.\"\n\"It will perhaps astonish you,\" said Deronda, \"that I have only quite lately known who were my parents.\"\nGwendolen was not astonished: she felt the more assured that her expectations were right. Deronda went on.\n\"I went to Italy to meet my mother. It was by her wish that I was brought up in ignorance of my parentage. She parted with me after my father's death, when I was a baby. But she is now very ill, and she felt that the secrecy ought not to be any longer maintained. Her chief reason for it had been that she did not wish me to know I was a Jew.\"\n\"A Jew!\" Gwendolen exclaimed, in a low tone of amazement, with an utterly frustrated look, as if some confusing potion were creeping through her system.\nDeronda coloured, and did not speak, while Gwendolen, with her eyes fixed on the floor, was struggling to find her answer. Looking up, she said-\n\"What difference need that have made?\"\n\"It has made a great difference to me that I have known it,\" said Deronda, emphatically, but uncertain what force his words would carry.\nGwendolen meditated again, and then said feelingly, \"I hope there is nothing to make you mind. You are just the same as if you were not a Jew.\" She meant to reassure him that nothing of that external sort could affect the way in which she regarded him.\n\"The discovery was far from being painful to me,\" he said. \"I was glad of it. I had been prepared for it by becoming intimate with a very remarkable Jew, whose ideas have attracted me so much that I think of devoting my life to them.\"\nAgain Gwendolen seemed shaken - this time frustration was mingled with alarm. She looked at Deronda with lips childishly parted. She had a dreadful foreboding of mountainous travel for her mind before it could reach Deronda's.\n\"That is an object,\" he said, \"which will by-and-by force me to leave England for some time - for some years. I have purposes which will take me to the East.\"\nGwendolen's lips began to tremble. \"But you will come back?\" she said, tasting her own tears as they fell.\nDeronda could not sit still. He rose, and went to the mantelpiece. \"If I live,\" he said- \"some time.\"\nThey were both silent.\n\"What are you going to do?\" she asked at last, very mildly. \"Can I understand the ideas, or am I too ignorant?\"\n\"I am going to the East to become better acquainted with the condition of my race in various countries there,\" said Deronda, gently, and anxious to expand on impersonal reasons. \"The idea that I am possessed with is that of restoring a political existence to my people, making them a nation again, giving them a national centre, though they are scattered over the face of the globe. I am resolved to devote my life to that task.\"\nThere was a long silence. The world seemed getting larger round poor Gwendolen, and she more solitary and helpless in the midst. Before the bewildering vision of these wild-stretching purposes, she felt herself reduced to a mere speck. There comes a terrible moment to many souls when the great movements of the world, the larger destinies of mankind, which have lain neglected in newspapers, enter like an earthquake into their own lives. That was the sort of crisis which was at this moment beginning in Gwendolen's small life: she was for the first time feeling the pressure of a vast mysterious movement, for the first time being dislodged from her supremacy in her own world, and getting a sense that her horizon was but a dipping onward of an existence with which her own was revolving.\nAll her troubles had still left her with the impression that whatever surrounded her was somehow specially for her, and it was because of this that no jealousy had been roused in her relation to Deronda: she could not think of him as rightfully belonging to others more than to her. But here had come a shock which went deeper than personal jealousy - something spiritual and tremendous that thrust her away, and yet quelled her into self-humiliation.\nGwendolen sat like a statue in the intensity of her thought. At length something occurred to her that made her turn to Deronda and say in a trembling voice-\n\"Is that everything?\"\nThe question was like a dart to him. \"The Jew whom I mentioned just now,\" he answered, with a tremor in his tones too, \"is the brother of Miss Lapidoth, whom you have often heard sing.\"\nA great wave of remembrance passed through Gwendolen and spread as a deep, painful flush over neck and face. She recalled that morning when she had called on Mirah, and heard Deronda's voice reading, and had been told that he was reading Hebrew with Mirah's brother.\n\"He is very ill - very near death,\" Deronda went on nervously, and then stopped short. Would she divine the rest?\n\"Did she tell you that I went to her?\" said Gwendolen, abruptly.\n\"No,\" said Deronda. \"I don't understand you.\"\nShe turned away her eyes again, and sat thinking, until at last she said-\n\"But can you marry?\"\n\"Yes,\" said Deronda. \"I am going to marry.\"\nGwendolen began to tremble visibly; then she looked before her with dilated eyes, stretched out her arms, and cried with a smothered voice-\n\"I said I should be forsaken. I have been a cruel woman. And I am forsaken.\"\nDeronda's anguish was intolerable. He could not help himself. He seized her outstretched hands, and kneeled at her feet. She was the victim of his happiness.\n\"I am cruel, too, I am cruel,\" he repeated, with a sort of groan.\nHis presence and touch seemed to dispel a horrible vision, and she felt something like the return of consciousness after fainting. She dwelt on his face with tender recollection: his look of sorrow brought back a very far-off moment in the library, at the Abbey. Sobs rose, and great tears fell fast. Deronda held her hands still with one of his, and himself pressed her handkerchief against her eyes. She submitted like a half-soothed child, her effort to speak hindered by struggling sobs. At last she said, brokenly-\n\"I said - it should be better - better with me - for having known you.\"\nHis eyes too were large with tears. She pulled one of her hands from his, and returned his action, pressing his tears away.\n\"We shall not be quite parted,\" he said. \"I will write to you always, when I can, and you will answer?\"\nHe waited till she said in a whisper, \"I will try.\"\n\"I shall be more with you than I used to be,\" Deronda said, releasing her hands and rising from his knees. \"Perhaps we can never see each other again. But our minds may get nearer.\"\nGwendolen said nothing, but rose too, automatically. Her withered look of grief made him hate his own words: they seemed to have the hardness of easy consolation in them. She felt that he was going, and that nothing could hinder it. The sense of it was like a dreadful whisper in her ear.\nDeronda could not speak again: yet it was difficult to move toward the parting, till she looked at him with a sort of intention in her eyes, which helped him. He put out his hand silently, and when she had placed hers within it, she said what her mind had been labouring with-\n\"You have been very good to me. I have deserved nothing. I will try - try to live. I shall think of you. What good have I been? Only harm. Don't let me be harm to you. It shall be the better for me-\"\nShe could not finish for the intense effort of speaking. The burden of that difficult rectitude was a weight her frame tottered under.\nShe bent forward to kiss his cheek, and he kissed hers. Then they looked at each other for an instant with clasped hands, and he turned away.\nWhen he was quite gone, her mother came in and found her sitting motionless.\n\"Gwendolen, dearest, you look very ill,\" she said, touching her cold hands.\n\"Yes, mamma. But don't be afraid. I am going to live,\" said Gwendolen, bursting out hysterically.\nHer mother persuaded her to go to bed, and watched by her. Through the day and half the night she fell into fits of shrieking, but cried in the midst of them to her mother, \"Don't be afraid. I shall live. I mean to live.\"\nAfter all, she slept; and when she waked, she looked up at her mother and said tenderly, \"Ah, poor mamma! You have been sitting up with me. Don't be unhappy. I shall live. I shall be better.\"",
        "paragraph_chars": [
            [
                0,
                517
            ],
            [
                517,
                898
            ],
            [
                898,
                1459
            ],
            [
                1459,
                2448
            ],
            [
                2448,
                3029
            ],
            [
                3029,
                3392
            ],
            [
                3392,
                3824
            ],
            [
                3824,
                4365
            ],
            [
                4365,
                4732
            ],
            [
                4732,
                5253
            ],
            [
                5253,
                5726
            ],
            [
                5726,
                6205
            ],
            [
                6205,
                6302
            ],
            [
                6302,
                6922
            ],
            [
                6922,
                7016
            ],
            [
                7016,
                7546
            ],
            [
                7546,
                7630
            ],
            [
                7630,
                7725
            ],
            [
                7725,
                7808
            ],
            [
                7808,
                8070
            ],
            [
                8070,
                8388
            ],
            [
                8388,
                8622
            ],
            [
                8622,
                8770
            ],
            [
                8770,
                9337
            ],
            [
                9337,
                9527
            ],
            [
                9527,
                9593
            ],
            [
                9593,
                9698
            ],
            [
                9698,
                9805
            ],
            [
                9805,
                10149
            ],
            [
                10149,
                10302
            ],
            [
                10302,
                10447
            ],
            [
                10447,
                10486
            ],
            [
                10486,
                10623
            ],
            [
                10623,
                10876
            ],
            [
                10876,
                11111
            ],
            [
                11111,
                11338
            ],
            [
                11338,
                11497
            ],
            [
                11497,
                11604
            ],
            [
                11604,
                11706
            ],
            [
                11706,
                11729
            ],
            [
                11729,
                11841
            ],
            [
                11841,
                12271
            ],
            [
                12271,
                13064
            ],
            [
                13064,
                13516
            ],
            [
                13516,
                13673
            ],
            [
                13673,
                13695
            ],
            [
                13695,
                13881
            ],
            [
                13881,
                14148
            ],
            [
                14148,
                14262
            ],
            [
                14262,
                14327
            ],
            [
                14327,
                14373
            ],
            [
                14373,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14512
            ],
            [
                14512,
                14652
            ],
            [
                14652,
                14729
            ],
            [
                14729,
                14887
            ],
            [
                14887,
                14953
            ],
            [
                14953,
                15473
            ],
            [
                15473,
                15545
            ],
            [
                15545,
                15669
            ],
            [
                15669,
                15773
            ],
            [
                15773,
                15825
            ],
            [
                15825,
                16007
            ],
            [
                16007,
                16296
            ],
            [
                16296,
                16573
            ],
            [
                16573,
                16773
            ],
            [
                16773,
                16908
            ],
            [
                16908,
                17050
            ],
            [
                17050,
                17127
            ],
            [
                17127,
                17203
            ],
            [
                17203,
                17301
            ],
            [
                17301,
                17523
            ],
            [
                17523,
                17714
            ]
        ],
        "segment_chars": [
            [
                0,
                72
            ],
            [
                72,
                270
            ],
            [
                270,
                372
            ],
            [
                372,
                517
            ],
            [
                517,
                629
            ],
            [
                629,
                829
            ],
            [
                829,
                898
            ],
            [
                898,
                1092
            ],
            [
                1092,
                1186
            ],
            [
                1186,
                1413
            ],
            [
                1413,
                1459
            ],
            [
                1459,
                1573
            ],
            [
                1573,
                1754
            ],
            [
                1754,
                1846
            ],
            [
                1846,
                1968
            ],
            [
                1968,
                2273
            ],
            [
                2273,
                2448
            ],
            [
                2448,
                2670
            ],
            [
                2670,
                2770
            ],
            [
                2770,
                2831
            ],
            [
                2831,
                2982
            ],
            [
                2982,
                3029
            ],
            [
                3029,
                3062
            ],
            [
                3062,
                3242
            ],
            [
                3242,
                3392
            ],
            [
                3392,
                3540
            ],
            [
                3540,
                3610
            ],
            [
                3610,
                3824
            ],
            [
                3824,
                3977
            ],
            [
                3977,
                4365
            ],
            [
                4365,
                4470
            ],
            [
                4470,
                4537
            ],
            [
                4537,
                4732
            ],
            [
                4732,
                4797
            ],
            [
                4797,
                4943
            ],
            [
                4943,
                5087
            ],
            [
                5087,
                5253
            ],
            [
                5253,
                5279
            ],
            [
                5279,
                5491
            ],
            [
                5491,
                5584
            ],
            [
                5584,
                5726
            ],
            [
                5726,
                5983
            ],
            [
                5983,
                6205
            ],
            [
                6205,
                6237
            ],
            [
                6237,
                6302
            ],
            [
                6302,
                6391
            ],
            [
                6391,
                6504
            ],
            [
                6504,
                6607
            ],
            [
                6607,
                6718
            ],
            [
                6718,
                6749
            ],
            [
                6749,
                6767
            ],
            [
                6767,
                6824
            ],
            [
                6824,
                6868
            ],
            [
                6868,
                6922
            ],
            [
                6922,
                6960
            ],
            [
                6960,
                6986
            ],
            [
                6986,
                7016
            ],
            [
                7016,
                7243
            ],
            [
                7243,
                7289
            ],
            [
                7289,
                7335
            ],
            [
                7335,
                7429
            ],
            [
                7429,
                7534
            ],
            [
                7534,
                7546
            ],
            [
                7546,
                7616
            ],
            [
                7616,
                7630
            ],
            [
                7630,
                7645
            ],
            [
                7645,
                7725
            ],
            [
                7725,
                7808
            ],
            [
                7808,
                7839
            ],
            [
                7839,
                7952
            ],
            [
                7952,
                8070
            ],
            [
                8070,
                8123
            ],
            [
                8123,
                8311
            ],
            [
                8311,
                8388
            ],
            [
                8388,
                8470
            ],
            [
                8470,
                8504
            ],
            [
                8504,
                8622
            ],
            [
                8622,
                8740
            ],
            [
                8740,
                8770
            ],
            [
                8770,
                8932
            ],
            [
                8932,
                8973
            ],
            [
                8973,
                9132
            ],
            [
                9132,
                9265
            ],
            [
                9265,
                9337
            ],
            [
                9337,
                9415
            ],
            [
                9415,
                9517
            ],
            [
                9517,
                9527
            ],
            [
                9527,
                9593
            ],
            [
                9593,
                9698
            ],
            [
                9698,
                9788
            ],
            [
                9788,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9912
            ],
            [
                9912,
                9975
            ],
            [
                9975,
                10069
            ],
            [
                10069,
                10149
            ],
            [
                10149,
                10158
            ],
            [
                10158,
                10302
            ],
            [
                10302,
                10425
            ],
            [
                10425,
                10447
            ],
            [
                10447,
                10486
            ],
            [
                10486,
                10623
            ],
            [
                10623,
                10718
            ],
            [
                10718,
                10767
            ],
            [
                10767,
                10876
            ],
            [
                10876,
                10935
            ],
            [
                10935,
                10954
            ],
            [
                10954,
                11111
            ],
            [
                11111,
                11189
            ],
            [
                11189,
                11240
            ],
            [
                11240,
                11338
            ],
            [
                11338,
                11448
            ],
            [
                11448,
                11497
            ],
            [
                11497,
                11532
            ],
            [
                11532,
                11558
            ],
            [
                11558,
                11604
            ],
            [
                11604,
                11633
            ],
            [
                11633,
                11671
            ],
            [
                11671,
                11706
            ],
            [
                11706,
                11729
            ],
            [
                11729,
                11757
            ],
            [
                11757,
                11789
            ],
            [
                11789,
                11841
            ],
            [
                11841,
                12019
            ],
            [
                12019,
                12224
            ],
            [
                12224,
                12271
            ],
            [
                12271,
                12297
            ],
            [
                12297,
                12400
            ],
            [
                12400,
                12507
            ],
            [
                12507,
                12711
            ],
            [
                12711,
                13064
            ],
            [
                13064,
                13347
            ],
            [
                13347,
                13516
            ],
            [
                13516,
                13577
            ],
            [
                13577,
                13673
            ],
            [
                13673,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13881
            ],
            [
                13881,
                13990
            ],
            [
                13990,
                14148
            ],
            [
                14148,
                14235
            ],
            [
                14235,
                14262
            ],
            [
                14262,
                14301
            ],
            [
                14301,
                14327
            ],
            [
                14327,
                14347
            ],
            [
                14347,
                14373
            ],
            [
                14373,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14489
            ],
            [
                14489,
                14512
            ],
            [
                14512,
                14652
            ],
            [
                14652,
                14682
            ],
            [
                14682,
                14709
            ],
            [
                14709,
                14729
            ],
            [
                14729,
                14764
            ],
            [
                14764,
                14791
            ],
            [
                14791,
                14850
            ],
            [
                14850,
                14887
            ],
            [
                14887,
                14953
            ],
            [
                14953,
                15084
            ],
            [
                15084,
                15216
            ],
            [
                15216,
                15254
            ],
            [
                15254,
                15355
            ],
            [
                15355,
                15445
            ],
            [
                15445,
                15473
            ],
            [
                15473,
                15545
            ],
            [
                15545,
                15581
            ],
            [
                15581,
                15669
            ],
            [
                15669,
                15710
            ],
            [
                15710,
                15773
            ],
            [
                15773,
                15825
            ],
            [
                15825,
                15932
            ],
            [
                15932,
                15976
            ],
            [
                15976,
                16007
            ],
            [
                16007,
                16060
            ],
            [
                16060,
                16178
            ],
            [
                16178,
                16240
            ],
            [
                16240,
                16296
            ],
            [
                16296,
                16455
            ],
            [
                16455,
                16573
            ],
            [
                16573,
                16605
            ],
            [
                16605,
                16630
            ],
            [
                16630,
                16656
            ],
            [
                16656,
                16678
            ],
            [
                16678,
                16701
            ],
            [
                16701,
                16712
            ],
            [
                16712,
                16741
            ],
            [
                16741,
                16773
            ],
            [
                16773,
                16830
            ],
            [
                16830,
                16908
            ],
            [
                16908,
                16964
            ],
            [
                16964,
                17050
            ],
            [
                17050,
                17127
            ],
            [
                17127,
                17203
            ],
            [
                17203,
                17216
            ],
            [
                17216,
                17237
            ],
            [
                17237,
                17301
            ],
            [
                17301,
                17360
            ],
            [
                17360,
                17492
            ],
            [
                17492,
                17506
            ],
            [
                17506,
                17523
            ],
            [
                17523,
                17629
            ],
            [
                17629,
                17663
            ],
            [
                17663,
                17681
            ],
            [
                17681,
                17695
            ],
            [
                17695,
                17714
            ]
        ],
        "overlap_chars": [
            [
                0,
                70
            ],
            [
                70,
                72
            ],
            [
                72,
                74
            ],
            [
                84,
                151
            ],
            [
                152,
                158
            ],
            [
                164,
                190
            ],
            [
                191,
                197
            ],
            [
                198,
                202
            ],
            [
                203,
                205
            ],
            [
                218,
                244
            ],
            [
                250,
                268
            ],
            [
                268,
                270
            ],
            [
                270,
                345
            ],
            [
                346,
                356
            ],
            [
                359,
                361
            ],
            [
                370,
                372
            ],
            [
                376,
                380
            ],
            [
                381,
                408
            ],
            [
                409,
                470
            ],
            [
                471,
                473
            ],
            [
                483,
                490
            ],
            [
                499,
                502
            ],
            [
                503,
                504
            ],
            [
                515,
                517
            ],
            [
                521,
                538
            ],
            [
                546,
                563
            ],
            [
                570,
                627
            ],
            [
                627,
                629
            ],
            [
                629,
                631
            ],
            [
                639,
                737
            ],
            [
                737,
                738
            ],
            [
                751,
                752
            ],
            [
                776,
                781
            ],
            [
                791,
                796
            ],
            [
                803,
                829
            ],
            [
                829,
                897
            ],
            [
                906,
                909
            ],
            [
                917,
                919
            ],
            [
                920,
                924
            ],
            [
                934,
                935
            ],
            [
                968,
                969
            ],
            [
                980,
                992
            ],
            [
                996,
                1090
            ],
            [
                1090,
                1092
            ],
            [
                1098,
                1116
            ],
            [
                1117,
                1120
            ],
            [
                1121,
                1149
            ],
            [
                1150,
                1184
            ],
            [
                1184,
                1186
            ],
            [
                1195,
                1202
            ],
            [
                1212,
                1317
            ],
            [
                1318,
                1322
            ],
            [
                1323,
                1332
            ],
            [
                1334,
                1413
            ],
            [
                1413,
                1458
            ],
            [
                1459,
                1527
            ],
            [
                1528,
                1573
            ],
            [
                1573,
                1638
            ],
            [
                1639,
                1754
            ],
            [
                1754,
                1775
            ],
            [
                1776,
                1846
            ],
            [
                1846,
                1878
            ],
            [
                1879,
                1884
            ],
            [
                1885,
                1889
            ],
            [
                1890,
                1951
            ],
            [
                1952,
                1966
            ],
            [
                1966,
                1968
            ],
            [
                1968,
                1972
            ],
            [
                1973,
                1990
            ],
            [
                1996,
                1998
            ],
            [
                1999,
                2093
            ],
            [
                2098,
                2103
            ],
            [
                2104,
                2126
            ],
            [
                2140,
                2273
            ],
            [
                2273,
                2340
            ],
            [
                2341,
                2383
            ],
            [
                2383,
                2448
            ],
            [
                2448,
                2518
            ],
            [
                2528,
                2531
            ],
            [
                2532,
                2626
            ],
            [
                2627,
                2668
            ],
            [
                2670,
                2720
            ],
            [
                2720,
                2770
            ],
            [
                2770,
                2773
            ],
            [
                2774,
                2777
            ],
            [
                2785,
                2787
            ],
            [
                2788,
                2789
            ],
            [
                2790,
                2796
            ],
            [
                2797,
                2815
            ],
            [
                2829,
                2831
            ],
            [
                2831,
                2834
            ],
            [
                2839,
                2842
            ],
            [
                2852,
                2857
            ],
            [
                2858,
                2982
            ],
            [
                2982,
                2995
            ],
            [
                3004,
                3027
            ],
            [
                3027,
                3029
            ],
            [
                3029,
                3032
            ],
            [
                3038,
                3045
            ],
            [
                3046,
                3060
            ],
            [
                3060,
                3062
            ],
            [
                3062,
                3078
            ],
            [
                3084,
                3217
            ],
            [
                3218,
                3242
            ],
            [
                3242,
                3319
            ],
            [
                3321,
                3391
            ],
            [
                3392,
                3453
            ],
            [
                3454,
                3457
            ],
            [
                3458,
                3460
            ],
            [
                3467,
                3503
            ],
            [
                3512,
                3520
            ],
            [
                3527,
                3530
            ],
            [
                3531,
                3538
            ],
            [
                3538,
                3539
            ],
            [
                3540,
                3546
            ],
            [
                3551,
                3565
            ],
            [
                3566,
                3568
            ],
            [
                3569,
                3574
            ],
            [
                3575,
                3581
            ],
            [
                3584,
                3610
            ],
            [
                3610,
                3613
            ],
            [
                3614,
                3653
            ],
            [
                3654,
                3674
            ],
            [
                3679,
                3685
            ],
            [
                3686,
                3750
            ],
            [
                3750,
                3751
            ],
            [
                3758,
                3762
            ],
            [
                3763,
                3777
            ],
            [
                3777,
                3778
            ],
            [
                3779,
                3823
            ],
            [
                3824,
                3877
            ],
            [
                3880,
                3965
            ],
            [
                3966,
                3977
            ],
            [
                3977,
                3999
            ],
            [
                4000,
                4121
            ],
            [
                4122,
                4156
            ],
            [
                4157,
                4170
            ],
            [
                4171,
                4197
            ],
            [
                4198,
                4201
            ],
            [
                4202,
                4209
            ],
            [
                4209,
                4223
            ],
            [
                4224,
                4235
            ],
            [
                4245,
                4248
            ],
            [
                4249,
                4254
            ],
            [
                4261,
                4326
            ],
            [
                4327,
                4363
            ],
            [
                4363,
                4364
            ],
            [
                4365,
                4388
            ],
            [
                4388,
                4449
            ],
            [
                4450,
                4468
            ],
            [
                4468,
                4470
            ],
            [
                4470,
                4537
            ],
            [
                4537,
                4573
            ],
            [
                4574,
                4636
            ],
            [
                4639,
                4682
            ],
            [
                4682,
                4732
            ],
            [
                4732,
                4735
            ],
            [
                4736,
                4797
            ],
            [
                4797,
                4943
            ],
            [
                4943,
                4967
            ],
            [
                4968,
                4998
            ],
            [
                4999,
                5014
            ],
            [
                5017,
                5033
            ],
            [
                5037,
                5042
            ],
            [
                5043,
                5045
            ],
            [
                5046,
                5051
            ],
            [
                5052,
                5054
            ],
            [
                5059,
                5062
            ],
            [
                5068,
                5070
            ],
            [
                5085,
                5087
            ],
            [
                5087,
                5099
            ],
            [
                5109,
                5228
            ],
            [
                5248,
                5252
            ],
            [
                5256,
                5258
            ],
            [
                5264,
                5265
            ],
            [
                5266,
                5277
            ],
            [
                5277,
                5278
            ],
            [
                5279,
                5283
            ],
            [
                5288,
                5289
            ],
            [
                5293,
                5392
            ],
            [
                5393,
                5470
            ],
            [
                5475,
                5491
            ],
            [
                5491,
                5562
            ],
            [
                5563,
                5576
            ],
            [
                5577,
                5582
            ],
            [
                5584,
                5596
            ],
            [
                5597,
                5674
            ],
            [
                5687,
                5690
            ],
            [
                5696,
                5704
            ],
            [
                5724,
                5725
            ],
            [
                5726,
                5755
            ],
            [
                5756,
                5760
            ],
            [
                5765,
                5775
            ],
            [
                5784,
                5787
            ],
            [
                5798,
                5803
            ],
            [
                5816,
                5857
            ],
            [
                5858,
                5860
            ],
            [
                5861,
                5880
            ],
            [
                5881,
                5884
            ],
            [
                5885,
                5911
            ],
            [
                5912,
                5981
            ],
            [
                5981,
                5982
            ],
            [
                5983,
                6012
            ],
            [
                6023,
                6041
            ],
            [
                6042,
                6070
            ],
            [
                6081,
                6111
            ],
            [
                6121,
                6205
            ],
            [
                6205,
                6237
            ],
            [
                6237,
                6290
            ],
            [
                6300,
                6302
            ],
            [
                6302,
                6320
            ],
            [
                6321,
                6391
            ],
            [
                6391,
                6430
            ],
            [
                6430,
                6469
            ],
            [
                6473,
                6478
            ],
            [
                6479,
                6490
            ],
            [
                6491,
                6502
            ],
            [
                6502,
                6504
            ],
            [
                6504,
                6526
            ],
            [
                6526,
                6527
            ],
            [
                6528,
                6531
            ],
            [
                6532,
                6558
            ],
            [
                6569,
                6607
            ],
            [
                6607,
                6665
            ],
            [
                6671,
                6716
            ],
            [
                6716,
                6718
            ],
            [
                6718,
                6747
            ],
            [
                6749,
                6767
            ],
            [
                6767,
                6824
            ],
            [
                6824,
                6868
            ],
            [
                6868,
                6875
            ],
            [
                6876,
                6922
            ],
            [
                6922,
                6960
            ],
            [
                6960,
                6973
            ],
            [
                6974,
                6984
            ],
            [
                6984,
                6986
            ],
            [
                6987,
                7007
            ],
            [
                7008,
                7016
            ],
            [
                7020,
                7021
            ],
            [
                7022,
                7123
            ],
            [
                7129,
                7132
            ],
            [
                7138,
                7243
            ],
            [
                7243,
                7289
            ],
            [
                7289,
                7335
            ],
            [
                7335,
                7429
            ],
            [
                7433,
                7532
            ],
            [
                7532,
                7534
            ],
            [
                7534,
                7546
            ],
            [
                7546,
                7616
            ],
            [
                7616,
                7628
            ],
            [
                7628,
                7630
            ],
            [
                7630,
                7645
            ],
            [
                7645,
                7684
            ],
            [
                7702,
                7705
            ],
            [
                7706,
                7709
            ],
            [
                7710,
                7722
            ],
            [
                7722,
                7725
            ],
            [
                7725,
                7768
            ],
            [
                7769,
                7786
            ],
            [
                7795,
                7798
            ],
            [
                7806,
                7807
            ],
            [
                7808,
                7837
            ],
            [
                7837,
                7839
            ],
            [
                7839,
                7842
            ],
            [
                7848,
                7933
            ],
            [
                7943,
                7945
            ],
            [
                7946,
                7950
            ],
            [
                7950,
                7952
            ],
            [
                7956,
                7967
            ],
            [
                7968,
                8029
            ],
            [
                8031,
                8034
            ],
            [
                8035,
                8069
            ],
            [
                8070,
                8078
            ],
            [
                8079,
                8088
            ],
            [
                8089,
                8108
            ],
            [
                8109,
                8121
            ],
            [
                8121,
                8123
            ],
            [
                8123,
                8311
            ],
            [
                8311,
                8314
            ],
            [
                8323,
                8330
            ],
            [
                8333,
                8340
            ],
            [
                8340,
                8372
            ],
            [
                8373,
                8388
            ],
            [
                8388,
                8450
            ],
            [
                8451,
                8458
            ],
            [
                8459,
                8470
            ],
            [
                8470,
                8473
            ],
            [
                8474,
                8504
            ],
            [
                8504,
                8547
            ],
            [
                8548,
                8622
            ],
            [
                8622,
                8634
            ],
            [
                8643,
                8672
            ],
            [
                8673,
                8729
            ],
            [
                8734,
                8738
            ],
            [
                8738,
                8740
            ],
            [
                8740,
                8762
            ],
            [
                8768,
                8770
            ],
            [
                8770,
                8772
            ],
            [
                8773,
                8775
            ],
            [
                8776,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8894,
                8899
            ],
            [
                8909,
                8932
            ],
            [
                8932,
                8964
            ],
            [
                8965,
                8973
            ],
            [
                8973,
                9055
            ],
            [
                9058,
                9132
            ],
            [
                9132,
                9200
            ],
            [
                9201,
                9214
            ],
            [
                9215,
                9223
            ],
            [
                9224,
                9243
            ],
            [
                9244,
                9248
            ],
            [
                9249,
                9265
            ],
            [
                9265,
                9290
            ],
            [
                9290,
                9291
            ],
            [
                9292,
                9300
            ],
            [
                9301,
                9335
            ],
            [
                9335,
                9337
            ],
            [
                9337,
                9372
            ],
            [
                9382,
                9387
            ],
            [
                9388,
                9391
            ],
            [
                9409,
                9415
            ],
            [
                9415,
                9423
            ],
            [
                9429,
                9436
            ],
            [
                9440,
                9517
            ],
            [
                9517,
                9525
            ],
            [
                9527,
                9590
            ],
            [
                9593,
                9698
            ],
            [
                9698,
                9775
            ],
            [
                9776,
                9788
            ],
            [
                9788,
                9803
            ],
            [
                9803,
                9805
            ],
            [
                9805,
                9806
            ],
            [
                9806,
                9807
            ],
            [
                9813,
                9815
            ],
            [
                9816,
                9821
            ],
            [
                9822,
                9841
            ],
            [
                9841,
                9912
            ],
            [
                9912,
                9968
            ],
            [
                9973,
                9975
            ],
            [
                9975,
                10069
            ],
            [
                10069,
                10085
            ],
            [
                10093,
                10149
            ],
            [
                10149,
                10150
            ],
            [
                10150,
                10155
            ],
            [
                10155,
                10158
            ],
            [
                10158,
                10302
            ],
            [
                10302,
                10309
            ],
            [
                10318,
                10416
            ],
            [
                10423,
                10425
            ],
            [
                10433,
                10435
            ],
            [
                10435,
                10436
            ],
            [
                10437,
                10440
            ],
            [
                10441,
                10445
            ],
            [
                10447,
                10486
            ],
            [
                10486,
                10573
            ],
            [
                10573,
                10574
            ],
            [
                10575,
                10578
            ],
            [
                10579,
                10623
            ],
            [
                10623,
                10718
            ],
            [
                10718,
                10721
            ],
            [
                10722,
                10766
            ],
            [
                10767,
                10779
            ],
            [
                10789,
                10874
            ],
            [
                10874,
                10875
            ],
            [
                10876,
                10933
            ],
            [
                10935,
                10936
            ],
            [
                10936,
                10954
            ],
            [
                10954,
                11092
            ],
            [
                11093,
                11103
            ],
            [
                11104,
                11108
            ],
            [
                11108,
                11111
            ],
            [
                11111,
                11140
            ],
            [
                11143,
                11152
            ],
            [
                11153,
                11164
            ],
            [
                11165,
                11189
            ],
            [
                11189,
                11240
            ],
            [
                11240,
                11247
            ],
            [
                11248,
                11258
            ],
            [
                11270,
                11337
            ],
            [
                11338,
                11366
            ],
            [
                11366,
                11429
            ],
            [
                11432,
                11448
            ],
            [
                11448,
                11497
            ],
            [
                11497,
                11532
            ],
            [
                11532,
                11558
            ],
            [
                11558,
                11602
            ],
            [
                11602,
                11604
            ],
            [
                11604,
                11633
            ],
            [
                11633,
                11653
            ],
            [
                11654,
                11664
            ],
            [
                11664,
                11669
            ],
            [
                11669,
                11671
            ],
            [
                11671,
                11683
            ],
            [
                11687,
                11691
            ],
            [
                11693,
                11694
            ],
            [
                11694,
                11703
            ],
            [
                11703,
                11706
            ],
            [
                11706,
                11728
            ],
            [
                11729,
                11757
            ],
            [
                11757,
                11766
            ],
            [
                11767,
                11789
            ],
            [
                11789,
                11841
            ],
            [
                11841,
                11972
            ],
            [
                11986,
                11988
            ],
            [
                11996,
                11998
            ],
            [
                11999,
                12009
            ],
            [
                12017,
                12019
            ],
            [
                12019,
                12161
            ],
            [
                12168,
                12181
            ],
            [
                12182,
                12224
            ],
            [
                12224,
                12258
            ],
            [
                12259,
                12263
            ],
            [
                12264,
                12268
            ],
            [
                12271,
                12295
            ],
            [
                12295,
                12297
            ],
            [
                12297,
                12400
            ],
            [
                12400,
                12463
            ],
            [
                12463,
                12464
            ],
            [
                12465,
                12507
            ],
            [
                12507,
                12638
            ],
            [
                12639,
                12648
            ],
            [
                12649,
                12662
            ],
            [
                12662,
                12709
            ],
            [
                12709,
                12711
            ],
            [
                12711,
                13063
            ],
            [
                13064,
                13067
            ],
            [
                13068,
                13071
            ],
            [
                13072,
                13080
            ],
            [
                13081,
                13108
            ],
            [
                13109,
                13119
            ],
            [
                13120,
                13214
            ],
            [
                13215,
                13281
            ],
            [
                13282,
                13347
            ],
            [
                13347,
                13413
            ],
            [
                13416,
                13439
            ],
            [
                13440,
                13488
            ],
            [
                13489,
                13492
            ],
            [
                13493,
                13516
            ],
            [
                13516,
                13525
            ],
            [
                13526,
                13543
            ],
            [
                13547,
                13567
            ],
            [
                13575,
                13577
            ],
            [
                13577,
                13631
            ],
            [
                13632,
                13671
            ],
            [
                13673,
                13681
            ],
            [
                13692,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13781
            ],
            [
                13787,
                13788
            ],
            [
                13789,
                13815
            ],
            [
                13815,
                13881
            ],
            [
                13881,
                13990
            ],
            [
                14003,
                14084
            ],
            [
                14085,
                14088
            ],
            [
                14089,
                14098
            ],
            [
                14099,
                14148
            ],
            [
                14148,
                14163
            ],
            [
                14166,
                14181
            ],
            [
                14181,
                14199
            ],
            [
                14200,
                14235
            ],
            [
                14235,
                14262
            ],
            [
                14262,
                14301
            ],
            [
                14301,
                14325
            ],
            [
                14325,
                14327
            ],
            [
                14327,
                14347
            ],
            [
                14347,
                14373
            ],
            [
                14373,
                14421
            ],
            [
                14421,
                14422
            ],
            [
                14429,
                14445
            ],
            [
                14447,
                14451
            ],
            [
                14452,
                14455
            ],
            [
                14456,
                14468
            ],
            [
                14468,
                14487
            ],
            [
                14487,
                14489
            ],
            [
                14489,
                14512
            ],
            [
                14512,
                14521
            ],
            [
                14522,
                14593
            ],
            [
                14594,
                14603
            ],
            [
                14604,
                14607
            ],
            [
                14608,
                14616
            ],
            [
                14616,
                14650
            ],
            [
                14652,
                14682
            ],
            [
                14682,
                14709
            ],
            [
                14709,
                14729
            ],
            [
                14729,
                14764
            ],
            [
                14764,
                14791
            ],
            [
                14791,
                14823
            ],
            [
                14823,
                14850
            ],
            [
                14850,
                14887
            ],
            [
                14887,
                14951
            ],
            [
                14951,
                14953
            ],
            [
                14953,
                15019
            ],
            [
                15025,
                15084
            ],
            [
                15084,
                15096
            ],
            [
                15106,
                15110
            ],
            [
                15111,
                15130
            ],
            [
                15136,
                15163
            ],
            [
                15164,
                15185
            ],
            [
                15186,
                15200
            ],
            [
                15200,
                15201
            ],
            [
                15202,
                15216
            ],
            [
                15216,
                15254
            ],
            [
                15254,
                15261
            ],
            [
                15262,
                15266
            ],
            [
                15267,
                15276
            ],
            [
                15277,
                15355
            ],
            [
                15355,
                15395
            ],
            [
                15400,
                15415
            ],
            [
                15416,
                15445
            ],
            [
                15445,
                15456
            ],
            [
                15461,
                15471
            ],
            [
                15473,
                15480
            ],
            [
                15483,
                15502
            ],
            [
                15505,
                15519
            ],
            [
                15522,
                15545
            ],
            [
                15545,
                15562
            ],
            [
                15569,
                15581
            ],
            [
                15581,
                15584
            ],
            [
                15592,
                15669
            ],
            [
                15669,
                15710
            ],
            [
                15710,
                15773
            ],
            [
                15773,
                15825
            ],
            [
                15825,
                15883
            ],
            [
                15883,
                15924
            ],
            [
                15930,
                15932
            ],
            [
                15933,
                15940
            ],
            [
                15941,
                15947
            ],
            [
                15948,
                15976
            ],
            [
                15976,
                16007
            ],
            [
                16007,
                16060
            ],
            [
                16060,
                16086
            ],
            [
                16087,
                16178
            ],
            [
                16178,
                16240
            ],
            [
                16240,
                16294
            ],
            [
                16294,
                16296
            ],
            [
                16296,
                16325
            ],
            [
                16331,
                16455
            ],
            [
                16455,
                16457
            ],
            [
                16458,
                16556
            ],
            [
                16567,
                16571
            ],
            [
                16573,
                16605
            ],
            [
                16605,
                16630
            ],
            [
                16630,
                16640
            ],
            [
                16643,
                16656
            ],
            [
                16656,
                16678
            ],
            [
                16678,
                16701
            ],
            [
                16701,
                16712
            ],
            [
                16712,
                16735
            ],
            [
                16736,
                16739
            ],
            [
                16741,
                16770
            ],
            [
                16773,
                16793
            ],
            [
                16798,
                16816
            ],
            [
                16828,
                16830
            ],
            [
                16830,
                16868
            ],
            [
                16869,
                16908
            ],
            [
                16908,
                16964
            ],
            [
                16964,
                17050
            ],
            [
                17050,
                17127
            ],
            [
                17127,
                17177
            ],
            [
                17178,
                17203
            ],
            [
                17203,
                17216
            ],
            [
                17216,
                17237
            ],
            [
                17237,
                17301
            ],
            [
                17301,
                17360
            ],
            [
                17360,
                17403
            ],
            [
                17404,
                17492
            ],
            [
                17492,
                17506
            ],
            [
                17506,
                17523
            ],
            [
                17523,
                17563
            ],
            [
                17563,
                17578
            ],
            [
                17579,
                17629
            ],
            [
                17629,
                17663
            ],
            [
                17663,
                17681
            ],
            [
                17681,
                17695
            ],
            [
                17695,
                17714
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                72
            ],
            [
                72,
                72
            ],
            [
                72,
                270
            ],
            [
                270,
                372
            ],
            [
                372,
                517
            ],
            [
                517,
                629
            ],
            [
                629,
                829
            ],
            [
                829,
                829
            ],
            [
                829,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                898
            ],
            [
                898,
                1092
            ],
            [
                1092,
                1186
            ],
            [
                1186,
                1186
            ],
            [
                1186,
                1413
            ],
            [
                1413,
                1459
            ],
            [
                1459,
                1459
            ],
            [
                1459,
                1459
            ],
            [
                1459,
                1573
            ],
            [
                1573,
                1754
            ],
            [
                1754,
                1846
            ],
            [
                1846,
                1968
            ],
            [
                1968,
                2273
            ],
            [
                2273,
                2448
            ],
            [
                2448,
                2770
            ],
            [
                2770,
                2831
            ],
            [
                2831,
                2982
            ],
            [
                2982,
                3029
            ],
            [
                3029,
                3062
            ],
            [
                3062,
                3242
            ],
            [
                3242,
                3392
            ],
            [
                3392,
                3610
            ],
            [
                3610,
                3824
            ],
            [
                3824,
                3824
            ],
            [
                3824,
                3977
            ],
            [
                3977,
                4365
            ],
            [
                4365,
                4470
            ],
            [
                4470,
                4537
            ],
            [
                4537,
                4732
            ],
            [
                4732,
                4797
            ],
            [
                4797,
                4943
            ],
            [
                4943,
                5087
            ],
            [
                5087,
                5253
            ],
            [
                5253,
                5491
            ],
            [
                5491,
                5584
            ],
            [
                5584,
                5726
            ],
            [
                5726,
                5983
            ],
            [
                5983,
                5983
            ],
            [
                5983,
                6205
            ],
            [
                6205,
                6237
            ],
            [
                6237,
                6302
            ],
            [
                6302,
                6391
            ],
            [
                6391,
                6504
            ],
            [
                6504,
                6607
            ],
            [
                6607,
                6718
            ],
            [
                6718,
                6749
            ],
            [
                6749,
                6749
            ],
            [
                6749,
                6767
            ],
            [
                6767,
                6824
            ],
            [
                6824,
                6868
            ],
            [
                6868,
                6922
            ],
            [
                6922,
                6960
            ],
            [
                6960,
                6986
            ],
            [
                6986,
                7016
            ],
            [
                7016,
                7016
            ],
            [
                7016,
                7243
            ],
            [
                7243,
                7289
            ],
            [
                7289,
                7335
            ],
            [
                7335,
                7335
            ],
            [
                7335,
                7429
            ],
            [
                7429,
                7429
            ],
            [
                7429,
                7534
            ],
            [
                7534,
                7546
            ],
            [
                7546,
                7616
            ],
            [
                7616,
                7630
            ],
            [
                7630,
                7645
            ],
            [
                7645,
                7725
            ],
            [
                7725,
                7808
            ],
            [
                7808,
                7808
            ],
            [
                7808,
                7808
            ],
            [
                7808,
                7808
            ],
            [
                7808,
                7808
            ],
            [
                7808,
                7839
            ],
            [
                7839,
                7952
            ],
            [
                7952,
                8070
            ],
            [
                8070,
                8123
            ],
            [
                8123,
                8311
            ],
            [
                8311,
                8388
            ],
            [
                8388,
                8470
            ],
            [
                8470,
                8504
            ],
            [
                8504,
                8622
            ],
            [
                8622,
                8740
            ],
            [
                8740,
                8770
            ],
            [
                8770,
                8932
            ],
            [
                8932,
                8973
            ],
            [
                8973,
                9132
            ],
            [
                9132,
                9265
            ],
            [
                9265,
                9337
            ],
            [
                9337,
                9415
            ],
            [
                9415,
                9517
            ],
            [
                9517,
                9527
            ],
            [
                9527,
                9593
            ],
            [
                9593,
                9593
            ],
            [
                9593,
                9698
            ],
            [
                9698,
                9788
            ],
            [
                9788,
                9805
            ],
            [
                9805,
                9841
            ],
            [
                9841,
                9912
            ],
            [
                9912,
                9975
            ],
            [
                9975,
                10069
            ],
            [
                10069,
                10149
            ],
            [
                10149,
                10158
            ],
            [
                10158,
                10302
            ],
            [
                10302,
                10425
            ],
            [
                10425,
                10447
            ],
            [
                10447,
                10486
            ],
            [
                10486,
                10623
            ],
            [
                10623,
                10718
            ],
            [
                10718,
                10767
            ],
            [
                10767,
                10876
            ],
            [
                10876,
                10876
            ],
            [
                10876,
                10954
            ],
            [
                10954,
                11111
            ],
            [
                11111,
                11189
            ],
            [
                11189,
                11240
            ],
            [
                11240,
                11338
            ],
            [
                11338,
                11338
            ],
            [
                11338,
                11338
            ],
            [
                11338,
                11448
            ],
            [
                11448,
                11497
            ],
            [
                11497,
                11497
            ],
            [
                11497,
                11532
            ],
            [
                11532,
                11558
            ],
            [
                11558,
                11604
            ],
            [
                11604,
                11633
            ],
            [
                11633,
                11671
            ],
            [
                11671,
                11671
            ],
            [
                11671,
                11706
            ],
            [
                11706,
                11729
            ],
            [
                11729,
                11729
            ],
            [
                11729,
                11757
            ],
            [
                11757,
                11789
            ],
            [
                11789,
                11841
            ],
            [
                11841,
                12019
            ],
            [
                12019,
                12224
            ],
            [
                12224,
                12271
            ],
            [
                12271,
                12271
            ],
            [
                12271,
                12297
            ],
            [
                12297,
                12400
            ],
            [
                12400,
                12507
            ],
            [
                12507,
                12711
            ],
            [
                12711,
                12711
            ],
            [
                12711,
                12711
            ],
            [
                12711,
                12711
            ],
            [
                12711,
                13064
            ],
            [
                13064,
                13347
            ],
            [
                13347,
                13516
            ],
            [
                13516,
                13516
            ],
            [
                13516,
                13577
            ],
            [
                13577,
                13673
            ],
            [
                13673,
                13695
            ],
            [
                13695,
                13732
            ],
            [
                13732,
                13881
            ],
            [
                13881,
                13990
            ],
            [
                13990,
                14148
            ],
            [
                14148,
                14235
            ],
            [
                14235,
                14235
            ],
            [
                14235,
                14262
            ],
            [
                14262,
                14301
            ],
            [
                14301,
                14327
            ],
            [
                14327,
                14347
            ],
            [
                14347,
                14373
            ],
            [
                14373,
                14447
            ],
            [
                14447,
                14468
            ],
            [
                14468,
                14489
            ],
            [
                14489,
                14512
            ],
            [
                14512,
                14652
            ],
            [
                14652,
                14682
            ],
            [
                14682,
                14709
            ],
            [
                14709,
                14729
            ],
            [
                14729,
                14764
            ],
            [
                14764,
                14791
            ],
            [
                14791,
                14850
            ],
            [
                14850,
                14887
            ],
            [
                14887,
                14953
            ],
            [
                14953,
                15084
            ],
            [
                15084,
                15216
            ],
            [
                15216,
                15254
            ],
            [
                15254,
                15355
            ],
            [
                15355,
                15445
            ],
            [
                15445,
                15473
            ],
            [
                15473,
                15545
            ],
            [
                15545,
                15581
            ],
            [
                15581,
                15669
            ],
            [
                15669,
                15710
            ],
            [
                15710,
                15773
            ],
            [
                15773,
                15825
            ],
            [
                15825,
                15932
            ],
            [
                15932,
                15932
            ],
            [
                15932,
                15976
            ],
            [
                15976,
                16007
            ],
            [
                16007,
                16060
            ],
            [
                16060,
                16178
            ],
            [
                16178,
                16240
            ],
            [
                16240,
                16296
            ],
            [
                16296,
                16455
            ],
            [
                16455,
                16573
            ],
            [
                16573,
                16605
            ],
            [
                16605,
                16630
            ],
            [
                16630,
                16656
            ],
            [
                16656,
                16678
            ],
            [
                16678,
                16701
            ],
            [
                16701,
                16712
            ],
            [
                16712,
                16741
            ],
            [
                16741,
                16773
            ],
            [
                16773,
                16830
            ],
            [
                16830,
                16908
            ],
            [
                16908,
                16964
            ],
            [
                16964,
                17050
            ],
            [
                17050,
                17127
            ],
            [
                17127,
                17203
            ],
            [
                17203,
                17216
            ],
            [
                17216,
                17237
            ],
            [
                17237,
                17301
            ],
            [
                17301,
                17360
            ],
            [
                17360,
                17492
            ],
            [
                17492,
                17506
            ],
            [
                17506,
                17523
            ],
            [
                17523,
                17629
            ],
            [
                17629,
                17663
            ],
            [
                17663,
                17681
            ],
            [
                17681,
                17695
            ],
            [
                17695,
                17714
            ]
        ]
    }
}