{
    "original": {
        "text": "In the checkered area of human experience the seasons are all mingled as in the golden age: fruit and blossom hang together; in the same moment the sickle is reaping and the seed is sprinkled; one tends the green cluster and another treads the winepress. Nay, in each of our lives harvest and spring-time are continually one, until himself gathers us and sows us anew in his invisible fields.\nAmong the blessings of love there is hardly one more exquisite than the sense that in uniting the beloved life to ours we can watch over its happiness, bring comfort where hardship was, and over memories of privation and suffering open the sweetest fountains of joy. Deronda's love for Mirah was strongly imbued with that blessed protectiveness. Even with infantine feet she had begun to tread among thorns; and the first time he had beheld her face it had seemed to him the girlish image of despair.\nBut now she was glowing like a dark-tipped yet delicate ivory-tinted flower in the warm sunlight of content, thinking of any possible grief as part of that life with Deronda, which she could call by no other name than good. And he watched the sober gladness which gave new beauty to her movements; and her habitual attitudes of repose, with a delight which made him say to himself that it was enough of personal joy for him to save her from pain. She knew nothing of Hans's struggle or of Gwendolen's pang; for after the assurance that Deronda's hidden love had been for her, she easily explained Gwendolen's eager solicitude about him as part of a grateful dependence on his goodness, such as she herself had known. And all Deronda's words about Mrs. Grandcourt confirmed that view of their relation, though he never touched on it except in the most distant manner. Mirah was ready to believe that he had been a rescuing angel to many besides herself. The only wonder was, that she among them all was to have the bliss of being continually by his side.\nSo, when the bridal veil was around Mirah it hid no doubtful tremors--only a thrill of awe at the acceptance of a great gift which required great uses. And the velvet canopy never covered a more goodly bride and bridegroom, to whom their people might more wisely wish offspring; more truthful lips never touched the sacrament marriage-wine; the marriage-blessing never gathered stronger promise of fulfillment than in the integrity of their mutual pledge. Naturally, they were married according to the Jewish rite. And since no religion seems yet to have demanded that when we make a feast we should invite only the highest rank of our acquaintances, few, it is to be hoped, will be offended to learn that among the guests at Deronda's little wedding-feast was the entire Cohen family, with the one exception of the baby who carried on her teething intelligently at home. How could Mordecai have borne that those friends of his adversity should have been shut out from rejoicing in common with him?\nMrs. Meyrick so fully understood this that she had quite reconciled herself to meeting the Jewish pawnbroker, and was there with her three daughters--all of them enjoying the consciousness that Mirah's marriage to Deronda crowned a romance which would always make a sweet memory to them. For which of them, mother or girls, had not had a generous part in it--giving their best in feeling and in act to her who needed? If Hans could have been there, it would have been better; but Mab had already observed that men must suffer for being so inconvenient; suppose she, Kate, and Amy had all fallen in love with Mr. Deronda?--but being women they were not so ridiculous.\nThe Meyricks were rewarded for conquering their prejudices by hearing a speech from Mr. Cohen, which had the rare quality among speeches of not being quite after the usual pattern. Jacob ate beyond his years, and contributed several small whinnying laughs as a free accompaniment of his father's speech, not irreverently, but from a lively sense that his family was distinguishing itself; while Adelaide Rebekah, in a new Sabbath frock, maintained throughout a grave air of responsibility.\nMordecai's brilliant eyes, sunken in their large sockets, dwelt on the scene with the cherishing benignancy of a spirit already lifted into an aloofness which nullified only selfish requirements and left sympathy alive. But continually, after his gaze had been traveling round on the others, it returned to dwell on Deronda with a fresh gleam of trusting affection.\nThe wedding-feast was humble, but Mirah was not without splendid wedding-gifts. As soon as the betrothal had been known, there were friends who had entertained graceful devices. Sir Hugo and Lady Mallinger had taken trouble to provide a complete equipment for Eastern travel, as well as a precious locket containing an inscription--\"_To the bride of our dear Daniel Deronda all blessings. H. and L. M._\" The Klesmers sent a perfect watch, also with a pretty inscription.\nBut something more precious than gold and gems came to Deronda from the neighborhood of Diplow on the morning of his marriage. It was a letter containing these words:\nDo not think of me sorrowfully on your wedding-day. I have remembered your words--that I may live to be one of the best of women, who make others glad that they were born. I do not yet see how that can be, but you know better than I. If it ever comes true, it will be because you helped me. I only thought of myself, and I made you grieve. It hurts me now to think of your grief. You must not grieve any more for me. It is better--it shall be better with me because I have known you.\nGWENDOLEN GRANDCOURT.\nThe preparations for the departure of all three to the East began at once; for Deronda could not deny Ezra's wish that they should set out on the voyage forthwith, so that he might go with them, instead of detaining them to watch over him. He had no belief that Ezra's life would last through the voyage, for there were symptoms which seemed to show that the last stage of his malady had set in. But Ezra himself had said, \"Never mind where I die, so that I am with you.\"\nHe did not set out with them. One morning early he said to Deronda, \"Do not quit me to-day. I shall die before it is ended.\"\nHe chose to be dressed and sit up in his easy chair as usual, Deronda and Mirah on each side of him, and for some hours he was unusually silent, not even making the effort to speak, but looking at them occasionally with eyes full of some restful meaning, as if to assure them that while this remnant of breathing-time was difficult, he felt an ocean of peace beneath him.\nIt was not till late in the afternoon, when the light was falling, that he took a hand of each in his and said, looking at Deronda, \"Death is coming to me as the divine kiss which is both parting and reunion--which takes me from your bodily eyes and gives me full presence in your soul. Where thou goest, Daniel, I shall go. Is it not begun? Have I not breathed my soul into you? We shall live together.\"\nHe paused, and Deronda waited, thinking that there might be another word for him. But slowly and with effort Ezra, pressing on their hands, raised himself and uttered in Hebrew the confession of the divine Unity, which long for generations has been on the lips of the dying Israelite.\nHe sank back gently into his chair, and did not speak again. But it was some hours before he had ceased to breathe, with Mirah's and Deronda's arms around him.\n\"Nothing is here for tears, nothing to wail Or knock the breast; no weakness, no contempt, Dispraise or blame; nothing but well and fair, And what may quiet us in a death so noble.\"",
        "paragraph_chars": [
            [
                0,
                393
            ],
            [
                393,
                894
            ],
            [
                894,
                1948
            ],
            [
                1948,
                2947
            ],
            [
                2947,
                3614
            ],
            [
                3614,
                4104
            ],
            [
                4104,
                4470
            ],
            [
                4470,
                4941
            ],
            [
                4941,
                5108
            ],
            [
                5108,
                5592
            ],
            [
                5592,
                5614
            ],
            [
                5614,
                6086
            ],
            [
                6086,
                6211
            ],
            [
                6211,
                6583
            ],
            [
                6583,
                6988
            ],
            [
                6988,
                7273
            ],
            [
                7273,
                7433
            ],
            [
                7433,
                7614
            ]
        ],
        "segment_chars": [
            [
                0,
                255
            ],
            [
                255,
                393
            ],
            [
                393,
                660
            ],
            [
                660,
                739
            ],
            [
                739,
                894
            ],
            [
                894,
                1118
            ],
            [
                1118,
                1341
            ],
            [
                1341,
                1611
            ],
            [
                1611,
                1761
            ],
            [
                1761,
                1847
            ],
            [
                1847,
                1948
            ],
            [
                1948,
                2100
            ],
            [
                2100,
                2404
            ],
            [
                2404,
                2463
            ],
            [
                2463,
                2820
            ],
            [
                2820,
                2947
            ],
            [
                2947,
                3235
            ],
            [
                3235,
                3365
            ],
            [
                3365,
                3614
            ],
            [
                3614,
                3795
            ],
            [
                3795,
                4104
            ],
            [
                4104,
                4324
            ],
            [
                4324,
                4470
            ],
            [
                4470,
                4550
            ],
            [
                4550,
                4648
            ],
            [
                4648,
                4859
            ],
            [
                4859,
                4941
            ],
            [
                4941,
                5068
            ],
            [
                5068,
                5108
            ],
            [
                5108,
                5160
            ],
            [
                5160,
                5280
            ],
            [
                5280,
                5342
            ],
            [
                5342,
                5399
            ],
            [
                5399,
                5448
            ],
            [
                5448,
                5488
            ],
            [
                5488,
                5525
            ],
            [
                5525,
                5592
            ],
            [
                5592,
                5614
            ],
            [
                5614,
                5854
            ],
            [
                5854,
                6010
            ],
            [
                6010,
                6086
            ],
            [
                6086,
                6116
            ],
            [
                6116,
                6178
            ],
            [
                6178,
                6211
            ],
            [
                6211,
                6583
            ],
            [
                6583,
                6870
            ],
            [
                6870,
                6908
            ],
            [
                6908,
                6925
            ],
            [
                6925,
                6963
            ],
            [
                6963,
                6988
            ],
            [
                6988,
                7070
            ],
            [
                7070,
                7273
            ],
            [
                7273,
                7334
            ],
            [
                7334,
                7433
            ],
            [
                7433,
                7614
            ]
        ],
        "overlap_chars": [
            [
                393,
                475
            ],
            [
                512,
                518
            ],
            [
                545,
                599
            ],
            [
                614,
                660
            ],
            [
                660,
                739
            ],
            [
                764,
                771
            ],
            [
                787,
                856
            ],
            [
                864,
                867
            ],
            [
                876,
                894
            ],
            [
                894,
                936
            ],
            [
                941,
                949
            ],
            [
                963,
                976
            ],
            [
                982,
                1044
            ],
            [
                1050,
                1067
            ],
            [
                1116,
                1118
            ],
            [
                1122,
                1190
            ],
            [
                1228,
                1340
            ],
            [
                1341,
                1502
            ],
            [
                1526,
                1611
            ],
            [
                1615,
                1676
            ],
            [
                1694,
                1761
            ],
            [
                1761,
                1847
            ],
            [
                1847,
                1948
            ],
            [
                1948,
                2016
            ],
            [
                2018,
                2072
            ],
            [
                2098,
                2100
            ],
            [
                2100,
                2170
            ],
            [
                2225,
                2263
            ],
            [
                2274,
                2316
            ],
            [
                2326,
                2345
            ],
            [
                2358,
                2403
            ],
            [
                2404,
                2463
            ],
            [
                2654,
                2732
            ],
            [
                2820,
                2892
            ],
            [
                2613,
                2615
            ],
            [
                2903,
                2926
            ],
            [
                2937,
                2947
            ],
            [
                2947,
                2959
            ],
            [
                2994,
                3095
            ],
            [
                3097,
                3100
            ],
            [
                3109,
                3235
            ],
            [
                3235,
                3304
            ],
            [
                3363,
                3365
            ],
            [
                3365,
                3430
            ],
            [
                3443,
                3567
            ],
            [
                3569,
                3614
            ],
            [
                3700,
                3707
            ],
            [
                3684,
                3692
            ],
            [
                3795,
                3821
            ],
            [
                4001,
                4104
            ],
            [
                4104,
                4189
            ],
            [
                4201,
                4272
            ],
            [
                4278,
                4285
            ],
            [
                4299,
                4324
            ],
            [
                4324,
                4327
            ],
            [
                4347,
                4355
            ],
            [
                4399,
                4470
            ],
            [
                4470,
                4550
            ],
            [
                4648,
                4679
            ],
            [
                4705,
                4774
            ],
            [
                4857,
                4859
            ],
            [
                4874,
                4908
            ],
            [
                4914,
                4941
            ],
            [
                4941,
                5012
            ],
            [
                5026,
                5068
            ],
            [
                5068,
                5106
            ],
            [
                5111,
                5160
            ],
            [
                5160,
                5188
            ],
            [
                5190,
                5280
            ],
            [
                5280,
                5342
            ],
            [
                5342,
                5399
            ],
            [
                5399,
                5448
            ],
            [
                5448,
                5488
            ],
            [
                5488,
                5525
            ],
            [
                5525,
                5537
            ],
            [
                5539,
                5592
            ],
            [
                5592,
                5612
            ],
            [
                5614,
                5759
            ],
            [
                5767,
                5807
            ],
            [
                5852,
                5854
            ],
            [
                5854,
                6010
            ],
            [
                6010,
                6086
            ],
            [
                6086,
                6116
            ],
            [
                6116,
                6178
            ],
            [
                6178,
                6211
            ],
            [
                6211,
                6583
            ],
            [
                6583,
                6790
            ],
            [
                6792,
                6870
            ],
            [
                6870,
                6908
            ],
            [
                6908,
                6925
            ],
            [
                6925,
                6963
            ],
            [
                6963,
                6988
            ],
            [
                6988,
                7070
            ],
            [
                7070,
                7206
            ],
            [
                7212,
                7273
            ],
            [
                7273,
                7334
            ],
            [
                7334,
                7433
            ],
            [
                7433,
                7476
            ],
            [
                7477,
                7523
            ],
            [
                7528,
                7570
            ],
            [
                7571,
                7614
            ]
        ],
        "row_chars": [
            [
                0,
                255
            ],
            [
                255,
                393
            ],
            [
                393,
                660
            ],
            [
                660,
                739
            ],
            [
                739,
                894
            ],
            [
                894,
                1118
            ],
            [
                1118,
                1341
            ],
            [
                1341,
                1611
            ],
            [
                1611,
                1761
            ],
            [
                1761,
                1847
            ],
            [
                1847,
                1948
            ],
            [
                1948,
                2100
            ],
            [
                2100,
                2404
            ],
            [
                2404,
                2463
            ],
            [
                2463,
                2947
            ],
            [
                2947,
                3235
            ],
            [
                3235,
                3365
            ],
            [
                3365,
                3614
            ],
            [
                3614,
                4104
            ],
            [
                4104,
                4324
            ],
            [
                4324,
                4470
            ],
            [
                4470,
                4550
            ],
            [
                4550,
                4648
            ],
            [
                4648,
                4859
            ],
            [
                4859,
                4941
            ],
            [
                4941,
                5068
            ],
            [
                5068,
                5108
            ],
            [
                5108,
                5160
            ],
            [
                5160,
                5280
            ],
            [
                5280,
                5342
            ],
            [
                5342,
                5399
            ],
            [
                5399,
                5448
            ],
            [
                5448,
                5488
            ],
            [
                5488,
                5525
            ],
            [
                5525,
                5592
            ],
            [
                5592,
                5614
            ],
            [
                5614,
                5854
            ],
            [
                5854,
                6010
            ],
            [
                6010,
                6086
            ],
            [
                6086,
                6116
            ],
            [
                6116,
                6178
            ],
            [
                6178,
                6211
            ],
            [
                6211,
                6583
            ],
            [
                6583,
                6870
            ],
            [
                6870,
                6908
            ],
            [
                6908,
                6925
            ],
            [
                6925,
                6963
            ],
            [
                6963,
                6988
            ],
            [
                6988,
                7070
            ],
            [
                7070,
                7273
            ],
            [
                7273,
                7334
            ],
            [
                7334,
                7433
            ],
            [
                7433,
                7614
            ]
        ]
    },
    "abridged": {
        "text": "Among the blessings of love there is hardly one more exquisite than the sense that we can bring comfort where hardship was, and over memories of suffering open the sweetest fountains of joy. Deronda's love for Mirah was strongly imbued with that blessed protectiveness. Since infancy she had trod among thorns; and the first time he had beheld her face it had seemed the image of despair.\nBut now she was glowing like a dark-tipped delicate flower in the sunlight of content, thinking of any possible grief as part of her life with Deronda. He watched the sober gladness which gave new beauty to her movements, with a delight which made him say to himself that it was enough of personal joy for him to save her from pain.\nShe knew nothing of Hans's struggle or of Gwendolen's pang; for after the assurance that Deronda's hidden love had been for her, she easily explained Gwendolen's interest in him as part of a grateful dependence on his goodness, such as she herself had known. All Deronda's words about Mrs. Grandcourt confirmed that view, though he never touched on it except in the most distant manner. Mirah was ready to believe that he had been a rescuing angel to many besides herself. The only wonder was, that she among them all was to have the bliss of being continually by his side.\nSo, when the bridal veil was around Mirah it hid no doubtful tremors - only a thrill of awe at the acceptance of a great gift. And the velvet canopy never covered a more goodly bride and bridegroom; more truthful lips never touched the sacramental marriage-wine; the marriage-blessing never held a stronger promise of fulfilment than in the integrity of their mutual pledge.\nNaturally, they were married according to the Jewish rite. Among the guests at Deronda's little wedding-feast was the entire Cohen family; for how could Mordecai have borne that those friends of his adversity should be shut out from rejoicing with him?\nMrs. Meyrick had quite reconciled herself to meeting the Jewish pawnbroker, and was there with her three daughters - all enjoying the consciousness that Mirah's marriage to Deronda crowned a romance which would always make a sweet memory to them. For which of them, mother or girls, had not had a generous part in it? If Hans could have been there, it would have been better; but Mab observed that men must suffer for being so inconvenient; suppose she, Kate, and Amy had all fallen in love with Mr. Deronda?- but being women they were not so ridiculous.\nMr. Cohen gave a speech; Jacob ate beyond his years; while Adelaide Rebekah, in a new Sabbath frock, maintained throughout a grave air of responsibility.\nMordecai's brilliant eyes, sunken in their large sockets, dwelt on the scene with the benignancy of a spirit already lifted into an aloofness which nullified selfish needs and left sympathy alive. But his gaze always returned to dwell on Deronda with a fresh gleam of trusting affection.\nThe wedding-feast was humble, but Mirah was not without splendid wedding-gifts. Sir Hugo and Lady Mallinger had provided a complete equipment for Eastern travel, as well as a precious locket. The Klesmers sent a perfect watch, with a pretty inscription.\nBut something more precious than gold and gems came to Deronda from the neighbourhood of Diplow on the morning of his marriage. It was a letter containing these words:-\n'Do not think of me sorrowfully on your wedding-day. I have remembered your words - that I may live to be one of the best of women, who make others glad that they were born. I do not yet see how that can be, but you know better than I. If it ever comes true, it will be because you helped me. I only thought of myself, and I made you grieve. It hurts me now to think of your grief. You must not grieve any more for me. It is better - it shall be better with me because I have known you.\n'GWENDOLEN GRANDCOURT.'\nThe preparations for the departure of all three to the East began at once; for Deronda could not deny Ezra's wish that they should set out on the journey forthwith, so that he might go with them. He had no belief that Ezra's life would last through the voyage, for there were symptoms which seemed to show that the last stage of his malady had set in. But Ezra himself had said, \"Never mind where I die, so that I am with you.\"\nHe did not set out with them. One morning early he said to Deronda, \"Do not quit me to-day. I shall die before it is ended.\"\nHe chose to be dressed and sit up in his easy chair as usual, Deronda and Mirah on each side of him, and for some hours he was unusually silent, not even making the effort to speak, but looking at them occasionally with eyes full of some restful meaning, as if to assure them that while this remnant of breathing-time was difficult, he felt an ocean of peace beneath him.\nIt was not till late in the afternoon, when the light was falling, that he took a hand of each in his and said, looking at Deronda, \"Death is coming to me as the divine kiss which is both parting and reunion - which takes me from your bodily eyes and gives me full presence in your soul. Where thou goest, Daniel, I shall go. Is it not begun? Have I not breathed my soul into you? We shall live together.\"\nHe paused, and Deronda waited, thinking that there might be another word for him. But slowly and with effort Ezra, pressing on their hands, raised himself and uttered in Hebrew the confession of the divine Unity, which for generations has been on the lips of the dying Israelite.\nHe sank back gently into his chair, and did not speak again. But it was some hours before he had ceased to breathe, with Mirah's and Deronda's arms around him.\n\"Nothing is here for tears, nothing to wail\nOr knock the breast; no weakness, no contempt,\nDispraise or blame; nothing but well and fair,\nAnd what may quiet us in a death so noble.\"",
        "paragraph_chars": [
            [
                0,
                389
            ],
            [
                389,
                722
            ],
            [
                722,
                1296
            ],
            [
                1296,
                1671
            ],
            [
                1671,
                1924
            ],
            [
                1924,
                2479
            ],
            [
                2479,
                2633
            ],
            [
                2633,
                2921
            ],
            [
                2921,
                3175
            ],
            [
                3175,
                3344
            ],
            [
                3344,
                3831
            ],
            [
                3831,
                3855
            ],
            [
                3855,
                4283
            ],
            [
                4283,
                4408
            ],
            [
                4408,
                4780
            ],
            [
                4780,
                5186
            ],
            [
                5186,
                5466
            ],
            [
                5466,
                5626
            ],
            [
                5626,
                5670
            ],
            [
                5670,
                5717
            ],
            [
                5717,
                5764
            ],
            [
                5764,
                5807
            ]
        ],
        "segment_chars": [
            [
                0,
                191
            ],
            [
                191,
                270
            ],
            [
                270,
                389
            ],
            [
                389,
                541
            ],
            [
                541,
                722
            ],
            [
                722,
                981
            ],
            [
                981,
                1109
            ],
            [
                1109,
                1195
            ],
            [
                1195,
                1296
            ],
            [
                1296,
                1423
            ],
            [
                1423,
                1671
            ],
            [
                1671,
                1730
            ],
            [
                1730,
                1924
            ],
            [
                1924,
                2171
            ],
            [
                2171,
                2242
            ],
            [
                2242,
                2479
            ],
            [
                2479,
                2633
            ],
            [
                2633,
                2830
            ],
            [
                2830,
                2921
            ],
            [
                2921,
                3001
            ],
            [
                3001,
                3113
            ],
            [
                3113,
                3175
            ],
            [
                3175,
                3303
            ],
            [
                3303,
                3344
            ],
            [
                3344,
                3397
            ],
            [
                3397,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3686
            ],
            [
                3686,
                3726
            ],
            [
                3726,
                3763
            ],
            [
                3763,
                3831
            ],
            [
                3831,
                3855
            ],
            [
                3855,
                4051
            ],
            [
                4051,
                4207
            ],
            [
                4207,
                4283
            ],
            [
                4283,
                4313
            ],
            [
                4313,
                4375
            ],
            [
                4375,
                4408
            ],
            [
                4408,
                4780
            ],
            [
                4780,
                5068
            ],
            [
                5068,
                5106
            ],
            [
                5106,
                5123
            ],
            [
                5123,
                5161
            ],
            [
                5161,
                5186
            ],
            [
                5186,
                5268
            ],
            [
                5268,
                5466
            ],
            [
                5466,
                5527
            ],
            [
                5527,
                5626
            ],
            [
                5626,
                5670
            ],
            [
                5670,
                5717
            ],
            [
                5717,
                5764
            ],
            [
                5764,
                5807
            ]
        ],
        "overlap_chars": [
            [
                0,
                82
            ],
            [
                83,
                89
            ],
            [
                90,
                144
            ],
            [
                145,
                191
            ],
            [
                191,
                270
            ],
            [
                284,
                291
            ],
            [
                297,
                366
            ],
            [
                367,
                370
            ],
            [
                371,
                389
            ],
            [
                389,
                431
            ],
            [
                432,
                440
            ],
            [
                441,
                454
            ],
            [
                455,
                517
            ],
            [
                522,
                539
            ],
            [
                539,
                541
            ],
            [
                541,
                609
            ],
            [
                609,
                721
            ],
            [
                722,
                883
            ],
            [
                896,
                981
            ],
            [
                981,
                1042
            ],
            [
                1042,
                1109
            ],
            [
                1109,
                1195
            ],
            [
                1195,
                1296
            ],
            [
                1296,
                1364
            ],
            [
                1367,
                1421
            ],
            [
                1421,
                1423
            ],
            [
                1423,
                1493
            ],
            [
                1493,
                1531
            ],
            [
                1544,
                1586
            ],
            [
                1594,
                1613
            ],
            [
                1625,
                1670
            ],
            [
                1671,
                1730
            ],
            [
                1730,
                1808
            ],
            [
                1814,
                1886
            ],
            [
                1887,
                1889
            ],
            [
                1890,
                1913
            ],
            [
                1914,
                1924
            ],
            [
                1924,
                1936
            ],
            [
                1937,
                2038
            ],
            [
                2041,
                2044
            ],
            [
                2045,
                2171
            ],
            [
                2171,
                2240
            ],
            [
                2240,
                2242
            ],
            [
                2242,
                2307
            ],
            [
                2308,
                2432
            ],
            [
                2434,
                2479
            ],
            [
                2481,
                2488
            ],
            [
                2494,
                2502
            ],
            [
                2504,
                2530
            ],
            [
                2530,
                2633
            ],
            [
                2633,
                2718
            ],
            [
                2719,
                2790
            ],
            [
                2791,
                2798
            ],
            [
                2805,
                2830
            ],
            [
                2830,
                2833
            ],
            [
                2834,
                2842
            ],
            [
                2850,
                2921
            ],
            [
                2921,
                3001
            ],
            [
                3001,
                3032
            ],
            [
                3042,
                3111
            ],
            [
                3111,
                3113
            ],
            [
                3113,
                3147
            ],
            [
                3148,
                3175
            ],
            [
                3175,
                3246
            ],
            [
                3261,
                3303
            ],
            [
                3303,
                3341
            ],
            [
                3348,
                3397
            ],
            [
                3397,
                3425
            ],
            [
                3428,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3686
            ],
            [
                3686,
                3726
            ],
            [
                3726,
                3763
            ],
            [
                3763,
                3775
            ],
            [
                3778,
                3831
            ],
            [
                3832,
                3852
            ],
            [
                3855,
                4000
            ],
            [
                4009,
                4049
            ],
            [
                4049,
                4051
            ],
            [
                4051,
                4207
            ],
            [
                4207,
                4283
            ],
            [
                4283,
                4313
            ],
            [
                4313,
                4375
            ],
            [
                4375,
                4408
            ],
            [
                4408,
                4780
            ],
            [
                4780,
                4987
            ],
            [
                4990,
                5068
            ],
            [
                5068,
                5106
            ],
            [
                5106,
                5123
            ],
            [
                5123,
                5161
            ],
            [
                5161,
                5186
            ],
            [
                5186,
                5268
            ],
            [
                5268,
                5404
            ],
            [
                5405,
                5466
            ],
            [
                5466,
                5527
            ],
            [
                5527,
                5626
            ],
            [
                5626,
                5669
            ],
            [
                5670,
                5716
            ],
            [
                5721,
                5763
            ],
            [
                5764,
                5807
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                191
            ],
            [
                191,
                270
            ],
            [
                270,
                389
            ],
            [
                389,
                541
            ],
            [
                541,
                722
            ],
            [
                722,
                981
            ],
            [
                981,
                1109
            ],
            [
                1109,
                1195
            ],
            [
                1195,
                1296
            ],
            [
                1296,
                1423
            ],
            [
                1423,
                1671
            ],
            [
                1671,
                1730
            ],
            [
                1730,
                1924
            ],
            [
                1924,
                2171
            ],
            [
                2171,
                2242
            ],
            [
                2242,
                2479
            ],
            [
                2479,
                2633
            ],
            [
                2633,
                2830
            ],
            [
                2830,
                2921
            ],
            [
                2921,
                3001
            ],
            [
                3001,
                3001
            ],
            [
                3001,
                3113
            ],
            [
                3113,
                3175
            ],
            [
                3175,
                3303
            ],
            [
                3303,
                3344
            ],
            [
                3344,
                3397
            ],
            [
                3397,
                3518
            ],
            [
                3518,
                3580
            ],
            [
                3580,
                3637
            ],
            [
                3637,
                3686
            ],
            [
                3686,
                3726
            ],
            [
                3726,
                3763
            ],
            [
                3763,
                3831
            ],
            [
                3831,
                3855
            ],
            [
                3855,
                4051
            ],
            [
                4051,
                4207
            ],
            [
                4207,
                4283
            ],
            [
                4283,
                4313
            ],
            [
                4313,
                4375
            ],
            [
                4375,
                4408
            ],
            [
                4408,
                4780
            ],
            [
                4780,
                5068
            ],
            [
                5068,
                5106
            ],
            [
                5106,
                5123
            ],
            [
                5123,
                5161
            ],
            [
                5161,
                5186
            ],
            [
                5186,
                5268
            ],
            [
                5268,
                5466
            ],
            [
                5466,
                5527
            ],
            [
                5527,
                5626
            ],
            [
                5626,
                5807
            ]
        ]
    }
}