{
    "original": {
        "text": "What name doth Joy most borrow When life is fair? \"To-morrow.\" What name doth best fit Sorrow In young despair? \"To-morrow.\"\nThere was a much more lasting trouble at the rectory. Rex arrived there only to throw himself on his bed in a state of apparent apathy, unbroken till the next day, when it began to be interrupted by more positive signs of illness. Nothing could be said about his going to Southampton: instead of that, the chief thought of his mother and Anna was how to tend this patient who did not want to be well, and from being the brightest, most grateful spirit in the household, was metamorphosed into an irresponsive, dull-eyed creature who met all affectionate attempts with a murmur of \"Let me alone.\" His father looked beyond the crisis, and believed it to be the shortest way out of an unlucky affair; but he was sorry for the inevitable suffering, and went now and then to sit by him in silence for a few minutes, parting with a gentle pressure of his hand on Rex's blank brow, and a \"God bless you, my boy.\" Warham and the younger children used to peep round the edge of the door to see this incredible thing of their lively brother being laid low; but fingers were immediately shaken at them to drive them back. The guardian who was always there was Anna, and her little hand was allowed to rest within her brother's, though he never gave it a welcoming pressure. Her soul was divided between anguish for Rex and reproach of Gwendolen.\n\"Perhaps it is wicked of me, but I think I never _can_ love her again,\" came as the recurrent burden of poor little Anna's inward monody. And even Mrs. Gascoigne had an angry feeling toward her niece which she could not refrain from expressing (apologetically) to her husband.\n\"I know of course it is better, and we ought to be thankful that she is not in love with the poor boy; but really. Henry, I think she is hard; she has the heart of a coquette. I can not help thinking that she must have made him believe something, or the disappointment would not have taken hold of him in that way. And some blame attaches to poor Fanny; she is quite blind about that girl.\"\nMr. Gascoigne answered imperatively: \"The less said on that point the better, Nancy. I ought to have been more awake myself. As to the boy, be thankful if nothing worse ever happens to him. Let the thing die out as quickly as possible; and especially with regard to Gwendolen--let it be as if it had never been.\"\nThe rector's dominant feeling was that there had been a great escape. Gwendolen in love with Rex in return would have made a much harder problem, the solution of which might have been taken out of his hands. But he had to go through some further difficulty.\nOne fine morning Rex asked for his bath, and made his toilet as usual. Anna, full of excitement at this change, could do nothing but listen for his coming down, and at last hearing his step, ran to the foot of the stairs to meet him. For the first time he gave her a faint smile, but it looked so melancholy on his pale face that she could hardly help crying.\n\"Nannie!\" he said gently, taking her hand and leading her slowly along with him to the drawing-room. His mother was there, and when she came to kiss him, he said: \"What a plague I am!\"\nThen he sat still and looked out of the bow-window on the lawn and shrubs covered with hoar-frost, across which the sun was sending faint occasional gleams:--something like that sad smile on Rex's face, Anna thought. He felt as if he had had a resurrection into a new world, and did not know what to do with himself there, the old interests being left behind. Anna sat near him, pretending to work, but really watching him with yearning looks. Beyond the garden hedge there was a road where wagons and carts sometimes went on field-work: a railed opening was made in the hedge, because the upland with its bordering wood and clump of ash-trees against the sky was a pretty sight. Presently there came along a wagon laden with timber; the horses were straining their grand muscles, and the driver having cracked his whip, ran along anxiously to guide the leader's head, fearing a swerve. Rex seemed to be shaken into attention, rose and looked till the last quivering trunk of the timber had disappeared, and then walked once or twice along the room. Mrs. Gascoigne was no longer there, and when he came to sit down again, Anna, seeing a return of speech in her brother's eyes, could not resist the impulse to bring a little stool and seat herself against his knee, looking up at him with an expression which seemed to say, \"Do speak to me.\" And he spoke.\n\"I'll tell you what I'm thinking of, Nannie. I will go to Canada, or somewhere of that sort.\" (Rex had not studied the character of our colonial possessions.)\n\"Oh, Rex, not for always!\"\n\"Yes, to get my bread there. I should like to build a hut, and work hard at clearing, and have everything wild about me, and a great wide quiet.\"\n\"And not take me with you?\" said Anna, the big tears coming fast.\n\"How could I?\"\n\"I should like it better than anything; and settlers go with their families. I would sooner go there than stay here in England. I could make the fires, and mend the clothes, and cook the food; and I could learn how to make the bread before we went. It would be nicer than anything--like playing at life over again, as we used to do when we made our tent with the drugget, and had our little plates and dishes.\"\n\"Father and mother would not let you go.\"\n\"Yes, I think they would, when I explained everything. It would save money; and papa would have more to bring up the boys with.\"\nThere was further talk of the same practical kind at intervals, and it ended in Rex's being obliged to consent that Anna should go with him when he spoke to his father on the subject.\nOf course it was when the rector was alone in his study. Their mother would become reconciled to whatever he decided on, but mentioned to her first, the question would have distressed her.\n\"Well, my children!\" said Mr. Gascoigne, cheerfully, as they entered. It was a comfort to see Rex about again.\n\"May we sit down with you a little, papa?\" said Anna. \"Rex has something to say.\"\n\"With all my heart.\"\nIt was a noticeable group that these three creatures made, each of them with a face of the same structural type--the straight brow, the nose suddenly straightened from an intention of being aquiline, the short upper lip, the short but strong and well-hung chin: there was even the same tone of complexion and set of the eye. The gray-haired father was at once massive and keen-looking; there was a perpendicular line in his brow which when he spoke with any force of interest deepened; and the habit of ruling gave him an air of reserved authoritativeness. Rex would have seemed a vision of his father's youth, if it had been possible to imagine Mr. Gascoigne without distinct plans and without command, smitten with a heart sorrow, and having no more notion of concealment than a sick animal; and Anna was a tiny copy of Rex, with hair drawn back and knotted, her face following his in its changes of expression, as if they had one soul between them.\n\"You know all about what has upset me, father,\" Rex began, and Mr. Gascoigne nodded.\n\"I am quite done up for life in this part of the world. I am sure it will be no use my going back to Oxford. I couldn't do any reading. I should fail, and cause you expense for nothing. I want to have your consent to take another course, sir.\"\nMr. Gascoigne nodded more slowly, the perpendicular line on his brow deepened, and Anna's trembling increased.\n\"If you would allow me a small outfit, I should like to go to the colonies and work on the land there.\" Rex thought the vagueness of the phrase prudential; \"the colonies\" necessarily embracing more advantages, and being less capable of being rebutted on a single ground than any particular settlement.\n\"Oh, and with me, papa,\" said Anna, not bearing to be left out from the proposal even temporarily. \"Rex would want some one to take care of him, you know--some one to keep house. And we shall never, either of us, be married. And I should cost nothing, and I should be so happy. I know it would be hard to leave you and mamma; but there are all the others to bring up, and we two should be no trouble to you any more.\"\nAnna had risen from her seat, and used the feminine argument of going closer to her papa as she spoke. He did not smile, but he drew her on his knee and held her there, as if to put her gently out of the question while he spoke to Rex.\n\"You will admit that my experience gives me some power of judging for you, and that I can probably guide you in practical matters better than you can guide yourself?\"\nRex was obliged to say, \"Yes, sir.\"\n\"And perhaps you will admit--though I don't wish to press that point--that you are bound in duty to consider my judgment and wishes?\"\n\"I have never yet placed myself in opposition to you, sir.\" Rex in his secret soul could not feel that he was bound not to go to the colonies, but to go to Oxford again--which was the point in question.\n\"But you will do so if you persist in setting your mind toward a rash and foolish procedure, and deafening yourself to considerations which my experience of life assures me of. You think, I suppose, that you have had a shock which has changed all your inclinations, stupefied your brains, unfitted you for anything but manual labor, and given you a dislike to society? Is that what you believe?\"\n\"Something like that. I shall never be up to the sort of work I must do to live in this part of the world. I have not the spirit for it. I shall never be the same again. And without any disrespect to you, father, I think a young fellow should be allowed to choose his way of life, if he does nobody any harm. There are plenty to stay at home, and those who like might be allowed to go where there are empty places.\"\n\"But suppose I am convinced on good evidence--as I am--that this state of mind of yours is transient, and that if you went off as you propose, you would by-and-by repent, and feel that you had let yourself slip back from the point you have been gaining by your education till now? Have you not strength of mind enough to see that you had better act on my assurance for a time, and test it? In my opinion, so far from agreeing with you that you should be free to turn yourself into a colonist and work in your shirt-sleeves with spade and hatchet--in my opinion you have no right whatever to expatriate yourself until you have honestly endeavored to turn to account the education you have received here. I say nothing of the grief to your mother and me.\"\n\"I'm very sorry; but what can I do? I can't study--that's certain,\" said Rex.\n\"Not just now, perhaps. You will have to miss a term. I have made arrangements for you--how you are to spend the next two months. But I confess I am disappointed in you, Rex. I thought you had more sense than to take up such ideas--to suppose that because you have fallen into a very common trouble, such as most men have to go through, you are loosened from all bonds of duty--just as if your brain had softened and you were no longer a responsible being.\"\nWhat could Rex say? Inwardly he was in a state of rebellion, but he had no arguments to meet his father's; and while he was feeling, in spite of any thing that might be said, that he should like to go off to \"the colonies\" to-morrow, it lay in a deep fold of his consciousness that he ought to feel--if he had been a better fellow he would have felt--more about his old ties. This is the sort of faith we live by in our soul sicknesses.\nRex got up from his seat, as if he held the conference to be at an end. \"You assent to my arrangement, then?\" said Mr. Gascoigne, with that distinct resolution of tone which seems to hold one in a vise.\nThere was a little pause before Rex answered, \"I'll try what I can do, sir. I can't promise.\" His thought was, that trying would be of no use.\nHer father kept Anna, holding her fast, though she wanted to follow Rex. \"Oh, papa,\" she said, the tears coming with her words when the door had closed; \"it is very hard for him. Doesn't he look ill?\"\n\"Yes, but he will soon be better; it will all blow over. And now, Anna, be as quiet as a mouse about it all. Never let it be mentioned when he is gone.\"\n\"No, papa. But I would not be like Gwendolen for any thing--to have people fall in love with me so. It is very dreadful.\"\nAnna dared not say that she was disappointed at not being allowed to go to the colonies with Rex; but that was her secret feeling, and she often afterward went inwardly over the whole affair, saying to herself, \"I should have done with going out, and gloves, and crinoline, and having to talk when I am taken to dinner--and all that!\"\nI like to mark the time, and connect the course of individual lives with the historic stream, for all classes of thinkers. This was the period when the broadening of gauge in crinolines seemed to demand an agitation for the general enlargement of churches, ball-rooms, and vehicles. But Anna Gascoigne's figure would only allow the size of skirt manufactured for young ladies of fourteen.",
        "paragraph_chars": [
            [
                0,
                125
            ],
            [
                125,
                1460
            ],
            [
                1460,
                1737
            ],
            [
                1737,
                2128
            ],
            [
                2128,
                2441
            ],
            [
                2441,
                2699
            ],
            [
                2699,
                3059
            ],
            [
                3059,
                3244
            ],
            [
                3244,
                4599
            ],
            [
                4599,
                4758
            ],
            [
                4758,
                4785
            ],
            [
                4785,
                4931
            ],
            [
                4931,
                4997
            ],
            [
                4997,
                5012
            ],
            [
                5012,
                5423
            ],
            [
                5423,
                5465
            ],
            [
                5465,
                5594
            ],
            [
                5594,
                5778
            ],
            [
                5778,
                5967
            ],
            [
                5967,
                6078
            ],
            [
                6078,
                6160
            ],
            [
                6160,
                6181
            ],
            [
                6181,
                7133
            ],
            [
                7133,
                7218
            ],
            [
                7218,
                7462
            ],
            [
                7462,
                7573
            ],
            [
                7573,
                7875
            ],
            [
                7875,
                8293
            ],
            [
                8293,
                8529
            ],
            [
                8529,
                8696
            ],
            [
                8696,
                8732
            ],
            [
                8732,
                8866
            ],
            [
                8866,
                9069
            ],
            [
                9069,
                9465
            ],
            [
                9465,
                9881
            ],
            [
                9881,
                10635
            ],
            [
                10635,
                10713
            ],
            [
                10713,
                11171
            ],
            [
                11171,
                11608
            ],
            [
                11608,
                11811
            ],
            [
                11811,
                11954
            ],
            [
                11954,
                12155
            ],
            [
                12155,
                12308
            ],
            [
                12308,
                12430
            ],
            [
                12430,
                12765
            ],
            [
                12765,
                13153
            ]
        ],
        "segment_chars": [
            [
                0,
                50
            ],
            [
                50,
                63
            ],
            [
                63,
                112
            ],
            [
                112,
                125
            ],
            [
                125,
                179
            ],
            [
                179,
                356
            ],
            [
                356,
                721
            ],
            [
                721,
                1031
            ],
            [
                1031,
                1236
            ],
            [
                1236,
                1388
            ],
            [
                1388,
                1460
            ],
            [
                1460,
                1598
            ],
            [
                1598,
                1737
            ],
            [
                1737,
                1852
            ],
            [
                1852,
                1913
            ],
            [
                1913,
                2052
            ],
            [
                2052,
                2128
            ],
            [
                2128,
                2213
            ],
            [
                2213,
                2253
            ],
            [
                2253,
                2318
            ],
            [
                2318,
                2441
            ],
            [
                2441,
                2511
            ],
            [
                2511,
                2649
            ],
            [
                2649,
                2699
            ],
            [
                2699,
                2770
            ],
            [
                2770,
                2933
            ],
            [
                2933,
                3059
            ],
            [
                3059,
                3069
            ],
            [
                3069,
                3160
            ],
            [
                3160,
                3244
            ],
            [
                3244,
                3461
            ],
            [
                3461,
                3604
            ],
            [
                3604,
                3688
            ],
            [
                3688,
                3924
            ],
            [
                3924,
                4131
            ],
            [
                4131,
                4294
            ],
            [
                4294,
                4585
            ],
            [
                4585,
                4599
            ],
            [
                4599,
                4644
            ],
            [
                4644,
                4693
            ],
            [
                4693,
                4758
            ],
            [
                4758,
                4785
            ],
            [
                4785,
                4814
            ],
            [
                4814,
                4931
            ],
            [
                4931,
                4959
            ],
            [
                4959,
                4997
            ],
            [
                4997,
                5012
            ],
            [
                5012,
                5089
            ],
            [
                5089,
                5140
            ],
            [
                5140,
                5261
            ],
            [
                5261,
                5423
            ],
            [
                5423,
                5465
            ],
            [
                5465,
                5520
            ],
            [
                5520,
                5594
            ],
            [
                5594,
                5778
            ],
            [
                5778,
                5835
            ],
            [
                5835,
                5967
            ],
            [
                5967,
                5988
            ],
            [
                5988,
                6037
            ],
            [
                6037,
                6078
            ],
            [
                6078,
                6121
            ],
            [
                6121,
                6132
            ],
            [
                6132,
                6160
            ],
            [
                6160,
                6181
            ],
            [
                6181,
                6506
            ],
            [
                6506,
                6738
            ],
            [
                6738,
                7133
            ],
            [
                7133,
                7218
            ],
            [
                7218,
                7274
            ],
            [
                7274,
                7327
            ],
            [
                7327,
                7354
            ],
            [
                7354,
                7404
            ],
            [
                7404,
                7462
            ],
            [
                7462,
                7573
            ],
            [
                7573,
                7677
            ],
            [
                7677,
                7875
            ],
            [
                7875,
                7974
            ],
            [
                7974,
                8054
            ],
            [
                8054,
                8100
            ],
            [
                8100,
                8153
            ],
            [
                8153,
                8293
            ],
            [
                8293,
                8396
            ],
            [
                8396,
                8529
            ],
            [
                8529,
                8696
            ],
            [
                8696,
                8732
            ],
            [
                8732,
                8866
            ],
            [
                8866,
                8926
            ],
            [
                8926,
                9069
            ],
            [
                9069,
                9246
            ],
            [
                9246,
                9438
            ],
            [
                9438,
                9465
            ],
            [
                9465,
                9487
            ],
            [
                9487,
                9572
            ],
            [
                9572,
                9602
            ],
            [
                9602,
                9635
            ],
            [
                9635,
                9774
            ],
            [
                9774,
                9881
            ],
            [
                9881,
                10162
            ],
            [
                10162,
                10271
            ],
            [
                10271,
                10584
            ],
            [
                10584,
                10635
            ],
            [
                10635,
                10671
            ],
            [
                10671,
                10713
            ],
            [
                10713,
                10737
            ],
            [
                10737,
                10767
            ],
            [
                10767,
                10843
            ],
            [
                10843,
                10888
            ],
            [
                10888,
                11171
            ],
            [
                11171,
                11191
            ],
            [
                11191,
                11547
            ],
            [
                11547,
                11608
            ],
            [
                11608,
                11680
            ],
            [
                11680,
                11718
            ],
            [
                11718,
                11811
            ],
            [
                11811,
                11887
            ],
            [
                11887,
                11905
            ],
            [
                11905,
                11954
            ],
            [
                11954,
                12027
            ],
            [
                12027,
                12133
            ],
            [
                12133,
                12155
            ],
            [
                12155,
                12212
            ],
            [
                12212,
                12264
            ],
            [
                12264,
                12308
            ],
            [
                12308,
                12319
            ],
            [
                12319,
                12408
            ],
            [
                12408,
                12430
            ],
            [
                12430,
                12765
            ],
            [
                12765,
                12888
            ],
            [
                12888,
                13048
            ],
            [
                13048,
                13153
            ]
        ],
        "overlap_chars": [
            [
                125,
                179
            ],
            [
                179,
                182
            ],
            [
                211,
                243
            ],
            [
                253,
                260
            ],
            [
                275,
                287
            ],
            [
                297,
                323
            ],
            [
                338,
                356
            ],
            [
                356,
                417
            ],
            [
                425,
                598
            ],
            [
                613,
                617
            ],
            [
                635,
                720
            ],
            [
                721,
                731
            ],
            [
                830,
                843
            ],
            [
                970,
                973
            ],
            [
                859,
                873
            ],
            [
                902,
                905
            ],
            [
                879,
                891
            ],
            [
                934,
                948
            ],
            [
                1004,
                1031
            ],
            [
                1253,
                1269
            ],
            [
                1278,
                1283
            ],
            [
                1300,
                1314
            ],
            [
                1295,
                1299
            ],
            [
                1386,
                1388
            ],
            [
                1388,
                1459
            ],
            [
                1598,
                1703
            ],
            [
                1721,
                1737
            ],
            [
                1852,
                1913
            ],
            [
                2052,
                2128
            ],
            [
                2128,
                2150
            ],
            [
                2163,
                2166
            ],
            [
                2213,
                2253
            ],
            [
                2268,
                2316
            ],
            [
                2441,
                2451
            ],
            [
                2475,
                2511
            ],
            [
                2511,
                2537
            ],
            [
                2548,
                2585
            ],
            [
                2647,
                2649
            ],
            [
                2649,
                2659
            ],
            [
                2679,
                2697
            ],
            [
                2660,
                2662
            ],
            [
                2697,
                2699
            ],
            [
                2699,
                2743
            ],
            [
                2768,
                2770
            ],
            [
                2770,
                2775
            ],
            [
                2795,
                2810
            ],
            [
                2839,
                2863
            ],
            [
                2872,
                2896
            ],
            [
                2923,
                2933
            ],
            [
                2933,
                2982
            ],
            [
                2996,
                3006
            ],
            [
                3024,
                3059
            ],
            [
                3059,
                3069
            ],
            [
                3069,
                3123
            ],
            [
                3139,
                3160
            ],
            [
                3160,
                3244
            ],
            [
                3244,
                3341
            ],
            [
                3459,
                3461
            ],
            [
                3461,
                3565
            ],
            [
                3602,
                3604
            ],
            [
                3604,
                3666
            ],
            [
                3686,
                3688
            ],
            [
                4369,
                4370
            ],
            [
                4328,
                4329
            ],
            [
                4421,
                4585
            ],
            [
                4585,
                4599
            ],
            [
                4599,
                4600
            ],
            [
                4636,
                4642
            ],
            [
                4634,
                4635
            ],
            [
                4600,
                4601
            ],
            [
                4644,
                4692
            ],
            [
                4758,
                4785
            ],
            [
                4785,
                4789
            ],
            [
                4812,
                4814
            ],
            [
                4814,
                4931
            ],
            [
                4931,
                4959
            ],
            [
                4959,
                4968
            ],
            [
                4995,
                4997
            ],
            [
                4997,
                5012
            ],
            [
                5012,
                5089
            ],
            [
                5140,
                5203
            ],
            [
                5259,
                5261
            ],
            [
                5261,
                5272
            ],
            [
                5294,
                5314
            ],
            [
                5327,
                5423
            ],
            [
                5423,
                5465
            ],
            [
                5465,
                5520
            ],
            [
                5520,
                5539
            ],
            [
                5566,
                5594
            ],
            [
                5620,
                5623
            ],
            [
                5612,
                5616
            ],
            [
                5665,
                5679
            ],
            [
                5697,
                5704
            ],
            [
                5705,
                5777
            ],
            [
                5795,
                5834
            ],
            [
                5967,
                5988
            ],
            [
                5988,
                6037
            ],
            [
                6037,
                6078
            ],
            [
                6078,
                6103
            ],
            [
                6112,
                6121
            ],
            [
                6121,
                6132
            ],
            [
                6132,
                6160
            ],
            [
                6160,
                6181
            ],
            [
                7133,
                7217
            ],
            [
                7218,
                7274
            ],
            [
                7274,
                7327
            ],
            [
                7354,
                7404
            ],
            [
                7404,
                7462
            ],
            [
                7462,
                7499
            ],
            [
                7514,
                7530
            ],
            [
                7571,
                7573
            ],
            [
                7573,
                7574
            ],
            [
                7612,
                7677
            ],
            [
                7677,
                7705
            ],
            [
                7729,
                7743
            ],
            [
                7793,
                7797
            ],
            [
                7815,
                7823
            ],
            [
                7843,
                7875
            ],
            [
                7875,
                7909
            ],
            [
                7972,
                7974
            ],
            [
                7974,
                7989
            ],
            [
                7999,
                8028
            ],
            [
                8039,
                8054
            ],
            [
                8054,
                8100
            ],
            [
                8100,
                8153
            ],
            [
                8153,
                8214
            ],
            [
                8219,
                8293
            ],
            [
                8293,
                8301
            ],
            [
                8363,
                8396
            ],
            [
                8396,
                8417
            ],
            [
                8421,
                8529
            ],
            [
                8529,
                8563
            ],
            [
                8608,
                8696
            ],
            [
                8696,
                8732
            ],
            [
                8732,
                8759
            ],
            [
                8802,
                8866
            ],
            [
                8866,
                8883
            ],
            [
                8915,
                8925
            ],
            [
                9069,
                9106
            ],
            [
                9132,
                9150
            ],
            [
                9244,
                9246
            ],
            [
                9246,
                9303
            ],
            [
                9335,
                9394
            ],
            [
                9400,
                9438
            ],
            [
                9438,
                9465
            ],
            [
                9465,
                9487
            ],
            [
                9487,
                9536
            ],
            [
                9545,
                9572
            ],
            [
                9572,
                9602
            ],
            [
                9602,
                9635
            ],
            [
                9635,
                9638
            ],
            [
                9678,
                9751
            ],
            [
                9757,
                9763
            ],
            [
                9881,
                9925
            ],
            [
                9936,
                9959
            ],
            [
                9969,
                9991
            ],
            [
                10024,
                10073
            ],
            [
                10102,
                10105
            ],
            [
                9960,
                9962
            ],
            [
                10142,
                10151
            ],
            [
                10160,
                10162
            ],
            [
                10162,
                10271
            ],
            [
                10428,
                10471
            ],
            [
                10492,
                10522
            ],
            [
                10527,
                10584
            ],
            [
                10584,
                10635
            ],
            [
                10635,
                10671
            ],
            [
                10671,
                10684
            ],
            [
                10686,
                10713
            ],
            [
                10713,
                10737
            ],
            [
                10737,
                10767
            ],
            [
                10767,
                10799
            ],
            [
                10841,
                10843
            ],
            [
                10843,
                10888
            ],
            [
                10888,
                10921
            ],
            [
                10945,
                10991
            ],
            [
                10997,
                11089
            ],
            [
                11096,
                11171
            ],
            [
                11171,
                11191
            ],
            [
                11191,
                11202
            ],
            [
                11230,
                11281
            ],
            [
                11405,
                11469
            ],
            [
                11522,
                11547
            ],
            [
                11547,
                11607
            ],
            [
                11640,
                11642
            ],
            [
                11612,
                11632
            ],
            [
                11678,
                11679
            ],
            [
                11680,
                11718
            ],
            [
                11718,
                11736
            ],
            [
                11809,
                11811
            ],
            [
                11811,
                11822
            ],
            [
                11830,
                11866
            ],
            [
                11880,
                11887
            ],
            [
                11887,
                11905
            ],
            [
                11905,
                11954
            ],
            [
                11954,
                11964
            ],
            [
                11970,
                11974
            ],
            [
                11992,
                12025
            ],
            [
                12025,
                12027
            ],
            [
                12027,
                12047
            ],
            [
                12081,
                12133
            ],
            [
                12133,
                12155
            ],
            [
                12155,
                12212
            ],
            [
                12212,
                12258
            ],
            [
                12262,
                12264
            ],
            [
                12264,
                12289
            ],
            [
                12305,
                12308
            ],
            [
                12308,
                12317
            ],
            [
                12430,
                12559
            ]
        ],
        "row_chars": [
            [
                0,
                50
            ],
            [
                50,
                63
            ],
            [
                63,
                112
            ],
            [
                112,
                125
            ],
            [
                125,
                179
            ],
            [
                179,
                356
            ],
            [
                356,
                721
            ],
            [
                721,
                1031
            ],
            [
                1031,
                1236
            ],
            [
                1236,
                1388
            ],
            [
                1388,
                1460
            ],
            [
                1460,
                1598
            ],
            [
                1598,
                1737
            ],
            [
                1737,
                1852
            ],
            [
                1852,
                1913
            ],
            [
                1913,
                2052
            ],
            [
                2052,
                2128
            ],
            [
                2128,
                2253
            ],
            [
                2253,
                2318
            ],
            [
                2318,
                2441
            ],
            [
                2441,
                2511
            ],
            [
                2511,
                2649
            ],
            [
                2649,
                2699
            ],
            [
                2699,
                2770
            ],
            [
                2770,
                2933
            ],
            [
                2933,
                3059
            ],
            [
                3059,
                3069
            ],
            [
                3069,
                3160
            ],
            [
                3160,
                3244
            ],
            [
                3244,
                3461
            ],
            [
                3461,
                3604
            ],
            [
                3604,
                3688
            ],
            [
                3688,
                3924
            ],
            [
                3924,
                4131
            ],
            [
                4131,
                4294
            ],
            [
                4294,
                4585
            ],
            [
                4585,
                4599
            ],
            [
                4599,
                4693
            ],
            [
                4693,
                4758
            ],
            [
                4758,
                4785
            ],
            [
                4785,
                4814
            ],
            [
                4814,
                4931
            ],
            [
                4931,
                4959
            ],
            [
                4959,
                4997
            ],
            [
                4997,
                5012
            ],
            [
                5012,
                5089
            ],
            [
                5089,
                5140
            ],
            [
                5140,
                5261
            ],
            [
                5261,
                5423
            ],
            [
                5423,
                5465
            ],
            [
                5465,
                5520
            ],
            [
                5520,
                5594
            ],
            [
                5594,
                5778
            ],
            [
                5778,
                5835
            ],
            [
                5835,
                5967
            ],
            [
                5967,
                5988
            ],
            [
                5988,
                6037
            ],
            [
                6037,
                6078
            ],
            [
                6078,
                6121
            ],
            [
                6121,
                6132
            ],
            [
                6132,
                6160
            ],
            [
                6160,
                6181
            ],
            [
                6181,
                6506
            ],
            [
                6506,
                6738
            ],
            [
                6738,
                7133
            ],
            [
                7133,
                7218
            ],
            [
                7218,
                7274
            ],
            [
                7274,
                7327
            ],
            [
                7327,
                7354
            ],
            [
                7354,
                7404
            ],
            [
                7404,
                7462
            ],
            [
                7462,
                7573
            ],
            [
                7573,
                7677
            ],
            [
                7677,
                7875
            ],
            [
                7875,
                7974
            ],
            [
                7974,
                8054
            ],
            [
                8054,
                8100
            ],
            [
                8100,
                8153
            ],
            [
                8153,
                8293
            ],
            [
                8293,
                8396
            ],
            [
                8396,
                8529
            ],
            [
                8529,
                8696
            ],
            [
                8696,
                8732
            ],
            [
                8732,
                8866
            ],
            [
                8866,
                8926
            ],
            [
                8926,
                9069
            ],
            [
                9069,
                9246
            ],
            [
                9246,
                9438
            ],
            [
                9438,
                9465
            ],
            [
                9465,
                9487
            ],
            [
                9487,
                9572
            ],
            [
                9572,
                9602
            ],
            [
                9602,
                9635
            ],
            [
                9635,
                9774
            ],
            [
                9774,
                9881
            ],
            [
                9881,
                10162
            ],
            [
                10162,
                10271
            ],
            [
                10271,
                10584
            ],
            [
                10584,
                10635
            ],
            [
                10635,
                10671
            ],
            [
                10671,
                10713
            ],
            [
                10713,
                10737
            ],
            [
                10737,
                10767
            ],
            [
                10767,
                10843
            ],
            [
                10843,
                10888
            ],
            [
                10888,
                11171
            ],
            [
                11171,
                11191
            ],
            [
                11191,
                11547
            ],
            [
                11547,
                11608
            ],
            [
                11608,
                11680
            ],
            [
                11680,
                11718
            ],
            [
                11718,
                11811
            ],
            [
                11811,
                11887
            ],
            [
                11887,
                11905
            ],
            [
                11905,
                11954
            ],
            [
                11954,
                12027
            ],
            [
                12027,
                12133
            ],
            [
                12133,
                12155
            ],
            [
                12155,
                12212
            ],
            [
                12212,
                12264
            ],
            [
                12264,
                12308
            ],
            [
                12308,
                12319
            ],
            [
                12319,
                12408
            ],
            [
                12408,
                12430
            ],
            [
                12430,
                12765
            ],
            [
                12765,
                12888
            ],
            [
                12888,
                13048
            ],
            [
                13048,
                13153
            ]
        ]
    },
    "abridged": {
        "text": "There was a much more lasting trouble at the rectory. Rex threw himself on his bed in a state of apathy, which the next day began to be interrupted by signs of illness. Nothing could be said about his going to Southampton: instead, the chief thought of his mother and Anna was how to tend this patient who did not want to be well, and from being the brightest, most grateful spirit in the household, was changed into a dull-eyed creature who met all affectionate attempts with a murmur of \"Let me alone.\"\nHis father was sorry for his suffering, and sat with him now and then, parting with a \"God bless you, my boy.\" Anna was always there, and was allowed to hold his unresponding hand. Her soul was divided between anguish for Rex and reproach of Gwendolen. And even Mrs. Gascoigne had an angry feeling toward her niece which she could not refrain from expressing to her husband.\n\"Really, Henry, I think she is hard; she has the heart of a coquette. And some blame attaches to poor Fanny; she is quite blind about that girl.\"\nMr. Gascoigne answered: \"I ought to have been more awake myself. Rex may be thankful if nothing worse ever happens to him.\"\nThe rector felt that there had been a great escape. Gwendolen in love with Rex would have made a much harder problem to solve. But he had further difficulty to come.\nOne fine morning Rex asked for his bath, and dressed himself. Anna, excited at this change, listened for his coming down, and on hearing his step, ran to meet him. For the first time he gave her a faint smile, but such a melancholy one that she could hardly help crying.\n\"Nannie!\" he said gently, taking her hand and leading her slowly to the drawing-room. His mother was there, and when she came to kiss him, he said: \"What a plague I am!\"\nThen he sat still and looked out of the bow-window on the lawn and shrubs covered with hoar-frost. He felt as if he had had a resurrection into a new world, and did not know what to do with himself there. Anna sat near him, pretending to work, but really watching him. After a while, she could not resist the impulse to bring a little stool and seat herself against his knee, looking up at him with an expression which seemed to say, \"Do speak to me.\" And he spoke.\n\"Nannie, I think I will go to Canada, or somewhere of that sort.\"\n\"Oh, Rex, not for always!\"\n\"Yes. I should like to build a hut, and work hard at clearing, and have everything wild about me, and a great wide quiet.\"\n\"And not take me with you?\" said Anna tearfully.\n\"How could I?\"\n\"I should like it better than anything; and settlers go with their families. I could make the fires, and mend the clothes, and cook the food. It would be like playing at life as we used to do when we made our tent with the drugget, and had our little plates and dishes.\"\n\"Father and mother would not let you go.\"\n\"Yes, I think they would, when I explained everything. It would save money to bring up the boys with.\"\nThe talk ended in Rex's consenting that Anna should go with him when he spoke to his father on the subject. They chose a time when the rector was alone in his study.\n\"Well, my children!\" said Mr. Gascoigne, cheerfully, as they entered. It was a comfort to see Rex about again.\n\"May we sit down with you, papa?\" said Anna. \"Rex has something to say.\"\n\"With all my heart.\"\n\"You know all about what has upset me, father,\" Rex began, and Mr. Gascoigne nodded. \"I am quite done up for life in this part of the world. I am sure it will be no use my going back to Oxford. I should fail, and cause you expense for nothing. I want to have your consent to take another course, sir.\"\nMr. Gascoigne nodded more slowly, the line on his brow deepening.\n\"I should like to go to the colonies and work on the land there.\" Rex thought the vagueness of \"the colonies\" less likely to be rebutted than any particular settlement.\n\"Oh, and with me, papa,\" said Anna. \"Rex would want someone to take care of him, you know, to keep house. And we shall never, either of us, be married. And I should cost nothing, and I should be so happy. I know it would be hard to leave you and mamma; but there are the others to bring up, and we two should be no trouble to you any more.\"\nAnna had gone closer to her papa as she spoke. He did not smile, but drew her on his knee and held her there, as if to put her gently out of the question while he spoke to Rex.\n\"You will admit that my experience means that I can probably guide you in practical matters better than you can guide yourself?\"\nRex was obliged to say, \"Yes, sir.\"\n\"And perhaps you will admit that you are bound in duty to consider my judgment and wishes?\"\n\"I have never yet opposed you, sir.\"\n\"But you will do so if you persist in following a rash and foolish course. You think, I suppose, that you have had a shock which has stupefied your brains, unfitted you for anything but manual labour, and given you a dislike to society? Is that what you believe?\"\n\"Something like that. I shall never be up to the sort of work I must do in this part of the world. I have not the spirit for it. I shall never be the same again. And I think a young fellow should be allowed to choose his way of life, if he harms nobody.\"\n\"But suppose I am convinced on good evidence that this state of mind is transient, and that you would by-and-by repent, and feel that you had lost the chance of education? Have you not strength of mind enough to see that you had better act on my assurance for a time, and test it? In my opinion you have no right whatever to go abroad until you have honestly endeavoured to turn to account the education you have received here. I say nothing of the grief to your mother and me.\"\n\"I'm very sorry; but what can I do? I can't study, that's certain,\" said Rex.\n\"Not just now, perhaps. You will have to miss a term. I have made arrangements for you. But I confess I am disappointed in you, Rex. I thought you had more sense than to suppose that because you have fallen into a common trouble, such as most men have to go through, you are loosened from all bonds of duty - as if your brain had softened and you were no longer a responsible being.\"\nWhat could Rex say? Inwardly he rebelled, but he had no arguments to meet his father's; and it lay in a deep fold of his consciousness that he ought to feel more about his old ties. This is the sort of faith we live by in our soul sicknesses. He got up from his seat.\n\"You assent to my arrangement, then?\" said Mr. Gascoigne.\nThere was a pause before Rex answered, \"I'll try, sir. I can't promise.\" His thought was, that trying would be of no use.\nHer father held Anna, though she wanted to follow Rex out of the room. \"Oh, papa,\" she said when the door had closed; \"it is very hard for him. Doesn't he look ill?\"\n\"Yes, but he will soon be better; it will all blow over. And now, Anna, be as quiet as a mouse about it. Never let it be mentioned.\"\n\"No, papa.\" Anna dared not say that she was disappointed at not being allowed to go to the colonies with Rex; but that was her secret feeling.",
        "paragraph_chars": [
            [
                0,
                505
            ],
            [
                505,
                880
            ],
            [
                880,
                1026
            ],
            [
                1026,
                1150
            ],
            [
                1150,
                1316
            ],
            [
                1316,
                1587
            ],
            [
                1587,
                1757
            ],
            [
                1757,
                2223
            ],
            [
                2223,
                2289
            ],
            [
                2289,
                2316
            ],
            [
                2316,
                2439
            ],
            [
                2439,
                2488
            ],
            [
                2488,
                2503
            ],
            [
                2503,
                2774
            ],
            [
                2774,
                2816
            ],
            [
                2816,
                2919
            ],
            [
                2919,
                3085
            ],
            [
                3085,
                3196
            ],
            [
                3196,
                3269
            ],
            [
                3269,
                3290
            ],
            [
                3290,
                3592
            ],
            [
                3592,
                3658
            ],
            [
                3658,
                3827
            ],
            [
                3827,
                4168
            ],
            [
                4168,
                4345
            ],
            [
                4345,
                4474
            ],
            [
                4474,
                4510
            ],
            [
                4510,
                4602
            ],
            [
                4602,
                4639
            ],
            [
                4639,
                4903
            ],
            [
                4903,
                5158
            ],
            [
                5158,
                5637
            ],
            [
                5637,
                5715
            ],
            [
                5715,
                6099
            ],
            [
                6099,
                6367
            ],
            [
                6367,
                6425
            ],
            [
                6425,
                6547
            ],
            [
                6547,
                6713
            ],
            [
                6713,
                6846
            ],
            [
                6846,
                6988
            ]
        ],
        "segment_chars": [
            [
                0,
                54
            ],
            [
                54,
                169
            ],
            [
                169,
                505
            ],
            [
                505,
                616
            ],
            [
                616,
                686
            ],
            [
                686,
                758
            ],
            [
                758,
                880
            ],
            [
                880,
                950
            ],
            [
                950,
                1026
            ],
            [
                1026,
                1091
            ],
            [
                1091,
                1150
            ],
            [
                1150,
                1202
            ],
            [
                1202,
                1277
            ],
            [
                1277,
                1316
            ],
            [
                1316,
                1378
            ],
            [
                1378,
                1480
            ],
            [
                1480,
                1587
            ],
            [
                1587,
                1597
            ],
            [
                1597,
                1673
            ],
            [
                1673,
                1757
            ],
            [
                1757,
                1856
            ],
            [
                1856,
                1962
            ],
            [
                1962,
                2026
            ],
            [
                2026,
                2209
            ],
            [
                2209,
                2223
            ],
            [
                2223,
                2289
            ],
            [
                2289,
                2316
            ],
            [
                2316,
                2322
            ],
            [
                2322,
                2439
            ],
            [
                2439,
                2467
            ],
            [
                2467,
                2488
            ],
            [
                2488,
                2503
            ],
            [
                2503,
                2580
            ],
            [
                2580,
                2645
            ],
            [
                2645,
                2774
            ],
            [
                2774,
                2816
            ],
            [
                2816,
                2871
            ],
            [
                2871,
                2919
            ],
            [
                2919,
                3027
            ],
            [
                3027,
                3085
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3155
            ],
            [
                3155,
                3196
            ],
            [
                3196,
                3230
            ],
            [
                3230,
                3241
            ],
            [
                3241,
                3269
            ],
            [
                3269,
                3290
            ],
            [
                3290,
                3375
            ],
            [
                3375,
                3431
            ],
            [
                3431,
                3484
            ],
            [
                3484,
                3534
            ],
            [
                3534,
                3592
            ],
            [
                3592,
                3658
            ],
            [
                3658,
                3724
            ],
            [
                3724,
                3827
            ],
            [
                3827,
                3863
            ],
            [
                3863,
                3933
            ],
            [
                3933,
                3979
            ],
            [
                3979,
                4032
            ],
            [
                4032,
                4168
            ],
            [
                4168,
                4215
            ],
            [
                4215,
                4345
            ],
            [
                4345,
                4474
            ],
            [
                4474,
                4510
            ],
            [
                4510,
                4602
            ],
            [
                4602,
                4639
            ],
            [
                4639,
                4714
            ],
            [
                4714,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4925
            ],
            [
                4925,
                5002
            ],
            [
                5002,
                5032
            ],
            [
                5032,
                5065
            ],
            [
                5065,
                5158
            ],
            [
                5158,
                5330
            ],
            [
                5330,
                5439
            ],
            [
                5439,
                5586
            ],
            [
                5586,
                5637
            ],
            [
                5637,
                5673
            ],
            [
                5673,
                5715
            ],
            [
                5715,
                5739
            ],
            [
                5739,
                5769
            ],
            [
                5769,
                5803
            ],
            [
                5803,
                5848
            ],
            [
                5848,
                6099
            ],
            [
                6099,
                6119
            ],
            [
                6119,
                6281
            ],
            [
                6281,
                6342
            ],
            [
                6342,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6425
            ],
            [
                6425,
                6480
            ],
            [
                6480,
                6498
            ],
            [
                6498,
                6547
            ],
            [
                6547,
                6618
            ],
            [
                6618,
                6691
            ],
            [
                6691,
                6713
            ],
            [
                6713,
                6770
            ],
            [
                6770,
                6818
            ],
            [
                6818,
                6846
            ],
            [
                6846,
                6858
            ],
            [
                6858,
                6988
            ]
        ],
        "overlap_chars": [
            [
                0,
                54
            ],
            [
                54,
                57
            ],
            [
                64,
                96
            ],
            [
                97,
                104
            ],
            [
                111,
                123
            ],
            [
                124,
                150
            ],
            [
                151,
                169
            ],
            [
                169,
                230
            ],
            [
                230,
                403
            ],
            [
                412,
                416
            ],
            [
                419,
                504
            ],
            [
                505,
                515
            ],
            [
                516,
                529
            ],
            [
                530,
                533
            ],
            [
                534,
                548
            ],
            [
                558,
                561
            ],
            [
                562,
                574
            ],
            [
                574,
                588
            ],
            [
                589,
                616
            ],
            [
                621,
                637
            ],
            [
                637,
                642
            ],
            [
                643,
                657
            ],
            [
                680,
                684
            ],
            [
                684,
                686
            ],
            [
                686,
                757
            ],
            [
                758,
                863
            ],
            [
                864,
                880
            ],
            [
                889,
                950
            ],
            [
                950,
                1026
            ],
            [
                1026,
                1048
            ],
            [
                1048,
                1051
            ],
            [
                1051,
                1091
            ],
            [
                1099,
                1147
            ],
            [
                1150,
                1160
            ],
            [
                1166,
                1202
            ],
            [
                1202,
                1228
            ],
            [
                1229,
                1266
            ],
            [
                1275,
                1277
            ],
            [
                1277,
                1287
            ],
            [
                1288,
                1306
            ],
            [
                1307,
                1309
            ],
            [
                1314,
                1316
            ],
            [
                1316,
                1360
            ],
            [
                1376,
                1378
            ],
            [
                1378,
                1383
            ],
            [
                1392,
                1407
            ],
            [
                1417,
                1441
            ],
            [
                1445,
                1469
            ],
            [
                1470,
                1480
            ],
            [
                1480,
                1529
            ],
            [
                1537,
                1547
            ],
            [
                1552,
                1587
            ],
            [
                1587,
                1597
            ],
            [
                1597,
                1651
            ],
            [
                1652,
                1673
            ],
            [
                1673,
                1757
            ],
            [
                1757,
                1854
            ],
            [
                1854,
                1856
            ],
            [
                1856,
                1960
            ],
            [
                1960,
                1962
            ],
            [
                1962,
                2024
            ],
            [
                2024,
                2026
            ],
            [
                2032,
                2033
            ],
            [
                2039,
                2040
            ],
            [
                2045,
                2209
            ],
            [
                2209,
                2223
            ],
            [
                2223,
                2224
            ],
            [
                2224,
                2230
            ],
            [
                2230,
                2231
            ],
            [
                2232,
                2233
            ],
            [
                2240,
                2288
            ],
            [
                2289,
                2316
            ],
            [
                2316,
                2320
            ],
            [
                2320,
                2322
            ],
            [
                2322,
                2439
            ],
            [
                2439,
                2467
            ],
            [
                2467,
                2476
            ],
            [
                2486,
                2488
            ],
            [
                2488,
                2503
            ],
            [
                2503,
                2580
            ],
            [
                2580,
                2643
            ],
            [
                2643,
                2645
            ],
            [
                2645,
                2656
            ],
            [
                2657,
                2677
            ],
            [
                2678,
                2774
            ],
            [
                2774,
                2816
            ],
            [
                2816,
                2871
            ],
            [
                2871,
                2890
            ],
            [
                2891,
                2919
            ],
            [
                2919,
                2922
            ],
            [
                2923,
                2927
            ],
            [
                2928,
                2942
            ],
            [
                2943,
                2950
            ],
            [
                2954,
                3026
            ],
            [
                3045,
                3084
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3155
            ],
            [
                3155,
                3196
            ],
            [
                3196,
                3221
            ],
            [
                3221,
                3230
            ],
            [
                3230,
                3241
            ],
            [
                3241,
                3269
            ],
            [
                3269,
                3290
            ],
            [
                3290,
                3374
            ],
            [
                3375,
                3431
            ],
            [
                3431,
                3484
            ],
            [
                3484,
                3534
            ],
            [
                3534,
                3592
            ],
            [
                3592,
                3629
            ],
            [
                3630,
                3646
            ],
            [
                3656,
                3658
            ],
            [
                3658,
                3659
            ],
            [
                3659,
                3724
            ],
            [
                3724,
                3752
            ],
            [
                3753,
                3767
            ],
            [
                3768,
                3772
            ],
            [
                3786,
                3794
            ],
            [
                3795,
                3827
            ],
            [
                3827,
                3861
            ],
            [
                3861,
                3863
            ],
            [
                3863,
                3878
            ],
            [
                3887,
                3916
            ],
            [
                3918,
                3933
            ],
            [
                3933,
                3979
            ],
            [
                3979,
                4032
            ],
            [
                4032,
                4093
            ],
            [
                4094,
                4168
            ],
            [
                4168,
                4176
            ],
            [
                4182,
                4215
            ],
            [
                4215,
                4236
            ],
            [
                4237,
                4345
            ],
            [
                4345,
                4379
            ],
            [
                4386,
                4474
            ],
            [
                4474,
                4510
            ],
            [
                4510,
                4537
            ],
            [
                4538,
                4602
            ],
            [
                4602,
                4619
            ],
            [
                4628,
                4638
            ],
            [
                4639,
                4676
            ],
            [
                4687,
                4705
            ],
            [
                4712,
                4714
            ],
            [
                4714,
                4771
            ],
            [
                4772,
                4831
            ],
            [
                4838,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4925
            ],
            [
                4925,
                4974
            ],
            [
                4975,
                5002
            ],
            [
                5002,
                5032
            ],
            [
                5032,
                5065
            ],
            [
                5065,
                5068
            ],
            [
                5069,
                5142
            ],
            [
                5149,
                5155
            ],
            [
                5158,
                5202
            ],
            [
                5203,
                5226
            ],
            [
                5227,
                5249
            ],
            [
                5250,
                5299
            ],
            [
                5305,
                5308
            ],
            [
                5316,
                5318
            ],
            [
                5319,
                5328
            ],
            [
                5328,
                5330
            ],
            [
                5330,
                5439
            ],
            [
                5439,
                5482
            ],
            [
                5493,
                5523
            ],
            [
                5529,
                5586
            ],
            [
                5586,
                5637
            ],
            [
                5637,
                5673
            ],
            [
                5673,
                5686
            ],
            [
                5688,
                5715
            ],
            [
                5715,
                5739
            ],
            [
                5739,
                5769
            ],
            [
                5769,
                5801
            ],
            [
                5801,
                5803
            ],
            [
                5803,
                5848
            ],
            [
                5848,
                5881
            ],
            [
                5882,
                5928
            ],
            [
                5929,
                6021
            ],
            [
                6024,
                6099
            ],
            [
                6099,
                6119
            ],
            [
                6119,
                6130
            ],
            [
                6139,
                6190
            ],
            [
                6191,
                6255
            ],
            [
                6256,
                6281
            ],
            [
                6281,
                6341
            ],
            [
                6342,
                6344
            ],
            [
                6345,
                6365
            ],
            [
                6365,
                6366
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6423
            ],
            [
                6423,
                6425
            ],
            [
                6425,
                6436
            ],
            [
                6437,
                6473
            ],
            [
                6473,
                6480
            ],
            [
                6480,
                6498
            ],
            [
                6498,
                6547
            ],
            [
                6547,
                6557
            ],
            [
                6563,
                6567
            ],
            [
                6567,
                6600
            ],
            [
                6616,
                6618
            ],
            [
                6618,
                6638
            ],
            [
                6639,
                6691
            ],
            [
                6691,
                6713
            ],
            [
                6713,
                6770
            ],
            [
                6770,
                6816
            ],
            [
                6816,
                6818
            ],
            [
                6818,
                6843
            ],
            [
                6843,
                6846
            ],
            [
                6846,
                6855
            ],
            [
                6858,
                6987
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                54
            ],
            [
                54,
                169
            ],
            [
                169,
                505
            ],
            [
                505,
                616
            ],
            [
                616,
                616
            ],
            [
                616,
                686
            ],
            [
                686,
                758
            ],
            [
                758,
                758
            ],
            [
                758,
                880
            ],
            [
                880,
                880
            ],
            [
                880,
                950
            ],
            [
                950,
                950
            ],
            [
                950,
                1026
            ],
            [
                1026,
                1091
            ],
            [
                1091,
                1150
            ],
            [
                1150,
                1150
            ],
            [
                1150,
                1202
            ],
            [
                1202,
                1277
            ],
            [
                1277,
                1316
            ],
            [
                1316,
                1378
            ],
            [
                1378,
                1480
            ],
            [
                1480,
                1587
            ],
            [
                1587,
                1597
            ],
            [
                1597,
                1673
            ],
            [
                1673,
                1757
            ],
            [
                1757,
                1856
            ],
            [
                1856,
                1962
            ],
            [
                1962,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2209
            ],
            [
                2209,
                2223
            ],
            [
                2223,
                2289
            ],
            [
                2289,
                2289
            ],
            [
                2289,
                2316
            ],
            [
                2316,
                2322
            ],
            [
                2322,
                2439
            ],
            [
                2439,
                2467
            ],
            [
                2467,
                2488
            ],
            [
                2488,
                2503
            ],
            [
                2503,
                2580
            ],
            [
                2580,
                2580
            ],
            [
                2580,
                2645
            ],
            [
                2645,
                2774
            ],
            [
                2774,
                2816
            ],
            [
                2816,
                2871
            ],
            [
                2871,
                2919
            ],
            [
                2919,
                3027
            ],
            [
                3027,
                3085
            ],
            [
                3085,
                3085
            ],
            [
                3085,
                3106
            ],
            [
                3106,
                3155
            ],
            [
                3155,
                3196
            ],
            [
                3196,
                3230
            ],
            [
                3230,
                3241
            ],
            [
                3241,
                3269
            ],
            [
                3269,
                3290
            ],
            [
                3290,
                3290
            ],
            [
                3290,
                3290
            ],
            [
                3290,
                3290
            ],
            [
                3290,
                3375
            ],
            [
                3375,
                3431
            ],
            [
                3431,
                3484
            ],
            [
                3484,
                3484
            ],
            [
                3484,
                3534
            ],
            [
                3534,
                3592
            ],
            [
                3592,
                3658
            ],
            [
                3658,
                3724
            ],
            [
                3724,
                3827
            ],
            [
                3827,
                3863
            ],
            [
                3863,
                3933
            ],
            [
                3933,
                3979
            ],
            [
                3979,
                4032
            ],
            [
                4032,
                4168
            ],
            [
                4168,
                4215
            ],
            [
                4215,
                4345
            ],
            [
                4345,
                4474
            ],
            [
                4474,
                4510
            ],
            [
                4510,
                4602
            ],
            [
                4602,
                4639
            ],
            [
                4639,
                4639
            ],
            [
                4639,
                4714
            ],
            [
                4714,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4925
            ],
            [
                4925,
                5002
            ],
            [
                5002,
                5032
            ],
            [
                5032,
                5065
            ],
            [
                5065,
                5158
            ],
            [
                5158,
                5158
            ],
            [
                5158,
                5330
            ],
            [
                5330,
                5439
            ],
            [
                5439,
                5586
            ],
            [
                5586,
                5637
            ],
            [
                5637,
                5673
            ],
            [
                5673,
                5715
            ],
            [
                5715,
                5739
            ],
            [
                5739,
                5769
            ],
            [
                5769,
                5803
            ],
            [
                5803,
                5848
            ],
            [
                5848,
                6099
            ],
            [
                6099,
                6119
            ],
            [
                6119,
                6281
            ],
            [
                6281,
                6342
            ],
            [
                6342,
                6367
            ],
            [
                6367,
                6405
            ],
            [
                6405,
                6425
            ],
            [
                6425,
                6480
            ],
            [
                6480,
                6498
            ],
            [
                6498,
                6547
            ],
            [
                6547,
                6618
            ],
            [
                6618,
                6691
            ],
            [
                6691,
                6713
            ],
            [
                6713,
                6770
            ],
            [
                6770,
                6818
            ],
            [
                6818,
                6846
            ],
            [
                6846,
                6858
            ],
            [
                6858,
                6858
            ],
            [
                6858,
                6858
            ],
            [
                6858,
                6988
            ],
            [
                6988,
                6988
            ],
            [
                6988,
                6988
            ],
            [
                6988,
                6988
            ]
        ]
    }
}