{
    "original": {
        "text": "_1st Gent._ What woman should be? Sir, consult the taste Of marriageable men. This planet's store In iron, cotton, wool, or chemicals-- All matter rendered to our plastic skill, Is wrought in shapes responsive to demand; The market's pulse makes index high or low, By rule sublime. Our daughters must be wives, And to the wives must be what men will choose; Men's taste is woman's test. You mark the phrase? 'Tis good, I think?--the sense well-winged and poised With t's and s's. _2nd Gent._ Nay, but turn it round; Give us the test of taste. A fine _menu_-- Is it to-day what Roman epicures Insisted that a gentleman must eat To earn the dignity of dining well?\nBrackenshaw Park, where the archery meeting was held, looked out from its gentle heights far over the neighboring valley to the outlying eastern downs and the broad, slow rise of cultivated country, hanging like a vast curtain toward the west. The castle which stood on the highest platform of the clustered hills, was built of rough-hewn limestone, full of lights and shadows made by the dark dust of lichens and the washings of the rain. Masses of beech and fir sheltered it on the north, and spread down here and there along the green slopes like flocks seeking the water which gleamed below. The archery-ground was a carefully-kept enclosure on a bit of table-land at the farthest end of the park, protected toward the southwest by tall elms and a thick screen of hollies, which kept the gravel walk and the bit of newly-mown turf where the targets were placed in agreeable afternoon shade. The Archery Hall with an arcade in front showed like a white temple against the greenery on the north side.\nWhat could make a better background for the flower-groups of ladies, moving and bowing and turning their necks as it would become the leisurely lilies to do if they took to locomotion. The sounds too were very pleasant to hear, even when the military band from Wanchester ceased to play: musical laughs in all the registers and a harmony of happy, friendly speeches, now rising toward mild excitement, now sinking to an agreeable murmur.\nNo open-air amusement could be much freer from those noisy, crowding conditions which spoil most modern pleasures; no Archery Meeting could be more select, the number of friends accompanying the members being restricted by an award of tickets, so as to keep the maximum within the limits of convenience for the dinner and ball to be held in the castle. Within the enclosure no plebeian spectators were admitted except Lord Brackenshaw's tenants and their families, and of these it was chiefly the feminine members who used the privilege, bringing their little boys and girls or younger brothers and sisters. The males among them relieved the insipidity of the entertainment by imaginative betting, in which the stake was \"anything you like,\" on their favorite archers; but the young maidens, having a different principle of discrimination, were considering which of those sweetly-dressed ladies they would choose to be, if the choice were allowed them. Probably the form these rural souls would most have striven for as a tabernacle, was some other than Gwendolen's--one with more pink in her cheeks and hair of the most fashionable yellow; but among the male judges in the ranks immediately surrounding her there was unusual unanimity in pronouncing her the finest girl present.\nNo wonder she enjoyed her existence on that July day. Pre-eminence is sweet to those who love it, even under mediocre circumstances. Perhaps it was not quite mythical that a slave has been proud to be bought first; and probably a barn-door fowl on sale, though he may not have understood himself to be called the best of a bad lot, may have a self-informed consciousness of his relative importance, and strut consoled. But for complete enjoyment the outward and the inward must concur. And that concurrence was happening to Gwendolen.\nWho can deny that bows and arrows are among the prettiest weapons in the world for feminine forms to play with? They prompt attitudes full of grace and power, where that fine concentration of energy seen in all markmanship, is freed from associations of bloodshed. The time-honored British resource of \"killing something\" is no longer carried on with bow and quiver; bands defending their passes against an invading nation fight under another sort of shade than a cloud of arrows; and poisoned darts are harmless survivals either in rhetoric or in regions comfortably remote. Archery has no ugly smell of brimstone; breaks nobody's shins, breeds no athletic monsters; its only danger is that of failing, which for generous blood is enough to mould skilful action. And among the Brackenshaw archers the prizes were all of the nobler symbolic kind; not properly to be carried off in a parcel, degrading honor into gain; but the gold arrow and the silver, the gold star and the silver, to be worn for a long time in sign of achievement and then transferred to the next who did excellently. These signs of pre-eminence had the virtue of wreaths without their inconveniences, which might have produced a melancholy effect in the heat of the ball-room. Altogether the Brackenshaw Archery Club was an institution framed with good taste, so as not to have by necessity any ridiculous incidents.\nAnd to-day all incalculable elements were in its favor. There was mild warmth, and no wind to disturb either hair or drapery or the course of the arrow; all skillful preparation had fair play, and when there was a general march to extract the arrows, the promenade of joyous young creatures in light speech and laughter, the graceful movement in common toward a common object, was a show worth looking at. Here Gwendolen seemed a Calypso among her nymphs. It was in her attitudes and movements that every one was obliged to admit her surpassing charm.\n\"That girl is like a high-mettled racer,\" said Lord Brackenshaw to young Clintock, one of the invited spectators.\n\"First chop! tremendously pretty too,\" said the elegant Grecian, who had been paying her assiduous attention; \"I never saw her look better.\"\nPerhaps she had never looked so well. Her face was beaming with young pleasure in which there was no malign rays of discontent; for being satisfied with her own chances, she felt kindly toward everybody and was satisfied with the universe. Not to have the highest distinction in rank, not to be marked out as an heiress, like Miss Arrowpoint, gave an added triumph in eclipsing those advantages. For personal recommendation she would not have cared to change the family group accompanying her for any other: her mamma's appearance would have suited an amiable duchess; her uncle and aunt Gascoigne with Anna made equally gratifying figures in their way; and Gwendolen was too full of joyous belief in herself to feel in the least jealous though Miss Arrowpoint was one of the best archeresses.\nEven the reappearance of the formidable Herr Klesmer, which caused some surprise in the rest of the company, seemed only to fall in with Gwendolen's inclination to be amused. Short of Apollo himself, what great musical _maestro_ could make a good figure at an archery meeting? There was a very satirical light in Gwendolen's eyes as she looked toward the Arrowpoint party on their first entrance, when the contrast between Klesmer and the average group of English country people seemed at its utmost intensity in the close neighborhood of his hosts--or patrons, as Mrs. Arrowpoint would have liked to hear them called, that she might deny the possibility of any longer patronizing genius, its royalty being universally acknowledged. The contrast might have amused a graver personage than Gwendolen. We English are a miscellaneous people, and any chance fifty of us will present many varieties of animal architecture or facial ornament; but it must be admitted that our prevailing expression is not that of a lively, impassioned race, preoccupied with the ideal and carrying the real as a mere make-weight. The strong point of the English gentleman pure is the easy style of his figure and clothing; he objects to marked ins and outs in his costume, and he also objects to looking inspired.\nFancy an assemblage where the men had all that ordinary stamp of the well-bred Englishman, watching the entrance of Herr Klesmer--his mane of hair floating backward in massive inconsistency with the chimney-pot hat, which had the look of having been put on for a joke above his pronounced but well-modeled features and powerful clear-shaven mouth and chin; his tall, thin figure clad in a way which, not being strictly English, was all the worse for its apparent emphasis of intention. Draped in a loose garment with a Florentine _berretta_ on his head, he would have been fit to stand by the side of Leonardo de Vinci; but how when he presented himself in trousers which were not what English feeling demanded about the knees?--and when the fire that showed itself in his glances and the movements of his head, as he looked round him with curiosity, was turned into comedy by a hat which ruled that mankind should have well-cropped hair and a staid demeanor, such, for example, as Mr. Arrowsmith's, whose nullity of face and perfect tailoring might pass everywhere without ridicule? One feels why it is often better for greatness to be dead, and to have got rid of the outward man.\nMany present knew Klesmer, or knew of him; but they had only seen him on candle-light occasions when he appeared simply as a musician, and he had not yet that supreme, world-wide celebrity which makes an artist great to the most ordinary people by their knowledge of his great expensiveness. It was literally a new light for them to see him in--presented unexpectedly on this July afternoon in an exclusive society: some were inclined to laugh, others felt a little disgust at the want of judgment shown by the Arrowpoints in this use of an introductory card.\n\"What extreme guys those artistic fellows usually are!\" said young Clintock to Gwendolen. \"Do look at the figure he cuts, bowing with his hand on his heart to Lady Brackenshaw--and Mrs. Arrowpoint's feather just reaching his shoulder.\"\n\"You are one of the profane,\" said Gwendolen. \"You are blind to the majesty of genius. Herr Klesmer smites me with awe; I feel crushed in his presence; my courage all oozes from me.\"\n\"Ah, you understand all about his music.\"\n\"No, indeed,\" said Gwendolen, with a light laugh; \"it is he who understands all about mine and thinks it pitiable.\" Klesmer's verdict on her singing had been an easier joke to her since he had been struck by her _plastik_.\n\"It is not addressed to the ears of the future, I suppose. I'm glad of that: it suits mine.\"\n\"Oh, you are very kind. But how remarkably well Miss Arrowpoint looks to-day! She would make quite a fine picture in that gold-colored dress.\"\n\"Too splendid, don't you think?\"\n\"Well, perhaps a little too symbolical--too much like the figure of Wealth in an allegory.\"\nThis speech of Gwendolen's had rather a malicious sound, but it was not really more than a bubble of fun. She did not wish Miss Arrowpoint or any one else to be out of the way, believing in her own good fortune even more than in her skill. The belief in both naturally grew stronger as the shooting went on, for she promised to achieve one of the best scores--a success which astonished every one in a new member; and to Gwendolen's temperament one success determined another. She trod on air, and all things pleasant seemed possible. The hour was enough for her, and she was not obliged to think what she should do next to keep her life at the due pitch.\n\"How does the scoring stand, I wonder?\" said Lady Brackenshaw, a gracious personage who, adorned with two little girls and a boy of stout make, sat as lady paramount. Her lord had come up to her in one of the intervals of shooting. \"It seems to me that Miss Harleth is likely to win the gold arrow.\"\n\"Gad, I think she will, if she carries it on! she is running Juliet Fenn hard. It is wonderful for one in her first year. Catherine is not up to her usual mark,\" continued his lordship, turning to the heiress's mother who sat near. \"But she got the gold arrow last time. And there's a luck even in these games of skill. That's better. It gives the hinder ones a chance.\"\n\"Catherine will be very glad for others to win,\" said Mrs. Arrowpoint, \"she is so magnanimous. It was entirely her considerateness that made us bring Herr Klesmer instead of Canon Stopley, who had expressed a wish to come. For her own pleasure, I am sure she would rather have brought the Canon; but she is always thinking of others. I told her it was not quite _en rgle_ to bring one so far out of our own set; but she said, 'Genius itself is not _en rgle_; it comes into the world to make new rules.' And one must admit that.\"\n\"Ay, to be sure,\" said Lord Brackenshaw, in a tone of careless dismissal, adding quickly, \"For my part, I am not magnanimous; I should like to win. But, confound it! I never have the chance now. I'm getting old and idle. The young ones beat me. As old Nestor says--the gods don't give us everything at one time: I was a young fellow once, and now I am getting an old and wise one. Old, at any rate; which is a gift that comes to everybody if they live long enough, so it raises no jealousy.\" The Earl smiled comfortably at his wife.\n\"Oh, my lord, people who have been neighbors twenty years must not talk to each other about age,\" said Mrs. Arrowpoint. \"Years, as the Tuscans say, are made for the letting of houses. But where is our new neighbor? I thought Mr. Grandcourt was to be here to-day.\"\n\"Ah, by the way, so he was. The time's getting on too,\" said his lordship, looking at his watch. \"But he only got to Diplow the other day. He came to us on Tuesday and said he had been a little bothered. He may have been pulled in another direction. Why, Gascoigne!\"--the rector was just then crossing at a little distance with Gwendolen on his arm, and turned in compliance with the call--\"this is a little too bad; you not only beat us yourself, but you bring up your niece to beat all the archeresses.\"\n\"It _is_ rather scandalous in her to get the better of elder members,\" said Mr. Gascoigne, with much inward satisfaction curling his short upper lip. \"But it is not my doing, my lord. I only meant her to make a tolerable figure, without surpassing any one.\"\n\"It is not my fault, either,\" said Gwendolen, with pretty archness. \"If I am to aim, I can't help hitting.\"\n\"Ay, ay, that may be a fatal business for some people,\" said Lord Brackenshaw, good-humoredly; then taking out his watch and looking at Mrs. Arrowpoint again--\"The time's getting on, as you say. But Grandcourt is always late. I notice in town he's always late, and he's no bowman--understands nothing about it. But I told him he must come; he would see the flower of the neighborhood here. He asked about you--had seen Arrowpoint's card. I think you had not made his acquaintance in town. He has been a good deal abroad. People don't know him much.\"\n\"No; we are strangers,\" said Mrs. Arrowpoint. \"But that is not what might have been expected. For his uncle Sir Hugo Mallinger and I are great friends when we meet.\"\n\"I don't know; uncles and nephews are not so likely to be seen together as uncles and nieces,\" said his lordship, smiling toward the rector. \"But just come with me one instant, Gascoigne, will you? I want to speak a word about the clout-shooting.\"\nGwendolen chose to go too and be deposited in the same group with her mamma and aunt until she had to shoot again. That Mr. Grandcourt might after all not appear on the archery-ground, had begun to enter into Gwendolen's thought as a possible deduction from the completeness of her pleasure. Under all her saucy satire, provoked chiefly by her divination that her friends thought of him as a desirable match for her, she felt something very far from indifference as to the impression she would make on him. True, he was not to have the slightest power over her (for Gwendolen had not considered that the desire to conquer is itself a sort of subjection); she had made up her mind that he was to be one of those complimentary and assiduously admiring men of whom even her narrow experience had shown her several with various-colored beards and various styles of bearing; and the sense that her friends would want her to think him delightful, gave her a resistant inclination to presuppose him ridiculous. But that was no reason why she could spare his presence: and even a passing prevision of trouble in case she despised and refused him, raised not the shadow of a wish that he should save her that trouble by showing no disposition to make her an offer. Mr. Grandcourt taking hardly any notice of her, and becoming shortly engaged to Miss Arrowpoint, was not a picture which flattered her imagination.\nHence Gwendolen had been all ear to Lord Brackenshaw's mode of accounting for Grandcourt's non-appearance; and when he did arrive, no consciousness--not even Mrs. Arrowpoint's or Mr. Gascoigne's--was more awake to the fact than hers, although she steadily avoided looking toward any point where he was likely to be. There should be no slightest shifting of angles to betray that it was of any consequence to her whether the much-talked-of Mr. Mallinger Grandcourt presented himself or not. She became again absorbed in the shooting, and so resolutely abstained from looking round observantly that, even supposing him to have taken a conspicuous place among the spectators, it might be clear she was not aware of him. And all the while the certainty that he was there made a distinct thread in her consciousness. Perhaps her shooting was the better for it: at any rate, it gained in precision, and she at last raised a delightful storm of clapping and applause by three hits running in the gold--a feat which among the Brackenshaw archers had not the vulgar reward of a shilling poll-tax, but that of a special gold star to be worn on the breast. That moment was not only a happy one to herself--it was just what her mamma and her uncle would have chosen for her. There was a general falling into ranks to give her space that she might advance conspicuously to receive the gold star from the hands of Lady Brackenshaw; and the perfect movement of her fine form was certainly a pleasant thing to behold in the clear afternoon light when the shadows were long and still. She was the central object of that pretty picture, and every one present must gaze at her. That was enough: she herself was determined to see nobody in particular, or to turn her eyes any way except toward Lady Brackenshaw, but her thoughts undeniably turned in other ways. It entered a little into her pleasure that Herr Klesmer must be observing her at a moment when music was out of the question, and his superiority very far in the back-ground; for vanity is as ill at ease under indifference as tenderness is under a love which it cannot return; and the unconquered Klesmer threw a trace of his malign power even across her pleasant consciousness that Mr. Grandcourt was seeing her to the utmost advantage, and was probably giving her an admiration unmixed with criticism. She did not expect to admire _him_, but that was not necessary to her peace of mind.\nGwendolen met Lady Brackenshaw's gracious smile without blushing (which only came to her when she was taken by surprise), but with a charming gladness of expression, and then bent with easy grace to have the star fixed near her shoulder. That little ceremony had been over long enough for her to have exchanged playful speeches and received congratulations as she moved among the groups who were now interesting themselves in the results of the scoring; but it happened that she stood outside examining the point of an arrow with rather an absent air when Lord Brackenshaw came up to her and said,\n\"Miss Harleth, here is a gentleman who is not willing to wait any longer for an introduction. He has been getting Mrs. Davilow to send me with him. Will you allow me to introduce Mr. Mallinger Grandcourt?\"",
        "paragraph_chars": [
            [
                0,
                663
            ],
            [
                663,
                1666
            ],
            [
                1666,
                2104
            ],
            [
                2104,
                3384
            ],
            [
                3384,
                3919
            ],
            [
                3919,
                5306
            ],
            [
                5306,
                5858
            ],
            [
                5858,
                5972
            ],
            [
                5972,
                6113
            ],
            [
                6113,
                6907
            ],
            [
                6907,
                8197
            ],
            [
                8197,
                9380
            ],
            [
                9380,
                9940
            ],
            [
                9940,
                10176
            ],
            [
                10176,
                10359
            ],
            [
                10359,
                10401
            ],
            [
                10401,
                10624
            ],
            [
                10624,
                10717
            ],
            [
                10717,
                10860
            ],
            [
                10860,
                10893
            ],
            [
                10893,
                10985
            ],
            [
                10985,
                11641
            ],
            [
                11641,
                11941
            ],
            [
                11941,
                12312
            ],
            [
                12312,
                12841
            ],
            [
                12841,
                13374
            ],
            [
                13374,
                13638
            ],
            [
                13638,
                14144
            ],
            [
                14144,
                14402
            ],
            [
                14402,
                14510
            ],
            [
                14510,
                15060
            ],
            [
                15060,
                15226
            ],
            [
                15226,
                15474
            ],
            [
                15474,
                16878
            ],
            [
                16878,
                19309
            ],
            [
                19309,
                19907
            ],
            [
                19907,
                20112
            ]
        ],
        "segment_chars": [
            [
                0,
                34
            ],
            [
                34,
                78
            ],
            [
                78,
                282
            ],
            [
                282,
                387
            ],
            [
                387,
                408
            ],
            [
                408,
                480
            ],
            [
                480,
                543
            ],
            [
                543,
                663
            ],
            [
                663,
                907
            ],
            [
                907,
                1103
            ],
            [
                1103,
                1259
            ],
            [
                1259,
                1558
            ],
            [
                1558,
                1666
            ],
            [
                1666,
                1851
            ],
            [
                1851,
                2104
            ],
            [
                2104,
                2457
            ],
            [
                2457,
                2712
            ],
            [
                2712,
                3057
            ],
            [
                3057,
                3384
            ],
            [
                3384,
                3438
            ],
            [
                3438,
                3517
            ],
            [
                3517,
                3803
            ],
            [
                3803,
                3870
            ],
            [
                3870,
                3919
            ],
            [
                3919,
                4031
            ],
            [
                4031,
                4184
            ],
            [
                4184,
                4495
            ],
            [
                4495,
                4683
            ],
            [
                4683,
                5006
            ],
            [
                5006,
                5166
            ],
            [
                5166,
                5306
            ],
            [
                5306,
                5362
            ],
            [
                5362,
                5712
            ],
            [
                5712,
                5762
            ],
            [
                5762,
                5858
            ],
            [
                5858,
                5972
            ],
            [
                5972,
                5985
            ],
            [
                5985,
                6113
            ],
            [
                6113,
                6151
            ],
            [
                6151,
                6353
            ],
            [
                6353,
                6509
            ],
            [
                6509,
                6907
            ],
            [
                6907,
                7082
            ],
            [
                7082,
                7184
            ],
            [
                7184,
                7640
            ],
            [
                7640,
                7706
            ],
            [
                7706,
                8013
            ],
            [
                8013,
                8197
            ],
            [
                8197,
                8683
            ],
            [
                8683,
                9281
            ],
            [
                9281,
                9380
            ],
            [
                9380,
                9672
            ],
            [
                9672,
                9940
            ],
            [
                9940,
                9996
            ],
            [
                9996,
                10030
            ],
            [
                10030,
                10176
            ],
            [
                10176,
                10222
            ],
            [
                10222,
                10263
            ],
            [
                10263,
                10359
            ],
            [
                10359,
                10401
            ],
            [
                10401,
                10517
            ],
            [
                10517,
                10624
            ],
            [
                10624,
                10683
            ],
            [
                10683,
                10717
            ],
            [
                10717,
                10741
            ],
            [
                10741,
                10795
            ],
            [
                10795,
                10860
            ],
            [
                10860,
                10893
            ],
            [
                10893,
                10985
            ],
            [
                10985,
                11091
            ],
            [
                11091,
                11225
            ],
            [
                11225,
                11462
            ],
            [
                11462,
                11520
            ],
            [
                11520,
                11641
            ],
            [
                11641,
                11681
            ],
            [
                11681,
                11808
            ],
            [
                11808,
                11873
            ],
            [
                11873,
                11941
            ],
            [
                11941,
                11987
            ],
            [
                11987,
                12020
            ],
            [
                12020,
                12063
            ],
            [
                12063,
                12173
            ],
            [
                12173,
                12212
            ],
            [
                12212,
                12261
            ],
            [
                12261,
                12276
            ],
            [
                12276,
                12312
            ],
            [
                12312,
                12407
            ],
            [
                12407,
                12535
            ],
            [
                12535,
                12646
            ],
            [
                12646,
                12815
            ],
            [
                12815,
                12841
            ],
            [
                12841,
                12989
            ],
            [
                12989,
                13007
            ],
            [
                13007,
                13036
            ],
            [
                13036,
                13062
            ],
            [
                13062,
                13086
            ],
            [
                13086,
                13222
            ],
            [
                13222,
                13333
            ],
            [
                13333,
                13374
            ],
            [
                13374,
                13494
            ],
            [
                13494,
                13558
            ],
            [
                13558,
                13589
            ],
            [
                13589,
                13638
            ],
            [
                13638,
                13666
            ],
            [
                13666,
                13735
            ],
            [
                13735,
                13777
            ],
            [
                13777,
                13842
            ],
            [
                13842,
                13888
            ],
            [
                13888,
                13904
            ],
            [
                13904,
                14144
            ],
            [
                14144,
                14294
            ],
            [
                14294,
                14328
            ],
            [
                14328,
                14402
            ],
            [
                14402,
                14470
            ],
            [
                14470,
                14510
            ],
            [
                14510,
                14705
            ],
            [
                14705,
                14736
            ],
            [
                14736,
                14821
            ],
            [
                14821,
                14900
            ],
            [
                14900,
                14948
            ],
            [
                14948,
                14999
            ],
            [
                14999,
                15031
            ],
            [
                15031,
                15060
            ],
            [
                15060,
                15106
            ],
            [
                15106,
                15154
            ],
            [
                15154,
                15226
            ],
            [
                15226,
                15367
            ],
            [
                15367,
                15424
            ],
            [
                15424,
                15474
            ],
            [
                15474,
                15589
            ],
            [
                15589,
                15766
            ],
            [
                15766,
                15981
            ],
            [
                15981,
                16478
            ],
            [
                16478,
                16730
            ],
            [
                16730,
                16878
            ],
            [
                16878,
                17194
            ],
            [
                17194,
                17368
            ],
            [
                17368,
                17595
            ],
            [
                17595,
                17690
            ],
            [
                17690,
                18024
            ],
            [
                18024,
                18141
            ],
            [
                18141,
                18446
            ],
            [
                18446,
                18537
            ],
            [
                18537,
                18720
            ],
            [
                18720,
                19224
            ],
            [
                19224,
                19309
            ],
            [
                19309,
                19547
            ],
            [
                19547,
                19907
            ],
            [
                19907,
                20001
            ],
            [
                20001,
                20055
            ],
            [
                20055,
                20112
            ]
        ],
        "overlap_chars": [
            [
                663,
                732
            ],
            [
                737,
                751
            ],
            [
                756,
                764
            ],
            [
                777,
                790
            ],
            [
                800,
                841
            ],
            [
                853,
                860
            ],
            [
                862,
                907
            ],
            [
                907,
                917
            ],
            [
                978,
                1047
            ],
            [
                1052,
                1056
            ],
            [
                1065,
                1103
            ],
            [
                1113,
                1139
            ],
            [
                1152,
                1169
            ],
            [
                1191,
                1207
            ],
            [
                1228,
                1237
            ],
            [
                1252,
                1259
            ],
            [
                1259,
                1308
            ],
            [
                1332,
                1374
            ],
            [
                1396,
                1414
            ],
            [
                1421,
                1438
            ],
            [
                1556,
                1558
            ],
            [
                1558,
                1574
            ],
            [
                1575,
                1598
            ],
            [
                1599,
                1646
            ],
            [
                1664,
                1666
            ],
            [
                1666,
                1752
            ],
            [
                1800,
                1816
            ],
            [
                1876,
                1884
            ],
            [
                1954,
                1961
            ],
            [
                1990,
                2012
            ],
            [
                2031,
                2043
            ],
            [
                1885,
                1887
            ],
            [
                2051,
                2104
            ],
            [
                2219,
                2258
            ],
            [
                2455,
                2457
            ],
            [
                2457,
                2568
            ],
            [
                2589,
                2617
            ],
            [
                2640,
                2641
            ],
            [
                2618,
                2621
            ],
            [
                2961,
                3022
            ],
            [
                3055,
                3057
            ],
            [
                3057,
                3065
            ],
            [
                3093,
                3098
            ],
            [
                3104,
                3108
            ],
            [
                3158,
                3167
            ],
            [
                3136,
                3137
            ],
            [
                3142,
                3146
            ],
            [
                3175,
                3215
            ],
            [
                3225,
                3258
            ],
            [
                3138,
                3141
            ],
            [
                3359,
                3384
            ],
            [
                3384,
                3438
            ],
            [
                3438,
                3516
            ],
            [
                3919,
                3956
            ],
            [
                3963,
                4031
            ],
            [
                4031,
                4083
            ],
            [
                4089,
                4093
            ],
            [
                4134,
                4141
            ],
            [
                4143,
                4184
            ],
            [
                4733,
                4736
            ],
            [
                4717,
                4732
            ],
            [
                4737,
                4765
            ],
            [
                4841,
                4912
            ],
            [
                4929,
                4951
            ],
            [
                5004,
                5006
            ],
            [
                5166,
                5247
            ],
            [
                5304,
                5306
            ],
            [
                5306,
                5309
            ],
            [
                5317,
                5320
            ],
            [
                5334,
                5354
            ],
            [
                5360,
                5362
            ],
            [
                5362,
                5422
            ],
            [
                5434,
                5458
            ],
            [
                5499,
                5560
            ],
            [
                5574,
                5580
            ],
            [
                5561,
                5573
            ],
            [
                5631,
                5648
            ],
            [
                5683,
                5712
            ],
            [
                5815,
                5835
            ],
            [
                5717,
                5726
            ],
            [
                5840,
                5858
            ],
            [
                5858,
                5939
            ],
            [
                5970,
                5972
            ],
            [
                6082,
                6083
            ],
            [
                5985,
                6008
            ],
            [
                6110,
                6113
            ],
            [
                6113,
                6151
            ],
            [
                6151,
                6159
            ],
            [
                6164,
                6166
            ],
            [
                6172,
                6176
            ],
            [
                6183,
                6191
            ],
            [
                6239,
                6244
            ],
            [
                6245,
                6315
            ],
            [
                6351,
                6353
            ],
            [
                6398,
                6509
            ],
            [
                6771,
                6829
            ],
            [
                6833,
                6842
            ],
            [
                6858,
                6907
            ],
            [
                6907,
                6959
            ],
            [
                7016,
                7055
            ],
            [
                7080,
                7082
            ],
            [
                7107,
                7125
            ],
            [
                7127,
                7134
            ],
            [
                7136,
                7184
            ],
            [
                7184,
                7195
            ],
            [
                7201,
                7278
            ],
            [
                7302,
                7303
            ],
            [
                7396,
                7399
            ],
            [
                7313,
                7345
            ],
            [
                7354,
                7385
            ],
            [
                7475,
                7476
            ],
            [
                8197,
                8202
            ],
            [
                8458,
                8459
            ],
            [
                8432,
                8434
            ],
            [
                8227,
                8230
            ],
            [
                8235,
                8238
            ],
            [
                8387,
                8391
            ],
            [
                8239,
                8325
            ],
            [
                8494,
                8495
            ],
            [
                8327,
                8361
            ],
            [
                8223,
                8226
            ],
            [
                8396,
                8411
            ],
            [
                8552,
                8583
            ],
            [
                8530,
                8531
            ],
            [
                8616,
                8623
            ],
            [
                8681,
                8683
            ],
            [
                8930,
                8977
            ],
            [
                9048,
                9073
            ],
            [
                8741,
                8744
            ],
            [
                9076,
                9079
            ],
            [
                8749,
                8750
            ],
            [
                9281,
                9284
            ],
            [
                9291,
                9380
            ],
            [
                9380,
                9492
            ],
            [
                9500,
                9513
            ],
            [
                9670,
                9672
            ],
            [
                9717,
                9720
            ],
            [
                9735,
                9770
            ],
            [
                9823,
                9824
            ],
            [
                9796,
                9823
            ],
            [
                9825,
                9902
            ],
            [
                9938,
                9940
            ],
            [
                9940,
                9996
            ],
            [
                9996,
                10030
            ],
            [
                10030,
                10060
            ],
            [
                10173,
                10176
            ],
            [
                10222,
                10261
            ],
            [
                10203,
                10221
            ],
            [
                10263,
                10338
            ],
            [
                10343,
                10359
            ],
            [
                10359,
                10378
            ],
            [
                10383,
                10401
            ],
            [
                10401,
                10414
            ],
            [
                10415,
                10419
            ],
            [
                10431,
                10476
            ],
            [
                10487,
                10514
            ],
            [
                10741,
                10786
            ],
            [
                10793,
                10795
            ],
            [
                10795,
                10844
            ],
            [
                10852,
                10860
            ],
            [
                10860,
                10893
            ],
            [
                10893,
                10916
            ],
            [
                10933,
                10985
            ],
            [
                10985,
                11091
            ],
            [
                11091,
                11126
            ],
            [
                11135,
                11225
            ],
            [
                11225,
                11343
            ],
            [
                11460,
                11462
            ],
            [
                11462,
                11519
            ],
            [
                11641,
                11681
            ],
            [
                11681,
                11702
            ],
            [
                11829,
                11835
            ],
            [
                11812,
                11816
            ],
            [
                11836,
                11838
            ],
            [
                11860,
                11873
            ],
            [
                11873,
                11941
            ],
            [
                11941,
                11987
            ],
            [
                11987,
                12020
            ],
            [
                12020,
                12063
            ],
            [
                12063,
                12158
            ],
            [
                12171,
                12173
            ],
            [
                12173,
                12210
            ],
            [
                12312,
                12407
            ],
            [
                12407,
                12426
            ],
            [
                12443,
                12498
            ],
            [
                12533,
                12535
            ],
            [
                12557,
                12646
            ],
            [
                13558,
                13578
            ],
            [
                13587,
                13589
            ],
            [
                13589,
                13638
            ],
            [
                13638,
                13639
            ],
            [
                13655,
                13666
            ],
            [
                13666,
                13735
            ],
            [
                13735,
                13777
            ],
            [
                13888,
                13904
            ],
            [
                13906,
                13930
            ],
            [
                13961,
                13975
            ],
            [
                14028,
                14036
            ],
            [
                14046,
                14058
            ],
            [
                14094,
                14099
            ],
            [
                14103,
                14144
            ],
            [
                14144,
                14147
            ],
            [
                14149,
                14151
            ],
            [
                14153,
                14177
            ],
            [
                14212,
                14264
            ],
            [
                14292,
                14294
            ],
            [
                14294,
                14326
            ],
            [
                14402,
                14470
            ],
            [
                14470,
                14510
            ],
            [
                14510,
                14530
            ],
            [
                14533,
                14538
            ],
            [
                14548,
                14597
            ],
            [
                14601,
                14630
            ],
            [
                14662,
                14667
            ],
            [
                14669,
                14691
            ],
            [
                14703,
                14705
            ],
            [
                14709,
                14722
            ],
            [
                14758,
                14789
            ],
            [
                14803,
                14821
            ],
            [
                14821,
                14848
            ],
            [
                14859,
                14880
            ],
            [
                15474,
                15483
            ],
            [
                15657,
                15658
            ],
            [
                15540,
                15564
            ],
            [
                15573,
                15587
            ],
            [
                15589,
                15608
            ],
            [
                15692,
                15694
            ],
            [
                15609,
                15614
            ],
            [
                15752,
                15766
            ],
            [
                15766,
                15793
            ],
            [
                15891,
                15894
            ],
            [
                15915,
                15923
            ],
            [
                15937,
                15981
            ],
            [
                15981,
                16202
            ],
            [
                16215,
                16235
            ],
            [
                16263,
                16266
            ],
            [
                16252,
                16262
            ],
            [
                16413,
                16414
            ],
            [
                16313,
                16316
            ],
            [
                16375,
                16380
            ],
            [
                16306,
                16308
            ],
            [
                16466,
                16477
            ],
            [
                16478,
                16534
            ],
            [
                16583,
                16586
            ],
            [
                16620,
                16623
            ],
            [
                16640,
                16644
            ],
            [
                16608,
                16611
            ],
            [
                16660,
                16668
            ],
            [
                16624,
                16627
            ],
            [
                16567,
                16574
            ],
            [
                16635,
                16639
            ],
            [
                16611,
                16612
            ],
            [
                16682,
                16695
            ],
            [
                16708,
                16730
            ],
            [
                16730,
                16878
            ],
            [
                16878,
                16906
            ],
            [
                16911,
                16932
            ],
            [
                16956,
                16966
            ],
            [
                16983,
                17011
            ],
            [
                16972,
                16973
            ],
            [
                17074,
                17105
            ],
            [
                17110,
                17149
            ],
            [
                17167,
                17194
            ],
            [
                17363,
                17366
            ],
            [
                17245,
                17251
            ],
            [
                17298,
                17301
            ],
            [
                17213,
                17222
            ],
            [
                17317,
                17320
            ],
            [
                17331,
                17341
            ],
            [
                17366,
                17368
            ],
            [
                17368,
                17414
            ],
            [
                17418,
                17457
            ],
            [
                17474,
                17475
            ],
            [
                17415,
                17417
            ],
            [
                17470,
                17474
            ],
            [
                17476,
                17480
            ],
            [
                17549,
                17595
            ],
            [
                17595,
                17690
            ],
            [
                17690,
                17746
            ],
            [
                17775,
                17778
            ],
            [
                17787,
                17795
            ],
            [
                17807,
                17851
            ],
            [
                17860,
                17871
            ],
            [
                17960,
                17961
            ],
            [
                17873,
                17885
            ],
            [
                17978,
                17997
            ],
            [
                18022,
                18023
            ],
            [
                18024,
                18039
            ],
            [
                18049,
                18060
            ],
            [
                18139,
                18141
            ],
            [
                18141,
                18197
            ],
            [
                18235,
                18237
            ],
            [
                18213,
                18220
            ],
            [
                18296,
                18299
            ],
            [
                18238,
                18264
            ],
            [
                18278,
                18295
            ],
            [
                18446,
                18500
            ],
            [
                18519,
                18536
            ],
            [
                18554,
                18580
            ],
            [
                18613,
                18720
            ],
            [
                18720,
                18722
            ],
            [
                18745,
                18748
            ],
            [
                18758,
                18820
            ],
            [
                18846,
                18865
            ],
            [
                18871,
                18881
            ],
            [
                18893,
                18898
            ],
            [
                19001,
                19121
            ],
            [
                19166,
                19174
            ],
            [
                19129,
                19132
            ],
            [
                19222,
                19224
            ],
            [
                19224,
                19252
            ],
            [
                19254,
                19257
            ],
            [
                19258,
                19309
            ],
            [
                19309,
                19341
            ],
            [
                19351,
                19356
            ],
            [
                19442,
                19450
            ],
            [
                19473,
                19478
            ],
            [
                19484,
                19547
            ],
            [
                19747,
                19749
            ],
            [
                19650,
                19665
            ],
            [
                19905,
                19906
            ],
            [
                19669,
                19672
            ],
            [
                19802,
                19811
            ],
            [
                19825,
                19889
            ],
            [
                19897,
                19905
            ],
            [
                19907,
                20001
            ],
            [
                20055,
                20112
            ]
        ],
        "row_chars": [
            [
                0,
                34
            ],
            [
                34,
                78
            ],
            [
                78,
                282
            ],
            [
                282,
                387
            ],
            [
                387,
                408
            ],
            [
                408,
                480
            ],
            [
                480,
                543
            ],
            [
                543,
                663
            ],
            [
                663,
                907
            ],
            [
                907,
                1103
            ],
            [
                1103,
                1259
            ],
            [
                1259,
                1558
            ],
            [
                1558,
                1666
            ],
            [
                1666,
                1851
            ],
            [
                1851,
                2104
            ],
            [
                2104,
                2457
            ],
            [
                2457,
                3057
            ],
            [
                3057,
                3384
            ],
            [
                3384,
                3438
            ],
            [
                3438,
                3517
            ],
            [
                3517,
                3803
            ],
            [
                3803,
                3870
            ],
            [
                3870,
                3919
            ],
            [
                3919,
                4031
            ],
            [
                4031,
                4184
            ],
            [
                4184,
                4495
            ],
            [
                4495,
                4683
            ],
            [
                4683,
                5006
            ],
            [
                5006,
                5166
            ],
            [
                5166,
                5306
            ],
            [
                5306,
                5362
            ],
            [
                5362,
                5712
            ],
            [
                5712,
                5858
            ],
            [
                5858,
                5972
            ],
            [
                5972,
                5985
            ],
            [
                5985,
                6113
            ],
            [
                6113,
                6151
            ],
            [
                6151,
                6353
            ],
            [
                6353,
                6509
            ],
            [
                6509,
                6907
            ],
            [
                6907,
                7082
            ],
            [
                7082,
                7184
            ],
            [
                7184,
                7640
            ],
            [
                7640,
                7706
            ],
            [
                7706,
                8013
            ],
            [
                8013,
                8197
            ],
            [
                8197,
                8683
            ],
            [
                8683,
                9380
            ],
            [
                9380,
                9672
            ],
            [
                9672,
                9940
            ],
            [
                9940,
                9996
            ],
            [
                9996,
                10030
            ],
            [
                10030,
                10176
            ],
            [
                10176,
                10263
            ],
            [
                10263,
                10359
            ],
            [
                10359,
                10401
            ],
            [
                10401,
                10517
            ],
            [
                10517,
                10624
            ],
            [
                10624,
                10683
            ],
            [
                10683,
                10717
            ],
            [
                10717,
                10741
            ],
            [
                10741,
                10795
            ],
            [
                10795,
                10860
            ],
            [
                10860,
                10893
            ],
            [
                10893,
                10985
            ],
            [
                10985,
                11091
            ],
            [
                11091,
                11225
            ],
            [
                11225,
                11462
            ],
            [
                11462,
                11520
            ],
            [
                11520,
                11641
            ],
            [
                11641,
                11681
            ],
            [
                11681,
                11873
            ],
            [
                11873,
                11941
            ],
            [
                11941,
                11987
            ],
            [
                11987,
                12020
            ],
            [
                12020,
                12063
            ],
            [
                12063,
                12173
            ],
            [
                12173,
                12212
            ],
            [
                12212,
                12261
            ],
            [
                12261,
                12276
            ],
            [
                12276,
                12312
            ],
            [
                12312,
                12407
            ],
            [
                12407,
                12535
            ],
            [
                12535,
                12646
            ],
            [
                12646,
                12815
            ],
            [
                12815,
                12841
            ],
            [
                12841,
                12989
            ],
            [
                12989,
                13007
            ],
            [
                13007,
                13036
            ],
            [
                13036,
                13062
            ],
            [
                13062,
                13086
            ],
            [
                13086,
                13222
            ],
            [
                13222,
                13333
            ],
            [
                13333,
                13374
            ],
            [
                13374,
                13494
            ],
            [
                13494,
                13558
            ],
            [
                13558,
                13589
            ],
            [
                13589,
                13638
            ],
            [
                13638,
                13666
            ],
            [
                13666,
                13735
            ],
            [
                13735,
                13777
            ],
            [
                13777,
                13842
            ],
            [
                13842,
                13888
            ],
            [
                13888,
                13904
            ],
            [
                13904,
                14144
            ],
            [
                14144,
                14294
            ],
            [
                14294,
                14328
            ],
            [
                14328,
                14402
            ],
            [
                14402,
                14470
            ],
            [
                14470,
                14510
            ],
            [
                14510,
                14705
            ],
            [
                14705,
                14821
            ],
            [
                14821,
                14900
            ],
            [
                14900,
                14948
            ],
            [
                14948,
                14999
            ],
            [
                14999,
                15031
            ],
            [
                15031,
                15060
            ],
            [
                15060,
                15106
            ],
            [
                15106,
                15154
            ],
            [
                15154,
                15226
            ],
            [
                15226,
                15367
            ],
            [
                15367,
                15424
            ],
            [
                15424,
                15474
            ],
            [
                15474,
                15766
            ],
            [
                15766,
                15981
            ],
            [
                15981,
                16478
            ],
            [
                16478,
                16730
            ],
            [
                16730,
                16878
            ],
            [
                16878,
                17194
            ],
            [
                17194,
                17368
            ],
            [
                17368,
                17595
            ],
            [
                17595,
                17690
            ],
            [
                17690,
                18024
            ],
            [
                18024,
                18141
            ],
            [
                18141,
                18537
            ],
            [
                18537,
                18720
            ],
            [
                18720,
                19224
            ],
            [
                19224,
                19309
            ],
            [
                19309,
                19547
            ],
            [
                19547,
                19907
            ],
            [
                19907,
                20001
            ],
            [
                20001,
                20055
            ],
            [
                20055,
                20112
            ]
        ]
    },
    "abridged": {
        "text": "Brackenshaw Park, where the Archery Meeting was held, looked out from gentle heights over the valley to the eastern downs and the broad, slow rise of country hanging like a vast curtain toward the west. The castle was built of rough-hewn limestone, full of lights and shadows made by dark lichens and the washings of the rain. Beech and fir sheltered it, and spread down the green slopes to the water below. The archery-ground was a carefully-kept enclosure at the farthest end of the park, protected by tall elms and a shading screen of hollies. The Archery Hall, with an arcade in front, showed like a white temple against the greenery.\nWhat could make a better background for the flower-groups of ladies, moving and bowing like leisurely lilies? There was a pleasant sound of musical laughter and a harmony of happy speech, now rising to mild excitement, now sinking to an agreeable murmur.\nNo Archery Meeting could be more select. Within the enclosure no plebeian spectators were admitted except Lord Brackenshaw's tenants and their families, chiefly the feminine members, who liked to consider which of those sweetly-dressed ladies they would choose to be. Probably they would not have chosen Gwendolen, but some lady with more pink in her cheeks and hair of fashionable yellow; but among the males, she was unanimously pronounced the finest girl present.\nNo wonder she enjoyed her existence on that July day. Pre-eminence is sweet to those who love it, even under mediocre circumstances.\nAnd who can deny that bows and arrows are the prettiest weapons in the world for feminine forms to play with? They prompt attitudes full of grace and power, where fine marksmanship is freed from associations of bloodshed. All the prizes were of the nobler symbolic kind; the gold arrow and the silver, the gold star and the silver, to be worn in sign of achievement. Altogether the Brackenshaw Archery Club was an institution framed with good taste.\nAnd today all the elements were in its favour. There was mild warmth, and no wind to disturb either hair or the course of the arrow; and when there was a general march to extract the arrows, the joyous promenade of graceful movement was a show worth looking at. Everyone was obliged to admit Gwendolen's surpassing charm.\n\"That girl is like a high-mettled racer,\" said Lord Brackenshaw to young Clintock.\n\"Tremendously pretty too.\"\nPerhaps she had never looked so well. Her face beamed with pleasure; for, being satisfied with her own chances, she felt kindly toward everybody. Not to be marked out as an heiress, like Miss Arrowpoint, gave an added triumph in eclipsing those advantages. Gwendolen was too full of joyous belief in herself to feel the least jealousy, although Miss Arrowpoint was one of the best archeresses.\nEven the reappearance of the formidable Herr Klesmer seemed only to fall in with Gwendolen's amusement. What great musical maestro could make a good figure at an archery meeting? There was a satirical light in Gwendolen's eyes as she looked toward the Arrowpoint party, with its intense contrast between Klesmer and the group of English country people.\nFancy a gathering of men all with that ordinary stamp of the well-bred Englishman, watching the entrance of Herr Klesmer - his mane of hair floating backward under the absurd chimney-pot hat; his tall, thin figure clad in noticeably un-English style. When the fire that showed itself in his glances was turned into comedy by his hat, one felt why it is often better for greatness to be dead, and to have got rid of the outward man.\nMany present knew Klesmer, or knew of him; but they had only seen him on candle-light occasions when he appeared as a musician. Seeing him presented unexpectedly on this July afternoon, some were inclined to laugh; others felt a little disgust at the want of judgment shown by the Arrowpoints.\n\"What extreme guys those artistic fellows usually are!\" said young Clintock to Gwendolen. \"Do look at the figure he cuts.\"\n\"You are blind to the majesty of genius,\" said Gwendolen. \"Herr Klesmer smites me with awe; I feel crushed in his presence; my courage oozes from me.\"\n\"Ah, you understand about his music.\"\n\"No, indeed,\" she said with a light laugh; \"it is he who understands mine and thinks it pitiable. But how remarkably well Miss Arrowpoint looks! She would make quite a fine picture in that gold-coloured dress.\"\n\"Too splendid, don't you think?\"\n\"Well, perhaps a little too much like the figure of Wealth in an allegory.\"\nThis speech of Gwendolen's had rather a malicious sound, but it was not really more than a bubble of fun. She did not wish Miss Arrowpoint or anyone else to be out of the way, believing in her own good fortune even more than in her skill. The belief in both naturally grew stronger as the shooting went on, for she promised to achieve one of the best scores. She trod on air, and all things pleasant seemed possible.\n\"How does the scoring stand, I wonder?\" said Lady Brackenshaw to her lord in an interval of shooting. \"It seems to me that Miss Harleth is likely to win the gold arrow.\"\n\"Gad, I think she will, if she carries it on! she is running Juliet Fenn hard. It is wonderful for one in her first year. Catherine is not up to her usual mark,\" continued his lordship, turning to the heiress's mother nearby. \"But she got the gold arrow last time.\"\n\"Catherine will be very glad for others to win,\" said Mrs. Arrowpoint, \"she is so magnanimous. It was entirely her kindness that made us bring Herr Klesmer instead of Canon Stople. I am sure she would rather have brought the Canon; but she is always thinking of others. But where is our new neighbour? I thought Mr. Grandcourt was to be here to-day.\"\n\"So he was. The time's getting on too,\" said his lordship, looking at his watch. \"But he only got to Diplow the other day. Why, Gascoigne!\" - the rector was just then close by with Gwendolen - \"this is too bad; you bring your niece to beat all the archeresses.\"\n\"It is rather scandalous in her,\" said Mr. Gascoigne, with much inward satisfaction. \"But it is not my doing, my lord.\"\n\"It is not my fault, either,\" said Gwendolen, with pretty archness. \"If I am to aim, I can't help hitting.\"\n\"Ay, ay, that may be fatal for some people,\" said Lord Brackenshaw, good-humouredly; then taking out his watch again- \"The time's getting on. Grandcourt is always late, and he's no bowman - understands nothing about it. But I told him he must come and see the flower of the neighbourhood.\"\nGwendolen, who joined her mamma and aunt until it was time to shoot again, felt that Mr. Grandcourt's absence might compromise her pleasure. Under all her saucy satire, she was far from indifferent as to the impression she would make on him. True, he was not to have the slightest power over her (for Gwendolen had not considered that the desire to conquer is itself a sort of subjection); she had made up her mind that he was to be one of those complimentary and admiring men of whom she had some experience, and she imagined he would be ridiculous.\nBut that was no reason why she could spare his presence: she did not wish him to save her the trouble of a refusal, by showing no desire to make her an offer. Mr. Grandcourt taking hardly any notice of her, and becoming shortly engaged to Miss Arrowpoint, was not a picture which flattered her imagination.\nHence Gwendolen had been all ears to Lord Brackenshaw's words about Grandcourt; and when he did arrive, no-one was more awake to the fact than her, although she steadily avoided looking where he was likely to be. She would not betray the slightest interest in Mr. Grandcourt. She became again absorbed in the shooting, and resolutely abstained from looking round, so that even if he were watching, it might be clear she was not aware of him. And all the while the certainty that he was there made a distinct thread in her consciousness. Perhaps her shooting was the better for it: at any rate, she raised a storm of clapping and applause by three hits in the gold - a feat which was rewarded by a special gold star.\nThat moment was a happy one. There was a general falling into ranks to give her space to advance and receive the gold star from Lady Brackenshaw; she was the central object of that pretty picture, and everyone must gaze at her.\nShe herself was determined not to turn her eyes any way except toward Lady Brackenshaw, but her thoughts undeniably turned in other ways. It pleased her that Herr Klesmer must be observing her at a moment when music and his superiority were far in the background; for the unconquered Klesmer threw a trace of his malign power even across her pleasant consciousness that Mr. Grandcourt was probably admiring her. She did not expect to admire him, but that was not necessary to her peace of mind.\nGwendolen met Lady Brackenshaw's smile charmingly, and bent with easy grace to have the star fixed near her shoulder. After an exchange of congratulations, she was standing aside examining an arrow with rather an absent air when Lord Brackenshaw came up and said:\n\"Miss Harleth, here is a gentleman who is not willing to wait any longer for an introduction. Will you allow me to introduce Mr. Mallinger Grandcourt?\"",
        "paragraph_chars": [
            [
                0,
                639
            ],
            [
                639,
                894
            ],
            [
                894,
                1361
            ],
            [
                1361,
                1494
            ],
            [
                1494,
                1944
            ],
            [
                1944,
                2266
            ],
            [
                2266,
                2349
            ],
            [
                2349,
                2376
            ],
            [
                2376,
                2770
            ],
            [
                2770,
                3123
            ],
            [
                3123,
                3555
            ],
            [
                3555,
                3849
            ],
            [
                3849,
                3972
            ],
            [
                3972,
                4123
            ],
            [
                4123,
                4161
            ],
            [
                4161,
                4372
            ],
            [
                4372,
                4405
            ],
            [
                4405,
                4481
            ],
            [
                4481,
                4898
            ],
            [
                4898,
                5068
            ],
            [
                5068,
                5334
            ],
            [
                5334,
                5685
            ],
            [
                5685,
                5947
            ],
            [
                5947,
                6067
            ],
            [
                6067,
                6175
            ],
            [
                6175,
                6465
            ],
            [
                6465,
                7016
            ],
            [
                7016,
                7323
            ],
            [
                7323,
                8039
            ],
            [
                8039,
                8267
            ],
            [
                8267,
                8762
            ],
            [
                8762,
                9026
            ],
            [
                9026,
                9177
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                327
            ],
            [
                327,
                408
            ],
            [
                408,
                547
            ],
            [
                547,
                639
            ],
            [
                639,
                749
            ],
            [
                749,
                894
            ],
            [
                894,
                935
            ],
            [
                935,
                1162
            ],
            [
                1162,
                1361
            ],
            [
                1361,
                1415
            ],
            [
                1415,
                1494
            ],
            [
                1494,
                1604
            ],
            [
                1604,
                1716
            ],
            [
                1716,
                1861
            ],
            [
                1861,
                1944
            ],
            [
                1944,
                1991
            ],
            [
                1991,
                2206
            ],
            [
                2206,
                2266
            ],
            [
                2266,
                2349
            ],
            [
                2349,
                2376
            ],
            [
                2376,
                2414
            ],
            [
                2414,
                2522
            ],
            [
                2522,
                2633
            ],
            [
                2633,
                2770
            ],
            [
                2770,
                2874
            ],
            [
                2874,
                2949
            ],
            [
                2949,
                3123
            ],
            [
                3123,
                3374
            ],
            [
                3374,
                3555
            ],
            [
                3555,
                3683
            ],
            [
                3683,
                3849
            ],
            [
                3849,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3972
            ],
            [
                3972,
                4030
            ],
            [
                4030,
                4123
            ],
            [
                4123,
                4161
            ],
            [
                4161,
                4259
            ],
            [
                4259,
                4306
            ],
            [
                4306,
                4372
            ],
            [
                4372,
                4405
            ],
            [
                4405,
                4481
            ],
            [
                4481,
                4587
            ],
            [
                4587,
                4720
            ],
            [
                4720,
                4840
            ],
            [
                4840,
                4898
            ],
            [
                4898,
                4938
            ],
            [
                4938,
                5000
            ],
            [
                5000,
                5068
            ],
            [
                5068,
                5114
            ],
            [
                5114,
                5147
            ],
            [
                5147,
                5190
            ],
            [
                5190,
                5294
            ],
            [
                5294,
                5334
            ],
            [
                5334,
                5429
            ],
            [
                5429,
                5515
            ],
            [
                5515,
                5604
            ],
            [
                5604,
                5636
            ],
            [
                5636,
                5685
            ],
            [
                5685,
                5697
            ],
            [
                5697,
                5766
            ],
            [
                5766,
                5808
            ],
            [
                5808,
                5825
            ],
            [
                5825,
                5947
            ],
            [
                5947,
                6032
            ],
            [
                6032,
                6067
            ],
            [
                6067,
                6135
            ],
            [
                6135,
                6175
            ],
            [
                6175,
                6317
            ],
            [
                6317,
                6395
            ],
            [
                6395,
                6465
            ],
            [
                6465,
                6606
            ],
            [
                6606,
                6707
            ],
            [
                6707,
                7016
            ],
            [
                7016,
                7175
            ],
            [
                7175,
                7323
            ],
            [
                7323,
                7536
            ],
            [
                7536,
                7599
            ],
            [
                7599,
                7765
            ],
            [
                7765,
                7860
            ],
            [
                7860,
                8039
            ],
            [
                8039,
                8068
            ],
            [
                8068,
                8267
            ],
            [
                8267,
                8405
            ],
            [
                8405,
                8679
            ],
            [
                8679,
                8762
            ],
            [
                8762,
                8880
            ],
            [
                8880,
                9026
            ],
            [
                9026,
                9120
            ],
            [
                9120,
                9177
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                70,
                84
            ],
            [
                85,
                93
            ],
            [
                94,
                107
            ],
            [
                108,
                149
            ],
            [
                150,
                157
            ],
            [
                158,
                203
            ],
            [
                203,
                213
            ],
            [
                214,
                283
            ],
            [
                284,
                288
            ],
            [
                289,
                327
            ],
            [
                327,
                353
            ],
            [
                353,
                370
            ],
            [
                371,
                387
            ],
            [
                391,
                400
            ],
            [
                401,
                408
            ],
            [
                408,
                457
            ],
            [
                458,
                500
            ],
            [
                501,
                519
            ],
            [
                528,
                545
            ],
            [
                545,
                547
            ],
            [
                547,
                563
            ],
            [
                565,
                588
            ],
            [
                590,
                637
            ],
            [
                637,
                639
            ],
            [
                639,
                725
            ],
            [
                731,
                747
            ],
            [
                761,
                769
            ],
            [
                779,
                786
            ],
            [
                796,
                818
            ],
            [
                825,
                837
            ],
            [
                838,
                840
            ],
            [
                841,
                894
            ],
            [
                894,
                933
            ],
            [
                933,
                935
            ],
            [
                935,
                1046
            ],
            [
                1047,
                1075
            ],
            [
                1075,
                1076
            ],
            [
                1077,
                1080
            ],
            [
                1099,
                1160
            ],
            [
                1160,
                1162
            ],
            [
                1162,
                1170
            ],
            [
                1176,
                1181
            ],
            [
                1186,
                1190
            ],
            [
                1198,
                1207
            ],
            [
                1207,
                1208
            ],
            [
                1213,
                1217
            ],
            [
                1223,
                1263
            ],
            [
                1264,
                1297
            ],
            [
                1309,
                1312
            ],
            [
                1336,
                1361
            ],
            [
                1361,
                1415
            ],
            [
                1415,
                1493
            ],
            [
                1498,
                1535
            ],
            [
                1536,
                1604
            ],
            [
                1604,
                1656
            ],
            [
                1657,
                1661
            ],
            [
                1667,
                1674
            ],
            [
                1675,
                1716
            ],
            [
                1716,
                1719
            ],
            [
                1720,
                1735
            ],
            [
                1736,
                1764
            ],
            [
                1765,
                1836
            ],
            [
                1837,
                1859
            ],
            [
                1859,
                1861
            ],
            [
                1861,
                1942
            ],
            [
                1942,
                1944
            ],
            [
                1944,
                1947
            ],
            [
                1954,
                1957
            ],
            [
                1962,
                1982
            ],
            [
                1989,
                1991
            ],
            [
                1991,
                2051
            ],
            [
                2052,
                2076
            ],
            [
                2077,
                2138
            ],
            [
                2139,
                2145
            ],
            [
                2146,
                2158
            ],
            [
                2159,
                2176
            ],
            [
                2177,
                2206
            ],
            [
                2215,
                2235
            ],
            [
                2236,
                2245
            ],
            [
                2248,
                2266
            ],
            [
                2266,
                2347
            ],
            [
                2347,
                2349
            ],
            [
                2349,
                2350
            ],
            [
                2350,
                2373
            ],
            [
                2373,
                2376
            ],
            [
                2376,
                2414
            ],
            [
                2414,
                2422
            ],
            [
                2423,
                2425
            ],
            [
                2430,
                2434
            ],
            [
                2435,
                2443
            ],
            [
                2443,
                2448
            ],
            [
                2450,
                2520
            ],
            [
                2520,
                2522
            ],
            [
                2522,
                2633
            ],
            [
                2633,
                2691
            ],
            [
                2692,
                2701
            ],
            [
                2721,
                2770
            ],
            [
                2770,
                2822
            ],
            [
                2823,
                2862
            ],
            [
                2872,
                2874
            ],
            [
                2874,
                2892
            ],
            [
                2893,
                2900
            ],
            [
                2901,
                2949
            ],
            [
                2949,
                2960
            ],
            [
                2961,
                3038
            ],
            [
                3038,
                3039
            ],
            [
                3045,
                3048
            ],
            [
                3057,
                3089
            ],
            [
                3090,
                3121
            ],
            [
                3121,
                3122
            ],
            [
                3123,
                3128
            ],
            [
                3129,
                3130
            ],
            [
                3141,
                3143
            ],
            [
                3144,
                3147
            ],
            [
                3148,
                3151
            ],
            [
                3152,
                3156
            ],
            [
                3157,
                3243
            ],
            [
                3244,
                3245
            ],
            [
                3246,
                3280
            ],
            [
                3287,
                3290
            ],
            [
                3298,
                3313
            ],
            [
                3313,
                3344
            ],
            [
                3358,
                3359
            ],
            [
                3359,
                3366
            ],
            [
                3372,
                3374
            ],
            [
                3374,
                3421
            ],
            [
                3422,
                3447
            ],
            [
                3448,
                3451
            ],
            [
                3452,
                3455
            ],
            [
                3455,
                3456
            ],
            [
                3457,
                3460
            ],
            [
                3466,
                3555
            ],
            [
                3555,
                3667
            ],
            [
                3668,
                3681
            ],
            [
                3681,
                3683
            ],
            [
                3690,
                3693
            ],
            [
                3704,
                3739
            ],
            [
                3739,
                3740
            ],
            [
                3741,
                3768
            ],
            [
                3770,
                3847
            ],
            [
                3847,
                3849
            ],
            [
                3849,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3969
            ],
            [
                3969,
                3972
            ],
            [
                3972,
                4011
            ],
            [
                4011,
                4029
            ],
            [
                4031,
                4106
            ],
            [
                4107,
                4123
            ],
            [
                4123,
                4142
            ],
            [
                4143,
                4161
            ],
            [
                4161,
                4174
            ],
            [
                4179,
                4183
            ],
            [
                4184,
                4229
            ],
            [
                4230,
                4257
            ],
            [
                4259,
                4304
            ],
            [
                4304,
                4306
            ],
            [
                4306,
                4355
            ],
            [
                4364,
                4372
            ],
            [
                4372,
                4405
            ],
            [
                4405,
                4428
            ],
            [
                4429,
                4481
            ],
            [
                4481,
                4587
            ],
            [
                4587,
                4622
            ],
            [
                4630,
                4720
            ],
            [
                4720,
                4838
            ],
            [
                4838,
                4840
            ],
            [
                4840,
                4897
            ],
            [
                4898,
                4938
            ],
            [
                4938,
                4959
            ],
            [
                4960,
                4966
            ],
            [
                4967,
                4971
            ],
            [
                4972,
                4974
            ],
            [
                4987,
                5000
            ],
            [
                5000,
                5068
            ],
            [
                5068,
                5114
            ],
            [
                5114,
                5147
            ],
            [
                5147,
                5190
            ],
            [
                5190,
                5285
            ],
            [
                5292,
                5294
            ],
            [
                5294,
                5331
            ],
            [
                5334,
                5429
            ],
            [
                5429,
                5448
            ],
            [
                5458,
                5513
            ],
            [
                5513,
                5515
            ],
            [
                5515,
                5604
            ],
            [
                5604,
                5624
            ],
            [
                5634,
                5636
            ],
            [
                5636,
                5685
            ],
            [
                5685,
                5686
            ],
            [
                5686,
                5697
            ],
            [
                5697,
                5766
            ],
            [
                5766,
                5808
            ],
            [
                5808,
                5824
            ],
            [
                5827,
                5851
            ],
            [
                5861,
                5875
            ],
            [
                5878,
                5886
            ],
            [
                5887,
                5899
            ],
            [
                5900,
                5905
            ],
            [
                5906,
                5947
            ],
            [
                5947,
                5950
            ],
            [
                5951,
                5953
            ],
            [
                5954,
                5978
            ],
            [
                5978,
                6030
            ],
            [
                6030,
                6032
            ],
            [
                6032,
                6064
            ],
            [
                6067,
                6135
            ],
            [
                6135,
                6175
            ],
            [
                6175,
                6195
            ],
            [
                6196,
                6201
            ],
            [
                6202,
                6251
            ],
            [
                6256,
                6285
            ],
            [
                6286,
                6291
            ],
            [
                6293,
                6315
            ],
            [
                6315,
                6317
            ],
            [
                6317,
                6330
            ],
            [
                6331,
                6362
            ],
            [
                6377,
                6395
            ],
            [
                6395,
                6422
            ],
            [
                6427,
                6448
            ],
            [
                6465,
                6474
            ],
            [
                6474,
                6475
            ],
            [
                6487,
                6511
            ],
            [
                6524,
                6538
            ],
            [
                6545,
                6564
            ],
            [
                6564,
                6566
            ],
            [
                6575,
                6580
            ],
            [
                6592,
                6606
            ],
            [
                6606,
                6633
            ],
            [
                6634,
                6637
            ],
            [
                6642,
                6650
            ],
            [
                6663,
                6707
            ],
            [
                6707,
                6928
            ],
            [
                6929,
                6949
            ],
            [
                6954,
                6957
            ],
            [
                6963,
                6973
            ],
            [
                6973,
                6974
            ],
            [
                6975,
                6978
            ],
            [
                6995,
                7000
            ],
            [
                7001,
                7003
            ],
            [
                7004,
                7015
            ],
            [
                7016,
                7072
            ],
            [
                7073,
                7076
            ],
            [
                7081,
                7084
            ],
            [
                7085,
                7089
            ],
            [
                7090,
                7093
            ],
            [
                7097,
                7105
            ],
            [
                7106,
                7109
            ],
            [
                7110,
                7117
            ],
            [
                7118,
                7122
            ],
            [
                7130,
                7131
            ],
            [
                7132,
                7145
            ],
            [
                7153,
                7175
            ],
            [
                7175,
                7323
            ],
            [
                7323,
                7351
            ],
            [
                7357,
                7378
            ],
            [
                7391,
                7401
            ],
            [
                7401,
                7429
            ],
            [
                7429,
                7430
            ],
            [
                7434,
                7465
            ],
            [
                7469,
                7508
            ],
            [
                7509,
                7536
            ],
            [
                7546,
                7549
            ],
            [
                7550,
                7556
            ],
            [
                7557,
                7560
            ],
            [
                7561,
                7570
            ],
            [
                7583,
                7586
            ],
            [
                7587,
                7597
            ],
            [
                7597,
                7599
            ],
            [
                7599,
                7645
            ],
            [
                7646,
                7685
            ],
            [
                7685,
                7686
            ],
            [
                7687,
                7689
            ],
            [
                7690,
                7694
            ],
            [
                7695,
                7699
            ],
            [
                7719,
                7765
            ],
            [
                7765,
                7860
            ],
            [
                7860,
                7916
            ],
            [
                7917,
                7920
            ],
            [
                7921,
                7929
            ],
            [
                7930,
                7974
            ],
            [
                7975,
                7986
            ],
            [
                7987,
                7988
            ],
            [
                7989,
                8001
            ],
            [
                8018,
                8037
            ],
            [
                8037,
                8038
            ],
            [
                8039,
                8054
            ],
            [
                8055,
                8066
            ],
            [
                8066,
                8068
            ],
            [
                8068,
                8124
            ],
            [
                8125,
                8127
            ],
            [
                8128,
                8135
            ],
            [
                8136,
                8139
            ],
            [
                8140,
                8166
            ],
            [
                8167,
                8184
            ],
            [
                8185,
                8239
            ],
            [
                8249,
                8266
            ],
            [
                8267,
                8293
            ],
            [
                8298,
                8405
            ],
            [
                8405,
                8407
            ],
            [
                8416,
                8419
            ],
            [
                8420,
                8482
            ],
            [
                8483,
                8502
            ],
            [
                8508,
                8518
            ],
            [
                8529,
                8534
            ],
            [
                8535,
                8655
            ],
            [
                8656,
                8664
            ],
            [
                8674,
                8677
            ],
            [
                8677,
                8679
            ],
            [
                8679,
                8707
            ],
            [
                8708,
                8711
            ],
            [
                8711,
                8762
            ],
            [
                8762,
                8794
            ],
            [
                8795,
                8800
            ],
            [
                8801,
                8809
            ],
            [
                8811,
                8816
            ],
            [
                8817,
                8880
            ],
            [
                8898,
                8900
            ],
            [
                8901,
                8916
            ],
            [
                8916,
                8917
            ],
            [
                8918,
                8921
            ],
            [
                8941,
                8950
            ],
            [
                8951,
                9015
            ],
            [
                9016,
                9024
            ],
            [
                9026,
                9120
            ],
            [
                9120,
                9177
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                0
            ],
            [
                0,
                203
            ],
            [
                203,
                327
            ],
            [
                327,
                408
            ],
            [
                408,
                547
            ],
            [
                547,
                639
            ],
            [
                639,
                749
            ],
            [
                749,
                894
            ],
            [
                894,
                935
            ],
            [
                935,
                1162
            ],
            [
                1162,
                1361
            ],
            [
                1361,
                1415
            ],
            [
                1415,
                1494
            ],
            [
                1494,
                1494
            ],
            [
                1494,
                1494
            ],
            [
                1494,
                1494
            ],
            [
                1494,
                1604
            ],
            [
                1604,
                1716
            ],
            [
                1716,
                1716
            ],
            [
                1716,
                1716
            ],
            [
                1716,
                1861
            ],
            [
                1861,
                1861
            ],
            [
                1861,
                1944
            ],
            [
                1944,
                1991
            ],
            [
                1991,
                2206
            ],
            [
                2206,
                2266
            ],
            [
                2266,
                2349
            ],
            [
                2349,
                2349
            ],
            [
                2349,
                2376
            ],
            [
                2376,
                2414
            ],
            [
                2414,
                2522
            ],
            [
                2522,
                2633
            ],
            [
                2633,
                2770
            ],
            [
                2770,
                2874
            ],
            [
                2874,
                2949
            ],
            [
                2949,
                3123
            ],
            [
                3123,
                3123
            ],
            [
                3123,
                3123
            ],
            [
                3123,
                3123
            ],
            [
                3123,
                3374
            ],
            [
                3374,
                3555
            ],
            [
                3555,
                3683
            ],
            [
                3683,
                3849
            ],
            [
                3849,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3972
            ],
            [
                3972,
                4030
            ],
            [
                4030,
                4123
            ],
            [
                4123,
                4161
            ],
            [
                4161,
                4259
            ],
            [
                4259,
                4259
            ],
            [
                4259,
                4259
            ],
            [
                4259,
                4259
            ],
            [
                4259,
                4259
            ],
            [
                4259,
                4306
            ],
            [
                4306,
                4372
            ],
            [
                4372,
                4405
            ],
            [
                4405,
                4481
            ],
            [
                4481,
                4587
            ],
            [
                4587,
                4720
            ],
            [
                4720,
                4840
            ],
            [
                4840,
                4898
            ],
            [
                4898,
                4898
            ],
            [
                4898,
                4938
            ],
            [
                4938,
                5000
            ],
            [
                5000,
                5068
            ],
            [
                5068,
                5114
            ],
            [
                5114,
                5147
            ],
            [
                5147,
                5190
            ],
            [
                5190,
                5294
            ],
            [
                5294,
                5334
            ],
            [
                5334,
                5334
            ],
            [
                5334,
                5334
            ],
            [
                5334,
                5334
            ],
            [
                5334,
                5429
            ],
            [
                5429,
                5515
            ],
            [
                5515,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5604
            ],
            [
                5604,
                5636
            ],
            [
                5636,
                5685
            ],
            [
                5685,
                5697
            ],
            [
                5697,
                5766
            ],
            [
                5766,
                5808
            ],
            [
                5808,
                5808
            ],
            [
                5808,
                5808
            ],
            [
                5808,
                5825
            ],
            [
                5825,
                5947
            ],
            [
                5947,
                6032
            ],
            [
                6032,
                6067
            ],
            [
                6067,
                6067
            ],
            [
                6067,
                6135
            ],
            [
                6135,
                6175
            ],
            [
                6175,
                6317
            ],
            [
                6317,
                6395
            ],
            [
                6395,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6465
            ],
            [
                6465,
                6606
            ],
            [
                6606,
                6707
            ],
            [
                6707,
                7016
            ],
            [
                7016,
                7175
            ],
            [
                7175,
                7323
            ],
            [
                7323,
                7536
            ],
            [
                7536,
                7599
            ],
            [
                7599,
                7765
            ],
            [
                7765,
                7860
            ],
            [
                7860,
                8039
            ],
            [
                8039,
                8068
            ],
            [
                8068,
                8267
            ],
            [
                8267,
                8405
            ],
            [
                8405,
                8679
            ],
            [
                8679,
                8762
            ],
            [
                8762,
                8880
            ],
            [
                8880,
                9026
            ],
            [
                9026,
                9120
            ],
            [
                9120,
                9120
            ],
            [
                9120,
                9177
            ]
        ]
    }
}