{
    "original": {
        "text": "BEFORE THE CURTAIN\nAs the manager of the Performance sits before the curtain on the boards and looks into the Fair, a feeling of profound melancholy comes over him in his survey of the bustling place. There is a great quantity of eating and drinking, making love and jilting, laughing and the contrary, smoking, cheating, fighting, dancing and fiddling; there are bullies pushing about, bucks ogling the women, knaves picking pockets, policemen on the look-out, quacks (OTHER quacks, plague take them!) bawling in front of their booths, and yokels looking up at the tinselled dancers and poor old rouged tumblers, while the light-fingered folk are operating upon their pockets behind. Yes, this is VANITY FAIR; not a moral place certainly; nor a merry one, though very noisy. Look at the faces of the actors and buffoons when they come off from their business; and Tom Fool washing the paint off his cheeks before he sits down to dinner with his wife and the little Jack Puddings behind the canvas. The curtain will be up presently, and he will be turning over head and heels, and crying, \"How are you?\"\nA man with a reflective turn of mind, walking through an exhibition of this sort, will not be oppressed, I take it, by his own or other people's hilarity. An episode of humour or kindness touches and amuses him here and there--a pretty child looking at a gingerbread stall; a pretty girl blushing whilst her lover talks to her and chooses her fairing; poor Tom Fool, yonder behind the waggon, mumbling his bone with the honest family which lives by his tumbling; but the general impression is one more melancholy than mirthful. When you come home you sit down in a sober, contemplative, not uncharitable frame of mind, and apply yourself to your books or your business.\nI have no other moral than this to tag to the present story of \"Vanity Fair.\" Some people consider Fairs immoral altogether, and eschew such, with their servants and families: very likely they are right. But persons who think otherwise, and are of a lazy, or a benevolent, or a sarcastic mood, may perhaps like to step in for half an hour, and look at the performances. There are scenes of all sorts; some dreadful combats, some grand and lofty horse-riding, some scenes of high life, and some of very middling indeed; some love-making for the sentimental, and some light comic business; the whole accompanied by appropriate scenery and brilliantly illuminated with the Author's own candles.\nWhat more has the Manager of the Performance to say?--To acknowledge the kindness with which it has been received in all the principal towns of England through which the Show has passed, and where it has been most favourably noticed by the respected conductors of the public Press, and by the Nobility and Gentry. He is proud to think that his Puppets have given satisfaction to the very best company in this empire. The famous little Becky Puppet has been pronounced to be uncommonly flexible in the joints, and lively on the wire; the Amelia Doll, though it has had a smaller circle of admirers, has yet been carved and dressed with the greatest care by the artist; the Dobbin Figure, though apparently clumsy, yet dances in a very amusing and natural manner; the Little Boys' Dance has been liked by some; and please to remark the richly dressed figure of the Wicked Nobleman, on which no expense has been spared, and which Old Nick will fetch away at the end of this singular performance.\nAnd with this, and a profound bow to his patrons, the Manager retires, and the curtain rises.\nLONDON, June 28, 1848",
        "paragraph_chars": [
            [
                0,
                19
            ],
            [
                19,
                1104
            ],
            [
                1104,
                1774
            ],
            [
                1774,
                2466
            ],
            [
                2466,
                3459
            ],
            [
                3459,
                3553
            ],
            [
                3553,
                3574
            ]
        ],
        "segment_chars": [
            [
                0,
                19
            ],
            [
                19,
                201
            ],
            [
                201,
                503
            ],
            [
                503,
                685
            ],
            [
                685,
                776
            ],
            [
                776,
                999
            ],
            [
                999,
                1104
            ],
            [
                1104,
                1259
            ],
            [
                1259,
                1632
            ],
            [
                1632,
                1774
            ],
            [
                1774,
                1852
            ],
            [
                1852,
                1978
            ],
            [
                1978,
                2144
            ],
            [
                2144,
                2466
            ],
            [
                2466,
                2780
            ],
            [
                2780,
                2883
            ],
            [
                2883,
                3459
            ],
            [
                3459,
                3553
            ],
            [
                3553,
                3574
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                19,
                68
            ],
            [
                69,
                76
            ],
            [
                91,
                94
            ],
            [
                181,
                193
            ],
            [
                110,
                163
            ],
            [
                199,
                201
            ],
            [
                201,
                217
            ],
            [
                227,
                284
            ],
            [
                301,
                468
            ],
            [
                503,
                510
            ],
            [
                529,
                587
            ],
            [
                604,
                685
            ],
            [
                685,
                728
            ],
            [
                740,
                775
            ],
            [
                1104,
                1105
            ],
            [
                1106,
                1109
            ],
            [
                1140,
                1157
            ],
            [
                1184,
                1194
            ],
            [
                1249,
                1259
            ],
            [
                1259,
                1299
            ],
            [
                1311,
                1329
            ],
            [
                1331,
                1332
            ],
            [
                1340,
                1430
            ],
            [
                1565,
                1596
            ],
            [
                1601,
                1631
            ],
            [
                1774,
                1819
            ],
            [
                1828,
                1852
            ],
            [
                1852,
                1902
            ],
            [
                1950,
                1978
            ],
            [
                1978,
                2009
            ],
            [
                2068,
                2144
            ],
            [
                2144,
                2208
            ],
            [
                2219,
                2284
            ],
            [
                2291,
                2466
            ],
            [
                2466,
                2491
            ],
            [
                2511,
                2518
            ],
            [
                2520,
                2558
            ],
            [
                2632,
                2640
            ],
            [
                2562,
                2582
            ],
            [
                2610,
                2617
            ],
            [
                2778,
                2780
            ],
            [
                2780,
                2848
            ],
            [
                2854,
                2883
            ],
            [
                2883,
                2959
            ],
            [
                2975,
                2985
            ],
            [
                2997,
                3029
            ],
            [
                3034,
                3067
            ],
            [
                3072,
                3083
            ],
            [
                3096,
                3118
            ],
            [
                3132,
                3207
            ],
            [
                3220,
                3226
            ],
            [
                3273,
                3285
            ],
            [
                3289,
                3431
            ],
            [
                2963,
                2966
            ],
            [
                3446,
                3459
            ],
            [
                3459,
                3479
            ],
            [
                3489,
                3552
            ]
        ],
        "row_chars": [
            [
                0,
                19
            ],
            [
                19,
                201
            ],
            [
                201,
                685
            ],
            [
                685,
                776
            ],
            [
                776,
                999
            ],
            [
                999,
                1104
            ],
            [
                1104,
                1259
            ],
            [
                1259,
                1632
            ],
            [
                1632,
                1774
            ],
            [
                1774,
                1852
            ],
            [
                1852,
                1978
            ],
            [
                1978,
                2144
            ],
            [
                2144,
                2466
            ],
            [
                2466,
                2780
            ],
            [
                2780,
                2883
            ],
            [
                2883,
                3459
            ],
            [
                3459,
                3553
            ],
            [
                3553,
                3574
            ]
        ]
    },
    "abridged": {
        "text": "Before the Curtain\nAs the manager of the Performance sits before the theatre curtain and surveys the bustling Fair, a feeling of profound melancholy comes over him. There is a great deal of eating and drinking, making love and jilting, laughing, smoking, cheating, fighting, dancing and fiddling; there are bullies pushing about, bucks ogling the women, knaves picking pockets, policemen on the look-out, quacks bawling at booths, and yokels looking up at the tinselled dancers and tumblers, while the light-fingered folk are operating upon their pockets behind. Yes, this is VANITY FAIR; not a moral place, nor a merry one, though very noisy.\nA thoughtful man, walking through the fair, will not see much hilarity. An episode of humour or kindness touches him here and there - a child looking at a gingerbread stall; a pretty girl blushing whilst her lover talks to her; but the general impression is more melancholy than mirthful.\nI have no other moral than this to tag to the story of \"Vanity Fair.\" Some people consider Fairs immoral altogether, and very likely they are right. But persons who think otherwise may perhaps like to step in for half an hour, and look at the performances. There are scenes of all sorts; some dreadful combats, some grand horse-riding, some scenes of high life, and some of very middling; some love-making for the sentimental, and some light comic business; the whole accompanied by appropriate scenery and brilliantly illuminated with the Author's own candles.\nWhat more has the Manager to say? - To acknowledge the kindness with which the Show has been received in England. He is proud to think that his Puppets have given satisfaction to the best company in this empire. The famous little Becky Puppet has been pronounced to be uncommonly flexible and lively; the Amelia Doll, though it has a smaller circle of admirers, has been carved with the greatest care; the Dobbin Figure, though apparently clumsy, yet dances in a very amusing manner; and please remark the richly dressed figure of the Wicked Nobleman, on which no expense has been spared, and which Old Nick will fetch away at the end of the performance.\nAnd with this, and a bow to his patrons, the Manager retires, and the curtain rises.",
        "paragraph_chars": [
            [
                0,
                19
            ],
            [
                19,
                644
            ],
            [
                644,
                933
            ],
            [
                933,
                1495
            ],
            [
                1495,
                2150
            ],
            [
                2150,
                2234
            ]
        ],
        "segment_chars": [
            [
                0,
                19
            ],
            [
                19,
                165
            ],
            [
                165,
                563
            ],
            [
                563,
                644
            ],
            [
                644,
                716
            ],
            [
                716,
                933
            ],
            [
                933,
                1003
            ],
            [
                1003,
                1082
            ],
            [
                1082,
                1190
            ],
            [
                1190,
                1495
            ],
            [
                1495,
                1529
            ],
            [
                1529,
                1609
            ],
            [
                1609,
                1707
            ],
            [
                1707,
                2150
            ],
            [
                2150,
                2234
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                19,
                68
            ],
            [
                77,
                84
            ],
            [
                85,
                88
            ],
            [
                97,
                109
            ],
            [
                110,
                163
            ],
            [
                163,
                165
            ],
            [
                165,
                181
            ],
            [
                187,
                244
            ],
            [
                244,
                411
            ],
            [
                412,
                419
            ],
            [
                423,
                481
            ],
            [
                482,
                563
            ],
            [
                563,
                606
            ],
            [
                608,
                643
            ],
            [
                644,
                645
            ],
            [
                657,
                660
            ],
            [
                660,
                677
            ],
            [
                686,
                696
            ],
            [
                706,
                716
            ],
            [
                716,
                756
            ],
            [
                757,
                775
            ],
            [
                778,
                779
            ],
            [
                780,
                870
            ],
            [
                870,
                901
            ],
            [
                902,
                932
            ],
            [
                933,
                978
            ],
            [
                979,
                1003
            ],
            [
                1003,
                1053
            ],
            [
                1054,
                1082
            ],
            [
                1082,
                1113
            ],
            [
                1114,
                1190
            ],
            [
                1190,
                1254
            ],
            [
                1255,
                1320
            ],
            [
                1320,
                1495
            ],
            [
                1495,
                1520
            ],
            [
                1521,
                1528
            ],
            [
                1531,
                1569
            ],
            [
                1570,
                1578
            ],
            [
                1579,
                1599
            ],
            [
                1600,
                1607
            ],
            [
                1607,
                1609
            ],
            [
                1609,
                1677
            ],
            [
                1678,
                1707
            ],
            [
                1707,
                1783
            ],
            [
                1784,
                1794
            ],
            [
                1794,
                1826
            ],
            [
                1827,
                1860
            ],
            [
                1861,
                1872
            ],
            [
                1873,
                1895
            ],
            [
                1895,
                1970
            ],
            [
                1971,
                1977
            ],
            [
                1977,
                1989
            ],
            [
                1990,
                2132
            ],
            [
                2133,
                2136
            ],
            [
                2137,
                2150
            ],
            [
                2150,
                2170
            ],
            [
                2171,
                2234
            ]
        ],
        "row_chars": [
            [
                0,
                19
            ],
            [
                19,
                165
            ],
            [
                165,
                563
            ],
            [
                563,
                644
            ],
            [
                644,
                644
            ],
            [
                644,
                644
            ],
            [
                644,
                716
            ],
            [
                716,
                933
            ],
            [
                933,
                933
            ],
            [
                933,
                1003
            ],
            [
                1003,
                1082
            ],
            [
                1082,
                1190
            ],
            [
                1190,
                1495
            ],
            [
                1495,
                1609
            ],
            [
                1609,
                1707
            ],
            [
                1707,
                2150
            ],
            [
                2150,
                2234
            ],
            [
                2234,
                2234
            ]
        ]
    }
}