{
    "original": {
        "text": "While the present century was in its teens, and on one sunshiny morning in June, there drove up to the great iron gate of Miss Pinkerton's academy for young ladies, on Chiswick Mall, a large family coach, with two fat horses in blazing harness, driven by a fat coachman in a three-cornered hat and wig, at the rate of four miles an hour. A black servant, who reposed on the box beside the fat coachman, uncurled his bandy legs as soon as the equipage drew up opposite Miss Pinkerton's shining brass plate, and as he pulled the bell at least a score of young heads were seen peering out of the narrow windows of the stately old brick house. Nay, the acute observer might have recognized the little red nose of good-natured Miss Jemima Pinkerton herself, rising over some geranium pots in the window of that lady's own drawing-room.\n\"It is Mrs. Sedley's coach, sister,\" said Miss Jemima. \"Sambo, the black servant, has just rung the bell; and the coachman has a new red waistcoat.\"\n\"Have you completed all the necessary preparations incident to Miss Sedley's departure, Miss Jemima?\" asked Miss Pinkerton herself, that majestic lady; the Semiramis of Hammersmith, the friend of Doctor Johnson, the correspondent of Mrs. Chapone herself.\n\"The girls were up at four this morning, packing her trunks, sister,\" replied Miss Jemima; \"we have made her a bow-pot.\"\n\"Say a bouquet, sister Jemima, 'tis more genteel.\"\n\"Well, a booky as big almost as a haystack; I have put up two bottles of the gillyflower water for Mrs. Sedley, and the receipt for making it, in Amelia's box.\"\n\"And I trust, Miss Jemima, you have made a copy of Miss Sedley's account. This is it, is it? Very good--ninety-three pounds, four shillings. Be kind enough to address it to John Sedley, Esquire, and to seal this billet which I have written to his lady.\"\nIn Miss Jemima's eyes an autograph letter of her sister, Miss Pinkerton, was an object of as deep veneration as would have been a letter from a sovereign. Only when her pupils quitted the establishment, or when they were about to be married, and once, when poor Miss Birch died of the scarlet fever, was Miss Pinkerton known to write personally to the parents of her pupils; and it was Jemima's opinion that if anything could console Mrs. Birch for her daughter's loss, it would be that pious and eloquent composition in which Miss Pinkerton announced the event.\nIn the present instance Miss Pinkerton's \"billet\" was to the following effect:--\nThe Mall, Chiswick, June 15, 18\nMADAM,--After her six years' residence at the Mall, I have the honour and happiness of presenting Miss Amelia Sedley to her parents, as a young lady not unworthy to occupy a fitting position in their polished and refined circle. Those virtues which characterize the young English gentlewoman, those accomplishments which become her birth and station, will not be found wanting in the amiable Miss Sedley, whose INDUSTRY and OBEDIENCE have endeared her to her instructors, and whose delightful sweetness of temper has charmed her AGED and her YOUTHFUL companions.\nIn music, in dancing, in orthography, in every variety of embroidery and needlework, she will be found to have realized her friends' fondest wishes. In geography there is still much to be desired; and a careful and undeviating use of the backboard, for four hours daily during the next three years, is recommended as necessary to the acquirement of that dignified DEPORTMENT AND CARRIAGE, so requisite for every young lady of FASHION.\nIn the principles of religion and morality, Miss Sedley will be found worthy of an establishment which has been honoured by the presence of THE GREAT LEXICOGRAPHER, and the patronage of the admirable Mrs. Chapone. In leaving the Mall, Miss Amelia carries with her the hearts of her companions, and the affectionate regards of her mistress, who has the honour to subscribe herself,\nMadam, Your most obliged humble servant, BARBARA PINKERTON\nP.S.--Miss Sharp accompanies Miss Sedley. It is particularly requested that Miss Sharp's stay in Russell Square may not exceed ten days. The family of distinction with whom she is engaged, desire to avail themselves of her services as soon as possible.\nThis letter completed, Miss Pinkerton proceeded to write her own name, and Miss Sedley's, in the fly-leaf of a Johnson's Dictionary--the interesting work which she invariably presented to her scholars, on their departure from the Mall. On the cover was inserted a copy of \"Lines addressed to a young lady on quitting Miss Pinkerton's school, at the Mall; by the late revered Doctor Samuel Johnson.\" In fact, the Lexicographer's name was always on the lips of this majestic woman, and a visit he had paid to her was the cause of her reputation and her fortune.\nBeing commanded by her elder sister to get \"the Dictionary\" from the cupboard, Miss Jemima had extracted two copies of the book from the receptacle in question. When Miss Pinkerton had finished the inscription in the first, Jemima, with rather a dubious and timid air, handed her the second.\n\"For whom is this, Miss Jemima?\" said Miss Pinkerton, with awful coldness.\n\"For Becky Sharp,\" answered Jemima, trembling very much, and blushing over her withered face and neck, as she turned her back on her sister. \"For Becky Sharp: she's going too.\"\n\"MISS JEMIMA!\" exclaimed Miss Pinkerton, in the largest capitals. \"Are you in your senses? Replace the Dixonary in the closet, and never venture to take such a liberty in future.\"\n\"Well, sister, it's only two-and-ninepence, and poor Becky will be miserable if she don't get one.\"\n\"Send Miss Sedley instantly to me,\" said Miss Pinkerton. And so venturing not to say another word, poor Jemima trotted off, exceedingly flurried and nervous.\nMiss Sedley's papa was a merchant in London, and a man of some wealth; whereas Miss Sharp was an articled pupil, for whom Miss Pinkerton had done, as she thought, quite enough, without conferring upon her at parting the high honour of the Dixonary.\nAlthough schoolmistresses' letters are to be trusted no more nor less than churchyard epitaphs; yet, as it sometimes happens that a person departs this life who is really deserving of all the praises the stone cutter carves over his bones; who IS a good Christian, a good parent, child, wife, or husband; who actually DOES leave a disconsolate family to mourn his loss; so in academies of the male and female sex it occurs every now and then that the pupil is fully worthy of the praises bestowed by the disinterested instructor. Now, Miss Amelia Sedley was a young lady of this singular species; and deserved not only all that Miss Pinkerton said in her praise, but had many charming qualities which that pompous old Minerva of a woman could not see, from the differences of rank and age between her pupil and herself.\nFor she could not only sing like a lark, or a Mrs. Billington, and dance like Hillisberg or Parisot; and embroider beautifully; and spell as well as a Dixonary itself; but she had such a kindly, smiling, tender, gentle, generous heart of her own, as won the love of everybody who came near her, from Minerva herself down to the poor girl in the scullery, and the one-eyed tart-woman's daughter, who was permitted to vend her wares once a week to the young ladies in the Mall. She had twelve intimate and bosom friends out of the twenty-four young ladies. Even envious Miss Briggs never spoke ill of her; high and mighty Miss Saltire (Lord Dexter's granddaughter) allowed that her figure was genteel; and as for Miss Swartz, the rich woolly-haired mulatto from St. Kitt's, on the day Amelia went away, she was in such a passion of tears that they were obliged to send for Dr. Floss, and half tipsify her with salvolatile. Miss Pinkerton's attachment was, as may be supposed from the high position and eminent virtues of that lady, calm and dignified; but Miss Jemima had already whimpered several times at the idea of Amelia's departure; and, but for fear of her sister, would have gone off in downright hysterics, like the heiress (who paid double) of St. Kitt's. Such luxury of grief, however, is only allowed to parlour-boarders. Honest Jemima had all the bills, and the washing, and the mending, and the puddings, and the plate and crockery, and the servants to superintend. But why speak about her? It is probable that we shall not hear of her again from this moment to the end of time, and that when the great filigree iron gates are once closed on her, she and her awful sister will never issue therefrom into this little world of history.\nBut as we are to see a great deal of Amelia, there is no harm in saying, at the outset of our acquaintance, that she was a dear little creature; and a great mercy it is, both in life and in novels, which (and the latter especially) abound in villains of the most sombre sort, that we are to have for a constant companion so guileless and good-natured a person. As she is not a heroine, there is no need to describe her person; indeed I am afraid that her nose was rather short than otherwise, and her cheeks a great deal too round and red for a heroine; but her face blushed with rosy health, and her lips with the freshest of smiles, and she had a pair of eyes which sparkled with the brightest and honestest good-humour, except indeed when they filled with tears, and that was a great deal too often; for the silly thing would cry over a dead canary-bird; or over a mouse, that the cat haply had seized upon; or over the end of a novel, were it ever so stupid; and as for saying an unkind word to her, were any persons hard-hearted enough to do so--why, so much the worse for them. Even Miss Pinkerton, that austere and godlike woman, ceased scolding her after the first time, and though she no more comprehended sensibility than she did Algebra, gave all masters and teachers particular orders to treat Miss Sedley with the utmost gentleness, as harsh treatment was injurious to her.\nSo that when the day of departure came, between her two customs of laughing and crying, Miss Sedley was greatly puzzled how to act. She was glad to go home, and yet most woefully sad at leaving school. For three days before, little Laura Martin, the orphan, followed her about like a little dog. She had to make and receive at least fourteen presents--to make fourteen solemn promises of writing every week: \"Send my letters under cover to my grandpapa, the Earl of Dexter,\" said Miss Saltire (who, by the way, was rather shabby). \"Never mind the postage, but write every day, you dear darling,\" said the impetuous and woolly-headed, but generous and affectionate Miss Swartz; and the orphan little Laura Martin (who was just in round-hand), took her friend's hand and said, looking up in her face wistfully, \"Amelia, when I write to you I shall call you Mamma.\" All which details, I have no doubt, JONES, who reads this book at his Club, will pronounce to be excessively foolish, trivial, twaddling, and ultra-sentimental. Yes; I can see Jones at this minute (rather flushed with his joint of mutton and half pint of wine), taking out his pencil and scoring under the words \"foolish, twaddling,\" &c., and adding to them his own remark of \"QUITE TRUE.\" Well, he is a lofty man of genius, and admires the great and heroic in life and novels; and so had better take warning and go elsewhere.\nWell, then. The flowers, and the presents, and the trunks, and bonnet-boxes of Miss Sedley having been arranged by Mr. Sambo in the carriage, together with a very small and weather-beaten old cow's-skin trunk with Miss Sharp's card neatly nailed upon it, which was delivered by Sambo with a grin, and packed by the coachman with a corresponding sneer--the hour for parting came; and the grief of that moment was considerably lessened by the admirable discourse which Miss Pinkerton addressed to her pupil. Not that the parting speech caused Amelia to philosophise, or that it armed her in any way with a calmness, the result of argument; but it was intolerably dull, pompous, and tedious; and having the fear of her schoolmistress greatly before her eyes, Miss Sedley did not venture, in her presence, to give way to any ebullitions of private grief. A seed-cake and a bottle of wine were produced in the drawing-room, as on the solemn occasions of the visits of parents, and these refreshments being partaken of, Miss Sedley was at liberty to depart.\n\"You'll go in and say good-by to Miss Pinkerton, Becky!\" said Miss Jemima to a young lady of whom nobody took any notice, and who was coming downstairs with her own bandbox.\n\"I suppose I must,\" said Miss Sharp calmly, and much to the wonder of Miss Jemima; and the latter having knocked at the door, and receiving permission to come in, Miss Sharp advanced in a very unconcerned manner, and said in French, and with a perfect accent, \"Mademoiselle, je viens vous faire mes adieux.\"\nMiss Pinkerton did not understand French; she only directed those who did: but biting her lips and throwing up her venerable and Roman-nosed head (on the top of which figured a large and solemn turban), she said, \"Miss Sharp, I wish you a good morning.\" As the Hammersmith Semiramis spoke, she waved one hand, both by way of adieu, and to give Miss Sharp an opportunity of shaking one of the fingers of the hand which was left out for that purpose.\nMiss Sharp only folded her own hands with a very frigid smile and bow, and quite declined to accept the proffered honour; on which Semiramis tossed up her turban more indignantly than ever. In fact, it was a little battle between the young lady and the old one, and the latter was worsted. \"Heaven bless you, my child,\" said she, embracing Amelia, and scowling the while over the girl's shoulder at Miss Sharp. \"Come away, Becky,\" said Miss Jemima, pulling the young woman away in great alarm, and the drawing-room door closed upon them for ever.\nThen came the struggle and parting below. Words refuse to tell it. All the servants were there in the hall--all the dear friends--all the young ladies--the dancing-master who had just arrived; and there was such a scuffling, and hugging, and kissing, and crying, with the hysterical YOOPS of Miss Swartz, the parlour-boarder, from her room, as no pen can depict, and as the tender heart would fain pass over. The embracing was over; they parted--that is, Miss Sedley parted from her friends. Miss Sharp had demurely entered the carriage some minutes before. Nobody cried for leaving HER.\nSambo of the bandy legs slammed the carriage door on his young weeping mistress. He sprang up behind the carriage. \"Stop!\" cried Miss Jemima, rushing to the gate with a parcel.\n\"It's some sandwiches, my dear,\" said she to Amelia. \"You may be hungry, you know; and Becky, Becky Sharp, here's a book for you that my sister--that is, I--Johnson's Dixonary, you know; you mustn't leave us without that. Good-by. Drive on, coachman. God bless you!\"\nAnd the kind creature retreated into the garden, overcome with emotion.\nBut, lo! and just as the coach drove off, Miss Sharp put her pale face out of the window and actually flung the book back into the garden.\nThis almost caused Jemima to faint with terror. \"Well, I never\"--said she--\"what an audacious\"--Emotion prevented her from completing either sentence. The carriage rolled away; the great gates were closed; the bell rang for the dancing lesson. The world is before the two young ladies; and so, farewell to Chiswick Mall.",
        "paragraph_chars": [
            [
                0,
                831
            ],
            [
                831,
                980
            ],
            [
                980,
                1235
            ],
            [
                1235,
                1356
            ],
            [
                1356,
                1407
            ],
            [
                1407,
                1568
            ],
            [
                1568,
                1822
            ],
            [
                1822,
                2385
            ],
            [
                2385,
                2466
            ],
            [
                2466,
                2498
            ],
            [
                2498,
                3061
            ],
            [
                3061,
                3496
            ],
            [
                3496,
                3877
            ],
            [
                3877,
                3936
            ],
            [
                3936,
                4189
            ],
            [
                4189,
                4749
            ],
            [
                4749,
                5041
            ],
            [
                5041,
                5116
            ],
            [
                5116,
                5293
            ],
            [
                5293,
                5473
            ],
            [
                5473,
                5573
            ],
            [
                5573,
                5731
            ],
            [
                5731,
                5980
            ],
            [
                5980,
                6800
            ],
            [
                6800,
                8546
            ],
            [
                8546,
                9933
            ],
            [
                9933,
                11323
            ],
            [
                11323,
                12375
            ],
            [
                12375,
                12549
            ],
            [
                12549,
                12857
            ],
            [
                12857,
                13306
            ],
            [
                13306,
                13853
            ],
            [
                13853,
                14441
            ],
            [
                14441,
                14618
            ],
            [
                14618,
                14885
            ],
            [
                14885,
                14957
            ],
            [
                14957,
                15096
            ],
            [
                15096,
                15416
            ]
        ],
        "segment_chars": [
            [
                0,
                338
            ],
            [
                338,
                640
            ],
            [
                640,
                831
            ],
            [
                831,
                886
            ],
            [
                886,
                980
            ],
            [
                980,
                1082
            ],
            [
                1082,
                1235
            ],
            [
                1235,
                1356
            ],
            [
                1356,
                1407
            ],
            [
                1407,
                1568
            ],
            [
                1568,
                1642
            ],
            [
                1642,
                1661
            ],
            [
                1661,
                1709
            ],
            [
                1709,
                1822
            ],
            [
                1822,
                1977
            ],
            [
                1977,
                2385
            ],
            [
                2385,
                2466
            ],
            [
                2466,
                2498
            ],
            [
                2498,
                2727
            ],
            [
                2727,
                3061
            ],
            [
                3061,
                3210
            ],
            [
                3210,
                3496
            ],
            [
                3496,
                3710
            ],
            [
                3710,
                3877
            ],
            [
                3877,
                3936
            ],
            [
                3936,
                3978
            ],
            [
                3978,
                4073
            ],
            [
                4073,
                4189
            ],
            [
                4189,
                4425
            ],
            [
                4425,
                4588
            ],
            [
                4588,
                4749
            ],
            [
                4749,
                4910
            ],
            [
                4910,
                5041
            ],
            [
                5041,
                5074
            ],
            [
                5074,
                5116
            ],
            [
                5116,
                5257
            ],
            [
                5257,
                5293
            ],
            [
                5293,
                5308
            ],
            [
                5308,
                5359
            ],
            [
                5359,
                5384
            ],
            [
                5384,
                5473
            ],
            [
                5473,
                5573
            ],
            [
                5573,
                5630
            ],
            [
                5630,
                5731
            ],
            [
                5731,
                5980
            ],
            [
                5980,
                6510
            ],
            [
                6510,
                6800
            ],
            [
                6800,
                7276
            ],
            [
                7276,
                7355
            ],
            [
                7355,
                7721
            ],
            [
                7721,
                8064
            ],
            [
                8064,
                8132
            ],
            [
                8132,
                8278
            ],
            [
                8278,
                8303
            ],
            [
                8303,
                8546
            ],
            [
                8546,
                8907
            ],
            [
                8907,
                9630
            ],
            [
                9630,
                9933
            ],
            [
                9933,
                10065
            ],
            [
                10065,
                10135
            ],
            [
                10135,
                10229
            ],
            [
                10229,
                10464
            ],
            [
                10464,
                10796
            ],
            [
                10796,
                10957
            ],
            [
                10957,
                11186
            ],
            [
                11186,
                11323
            ],
            [
                11323,
                11335
            ],
            [
                11335,
                11829
            ],
            [
                11829,
                12174
            ],
            [
                12174,
                12375
            ],
            [
                12375,
                12432
            ],
            [
                12432,
                12549
            ],
            [
                12549,
                12857
            ],
            [
                12857,
                13111
            ],
            [
                13111,
                13306
            ],
            [
                13306,
                13496
            ],
            [
                13496,
                13596
            ],
            [
                13596,
                13717
            ],
            [
                13717,
                13853
            ],
            [
                13853,
                13895
            ],
            [
                13895,
                13920
            ],
            [
                13920,
                14262
            ],
            [
                14262,
                14345
            ],
            [
                14345,
                14411
            ],
            [
                14411,
                14441
            ],
            [
                14441,
                14522
            ],
            [
                14522,
                14556
            ],
            [
                14556,
                14564
            ],
            [
                14564,
                14618
            ],
            [
                14618,
                14671
            ],
            [
                14671,
                14840
            ],
            [
                14840,
                14849
            ],
            [
                14849,
                14869
            ],
            [
                14869,
                14885
            ],
            [
                14885,
                14957
            ],
            [
                14957,
                14966
            ],
            [
                14966,
                15096
            ],
            [
                15096,
                15144
            ],
            [
                15144,
                15247
            ],
            [
                15247,
                15340
            ],
            [
                15340,
                15416
            ]
        ],
        "overlap_chars": [
            [
                30,
                32
            ],
            [
                18,
                25
            ],
            [
                42,
                43
            ],
            [
                48,
                50
            ],
            [
                55,
                163
            ],
            [
                165,
                181
            ],
            [
                183,
                190
            ],
            [
                198,
                203
            ],
            [
                243,
                301
            ],
            [
                336,
                338
            ],
            [
                338,
                358
            ],
            [
                367,
                388
            ],
            [
                393,
                415
            ],
            [
                422,
                429
            ],
            [
                438,
                441
            ],
            [
                451,
                484
            ],
            [
                504,
                509
            ],
            [
                513,
                515
            ],
            [
                523,
                531
            ],
            [
                552,
                626
            ],
            [
                633,
                640
            ],
            [
                709,
                743
            ],
            [
                643,
                644
            ],
            [
                787,
                800
            ],
            [
                817,
                831
            ],
            [
                831,
                886
            ],
            [
                886,
                892
            ],
            [
                913,
                935
            ],
            [
                977,
                980
            ],
            [
                980,
                1082
            ],
            [
                1082,
                1102
            ],
            [
                1110,
                1131
            ],
            [
                1146,
                1161
            ],
            [
                1166,
                1190
            ],
            [
                1233,
                1235
            ],
            [
                1235,
                1324
            ],
            [
                1326,
                1345
            ],
            [
                1353,
                1356
            ],
            [
                1356,
                1407
            ],
            [
                1407,
                1421
            ],
            [
                1429,
                1435
            ],
            [
                1422,
                1428
            ],
            [
                1436,
                1449
            ],
            [
                1565,
                1568
            ],
            [
                1568,
                1640
            ],
            [
                1647,
                1649
            ],
            [
                1642,
                1646
            ],
            [
                1657,
                1661
            ],
            [
                1672,
                1709
            ],
            [
                1727,
                1766
            ],
            [
                1770,
                1779
            ],
            [
                1787,
                1822
            ],
            [
                1822,
                1843
            ],
            [
                1950,
                1951
            ],
            [
                1952,
                1963
            ],
            [
                1867,
                1911
            ],
            [
                1915,
                1930
            ],
            [
                1975,
                1977
            ],
            [
                1977,
                1997
            ],
            [
                2006,
                2009
            ],
            [
                2023,
                2072
            ],
            [
                2074,
                2195
            ],
            [
                2208,
                2214
            ],
            [
                2225,
                2327
            ],
            [
                2340,
                2373
            ],
            [
                2383,
                2385
            ],
            [
                2385,
                2425
            ],
            [
                2462,
                2463
            ],
            [
                2466,
                2493
            ],
            [
                2498,
                2504
            ],
            [
                2506,
                2697
            ],
            [
                2711,
                2727
            ],
            [
                2727,
                2740
            ],
            [
                2836,
                2839
            ],
            [
                2797,
                2812
            ],
            [
                2741,
                2789
            ],
            [
                2849,
                2866
            ],
            [
                2875,
                3035
            ],
            [
                3040,
                3061
            ],
            [
                3061,
                3085
            ],
            [
                3097,
                3118
            ],
            [
                3134,
                3154
            ],
            [
                3181,
                3210
            ],
            [
                3210,
                3261
            ],
            [
                3276,
                3374
            ],
            [
                3410,
                3435
            ],
            [
                3450,
                3496
            ],
            [
                3496,
                3659
            ],
            [
                3708,
                3710
            ],
            [
                3710,
                3720
            ],
            [
                3729,
                3825
            ],
            [
                3834,
                3877
            ],
            [
                3884,
                3936
            ],
            [
                3936,
                3939
            ],
            [
                3942,
                3978
            ],
            [
                3978,
                4073
            ],
            [
                4073,
                4083
            ],
            [
                4099,
                4123
            ],
            [
                4132,
                4189
            ],
            [
                4212,
                4226
            ],
            [
                4246,
                4320
            ],
            [
                4322,
                4325
            ],
            [
                4338,
                4352
            ],
            [
                4364,
                4389
            ],
            [
                4391,
                4409
            ],
            [
                4423,
                4425
            ],
            [
                4425,
                4441
            ],
            [
                4451,
                4530
            ],
            [
                4544,
                4588
            ],
            [
                4588,
                4635
            ],
            [
                4640,
                4644
            ],
            [
                4667,
                4687
            ],
            [
                4688,
                4749
            ],
            [
                4749,
                4843
            ],
            [
                4854,
                4876
            ],
            [
                4908,
                4910
            ],
            [
                4910,
                4942
            ],
            [
                4959,
                4979
            ],
            [
                5007,
                5012
            ],
            [
                5018,
                5041
            ],
            [
                5041,
                5058
            ],
            [
                5071,
                5074
            ],
            [
                5074,
                5116
            ],
            [
                5116,
                5161
            ],
            [
                5173,
                5185
            ],
            [
                5255,
                5257
            ],
            [
                5257,
                5258
            ],
            [
                5275,
                5293
            ],
            [
                5293,
                5308
            ],
            [
                5308,
                5359
            ],
            [
                5359,
                5384
            ],
            [
                5384,
                5395
            ],
            [
                5405,
                5429
            ],
            [
                5441,
                5460
            ],
            [
                5470,
                5473
            ],
            [
                5473,
                5573
            ],
            [
                5573,
                5583
            ],
            [
                5584,
                5630
            ],
            [
                5647,
                5650
            ],
            [
                5651,
                5731
            ],
            [
                5731,
                5755
            ],
            [
                5756,
                5774
            ],
            [
                5800,
                5843
            ],
            [
                5878,
                5880
            ],
            [
                5844,
                5847
            ],
            [
                5932,
                5935
            ],
            [
                5774,
                5775
            ],
            [
                5853,
                5867
            ],
            [
                5885,
                5892
            ],
            [
                5881,
                5884
            ],
            [
                5868,
                5876
            ],
            [
                5894,
                5915
            ],
            [
                5947,
                5950
            ],
            [
                5956,
                5969
            ],
            [
                5978,
                5980
            ],
            [
                5980,
                6040
            ],
            [
                6050,
                6074
            ],
            [
                6079,
                6080
            ],
            [
                6076,
                6079
            ],
            [
                6087,
                6096
            ],
            [
                6110,
                6118
            ],
            [
                6141,
                6179
            ],
            [
                6209,
                6212
            ],
            [
                6074,
                6075
            ],
            [
                6378,
                6381
            ],
            [
                6350,
                6365
            ],
            [
                6243,
                6244
            ],
            [
                6403,
                6421
            ],
            [
                6227,
                6228
            ],
            [
                6431,
                6479
            ],
            [
                6508,
                6510
            ],
            [
                6515,
                6558
            ],
            [
                6581,
                6697
            ],
            [
                6711,
                6730
            ],
            [
                6798,
                6800
            ],
            [
                6800,
                6840
            ],
            [
                6867,
                6872
            ],
            [
                6861,
                6862
            ],
            [
                6905,
                6926
            ],
            [
                7018,
                7019
            ],
            [
                6928,
                6950
            ],
            [
                6966,
                7011
            ],
            [
                7020,
                7034
            ],
            [
                7045,
                7094
            ],
            [
                7116,
                7153
            ],
            [
                7274,
                7276
            ],
            [
                7276,
                7299
            ],
            [
                7310,
                7355
            ],
            [
                7355,
                7432
            ],
            [
                7463,
                7475
            ],
            [
                7487,
                7532
            ],
            [
                7547,
                7571
            ],
            [
                7583,
                7611
            ],
            [
                7617,
                7635
            ],
            [
                7673,
                7674
            ],
            [
                7854,
                7980
            ],
            [
                7993,
                8012
            ],
            [
                8062,
                8064
            ],
            [
                8064,
                8132
            ],
            [
                8132,
                8224
            ],
            [
                8235,
                8278
            ],
            [
                8278,
                8303
            ],
            [
                8323,
                8331
            ],
            [
                8332,
                8389
            ],
            [
                8544,
                8546
            ],
            [
                8546,
                8617
            ],
            [
                8619,
                8632
            ],
            [
                8654,
                8743
            ],
            [
                8834,
                8841
            ],
            [
                8867,
                8898
            ],
            [
                8857,
                8866
            ],
            [
                8905,
                8906
            ],
            [
                8907,
                8964
            ],
            [
                8973,
                9022
            ],
            [
                9037,
                9184
            ],
            [
                9203,
                9207
            ],
            [
                9214,
                9227
            ],
            [
                9256,
                9275
            ],
            [
                9283,
                9402
            ],
            [
                9419,
                9420
            ],
            [
                9404,
                9406
            ],
            [
                9465,
                9484
            ],
            [
                9193,
                9194
            ],
            [
                9501,
                9507
            ],
            [
                9485,
                9489
            ],
            [
                9498,
                9500
            ],
            [
                9567,
                9579
            ],
            [
                9513,
                9515
            ],
            [
                9587,
                9589
            ],
            [
                9527,
                9548
            ],
            [
                9600,
                9630
            ],
            [
                9630,
                9634
            ],
            [
                9656,
                9663
            ],
            [
                9635,
                9649
            ],
            [
                9683,
                9728
            ],
            [
                9795,
                9803
            ],
            [
                9816,
                9890
            ],
            [
                9931,
                9933
            ],
            [
                9941,
                9972
            ],
            [
                10021,
                10032
            ],
            [
                10069,
                10097
            ],
            [
                10103,
                10135
            ],
            [
                10135,
                10216
            ],
            [
                10224,
                10229
            ],
            [
                10229,
                10256
            ],
            [
                10266,
                10283
            ],
            [
                10285,
                10339
            ],
            [
                10464,
                10465
            ],
            [
                10493,
                10547
            ],
            [
                10489,
                10492
            ],
            [
                10584,
                10613
            ],
            [
                10632,
                10644
            ],
            [
                10675,
                10683
            ],
            [
                10693,
                10706
            ],
            [
                10731,
                10796
            ],
            [
                10796,
                10799
            ],
            [
                10800,
                10814
            ],
            [
                10822,
                10830
            ],
            [
                10832,
                10957
            ],
            [
                11186,
                11253
            ],
            [
                11272,
                11280
            ],
            [
                11281,
                11323
            ],
            [
                11323,
                11335
            ],
            [
                11402,
                11413
            ],
            [
                11518,
                11520
            ],
            [
                11339,
                11347
            ],
            [
                11356,
                11365
            ],
            [
                11374,
                11398
            ],
            [
                11426,
                11514
            ],
            [
                11526,
                11554
            ],
            [
                11562,
                11568
            ],
            [
                11871,
                11873
            ],
            [
                11574,
                11576
            ],
            [
                11827,
                11828
            ],
            [
                11706,
                11718
            ],
            [
                11688,
                11695
            ],
            [
                11731,
                11763
            ],
            [
                11850,
                11856
            ],
            [
                11784,
                11827
            ],
            [
                11618,
                11623
            ],
            [
                11578,
                11583
            ],
            [
                11968,
                11988
            ],
            [
                12172,
                12174
            ],
            [
                12174,
                12240
            ],
            [
                12295,
                12298
            ],
            [
                12299,
                12317
            ],
            [
                12335,
                12375
            ],
            [
                12375,
                12396
            ],
            [
                12405,
                12429
            ],
            [
                12432,
                12496
            ],
            [
                12501,
                12549
            ],
            [
                12549,
                12592
            ],
            [
                12597,
                12630
            ],
            [
                12712,
                12722
            ],
            [
                12732,
                12781
            ],
            [
                12786,
                12857
            ],
            [
                12857,
                12898
            ],
            [
                12932,
                12935
            ],
            [
                12956,
                12971
            ],
            [
                13051,
                13057
            ],
            [
                12998,
                13002
            ],
            [
                13060,
                13111
            ],
            [
                13147,
                13150
            ],
            [
                13151,
                13195
            ],
            [
                13201,
                13237
            ],
            [
                13304,
                13306
            ],
            [
                13306,
                13380
            ],
            [
                13447,
                13496
            ],
            [
                13505,
                13595
            ],
            [
                13596,
                13666
            ],
            [
                13677,
                13716
            ],
            [
                13717,
                13786
            ],
            [
                13793,
                13842
            ],
            [
                13851,
                13853
            ],
            [
                13853,
                13866
            ],
            [
                13880,
                13887
            ],
            [
                14116,
                14120
            ],
            [
                13987,
                14003
            ],
            [
                13893,
                13894
            ],
            [
                14050,
                14066
            ],
            [
                14082,
                14115
            ],
            [
                14194,
                14214
            ],
            [
                14260,
                14262
            ],
            [
                14262,
                14297
            ],
            [
                14299,
                14345
            ],
            [
                14345,
                14411
            ],
            [
                14411,
                14423
            ],
            [
                14428,
                14441
            ],
            [
                14441,
                14446
            ],
            [
                14465,
                14520
            ],
            [
                14525,
                14555
            ],
            [
                14556,
                14564
            ],
            [
                14564,
                14617
            ],
            [
                14618,
                14671
            ],
            [
                14671,
                14704
            ],
            [
                14712,
                14761
            ],
            [
                14763,
                14773
            ],
            [
                14775,
                14784
            ],
            [
                14793,
                14840
            ],
            [
                14840,
                14845
            ],
            [
                14847,
                14849
            ],
            [
                14869,
                14885
            ],
            [
                14885,
                14916
            ],
            [
                14955,
                14957
            ],
            [
                14957,
                14966
            ],
            [
                14975,
                15049
            ],
            [
                15059,
                15096
            ],
            [
                15115,
                15121
            ],
            [
                15101,
                15107
            ],
            [
                15131,
                15144
            ],
            [
                15144,
                15158
            ],
            [
                15161,
                15169
            ],
            [
                15171,
                15189
            ],
            [
                15200,
                15218
            ],
            [
                15245,
                15246
            ],
            [
                15247,
                15300
            ],
            [
                15338,
                15340
            ],
            [
                15340,
                15416
            ]
        ],
        "row_chars": [
            [
                0,
                338
            ],
            [
                338,
                640
            ],
            [
                640,
                831
            ],
            [
                831,
                886
            ],
            [
                886,
                980
            ],
            [
                980,
                1082
            ],
            [
                1082,
                1235
            ],
            [
                1235,
                1356
            ],
            [
                1356,
                1407
            ],
            [
                1407,
                1568
            ],
            [
                1568,
                1642
            ],
            [
                1642,
                1661
            ],
            [
                1661,
                1709
            ],
            [
                1709,
                1822
            ],
            [
                1822,
                1977
            ],
            [
                1977,
                2385
            ],
            [
                2385,
                2466
            ],
            [
                2466,
                2498
            ],
            [
                2498,
                2727
            ],
            [
                2727,
                3061
            ],
            [
                3061,
                3210
            ],
            [
                3210,
                3496
            ],
            [
                3496,
                3710
            ],
            [
                3710,
                3877
            ],
            [
                3877,
                3936
            ],
            [
                3936,
                3978
            ],
            [
                3978,
                4073
            ],
            [
                4073,
                4189
            ],
            [
                4189,
                4425
            ],
            [
                4425,
                4588
            ],
            [
                4588,
                4749
            ],
            [
                4749,
                4910
            ],
            [
                4910,
                5041
            ],
            [
                5041,
                5074
            ],
            [
                5074,
                5116
            ],
            [
                5116,
                5257
            ],
            [
                5257,
                5293
            ],
            [
                5293,
                5308
            ],
            [
                5308,
                5359
            ],
            [
                5359,
                5384
            ],
            [
                5384,
                5473
            ],
            [
                5473,
                5573
            ],
            [
                5573,
                5630
            ],
            [
                5630,
                5731
            ],
            [
                5731,
                5980
            ],
            [
                5980,
                6510
            ],
            [
                6510,
                6800
            ],
            [
                6800,
                7276
            ],
            [
                7276,
                7355
            ],
            [
                7355,
                7721
            ],
            [
                7721,
                8064
            ],
            [
                8064,
                8132
            ],
            [
                8132,
                8278
            ],
            [
                8278,
                8303
            ],
            [
                8303,
                8546
            ],
            [
                8546,
                8907
            ],
            [
                8907,
                9630
            ],
            [
                9630,
                9933
            ],
            [
                9933,
                10135
            ],
            [
                10135,
                10229
            ],
            [
                10229,
                10464
            ],
            [
                10464,
                10796
            ],
            [
                10796,
                10957
            ],
            [
                10957,
                11186
            ],
            [
                11186,
                11323
            ],
            [
                11323,
                11335
            ],
            [
                11335,
                12174
            ],
            [
                12174,
                12375
            ],
            [
                12375,
                12432
            ],
            [
                12432,
                12549
            ],
            [
                12549,
                12857
            ],
            [
                12857,
                13111
            ],
            [
                13111,
                13306
            ],
            [
                13306,
                13496
            ],
            [
                13496,
                13596
            ],
            [
                13596,
                13717
            ],
            [
                13717,
                13853
            ],
            [
                13853,
                14262
            ],
            [
                14262,
                14345
            ],
            [
                14345,
                14411
            ],
            [
                14411,
                14441
            ],
            [
                14441,
                14556
            ],
            [
                14556,
                14564
            ],
            [
                14564,
                14618
            ],
            [
                14618,
                14671
            ],
            [
                14671,
                14840
            ],
            [
                14840,
                14849
            ],
            [
                14849,
                14869
            ],
            [
                14869,
                14885
            ],
            [
                14885,
                14957
            ],
            [
                14957,
                14966
            ],
            [
                14966,
                15096
            ],
            [
                15096,
                15144
            ],
            [
                15144,
                15247
            ],
            [
                15247,
                15340
            ],
            [
                15340,
                15416
            ]
        ]
    },
    "abridged": {
        "text": "Early in this nineteenth century, on a sunshiny morning in June, there drove up to the great iron gate of Miss Pinkerton's academy for young ladies on Chiswick Mall a large coach, driven by a fat coachman in a three-cornered hat and wig. A black servant, who sat on the box beside the coachman, uncurled his legs as the coach drew up opposite Miss Pinkerton's, and when he rang the bell twenty young heads were seen peering out of the narrow windows of the stately old house. Amongst them was good-natured Miss Jemima Pinkerton, looking from the window of her drawing-room.\n\"It is Mrs. Sedley's coach, sister,\" said Miss Jemima. \"Sambo has just rung the bell.\"\n\"Have you completed all the necessary preparations incident to Miss Sedley's departure, Miss Jemima?\" asked Miss Pinkerton, that majestic lady; queen of Hammersmith, and friend of Doctor Johnson.\n\"The girls were up at four this morning, packing her trunks, sister,\" replied Miss Jemima. \"We have made her a bunch of flowers.\"\n\"Say a bouquet, sister Jemima, 'tis more genteel.\"\n\"Well, a booky almost as big as a haystack.\"\n\"And I trust, Miss Jemima, you have made a copy of Miss Sedley's account? Is this it? Ninety-three pounds, four shillings. Please address it to John Sedley, Esquire, and seal this letter which I have written to his lady.\"\nIn Miss Jemima's eyes a signed letter from her sister, Miss Pinkerton, was an object of deep veneration. Only when her pupils left the school, or when they were about to be married, and once when poor Miss Birch died of the scarlet fever, was Miss Pinkerton known to write personally to the parents of her pupils. Jemima thought that if anything could console Mrs. Birch for her daughter's loss, it would be that pious and eloquent letter in which Miss Pinkerton announced her death.\nIn the present instance Miss Pinkerton's letter went thus:\nThe Mall, Chiswick, June 15\nMadam, - After her six years' residence at the Mall, I have the honour and happiness of presenting Miss Amelia Sedley to her parents, as a young lady not unworthy to occupy a fitting position in their refined circle. Those virtues and accomplishments which characterize the young English gentlewoman will not be found lacking in the amiable Miss Sedley, whose INDUSTRY and OBEDIENCE have endeared her to her instructors, and whose delightful sweetness of temper has charmed her AGED and YOUTHFUL companions.\nIn music, in dancing, in writing, in every variety of needlework, she will realize her friends' fondest wishes. In geography there is still much to be desired; and an undeviating use of the backboard, for four hours daily during the next three years, is recommended for that dignified DEPORTMENT so requisite for every young lady of FASHION.\nIn the principles of religion and morality, Miss Sedley will be found worthy of an establishment which has been honoured by the presence of THE GREAT LEXICOGRAPHER Dr Johnson. In leaving us, Miss Amelia carries with her the hearts of her companions, and the affectionate regards of her head-mistress, who has the honour to subscribe herself,\nYour most obliged humble servant, BARBARA PINKERTON\nP.S. Miss Sharp accompanies Miss Sedley. It is particularly requested that Miss Sharp's stay in Russell Square may not exceed ten days. The family with whom she is engaged wish to avail themselves of her services as soon as possible.\nNext Miss Pinkerton wrote her own name, and Miss Sedley's, in the fly-leaf of a Johnson's Dictionary - the work which she always presented to her scholars on their departure. On the cover was a copy of \"Lines addressed to a young lady on quitting Miss Pinkerton's school, by the late revered Doctor Samuel Johnson.\" In fact, the Lexicographer's name was always on Miss Pinkerton's lips, and a visit he had once paid to her was the cause of her reputation and her fortune.\nBeing commanded by her elder sister to get \"the Dictionary\" from the cupboard, Miss Jemima had taken out two copies of the book. When Miss Pinkerton had finished writing in the first, Jemima timidly handed her the second.\n\"For whom is this?\" said Miss Pinkerton, with awful coldness.\n\"For Becky Sharp,\" answered Jemima, trembling and blushing. \"She's going too.\"\n\"MISS JEMIMA!\" exclaimed Miss Pinkerton, in the largest capitals. \"Are you in your senses? Replace the Dictionary in the closet, and never take such a liberty again.\"\n\"Well, sister, it's only two-and-ninepence, and poor Becky will be miserable if she don't get one.\"\n\"Send Miss Amelia Sedley instantly to me,\" said Miss Pinkerton. Not daring to say another word, poor Jemima trotted off, exceedingly flurried and nervous.\nMiss Sedley's papa was a wealthy merchant in London; whereas Miss Sharp was an articled pupil, working as an assistant teacher. For her, Miss Pinkerton thought she had done quite enough, without giving her the honour of the Dictionary.\nAlthough schoolmistresses' letters are to be trusted no more than churchyard epitaphs, yet sometimes a person is really deserving of all the praises carved on his gravestone; and so in academies, every now and then a pupil is fully worthy of the praises bestowed by their teacher. Miss Amelia Sedley was a young lady of this sort. She deserved not only all that Miss Pinkerton said in her praise, but had many charming qualities which that pompous old woman could not see.\nFor she could not only sing like a lark, dance, embroider beautifully, and spell as well as a Dictionary; but she had such a kindly, smiling, tender, generous heart, as won the love of everybody who came near her, right down to the poor girl in the scullery. She had twelve intimate friends out of the twenty-four young ladies. Even envious Miss Briggs never spoke ill of her; high and mighty Miss Saltire allowed that she was genteel; and as for Miss Swartz, the rich mulatto from St. Kitt's, when Amelia went away, she was in a passion of tears.\nMiss Jemima had already whimpered several times at the idea of Amelia's departure; and, but for fear of her sister, would have had downright hysterics. Such luxury of grief, however, is only allowed to parlour-boarders. Honest Jemima had all the bills, and the washing, and the mending, and the puddings, and the crockery, and the servants to superintend. But why speak about her? We shall probably not hear of her again from this moment to the end of time.\nBut as we are to see a great deal of Amelia, there is no harm in saying at the outset that she was a dear little creature; and a great mercy it is, both in life and in novels, to have so guileless and good-natured a companion.\nAs she is not a heroine, there is no need to describe her looks. Indeed I am afraid that her nose was rather short, and her cheeks a great deal too round and red for a heroine; but her face blushed with rosy health, and her lips with the freshest of smiles, and her eyes sparkled with bright good-humour, except when they filled with tears, and that was a great deal too often; for the silly thing would cry over a dead canary-bird, or the end of a novel, even a stupid one. If anybody were so hard-hearted as to say an unkind word to her, so much the worse for them. Even the austere Miss Pinkerton ceased scolding her after the first time, and gave all the teachers particular orders to treat Miss Sedley with the utmost gentleness.\nWhen the day of departure came, Miss Sedley was glad to go home, and yet woefully sad at leaving school. For three days before, little Laura Martin, the orphan, followed her about like a dog. She had to make and receive fourteen presents - to make fourteen solemn promises of writing every week.\n\"Write every day, you dear darling,\" said the impetuous but affectionate Miss Swartz; and Laura Martin took her hand and said wistfully, \"Amelia, when I write to you I shall call you Mamma.\" All of which details, no doubt Jones, who reads this book at his Club, will pronounce to be excessively foolish, trivial, twaddling, and ultra-sentimental. Well, he is a lofty man of genius, and admires the great and heroic; and so he had better take warning and go elsewhere.\nWell, then. Miss Sedley's flowers, presents, trunks, and bonnet-boxes were arranged by Mr. Sambo in the carriage, together with a very small and weather-beaten old trunk with Miss Sharp's card nailed to it. The grief of parting was considerably lessened by the speech which Miss Pinkerton addressed to her pupil, and which was intolerably dull. A seed-cake and a bottle of wine were produced in the drawing-room; and after these refreshments, Miss Sedley was at liberty to depart.\n\"You'll go in and say goodbye to Miss Pinkerton, Becky?\" said Miss Jemima to a young lady of whom nobody took any notice, who was coming downstairs with her own bandbox.\n\"I suppose I must,\" said Miss Sharp calmly, much to the wonder of Miss Jemima. Miss Sharp entered Miss Pinkerton's room in a very unconcerned manner, and said in French, with a perfect accent, \"Mademoiselle, je viens vous faire mes adieux.\"\nMiss Pinkerton did not understand French; but throwing up her turbaned head, she said, \"Miss Sharp, I wish you a good morning.\" She majestically waved one hand, both by way of adieu, and to allow Miss Sharp an opportunity of shaking it.\nMiss Sharp only folded her own hands with a very frigid smile and bow, and Miss Pinkerton tossed up her turban more indignantly than ever. It was a little battle between the young lady and the old one, and the latter was worsted.\n\"Heaven bless you, my child,\" said she, embracing Amelia, and scowling over the girl's shoulder at Miss Sharp.\n\"Come away, Becky,\" said Miss Jemima, pulling the young woman away in alarm, and the drawing-room door closed upon them.\nThen came the parting with the young ladies. There was such a hugging, and kissing, and crying, as no pen can depict. The embracing was over; they parted - that is, Miss Sedley parted from her friends. Miss Sharp had demurely entered the carriage some minutes before. Nobody cried at leaving her.\nSambo slammed the carriage door on his young weeping mistress, and sprang up behind the carriage.\n\"Stop!\" cried Miss Jemima, rushing to the gate with a parcel. \"It's some sandwiches, my dear,\" said she to Amelia. \"You may be hungry, you know; and Becky Sharp, here's a book for you that my sister - that is, I - Johnson's Dictionary, you know; you mustn't leave us without that. Good-bye. God bless you!\"\nAnd the kind creature retreated.\nBut, lo! as the coach drove off, Miss Sharp put her pale face out of the window and flung the book back into the garden.\nJemima almost fainted with terror. \"Well, I never,\" said she; \"what an audacious-\" Emotion prevented her from finishing.\nThe carriage rolled away; the great gates were closed. The world is before the two young ladies; and so, farewell to Chiswick Mall.",
        "paragraph_chars": [
            [
                0,
                574
            ],
            [
                574,
                661
            ],
            [
                661,
                857
            ],
            [
                857,
                987
            ],
            [
                987,
                1038
            ],
            [
                1038,
                1083
            ],
            [
                1083,
                1305
            ],
            [
                1305,
                1789
            ],
            [
                1789,
                1848
            ],
            [
                1848,
                1876
            ],
            [
                1876,
                2384
            ],
            [
                2384,
                2726
            ],
            [
                2726,
                3068
            ],
            [
                3068,
                3120
            ],
            [
                3120,
                3354
            ],
            [
                3354,
                3826
            ],
            [
                3826,
                4048
            ],
            [
                4048,
                4110
            ],
            [
                4110,
                4189
            ],
            [
                4189,
                4356
            ],
            [
                4356,
                4456
            ],
            [
                4456,
                4611
            ],
            [
                4611,
                4847
            ],
            [
                4847,
                5320
            ],
            [
                5320,
                5868
            ],
            [
                5868,
                6326
            ],
            [
                6326,
                6553
            ],
            [
                6553,
                7288
            ],
            [
                7288,
                7584
            ],
            [
                7584,
                8052
            ],
            [
                8052,
                8533
            ],
            [
                8533,
                8703
            ],
            [
                8703,
                8944
            ],
            [
                8944,
                9181
            ],
            [
                9181,
                9411
            ],
            [
                9411,
                9522
            ],
            [
                9522,
                9643
            ],
            [
                9643,
                9940
            ],
            [
                9940,
                10038
            ],
            [
                10038,
                10345
            ],
            [
                10345,
                10378
            ],
            [
                10378,
                10499
            ],
            [
                10499,
                10620
            ],
            [
                10620,
                10751
            ]
        ],
        "segment_chars": [
            [
                0,
                238
            ],
            [
                238,
                476
            ],
            [
                476,
                574
            ],
            [
                574,
                629
            ],
            [
                629,
                661
            ],
            [
                661,
                763
            ],
            [
                763,
                857
            ],
            [
                857,
                948
            ],
            [
                948,
                987
            ],
            [
                987,
                1038
            ],
            [
                1038,
                1083
            ],
            [
                1083,
                1157
            ],
            [
                1157,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1206,
                1305
            ],
            [
                1305,
                1410
            ],
            [
                1410,
                1619
            ],
            [
                1619,
                1789
            ],
            [
                1789,
                1848
            ],
            [
                1848,
                1876
            ],
            [
                1876,
                2093
            ],
            [
                2093,
                2384
            ],
            [
                2384,
                2496
            ],
            [
                2496,
                2726
            ],
            [
                2726,
                2902
            ],
            [
                2902,
                3068
            ],
            [
                3068,
                3120
            ],
            [
                3120,
                3161
            ],
            [
                3161,
                3256
            ],
            [
                3256,
                3354
            ],
            [
                3354,
                3529
            ],
            [
                3529,
                3670
            ],
            [
                3670,
                3826
            ],
            [
                3826,
                3955
            ],
            [
                3955,
                4048
            ],
            [
                4048,
                4068
            ],
            [
                4068,
                4110
            ],
            [
                4110,
                4170
            ],
            [
                4170,
                4189
            ],
            [
                4189,
                4204
            ],
            [
                4204,
                4255
            ],
            [
                4255,
                4280
            ],
            [
                4280,
                4356
            ],
            [
                4356,
                4456
            ],
            [
                4456,
                4520
            ],
            [
                4520,
                4611
            ],
            [
                4611,
                4739
            ],
            [
                4739,
                4847
            ],
            [
                4847,
                5128
            ],
            [
                5128,
                5178
            ],
            [
                5178,
                5320
            ],
            [
                5320,
                5579
            ],
            [
                5579,
                5648
            ],
            [
                5648,
                5868
            ],
            [
                5868,
                6020
            ],
            [
                6020,
                6088
            ],
            [
                6088,
                6224
            ],
            [
                6224,
                6249
            ],
            [
                6249,
                6326
            ],
            [
                6326,
                6553
            ],
            [
                6553,
                6618
            ],
            [
                6618,
                7028
            ],
            [
                7028,
                7121
            ],
            [
                7121,
                7288
            ],
            [
                7288,
                7393
            ],
            [
                7393,
                7480
            ],
            [
                7480,
                7584
            ],
            [
                7584,
                7775
            ],
            [
                7775,
                7931
            ],
            [
                7931,
                8052
            ],
            [
                8052,
                8064
            ],
            [
                8064,
                8259
            ],
            [
                8259,
                8397
            ],
            [
                8397,
                8533
            ],
            [
                8533,
                8590
            ],
            [
                8590,
                8703
            ],
            [
                8703,
                8782
            ],
            [
                8782,
                8944
            ],
            [
                8944,
                9072
            ],
            [
                9072,
                9181
            ],
            [
                9181,
                9320
            ],
            [
                9320,
                9411
            ],
            [
                9411,
                9522
            ],
            [
                9522,
                9643
            ],
            [
                9643,
                9688
            ],
            [
                9688,
                9761
            ],
            [
                9761,
                9845
            ],
            [
                9845,
                9911
            ],
            [
                9911,
                9940
            ],
            [
                9940,
                10038
            ],
            [
                10038,
                10046
            ],
            [
                10046,
                10100
            ],
            [
                10100,
                10153
            ],
            [
                10153,
                10319
            ],
            [
                10319,
                10329
            ],
            [
                10329,
                10345
            ],
            [
                10345,
                10378
            ],
            [
                10378,
                10387
            ],
            [
                10387,
                10499
            ],
            [
                10499,
                10534
            ],
            [
                10534,
                10620
            ],
            [
                10620,
                10675
            ],
            [
                10675,
                10751
            ]
        ],
        "overlap_chars": [
            [
                6,
                8
            ],
            [
                25,
                32
            ],
            [
                32,
                33
            ],
            [
                34,
                36
            ],
            [
                39,
                147
            ],
            [
                148,
                164
            ],
            [
                165,
                172
            ],
            [
                173,
                178
            ],
            [
                178,
                236
            ],
            [
                236,
                238
            ],
            [
                238,
                258
            ],
            [
                263,
                284
            ],
            [
                285,
                307
            ],
            [
                308,
                315
            ],
            [
                316,
                319
            ],
            [
                326,
                359
            ],
            [
                359,
                364
            ],
            [
                370,
                372
            ],
            [
                378,
                386
            ],
            [
                394,
                468
            ],
            [
                469,
                476
            ],
            [
                493,
                527
            ],
            [
                527,
                528
            ],
            [
                542,
                555
            ],
            [
                560,
                574
            ],
            [
                574,
                629
            ],
            [
                629,
                635
            ],
            [
                636,
                658
            ],
            [
                658,
                661
            ],
            [
                661,
                763
            ],
            [
                763,
                783
            ],
            [
                783,
                804
            ],
            [
                811,
                826
            ],
            [
                831,
                855
            ],
            [
                855,
                857
            ],
            [
                857,
                946
            ],
            [
                948,
                967
            ],
            [
                984,
                987
            ],
            [
                987,
                1038
            ],
            [
                1038,
                1052
            ],
            [
                1053,
                1059
            ],
            [
                1060,
                1066
            ],
            [
                1067,
                1080
            ],
            [
                1080,
                1083
            ],
            [
                1083,
                1155
            ],
            [
                1157,
                1159
            ],
            [
                1160,
                1164
            ],
            [
                1165,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1213,
                1252
            ],
            [
                1253,
                1262
            ],
            [
                1270,
                1305
            ],
            [
                1305,
                1326
            ],
            [
                1327,
                1328
            ],
            [
                1336,
                1347
            ],
            [
                1348,
                1392
            ],
            [
                1393,
                1408
            ],
            [
                1408,
                1410
            ],
            [
                1410,
                1430
            ],
            [
                1436,
                1439
            ],
            [
                1446,
                1495
            ],
            [
                1496,
                1617
            ],
            [
                1619,
                1625
            ],
            [
                1634,
                1736
            ],
            [
                1744,
                1777
            ],
            [
                1787,
                1789
            ],
            [
                1789,
                1829
            ],
            [
                1846,
                1847
            ],
            [
                1848,
                1875
            ],
            [
                1876,
                1882
            ],
            [
                1885,
                2076
            ],
            [
                2077,
                2093
            ],
            [
                2093,
                2106
            ],
            [
                2107,
                2110
            ],
            [
                2111,
                2126
            ],
            [
                2127,
                2175
            ],
            [
                2176,
                2193
            ],
            [
                2202,
                2362
            ],
            [
                2363,
                2384
            ],
            [
                2384,
                2408
            ],
            [
                2416,
                2437
            ],
            [
                2438,
                2458
            ],
            [
                2467,
                2496
            ],
            [
                2496,
                2547
            ],
            [
                2551,
                2649
            ],
            [
                2654,
                2679
            ],
            [
                2680,
                2726
            ],
            [
                2726,
                2889
            ],
            [
                2900,
                2902
            ],
            [
                2902,
                2912
            ],
            [
                2915,
                3011
            ],
            [
                3025,
                3068
            ],
            [
                3068,
                3120
            ],
            [
                3120,
                3123
            ],
            [
                3125,
                3161
            ],
            [
                3161,
                3256
            ],
            [
                3256,
                3266
            ],
            [
                3267,
                3291
            ],
            [
                3297,
                3354
            ],
            [
                3359,
                3373
            ],
            [
                3380,
                3454
            ],
            [
                3457,
                3460
            ],
            [
                3461,
                3475
            ],
            [
                3483,
                3508
            ],
            [
                3509,
                3527
            ],
            [
                3527,
                3529
            ],
            [
                3529,
                3545
            ],
            [
                3546,
                3625
            ],
            [
                3626,
                3670
            ],
            [
                3670,
                3717
            ],
            [
                3735,
                3739
            ],
            [
                3739,
                3759
            ],
            [
                3765,
                3826
            ],
            [
                3826,
                3920
            ],
            [
                3931,
                3953
            ],
            [
                3953,
                3955
            ],
            [
                3955,
                3987
            ],
            [
                3996,
                4016
            ],
            [
                4017,
                4022
            ],
            [
                4025,
                4048
            ],
            [
                4048,
                4065
            ],
            [
                4065,
                4068
            ],
            [
                4068,
                4110
            ],
            [
                4110,
                4155
            ],
            [
                4156,
                4168
            ],
            [
                4168,
                4170
            ],
            [
                4170,
                4171
            ],
            [
                4171,
                4189
            ],
            [
                4189,
                4204
            ],
            [
                4204,
                4255
            ],
            [
                4255,
                4280
            ],
            [
                4280,
                4291
            ],
            [
                4303,
                4327
            ],
            [
                4328,
                4347
            ],
            [
                4353,
                4356
            ],
            [
                4356,
                4456
            ],
            [
                4456,
                4466
            ],
            [
                4474,
                4520
            ],
            [
                4520,
                4523
            ],
            [
                4531,
                4611
            ],
            [
                4611,
                4635
            ],
            [
                4644,
                4662
            ],
            [
                4662,
                4705
            ],
            [
                4714,
                4716
            ],
            [
                4739,
                4742
            ],
            [
                4743,
                4746
            ],
            [
                4746,
                4747
            ],
            [
                4748,
                4762
            ],
            [
                4763,
                4770
            ],
            [
                4771,
                4774
            ],
            [
                4775,
                4783
            ],
            [
                4784,
                4805
            ],
            [
                4817,
                4820
            ],
            [
                4821,
                4834
            ],
            [
                4845,
                4847
            ],
            [
                4847,
                4907
            ],
            [
                4908,
                4932
            ],
            [
                4932,
                4933
            ],
            [
                4934,
                4937
            ],
            [
                4938,
                4947
            ],
            [
                4948,
                4956
            ],
            [
                4957,
                4995
            ],
            [
                5006,
                5009
            ],
            [
                5020,
                5021
            ],
            [
                5022,
                5025
            ],
            [
                5026,
                5041
            ],
            [
                5041,
                5042
            ],
            [
                5043,
                5061
            ],
            [
                5062,
                5063
            ],
            [
                5064,
                5112
            ],
            [
                5126,
                5128
            ],
            [
                5128,
                5171
            ],
            [
                5182,
                5298
            ],
            [
                5299,
                5318
            ],
            [
                5318,
                5320
            ],
            [
                5320,
                5360
            ],
            [
                5361,
                5366
            ],
            [
                5366,
                5367
            ],
            [
                5368,
                5389
            ],
            [
                5389,
                5390
            ],
            [
                5391,
                5413
            ],
            [
                5424,
                5469
            ],
            [
                5470,
                5484
            ],
            [
                5484,
                5533
            ],
            [
                5540,
                5577
            ],
            [
                5577,
                5579
            ],
            [
                5579,
                5602
            ],
            [
                5603,
                5648
            ],
            [
                5648,
                5725
            ],
            [
                5726,
                5738
            ],
            [
                5743,
                5788
            ],
            [
                5789,
                5813
            ],
            [
                5819,
                5847
            ],
            [
                5848,
                5866
            ],
            [
                5866,
                5867
            ],
            [
                5868,
                5994
            ],
            [
                5999,
                6018
            ],
            [
                6018,
                6020
            ],
            [
                6020,
                6088
            ],
            [
                6088,
                6180
            ],
            [
                6181,
                6224
            ],
            [
                6224,
                6249
            ],
            [
                6249,
                6257
            ],
            [
                6267,
                6324
            ],
            [
                6324,
                6326
            ],
            [
                6326,
                6397
            ],
            [
                6398,
                6411
            ],
            [
                6412,
                6501
            ],
            [
                6502,
                6509
            ],
            [
                6510,
                6541
            ],
            [
                6542,
                6551
            ],
            [
                6551,
                6552
            ],
            [
                6553,
                6610
            ],
            [
                6618,
                6667
            ],
            [
                6667,
                6814
            ],
            [
                6819,
                6823
            ],
            [
                6824,
                6837
            ],
            [
                6845,
                6864
            ],
            [
                6865,
                6984
            ],
            [
                6984,
                6985
            ],
            [
                6986,
                6988
            ],
            [
                6989,
                7008
            ],
            [
                7014,
                7015
            ],
            [
                7016,
                7022
            ],
            [
                7039,
                7043
            ],
            [
                7044,
                7046
            ],
            [
                7047,
                7059
            ],
            [
                7060,
                7062
            ],
            [
                7063,
                7065
            ],
            [
                7070,
                7091
            ],
            [
                7091,
                7121
            ],
            [
                7121,
                7125
            ],
            [
                7130,
                7137
            ],
            [
                7138,
                7152
            ],
            [
                7153,
                7198
            ],
            [
                7199,
                7207
            ],
            [
                7212,
                7286
            ],
            [
                7286,
                7288
            ],
            [
                7288,
                7319
            ],
            [
                7320,
                7331
            ],
            [
                7332,
                7360
            ],
            [
                7361,
                7393
            ],
            [
                7393,
                7474
            ],
            [
                7475,
                7480
            ],
            [
                7480,
                7507
            ],
            [
                7508,
                7525
            ],
            [
                7528,
                7582
            ],
            [
                7584,
                7585
            ],
            [
                7585,
                7639
            ],
            [
                7640,
                7643
            ],
            [
                7644,
                7673
            ],
            [
                7674,
                7686
            ],
            [
                7687,
                7695
            ],
            [
                7696,
                7709
            ],
            [
                7710,
                7775
            ],
            [
                7775,
                7778
            ],
            [
                7782,
                7796
            ],
            [
                7797,
                7805
            ],
            [
                7806,
                7931
            ],
            [
                7931,
                7998
            ],
            [
                7998,
                8006
            ],
            [
                8010,
                8052
            ],
            [
                8052,
                8064
            ],
            [
                8064,
                8075
            ],
            [
                8075,
                8077
            ],
            [
                8078,
                8086
            ],
            [
                8087,
                8096
            ],
            [
                8097,
                8121
            ],
            [
                8127,
                8215
            ],
            [
                8216,
                8244
            ],
            [
                8245,
                8251
            ],
            [
                8252,
                8254
            ],
            [
                8255,
                8257
            ],
            [
                8257,
                8258
            ],
            [
                8259,
                8271
            ],
            [
                8272,
                8279
            ],
            [
                8280,
                8312
            ],
            [
                8313,
                8319
            ],
            [
                8320,
                8363
            ],
            [
                8363,
                8368
            ],
            [
                8369,
                8374
            ],
            [
                8375,
                8395
            ],
            [
                8395,
                8397
            ],
            [
                8397,
                8463
            ],
            [
                8465,
                8468
            ],
            [
                8475,
                8493
            ],
            [
                8493,
                8533
            ],
            [
                8533,
                8554
            ],
            [
                8563,
                8587
            ],
            [
                8590,
                8654
            ],
            [
                8655,
                8703
            ],
            [
                8703,
                8746
            ],
            [
                8747,
                8780
            ],
            [
                8782,
                8792
            ],
            [
                8823,
                8872
            ],
            [
                8873,
                8944
            ],
            [
                8944,
                8985
            ],
            [
                8986,
                8989
            ],
            [
                8990,
                9005
            ],
            [
                9006,
                9012
            ],
            [
                9015,
                9019
            ],
            [
                9021,
                9072
            ],
            [
                9072,
                9075
            ],
            [
                9089,
                9133
            ],
            [
                9140,
                9176
            ],
            [
                9179,
                9181
            ],
            [
                9181,
                9255
            ],
            [
                9271,
                9320
            ],
            [
                9320,
                9410
            ],
            [
                9411,
                9481
            ],
            [
                9482,
                9521
            ],
            [
                9522,
                9591
            ],
            [
                9592,
                9641
            ],
            [
                9641,
                9643
            ],
            [
                9643,
                9656
            ],
            [
                9657,
                9664
            ],
            [
                9665,
                9669
            ],
            [
                9670,
                9686
            ],
            [
                9686,
                9687
            ],
            [
                9688,
                9704
            ],
            [
                9705,
                9738
            ],
            [
                9739,
                9759
            ],
            [
                9759,
                9761
            ],
            [
                9761,
                9796
            ],
            [
                9799,
                9845
            ],
            [
                9845,
                9911
            ],
            [
                9911,
                9923
            ],
            [
                9927,
                9940
            ],
            [
                9940,
                9945
            ],
            [
                9946,
                10001
            ],
            [
                10007,
                10037
            ],
            [
                10038,
                10046
            ],
            [
                10046,
                10099
            ],
            [
                10100,
                10153
            ],
            [
                10153,
                10186
            ],
            [
                10187,
                10236
            ],
            [
                10239,
                10249
            ],
            [
                10252,
                10261
            ],
            [
                10272,
                10319
            ],
            [
                10319,
                10324
            ],
            [
                10327,
                10329
            ],
            [
                10329,
                10345
            ],
            [
                10345,
                10376
            ],
            [
                10376,
                10378
            ],
            [
                10378,
                10387
            ],
            [
                10387,
                10461
            ],
            [
                10462,
                10499
            ],
            [
                10499,
                10505
            ],
            [
                10506,
                10512
            ],
            [
                10521,
                10534
            ],
            [
                10534,
                10548
            ],
            [
                10551,
                10559
            ],
            [
                10561,
                10579
            ],
            [
                10590,
                10608
            ],
            [
                10618,
                10619
            ],
            [
                10620,
                10673
            ],
            [
                10673,
                10675
            ],
            [
                10675,
                10751
            ]
        ],
        "row_chars": [
            [
                0,
                238
            ],
            [
                238,
                476
            ],
            [
                476,
                574
            ],
            [
                574,
                629
            ],
            [
                629,
                661
            ],
            [
                661,
                763
            ],
            [
                763,
                857
            ],
            [
                857,
                987
            ],
            [
                987,
                1038
            ],
            [
                1038,
                1083
            ],
            [
                1083,
                1157
            ],
            [
                1157,
                1169
            ],
            [
                1169,
                1206
            ],
            [
                1206,
                1305
            ],
            [
                1305,
                1410
            ],
            [
                1410,
                1789
            ],
            [
                1789,
                1848
            ],
            [
                1848,
                1876
            ],
            [
                1876,
                2093
            ],
            [
                2093,
                2384
            ],
            [
                2384,
                2496
            ],
            [
                2496,
                2726
            ],
            [
                2726,
                2902
            ],
            [
                2902,
                3068
            ],
            [
                3068,
                3120
            ],
            [
                3120,
                3161
            ],
            [
                3161,
                3256
            ],
            [
                3256,
                3354
            ],
            [
                3354,
                3529
            ],
            [
                3529,
                3670
            ],
            [
                3670,
                3826
            ],
            [
                3826,
                3955
            ],
            [
                3955,
                4048
            ],
            [
                4048,
                4068
            ],
            [
                4068,
                4110
            ],
            [
                4110,
                4170
            ],
            [
                4170,
                4189
            ],
            [
                4189,
                4204
            ],
            [
                4204,
                4255
            ],
            [
                4255,
                4280
            ],
            [
                4280,
                4356
            ],
            [
                4356,
                4456
            ],
            [
                4456,
                4520
            ],
            [
                4520,
                4611
            ],
            [
                4611,
                4847
            ],
            [
                4847,
                5128
            ],
            [
                5128,
                5320
            ],
            [
                5320,
                5579
            ],
            [
                5579,
                5648
            ],
            [
                5648,
                5868
            ],
            [
                5868,
                6020
            ],
            [
                6020,
                6088
            ],
            [
                6088,
                6224
            ],
            [
                6224,
                6249
            ],
            [
                6249,
                6326
            ],
            [
                6326,
                6553
            ],
            [
                6553,
                7121
            ],
            [
                7121,
                7288
            ],
            [
                7288,
                7393
            ],
            [
                7393,
                7480
            ],
            [
                7480,
                7584
            ],
            [
                7584,
                7775
            ],
            [
                7775,
                7931
            ],
            [
                7931,
                7931
            ],
            [
                7931,
                8052
            ],
            [
                8052,
                8064
            ],
            [
                8064,
                8397
            ],
            [
                8397,
                8533
            ],
            [
                8533,
                8590
            ],
            [
                8590,
                8703
            ],
            [
                8703,
                8944
            ],
            [
                8944,
                9072
            ],
            [
                9072,
                9181
            ],
            [
                9181,
                9320
            ],
            [
                9320,
                9411
            ],
            [
                9411,
                9522
            ],
            [
                9522,
                9643
            ],
            [
                9643,
                9761
            ],
            [
                9761,
                9845
            ],
            [
                9845,
                9911
            ],
            [
                9911,
                9940
            ],
            [
                9940,
                10038
            ],
            [
                10038,
                10046
            ],
            [
                10046,
                10100
            ],
            [
                10100,
                10153
            ],
            [
                10153,
                10319
            ],
            [
                10319,
                10329
            ],
            [
                10329,
                10329
            ],
            [
                10329,
                10345
            ],
            [
                10345,
                10378
            ],
            [
                10378,
                10387
            ],
            [
                10387,
                10499
            ],
            [
                10499,
                10534
            ],
            [
                10534,
                10620
            ],
            [
                10620,
                10675
            ],
            [
                10675,
                10751
            ]
        ]
    }
}