{
    "original": {
        "text": "And now, being received as a member of the amiable family whose portraits we have sketched in the foregoing pages, it became naturally Rebecca's duty to make herself, as she said, agreeable to her benefactors, and to gain their confidence to the utmost of her power. Who can but admire this quality of gratitude in an unprotected orphan; and, if there entered some degree of selfishness into her calculations, who can say but that her prudence was perfectly justifiable? \"I am alone in the world,\" said the friendless girl. \"I have nothing to look for but what my own labour can bring me; and while that little pink-faced chit Amelia, with not half my sense, has ten thousand pounds and an establishment secure, poor Rebecca (and my figure is far better than hers) has only herself and her own wits to trust to. Well, let us see if my wits cannot provide me with an honourable maintenance, and if some day or the other I cannot show Miss Amelia my real superiority over her. Not that I dislike poor Amelia: who can dislike such a harmless, good-natured creature?--only it will be a fine day when I can take my place above her in the world, as why, indeed, should I not?\" Thus it was that our little romantic friend formed visions of the future for herself--nor must we be scandalised that, in all her castles in the air, a husband was the principal inhabitant. Of what else have young ladies to think, but husbands? Of what else do their dear mammas think? \"I must be my own mamma,\" said Rebecca; not without a tingling consciousness of defeat, as she thought over her little misadventure with Jos Sedley.\nSo she wisely determined to render her position with the Queen's Crawley family comfortable and secure, and to this end resolved to make friends of every one around her who could at all interfere with her comfort.\nAs my Lady Crawley was not one of these personages, and a woman, moreover, so indolent and void of character as not to be of the least consequence in her own house, Rebecca soon found that it was not at all necessary to cultivate her good will--indeed, impossible to gain it. She used to talk to her pupils about their \"poor mamma\"; and, though she treated that lady with every demonstration of cool respect, it was to the rest of the family that she wisely directed the chief part of her attentions.\nWith the young people, whose applause she thoroughly gained, her method was pretty simple. She did not pester their young brains with too much learning, but, on the contrary, let them have their own way in regard to educating themselves; for what instruction is more effectual than self-instruction? The eldest was rather fond of books, and as there was in the old library at Queen's Crawley a considerable provision of works of light literature of the last century, both in the French and English languages (they had been purchased by the Secretary of the Tape and Sealing Wax Office at the period of his disgrace), and as nobody ever troubled the bookshelves but herself, Rebecca was enabled agreeably, and, as it were, in playing, to impart a great deal of instruction to Miss Rose Crawley.\nShe and Miss Rose thus read together many delightful French and English works, among which may be mentioned those of the learned Dr. Smollett, of the ingenious Mr. Henry Fielding, of the graceful and fantastic Monsieur Crebillon the younger, whom our immortal poet Gray so much admired, and of the universal Monsieur de Voltaire. Once, when Mr. Crawley asked what the young people were reading, the governess replied \"Smollett.\" \"Oh, Smollett,\" said Mr. Crawley, quite satisfied. \"His history is more dull, but by no means so dangerous as that of Mr. Hume. It is history you are reading?\" \"Yes,\" said Miss Rose; without, however, adding that it was the history of Mr. Humphrey Clinker. On another occasion he was rather scandalised at finding his sister with a book of French plays; but as the governess remarked that it was for the purpose of acquiring the French idiom in conversation, he was fain to be content. Mr. Crawley, as a diplomatist, was exceedingly proud of his own skill in speaking the French language (for he was of the world still), and not a little pleased with the compliments which the governess continually paid him upon his proficiency.\nMiss Violet's tastes were, on the contrary, more rude and boisterous than those of her sister. She knew the sequestered spots where the hens laid their eggs. She could climb a tree to rob the nests of the feathered songsters of their speckled spoils. And her pleasure was to ride the young colts, and to scour the plains like Camilla. She was the favourite of her father and of the stablemen. She was the darling, and withal the terror of the cook; for she discovered the haunts of the jam-pots, and would attack them when they were within her reach. She and her sister were engaged in constant battles. Any of which peccadilloes, if Miss Sharp discovered, she did not tell them to Lady Crawley; who would have told them to the father, or worse, to Mr. Crawley; but promised not to tell if Miss Violet would be a good girl and love her governess.\nWith Mr. Crawley Miss Sharp was respectful and obedient. She used to consult him on passages of French which she could not understand, though her mother was a Frenchwoman, and which he would construe to her satisfaction: and, besides giving her his aid in profane literature, he was kind enough to select for her books of a more serious tendency, and address to her much of his conversation. She admired, beyond measure, his speech at the Quashimaboo-Aid Society; took an interest in his pamphlet on malt: was often affected, even to tears, by his discourses of an evening, and would say--\"Oh, thank you, sir,\" with a sigh, and a look up to heaven, that made him occasionally condescend to shake hands with her. \"Blood is everything, after all,\" would that aristocratic religionist say. \"How Miss Sharp is awakened by my words, when not one of the people here is touched. I am too fine for them--too delicate. I must familiarise my style--but she understands it. Her mother was a Montmorency.\"\nIndeed it was from this famous family, as it appears, that Miss Sharp, by the mother's side, was descended. Of course she did not say that her mother had been on the stage; it would have shocked Mr. Crawley's religious scruples. How many noble emigres had this horrid revolution plunged in poverty! She had several stories about her ancestors ere she had been many months in the house; some of which Mr. Crawley happened to find in D'Hozier's dictionary, which was in the library, and which strengthened his belief in their truth, and in the high-breeding of Rebecca. Are we to suppose from this curiosity and prying into dictionaries, could our heroine suppose that Mr. Crawley was interested in her?--no, only in a friendly way. Have we not stated that he was attached to Lady Jane Sheepshanks?\nHe took Rebecca to task once or twice about the propriety of playing at backgammon with Sir Pitt, saying that it was a godless amusement, and that she would be much better engaged in reading \"Thrump's Legacy,\" or \"The Blind Washerwoman of Moorfields,\" or any work of a more serious nature; but Miss Sharp said her dear mother used often to play the same game with the old Count de Trictrac and the venerable Abbe du Cornet, and so found an excuse for this and other worldly amusements.\nBut it was not only by playing at backgammon with the Baronet, that the little governess rendered herself agreeable to her employer. She found many different ways of being useful to him. She read over, with indefatigable patience, all those law papers, with which, before she came to Queen's Crawley, he had promised to entertain her. She volunteered to copy many of his letters, and adroitly altered the spelling of them so as to suit the usages of the present day. She became interested in everything appertaining to the estate, to the farm, the park, the garden, and the stables; and so delightful a companion was she, that the Baronet would seldom take his after-breakfast walk without her (and the children of course), when she would give her advice as to the trees which were to be lopped in the shrubberies, the garden-beds to be dug, the crops which were to be cut, the horses which were to go to cart or plough. Before she had been a year at Queen's Crawley she had quite won the Baronet's confidence; and the conversation at the dinner-table, which before used to be held between him and Mr. Horrocks the butler, was now almost exclusively between Sir Pitt and Miss Sharp. She was almost mistress of the house when Mr. Crawley was absent, but conducted herself in her new and exalted situation with such circumspection and modesty as not to offend the authorities of the kitchen and stable, among whom her behaviour was always exceedingly modest and affable. She was quite a different person from the haughty, shy, dissatisfied little girl whom we have known previously, and this change of temper proved great prudence, a sincere desire of amendment, or at any rate great moral courage on her part. Whether it was the heart which dictated this new system of complaisance and humility adopted by our Rebecca, is to be proved by her after-history. A system of hypocrisy, which lasts through whole years, is one seldom satisfactorily practised by a person of one-and-twenty; however, our readers will recollect, that, though young in years, our heroine was old in life and experience, and we have written to no purpose if they have not discovered that she was a very clever woman.\nThe elder and younger son of the house of Crawley were, like the gentleman and lady in the weather-box, never at home together--they hated each other cordially: indeed, Rawdon Crawley, the dragoon, had a great contempt for the establishment altogether, and seldom came thither except when his aunt paid her annual visit.\nThe great good quality of this old lady has been mentioned. She possessed seventy thousand pounds, and had almost adopted Rawdon. She disliked her elder nephew exceedingly, and despised him as a milksop. In return he did not hesitate to state that her soul was irretrievably lost, and was of opinion that his brother's chance in the next world was not a whit better. \"She is a godless woman of the world,\" would Mr. Crawley say; \"she lives with atheists and Frenchmen. My mind shudders when I think of her awful, awful situation, and that, near as she is to the grave, she should be so given up to vanity, licentiousness, profaneness, and folly.\" In fact, the old lady declined altogether to hear his hour's lecture of an evening; and when she came to Queen's Crawley alone, he was obliged to pretermit his usual devotional exercises.\n\"Shut up your sarmons, Pitt, when Miss Crawley comes down,\" said his father; \"she has written to say that she won't stand the preachifying.\"\n\"O, sir! consider the servants.\"\n\"The servants be hanged,\" said Sir Pitt; and his son thought even worse would happen were they deprived of the benefit of his instruction.\n\"Why, hang it, Pitt!\" said the father to his remonstrance. \"You wouldn't be such a flat as to let three thousand a year go out of the family?\"\n\"What is money compared to our souls, sir?\" continued Mr. Crawley.\n\"You mean that the old lady won't leave the money to you?\"--and who knows but it was Mr. Crawley's meaning?\nOld Miss Crawley was certainly one of the reprobate. She had a snug little house in Park Lane, and, as she ate and drank a great deal too much during the season in London, she went to Harrowgate or Cheltenham for the summer. She was the most hospitable and jovial of old vestals, and had been a beauty in her day, she said. (All old women were beauties once, we very well know.) She was a bel esprit, and a dreadful Radical for those days. She had been in France (where St. Just, they say, inspired her with an unfortunate passion), and loved, ever after, French novels, French cookery, and French wines. She read Voltaire, and had Rousseau by heart; talked very lightly about divorce, and most energetically of the rights of women. She had pictures of Mr. Fox in every room in the house: when that statesman was in opposition, I am not sure that she had not flung a main with him; and when he came into office, she took great credit for bringing over to him Sir Pitt and his colleague for Queen's Crawley, although Sir Pitt would have come over himself, without any trouble on the honest lady's part. It is needless to say that Sir Pitt was brought to change his views after the death of the great Whig statesman.\nThis worthy old lady took a fancy to Rawdon Crawley when a boy, sent him to Cambridge (in opposition to his brother at Oxford), and, when the young man was requested by the authorities of the first-named University to quit after a residence of two years, she bought him his commission in the Life Guards Green.\nA perfect and celebrated \"blood,\" or dandy about town, was this young officer. Boxing, rat-hunting, the fives court, and four-in-hand driving were then the fashion of our British aristocracy; and he was an adept in all these noble sciences. And though he belonged to the household troops, who, as it was their duty to rally round the Prince Regent, had not shown their valour in foreign service yet, Rawdon Crawley had already (apropos of play, of which he was immoderately fond) fought three bloody duels, in which he gave ample proofs of his contempt for death.\n\"And for what follows after death,\" would Mr. Crawley observe, throwing his gooseberry-coloured eyes up to the ceiling. He was always thinking of his brother's soul, or of the souls of those who differed with him in opinion: it is a sort of comfort which many of the serious give themselves.\nSilly, romantic Miss Crawley, far from being horrified at the courage of her favourite, always used to pay his debts after his duels; and would not listen to a word that was whispered against his morality. \"He will sow his wild oats,\" she would say, \"and is worth far more than that puling hypocrite of a brother of his.\"",
        "paragraph_chars": [
            [
                0,
                1606
            ],
            [
                1606,
                1820
            ],
            [
                1820,
                2321
            ],
            [
                2321,
                3115
            ],
            [
                3115,
                4274
            ],
            [
                4274,
                5121
            ],
            [
                5121,
                6115
            ],
            [
                6115,
                6912
            ],
            [
                6912,
                7398
            ],
            [
                7398,
                9586
            ],
            [
                9586,
                9907
            ],
            [
                9907,
                10742
            ],
            [
                10742,
                10883
            ],
            [
                10883,
                10916
            ],
            [
                10916,
                11055
            ],
            [
                11055,
                11198
            ],
            [
                11198,
                11265
            ],
            [
                11265,
                11373
            ],
            [
                11373,
                12588
            ],
            [
                12588,
                12899
            ],
            [
                12899,
                13463
            ],
            [
                13463,
                13755
            ],
            [
                13755,
                14076
            ]
        ],
        "segment_chars": [
            [
                0,
                267
            ],
            [
                267,
                471
            ],
            [
                471,
                524
            ],
            [
                524,
                812
            ],
            [
                812,
                975
            ],
            [
                975,
                1171
            ],
            [
                1171,
                1361
            ],
            [
                1361,
                1416
            ],
            [
                1416,
                1457
            ],
            [
                1457,
                1606
            ],
            [
                1606,
                1820
            ],
            [
                1820,
                2096
            ],
            [
                2096,
                2321
            ],
            [
                2321,
                2412
            ],
            [
                2412,
                2621
            ],
            [
                2621,
                3115
            ],
            [
                3115,
                3445
            ],
            [
                3445,
                3544
            ],
            [
                3544,
                3595
            ],
            [
                3595,
                3672
            ],
            [
                3672,
                3704
            ],
            [
                3704,
                3801
            ],
            [
                3801,
                4030
            ],
            [
                4030,
                4274
            ],
            [
                4274,
                4369
            ],
            [
                4369,
                4432
            ],
            [
                4432,
                4525
            ],
            [
                4525,
                4609
            ],
            [
                4609,
                4667
            ],
            [
                4667,
                4825
            ],
            [
                4825,
                4878
            ],
            [
                4878,
                5121
            ],
            [
                5121,
                5178
            ],
            [
                5178,
                5513
            ],
            [
                5513,
                5833
            ],
            [
                5833,
                5908
            ],
            [
                5908,
                5993
            ],
            [
                5993,
                6031
            ],
            [
                6031,
                6084
            ],
            [
                6084,
                6115
            ],
            [
                6115,
                6223
            ],
            [
                6223,
                6344
            ],
            [
                6344,
                6414
            ],
            [
                6414,
                6683
            ],
            [
                6683,
                6846
            ],
            [
                6846,
                6912
            ],
            [
                6912,
                7398
            ],
            [
                7398,
                7531
            ],
            [
                7531,
                7585
            ],
            [
                7585,
                7733
            ],
            [
                7733,
                7865
            ],
            [
                7865,
                8319
            ],
            [
                8319,
                8581
            ],
            [
                8581,
                8867
            ],
            [
                8867,
                9107
            ],
            [
                9107,
                9254
            ],
            [
                9254,
                9586
            ],
            [
                9586,
                9907
            ],
            [
                9907,
                9967
            ],
            [
                9967,
                10037
            ],
            [
                10037,
                10111
            ],
            [
                10111,
                10274
            ],
            [
                10274,
                10376
            ],
            [
                10376,
                10554
            ],
            [
                10554,
                10742
            ],
            [
                10742,
                10883
            ],
            [
                10883,
                10892
            ],
            [
                10892,
                10916
            ],
            [
                10916,
                11055
            ],
            [
                11055,
                11077
            ],
            [
                11077,
                11114
            ],
            [
                11114,
                11198
            ],
            [
                11198,
                11242
            ],
            [
                11242,
                11265
            ],
            [
                11265,
                11323
            ],
            [
                11323,
                11373
            ],
            [
                11373,
                11426
            ],
            [
                11426,
                11598
            ],
            [
                11598,
                11697
            ],
            [
                11697,
                11752
            ],
            [
                11752,
                11813
            ],
            [
                11813,
                11978
            ],
            [
                11978,
                12106
            ],
            [
                12106,
                12475
            ],
            [
                12475,
                12588
            ],
            [
                12588,
                12899
            ],
            [
                12899,
                12978
            ],
            [
                12978,
                13140
            ],
            [
                13140,
                13463
            ],
            [
                13463,
                13583
            ],
            [
                13583,
                13755
            ],
            [
                13755,
                13961
            ],
            [
                13961,
                14076
            ]
        ],
        "overlap_chars": [
            [
                115,
                117
            ],
            [
                4,
                7
            ],
            [
                118,
                124
            ],
            [
                135,
                165
            ],
            [
                180,
                192
            ],
            [
                39,
                42
            ],
            [
                208,
                238
            ],
            [
                265,
                267
            ],
            [
                343,
                351
            ],
            [
                444,
                447
            ],
            [
                360,
                364
            ],
            [
                375,
                386
            ],
            [
                312,
                314
            ],
            [
                286,
                290
            ],
            [
                408,
                417
            ],
            [
                392,
                395
            ],
            [
                469,
                470
            ],
            [
                471,
                497
            ],
            [
                522,
                524
            ],
            [
                524,
                525
            ],
            [
                593,
                682
            ],
            [
                710,
                812
            ],
            [
                812,
                839
            ],
            [
                847,
                893
            ],
            [
                897,
                905
            ],
            [
                919,
                920
            ],
            [
                928,
                964
            ],
            [
                973,
                975
            ],
            [
                975,
                1038
            ],
            [
                1053,
                1062
            ],
            [
                1044,
                1045
            ],
            [
                1064,
                1138
            ],
            [
                1171,
                1175
            ],
            [
                1188,
                1243
            ],
            [
                1266,
                1268
            ],
            [
                1269,
                1338
            ],
            [
                1349,
                1361
            ],
            [
                1361,
                1416
            ],
            [
                1416,
                1456
            ],
            [
                1457,
                1496
            ],
            [
                1589,
                1593
            ],
            [
                1509,
                1559
            ],
            [
                1594,
                1606
            ],
            [
                1606,
                1633
            ],
            [
                1641,
                1653
            ],
            [
                1785,
                1787
            ],
            [
                1663,
                1678
            ],
            [
                1686,
                1713
            ],
            [
                1726,
                1753
            ],
            [
                1775,
                1784
            ],
            [
                1807,
                1820
            ],
            [
                1820,
                1859
            ],
            [
                1870,
                1875
            ],
            [
                2012,
                2015
            ],
            [
                1883,
                1931
            ],
            [
                1936,
                1944
            ],
            [
                1955,
                1966
            ],
            [
                1983,
                2008
            ],
            [
                1932,
                1935
            ],
            [
                2040,
                2063
            ],
            [
                2094,
                2096
            ],
            [
                2096,
                2156
            ],
            [
                2158,
                2197
            ],
            [
                2212,
                2214
            ],
            [
                2220,
                2286
            ],
            [
                2305,
                2321
            ],
            [
                2321,
                2342
            ],
            [
                2380,
                2412
            ],
            [
                2412,
                2477
            ],
            [
                2496,
                2526
            ],
            [
                2537,
                2557
            ],
            [
                2621,
                2670
            ],
            [
                3037,
                3041
            ],
            [
                2675,
                2712
            ],
            [
                2741,
                2766
            ],
            [
                2793,
                2795
            ],
            [
                2800,
                2818
            ],
            [
                2786,
                2787
            ],
            [
                2945,
                2951
            ],
            [
                2993,
                3002
            ],
            [
                3015,
                3024
            ],
            [
                3058,
                3115
            ],
            [
                3115,
                3192
            ],
            [
                3194,
                3199
            ],
            [
                3223,
                3257
            ],
            [
                3261,
                3294
            ],
            [
                3311,
                3314
            ],
            [
                3409,
                3445
            ],
            [
                3445,
                3543
            ],
            [
                3544,
                3595
            ],
            [
                3595,
                3610
            ],
            [
                3616,
                3625
            ],
            [
                3638,
                3672
            ],
            [
                3672,
                3703
            ],
            [
                3704,
                3734
            ],
            [
                3745,
                3801
            ],
            [
                3801,
                3857
            ],
            [
                3869,
                3901
            ],
            [
                3905,
                3918
            ],
            [
                3928,
                3958
            ],
            [
                3973,
                3985
            ],
            [
                4001,
                4009
            ],
            [
                4021,
                4030
            ],
            [
                4030,
                4041
            ],
            [
                4061,
                4102
            ],
            [
                4116,
                4122
            ],
            [
                4041,
                4042
            ],
            [
                4165,
                4168
            ],
            [
                4182,
                4256
            ],
            [
                4272,
                4274
            ],
            [
                4274,
                4299
            ],
            [
                4318,
                4322
            ],
            [
                4332,
                4347
            ],
            [
                4357,
                4367
            ],
            [
                4367,
                4369
            ],
            [
                4369,
                4381
            ],
            [
                4394,
                4432
            ],
            [
                4432,
                4461
            ],
            [
                4466,
                4471
            ],
            [
                4525,
                4528
            ],
            [
                4546,
                4569
            ],
            [
                4607,
                4609
            ],
            [
                4609,
                4648
            ],
            [
                4652,
                4665
            ],
            [
                4686,
                4691
            ],
            [
                4675,
                4686
            ],
            [
                4770,
                4773
            ],
            [
                4703,
                4768
            ],
            [
                4823,
                4825
            ],
            [
                4825,
                4878
            ],
            [
                4905,
                4929
            ],
            [
                4878,
                4884
            ],
            [
                4929,
                4934
            ],
            [
                5040,
                5060
            ],
            [
                4903,
                4904
            ],
            [
                5061,
                5121
            ],
            [
                5121,
                5178
            ],
            [
                5178,
                5291
            ],
            [
                5583,
                5584
            ],
            [
                5293,
                5296
            ],
            [
                5513,
                5516
            ],
            [
                5627,
                5708
            ],
            [
                5291,
                5292
            ],
            [
                5710,
                5748
            ],
            [
                5751,
                5768
            ],
            [
                5511,
                5512
            ],
            [
                5908,
                5947
            ],
            [
                5947,
                5948
            ],
            [
                5949,
                5993
            ],
            [
                5993,
                6001
            ],
            [
                6021,
                6029
            ],
            [
                6007,
                6015
            ],
            [
                6060,
                6079
            ],
            [
                6050,
                6058
            ],
            [
                6082,
                6084
            ],
            [
                6084,
                6115
            ],
            [
                6115,
                6153
            ],
            [
                6157,
                6159
            ],
            [
                6167,
                6184
            ],
            [
                6208,
                6223
            ],
            [
                6223,
                6286
            ],
            [
                6342,
                6344
            ],
            [
                6383,
                6393
            ],
            [
                6367,
                6370
            ],
            [
                6394,
                6401
            ],
            [
                6348,
                6358
            ],
            [
                6405,
                6412
            ],
            [
                6414,
                6457
            ],
            [
                6499,
                6569
            ],
            [
                6580,
                6595
            ],
            [
                6600,
                6644
            ],
            [
                6681,
                6682
            ],
            [
                6683,
                6710
            ],
            [
                6777,
                6816
            ],
            [
                6818,
                6846
            ],
            [
                6846,
                6912
            ],
            [
                6912,
                6914
            ],
            [
                6920,
                6927
            ],
            [
                6936,
                6955
            ],
            [
                6973,
                7048
            ],
            [
                7200,
                7256
            ],
            [
                7271,
                7334
            ],
            [
                7396,
                7398
            ],
            [
                7398,
                7459
            ],
            [
                7461,
                7486
            ],
            [
                7496,
                7531
            ],
            [
                7531,
                7545
            ],
            [
                7556,
                7585
            ],
            [
                7585,
                7588
            ],
            [
                7589,
                7598
            ],
            [
                7629,
                7632
            ],
            [
                7639,
                7649
            ],
            [
                7731,
                7733
            ],
            [
                7733,
                7756
            ],
            [
                7765,
                7790
            ],
            [
                7803,
                7811
            ],
            [
                7863,
                7865
            ],
            [
                7865,
                7900
            ],
            [
                7917,
                7928
            ],
            [
                7932,
                7945
            ],
            [
                7956,
                7962
            ],
            [
                7964,
                7984
            ],
            [
                8025,
                8036
            ],
            [
                7914,
                7916
            ],
            [
                8050,
                8079
            ],
            [
                8088,
                8152
            ],
            [
                8163,
                8192
            ],
            [
                7950,
                7951
            ],
            [
                8217,
                8239
            ],
            [
                8244,
                8249
            ],
            [
                8261,
                8270
            ],
            [
                8317,
                8318
            ],
            [
                8319,
                8528
            ],
            [
                8548,
                8581
            ],
            [
                8581,
                8650
            ],
            [
                8847,
                8853
            ],
            [
                8739,
                8759
            ],
            [
                8865,
                8867
            ],
            [
                8867,
                8916
            ],
            [
                8921,
                9004
            ],
            [
                9012,
                9107
            ],
            [
                9389,
                9415
            ],
            [
                9417,
                9421
            ],
            [
                9423,
                9468
            ],
            [
                9478,
                9493
            ],
            [
                9565,
                9586
            ],
            [
                9586,
                9624
            ],
            [
                9636,
                9640
            ],
            [
                9690,
                9712
            ],
            [
                9684,
                9685
            ],
            [
                9714,
                9745
            ],
            [
                9747,
                9812
            ],
            [
                9827,
                9854
            ],
            [
                9863,
                9907
            ],
            [
                9933,
                9946
            ],
            [
                9971,
                10037
            ],
            [
                10037,
                10040
            ],
            [
                10084,
                10092
            ],
            [
                10050,
                10066
            ],
            [
                10097,
                10109
            ],
            [
                10078,
                10083
            ],
            [
                10111,
                10123
            ],
            [
                10150,
                10191
            ],
            [
                10207,
                10225
            ],
            [
                10192,
                10195
            ],
            [
                10266,
                10274
            ],
            [
                10274,
                10283
            ],
            [
                10361,
                10364
            ],
            [
                10284,
                10312
            ],
            [
                10319,
                10330
            ],
            [
                10313,
                10318
            ],
            [
                10331,
                10334
            ],
            [
                10374,
                10375
            ],
            [
                10642,
                10658
            ],
            [
                10680,
                10684
            ],
            [
                10596,
                10598
            ],
            [
                10604,
                10607
            ],
            [
                10740,
                10741
            ],
            [
                10807,
                10817
            ],
            [
                10802,
                10806
            ],
            [
                10763,
                10764
            ],
            [
                10819,
                10823
            ],
            [
                10855,
                10883
            ],
            [
                11373,
                11403
            ],
            [
                11415,
                11426
            ],
            [
                11426,
                11466
            ],
            [
                11476,
                11544
            ],
            [
                11468,
                11471
            ],
            [
                11549,
                11560
            ],
            [
                11568,
                11598
            ],
            [
                11598,
                11601
            ],
            [
                11657,
                11695
            ],
            [
                11651,
                11656
            ],
            [
                11817,
                11835
            ],
            [
                11772,
                11777
            ],
            [
                11910,
                11915
            ],
            [
                11929,
                11978
            ],
            [
                11978,
                11995
            ],
            [
                11997,
                12000
            ],
            [
                12005,
                12013
            ],
            [
                12022,
                12105
            ],
            [
                12588,
                12673
            ],
            [
                12716,
                12743
            ],
            [
                12754,
                12760
            ],
            [
                12792,
                12816
            ],
            [
                12832,
                12891
            ],
            [
                12897,
                12899
            ],
            [
                12963,
                12976
            ],
            [
                12954,
                12957
            ],
            [
                12899,
                12900
            ],
            [
                12913,
                12952
            ],
            [
                12976,
                12978
            ],
            [
                12978,
                13062
            ],
            [
                13089,
                13123
            ],
            [
                13138,
                13140
            ],
            [
                13140,
                13191
            ],
            [
                13252,
                13255
            ],
            [
                13214,
                13216
            ],
            [
                13297,
                13325
            ],
            [
                13379,
                13422
            ],
            [
                13436,
                13463
            ],
            [
                13755,
                13842
            ],
            [
                13850,
                13946
            ],
            [
                13959,
                13960
            ],
            [
                13961,
                14076
            ]
        ],
        "row_chars": [
            [
                0,
                267
            ],
            [
                267,
                471
            ],
            [
                471,
                524
            ],
            [
                524,
                812
            ],
            [
                812,
                975
            ],
            [
                975,
                1171
            ],
            [
                1171,
                1361
            ],
            [
                1361,
                1416
            ],
            [
                1416,
                1457
            ],
            [
                1457,
                1606
            ],
            [
                1606,
                1820
            ],
            [
                1820,
                2096
            ],
            [
                2096,
                2321
            ],
            [
                2321,
                2412
            ],
            [
                2412,
                2621
            ],
            [
                2621,
                3115
            ],
            [
                3115,
                3445
            ],
            [
                3445,
                3544
            ],
            [
                3544,
                3595
            ],
            [
                3595,
                3672
            ],
            [
                3672,
                3704
            ],
            [
                3704,
                3801
            ],
            [
                3801,
                4030
            ],
            [
                4030,
                4274
            ],
            [
                4274,
                4369
            ],
            [
                4369,
                4432
            ],
            [
                4432,
                4609
            ],
            [
                4609,
                4825
            ],
            [
                4825,
                4878
            ],
            [
                4878,
                5121
            ],
            [
                5121,
                5178
            ],
            [
                5178,
                5833
            ],
            [
                5833,
                5908
            ],
            [
                5908,
                5993
            ],
            [
                5993,
                6084
            ],
            [
                6084,
                6115
            ],
            [
                6115,
                6223
            ],
            [
                6223,
                6344
            ],
            [
                6344,
                6414
            ],
            [
                6414,
                6683
            ],
            [
                6683,
                6846
            ],
            [
                6846,
                6912
            ],
            [
                6912,
                7398
            ],
            [
                7398,
                7531
            ],
            [
                7531,
                7585
            ],
            [
                7585,
                7733
            ],
            [
                7733,
                7865
            ],
            [
                7865,
                8319
            ],
            [
                8319,
                8581
            ],
            [
                8581,
                8867
            ],
            [
                8867,
                9107
            ],
            [
                9107,
                9254
            ],
            [
                9254,
                9586
            ],
            [
                9586,
                9907
            ],
            [
                9907,
                10037
            ],
            [
                10037,
                10274
            ],
            [
                10274,
                10554
            ],
            [
                10554,
                10742
            ],
            [
                10742,
                10883
            ],
            [
                10883,
                10892
            ],
            [
                10892,
                10916
            ],
            [
                10916,
                11055
            ],
            [
                11055,
                11077
            ],
            [
                11077,
                11114
            ],
            [
                11114,
                11198
            ],
            [
                11198,
                11242
            ],
            [
                11242,
                11265
            ],
            [
                11265,
                11323
            ],
            [
                11323,
                11373
            ],
            [
                11373,
                11426
            ],
            [
                11426,
                11598
            ],
            [
                11598,
                11978
            ],
            [
                11978,
                12106
            ],
            [
                12106,
                12475
            ],
            [
                12475,
                12588
            ],
            [
                12588,
                12899
            ],
            [
                12899,
                12978
            ],
            [
                12978,
                13140
            ],
            [
                13140,
                13463
            ],
            [
                13463,
                13583
            ],
            [
                13583,
                13755
            ],
            [
                13755,
                13961
            ],
            [
                13961,
                14076
            ]
        ]
    },
    "abridged": {
        "text": "It now became Rebecca's duty to make herself agreeable to the Crawleys, and to gain their confidence. If there was some selfishness in this, who can blame her?\n\"I am alone in the world,\" she thought. \"While that little pink-faced chit Amelia, with not half my sense, has ten thousand pounds, poor Rebecca (and my figure is far better than hers) has only herself and her own wits to trust to. Well, let us see if my wits can provide me with an honourable maintenance, and some day I will show Miss Amelia my real superiority. Not that I dislike poor Amelia: who can dislike such a harmless creature? - only it will be a fine day when I can take my place above her in the world.\"\nThus our little romantic friend formed visions of the future. We should not be scandalised that, in all her castles in the air, a husband was the main inhabitant. Of what else have young ladies to think, but husbands? Of what else do their dear mammas think?\n\"I must be my own mamma,\" said Rebecca; with a tingling consciousness of defeat, as she thought of Jos Sedley.\nSo she wisely determined to make her position at Queen's Crawley comfortable and secure, and resolved to make friends of everyone who could affect her comfort.\nAs my Lady Crawley was not one of these people, and was, moreover, so indolent and void of character as to be of no consequence, Rebecca soon found that she need not cultivate her good will. She used to talk to her pupils about their \"poor mamma\"; and though she treated that lady with every show of respect, it was to the rest of the family that she wisely directed her attentions.\nWith the young people, her method was pretty simple. She did not pester their young brains with too much learning, but let them have their own way in educating themselves. The eldest was rather fond of books, and as there were in the old library at Queen's Crawley many works of light literature in French and English, which nobody else read, Rebecca could agreeably impart a great deal of instruction to Miss Rose Crawley.\nShe and Miss Rose thus read together many delightful French and English works; among them those of the learned Dr. Smollett, the ingenious Mr. Henry Fielding, and the universal Monsieur de Voltaire. Once, when Mr. Crawley asked what the young people were reading, the governess replied \"Smollett.\"\n\"Oh, Smollett,\" said Mr. Crawley, quite satisfied. \"His history is dull, but not so dangerous as that of Mr. Hume. It is history you are reading?\"\n\"Yes,\" said Miss Rose; without adding that it was the history of Mr. Humphrey Clinker. On another occasion he was rather scandalised at finding her with a book of French plays; but when the governess said that it was for the purpose of learning French idiom, he was content. Mr. Crawley was exceedingly proud of his own skill in French, and pleased with the compliments which the governess continually paid him upon it.\nMiss Violet's tastes were more boisterous than her sister's. She knew the hidden spots where the hens laid their eggs. She could climb a tree to rob nests; and loved to ride the young colts. She was the favourite of her father and the stablemen, and the darling and terror of the cook; for she discovered the haunts of the jam-pots. She and her sister were engaged in constant battles. If Miss Sharp discovered any of her little crimes, she merely promised not to tell, if Miss Violet would be a good girl and love her governess.\nWith Mr. Crawley Miss Sharp was respectful and obedient. She used to consult him on passages of French which she could not understand, though her mother was a Frenchwoman; and she was often affected, even to tears, by his discourses of an evening, and would say, \"Oh, thank you, sir,\" with a sigh, and look up to heaven.\n\"How Miss Sharp is awakened by my words,\" he would reflect, \"when not one of the people here is touched. I am too delicate for them - but she understands my style. Her mother was a Montmorency.\"\nIndeed it was from this famous family, it seemed, that Miss Sharp was descended. Of course she did not say that her mother had been on the stage. The French revolution had plunged many noble families into poverty. She had several stories about her ancestors before long; some of which Mr. Crawley happened to find in D'Hozier's dictionary, in the library, which strengthened his belief in their truth.\nAre we to suppose from this that Mr. Crawley was interested in her? - no, only in a friendly way. Have we not stated that he was attached to Lady Jane Sheepshanks?\nHe reprimanded Rebecca once or twice about playing at backgammon with Sir Pitt, saying that it was a godless amusement; but Miss Sharp said her dear mother used often to play it with the old Count de Trictrac and the venerable Abbe du Cornet.\nBut it was not only by playing at backgammon with the Baronet that the little governess made herself agreeable to her employer. She found many ways of being useful to him. She patiently read over all his law papers. She volunteered to copy his letters, and adroitly corrected their spelling. She became interested in everything about the estate, the farm, the garden and the stables; and the Baronet began to take his after-breakfast walk with her (and the children of course), when she would give her advice about trees which were to be lopped, garden-beds to be dug, and crops to be cut.\nBefore she had been a year at Queen's Crawley she had quite won the Baronet's confidence; and the conversation at the dinner-table, which before used to be held between him and Mr. Horrocks the butler, was now between Sir Pitt and Miss Sharp. She was almost mistress of the house when Mr. Crawley was absent, but behaved so modestly as not to offend the servants. She was quite a different person from the haughty, dissatisfied little girl whom we have known previously, and this change of temper showed great prudence, a sincere desire of amendment, or at any rate great moral courage on her part. Our readers will recollect that though young in years, our heroine was old in experience, and a very clever woman.\nThe elder and younger son of the house were never at home together - they hated each other cordially. Indeed, Rawdon Crawley, the dragoon, had a great contempt for the house altogether, and seldom came there except when his aunt paid her annual visit.\nThis old lady possessed seventy thousand pounds, and had almost adopted Rawdon. She despised her elder nephew as a milksop, and in return he stated that her soul was irretrievably lost, and that his brother's was no better. \"She is a vain and godless woman of the world,\" Mr. Crawley would say. When she came to stay, he had to give up his prayers. As his father said, \"she wouldn't stand the preachifying.\"\nOld Miss Crawley was certainly a reprobate. She had a snug little house in Park Lane; she ate and drank a great deal too much during the season in London, and went to Harrogate or Cheltenham for the summer. She had been a beauty in her day, she said, and had been in France, and loved French novels, French cookery, and French wines. She read Voltaire and Rousseau; talked very lightly about divorce, and most energetically of the rights of women.\nThis worthy old lady took a fancy to Rawdon Crawley when a boy, sent him to Cambridge, and, when the young man was asked by the University to quit after two years, she bought him his commission in the Life Guards.\nThe young officer was a celebrated \"blood,\" or dandy about town. Boxing, rat-hunting, the fives court, and four-in-hand driving were then the fashion; and he was an adept in all these. And though he belonged to the household troops, who did not go to battle, Rawdon Crawley had already fought three bloody duels, in which he gave proof of his contempt for death.\nSilly, romantic Miss Crawley, far from being horrified at the courage of her favourite, used to pay his debts after his duels; and would not listen to a word that was whispered against him.\n\"He will sow his wild oats,\" she would say, \"and is worth far more than that puling hypocrite of a brother of his.\"",
        "paragraph_chars": [
            [
                0,
                160
            ],
            [
                160,
                678
            ],
            [
                678,
                937
            ],
            [
                937,
                1048
            ],
            [
                1048,
                1208
            ],
            [
                1208,
                1591
            ],
            [
                1591,
                2015
            ],
            [
                2015,
                2313
            ],
            [
                2313,
                2460
            ],
            [
                2460,
                2880
            ],
            [
                2880,
                3410
            ],
            [
                3410,
                3731
            ],
            [
                3731,
                3926
            ],
            [
                3926,
                4328
            ],
            [
                4328,
                4492
            ],
            [
                4492,
                4735
            ],
            [
                4735,
                5325
            ],
            [
                5325,
                6039
            ],
            [
                6039,
                6291
            ],
            [
                6291,
                6699
            ],
            [
                6699,
                7147
            ],
            [
                7147,
                7361
            ],
            [
                7361,
                7724
            ],
            [
                7724,
                7914
            ],
            [
                7914,
                8029
            ]
        ],
        "segment_chars": [
            [
                0,
                102
            ],
            [
                102,
                160
            ],
            [
                160,
                200
            ],
            [
                200,
                392
            ],
            [
                392,
                525
            ],
            [
                525,
                599
            ],
            [
                599,
                678
            ],
            [
                678,
                740
            ],
            [
                740,
                841
            ],
            [
                841,
                896
            ],
            [
                896,
                937
            ],
            [
                937,
                1048
            ],
            [
                1048,
                1208
            ],
            [
                1208,
                1399
            ],
            [
                1399,
                1591
            ],
            [
                1591,
                1644
            ],
            [
                1644,
                1763
            ],
            [
                1763,
                2015
            ],
            [
                2015,
                2214
            ],
            [
                2214,
                2313
            ],
            [
                2313,
                2364
            ],
            [
                2364,
                2428
            ],
            [
                2428,
                2460
            ],
            [
                2460,
                2547
            ],
            [
                2547,
                2735
            ],
            [
                2735,
                2880
            ],
            [
                2880,
                2941
            ],
            [
                2941,
                2999
            ],
            [
                2999,
                3071
            ],
            [
                3071,
                3213
            ],
            [
                3213,
                3266
            ],
            [
                3266,
                3410
            ],
            [
                3410,
                3467
            ],
            [
                3467,
                3731
            ],
            [
                3731,
                3836
            ],
            [
                3836,
                3895
            ],
            [
                3895,
                3926
            ],
            [
                3926,
                4007
            ],
            [
                4007,
                4072
            ],
            [
                4072,
                4140
            ],
            [
                4140,
                4328
            ],
            [
                4328,
                4396
            ],
            [
                4396,
                4426
            ],
            [
                4426,
                4492
            ],
            [
                4492,
                4735
            ],
            [
                4735,
                4863
            ],
            [
                4863,
                4907
            ],
            [
                4907,
                4951
            ],
            [
                4951,
                5027
            ],
            [
                5027,
                5325
            ],
            [
                5325,
                5568
            ],
            [
                5568,
                5689
            ],
            [
                5689,
                5924
            ],
            [
                5924,
                6039
            ],
            [
                6039,
                6141
            ],
            [
                6141,
                6291
            ],
            [
                6291,
                6371
            ],
            [
                6371,
                6515
            ],
            [
                6515,
                6586
            ],
            [
                6586,
                6640
            ],
            [
                6640,
                6699
            ],
            [
                6699,
                6743
            ],
            [
                6743,
                6906
            ],
            [
                6906,
                7033
            ],
            [
                7033,
                7147
            ],
            [
                7147,
                7361
            ],
            [
                7361,
                7426
            ],
            [
                7426,
                7546
            ],
            [
                7546,
                7724
            ],
            [
                7724,
                7914
            ],
            [
                7914,
                8029
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                3,
                6
            ],
            [
                7,
                13
            ],
            [
                14,
                44
            ],
            [
                45,
                57
            ],
            [
                58,
                61
            ],
            [
                70,
                100
            ],
            [
                100,
                102
            ],
            [
                102,
                110
            ],
            [
                111,
                114
            ],
            [
                115,
                119
            ],
            [
                120,
                131
            ],
            [
                132,
                134
            ],
            [
                135,
                139
            ],
            [
                139,
                148
            ],
            [
                155,
                158
            ],
            [
                158,
                159
            ],
            [
                160,
                186
            ],
            [
                198,
                200
            ],
            [
                200,
                201
            ],
            [
                201,
                290
            ],
            [
                290,
                392
            ],
            [
                392,
                419
            ],
            [
                424,
                470
            ],
            [
                471,
                479
            ],
            [
                480,
                481
            ],
            [
                487,
                523
            ],
            [
                523,
                525
            ],
            [
                525,
                588
            ],
            [
                589,
                598
            ],
            [
                599,
                600
            ],
            [
                601,
                675
            ],
            [
                678,
                682
            ],
            [
                683,
                738
            ],
            [
                740,
                742
            ],
            [
                754,
                823
            ],
            [
                829,
                841
            ],
            [
                841,
                896
            ],
            [
                896,
                936
            ],
            [
                937,
                976
            ],
            [
                977,
                981
            ],
            [
                982,
                1032
            ],
            [
                1036,
                1048
            ],
            [
                1048,
                1075
            ],
            [
                1081,
                1093
            ],
            [
                1094,
                1096
            ],
            [
                1097,
                1112
            ],
            [
                1113,
                1140
            ],
            [
                1141,
                1168
            ],
            [
                1178,
                1187
            ],
            [
                1195,
                1208
            ],
            [
                1208,
                1247
            ],
            [
                1254,
                1259
            ],
            [
                1260,
                1263
            ],
            [
                1263,
                1311
            ],
            [
                1312,
                1320
            ],
            [
                1324,
                1335
            ],
            [
                1335,
                1360
            ],
            [
                1370,
                1373
            ],
            [
                1374,
                1397
            ],
            [
                1397,
                1399
            ],
            [
                1399,
                1459
            ],
            [
                1460,
                1499
            ],
            [
                1505,
                1507
            ],
            [
                1508,
                1574
            ],
            [
                1575,
                1591
            ],
            [
                1591,
                1612
            ],
            [
                1612,
                1644
            ],
            [
                1644,
                1709
            ],
            [
                1710,
                1740
            ],
            [
                1741,
                1761
            ],
            [
                1763,
                1812
            ],
            [
                1813,
                1817
            ],
            [
                1818,
                1855
            ],
            [
                1861,
                1886
            ],
            [
                1887,
                1889
            ],
            [
                1890,
                1908
            ],
            [
                1908,
                1909
            ],
            [
                1916,
                1922
            ],
            [
                1932,
                1941
            ],
            [
                1948,
                1957
            ],
            [
                1958,
                2015
            ],
            [
                2015,
                2092
            ],
            [
                2094,
                2099
            ],
            [
                2105,
                2139
            ],
            [
                2140,
                2173
            ],
            [
                2174,
                2177
            ],
            [
                2178,
                2214
            ],
            [
                2214,
                2312
            ],
            [
                2313,
                2364
            ],
            [
                2364,
                2379
            ],
            [
                2380,
                2389
            ],
            [
                2394,
                2428
            ],
            [
                2428,
                2459
            ],
            [
                2460,
                2490
            ],
            [
                2491,
                2547
            ],
            [
                2547,
                2603
            ],
            [
                2608,
                2640
            ],
            [
                2646,
                2659
            ],
            [
                2665,
                2695
            ],
            [
                2705,
                2717
            ],
            [
                2717,
                2725
            ],
            [
                2726,
                2735
            ],
            [
                2735,
                2746
            ],
            [
                2747,
                2788
            ],
            [
                2789,
                2795
            ],
            [
                2795,
                2796
            ],
            [
                2797,
                2800
            ],
            [
                2801,
                2875
            ],
            [
                2878,
                2880
            ],
            [
                2880,
                2905
            ],
            [
                2906,
                2910
            ],
            [
                2911,
                2926
            ],
            [
                2927,
                2937
            ],
            [
                2939,
                2941
            ],
            [
                2941,
                2953
            ],
            [
                2961,
                2999
            ],
            [
                2999,
                3028
            ],
            [
                3029,
                3034
            ],
            [
                3036,
                3039
            ],
            [
                3046,
                3069
            ],
            [
                3069,
                3071
            ],
            [
                3071,
                3110
            ],
            [
                3111,
                3124
            ],
            [
                3124,
                3129
            ],
            [
                3130,
                3141
            ],
            [
                3142,
                3145
            ],
            [
                3146,
                3211
            ],
            [
                3211,
                3213
            ],
            [
                3213,
                3266
            ],
            [
                3266,
                3290
            ],
            [
                3291,
                3297
            ],
            [
                3315,
                3320
            ],
            [
                3328,
                3348
            ],
            [
                3348,
                3349
            ],
            [
                3350,
                3410
            ],
            [
                3410,
                3467
            ],
            [
                3467,
                3580
            ],
            [
                3580,
                3581
            ],
            [
                3582,
                3585
            ],
            [
                3586,
                3589
            ],
            [
                3590,
                3671
            ],
            [
                3671,
                3672
            ],
            [
                3673,
                3711
            ],
            [
                3712,
                3729
            ],
            [
                3729,
                3730
            ],
            [
                3731,
                3770
            ],
            [
                3789,
                3790
            ],
            [
                3792,
                3836
            ],
            [
                3836,
                3844
            ],
            [
                3845,
                3853
            ],
            [
                3854,
                3862
            ],
            [
                3865,
                3884
            ],
            [
                3885,
                3893
            ],
            [
                3893,
                3895
            ],
            [
                3895,
                3926
            ],
            [
                3926,
                3964
            ],
            [
                3965,
                3967
            ],
            [
                3974,
                3991
            ],
            [
                3992,
                4007
            ],
            [
                4007,
                4070
            ],
            [
                4070,
                4072
            ],
            [
                4083,
                4093
            ],
            [
                4094,
                4097
            ],
            [
                4098,
                4105
            ],
            [
                4106,
                4116
            ],
            [
                4131,
                4138
            ],
            [
                4140,
                4183
            ],
            [
                4195,
                4265
            ],
            [
                4266,
                4281
            ],
            [
                4282,
                4326
            ],
            [
                4326,
                4327
            ],
            [
                4328,
                4355
            ],
            [
                4356,
                4395
            ],
            [
                4398,
                4426
            ],
            [
                4426,
                4492
            ],
            [
                4492,
                4494
            ],
            [
                4507,
                4514
            ],
            [
                4515,
                4534
            ],
            [
                4535,
                4610
            ],
            [
                4610,
                4666
            ],
            [
                4670,
                4733
            ],
            [
                4733,
                4735
            ],
            [
                4735,
                4796
            ],
            [
                4797,
                4822
            ],
            [
                4828,
                4863
            ],
            [
                4863,
                4877
            ],
            [
                4878,
                4907
            ],
            [
                4907,
                4910
            ],
            [
                4921,
                4930
            ],
            [
                4931,
                4934
            ],
            [
                4939,
                4949
            ],
            [
                4949,
                4951
            ],
            [
                4951,
                4974
            ],
            [
                4975,
                5000
            ],
            [
                5017,
                5025
            ],
            [
                5025,
                5027
            ],
            [
                5027,
                5062
            ],
            [
                5069,
                5080
            ],
            [
                5081,
                5094
            ],
            [
                5095,
                5101
            ],
            [
                5102,
                5122
            ],
            [
                5123,
                5134
            ],
            [
                5141,
                5143
            ],
            [
                5144,
                5173
            ],
            [
                5179,
                5243
            ],
            [
                5250,
                5279
            ],
            [
                5279,
                5280
            ],
            [
                5281,
                5303
            ],
            [
                5308,
                5313
            ],
            [
                5314,
                5323
            ],
            [
                5323,
                5324
            ],
            [
                5325,
                5534
            ],
            [
                5535,
                5568
            ],
            [
                5568,
                5637
            ],
            [
                5649,
                5655
            ],
            [
                5658,
                5678
            ],
            [
                5687,
                5689
            ],
            [
                5689,
                5738
            ],
            [
                5738,
                5821
            ],
            [
                5829,
                5924
            ],
            [
                5924,
                5950
            ],
            [
                5951,
                5955
            ],
            [
                5956,
                6001
            ],
            [
                6002,
                6017
            ],
            [
                6018,
                6039
            ],
            [
                6039,
                6077
            ],
            [
                6078,
                6082
            ],
            [
                6083,
                6105
            ],
            [
                6106,
                6107
            ],
            [
                6108,
                6139
            ],
            [
                6141,
                6206
            ],
            [
                6213,
                6240
            ],
            [
                6247,
                6291
            ],
            [
                6291,
                6304
            ],
            [
                6305,
                6371
            ],
            [
                6371,
                6374
            ],
            [
                6375,
                6383
            ],
            [
                6384,
                6400
            ],
            [
                6401,
                6413
            ],
            [
                6413,
                6418
            ],
            [
                6419,
                6431
            ],
            [
                6439,
                6480
            ],
            [
                6481,
                6499
            ],
            [
                6500,
                6503
            ],
            [
                6507,
                6515
            ],
            [
                6515,
                6524
            ],
            [
                6530,
                6533
            ],
            [
                6534,
                6562
            ],
            [
                6563,
                6574
            ],
            [
                6575,
                6580
            ],
            [
                6581,
                6584
            ],
            [
                6584,
                6585
            ],
            [
                6586,
                6602
            ],
            [
                6607,
                6611
            ],
            [
                6616,
                6618
            ],
            [
                6627,
                6630
            ],
            [
                6638,
                6639
            ],
            [
                6643,
                6653
            ],
            [
                6654,
                6658
            ],
            [
                6658,
                6659
            ],
            [
                6660,
                6664
            ],
            [
                6671,
                6699
            ],
            [
                6699,
                6729
            ],
            [
                6732,
                6743
            ],
            [
                6743,
                6783
            ],
            [
                6785,
                6853
            ],
            [
                6854,
                6857
            ],
            [
                6858,
                6869
            ],
            [
                6876,
                6906
            ],
            [
                6906,
                6909
            ],
            [
                6910,
                6948
            ],
            [
                6948,
                6953
            ],
            [
                6954,
                6972
            ],
            [
                6972,
                6977
            ],
            [
                6978,
                6983
            ],
            [
                6984,
                7033
            ],
            [
                7033,
                7050
            ],
            [
                7051,
                7054
            ],
            [
                7055,
                7063
            ],
            [
                7063,
                7146
            ],
            [
                7147,
                7232
            ],
            [
                7234,
                7261
            ],
            [
                7268,
                7274
            ],
            [
                7275,
                7299
            ],
            [
                7300,
                7359
            ],
            [
                7359,
                7361
            ],
            [
                7365,
                7378
            ],
            [
                7379,
                7382
            ],
            [
                7383,
                7384
            ],
            [
                7385,
                7424
            ],
            [
                7424,
                7426
            ],
            [
                7426,
                7510
            ],
            [
                7510,
                7544
            ],
            [
                7544,
                7546
            ],
            [
                7546,
                7597
            ],
            [
                7602,
                7605
            ],
            [
                7609,
                7611
            ],
            [
                7618,
                7646
            ],
            [
                7647,
                7690
            ],
            [
                7697,
                7724
            ],
            [
                7724,
                7811
            ],
            [
                7812,
                7908
            ],
            [
                7912,
                7913
            ],
            [
                7914,
                8029
            ]
        ],
        "row_chars": [
            [
                0,
                102
            ],
            [
                102,
                160
            ],
            [
                160,
                200
            ],
            [
                200,
                392
            ],
            [
                392,
                525
            ],
            [
                525,
                678
            ],
            [
                678,
                841
            ],
            [
                841,
                896
            ],
            [
                896,
                937
            ],
            [
                937,
                1048
            ],
            [
                1048,
                1208
            ],
            [
                1208,
                1399
            ],
            [
                1399,
                1591
            ],
            [
                1591,
                1644
            ],
            [
                1644,
                1763
            ],
            [
                1763,
                2015
            ],
            [
                2015,
                2214
            ],
            [
                2214,
                2313
            ],
            [
                2313,
                2364
            ],
            [
                2364,
                2428
            ],
            [
                2428,
                2460
            ],
            [
                2460,
                2547
            ],
            [
                2547,
                2735
            ],
            [
                2735,
                2880
            ],
            [
                2880,
                2941
            ],
            [
                2941,
                2999
            ],
            [
                2999,
                3071
            ],
            [
                3071,
                3213
            ],
            [
                3213,
                3266
            ],
            [
                3266,
                3410
            ],
            [
                3410,
                3467
            ],
            [
                3467,
                3731
            ],
            [
                3731,
                3731
            ],
            [
                3731,
                3836
            ],
            [
                3836,
                3895
            ],
            [
                3895,
                3926
            ],
            [
                3926,
                4007
            ],
            [
                4007,
                4072
            ],
            [
                4072,
                4140
            ],
            [
                4140,
                4328
            ],
            [
                4328,
                4426
            ],
            [
                4426,
                4492
            ],
            [
                4492,
                4735
            ],
            [
                4735,
                4863
            ],
            [
                4863,
                4907
            ],
            [
                4907,
                4951
            ],
            [
                4951,
                5027
            ],
            [
                5027,
                5325
            ],
            [
                5325,
                5568
            ],
            [
                5568,
                5689
            ],
            [
                5689,
                5924
            ],
            [
                5924,
                5924
            ],
            [
                5924,
                6039
            ],
            [
                6039,
                6291
            ],
            [
                6291,
                6371
            ],
            [
                6371,
                6515
            ],
            [
                6515,
                6586
            ],
            [
                6586,
                6640
            ],
            [
                6640,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6699
            ],
            [
                6699,
                6743
            ],
            [
                6743,
                6906
            ],
            [
                6906,
                7033
            ],
            [
                7033,
                7147
            ],
            [
                7147,
                7147
            ],
            [
                7147,
                7147
            ],
            [
                7147,
                7361
            ],
            [
                7361,
                7426
            ],
            [
                7426,
                7546
            ],
            [
                7546,
                7724
            ],
            [
                7724,
                7724
            ],
            [
                7724,
                7724
            ],
            [
                7724,
                7914
            ],
            [
                7914,
                8029
            ]
        ]
    }
}