{
    "original": {
        "text": "We must now take leave of Arcadia, and those amiable people practising the rural virtues there, and travel back to London, to inquire what has become of Miss Amelia.\n\"We don't care a fig for her,\" writes some unknown correspondent with a pretty little handwriting and a pink seal to her note. \"She is fade and insipid,\" and adds some more kind remarks in this strain, which I should never have repeated at all, but that they are in truth prodigiously complimentary to the young lady whom they concern.\nHas the beloved reader, in his experience of society, never heard similar remarks by good-natured female friends; who always wonder what you CAN see in Miss Smith that is so fascinating; or what COULD induce Major Jones to propose for that silly insignificant simpering Miss Thompson, who has nothing but her wax-doll face to recommend her? What is there in a pair of pink cheeks and blue eyes forsooth? these dear Moralists ask, and hint wisely that the gifts of genius, the accomplishments of the mind, the mastery of Mangnall's Questions, and a ladylike knowledge of botany and geology, the knack of making poetry, the power of rattling sonatas in the Herz-manner, and so forth, are far more valuable endowments for a female, than those fugitive charms which a few years will inevitably tarnish. It is quite edifying to hear women speculate upon the worthlessness and the duration of beauty.\nBut though virtue is a much finer thing, and those hapless creatures who suffer under the misfortune of good looks ought to be continually put in mind of the fate which awaits them; and though, very likely, the heroic female character which ladies admire is a more glorious and beautiful object than the kind, fresh, smiling, artless, tender little domestic goddess, whom men are inclined to worship--yet the latter and inferior sort of women must have this consolation--that the men do admire them after all; and that, in spite of all our kind friends' warnings and protests, we go on in our desperate error and folly, and shall to the end of the chapter. Indeed, for my own part, though I have been repeatedly told by persons for whom I have the greatest respect, that Miss Brown is an insignificant chit, and Mrs. White has nothing but her petit minois chiffonne, and Mrs. Black has not a word to say for herself; yet I know that I have had the most delightful conversations with Mrs. Black (of course, my dear Madam, they are inviolable): I see all the men in a cluster round Mrs. White's chair: all the young fellows battling to dance with Miss Brown; and so I am tempted to think that to be despised by her sex is a very great compliment to a woman.\nThe young ladies in Amelia's society did this for her very satisfactorily. For instance, there was scarcely any point upon which the Misses Osborne, George's sisters, and the Mesdemoiselles Dobbin agreed so well as in their estimate of her very trifling merits: and their wonder that their brothers could find any charms in her. \"We are kind to her,\" the Misses Osborne said, a pair of fine black-browed young ladies who had had the best of governesses, masters, and milliners; and they treated her with such extreme kindness and condescension, and patronised her so insufferably, that the poor little thing was in fact perfectly dumb in their presence, and to all outward appearance as stupid as they thought her. She made efforts to like them, as in duty bound, and as sisters of her future husband. She passed \"long mornings\" with them--the most dreary and serious of forenoons. She drove out solemnly in their great family coach with them, and Miss Wirt their governess, that raw-boned Vestal. They took her to the ancient concerts by way of a treat, and to the oratorio, and to St. Paul's to see the charity children, where in such terror was she of her friends, she almost did not dare be affected by the hymn the children sang. Their house was comfortable; their papa's table rich and handsome; their society solemn and genteel; their self-respect prodigious; they had the best pew at the Foundling: all their habits were pompous and orderly, and all their amusements intolerably dull and decorous. After every one of her visits (and oh how glad she was when they were over!) Miss Osborne and Miss Maria Osborne, and Miss Wirt, the vestal governess, asked each other with increased wonder, \"What could George find in that creature?\"\nHow is this? some carping reader exclaims. How is it that Amelia, who had such a number of friends at school, and was so beloved there, comes out into the world and is spurned by her discriminating sex? My dear sir, there were no men at Miss Pinkerton's establishment except the old dancing-master; and you would not have had the girls fall out about HIM? When George, their handsome brother, ran off directly after breakfast, and dined from home half-a-dozen times a week, no wonder the neglected sisters felt a little vexation. When young Bullock (of the firm of Hulker, Bullock & Co., Bankers, Lombard Street), who had been making up to Miss Maria the last two seasons, actually asked Amelia to dance the cotillon, could you expect that the former young lady should be pleased? And yet she said she was, like an artless forgiving creature. \"I'm so delighted you like dear Amelia,\" she said quite eagerly to Mr. Bullock after the dance. \"She's engaged to my brother George; there's not much in her, but she's the best-natured and most unaffected young creature: at home we're all so fond of her.\" Dear girl! who can calculate the depth of affection expressed in that enthusiastic SO?\nMiss Wirt and these two affectionate young women so earnestly and frequently impressed upon George Osborne's mind the enormity of the sacrifice he was making, and his romantic generosity in throwing himself away upon Amelia, that I'm not sure but that he really thought he was one of the most deserving characters in the British army, and gave himself up to be loved with a good deal of easy resignation.\nSomehow, although he left home every morning, as was stated, and dined abroad six days in the week, when his sisters believed the infatuated youth to be at Miss Sedley's apron-strings: he was NOT always with Amelia, whilst the world supposed him at her feet. Certain it is that on more occasions than one, when Captain Dobbin called to look for his friend, Miss Osborne (who was very attentive to the Captain, and anxious to hear his military stories, and to know about the health of his dear Mamma), would laughingly point to the opposite side of the square, and say, \"Oh, you must go to the Sedleys' to ask for George; WE never see him from morning till night.\" At which kind of speech the Captain would laugh in rather an absurd constrained manner, and turn off the conversation, like a consummate man of the world, to some topic of general interest, such as the Opera, the Prince's last ball at Carlton House, or the weather--that blessing to society.\n\"What an innocent it is, that pet of yours,\" Miss Maria would then say to Miss Jane, upon the Captain's departure. \"Did you see how he blushed at the mention of poor George on duty?\"\n\"It's a pity Frederick Bullock hadn't some of his modesty, Maria,\" replies the elder sister, with a toss of he head.\n\"Modesty! Awkwardness you mean, Jane. I don't want Frederick to trample a hole in my muslin frock, as Captain Dobbin did in yours at Mrs. Perkins'.\"\n\"In YOUR frock, he, he! How could he? Wasn't he dancing with Amelia?\"\nThe fact is, when Captain Dobbin blushed so, and looked so awkward, he remembered a circumstance of which he did not think it was necessary to inform the young ladies, viz., that he had been calling at Mr. Sedley's house already, on the pretence of seeing George, of course, and George wasn't there, only poor little Amelia, with rather a sad wistful face, seated near the drawing-room window, who, after some very trifling stupid talk, ventured to ask, was there any truth in the report that the regiment was soon to be ordered abroad; and had Captain Dobbin seen Mr. Osborne that day?\nThe regiment was not ordered abroad as yet; and Captain Dobbin had not seen George. \"He was with his sister, most likely,\" the Captain said. \"Should he go and fetch the truant?\" So she gave him her hand kindly and gratefully: and he crossed the square; and she waited and waited, but George never came.\nPoor little tender heart! and so it goes on hoping and beating, and longing and trusting. You see it is not much of a life to describe. There is not much of what you call incident in it. Only one feeling all day--when will he come? only one thought to sleep and wake upon. I believe George was playing billiards with Captain Cannon in Swallow Street at the time when Amelia was asking Captain Dobbin about him; for George was a jolly sociable fellow, and excellent in all games of skill.\nOnce, after three days of absence, Miss Amelia put on her bonnet, and actually invaded the Osborne house. \"What! leave our brother to come to us?\" said the young ladies. \"Have you had a quarrel, Amelia? Do tell us!\" No, indeed, there had been no quarrel. \"Who could quarrel with him?\" says she, with her eyes filled with tears. She only came over to--to see her dear friends; they had not met for so long. And this day she was so perfectly stupid and awkward, that the Misses Osborne and their governess, who stared after her as she went sadly away, wondered more than ever what George could see in poor little Amelia.\nOf course they did. How was she to bare that timid little heart for the inspection of those young ladies with their bold black eyes? It was best that it should shrink and hide itself. I know the Misses Osborne were excellent critics of a Cashmere shawl, or a pink satin slip; and when Miss Turner had hers dyed purple, and made into a spencer; and when Miss Pickford had her ermine tippet twisted into a muff and trimmings, I warrant you the changes did not escape the two intelligent young women before mentioned. But there are things, look you, of a finer texture than fur or satin, and all Solomon's glories, and all the wardrobe of the Queen of Sheba--things whereof the beauty escapes the eyes of many connoisseurs. And there are sweet modest little souls on which you light, fragrant and blooming tenderly in quiet shady places; and there are garden-ornaments, as big as brass warming-pans, that are fit to stare the sun itself out of countenance. Miss Sedley was not of the sunflower sort; and I say it is out of the rules of all proportion to draw a violet of the size of a double dahlia.\nNo, indeed; the life of a good young girl who is in the paternal nest as yet, can't have many of those thrilling incidents to which the heroine of romance commonly lays claim. Snares or shot may take off the old birds foraging without--hawks may be abroad, from which they escape or by whom they suffer; but the young ones in the nest have a pretty comfortable unromantic sort of existence in the down and the straw, till it comes to their turn, too, to get on the wing. While Becky Sharp was on her own wing in the country, hopping on all sorts of twigs, and amid a multiplicity of traps, and pecking up her food quite harmless and successful, Amelia lay snug in her home of Russell Square; if she went into the world, it was under the guidance of the elders; nor did it seem that any evil could befall her or that opulent cheery comfortable home in which she was affectionately sheltered. Mamma had her morning duties, and her daily drive, and the delightful round of visits and shopping which forms the amusement, or the profession as you may call it, of the rich London lady. Papa conducted his mysterious operations in the City--a stirring place in those days, when war was raging all over Europe, and empires were being staked; when the \"Courier\" newspaper had tens of thousands of subscribers; when one day brought you a battle of Vittoria, another a burning of Moscow, or a newsman's horn blowing down Russell Square about dinner-time, announced such a fact as--\"Battle of Leipsic--six hundred thousand men engaged--total defeat of the French--two hundred thousand killed.\" Old Sedley once or twice came home with a very grave face; and no wonder, when such news as this was agitating all the hearts and all the Stocks of Europe.\nMeanwhile matters went on in Russell Square, Bloomsbury, just as if matters in Europe were not in the least disorganised. The retreat from Leipsic made no difference in the number of meals Mr. Sambo took in the servants' hall; the allies poured into France, and the dinner-bell rang at five o'clock just as usual. I don't think poor Amelia cared anything about Brienne and Montmirail, or was fairly interested in the war until the abdication of the Emperor; when she clapped her hands and said prayers--oh, how grateful! and flung herself into George Osborne's arms with all her soul, to the astonishment of everybody who witnessed that ebullition of sentiment. The fact is, peace was declared, Europe was going to be at rest; the Corsican was overthrown, and Lieutenant Osborne's regiment would not be ordered on service. That was the way in which Miss Amelia reasoned. The fate of Europe was Lieutenant George Osborne to her. His dangers being over, she sang Te Deum. He was her Europe: her emperor: her allied monarchs and august prince regent. He was her sun and moon; and I believe she thought the grand illumination and ball at the Mansion House, given to the sovereigns, were especially in honour of George Osborne.\nWe have talked of shift, self, and poverty, as those dismal instructors under whom poor Miss Becky Sharp got her education. Now, love was Miss Amelia Sedley's last tutoress, and it was amazing what progress our young lady made under that popular teacher. In the course of fifteen or eighteen months' daily and constant attention to this eminent finishing governess, what a deal of secrets Amelia learned, which Miss Wirt and the black-eyed young ladies over the way, which old Miss Pinkerton of Chiswick herself, had no cognizance of! As, indeed, how should any of those prim and reputable virgins? With Misses P. and W. the tender passion is out of the question: I would not dare to breathe such an idea regarding them. Miss Maria Osborne, it is true, was \"attached\" to Mr. Frederick Augustus Bullock, of the firm of Hulker, Bullock & Bullock; but hers was a most respectable attachment, and she would have taken Bullock Senior just the same, her mind being fixed--as that of a well-bred young woman should be--upon a house in Park Lane, a country house at Wimbledon, a handsome chariot, and two prodigious tall horses and footmen, and a fourth of the annual profits of the eminent firm of Hulker & Bullock, all of which advantages were represented in the person of Frederick Augustus. Had orange blossoms been invented then (those touching emblems of female purity imported by us from France, where people's daughters are universally sold in marriage), Miss Maria, I say, would have assumed the spotless wreath, and stepped into the travelling carriage by the side of gouty, old, bald-headed, bottle-nosed Bullock Senior; and devoted her beautiful existence to his happiness with perfect modesty--only the old gentleman was married already; so she bestowed her young affections on the junior partner. Sweet, blooming, orange flowers! The other day I saw Miss Trotter (that was), arrayed in them, trip into the travelling carriage at St. George's, Hanover Square, and Lord Methuselah hobbled in after. With what an engaging modesty she pulled down the blinds of the chariot--the dear innocent! There were half the carriages of Vanity Fair at the wedding.\nThis was not the sort of love that finished Amelia's education; and in the course of a year turned a good young girl into a good young woman--to be a good wife presently, when the happy time should come. This young person (perhaps it was very imprudent in her parents to encourage her, and abet her in such idolatry and silly romantic ideas) loved, with all her heart, the young officer in His Majesty's service with whom we have made a brief acquaintance. She thought about him the very first moment on waking; and his was the very last name mentioned in her prayers. She never had seen a man so beautiful or so clever: such a figure on horseback: such a dancer: such a hero in general. Talk of the Prince's bow! what was it to George's? She had seen Mr. Brummell, whom everybody praised so. Compare such a person as that to her George! Not amongst all the beaux at the Opera (and there were beaux in those days with actual opera hats) was there any one to equal him. He was only good enough to be a fairy prince; and oh, what magnanimity to stoop to such a humble Cinderella! Miss Pinkerton would have tried to check this blind devotion very likely, had she been Amelia's confidante; but not with much success, depend upon it. It is in the nature and instinct of some women. Some are made to scheme, and some to love; and I wish any respected bachelor that reads this may take the sort that best likes him.\nWhile under this overpowering impression, Miss Amelia neglected her twelve dear friends at Chiswick most cruelly, as such selfish people commonly will do. She had but this subject, of course, to think about; and Miss Saltire was too cold for a confidante, and she couldn't bring her mind to tell Miss Swartz, the woolly-haired young heiress from St. Kitt's. She had little Laura Martin home for the holidays; and my belief is, she made a confidante of her, and promised that Laura should come and live with her when she was married, and gave Laura a great deal of information regarding the passion of love, which must have been singularly useful and novel to that little person. Alas, alas! I fear poor Emmy had not a well-regulated mind.\nWhat were her parents doing, not to keep this little heart from beating so fast? Old Sedley did not seem much to notice matters. He was graver of late, and his City affairs absorbed him. Mrs. Sedley was of so easy and uninquisitive a nature that she wasn't even jealous. Mr. Jos was away, being besieged by an Irish widow at Cheltenham. Amelia had the house to herself--ah! too much to herself sometimes--not that she ever doubted; for, to be sure, George must be at the Horse Guards; and he can't always get leave from Chatham; and he must see his friends and sisters, and mingle in society when in town (he, such an ornament to every society!); and when he is with the regiment, he is too tired to write long letters. I know where she kept that packet she had--and can steal in and out of her chamber like Iachimo--like Iachimo? No--that is a bad part. I will only act Moonshine, and peep harmless into the bed where faith and beauty and innocence lie dreaming.\nBut if Osborne's were short and soldierlike letters, it must be confessed, that were Miss Sedley's letters to Mr. Osborne to be published, we should have to extend this novel to such a multiplicity of volumes as not the most sentimental reader could support; that she not only filled sheets of large paper, but crossed them with the most astonishing perverseness; that she wrote whole pages out of poetry-books without the least pity; that she underlined words and passages with quite a frantic emphasis; and, in fine, gave the usual tokens of her condition. She wasn't a heroine. Her letters were full of repetition. She wrote rather doubtful grammar sometimes, and in her verses took all sorts of liberties with the metre. But oh, mesdames, if you are not allowed to touch the heart sometimes in spite of syntax, and are not to be loved until you all know the difference between trimeter and tetrameter, may all Poetry go to the deuce, and every schoolmaster perish miserably!",
        "paragraph_chars": [
            [
                0,
                166
            ],
            [
                166,
                502
            ],
            [
                502,
                1397
            ],
            [
                1397,
                2653
            ],
            [
                2653,
                4393
            ],
            [
                4393,
                5579
            ],
            [
                5579,
                5984
            ],
            [
                5984,
                6940
            ],
            [
                6940,
                7123
            ],
            [
                7123,
                7240
            ],
            [
                7240,
                7389
            ],
            [
                7389,
                7459
            ],
            [
                7459,
                8046
            ],
            [
                8046,
                8349
            ],
            [
                8349,
                8837
            ],
            [
                8837,
                9456
            ],
            [
                9456,
                10553
            ],
            [
                10553,
                12291
            ],
            [
                12291,
                13514
            ],
            [
                13514,
                15670
            ],
            [
                15670,
                17079
            ],
            [
                17079,
                17818
            ],
            [
                17818,
                18782
            ],
            [
                18782,
                19760
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                293
            ],
            [
                293,
                502
            ],
            [
                502,
                843
            ],
            [
                843,
                906
            ],
            [
                906,
                1301
            ],
            [
                1301,
                1397
            ],
            [
                1397,
                2054
            ],
            [
                2054,
                2653
            ],
            [
                2653,
                2728
            ],
            [
                2728,
                2982
            ],
            [
                2982,
                3368
            ],
            [
                3368,
                3455
            ],
            [
                3455,
                3535
            ],
            [
                3535,
                3651
            ],
            [
                3651,
                3888
            ],
            [
                3888,
                4159
            ],
            [
                4159,
                4236
            ],
            [
                4236,
                4393
            ],
            [
                4393,
                4406
            ],
            [
                4406,
                4436
            ],
            [
                4436,
                4596
            ],
            [
                4596,
                4749
            ],
            [
                4749,
                4923
            ],
            [
                4923,
                5174
            ],
            [
                5174,
                5236
            ],
            [
                5236,
                5332
            ],
            [
                5332,
                5492
            ],
            [
                5492,
                5503
            ],
            [
                5503,
                5579
            ],
            [
                5579,
                5984
            ],
            [
                5984,
                6243
            ],
            [
                6243,
                6648
            ],
            [
                6648,
                6940
            ],
            [
                6940,
                7055
            ],
            [
                7055,
                7123
            ],
            [
                7123,
                7240
            ],
            [
                7240,
                7250
            ],
            [
                7250,
                7278
            ],
            [
                7278,
                7389
            ],
            [
                7389,
                7413
            ],
            [
                7413,
                7427
            ],
            [
                7427,
                7459
            ],
            [
                7459,
                8046
            ],
            [
                8046,
                8130
            ],
            [
                8130,
                8187
            ],
            [
                8187,
                8224
            ],
            [
                8224,
                8349
            ],
            [
                8349,
                8375
            ],
            [
                8375,
                8439
            ],
            [
                8439,
                8485
            ],
            [
                8485,
                8536
            ],
            [
                8536,
                8581
            ],
            [
                8581,
                8622
            ],
            [
                8622,
                8837
            ],
            [
                8837,
                8943
            ],
            [
                8943,
                8950
            ],
            [
                8950,
                8984
            ],
            [
                8984,
                9007
            ],
            [
                9007,
                9040
            ],
            [
                9040,
                9053
            ],
            [
                9053,
                9092
            ],
            [
                9092,
                9122
            ],
            [
                9122,
                9165
            ],
            [
                9165,
                9243
            ],
            [
                9243,
                9456
            ],
            [
                9456,
                9476
            ],
            [
                9476,
                9589
            ],
            [
                9589,
                9640
            ],
            [
                9640,
                9971
            ],
            [
                9971,
                10177
            ],
            [
                10177,
                10410
            ],
            [
                10410,
                10553
            ],
            [
                10553,
                10729
            ],
            [
                10729,
                11024
            ],
            [
                11024,
                11444
            ],
            [
                11444,
                11633
            ],
            [
                11633,
                12135
            ],
            [
                12135,
                12291
            ],
            [
                12291,
                12413
            ],
            [
                12413,
                12605
            ],
            [
                12605,
                12812
            ],
            [
                12812,
                12953
            ],
            [
                12953,
                13114
            ],
            [
                13114,
                13162
            ],
            [
                13162,
                13219
            ],
            [
                13219,
                13261
            ],
            [
                13261,
                13339
            ],
            [
                13339,
                13514
            ],
            [
                13514,
                13638
            ],
            [
                13638,
                13769
            ],
            [
                13769,
                14049
            ],
            [
                14049,
                14113
            ],
            [
                14113,
                14235
            ],
            [
                14235,
                14801
            ],
            [
                14801,
                15317
            ],
            [
                15317,
                15350
            ],
            [
                15350,
                15517
            ],
            [
                15517,
                15609
            ],
            [
                15609,
                15670
            ],
            [
                15670,
                15874
            ],
            [
                15874,
                16127
            ],
            [
                16127,
                16239
            ],
            [
                16239,
                16358
            ],
            [
                16358,
                16384
            ],
            [
                16384,
                16409
            ],
            [
                16409,
                16463
            ],
            [
                16463,
                16508
            ],
            [
                16508,
                16639
            ],
            [
                16639,
                16748
            ],
            [
                16748,
                16899
            ],
            [
                16899,
                16947
            ],
            [
                16947,
                17079
            ],
            [
                17079,
                17234
            ],
            [
                17234,
                17437
            ],
            [
                17437,
                17758
            ],
            [
                17758,
                17770
            ],
            [
                17770,
                17818
            ],
            [
                17818,
                17899
            ],
            [
                17899,
                17947
            ],
            [
                17947,
                18005
            ],
            [
                18005,
                18089
            ],
            [
                18089,
                18155
            ],
            [
                18155,
                18192
            ],
            [
                18192,
                18462
            ],
            [
                18462,
                18538
            ],
            [
                18538,
                18649
            ],
            [
                18649,
                18673
            ],
            [
                18673,
                18782
            ],
            [
                18782,
                19341
            ],
            [
                19341,
                19363
            ],
            [
                19363,
                19400
            ],
            [
                19400,
                19507
            ],
            [
                19507,
                19760
            ]
        ],
        "overlap_chars": [
            [
                0,
                11
            ],
            [
                100,
                166
            ],
            [
                166,
                230
            ],
            [
                293,
                300
            ],
            [
                310,
                317
            ],
            [
                236,
                237
            ],
            [
                339,
                343
            ],
            [
                368,
                373
            ],
            [
                429,
                437
            ],
            [
                451,
                482
            ],
            [
                500,
                502
            ],
            [
                502,
                524
            ],
            [
                556,
                586
            ],
            [
                600,
                664
            ],
            [
                524,
                525
            ],
            [
                689,
                747
            ],
            [
                762,
                843
            ],
            [
                906,
                926
            ],
            [
                936,
                952
            ],
            [
                974,
                1006
            ],
            [
                1048,
                1091
            ],
            [
                932,
                935
            ],
            [
                1120,
                1141
            ],
            [
                1142,
                1149
            ],
            [
                1170,
                1205
            ],
            [
                1231,
                1280
            ],
            [
                1292,
                1301
            ],
            [
                1301,
                1368
            ],
            [
                1386,
                1397
            ],
            [
                1397,
                1437
            ],
            [
                1579,
                1670
            ],
            [
                1685,
                1700
            ],
            [
                1707,
                1712
            ],
            [
                1721,
                1763
            ],
            [
                1798,
                1801
            ],
            [
                1877,
                1890
            ],
            [
                1802,
                1812
            ],
            [
                2052,
                2054
            ],
            [
                2079,
                2113
            ],
            [
                2163,
                2204
            ],
            [
                2314,
                2319
            ],
            [
                2442,
                2445
            ],
            [
                2497,
                2541
            ],
            [
                2236,
                2239
            ],
            [
                2552,
                2562
            ],
            [
                2577,
                2653
            ],
            [
                2653,
                2728
            ],
            [
                2782,
                2827
            ],
            [
                2843,
                2856
            ],
            [
                2857,
                2867
            ],
            [
                2889,
                2913
            ],
            [
                2740,
                2741
            ],
            [
                2915,
                2981
            ],
            [
                2982,
                3003
            ],
            [
                3023,
                3027
            ],
            [
                3004,
                3022
            ],
            [
                3027,
                3090
            ],
            [
                3094,
                3105
            ],
            [
                3116,
                3129
            ],
            [
                3135,
                3147
            ],
            [
                3152,
                3264
            ],
            [
                3273,
                3287
            ],
            [
                3131,
                3134
            ],
            [
                3340,
                3346
            ],
            [
                3288,
                3305
            ],
            [
                3366,
                3368
            ],
            [
                3368,
                3371
            ],
            [
                3385,
                3398
            ],
            [
                3417,
                3420
            ],
            [
                3459,
                3465
            ],
            [
                3493,
                3508
            ],
            [
                3472,
                3480
            ],
            [
                3482,
                3491
            ],
            [
                3533,
                3535
            ],
            [
                3535,
                3548
            ],
            [
                3558,
                3585
            ],
            [
                3651,
                3667
            ],
            [
                3680,
                3688
            ],
            [
                3727,
                3774
            ],
            [
                3886,
                3888
            ],
            [
                3888,
                3915
            ],
            [
                3953,
                4019
            ],
            [
                4060,
                4159
            ],
            [
                4159,
                4170
            ],
            [
                4236,
                4286
            ],
            [
                4288,
                4291
            ],
            [
                4299,
                4393
            ],
            [
                4393,
                4406
            ],
            [
                4406,
                4436
            ],
            [
                4436,
                4466
            ],
            [
                4511,
                4513
            ],
            [
                4484,
                4501
            ],
            [
                4527,
                4575
            ],
            [
                4591,
                4596
            ],
            [
                4596,
                4690
            ],
            [
                4749,
                4829
            ],
            [
                4830,
                4866
            ],
            [
                4881,
                4916
            ],
            [
                4921,
                4923
            ],
            [
                4923,
                4945
            ],
            [
                4966,
                4988
            ],
            [
                5004,
                5043
            ],
            [
                5044,
                5065
            ],
            [
                5075,
                5096
            ],
            [
                5109,
                5127
            ],
            [
                5162,
                5174
            ],
            [
                5174,
                5198
            ],
            [
                5234,
                5235
            ],
            [
                5236,
                5314
            ],
            [
                5330,
                5332
            ],
            [
                5332,
                5397
            ],
            [
                5465,
                5492
            ],
            [
                5492,
                5503
            ],
            [
                5503,
                5579
            ],
            [
                5579,
                5630
            ],
            [
                5645,
                5655
            ],
            [
                5671,
                5685
            ],
            [
                5706,
                5712
            ],
            [
                5713,
                5736
            ],
            [
                5766,
                5803
            ],
            [
                5826,
                5912
            ],
            [
                5982,
                5984
            ],
            [
                5993,
                6004
            ],
            [
                6049,
                6054
            ],
            [
                6062,
                6070
            ],
            [
                6154,
                6155
            ],
            [
                6078,
                6109
            ],
            [
                6226,
                6229
            ],
            [
                6131,
                6136
            ],
            [
                6192,
                6199
            ],
            [
                6169,
                6191
            ],
            [
                6233,
                6236
            ],
            [
                6241,
                6243
            ],
            [
                6262,
                6264
            ],
            [
                6270,
                6279
            ],
            [
                6288,
                6316
            ],
            [
                6325,
                6392
            ],
            [
                6485,
                6507
            ],
            [
                6532,
                6585
            ],
            [
                6593,
                6621
            ],
            [
                6645,
                6648
            ],
            [
                6648,
                6656
            ],
            [
                6672,
                6698
            ],
            [
                6772,
                6773
            ],
            [
                6699,
                6705
            ],
            [
                6716,
                6744
            ],
            [
                6749,
                6765
            ],
            [
                6803,
                6810
            ],
            [
                6811,
                6816
            ],
            [
                6938,
                6940
            ],
            [
                6940,
                6963
            ],
            [
                6982,
                7029
            ],
            [
                7044,
                7055
            ],
            [
                7055,
                7123
            ],
            [
                7123,
                7153
            ],
            [
                7158,
                7189
            ],
            [
                7198,
                7230
            ],
            [
                7234,
                7240
            ],
            [
                7459,
                7499
            ],
            [
                7502,
                7526
            ],
            [
                7582,
                7588
            ],
            [
                7638,
                7644
            ],
            [
                7680,
                7687
            ],
            [
                7658,
                7679
            ],
            [
                7732,
                7815
            ],
            [
                7853,
                7856
            ],
            [
                7625,
                7626
            ],
            [
                8000,
                8046
            ],
            [
                8102,
                8116
            ],
            [
                8128,
                8130
            ],
            [
                8130,
                8187
            ],
            [
                8224,
                8226
            ],
            [
                8276,
                8297
            ],
            [
                8205,
                8221
            ],
            [
                8297,
                8302
            ],
            [
                8307,
                8349
            ],
            [
                8349,
                8375
            ],
            [
                8379,
                8403
            ],
            [
                8429,
                8439
            ],
            [
                8439,
                8485
            ],
            [
                8485,
                8502
            ],
            [
                8520,
                8536
            ],
            [
                8536,
                8560
            ],
            [
                8562,
                8581
            ],
            [
                8622,
                8680
            ],
            [
                8711,
                8776
            ],
            [
                8783,
                8816
            ],
            [
                8821,
                8837
            ],
            [
                8837,
                8942
            ],
            [
                8943,
                8950
            ],
            [
                8950,
                8984
            ],
            [
                8984,
                9007
            ],
            [
                9007,
                9038
            ],
            [
                9053,
                9063
            ],
            [
                9090,
                9092
            ],
            [
                9092,
                9122
            ],
            [
                9127,
                9165
            ],
            [
                9165,
                9183
            ],
            [
                9188,
                9243
            ],
            [
                9243,
                9320
            ],
            [
                9387,
                9435
            ],
            [
                9359,
                9362
            ],
            [
                9454,
                9456
            ],
            [
                9476,
                9547
            ],
            [
                9572,
                9576
            ],
            [
                9548,
                9560
            ],
            [
                9587,
                9589
            ],
            [
                9647,
                9731
            ],
            [
                9971,
                9991
            ],
            [
                10003,
                10026
            ],
            [
                10034,
                10039
            ],
            [
                10175,
                10177
            ],
            [
                10177,
                10216
            ],
            [
                10250,
                10289
            ],
            [
                10408,
                10409
            ],
            [
                10565,
                10601
            ],
            [
                10602,
                10622
            ],
            [
                10631,
                10675
            ],
            [
                10679,
                10684
            ],
            [
                10676,
                10678
            ],
            [
                10685,
                10699
            ],
            [
                10700,
                10707
            ],
            [
                10727,
                10729
            ],
            [
                11024,
                11048
            ],
            [
                11262,
                11265
            ],
            [
                11057,
                11108
            ],
            [
                11113,
                11172
            ],
            [
                11196,
                11220
            ],
            [
                11229,
                11244
            ],
            [
                11330,
                11334
            ],
            [
                11377,
                11444
            ],
            [
                11444,
                11548
            ],
            [
                11573,
                11587
            ],
            [
                11608,
                11633
            ],
            [
                11633,
                11685
            ],
            [
                11990,
                11991
            ],
            [
                11687,
                11754
            ],
            [
                12135,
                12213
            ],
            [
                12219,
                12223
            ],
            [
                12280,
                12282
            ],
            [
                12261,
                12264
            ],
            [
                12232,
                12253
            ],
            [
                12289,
                12291
            ],
            [
                12291,
                12334
            ],
            [
                12348,
                12352
            ],
            [
                12389,
                12392
            ],
            [
                12411,
                12413
            ],
            [
                12413,
                12456
            ],
            [
                12460,
                12463
            ],
            [
                12474,
                12479
            ],
            [
                12495,
                12605
            ],
            [
                12605,
                12630
            ],
            [
                12679,
                12682
            ],
            [
                12690,
                12717
            ],
            [
                12722,
                12725
            ],
            [
                12747,
                12779
            ],
            [
                12794,
                12801
            ],
            [
                12810,
                12812
            ],
            [
                12812,
                12856
            ],
            [
                12874,
                12878
            ],
            [
                12883,
                12895
            ],
            [
                12951,
                12953
            ],
            [
                12966,
                12985
            ],
            [
                13031,
                13090
            ],
            [
                13003,
                13005
            ],
            [
                13112,
                13114
            ],
            [
                13114,
                13122
            ],
            [
                13145,
                13162
            ],
            [
                13162,
                13219
            ],
            [
                13261,
                13278
            ],
            [
                13313,
                13316
            ],
            [
                13280,
                13296
            ],
            [
                13350,
                13362
            ],
            [
                13512,
                13514
            ],
            [
                13514,
                13531
            ],
            [
                13549,
                13556
            ],
            [
                13558,
                13560
            ],
            [
                13607,
                13618
            ],
            [
                13567,
                13573
            ],
            [
                13636,
                13638
            ],
            [
                13638,
                13641
            ],
            [
                13643,
                13672
            ],
            [
                13686,
                13751
            ],
            [
                13760,
                13769
            ],
            [
                13769,
                13785
            ],
            [
                13797,
                13812
            ],
            [
                13878,
                13942
            ],
            [
                13954,
                13979
            ],
            [
                14027,
                14033
            ],
            [
                14045,
                14049
            ],
            [
                14061,
                14071
            ],
            [
                14111,
                14113
            ],
            [
                14235,
                14298
            ],
            [
                14308,
                14316
            ],
            [
                14359,
                14427
            ],
            [
                14320,
                14323
            ],
            [
                14428,
                14442
            ],
            [
                14799,
                14800
            ],
            [
                14458,
                14466
            ],
            [
                14473,
                14478
            ],
            [
                14480,
                14482
            ],
            [
                14491,
                14508
            ],
            [
                14515,
                14524
            ],
            [
                14526,
                14562
            ],
            [
                14569,
                14593
            ],
            [
                14645,
                14684
            ],
            [
                14705,
                14721
            ],
            [
                15670,
                15732
            ],
            [
                15839,
                15840
            ],
            [
                15734,
                15737
            ],
            [
                15741,
                15744
            ],
            [
                15757,
                15810
            ],
            [
                15872,
                15874
            ],
            [
                16012,
                16017
            ],
            [
                16019,
                16037
            ],
            [
                16125,
                16127
            ],
            [
                16127,
                16152
            ],
            [
                16158,
                16197
            ],
            [
                16203,
                16239
            ],
            [
                16239,
                16358
            ],
            [
                16639,
                16645
            ],
            [
                16651,
                16748
            ],
            [
                16789,
                16808
            ],
            [
                16902,
                16918
            ],
            [
                16932,
                16947
            ],
            [
                16947,
                16988
            ],
            [
                17077,
                17079
            ],
            [
                17119,
                17191
            ],
            [
                17285,
                17286
            ],
            [
                17437,
                17464
            ],
            [
                17470,
                17491
            ],
            [
                17510,
                17654
            ],
            [
                17280,
                17285
            ],
            [
                17680,
                17724
            ],
            [
                17735,
                17758
            ],
            [
                17758,
                17762
            ],
            [
                17768,
                17770
            ],
            [
                17770,
                17818
            ],
            [
                17818,
                17845
            ],
            [
                17851,
                17853
            ],
            [
                17897,
                17899
            ],
            [
                17899,
                17922
            ],
            [
                17928,
                17947
            ],
            [
                17947,
                18005
            ],
            [
                18005,
                18023
            ],
            [
                18027,
                18031
            ],
            [
                18052,
                18058
            ],
            [
                18087,
                18089
            ],
            [
                18089,
                18105
            ],
            [
                18140,
                18155
            ],
            [
                18155,
                18186
            ],
            [
                18188,
                18192
            ],
            [
                18192,
                18221
            ],
            [
                18223,
                18248
            ],
            [
                18267,
                18273
            ],
            [
                18248,
                18266
            ],
            [
                18351,
                18353
            ],
            [
                18274,
                18309
            ],
            [
                18354,
                18386
            ],
            [
                18410,
                18414
            ],
            [
                18424,
                18426
            ],
            [
                18415,
                18422
            ],
            [
                18345,
                18346
            ],
            [
                18465,
                18537
            ],
            [
                18782,
                18798
            ],
            [
                18826,
                18833
            ],
            [
                18799,
                18821
            ],
            [
                18821,
                18825
            ],
            [
                18833,
                18834
            ],
            [
                18867,
                18878
            ],
            [
                19292,
                19294
            ],
            [
                19050,
                19065
            ],
            [
                19076,
                19081
            ],
            [
                19066,
                19075
            ],
            [
                19082,
                19100
            ],
            [
                19243,
                19246
            ],
            [
                19226,
                19236
            ],
            [
                19326,
                19329
            ],
            [
                18855,
                18856
            ],
            [
                19287,
                19290
            ],
            [
                19161,
                19192
            ],
            [
                19339,
                19341
            ],
            [
                19341,
                19363
            ],
            [
                19363,
                19400
            ],
            [
                19400,
                19507
            ],
            [
                19507,
                19510
            ],
            [
                19525,
                19566
            ],
            [
                19577,
                19588
            ],
            [
                19589,
                19595
            ],
            [
                19686,
                19760
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                502
            ],
            [
                502,
                843
            ],
            [
                843,
                906
            ],
            [
                906,
                1301
            ],
            [
                1301,
                1397
            ],
            [
                1397,
                2054
            ],
            [
                2054,
                2653
            ],
            [
                2653,
                2728
            ],
            [
                2728,
                2982
            ],
            [
                2982,
                3368
            ],
            [
                3368,
                3535
            ],
            [
                3535,
                3888
            ],
            [
                3888,
                4159
            ],
            [
                4159,
                4393
            ],
            [
                4393,
                4406
            ],
            [
                4406,
                4436
            ],
            [
                4436,
                4596
            ],
            [
                4596,
                4749
            ],
            [
                4749,
                4923
            ],
            [
                4923,
                5174
            ],
            [
                5174,
                5236
            ],
            [
                5236,
                5332
            ],
            [
                5332,
                5492
            ],
            [
                5492,
                5503
            ],
            [
                5503,
                5579
            ],
            [
                5579,
                5984
            ],
            [
                5984,
                6243
            ],
            [
                6243,
                6648
            ],
            [
                6648,
                6940
            ],
            [
                6940,
                7055
            ],
            [
                7055,
                7123
            ],
            [
                7123,
                7240
            ],
            [
                7240,
                7250
            ],
            [
                7250,
                7278
            ],
            [
                7278,
                7389
            ],
            [
                7389,
                7413
            ],
            [
                7413,
                7427
            ],
            [
                7427,
                7459
            ],
            [
                7459,
                8046
            ],
            [
                8046,
                8130
            ],
            [
                8130,
                8187
            ],
            [
                8187,
                8349
            ],
            [
                8349,
                8375
            ],
            [
                8375,
                8439
            ],
            [
                8439,
                8485
            ],
            [
                8485,
                8536
            ],
            [
                8536,
                8581
            ],
            [
                8581,
                8622
            ],
            [
                8622,
                8837
            ],
            [
                8837,
                8943
            ],
            [
                8943,
                8950
            ],
            [
                8950,
                8984
            ],
            [
                8984,
                9007
            ],
            [
                9007,
                9040
            ],
            [
                9040,
                9053
            ],
            [
                9053,
                9092
            ],
            [
                9092,
                9122
            ],
            [
                9122,
                9165
            ],
            [
                9165,
                9243
            ],
            [
                9243,
                9456
            ],
            [
                9456,
                9476
            ],
            [
                9476,
                9589
            ],
            [
                9589,
                9640
            ],
            [
                9640,
                10177
            ],
            [
                10177,
                10410
            ],
            [
                10410,
                10553
            ],
            [
                10553,
                10729
            ],
            [
                10729,
                11024
            ],
            [
                11024,
                11444
            ],
            [
                11444,
                11633
            ],
            [
                11633,
                12135
            ],
            [
                12135,
                12291
            ],
            [
                12291,
                12413
            ],
            [
                12413,
                12605
            ],
            [
                12605,
                12812
            ],
            [
                12812,
                12953
            ],
            [
                12953,
                13114
            ],
            [
                13114,
                13162
            ],
            [
                13162,
                13219
            ],
            [
                13219,
                13261
            ],
            [
                13261,
                13514
            ],
            [
                13514,
                13638
            ],
            [
                13638,
                13769
            ],
            [
                13769,
                14049
            ],
            [
                14049,
                14113
            ],
            [
                14113,
                14235
            ],
            [
                14235,
                14801
            ],
            [
                14801,
                15317
            ],
            [
                15317,
                15350
            ],
            [
                15350,
                15517
            ],
            [
                15517,
                15609
            ],
            [
                15609,
                15670
            ],
            [
                15670,
                15874
            ],
            [
                15874,
                16127
            ],
            [
                16127,
                16239
            ],
            [
                16239,
                16358
            ],
            [
                16358,
                16384
            ],
            [
                16384,
                16409
            ],
            [
                16409,
                16463
            ],
            [
                16463,
                16508
            ],
            [
                16508,
                16639
            ],
            [
                16639,
                16748
            ],
            [
                16748,
                16947
            ],
            [
                16947,
                17079
            ],
            [
                17079,
                17758
            ],
            [
                17758,
                17770
            ],
            [
                17770,
                17818
            ],
            [
                17818,
                17899
            ],
            [
                17899,
                17947
            ],
            [
                17947,
                18005
            ],
            [
                18005,
                18089
            ],
            [
                18089,
                18155
            ],
            [
                18155,
                18192
            ],
            [
                18192,
                18538
            ],
            [
                18538,
                18649
            ],
            [
                18649,
                18673
            ],
            [
                18673,
                18782
            ],
            [
                18782,
                19341
            ],
            [
                19341,
                19363
            ],
            [
                19363,
                19400
            ],
            [
                19400,
                19507
            ],
            [
                19507,
                19760
            ]
        ]
    },
    "abridged": {
        "text": "We must now travel back to London, to inquire what has become of Miss Amelia.\n\"We don't care a fig for her,\" writes some unknown correspondent; \"she is insipid;\" a kind remark which in truth is complimentary to the young lady.\nHas the beloved reader never heard similar remarks by female friends; who always wonder what you can see in Miss Smith, or what could induce Major Jones to propose for that silly simpering Miss Thompson, who has nothing but her wax-doll face to recommend her? These dear Moralists hint wisely that the accomplishments of the mind, a ladylike knowledge of botany and geology, and the power of rattling out sonatas and so forth, are far more valuable than those fugitive charms which a few years will tarnish. It is quite edifying to hear women speculate upon the worthlessness of beauty.\nBut though virtue is a much finer thing, and though, very likely, the heroic female character which ladies admire is a more glorious object than the fresh, artless, tender little domestic goddess, yet men do admire the latter more. Though I have been repeatedly told that Miss Brown is an insignificant chit, yet I see all the young fellows battling to dance with her; and so I think that to be despised by her sex is a very great compliment to a woman.\nThe young ladies in Amelia's society did this for her very satisfactorily. The Misses Osborne, George's sisters, and the Misses Dobbin agreed about nothing so well as her very trifling merits, and their wonder that their brothers could find any charms in her.\n\"We are kind to her,\" said the Misses Osborne, a pair of fine black-browed young ladies who had had the best governesses and milliners. They treated Amelia with such extreme kindness and condescension, and patronised her so insufferably, that the poor little thing was perfectly dumb and stupid in their presence. She tried to like them, and passed the most dreary mornings with them. She drove out in their great family coach; they took her to concerts, and to St. Paul's to see the charity children. Their house was comfortable; their society solemn and genteel; their self-respect prodigious; all their habits were pompous and orderly, and all their amusements intolerably dull and decorous. After every visit Miss Osborne and Miss Maria Osborne, and Miss Wirt the governess, asked each other with increased wonder, \"What could George find in that creature?\"\nHow is this? some carping reader exclaims. How is it that Amelia, who had so many loving friends at school, comes out into the world and is spurned by her sex? My dear sir, there were no men at Miss Pinkerton's establishment except the old dancing-master. When George, their handsome brother, ran off directly after breakfast, and dined away from home half-a-dozen times a week, his neglected sisters felt a little vexed. When young Bullock (of Bullock & Co., Bankers), who had been making up to Miss Maria Osborne the last two seasons, asked Amelia to dance, could you expect Maria to be pleased? And yet she said she was.\n\"I'm so delighted you like dear Amelia,\" she said quite eagerly to Mr. Bullock. \"She's engaged to my brother George; there's not much in her, but we're all so fond of her.\" Dear girl! who can calculate the depth of affection expressed in that enthusiastic SO?\nMiss Wirt and these two affectionate young women so frequently reminded George Osborne of the great sacrifice he was making in throwing himself away upon Amelia, that he really thought he was one of the most deserving characters in the British army.\nAlthough he dined out six days a week, when his sisters believed him to be with Amelia, he was not always with her. On several occasions, when Captain Dobbin called for his friend, Miss Osborne (who was very attentive to the Captain) would laughingly point across the square, and say, \"Oh, you must go to the Sedleys' for George; we never see him.\" At which the Captain would laugh in a rather constrained manner, and turn the conversation to some other topic.\n\"What an innocent it is,\" Miss Maria would then say to Miss Jane, upon his departure. \"Did you see how he blushed at the mention of poor George on duty?\"\n\"It's a pity Frederick Bullock hasn't some of his modesty, Maria,\" replied the elder sister, with a toss of her head.\nThe fact is, when Captain Dobbin blushed, and looked so awkward, it was because he had already called at Mr. Sedley's house, and George wasn't there, only poor little Amelia, with rather a sad wistful face, who asked, had Captain Dobbin seen Mr. Osborne that day?\nCaptain Dobbin had not. \"He was with his sister, most likely,\" the Captain said. So he crossed the square to fetch the truant; and Amelia waited and waited, but George never came.\nPoor little tender heart! So it goes on hoping and trusting. You see it is not much of a life to describe. There is not much incident in it. Only one feeling all day - when will he come? I believe George was playing billiards with Captain Cannon when Amelia was asking Captain Dobbin about him; for George was a sociable fellow, and excellent in games of skill.\nOnce, after three days of absence, Miss Amelia put on her bonnet, and actually invaded the Osborne house.\n\"What! leave our brother to come to us?\" said the young ladies. \"Have you had a quarrel, Amelia?\"\nNo, indeed. \"Who could quarrel with him?\" said she, with her eyes filled with tears. She only came over to see her dear friends; they had not met for so long. And this day she was so perfectly stupid and awkward, that the Misses Osborne wondered more than ever what George could see in her.\nHow was she to bare that timid little heart for the inspection of those bold young ladies? The Misses Osborne were excellent critics of a Cashmere shawl, or a pink satin slip; but there are things of a finer texture than satin. And there are sweet modest little souls blooming tenderly in quiet shady places.\nThe life of a good young girl who is still in the paternal nest can't have many of those thrilling incidents which happen to the heroine of a romance. While Becky Sharp was on the wing in the country, hopping on all sorts of twigs, amid a multiplicity of traps, and pecking up her food quite successfully, Amelia lay snug in her nest at Russell Square; that cheery comfortable home in which she was affectionately sheltered. Mamma had her morning duties, and her daily drive, and the delightful round of visits and shopping which is the profession of the rich London lady. Papa conducted his mysterious operations in the City - a stirring place in those days, when war was raging all over Europe. Old Sedley once or twice came home with a very grave face; and no wonder, when news of battles and retreats was agitating all the stock-markets.\nMeanwhile matters went on in Russell Square just the same. The retreat from Leipsic made no difference to the meals in the servants' hall; the allies poured into France, and the dinner-bell rang at five o'clock just as usual. I don't think poor Amelia was interested in the war until Napoleon abdicated; when she clapped her hands and prayed - oh, how gratefully! and flung herself into George Osborne's arms, to everyone's astonishment. Peace was declared, Napoleon was overthrown, and Lieutenant Osborne's regiment would not need to fight. That was how Amelia reasoned. The fate of Europe was Lieutenant George Osborne to her. He was her Europe and her emperor: her sun and moon.\nWe have talked of poverty as Becky Sharp's dismal instructor. Now love was Miss Amelia Sedley's tutor, and it was amazing what progress our young lady made under that teacher. In the course of eighteen months, what a deal of secrets Amelia learned, which Miss Wirt and the young ladies over the way had no knowledge of! How should they? Miss Maria Osborne, it is true, was \"attached\" to Mr. Frederick Bullock, but hers was a most respectable attachment, and she would have taken the gouty old Bullock Senior if he had not been married. Her mind was fixed - as a well-bred young lady's should be - upon a house in Park Lane, a country home at Wimbledon, a handsome carriage, and a fourth of the annual profits of Hulker & Bullock.\nThis was not the sort of love that finished Amelia's education, and over the year turned a good young girl into a good young woman. She loved George Osborne with all her heart. She thought about him the first moment on waking; and his was the last name mentioned in her prayers. She never had seen a man so beautiful or so clever: such a figure on horseback: such a dancer: such a hero in general. He was good enough to be a fairy prince; and oh, what magnanimity to stoop to such a humble Cinderella! This blind devotion is in the nature of some women. Some are made to scheme, and some to love.\nMeanwhile, Miss Amelia neglected her twelve dear friends at Chiswick most cruelly; although she had little Laura Martin for the holidays; and made a confidante of her, and promised that Laura should come and live with her when she was married, and gave Laura a great deal of information about love, which must have been singularly useful to that little person. Alas! I fear poor Emmy had not a well-regulated mind.\nWhat were her parents doing to help her? Old Sedley did not seem to notice matters. He was graver of late, and his City affairs absorbed him. Mrs. Sedley was of an easy nature. Mr. Jos was away at Cheltenham. Amelia had the house to herself - ah! too much to herself sometimes - not that she ever doubted George; for, to be sure, he must be at the Horse Guards; and he must see his friends and sisters when he is in town; and when he is with the regiment, he is too tired to write long letters.\nBut if Osborne's letters were short and soldier-like, Miss Sedley in return not only filled large sheets of paper, but crossed and underlined her writing, and copied whole pages out of poetry-books. She wasn't a heroine. Her letters were full of repetition. She wrote rather doubtful grammar sometimes, and in her verses took all sorts of liberties with the metre. But if you are not allowed to touch the heart in spite of poor syntax, may all Poetry go to the deuce, and every schoolmaster perish miserably!",
        "paragraph_chars": [
            [
                0,
                78
            ],
            [
                78,
                227
            ],
            [
                227,
                814
            ],
            [
                814,
                1268
            ],
            [
                1268,
                1528
            ],
            [
                1528,
                2390
            ],
            [
                2390,
                3014
            ],
            [
                3014,
                3274
            ],
            [
                3274,
                3524
            ],
            [
                3524,
                3985
            ],
            [
                3985,
                4139
            ],
            [
                4139,
                4257
            ],
            [
                4257,
                4521
            ],
            [
                4521,
                4701
            ],
            [
                4701,
                5063
            ],
            [
                5063,
                5169
            ],
            [
                5169,
                5267
            ],
            [
                5267,
                5558
            ],
            [
                5558,
                5867
            ],
            [
                5867,
                6709
            ],
            [
                6709,
                7391
            ],
            [
                7391,
                8121
            ],
            [
                8121,
                8718
            ],
            [
                8718,
                9133
            ],
            [
                9133,
                9628
            ],
            [
                9628,
                10136
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                227
            ],
            [
                227,
                487
            ],
            [
                487,
                735
            ],
            [
                735,
                814
            ],
            [
                814,
                1046
            ],
            [
                1046,
                1268
            ],
            [
                1268,
                1343
            ],
            [
                1343,
                1528
            ],
            [
                1528,
                1664
            ],
            [
                1664,
                1842
            ],
            [
                1842,
                1913
            ],
            [
                1913,
                2030
            ],
            [
                2030,
                2223
            ],
            [
                2223,
                2390
            ],
            [
                2390,
                2403
            ],
            [
                2403,
                2433
            ],
            [
                2433,
                2550
            ],
            [
                2550,
                2646
            ],
            [
                2646,
                2812
            ],
            [
                2812,
                2988
            ],
            [
                2988,
                3014
            ],
            [
                3014,
                3094
            ],
            [
                3094,
                3187
            ],
            [
                3187,
                3198
            ],
            [
                3198,
                3274
            ],
            [
                3274,
                3524
            ],
            [
                3524,
                3640
            ],
            [
                3640,
                3873
            ],
            [
                3873,
                3985
            ],
            [
                3985,
                4071
            ],
            [
                4071,
                4139
            ],
            [
                4139,
                4257
            ],
            [
                4257,
                4521
            ],
            [
                4521,
                4545
            ],
            [
                4545,
                4602
            ],
            [
                4602,
                4701
            ],
            [
                4701,
                4727
            ],
            [
                4727,
                4762
            ],
            [
                4762,
                4808
            ],
            [
                4808,
                4842
            ],
            [
                4842,
                4888
            ],
            [
                4888,
                5063
            ],
            [
                5063,
                5169
            ],
            [
                5169,
                5176
            ],
            [
                5176,
                5210
            ],
            [
                5210,
                5233
            ],
            [
                5233,
                5267
            ],
            [
                5267,
                5279
            ],
            [
                5279,
                5309
            ],
            [
                5309,
                5352
            ],
            [
                5352,
                5426
            ],
            [
                5426,
                5558
            ],
            [
                5558,
                5649
            ],
            [
                5649,
                5786
            ],
            [
                5786,
                5867
            ],
            [
                5867,
                6018
            ],
            [
                6018,
                6292
            ],
            [
                6292,
                6440
            ],
            [
                6440,
                6564
            ],
            [
                6564,
                6709
            ],
            [
                6709,
                6768
            ],
            [
                6768,
                6935
            ],
            [
                6935,
                7073
            ],
            [
                7073,
                7147
            ],
            [
                7147,
                7251
            ],
            [
                7251,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7391
            ],
            [
                7391,
                7453
            ],
            [
                7453,
                7567
            ],
            [
                7567,
                7711
            ],
            [
                7711,
                7728
            ],
            [
                7728,
                7927
            ],
            [
                7927,
                8121
            ],
            [
                8121,
                8253
            ],
            [
                8253,
                8298
            ],
            [
                8298,
                8400
            ],
            [
                8400,
                8519
            ],
            [
                8519,
                8623
            ],
            [
                8623,
                8675
            ],
            [
                8675,
                8718
            ],
            [
                8718,
                9079
            ],
            [
                9079,
                9085
            ],
            [
                9085,
                9133
            ],
            [
                9133,
                9174
            ],
            [
                9174,
                9217
            ],
            [
                9217,
                9275
            ],
            [
                9275,
                9310
            ],
            [
                9310,
                9342
            ],
            [
                9342,
                9380
            ],
            [
                9380,
                9628
            ],
            [
                9628,
                9827
            ],
            [
                9827,
                9849
            ],
            [
                9849,
                9886
            ],
            [
                9886,
                9993
            ],
            [
                9993,
                10136
            ]
        ],
        "overlap_chars": [
            [
                0,
                11
            ],
            [
                12,
                78
            ],
            [
                78,
                142
            ],
            [
                144,
                151
            ],
            [
                152,
                159
            ],
            [
                162,
                163
            ],
            [
                164,
                168
            ],
            [
                176,
                181
            ],
            [
                182,
                190
            ],
            [
                194,
                225
            ],
            [
                225,
                227
            ],
            [
                227,
                249
            ],
            [
                250,
                280
            ],
            [
                281,
                345
            ],
            [
                345,
                346
            ],
            [
                347,
                405
            ],
            [
                406,
                487
            ],
            [
                487,
                507
            ],
            [
                508,
                524
            ],
            [
                525,
                557
            ],
            [
                558,
                601
            ],
            [
                602,
                605
            ],
            [
                606,
                627
            ],
            [
                632,
                639
            ],
            [
                640,
                675
            ],
            [
                676,
                725
            ],
            [
                726,
                735
            ],
            [
                735,
                802
            ],
            [
                803,
                814
            ],
            [
                814,
                854
            ],
            [
                855,
                946
            ],
            [
                947,
                962
            ],
            [
                963,
                968
            ],
            [
                968,
                1010
            ],
            [
                1011,
                1014
            ],
            [
                1015,
                1028
            ],
            [
                1029,
                1039
            ],
            [
                1044,
                1046
            ],
            [
                1046,
                1080
            ],
            [
                1081,
                1122
            ],
            [
                1123,
                1128
            ],
            [
                1129,
                1132
            ],
            [
                1133,
                1177
            ],
            [
                1178,
                1181
            ],
            [
                1181,
                1191
            ],
            [
                1192,
                1268
            ],
            [
                1268,
                1343
            ],
            [
                1343,
                1388
            ],
            [
                1396,
                1409
            ],
            [
                1424,
                1434
            ],
            [
                1435,
                1459
            ],
            [
                1459,
                1460
            ],
            [
                1461,
                1527
            ],
            [
                1528,
                1549
            ],
            [
                1550,
                1554
            ],
            [
                1555,
                1573
            ],
            [
                1573,
                1636
            ],
            [
                1637,
                1648
            ],
            [
                1649,
                1662
            ],
            [
                1664,
                1676
            ],
            [
                1684,
                1796
            ],
            [
                1797,
                1811
            ],
            [
                1812,
                1815
            ],
            [
                1816,
                1822
            ],
            [
                1823,
                1840
            ],
            [
                1840,
                1842
            ],
            [
                1842,
                1845
            ],
            [
                1852,
                1865
            ],
            [
                1866,
                1869
            ],
            [
                1870,
                1876
            ],
            [
                1877,
                1892
            ],
            [
                1893,
                1901
            ],
            [
                1902,
                1911
            ],
            [
                1911,
                1913
            ],
            [
                1913,
                1926
            ],
            [
                1927,
                1954
            ],
            [
                1956,
                1972
            ],
            [
                1973,
                1981
            ],
            [
                1981,
                2028
            ],
            [
                2028,
                2030
            ],
            [
                2030,
                2057
            ],
            [
                2057,
                2123
            ],
            [
                2124,
                2223
            ],
            [
                2223,
                2234
            ],
            [
                2241,
                2291
            ],
            [
                2292,
                2295
            ],
            [
                2296,
                2390
            ],
            [
                2390,
                2403
            ],
            [
                2403,
                2433
            ],
            [
                2433,
                2463
            ],
            [
                2464,
                2466
            ],
            [
                2479,
                2496
            ],
            [
                2496,
                2544
            ],
            [
                2545,
                2550
            ],
            [
                2550,
                2644
            ],
            [
                2646,
                2726
            ],
            [
                2732,
                2768
            ],
            [
                2773,
                2808
            ],
            [
                2810,
                2812
            ],
            [
                2812,
                2834
            ],
            [
                2835,
                2857
            ],
            [
                2857,
                2896
            ],
            [
                2905,
                2926
            ],
            [
                2927,
                2948
            ],
            [
                2948,
                2966
            ],
            [
                2976,
                2988
            ],
            [
                2988,
                3012
            ],
            [
                3012,
                3013
            ],
            [
                3014,
                3092
            ],
            [
                3092,
                3094
            ],
            [
                3094,
                3159
            ],
            [
                3160,
                3187
            ],
            [
                3187,
                3198
            ],
            [
                3198,
                3274
            ],
            [
                3274,
                3325
            ],
            [
                3326,
                3336
            ],
            [
                3346,
                3360
            ],
            [
                3361,
                3367
            ],
            [
                3374,
                3397
            ],
            [
                3398,
                3435
            ],
            [
                3436,
                3522
            ],
            [
                3522,
                3524
            ],
            [
                3524,
                3535
            ],
            [
                3536,
                3541
            ],
            [
                3546,
                3554
            ],
            [
                3555,
                3556
            ],
            [
                3557,
                3588
            ],
            [
                3589,
                3592
            ],
            [
                3593,
                3598
            ],
            [
                3604,
                3611
            ],
            [
                3612,
                3634
            ],
            [
                3635,
                3638
            ],
            [
                3638,
                3640
            ],
            [
                3640,
                3642
            ],
            [
                3651,
                3660
            ],
            [
                3660,
                3688
            ],
            [
                3689,
                3756
            ],
            [
                3758,
                3780
            ],
            [
                3788,
                3841
            ],
            [
                3842,
                3870
            ],
            [
                3870,
                3873
            ],
            [
                3873,
                3881
            ],
            [
                3882,
                3908
            ],
            [
                3909,
                3910
            ],
            [
                3911,
                3917
            ],
            [
                3918,
                3946
            ],
            [
                3947,
                3963
            ],
            [
                3964,
                3971
            ],
            [
                3978,
                3983
            ],
            [
                3983,
                3985
            ],
            [
                3985,
                4008
            ],
            [
                4008,
                4055
            ],
            [
                4060,
                4071
            ],
            [
                4071,
                4139
            ],
            [
                4139,
                4169
            ],
            [
                4174,
                4205
            ],
            [
                4214,
                4246
            ],
            [
                4251,
                4257
            ],
            [
                4257,
                4297
            ],
            [
                4297,
                4321
            ],
            [
                4322,
                4328
            ],
            [
                4337,
                4343
            ],
            [
                4344,
                4351
            ],
            [
                4359,
                4380
            ],
            [
                4380,
                4463
            ],
            [
                4464,
                4467
            ],
            [
                4473,
                4474
            ],
            [
                4475,
                4521
            ],
            [
                4529,
                4543
            ],
            [
                4543,
                4545
            ],
            [
                4545,
                4602
            ],
            [
                4602,
                4604
            ],
            [
                4605,
                4626
            ],
            [
                4630,
                4646
            ],
            [
                4646,
                4651
            ],
            [
                4659,
                4701
            ],
            [
                4701,
                4727
            ],
            [
                4727,
                4751
            ],
            [
                4752,
                4762
            ],
            [
                4762,
                4808
            ],
            [
                4808,
                4825
            ],
            [
                4826,
                4842
            ],
            [
                4842,
                4866
            ],
            [
                4869,
                4888
            ],
            [
                4888,
                4946
            ],
            [
                4947,
                5012
            ],
            [
                5013,
                5046
            ],
            [
                5047,
                5063
            ],
            [
                5063,
                5168
            ],
            [
                5169,
                5176
            ],
            [
                5176,
                5210
            ],
            [
                5210,
                5233
            ],
            [
                5233,
                5264
            ],
            [
                5267,
                5277
            ],
            [
                5277,
                5279
            ],
            [
                5279,
                5309
            ],
            [
                5314,
                5352
            ],
            [
                5352,
                5370
            ],
            [
                5371,
                5426
            ],
            [
                5426,
                5503
            ],
            [
                5504,
                5552
            ],
            [
                5553,
                5556
            ],
            [
                5556,
                5558
            ],
            [
                5558,
                5629
            ],
            [
                5630,
                5634
            ],
            [
                5635,
                5647
            ],
            [
                5647,
                5649
            ],
            [
                5649,
                5733
            ],
            [
                5734,
                5754
            ],
            [
                5755,
                5778
            ],
            [
                5779,
                5784
            ],
            [
                5784,
                5786
            ],
            [
                5786,
                5825
            ],
            [
                5826,
                5865
            ],
            [
                5865,
                5866
            ],
            [
                5867,
                5903
            ],
            [
                5910,
                5930
            ],
            [
                5931,
                5975
            ],
            [
                5976,
                5981
            ],
            [
                5989,
                5991
            ],
            [
                5992,
                6006
            ],
            [
                6009,
                6016
            ],
            [
                6016,
                6018
            ],
            [
                6018,
                6042
            ],
            [
                6043,
                6046
            ],
            [
                6047,
                6098
            ],
            [
                6099,
                6158
            ],
            [
                6171,
                6195
            ],
            [
                6204,
                6219
            ],
            [
                6220,
                6224
            ],
            [
                6225,
                6292
            ],
            [
                6292,
                6396
            ],
            [
                6400,
                6414
            ],
            [
                6415,
                6440
            ],
            [
                6440,
                6492
            ],
            [
                6493,
                6494
            ],
            [
                6495,
                6562
            ],
            [
                6564,
                6642
            ],
            [
                6643,
                6647
            ],
            [
                6648,
                6650
            ],
            [
                6659,
                6662
            ],
            [
                6672,
                6693
            ],
            [
                6707,
                6709
            ],
            [
                6709,
                6752
            ],
            [
                6753,
                6757
            ],
            [
                6758,
                6761
            ],
            [
                6766,
                6768
            ],
            [
                6768,
                6811
            ],
            [
                6815,
                6818
            ],
            [
                6819,
                6824
            ],
            [
                6825,
                6935
            ],
            [
                6935,
                6960
            ],
            [
                6961,
                6964
            ],
            [
                6965,
                6992
            ],
            [
                7002,
                7005
            ],
            [
                7011,
                7043
            ],
            [
                7053,
                7060
            ],
            [
                7071,
                7073
            ],
            [
                7073,
                7117
            ],
            [
                7117,
                7121
            ],
            [
                7133,
                7145
            ],
            [
                7145,
                7147
            ],
            [
                7147,
                7166
            ],
            [
                7176,
                7235
            ],
            [
                7241,
                7243
            ],
            [
                7249,
                7251
            ],
            [
                7251,
                7259
            ],
            [
                7264,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7355
            ],
            [
                7356,
                7359
            ],
            [
                7360,
                7376
            ],
            [
                7377,
                7389
            ],
            [
                7389,
                7391
            ],
            [
                7391,
                7408
            ],
            [
                7409,
                7416
            ],
            [
                7417,
                7419
            ],
            [
                7420,
                7431
            ],
            [
                7434,
                7440
            ],
            [
                7451,
                7453
            ],
            [
                7453,
                7456
            ],
            [
                7457,
                7486
            ],
            [
                7492,
                7557
            ],
            [
                7558,
                7567
            ],
            [
                7567,
                7583
            ],
            [
                7584,
                7599
            ],
            [
                7599,
                7663
            ],
            [
                7664,
                7689
            ],
            [
                7690,
                7696
            ],
            [
                7707,
                7711
            ],
            [
                7711,
                7721
            ],
            [
                7726,
                7728
            ],
            [
                7728,
                7791
            ],
            [
                7792,
                7800
            ],
            [
                7801,
                7869
            ],
            [
                7870,
                7873
            ],
            [
                7884,
                7898
            ],
            [
                7925,
                7926
            ],
            [
                7927,
                7935
            ],
            [
                7940,
                7945
            ],
            [
                7948,
                7950
            ],
            [
                7951,
                7968
            ],
            [
                7976,
                7985
            ],
            [
                7988,
                8024
            ],
            [
                8030,
                8054
            ],
            [
                8063,
                8102
            ],
            [
                8103,
                8119
            ],
            [
                8121,
                8183
            ],
            [
                8183,
                8184
            ],
            [
                8185,
                8188
            ],
            [
                8194,
                8197
            ],
            [
                8198,
                8251
            ],
            [
                8251,
                8253
            ],
            [
                8257,
                8262
            ],
            [
                8278,
                8296
            ],
            [
                8296,
                8298
            ],
            [
                8298,
                8323
            ],
            [
                8324,
                8363
            ],
            [
                8364,
                8400
            ],
            [
                8400,
                8519
            ],
            [
                8519,
                8525
            ],
            [
                8526,
                8623
            ],
            [
                8623,
                8642
            ],
            [
                8643,
                8659
            ],
            [
                8660,
                8675
            ],
            [
                8675,
                8716
            ],
            [
                8716,
                8718
            ],
            [
                8727,
                8799
            ],
            [
                8799,
                8800
            ],
            [
                8810,
                8837
            ],
            [
                8838,
                8859
            ],
            [
                8860,
                9004
            ],
            [
                9005,
                9010
            ],
            [
                9011,
                9055
            ],
            [
                9056,
                9079
            ],
            [
                9079,
                9083
            ],
            [
                9083,
                9085
            ],
            [
                9085,
                9133
            ],
            [
                9133,
                9160
            ],
            [
                9161,
                9163
            ],
            [
                9172,
                9174
            ],
            [
                9174,
                9197
            ],
            [
                9198,
                9217
            ],
            [
                9217,
                9275
            ],
            [
                9275,
                9293
            ],
            [
                9297,
                9301
            ],
            [
                9302,
                9308
            ],
            [
                9308,
                9310
            ],
            [
                9310,
                9326
            ],
            [
                9327,
                9342
            ],
            [
                9342,
                9373
            ],
            [
                9376,
                9380
            ],
            [
                9380,
                9409
            ],
            [
                9412,
                9437
            ],
            [
                9438,
                9444
            ],
            [
                9444,
                9462
            ],
            [
                9463,
                9465
            ],
            [
                9466,
                9501
            ],
            [
                9502,
                9534
            ],
            [
                9535,
                9539
            ],
            [
                9540,
                9542
            ],
            [
                9546,
                9553
            ],
            [
                9553,
                9554
            ],
            [
                9555,
                9627
            ],
            [
                9628,
                9644
            ],
            [
                9645,
                9652
            ],
            [
                9653,
                9675
            ],
            [
                9676,
                9680
            ],
            [
                9680,
                9681
            ],
            [
                9682,
                9693
            ],
            [
                9694,
                9696
            ],
            [
                9704,
                9719
            ],
            [
                9720,
                9725
            ],
            [
                9726,
                9735
            ],
            [
                9736,
                9754
            ],
            [
                9755,
                9758
            ],
            [
                9759,
                9769
            ],
            [
                9770,
                9773
            ],
            [
                9781,
                9782
            ],
            [
                9783,
                9786
            ],
            [
                9794,
                9825
            ],
            [
                9825,
                9827
            ],
            [
                9827,
                9849
            ],
            [
                9849,
                9886
            ],
            [
                9886,
                9993
            ],
            [
                9993,
                9996
            ],
            [
                9997,
                10038
            ],
            [
                10039,
                10050
            ],
            [
                10056,
                10062
            ],
            [
                10062,
                10136
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                227
            ],
            [
                227,
                487
            ],
            [
                487,
                487
            ],
            [
                487,
                735
            ],
            [
                735,
                814
            ],
            [
                814,
                1046
            ],
            [
                1046,
                1268
            ],
            [
                1268,
                1343
            ],
            [
                1343,
                1528
            ],
            [
                1528,
                1842
            ],
            [
                1842,
                1913
            ],
            [
                1913,
                2030
            ],
            [
                2030,
                2223
            ],
            [
                2223,
                2390
            ],
            [
                2390,
                2403
            ],
            [
                2403,
                2433
            ],
            [
                2433,
                2550
            ],
            [
                2550,
                2646
            ],
            [
                2646,
                2812
            ],
            [
                2812,
                2988
            ],
            [
                2988,
                3014
            ],
            [
                3014,
                3094
            ],
            [
                3094,
                3187
            ],
            [
                3187,
                3198
            ],
            [
                3198,
                3274
            ],
            [
                3274,
                3524
            ],
            [
                3524,
                3640
            ],
            [
                3640,
                3873
            ],
            [
                3873,
                3985
            ],
            [
                3985,
                4071
            ],
            [
                4071,
                4139
            ],
            [
                4139,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4257
            ],
            [
                4257,
                4521
            ],
            [
                4521,
                4545
            ],
            [
                4545,
                4602
            ],
            [
                4602,
                4701
            ],
            [
                4701,
                4727
            ],
            [
                4727,
                4762
            ],
            [
                4762,
                4808
            ],
            [
                4808,
                4842
            ],
            [
                4842,
                4888
            ],
            [
                4888,
                4888
            ],
            [
                4888,
                5063
            ],
            [
                5063,
                5169
            ],
            [
                5169,
                5176
            ],
            [
                5176,
                5210
            ],
            [
                5210,
                5233
            ],
            [
                5233,
                5267
            ],
            [
                5267,
                5267
            ],
            [
                5267,
                5279
            ],
            [
                5279,
                5309
            ],
            [
                5309,
                5352
            ],
            [
                5352,
                5426
            ],
            [
                5426,
                5558
            ],
            [
                5558,
                5558
            ],
            [
                5558,
                5649
            ],
            [
                5649,
                5649
            ],
            [
                5649,
                5786
            ],
            [
                5786,
                5867
            ],
            [
                5867,
                5867
            ],
            [
                5867,
                6018
            ],
            [
                6018,
                6018
            ],
            [
                6018,
                6292
            ],
            [
                6292,
                6440
            ],
            [
                6440,
                6564
            ],
            [
                6564,
                6709
            ],
            [
                6709,
                6768
            ],
            [
                6768,
                6935
            ],
            [
                6935,
                7073
            ],
            [
                7073,
                7147
            ],
            [
                7147,
                7251
            ],
            [
                7251,
                7281
            ],
            [
                7281,
                7338
            ],
            [
                7338,
                7338
            ],
            [
                7338,
                7391
            ],
            [
                7391,
                7453
            ],
            [
                7453,
                7567
            ],
            [
                7567,
                7711
            ],
            [
                7711,
                7728
            ],
            [
                7728,
                7728
            ],
            [
                7728,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8253
            ],
            [
                8253,
                8298
            ],
            [
                8298,
                8400
            ],
            [
                8400,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8623
            ],
            [
                8623,
                8675
            ],
            [
                8675,
                8718
            ],
            [
                8718,
                9079
            ],
            [
                9079,
                9085
            ],
            [
                9085,
                9133
            ],
            [
                9133,
                9174
            ],
            [
                9174,
                9217
            ],
            [
                9217,
                9275
            ],
            [
                9275,
                9310
            ],
            [
                9310,
                9342
            ],
            [
                9342,
                9380
            ],
            [
                9380,
                9628
            ],
            [
                9628,
                9628
            ],
            [
                9628,
                9628
            ],
            [
                9628,
                9628
            ],
            [
                9628,
                9827
            ],
            [
                9827,
                9849
            ],
            [
                9849,
                9886
            ],
            [
                9886,
                9993
            ],
            [
                9993,
                10136
            ]
        ]
    }
}