{
    "original": {
        "text": "I fear the gentleman to whom Miss Amelia's letters were addressed was rather an obdurate critic. Such a number of notes followed Lieutenant Osborne about the country, that he became almost ashamed of the jokes of his mess-room companions regarding them, and ordered his servant never to deliver them except at his private apartment. He was seen lighting his cigar with one, to the horror of Captain Dobbin, who, it is my belief, would have given a bank-note for the document.\nFor some time George strove to keep the liaison a secret. There was a woman in the case, that he admitted. \"And not the first either,\" said Ensign Spooney to Ensign Stubble. \"That Osborne's a devil of a fellow. There was a judge's daughter at Demerara went almost mad about him; then there was that beautiful quadroon girl, Miss Pye, at St. Vincent's, you know; and since he's been home, they say he's a regular Don Giovanni, by Jove.\"\nStubble and Spooney thought that to be a \"regular Don Giovanni, by Jove\" was one of the finest qualities a man could possess, and Osborne's reputation was prodigious amongst the young men of the regiment. He was famous in field-sports, famous at a song, famous on parade; free with his money, which was bountifully supplied by his father. His coats were better made than any man's in the regiment, and he had more of them. He was adored by the men. He could drink more than any officer of the whole mess, including old Heavytop, the colonel. He could spar better than Knuckles, the private (who would have been a corporal but for his drunkenness, and who had been in the prize-ring); and was the best batter and bowler, out and out, of the regimental club. He rode his own horse, Greased Lightning, and won the Garrison cup at Quebec races. There were other people besides Amelia who worshipped him. Stubble and Spooney thought him a sort of Apollo; Dobbin took him to be an Admirable Crichton; and Mrs. Major O'Dowd acknowledged he was an elegant young fellow, and put her in mind of Fitzjurld Fogarty, Lord Castlefogarty's second son.\nWell, Stubble and Spooney and the rest indulged in most romantic conjectures regarding this female correspondent of Osborne's--opining that it was a Duchess in London who was in love with him--or that it was a General's daughter, who was engaged to somebody else, and madly attached to him--or that it was a Member of Parliament's lady, who proposed four horses and an elopement--or that it was some other victim of a passion delightfully exciting, romantic, and disgraceful to all parties, on none of which conjectures would Osborne throw the least light, leaving his young admirers and friends to invent and arrange their whole history.\nAnd the real state of the case would never have been known at all in the regiment but for Captain Dobbin's indiscretion. The Captain was eating his breakfast one day in the mess-room, while Cackle, the assistant-surgeon, and the two above-named worthies were speculating upon Osborne's intrigue--Stubble holding out that the lady was a Duchess about Queen Charlotte's court, and Cackle vowing she was an opera-singer of the worst reputation. At this idea Dobbin became so moved, that though his mouth was full of eggs and bread-and-butter at the time, and though he ought not to have spoken at all, yet he couldn't help blurting out, \"Cackle, you're a stupid fool. You're always talking nonsense and scandal. Osborne is not going to run off with a Duchess or ruin a milliner. Miss Sedley is one of the most charming young women that ever lived. He's been engaged to her ever so long; and the man who calls her names had better not do so in my hearing.\" With which, turning exceedingly red, Dobbin ceased speaking, and almost choked himself with a cup of tea. The story was over the regiment in half-an-hour; and that very evening Mrs. Major O'Dowd wrote off to her sister Glorvina at O'Dowdstown not to hurry from Dublin--young Osborne being prematurely engaged already.\nShe complimented the Lieutenant in an appropriate speech over a glass of whisky-toddy that evening, and he went home perfectly furious to quarrel with Dobbin (who had declined Mrs. Major O'Dowd's party, and sat in his own room playing the flute, and, I believe, writing poetry in a very melancholy manner)--to quarrel with Dobbin for betraying his secret.\n\"Who the deuce asked you to talk about my affairs?\" Osborne shouted indignantly. \"Why the devil is all the regiment to know that I am going to be married? Why is that tattling old harridan, Peggy O'Dowd, to make free with my name at her d--d supper-table, and advertise my engagement over the three kingdoms? After all, what right have you to say I am engaged, or to meddle in my business at all, Dobbin?\"\n\"It seems to me,\" Captain Dobbin began.\n\"Seems be hanged, Dobbin,\" his junior interrupted him. \"I am under obligations to you, I know it, a d--d deal too well too; but I won't be always sermonised by you because you're five years my senior. I'm hanged if I'll stand your airs of superiority and infernal pity and patronage. Pity and patronage! I should like to know in what I'm your inferior?\"\n\"Are you engaged?\" Captain Dobbin interposed.\n\"What the devil's that to you or any one here if I am?\"\n\"Are you ashamed of it?\" Dobbin resumed.\n\"What right have you to ask me that question, sir? I should like to know,\" George said.\n\"Good God, you don't mean to say you want to break off?\" asked Dobbin, starting up.\n\"In other words, you ask me if I'm a man of honour,\" said Osborne, fiercely; \"is that what you mean? You've adopted such a tone regarding me lately that I'm ------ if I'll bear it any more.\"\n\"What have I done? I've told you you were neglecting a sweet girl, George. I've told you that when you go to town you ought to go to her, and not to the gambling-houses about St. James's.\"\n\"You want your money back, I suppose,\" said George, with a sneer.\n\"Of course I do--I always did, didn't I?\" says Dobbin. \"You speak like a generous fellow.\"\n\"No, hang it, William, I beg your pardon\"--here George interposed in a fit of remorse; \"you have been my friend in a hundred ways, Heaven knows. You've got me out of a score of scrapes. When Crawley of the Guards won that sum of money of me I should have been done but for you: I know I should. But you shouldn't deal so hardly with me; you shouldn't be always catechising me. I am very fond of Amelia; I adore her, and that sort of thing. Don't look angry. She's faultless; I know she is. But you see there's no fun in winning a thing unless you play for it. Hang it: the regiment's just back from the West Indies, I must have a little fling, and then when I'm married I'll reform; I will upon my honour, now. And--I say--Dob--don't be angry with me, and I'll give you a hundred next month, when I know my father will stand something handsome; and I'll ask Heavytop for leave, and I'll go to town, and see Amelia to-morrow--there now, will that satisfy you?\"\n\"It is impossible to be long angry with you, George,\" said the good-natured Captain; \"and as for the money, old boy, you know if I wanted it you'd share your last shilling with me.\"\n\"That I would, by Jove, Dobbin,\" George said, with the greatest generosity, though by the way he never had any money to spare.\n\"Only I wish you had sown those wild oats of yours, George. If you could have seen poor little Miss Emmy's face when she asked me about you the other day, you would have pitched those billiard-balls to the deuce. Go and comfort her, you rascal. Go and write her a long letter. Do something to make her happy; a very little will.\"\n\"I believe she's d--d fond of me,\" the Lieutenant said, with a self-satisfied air; and went off to finish the evening with some jolly fellows in the mess-room.\nAmelia meanwhile, in Russell Square, was looking at the moon, which was shining upon that peaceful spot, as well as upon the square of the Chatham barracks, where Lieutenant Osborne was quartered, and thinking to herself how her hero was employed. Perhaps he is visiting the sentries, thought she; perhaps he is bivouacking; perhaps he is attending the couch of a wounded comrade, or studying the art of war up in his own desolate chamber. And her kind thoughts sped away as if they were angels and had wings, and flying down the river to Chatham and Rochester, strove to peep into the barracks where George was. . . . All things considered, I think it was as well the gates were shut, and the sentry allowed no one to pass; so that the poor little white-robed angel could not hear the songs those young fellows were roaring over the whisky-punch.\nThe day after the little conversation at Chatham barracks, young Osborne, to show that he would be as good as his word, prepared to go to town, thereby incurring Captain Dobbin's applause. \"I should have liked to make her a little present,\" Osborne said to his friend in confidence, \"only I am quite out of cash until my father tips up.\" But Dobbin would not allow this good nature and generosity to be balked, and so accommodated Mr. Osborne with a few pound notes, which the latter took after a little faint scruple.\nAnd I dare say he would have bought something very handsome for Amelia; only, getting off the coach in Fleet Street, he was attracted by a handsome shirt-pin in a jeweller's window, which he could not resist; and having paid for that, had very little money to spare for indulging in any further exercise of kindness. Never mind: you may be sure it was not his presents Amelia wanted. When he came to Russell Square, her face lighted up as if he had been sunshine. The little cares, fears, tears, timid misgivings, sleepless fancies of I don't know how many days and nights, were forgotten, under one moment's influence of that familiar, irresistible smile. He beamed on her from the drawing-room door--magnificent, with ambrosial whiskers, like a god. Sambo, whose face as he announced Captain Osbin (having conferred a brevet rank on that young officer) blazed with a sympathetic grin, saw the little girl start, and flush, and jump up from her watching-place in the window; and Sambo retreated: and as soon as the door was shut, she went fluttering to Lieutenant George Osborne's heart as if it was the only natural home for her to nestle in. Oh, thou poor panting little soul! The very finest tree in the whole forest, with the straightest stem, and the strongest arms, and the thickest foliage, wherein you choose to build and coo, may be marked, for what you know, and may be down with a crash ere long. What an old, old simile that is, between man and timber!\nIn the meanwhile, George kissed her very kindly on her forehead and glistening eyes, and was very gracious and good; and she thought his diamond shirt-pin (which she had not known him to wear before) the prettiest ornament ever seen.\nThe observant reader, who has marked our young Lieutenant's previous behaviour, and has preserved our report of the brief conversation which he has just had with Captain Dobbin, has possibly come to certain conclusions regarding the character of Mr. Osborne. Some cynical Frenchman has said that there are two parties to a love-transaction: the one who loves and the other who condescends to be so treated. Perhaps the love is occasionally on the man's side; perhaps on the lady's. Perhaps some infatuated swain has ere this mistaken insensibility for modesty, dulness for maiden reserve, mere vacuity for sweet bashfulness, and a goose, in a word, for a swan. Perhaps some beloved female subscriber has arrayed an ass in the splendour and glory of her imagination; admired his dulness as manly simplicity; worshipped his selfishness as manly superiority; treated his stupidity as majestic gravity, and used him as the brilliant fairy Titania did a certain weaver at Athens. I think I have seen such comedies of errors going on in the world. But this is certain, that Amelia believed her lover to be one of the most gallant and brilliant men in the empire: and it is possible Lieutenant Osborne thought so too.\nHe was a little wild: how many young men are; and don't girls like a rake better than a milksop? He hadn't sown his wild oats as yet, but he would soon: and quit the army now that peace was proclaimed; the Corsican monster locked up at Elba; promotion by consequence over; and no chance left for the display of his undoubted military talents and valour: and his allowance, with Amelia's settlement, would enable them to take a snug place in the country somewhere, in a good sporting neighbourhood; and he would hunt a little, and farm a little; and they would be very happy. As for remaining in the army as a married man, that was impossible. Fancy Mrs. George Osborne in lodgings in a county town; or, worse still, in the East or West Indies, with a society of officers, and patronized by Mrs. Major O'Dowd! Amelia died with laughing at Osborne's stories about Mrs. Major O'Dowd. He loved her much too fondly to subject her to that horrid woman and her vulgarities, and the rough treatment of a soldier's wife. He didn't care for himself--not he; but his dear little girl should take the place in society to which, as his wife, she was entitled: and to these proposals you may be sure she acceded, as she would to any other from the same author.\nHolding this kind of conversation, and building numberless castles in the air (which Amelia adorned with all sorts of flower-gardens, rustic walks, country churches, Sunday schools, and the like; while George had his mind's eye directed to the stables, the kennel, and the cellar), this young pair passed away a couple of hours very pleasantly; and as the Lieutenant had only that single day in town, and a great deal of most important business to transact, it was proposed that Miss Emmy should dine with her future sisters-in-law. This invitation was accepted joyfully. He conducted her to his sisters; where he left her talking and prattling in a way that astonished those ladies, who thought that George might make something of her; and he then went off to transact his business.\nIn a word, he went out and ate ices at a pastry-cook's shop in Charing Cross; tried a new coat in Pall Mall; dropped in at the Old Slaughters', and called for Captain Cannon; played eleven games at billiards with the Captain, of which he won eight, and returned to Russell Square half an hour late for dinner, but in very good humour.\nIt was not so with old Mr. Osborne. When that gentleman came from the City, and was welcomed in the drawing-room by his daughters and the elegant Miss Wirt, they saw at once by his face--which was puffy, solemn, and yellow at the best of times--and by the scowl and twitching of his black eyebrows, that the heart within his large white waistcoat was disturbed and uneasy. When Amelia stepped forward to salute him, which she always did with great trembling and timidity, he gave a surly grunt of recognition, and dropped the little hand out of his great hirsute paw without any attempt to hold it there. He looked round gloomily at his eldest daughter; who, comprehending the meaning of his look, which asked unmistakably, \"Why the devil is she here?\" said at once:\n\"George is in town, Papa; and has gone to the Horse Guards, and will be back to dinner.\"\n\"O he is, is he? I won't have the dinner kept waiting for him, Jane\"; with which this worthy man lapsed into his particular chair, and then the utter silence in his genteel, well-furnished drawing-room was only interrupted by the alarmed ticking of the great French clock.\nWhen that chronometer, which was surmounted by a cheerful brass group of the sacrifice of Iphigenia, tolled five in a heavy cathedral tone, Mr. Osborne pulled the bell at his right hand--violently, and the butler rushed up.\n\"Dinner!\" roared Mr. Osborne.\n\"Mr. George isn't come in, sir,\" interposed the man.\n\"Damn Mr. George, sir. Am I master of the house? DINNER!\" Mr. Osborne scowled. Amelia trembled. A telegraphic communication of eyes passed between the other three ladies. The obedient bell in the lower regions began ringing the announcement of the meal. The tolling over, the head of the family thrust his hands into the great tail-pockets of his great blue coat with brass buttons, and without waiting for a further announcement strode downstairs alone, scowling over his shoulder at the four females.\n\"What's the matter now, my dear?\" asked one of the other, as they rose and tripped gingerly behind the sire. \"I suppose the funds are falling,\" whispered Miss Wirt; and so, trembling and in silence, this hushed female company followed their dark leader. They took their places in silence. He growled out a blessing, which sounded as gruffly as a curse. The great silver dish-covers were removed. Amelia trembled in her place, for she was next to the awful Osborne, and alone on her side of the table--the gap being occasioned by the absence of George.\n\"Soup?\" says Mr. Osborne, clutching the ladle, fixing his eyes on her, in a sepulchral tone; and having helped her and the rest, did not speak for a while.\n\"Take Miss Sedley's plate away,\" at last he said. \"She can't eat the soup--no more can I. It's beastly. Take away the soup, Hicks, and to-morrow turn the cook out of the house, Jane.\"\nHaving concluded his observations upon the soup, Mr. Osborne made a few curt remarks respecting the fish, also of a savage and satirical tendency, and cursed Billingsgate with an emphasis quite worthy of the place. Then he lapsed into silence, and swallowed sundry glasses of wine, looking more and more terrible, till a brisk knock at the door told of George's arrival when everybody began to rally.\n\"He could not come before. General Daguilet had kept him waiting at the Horse Guards. Never mind soup or fish. Give him anything--he didn't care what. Capital mutton--capital everything.\" His good humour contrasted with his father's severity; and he rattled on unceasingly during dinner, to the delight of all--of one especially, who need not be mentioned.\nAs soon as the young ladies had discussed the orange and the glass of wine which formed the ordinary conclusion of the dismal banquets at Mr. Osborne's house, the signal to make sail for the drawing-room was given, and they all arose and departed. Amelia hoped George would soon join them there. She began playing some of his favourite waltzes (then newly imported) at the great carved-legged, leather-cased grand piano in the drawing-room overhead. This little artifice did not bring him. He was deaf to the waltzes; they grew fainter and fainter; the discomfited performer left the huge instrument presently; and though her three friends performed some of the loudest and most brilliant new pieces of their repertoire, she did not hear a single note, but sate thinking, and boding evil. Old Osborne's scowl, terrific always, had never before looked so deadly to her. His eyes followed her out of the room, as if she had been guilty of something. When they brought her coffee, she started as though it were a cup of poison which Mr. Hicks, the butler, wished to propose to her. What mystery was there lurking? Oh, those women! They nurse and cuddle their presentiments, and make darlings of their ugliest thoughts, as they do of their deformed children.\nThe gloom on the paternal countenance had also impressed George Osborne with anxiety. With such eyebrows, and a look so decidedly bilious, how was he to extract that money from the governor, of which George was consumedly in want? He began praising his father's wine. That was generally a successful means of cajoling the old gentleman.\n\"We never got such Madeira in the West Indies, sir, as yours. Colonel Heavytop took off three bottles of that you sent me down, under his belt the other day.\"\n\"Did he?\" said the old gentleman. \"It stands me in eight shillings a bottle.\"\n\"Will you take six guineas a dozen for it, sir?\" said George, with a laugh. \"There's one of the greatest men in the kingdom wants some.\"\n\"Does he?\" growled the senior. \"Wish he may get it.\"\n\"When General Daguilet was at Chatham, sir, Heavytop gave him a breakfast, and asked me for some of the wine. The General liked it just as well--wanted a pipe for the Commander-in-Chief. He's his Royal Highness's right-hand man.\"\n\"It is devilish fine wine,\" said the Eyebrows, and they looked more good-humoured; and George was going to take advantage of this complacency, and bring the supply question on the mahogany, when the father, relapsing into solemnity, though rather cordial in manner, bade him ring the bell for claret. \"And we'll see if that's as good as the Madeira, George, to which his Royal Highness is welcome, I'm sure. And as we are drinking it, I'll talk to you about a matter of importance.\"\nAmelia heard the claret bell ringing as she sat nervously upstairs. She thought, somehow, it was a mysterious and presentimental bell. Of the presentiments which some people are always having, some surely must come right.\n\"What I want to know, George,\" the old gentleman said, after slowly smacking his first bumper--\"what I want to know is, how you and--ah--that little thing upstairs, are carrying on?\"\n\"I think, sir, it is not hard to see,\" George said, with a self-satisfied grin. \"Pretty clear, sir.--What capital wine!\"\n\"What d'you mean, pretty clear, sir?\"\n\"Why, hang it, sir, don't push me too hard. I'm a modest man. I--ah--I don't set up to be a lady-killer; but I do own that she's as devilish fond of me as she can be. Anybody can see that with half an eye.\"\n\"And you yourself?\"\n\"Why, sir, didn't you order me to marry her, and ain't I a good boy? Haven't our Papas settled it ever so long?\"\n\"A pretty boy, indeed. Haven't I heard of your doings, sir, with Lord Tarquin, Captain Crawley of the Guards, the Honourable Mr. Deuceace and that set. Have a care sir, have a care.\"\nThe old gentleman pronounced these aristocratic names with the greatest gusto. Whenever he met a great man he grovelled before him, and my-lorded him as only a free-born Briton can do. He came home and looked out his history in the Peerage: he introduced his name into his daily conversation; he bragged about his Lordship to his daughters. He fell down prostrate and basked in him as a Neapolitan beggar does in the sun. George was alarmed when he heard the names. He feared his father might have been informed of certain transactions at play. But the old moralist eased him by saying serenely:\n\"Well, well, young men will be young men. And the comfort to me is, George, that living in the best society in England, as I hope you do; as I think you do; as my means will allow you to do--\"\n\"Thank you, sir,\" says George, making his point at once. \"One can't live with these great folks for nothing; and my purse, sir, look at it\"; and he held up a little token which had been netted by Amelia, and contained the very last of Dobbin's pound notes.\n\"You shan't want, sir. The British merchant's son shan't want, sir. My guineas are as good as theirs, George, my boy; and I don't grudge 'em. Call on Mr. Chopper as you go through the City to-morrow; he'll have something for you. I don't grudge money when I know you're in good society, because I know that good society can never go wrong. There's no pride in me. I was a humbly born man--but you have had advantages. Make a good use of 'em. Mix with the young nobility. There's many of 'em who can't spend a dollar to your guinea, my boy. And as for the pink bonnets (here from under the heavy eyebrows there came a knowing and not very pleasing leer)--why boys will be boys. Only there's one thing I order you to avoid, which, if you do not, I'll cut you off with a shilling, by Jove; and that's gambling.\"\n\"Oh, of course, sir,\" said George.\n\"But to return to the other business about Amelia: why shouldn't you marry higher than a stockbroker's daughter, George--that's what I want to know?\"\n\"It's a family business, sir,\" says George, cracking filberts. \"You and Mr. Sedley made the match a hundred years ago.\"\n\"I don't deny it; but people's positions alter, sir. I don't deny that Sedley made my fortune, or rather put me in the way of acquiring, by my own talents and genius, that proud position, which, I may say, I occupy in the tallow trade and the City of London. I've shown my gratitude to Sedley; and he's tried it of late, sir, as my cheque-book can show. George! I tell you in confidence I don't like the looks of Mr. Sedley's affairs. My chief clerk, Mr. Chopper, does not like the looks of 'em, and he's an old file, and knows 'Change as well as any man in London. Hulker & Bullock are looking shy at him. He's been dabbling on his own account I fear. They say the Jeune Amelie was his, which was taken by the Yankee privateer Molasses. And that's flat--unless I see Amelia's ten thousand down you don't marry her. I'll have no lame duck's daughter in my family. Pass the wine, sir--or ring for coffee.\"\nWith which Mr. Osborne spread out the evening paper, and George knew from this signal that the colloquy was ended, and that his papa was about to take a nap.\nHe hurried upstairs to Amelia in the highest spirits. What was it that made him more attentive to her on that night than he had been for a long time--more eager to amuse her, more tender, more brilliant in talk? Was it that his generous heart warmed to her at the prospect of misfortune; or that the idea of losing the dear little prize made him value it more?\nShe lived upon the recollections of that happy evening for many days afterwards, remembering his words; his looks; the song he sang; his attitude, as he leant over her or looked at her from a distance. As it seemed to her, no night ever passed so quickly at Mr. Osborne's house before; and for once this young person was almost provoked to be angry by the premature arrival of Mr. Sambo with her shawl.\nGeorge came and took a tender leave of her the next morning; and then hurried off to the City, where he visited Mr. Chopper, his father's head man, and received from that gentleman a document which he exchanged at Hulker & Bullock's for a whole pocketful of money. As George entered the house, old John Sedley was passing out of the banker's parlour, looking very dismal. But his godson was much too elated to mark the worthy stockbroker's depression, or the dreary eyes which the kind old gentleman cast upon him. Young Bullock did not come grinning out of the parlour with him as had been his wont in former years.\nAnd as the swinging doors of Hulker, Bullock & Co. closed upon Mr. Sedley, Mr. Quill, the cashier (whose benevolent occupation it is to hand out crisp bank-notes from a drawer and dispense sovereigns out of a copper shovel), winked at Mr. Driver, the clerk at the desk on his right. Mr. Driver winked again.\n\"No go,\" Mr. D. whispered.\n\"Not at no price,\" Mr. Q. said. \"Mr. George Osborne, sir, how will you take it?\" George crammed eagerly a quantity of notes into his pockets, and paid Dobbin fifty pounds that very evening at mess.\nThat very evening Amelia wrote him the tenderest of long letters. Her heart was overflowing with tenderness, but it still foreboded evil. What was the cause of Mr. Osborne's dark looks? she asked. Had any difference arisen between him and her papa? Her poor papa returned so melancholy from the City, that all were alarmed about him at home--in fine, there were four pages of loves and fears and hopes and forebodings.\n\"Poor little Emmy--dear little Emmy. How fond she is of me,\" George said, as he perused the missive--\"and Gad, what a headache that mixed punch has given me!\" Poor little Emmy, indeed.",
        "paragraph_chars": [
            [
                0,
                476
            ],
            [
                476,
                912
            ],
            [
                912,
                2049
            ],
            [
                2049,
                2688
            ],
            [
                2688,
                3959
            ],
            [
                3959,
                4315
            ],
            [
                4315,
                4721
            ],
            [
                4721,
                4761
            ],
            [
                4761,
                5115
            ],
            [
                5115,
                5161
            ],
            [
                5161,
                5217
            ],
            [
                5217,
                5258
            ],
            [
                5258,
                5346
            ],
            [
                5346,
                5430
            ],
            [
                5430,
                5621
            ],
            [
                5621,
                5810
            ],
            [
                5810,
                5876
            ],
            [
                5876,
                5967
            ],
            [
                5967,
                6927
            ],
            [
                6927,
                7109
            ],
            [
                7109,
                7236
            ],
            [
                7236,
                7566
            ],
            [
                7566,
                7726
            ],
            [
                7726,
                8574
            ],
            [
                8574,
                9093
            ],
            [
                9093,
                10559
            ],
            [
                10559,
                10793
            ],
            [
                10793,
                12004
            ],
            [
                12004,
                13251
            ],
            [
                13251,
                14035
            ],
            [
                14035,
                14370
            ],
            [
                14370,
                15137
            ],
            [
                15137,
                15226
            ],
            [
                15226,
                15499
            ],
            [
                15499,
                15723
            ],
            [
                15723,
                15753
            ],
            [
                15753,
                15806
            ],
            [
                15806,
                16309
            ],
            [
                16309,
                16861
            ],
            [
                16861,
                17017
            ],
            [
                17017,
                17201
            ],
            [
                17201,
                17602
            ],
            [
                17602,
                17959
            ],
            [
                17959,
                19214
            ],
            [
                19214,
                19551
            ],
            [
                19551,
                19710
            ],
            [
                19710,
                19788
            ],
            [
                19788,
                19925
            ],
            [
                19925,
                19978
            ],
            [
                19978,
                20208
            ],
            [
                20208,
                20691
            ],
            [
                20691,
                20913
            ],
            [
                20913,
                21096
            ],
            [
                21096,
                21217
            ],
            [
                21217,
                21255
            ],
            [
                21255,
                21462
            ],
            [
                21462,
                21482
            ],
            [
                21482,
                21595
            ],
            [
                21595,
                21778
            ],
            [
                21778,
                22374
            ],
            [
                22374,
                22567
            ],
            [
                22567,
                22824
            ],
            [
                22824,
                23633
            ],
            [
                23633,
                23668
            ],
            [
                23668,
                23818
            ],
            [
                23818,
                23938
            ],
            [
                23938,
                24843
            ],
            [
                24843,
                25001
            ],
            [
                25001,
                25362
            ],
            [
                25362,
                25765
            ],
            [
                25765,
                26382
            ],
            [
                26382,
                26690
            ],
            [
                26690,
                26717
            ],
            [
                26717,
                26915
            ],
            [
                26915,
                27334
            ],
            [
                27334,
                27518
            ]
        ],
        "segment_chars": [
            [
                0,
                97
            ],
            [
                97,
                333
            ],
            [
                333,
                476
            ],
            [
                476,
                534
            ],
            [
                534,
                583
            ],
            [
                583,
                650
            ],
            [
                650,
                687
            ],
            [
                687,
                912
            ],
            [
                912,
                1117
            ],
            [
                1117,
                1251
            ],
            [
                1251,
                1335
            ],
            [
                1335,
                1361
            ],
            [
                1361,
                1454
            ],
            [
                1454,
                1669
            ],
            [
                1669,
                1753
            ],
            [
                1753,
                1812
            ],
            [
                1812,
                2049
            ],
            [
                2049,
                2688
            ],
            [
                2688,
                2809
            ],
            [
                2809,
                3130
            ],
            [
                3130,
                3353
            ],
            [
                3353,
                3397
            ],
            [
                3397,
                3464
            ],
            [
                3464,
                3533
            ],
            [
                3533,
                3641
            ],
            [
                3641,
                3747
            ],
            [
                3747,
                3959
            ],
            [
                3959,
                4315
            ],
            [
                4315,
                4367
            ],
            [
                4367,
                4396
            ],
            [
                4396,
                4470
            ],
            [
                4470,
                4624
            ],
            [
                4624,
                4721
            ],
            [
                4721,
                4761
            ],
            [
                4761,
                4816
            ],
            [
                4816,
                4962
            ],
            [
                4962,
                5045
            ],
            [
                5045,
                5065
            ],
            [
                5065,
                5115
            ],
            [
                5115,
                5134
            ],
            [
                5134,
                5161
            ],
            [
                5161,
                5217
            ],
            [
                5217,
                5242
            ],
            [
                5242,
                5258
            ],
            [
                5258,
                5309
            ],
            [
                5309,
                5346
            ],
            [
                5346,
                5403
            ],
            [
                5403,
                5430
            ],
            [
                5430,
                5531
            ],
            [
                5531,
                5621
            ],
            [
                5621,
                5640
            ],
            [
                5640,
                5696
            ],
            [
                5696,
                5810
            ],
            [
                5810,
                5876
            ],
            [
                5876,
                5918
            ],
            [
                5918,
                5931
            ],
            [
                5931,
                5967
            ],
            [
                5967,
                6112
            ],
            [
                6112,
                6153
            ],
            [
                6153,
                6262
            ],
            [
                6262,
                6344
            ],
            [
                6344,
                6407
            ],
            [
                6407,
                6425
            ],
            [
                6425,
                6457
            ],
            [
                6457,
                6527
            ],
            [
                6527,
                6678
            ],
            [
                6678,
                6927
            ],
            [
                6927,
                7109
            ],
            [
                7109,
                7236
            ],
            [
                7236,
                7296
            ],
            [
                7296,
                7449
            ],
            [
                7449,
                7481
            ],
            [
                7481,
                7513
            ],
            [
                7513,
                7566
            ],
            [
                7566,
                7726
            ],
            [
                7726,
                7974
            ],
            [
                7974,
                8166
            ],
            [
                8166,
                8345
            ],
            [
                8345,
                8574
            ],
            [
                8574,
                8763
            ],
            [
                8763,
                8912
            ],
            [
                8912,
                9093
            ],
            [
                9093,
                9410
            ],
            [
                9410,
                9477
            ],
            [
                9477,
                9557
            ],
            [
                9557,
                9750
            ],
            [
                9750,
                9845
            ],
            [
                9845,
                10238
            ],
            [
                10238,
                10273
            ],
            [
                10273,
                10502
            ],
            [
                10502,
                10559
            ],
            [
                10559,
                10793
            ],
            [
                10793,
                11052
            ],
            [
                11052,
                11200
            ],
            [
                11200,
                11275
            ],
            [
                11275,
                11454
            ],
            [
                11454,
                11768
            ],
            [
                11768,
                11835
            ],
            [
                11835,
                12004
            ],
            [
                12004,
                12101
            ],
            [
                12101,
                12579
            ],
            [
                12579,
                12647
            ],
            [
                12647,
                12813
            ],
            [
                12813,
                12885
            ],
            [
                12885,
                13016
            ],
            [
                13016,
                13251
            ],
            [
                13251,
                13784
            ],
            [
                13784,
                13823
            ],
            [
                13823,
                14035
            ],
            [
                14035,
                14370
            ],
            [
                14370,
                14406
            ],
            [
                14406,
                14743
            ],
            [
                14743,
                14975
            ],
            [
                14975,
                15123
            ],
            [
                15123,
                15137
            ],
            [
                15137,
                15226
            ],
            [
                15226,
                15243
            ],
            [
                15243,
                15499
            ],
            [
                15499,
                15723
            ],
            [
                15723,
                15733
            ],
            [
                15733,
                15753
            ],
            [
                15753,
                15806
            ],
            [
                15806,
                15829
            ],
            [
                15829,
                15855
            ],
            [
                15855,
                15864
            ],
            [
                15864,
                15885
            ],
            [
                15885,
                15902
            ],
            [
                15902,
                15977
            ],
            [
                15977,
                16060
            ],
            [
                16060,
                16309
            ],
            [
                16309,
                16343
            ],
            [
                16343,
                16418
            ],
            [
                16418,
                16563
            ],
            [
                16563,
                16598
            ],
            [
                16598,
                16662
            ],
            [
                16662,
                16705
            ],
            [
                16705,
                16861
            ],
            [
                16861,
                16869
            ],
            [
                16869,
                17017
            ],
            [
                17017,
                17067
            ],
            [
                17067,
                17107
            ],
            [
                17107,
                17121
            ],
            [
                17121,
                17201
            ],
            [
                17201,
                17416
            ],
            [
                17416,
                17602
            ],
            [
                17602,
                17629
            ],
            [
                17629,
                17688
            ],
            [
                17688,
                17713
            ],
            [
                17713,
                17753
            ],
            [
                17753,
                17790
            ],
            [
                17790,
                17959
            ],
            [
                17959,
                18207
            ],
            [
                18207,
                18255
            ],
            [
                18255,
                18409
            ],
            [
                18409,
                18449
            ],
            [
                18449,
                18748
            ],
            [
                18748,
                18828
            ],
            [
                18828,
                18907
            ],
            [
                18907,
                19038
            ],
            [
                19038,
                19070
            ],
            [
                19070,
                19087
            ],
            [
                19087,
                19214
            ],
            [
                19214,
                19300
            ],
            [
                19300,
                19445
            ],
            [
                19445,
                19482
            ],
            [
                19482,
                19551
            ],
            [
                19551,
                19613
            ],
            [
                19613,
                19710
            ],
            [
                19710,
                19720
            ],
            [
                19720,
                19744
            ],
            [
                19744,
                19788
            ],
            [
                19788,
                19837
            ],
            [
                19837,
                19864
            ],
            [
                19864,
                19925
            ],
            [
                19925,
                19936
            ],
            [
                19936,
                19956
            ],
            [
                19956,
                19978
            ],
            [
                19978,
                20088
            ],
            [
                20088,
                20165
            ],
            [
                20165,
                20208
            ],
            [
                20208,
                20509
            ],
            [
                20509,
                20616
            ],
            [
                20616,
                20691
            ],
            [
                20691,
                20759
            ],
            [
                20759,
                20826
            ],
            [
                20826,
                20913
            ],
            [
                20913,
                21096
            ],
            [
                21096,
                21176
            ],
            [
                21176,
                21217
            ],
            [
                21217,
                21255
            ],
            [
                21255,
                21299
            ],
            [
                21299,
                21317
            ],
            [
                21317,
                21422
            ],
            [
                21422,
                21462
            ],
            [
                21462,
                21482
            ],
            [
                21482,
                21551
            ],
            [
                21551,
                21595
            ],
            [
                21595,
                21618
            ],
            [
                21618,
                21747
            ],
            [
                21747,
                21778
            ],
            [
                21778,
                21857
            ],
            [
                21857,
                21963
            ],
            [
                21963,
                22119
            ],
            [
                22119,
                22200
            ],
            [
                22200,
                22244
            ],
            [
                22244,
                22323
            ],
            [
                22323,
                22374
            ],
            [
                22374,
                22416
            ],
            [
                22416,
                22567
            ],
            [
                22567,
                22624
            ],
            [
                22624,
                22824
            ],
            [
                22824,
                22847
            ],
            [
                22847,
                22892
            ],
            [
                22892,
                22966
            ],
            [
                22966,
                23054
            ],
            [
                23054,
                23164
            ],
            [
                23164,
                23188
            ],
            [
                23188,
                23242
            ],
            [
                23242,
                23266
            ],
            [
                23266,
                23295
            ],
            [
                23295,
                23364
            ],
            [
                23364,
                23501
            ],
            [
                23501,
                23633
            ],
            [
                23633,
                23668
            ],
            [
                23668,
                23818
            ],
            [
                23818,
                23881
            ],
            [
                23881,
                23938
            ],
            [
                23938,
                23991
            ],
            [
                23991,
                24197
            ],
            [
                24197,
                24292
            ],
            [
                24292,
                24300
            ],
            [
                24300,
                24373
            ],
            [
                24373,
                24504
            ],
            [
                24504,
                24545
            ],
            [
                24545,
                24591
            ],
            [
                24591,
                24676
            ],
            [
                24676,
                24754
            ],
            [
                24754,
                24802
            ],
            [
                24802,
                24843
            ],
            [
                24843,
                25001
            ],
            [
                25001,
                25055
            ],
            [
                25055,
                25213
            ],
            [
                25213,
                25362
            ],
            [
                25362,
                25564
            ],
            [
                25564,
                25765
            ],
            [
                25765,
                26030
            ],
            [
                26030,
                26137
            ],
            [
                26137,
                26280
            ],
            [
                26280,
                26382
            ],
            [
                26382,
                26665
            ],
            [
                26665,
                26690
            ],
            [
                26690,
                26717
            ],
            [
                26717,
                26749
            ],
            [
                26749,
                26798
            ],
            [
                26798,
                26915
            ],
            [
                26915,
                26981
            ],
            [
                26981,
                27053
            ],
            [
                27053,
                27101
            ],
            [
                27101,
                27112
            ],
            [
                27112,
                27164
            ],
            [
                27164,
                27334
            ],
            [
                27334,
                27371
            ],
            [
                27371,
                27493
            ],
            [
                27493,
                27518
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                114,
                237
            ],
            [
                248,
                277
            ],
            [
                284,
                299
            ],
            [
                21,
                23
            ],
            [
                310,
                321
            ],
            [
                331,
                333
            ],
            [
                333,
                461
            ],
            [
                474,
                476
            ],
            [
                476,
                534
            ],
            [
                534,
                564
            ],
            [
                570,
                582
            ],
            [
                583,
                650
            ],
            [
                650,
                687
            ],
            [
                687,
                784
            ],
            [
                794,
                798
            ],
            [
                810,
                826
            ],
            [
                836,
                912
            ],
            [
                912,
                974
            ],
            [
                983,
                1117
            ],
            [
                1117,
                1147
            ],
            [
                1184,
                1204
            ],
            [
                1310,
                1313
            ],
            [
                1251,
                1286
            ],
            [
                1333,
                1335
            ],
            [
                1335,
                1361
            ],
            [
                1361,
                1404
            ],
            [
                1411,
                1416
            ],
            [
                1559,
                1562
            ],
            [
                1439,
                1440
            ],
            [
                1596,
                1630
            ],
            [
                1645,
                1662
            ],
            [
                1663,
                1669
            ],
            [
                1669,
                1752
            ],
            [
                2049,
                2099
            ],
            [
                2105,
                2125
            ],
            [
                2136,
                2174
            ],
            [
                2184,
                2205
            ],
            [
                2216,
                2240
            ],
            [
                2311,
                2312
            ],
            [
                2242,
                2244
            ],
            [
                2257,
                2278
            ],
            [
                2340,
                2342
            ],
            [
                2444,
                2496
            ],
            [
                2508,
                2523
            ],
            [
                2686,
                2688
            ],
            [
                2688,
                2746
            ],
            [
                2754,
                2809
            ],
            [
                2809,
                2877
            ],
            [
                2913,
                2920
            ],
            [
                2909,
                2912
            ],
            [
                2886,
                2889
            ],
            [
                2942,
                2982
            ],
            [
                2899,
                2900
            ],
            [
                2988,
                3031
            ],
            [
                3061,
                3129
            ],
            [
                3130,
                3137
            ],
            [
                3143,
                3149
            ],
            [
                3294,
                3323
            ],
            [
                3331,
                3337
            ],
            [
                3367,
                3383
            ],
            [
                3395,
                3397
            ],
            [
                3397,
                3446
            ],
            [
                3462,
                3464
            ],
            [
                3464,
                3533
            ],
            [
                3533,
                3641
            ],
            [
                3702,
                3705
            ],
            [
                3653,
                3684
            ],
            [
                3706,
                3747
            ],
            [
                3747,
                3799
            ],
            [
                3916,
                3923
            ],
            [
                4086,
                4093
            ],
            [
                4277,
                4315
            ],
            [
                4315,
                4367
            ],
            [
                4367,
                4396
            ],
            [
                4396,
                4470
            ],
            [
                4635,
                4654
            ],
            [
                4679,
                4703
            ],
            [
                4710,
                4721
            ],
            [
                4721,
                4761
            ],
            [
                4761,
                4787
            ],
            [
                4814,
                4816
            ],
            [
                4816,
                4854
            ],
            [
                4857,
                4858
            ],
            [
                4885,
                4899
            ],
            [
                4907,
                4962
            ],
            [
                4962,
                5011
            ],
            [
                5043,
                5045
            ],
            [
                5065,
                5115
            ],
            [
                5115,
                5134
            ],
            [
                5134,
                5148
            ],
            [
                5159,
                5161
            ],
            [
                5161,
                5193
            ],
            [
                5202,
                5206
            ],
            [
                5214,
                5217
            ],
            [
                5217,
                5241
            ],
            [
                5258,
                5307
            ],
            [
                5333,
                5346
            ],
            [
                5346,
                5403
            ],
            [
                5403,
                5430
            ],
            [
                5430,
                5531
            ],
            [
                5531,
                5557
            ],
            [
                5568,
                5586
            ],
            [
                5594,
                5621
            ],
            [
                5621,
                5622
            ],
            [
                5638,
                5640
            ],
            [
                5640,
                5653
            ],
            [
                5654,
                5696
            ],
            [
                5696,
                5810
            ],
            [
                5810,
                5876
            ],
            [
                5876,
                5891
            ],
            [
                5893,
                5918
            ],
            [
                5918,
                5931
            ],
            [
                5931,
                5967
            ],
            [
                5967,
                6007
            ],
            [
                6015,
                6032
            ],
            [
                6045,
                6112
            ],
            [
                6112,
                6153
            ],
            [
                6153,
                6188
            ],
            [
                6196,
                6201
            ],
            [
                6205,
                6243
            ],
            [
                6260,
                6262
            ],
            [
                6262,
                6265
            ],
            [
                6304,
                6327
            ],
            [
                6340,
                6344
            ],
            [
                6344,
                6407
            ],
            [
                6407,
                6425
            ],
            [
                6442,
                6448
            ],
            [
                6425,
                6440
            ],
            [
                6455,
                6457
            ],
            [
                6457,
                6460
            ],
            [
                6527,
                6535
            ],
            [
                6551,
                6581
            ],
            [
                6525,
                6526
            ],
            [
                6583,
                6614
            ],
            [
                6620,
                6648
            ],
            [
                6581,
                6582
            ],
            [
                6657,
                6671
            ],
            [
                6676,
                6678
            ],
            [
                6690,
                6693
            ],
            [
                6883,
                6884
            ],
            [
                6695,
                6709
            ],
            [
                6717,
                6785
            ],
            [
                6715,
                6717
            ],
            [
                6792,
                6824
            ],
            [
                6834,
                6848
            ],
            [
                6854,
                6880
            ],
            [
                6903,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                7003,
                7043
            ],
            [
                7056,
                7057
            ],
            [
                7048,
                7052
            ],
            [
                7068,
                7109
            ],
            [
                7109,
                7153
            ],
            [
                7183,
                7191
            ],
            [
                7203,
                7236
            ],
            [
                7236,
                7296
            ],
            [
                7296,
                7449
            ],
            [
                7449,
                7481
            ],
            [
                7481,
                7513
            ],
            [
                7513,
                7566
            ],
            [
                7566,
                7584
            ],
            [
                7586,
                7664
            ],
            [
                7689,
                7693
            ],
            [
                7700,
                7726
            ],
            [
                7726,
                7732
            ],
            [
                7742,
                7743
            ],
            [
                7733,
                7742
            ],
            [
                7761,
                7787
            ],
            [
                7923,
                7935
            ],
            [
                7858,
                7860
            ],
            [
                7951,
                7959
            ],
            [
                7972,
                7974
            ],
            [
                7974,
                8049
            ],
            [
                8065,
                8078
            ],
            [
                8085,
                8166
            ],
            [
                8345,
                8394
            ],
            [
                8463,
                8474
            ],
            [
                8487,
                8574
            ],
            [
                8574,
                8577
            ],
            [
                8578,
                8581
            ],
            [
                8633,
                8655
            ],
            [
                8744,
                8750
            ],
            [
                8656,
                8663
            ],
            [
                8673,
                8716
            ],
            [
                8761,
                8762
            ],
            [
                8763,
                8786
            ],
            [
                8792,
                8827
            ],
            [
                8855,
                8885
            ],
            [
                8909,
                8912
            ],
            [
                8989,
                8991
            ],
            [
                8916,
                8922
            ],
            [
                8981,
                8983
            ],
            [
                9005,
                9016
            ],
            [
                9022,
                9027
            ],
            [
                9039,
                9046
            ],
            [
                9058,
                9070
            ],
            [
                9078,
                9093
            ],
            [
                9093,
                9349
            ],
            [
                9408,
                9409
            ],
            [
                9410,
                9477
            ],
            [
                9477,
                9517
            ],
            [
                9526,
                9557
            ],
            [
                9557,
                9560
            ],
            [
                9575,
                9588
            ],
            [
                9655,
                9658
            ],
            [
                9607,
                9624
            ],
            [
                9667,
                9681
            ],
            [
                9748,
                9750
            ],
            [
                9845,
                9850
            ],
            [
                9980,
                10067
            ],
            [
                9850,
                9851
            ],
            [
                9863,
                9878
            ],
            [
                10147,
                10157
            ],
            [
                9887,
                9889
            ],
            [
                10067,
                10072
            ],
            [
                10124,
                10146
            ],
            [
                10165,
                10237
            ],
            [
                10577,
                10594
            ],
            [
                10600,
                10622
            ],
            [
                10642,
                10793
            ],
            [
                10793,
                10813
            ],
            [
                10975,
                11052
            ],
            [
                11052,
                11088
            ],
            [
                11116,
                11120
            ],
            [
                11089,
                11094
            ],
            [
                11134,
                11187
            ],
            [
                11198,
                11200
            ],
            [
                11200,
                11275
            ],
            [
                11835,
                11953
            ],
            [
                11969,
                12004
            ],
            [
                12004,
                12025
            ],
            [
                12054,
                12101
            ],
            [
                12142,
                12155
            ],
            [
                12111,
                12129
            ],
            [
                12136,
                12137
            ],
            [
                12157,
                12160
            ],
            [
                12161,
                12204
            ],
            [
                12277,
                12280
            ],
            [
                12227,
                12244
            ],
            [
                12206,
                12209
            ],
            [
                12284,
                12290
            ],
            [
                12312,
                12314
            ],
            [
                12246,
                12255
            ],
            [
                12346,
                12356
            ],
            [
                12271,
                12275
            ],
            [
                12356,
                12435
            ],
            [
                12442,
                12456
            ],
            [
                12466,
                12578
            ],
            [
                12579,
                12647
            ],
            [
                12647,
                12672
            ],
            [
                12720,
                12813
            ],
            [
                12813,
                12885
            ],
            [
                12885,
                12943
            ],
            [
                12958,
                12964
            ],
            [
                12944,
                12949
            ],
            [
                12971,
                13016
            ],
            [
                13056,
                13088
            ],
            [
                13093,
                13109
            ],
            [
                13174,
                13193
            ],
            [
                13110,
                13112
            ],
            [
                13158,
                13173
            ],
            [
                13201,
                13222
            ],
            [
                13016,
                13018
            ],
            [
                13249,
                13251
            ],
            [
                13290,
                13298
            ],
            [
                13310,
                13355
            ],
            [
                13369,
                13397
            ],
            [
                13415,
                13459
            ],
            [
                13491,
                13512
            ],
            [
                13514,
                13594
            ],
            [
                13782,
                13784
            ],
            [
                13823,
                13825
            ],
            [
                13836,
                13854
            ],
            [
                13862,
                13964
            ],
            [
                13965,
                13986
            ],
            [
                13992,
                14034
            ],
            [
                14046,
                14048
            ],
            [
                14062,
                14176
            ],
            [
                14058,
                14061
            ],
            [
                14210,
                14247
            ],
            [
                14194,
                14208
            ],
            [
                14259,
                14370
            ],
            [
                14377,
                14383
            ],
            [
                14389,
                14406
            ],
            [
                14406,
                14503
            ],
            [
                14516,
                14550
            ],
            [
                14574,
                14580
            ],
            [
                14551,
                14555
            ],
            [
                14615,
                14621
            ],
            [
                14649,
                14652
            ],
            [
                14626,
                14645
            ],
            [
                14653,
                14667
            ],
            [
                14669,
                14673
            ],
            [
                14717,
                14743
            ],
            [
                14743,
                14762
            ],
            [
                14763,
                14784
            ],
            [
                14840,
                14883
            ],
            [
                14978,
                15023
            ],
            [
                14807,
                14811
            ],
            [
                15092,
                15122
            ],
            [
                15137,
                15161
            ],
            [
                15161,
                15162
            ],
            [
                15197,
                15226
            ],
            [
                15243,
                15287
            ],
            [
                15307,
                15338
            ],
            [
                15350,
                15356
            ],
            [
                15384,
                15386
            ],
            [
                15376,
                15383
            ],
            [
                15432,
                15499
            ],
            [
                15499,
                15503
            ],
            [
                15600,
                15684
            ],
            [
                15695,
                15723
            ],
            [
                15723,
                15733
            ],
            [
                15733,
                15753
            ],
            [
                15753,
                15783
            ],
            [
                15806,
                15829
            ],
            [
                15829,
                15855
            ],
            [
                15855,
                15863
            ],
            [
                15885,
                15902
            ],
            [
                15938,
                15977
            ],
            [
                15977,
                15980
            ],
            [
                15990,
                16029
            ],
            [
                16034,
                16060
            ],
            [
                16193,
                16208
            ],
            [
                16076,
                16100
            ],
            [
                16236,
                16253
            ],
            [
                16259,
                16309
            ],
            [
                16309,
                16327
            ],
            [
                16340,
                16343
            ],
            [
                16343,
                16407
            ],
            [
                16416,
                16417
            ],
            [
                16418,
                16481
            ],
            [
                16508,
                16519
            ],
            [
                16492,
                16495
            ],
            [
                16482,
                16491
            ],
            [
                16520,
                16561
            ],
            [
                16568,
                16585
            ],
            [
                16586,
                16598
            ],
            [
                16598,
                16647
            ],
            [
                16650,
                16662
            ],
            [
                16662,
                16704
            ],
            [
                16861,
                16869
            ],
            [
                16874,
                16885
            ],
            [
                16952,
                16971
            ],
            [
                16976,
                17017
            ],
            [
                17017,
                17049
            ],
            [
                17058,
                17065
            ],
            [
                17050,
                17057
            ],
            [
                17065,
                17067
            ],
            [
                17067,
                17090
            ],
            [
                17092,
                17107
            ],
            [
                17107,
                17121
            ],
            [
                17121,
                17125
            ],
            [
                17126,
                17130
            ],
            [
                17139,
                17151
            ],
            [
                17162,
                17201
            ],
            [
                17252,
                17272
            ],
            [
                17317,
                17323
            ],
            [
                17278,
                17285
            ],
            [
                17297,
                17306
            ],
            [
                17324,
                17327
            ],
            [
                17416,
                17420
            ],
            [
                17424,
                17444
            ],
            [
                17466,
                17482
            ],
            [
                17348,
                17351
            ],
            [
                17483,
                17570
            ],
            [
                17571,
                17602
            ],
            [
                17629,
                17688
            ],
            [
                17688,
                17713
            ],
            [
                17713,
                17730
            ],
            [
                17732,
                17753
            ],
            [
                17753,
                17767
            ],
            [
                17790,
                17862
            ],
            [
                17875,
                17911
            ],
            [
                17930,
                17931
            ],
            [
                17913,
                17930
            ],
            [
                17957,
                17959
            ],
            [
                17970,
                17973
            ],
            [
                17980,
                17986
            ],
            [
                18187,
                18205
            ],
            [
                18129,
                18131
            ],
            [
                18146,
                18162
            ],
            [
                18205,
                18207
            ],
            [
                18207,
                18255
            ],
            [
                18255,
                18302
            ],
            [
                18325,
                18331
            ],
            [
                18367,
                18378
            ],
            [
                18409,
                18413
            ],
            [
                18430,
                18449
            ],
            [
                18464,
                18475
            ],
            [
                18482,
                18511
            ],
            [
                18524,
                18542
            ],
            [
                18568,
                18696
            ],
            [
                18710,
                18715
            ],
            [
                18721,
                18748
            ],
            [
                18748,
                18767
            ],
            [
                18786,
                18828
            ],
            [
                18828,
                18836
            ],
            [
                18877,
                18880
            ],
            [
                18837,
                18876
            ],
            [
                18886,
                18907
            ],
            [
                19070,
                19087
            ],
            [
                19087,
                19097
            ],
            [
                19109,
                19114
            ],
            [
                19128,
                19173
            ],
            [
                19212,
                19214
            ],
            [
                19218,
                19223
            ],
            [
                19252,
                19260
            ],
            [
                19271,
                19285
            ],
            [
                19298,
                19300
            ],
            [
                19353,
                19385
            ],
            [
                19386,
                19403
            ],
            [
                19443,
                19445
            ],
            [
                19445,
                19482
            ],
            [
                19482,
                19551
            ],
            [
                19551,
                19613
            ],
            [
                19613,
                19678
            ],
            [
                19694,
                19710
            ],
            [
                19710,
                19720
            ],
            [
                19720,
                19744
            ],
            [
                20208,
                20235
            ],
            [
                20255,
                20258
            ],
            [
                20264,
                20289
            ],
            [
                20507,
                20509
            ],
            [
                20509,
                20510
            ],
            [
                20556,
                20565
            ],
            [
                20510,
                20556
            ],
            [
                20614,
                20616
            ],
            [
                20616,
                20619
            ],
            [
                20623,
                20691
            ],
            [
                20691,
                20707
            ],
            [
                20715,
                20759
            ],
            [
                20759,
                20825
            ],
            [
                20913,
                20967
            ],
            [
                21008,
                21009
            ],
            [
                21029,
                21044
            ],
            [
                21046,
                21048
            ],
            [
                21050,
                21096
            ],
            [
                21096,
                21146
            ],
            [
                21148,
                21176
            ],
            [
                21176,
                21194
            ],
            [
                21197,
                21217
            ],
            [
                21217,
                21255
            ],
            [
                21299,
                21315
            ],
            [
                21360,
                21383
            ],
            [
                21387,
                21406
            ],
            [
                21462,
                21482
            ],
            [
                21482,
                21549
            ],
            [
                21595,
                21618
            ],
            [
                21626,
                21627
            ],
            [
                21628,
                21704
            ],
            [
                21733,
                21747
            ],
            [
                21747,
                21778
            ],
            [
                22200,
                22232
            ],
            [
                22237,
                22242
            ],
            [
                22254,
                22323
            ],
            [
                22323,
                22334
            ],
            [
                22364,
                22374
            ],
            [
                22374,
                22416
            ],
            [
                22416,
                22496
            ],
            [
                22534,
                22542
            ],
            [
                22548,
                22563
            ],
            [
                22567,
                22584
            ],
            [
                22590,
                22624
            ],
            [
                22624,
                22705
            ],
            [
                22712,
                22731
            ],
            [
                22738,
                22824
            ],
            [
                22824,
                22847
            ],
            [
                22966,
                23012
            ],
            [
                23022,
                23054
            ],
            [
                23054,
                23164
            ],
            [
                23188,
                23211
            ],
            [
                23213,
                23242
            ],
            [
                23242,
                23246
            ],
            [
                23249,
                23266
            ],
            [
                23266,
                23295
            ],
            [
                23364,
                23391
            ],
            [
                23392,
                23397
            ],
            [
                23428,
                23433
            ],
            [
                23439,
                23461
            ],
            [
                23471,
                23475
            ],
            [
                23478,
                23481
            ],
            [
                23482,
                23501
            ],
            [
                23501,
                23545
            ],
            [
                23568,
                23633
            ],
            [
                23633,
                23668
            ],
            [
                23668,
                23787
            ],
            [
                23815,
                23818
            ],
            [
                23818,
                23846
            ],
            [
                23879,
                23881
            ],
            [
                23882,
                23938
            ],
            [
                23938,
                23991
            ],
            [
                23991,
                24092
            ],
            [
                24103,
                24104
            ],
            [
                24116,
                24124
            ],
            [
                24153,
                24197
            ],
            [
                24292,
                24300
            ],
            [
                24300,
                24373
            ],
            [
                24373,
                24440
            ],
            [
                24460,
                24465
            ],
            [
                24474,
                24504
            ],
            [
                24693,
                24754
            ],
            [
                24754,
                24802
            ],
            [
                24802,
                24820
            ],
            [
                24822,
                24843
            ],
            [
                24856,
                24911
            ],
            [
                24929,
                24937
            ],
            [
                24947,
                24956
            ],
            [
                24999,
                25001
            ],
            [
                25001,
                25055
            ],
            [
                25055,
                25095
            ],
            [
                25181,
                25187
            ],
            [
                25117,
                25149
            ],
            [
                25211,
                25213
            ],
            [
                25213,
                25362
            ],
            [
                25362,
                25464
            ],
            [
                25470,
                25475
            ],
            [
                25562,
                25564
            ],
            [
                25567,
                25583
            ],
            [
                25585,
                25646
            ],
            [
                25763,
                25765
            ],
            [
                25765,
                25771
            ],
            [
                25781,
                25907
            ],
            [
                25911,
                25925
            ],
            [
                25946,
                25978
            ],
            [
                25998,
                26003
            ],
            [
                26010,
                26030
            ],
            [
                26030,
                26051
            ],
            [
                26057,
                26078
            ],
            [
                26114,
                26137
            ],
            [
                26137,
                26174
            ],
            [
                26180,
                26215
            ],
            [
                26278,
                26279
            ],
            [
                26386,
                26466
            ],
            [
                26468,
                26479
            ],
            [
                26607,
                26645
            ],
            [
                26646,
                26650
            ],
            [
                26663,
                26665
            ],
            [
                26665,
                26682
            ],
            [
                26688,
                26690
            ],
            [
                26690,
                26717
            ],
            [
                26717,
                26749
            ],
            [
                26749,
                26798
            ],
            [
                26798,
                26804
            ],
            [
                26813,
                26820
            ],
            [
                26805,
                26812
            ],
            [
                26835,
                26862
            ],
            [
                26863,
                26887
            ],
            [
                26906,
                26915
            ],
            [
                26915,
                26919
            ],
            [
                26925,
                26981
            ],
            [
                26981,
                27006
            ],
            [
                27022,
                27053
            ],
            [
                27053,
                27101
            ],
            [
                27101,
                27112
            ],
            [
                27112,
                27164
            ],
            [
                27164,
                27255
            ],
            [
                27257,
                27259
            ],
            [
                27264,
                27334
            ],
            [
                27334,
                27339
            ],
            [
                27358,
                27371
            ],
            [
                27371,
                27413
            ],
            [
                27422,
                27425
            ],
            [
                27435,
                27465
            ],
            [
                27472,
                27493
            ],
            [
                27493,
                27518
            ]
        ],
        "row_chars": [
            [
                0,
                333
            ],
            [
                333,
                476
            ],
            [
                476,
                534
            ],
            [
                534,
                583
            ],
            [
                583,
                650
            ],
            [
                650,
                687
            ],
            [
                687,
                912
            ],
            [
                912,
                1117
            ],
            [
                1117,
                1335
            ],
            [
                1335,
                1361
            ],
            [
                1361,
                1669
            ],
            [
                1669,
                1753
            ],
            [
                1753,
                1812
            ],
            [
                1812,
                2049
            ],
            [
                2049,
                2688
            ],
            [
                2688,
                2809
            ],
            [
                2809,
                3130
            ],
            [
                3130,
                3397
            ],
            [
                3397,
                3464
            ],
            [
                3464,
                3533
            ],
            [
                3533,
                3641
            ],
            [
                3641,
                3747
            ],
            [
                3747,
                4315
            ],
            [
                4315,
                4367
            ],
            [
                4367,
                4396
            ],
            [
                4396,
                4470
            ],
            [
                4470,
                4624
            ],
            [
                4624,
                4721
            ],
            [
                4721,
                4761
            ],
            [
                4761,
                4816
            ],
            [
                4816,
                4962
            ],
            [
                4962,
                5045
            ],
            [
                5045,
                5065
            ],
            [
                5065,
                5115
            ],
            [
                5115,
                5134
            ],
            [
                5134,
                5161
            ],
            [
                5161,
                5217
            ],
            [
                5217,
                5242
            ],
            [
                5242,
                5258
            ],
            [
                5258,
                5309
            ],
            [
                5309,
                5346
            ],
            [
                5346,
                5403
            ],
            [
                5403,
                5430
            ],
            [
                5430,
                5531
            ],
            [
                5531,
                5621
            ],
            [
                5621,
                5640
            ],
            [
                5640,
                5696
            ],
            [
                5696,
                5810
            ],
            [
                5810,
                5876
            ],
            [
                5876,
                5918
            ],
            [
                5918,
                5931
            ],
            [
                5931,
                5967
            ],
            [
                5967,
                6112
            ],
            [
                6112,
                6153
            ],
            [
                6153,
                6262
            ],
            [
                6262,
                6344
            ],
            [
                6344,
                6407
            ],
            [
                6407,
                6425
            ],
            [
                6425,
                6457
            ],
            [
                6457,
                6678
            ],
            [
                6678,
                6927
            ],
            [
                6927,
                7109
            ],
            [
                7109,
                7236
            ],
            [
                7236,
                7296
            ],
            [
                7296,
                7449
            ],
            [
                7449,
                7481
            ],
            [
                7481,
                7513
            ],
            [
                7513,
                7566
            ],
            [
                7566,
                7726
            ],
            [
                7726,
                7974
            ],
            [
                7974,
                8166
            ],
            [
                8166,
                8345
            ],
            [
                8345,
                8574
            ],
            [
                8574,
                8763
            ],
            [
                8763,
                8912
            ],
            [
                8912,
                9093
            ],
            [
                9093,
                9410
            ],
            [
                9410,
                9477
            ],
            [
                9477,
                9557
            ],
            [
                9557,
                9750
            ],
            [
                9750,
                9845
            ],
            [
                9845,
                10238
            ],
            [
                10238,
                10273
            ],
            [
                10273,
                10502
            ],
            [
                10502,
                10559
            ],
            [
                10559,
                10793
            ],
            [
                10793,
                11052
            ],
            [
                11052,
                11200
            ],
            [
                11200,
                11275
            ],
            [
                11275,
                11454
            ],
            [
                11454,
                11768
            ],
            [
                11768,
                11835
            ],
            [
                11835,
                12004
            ],
            [
                12004,
                12101
            ],
            [
                12101,
                12579
            ],
            [
                12579,
                12647
            ],
            [
                12647,
                12813
            ],
            [
                12813,
                12885
            ],
            [
                12885,
                13016
            ],
            [
                13016,
                13251
            ],
            [
                13251,
                13784
            ],
            [
                13784,
                13823
            ],
            [
                13823,
                14035
            ],
            [
                14035,
                14370
            ],
            [
                14370,
                14406
            ],
            [
                14406,
                14743
            ],
            [
                14743,
                15137
            ],
            [
                15137,
                15226
            ],
            [
                15226,
                15243
            ],
            [
                15243,
                15499
            ],
            [
                15499,
                15723
            ],
            [
                15723,
                15733
            ],
            [
                15733,
                15753
            ],
            [
                15753,
                15806
            ],
            [
                15806,
                15829
            ],
            [
                15829,
                15855
            ],
            [
                15855,
                15864
            ],
            [
                15864,
                15885
            ],
            [
                15885,
                15902
            ],
            [
                15902,
                15977
            ],
            [
                15977,
                16060
            ],
            [
                16060,
                16309
            ],
            [
                16309,
                16343
            ],
            [
                16343,
                16418
            ],
            [
                16418,
                16598
            ],
            [
                16598,
                16662
            ],
            [
                16662,
                16705
            ],
            [
                16705,
                16861
            ],
            [
                16861,
                16869
            ],
            [
                16869,
                17017
            ],
            [
                17017,
                17067
            ],
            [
                17067,
                17107
            ],
            [
                17107,
                17121
            ],
            [
                17121,
                17201
            ],
            [
                17201,
                17602
            ],
            [
                17602,
                17629
            ],
            [
                17629,
                17688
            ],
            [
                17688,
                17713
            ],
            [
                17713,
                17753
            ],
            [
                17753,
                17790
            ],
            [
                17790,
                17959
            ],
            [
                17959,
                18207
            ],
            [
                18207,
                18255
            ],
            [
                18255,
                18449
            ],
            [
                18449,
                18748
            ],
            [
                18748,
                18828
            ],
            [
                18828,
                18907
            ],
            [
                18907,
                19038
            ],
            [
                19038,
                19070
            ],
            [
                19070,
                19087
            ],
            [
                19087,
                19214
            ],
            [
                19214,
                19300
            ],
            [
                19300,
                19445
            ],
            [
                19445,
                19482
            ],
            [
                19482,
                19551
            ],
            [
                19551,
                19613
            ],
            [
                19613,
                19710
            ],
            [
                19710,
                19720
            ],
            [
                19720,
                19744
            ],
            [
                19744,
                19788
            ],
            [
                19788,
                19837
            ],
            [
                19837,
                19864
            ],
            [
                19864,
                19925
            ],
            [
                19925,
                19936
            ],
            [
                19936,
                19956
            ],
            [
                19956,
                19978
            ],
            [
                19978,
                20088
            ],
            [
                20088,
                20165
            ],
            [
                20165,
                20208
            ],
            [
                20208,
                20509
            ],
            [
                20509,
                20616
            ],
            [
                20616,
                20691
            ],
            [
                20691,
                20759
            ],
            [
                20759,
                20826
            ],
            [
                20826,
                20913
            ],
            [
                20913,
                21096
            ],
            [
                21096,
                21176
            ],
            [
                21176,
                21217
            ],
            [
                21217,
                21255
            ],
            [
                21255,
                21299
            ],
            [
                21299,
                21422
            ],
            [
                21422,
                21462
            ],
            [
                21462,
                21482
            ],
            [
                21482,
                21551
            ],
            [
                21551,
                21595
            ],
            [
                21595,
                21618
            ],
            [
                21618,
                21747
            ],
            [
                21747,
                21778
            ],
            [
                21778,
                21857
            ],
            [
                21857,
                21963
            ],
            [
                21963,
                22119
            ],
            [
                22119,
                22200
            ],
            [
                22200,
                22323
            ],
            [
                22323,
                22374
            ],
            [
                22374,
                22416
            ],
            [
                22416,
                22567
            ],
            [
                22567,
                22624
            ],
            [
                22624,
                22824
            ],
            [
                22824,
                22847
            ],
            [
                22847,
                22892
            ],
            [
                22892,
                22966
            ],
            [
                22966,
                23054
            ],
            [
                23054,
                23164
            ],
            [
                23164,
                23188
            ],
            [
                23188,
                23242
            ],
            [
                23242,
                23266
            ],
            [
                23266,
                23295
            ],
            [
                23295,
                23364
            ],
            [
                23364,
                23501
            ],
            [
                23501,
                23633
            ],
            [
                23633,
                23668
            ],
            [
                23668,
                23818
            ],
            [
                23818,
                23881
            ],
            [
                23881,
                23938
            ],
            [
                23938,
                23991
            ],
            [
                23991,
                24197
            ],
            [
                24197,
                24292
            ],
            [
                24292,
                24300
            ],
            [
                24300,
                24373
            ],
            [
                24373,
                24504
            ],
            [
                24504,
                24545
            ],
            [
                24545,
                24591
            ],
            [
                24591,
                24676
            ],
            [
                24676,
                24754
            ],
            [
                24754,
                24802
            ],
            [
                24802,
                24843
            ],
            [
                24843,
                25001
            ],
            [
                25001,
                25055
            ],
            [
                25055,
                25213
            ],
            [
                25213,
                25362
            ],
            [
                25362,
                25564
            ],
            [
                25564,
                25765
            ],
            [
                25765,
                26030
            ],
            [
                26030,
                26137
            ],
            [
                26137,
                26280
            ],
            [
                26280,
                26382
            ],
            [
                26382,
                26665
            ],
            [
                26665,
                26690
            ],
            [
                26690,
                26717
            ],
            [
                26717,
                26749
            ],
            [
                26749,
                26798
            ],
            [
                26798,
                26915
            ],
            [
                26915,
                26981
            ],
            [
                26981,
                27053
            ],
            [
                27053,
                27101
            ],
            [
                27101,
                27112
            ],
            [
                27112,
                27164
            ],
            [
                27164,
                27334
            ],
            [
                27334,
                27371
            ],
            [
                27371,
                27493
            ],
            [
                27493,
                27518
            ]
        ]
    },
    "abridged": {
        "text": "I fear that so many notes followed Lieutenant Osborne about the country, that he became almost ashamed of the jokes of his mess-room companions about them, and ordered his servant to deliver them to his private room. He was seen lighting his cigar with one, to the horror of Captain Dobbin, who, it is my belief, would have given a bank-note for it.\nFor some time George strove to keep the liaison a secret. There was a woman in the case, he admitted.\n\"And not the first either,\" said Ensign Spooney to Ensign Stubble. \"That Osborne's a devil of a fellow. There was a judge's daughter at Demerara went almost mad about him; then there was that beautiful girl at St. Vincent's; and since he's been home, they say he's a regular Don Giovanni, by Jove.\"\nStubble and Spooney thought that to be a \"regular Don Giovanni\" was one of the finest qualities a man could possess, and Osborne's reputation was prodigious amongst the young men of the regiment. He was famous in field-sports, free with his money, and his coats were better made than any. He was adored by the men. He could drink more than any officer of the mess, and box, and was the best batter and bowler of the regimental cricket club. He rode his own horse, Greased Lightning, and won the Garrison cup at Quebec races.\nWell, Stubble and Spooney and the rest indulged in romantic conjectures about this female correspondent of Osborne's - saying that it was a Duchess who was in love with him, or a General's daughter, or some other victim of a passion delightfully exciting and disgraceful.\nAnd the real state of the case would never have been known in the regiment but for Captain Dobbin's indiscretion. The Captain was eating his breakfast one day in the mess-room, while the two ensigns and the surgeon were speculating upon Osborne's intrigue - Stubble holding out that the lady was a Duchess, and Cackle vowing she was an opera-singer of the worst reputation.\nAt this Dobbin couldn't help blurting out, \"You're talking nonsense. Osborne is not going to run off with a duchess or an opera-singer. Miss Sedley is one of the most charming young women that ever lived. He's been engaged to her ever so long; and the man who calls her names had better not do so in my hearing.\" And turning exceedingly red, Dobbin almost choked himself with a cup of tea. The story was over the regiment in half-an-hour; and Osborne was furious with Dobbin for betraying his secret.\n\"Who the deuce asked you to talk about my affairs?\" Osborne shouted indignantly. \"Why the devil is all the regiment to know that I am going to be married? What right have you to meddle in my business, Dobbin?\"\n\"It seems to me,\" Captain Dobbin began.\n\"Seems be hanged, Dobbin,\" said George. \"I am under obligations to you, I know, but I won't be sermonised by you because you're five years my senior. I'm hanged if I'll stand your airs of superiority. I should like to know in what I'm your inferior?\"\n\"Are you engaged?\" Captain Dobbin asked.\n\"What the devil's that to you or anyone here?\"\n\"Are you ashamed of it?\"\n\"What right have you to ask me that question, sir?\" George said.\n\"Good God, you don't mean to say you want to break off?\" asked Dobbin, starting up.\n\"In other words, you ask me if I'm a man of honour,\" said Osborne, fiercely; \"is that what you mean? You've adopted such a tone to me lately that I'm d____ if I'll bear it any more.\"\n\"Why? I've told you that you were neglecting a sweet girl, George. I've told you that when you go to town you ought to go to her, and not to the gambling-houses about St. James's.\"\n\"You want your money back, I suppose,\" said George, with a sneer.\n\"Of course I do - I always did, didn't I?\" says Dobbin. \"You speak like a generous fellow.\"\n\"No, hang it, William, I beg your pardon,\" George interposed with remorse; \"you have been my friend in a hundred ways, Heaven knows. You've got me out of a score of scrapes. When Crawley of the Guards won that money off me I should have been done but for you. But you shouldn't be always preaching at me. I am very fond of Amelia; I adore her, and that sort of thing. Don't look angry. I know she's faultless. But hang it: we're just back from the West Indies. I must have a little fling, and when I'm married I'll reform, upon my honour. Dob - don't be angry, and I'll give you a hundred next month, when I know my father will pay me something handsome; and I'll ask for leave, and go to town, and see Amelia tomorrow. Will that satisfy you?\"\n\"It is impossible to be long angry with you, George,\" said the Captain; \"and as for the money, old boy, I know you'd share your last shilling with me.\"\n\"That I would, by Jove, Dobbin,\" George said generously, though he never had any money to spare.\n\"Only I wish you had sown those wild oats of yours, George. If you could have seen poor little Miss Emmy's face when she asked me about you the other day, you would have pitched those billiard-balls to the deuce. Go and comfort her, you rascal. Go and write her a long letter. Do something to make her happy; a very little will.\"\n\"I believe she's d___d fond of me,\" the Lieutenant said, with a self-satisfied air; and went off to join some fellows in the mess-room.\nAmelia, meanwhile, was looking at the moon, and thinking of her hero. Perhaps he is visiting the sentries, thought she; perhaps he is bivouacking, or attending the bed of a wounded comrade, or studying the art of war up in his own desolate chamber. All things considered, I think it was as well the poor little angel could not hear the songs those young fellows were roaring over the whisky-punch.\nThe next day young Osborne, to show Dobbin that he was as good as his word, prepared to go to town.\n\"I should have liked to give her a little present,\" Osborne said, \"only I am quite out of cash.\" So Dobbin loaned Mr. Osborne a few pounds, which he took after a faint scruple.\nAnd I dare say he would have bought something very handsome for Amelia; only, getting off the coach in Fleet Street, he was attracted by a handsome shirt-pin in a jeweller's window, which he could not resist; and having paid for that, had very little money left.\nNever mind: you may be sure it was not his presents Amelia wanted. When he came to Russell Square, her face lit up as if he had been sunshine. The fears, tears, and sleepless fancies were forgotten. Sambo saw the little girl start, and flush, and jump up from her watching-place in the window, as he announced Lieutenant Osborne; and she went fluttering to Osborne's heart as if it was the only natural home for her to nestle in.\nGeorge kissed her kindly on her forehead, and was very gracious and good; and she thought his diamond shirt-pin (which she had not known him to wear before) the prettiest ornament ever seen.\nThe observant reader may possibly come to certain conclusions regarding the character of Mr. Osborne. Some cynical Frenchman has said that in matters of love, there is the one who loves and the other who condescends to be loved. Perhaps the love is occasionally on the man's side; perhaps on the lady's. But this is certain, that Amelia believed her lover to be one of the most gallant and brilliant men in the empire: and Lieutenant Osborne thought so too.\nHe was a little wild: but don't girls like a rake better than a milksop? He would soon have sown his wild oats, and would quit the army now that peace was proclaimed, and Napoleon locked up at Elba, The chance of promotion and valour was over: and his allowance, with Amelia's settlement, would enable them to take a snug house in the country, in a good sporting neighbourhood; and he would hunt a little, and farm a little; and they would be very happy.\nAs for remaining in the army as a married man, that was impossible. Fancy Mrs. George Osborne in the East or West Indies, with a society of officers, and patronized by Mrs. Major O'Dowd! Amelia died with laughing at Osborne's stories about Mrs. Major O'Dowd. He loved her much too fondly to subject her to that horrid vulgar woman and the rough treatment of a soldier's wife. His dear little girl should take her rightful place in society. You may be sure she agreed to all these proposals, as she would to any that he made.\nThus building castles in the air (which Amelia adorned with flower-gardens, rustic walks, Sunday schools, and the like; while George imagined the stables, the kennels, and the cellar), this young pair passed away a couple of hours very pleasantly. When he took her to his sisters while he attended to business, he left her talking and prattling in a way that astonished those ladies, who thought that George might after all make something of her.\nHe then went off to transact his business. He ate ices at a pastry-cook's shop in Charing Cross; tried a new coat in Pall Mall; dropped in at the Old Slaughters' and played eleven games at billiards with Captain Cannon, of which he won eight, and returned to Russell Square half an hour late for dinner, but in very good humour.\nNot so old Mr. Osborne. When that gentleman came from the City, and was welcomed in the drawing-room by his daughters and Miss Wirt, they saw at once by his solemn face and by his scowl and twitching black eyebrows that he was disturbed and uneasy. When Amelia stepped timidly forward to salute him, he gave a surly grunt of recognition, and looked round gloomily at his eldest daughter; with a glance that meant, \"Why the devil is she here?\"\n\"George is in town, Papa,\" said Miss Osborne; \"and will be back to dinner.\"\n\"I won't have the dinner kept waiting for him.\" This worthy man lapsed into his chair, in a silence only interrupted by the alarmed ticking of the great French clock.\nWhen it tolled five in a heavy cathedral tone, Mr. Osborne pulled the bell at his right hand violently, and the butler rushed up.\n\"Dinner!\" roared Mr. Osborne.\n\"Mr. George isn't come in, sir.\"\n\"Damn Mr. George, sir. Am I master of the house? DINNER!\"\nAmelia trembled. Glances passed between the other three ladies. The bell in the lower regions began ringing in announcement of the meal. Without waiting, the head of the family strode downstairs, scowling over his shoulder at the four females.\n\"What's the matter?\" asked one of the other, as they rose and tripped gingerly behind him.\n\"I suppose the funds are falling,\" whispered Miss Wirt; and so, this hushed and trembling female company followed their dark leader and took their places at the table in silence. He growled out a blessing, which sounded as gruff as a curse. The great silver dish-covers were removed.\n\"Soup?\" said Mr. Osborne; and having helped Amelia and the rest, did not speak for a while.\n\"Take Miss Sedley's plate away,\" he said at last. \"She can't eat the soup - no more can I. It's beastly. Take it away, Hicks, and tomorrow turn the cook out of the house, Jane.\"\nMr. Osborne made a few savage remarks about the fish, and then lapsed into silence, swallowing glasses of wine, and looking more and more terrible, till a brisk knock at the door told of George's arrival; when everybody began to rally.\nGeneral Daguilet had kept him waiting at the Horse Guards. Never mind soup or fish. Give him anything - he didn't care what. Capital mutton. His good humour contrasted with his father's severity; and he rattled on during dinner, to the delight of all, and of one especially.\nEventually the ladies arose and departed to the drawing-room. Amelia hoped George would soon join them there. She began playing some of his favourite waltzes at the grand piano; but this did not bring him. The waltzes grew fainter and fainter; the performer left the piano; and though her three friends performed some of the loudest and most brilliant new pieces of their repertoire, she did not hear, but sat thinking, and boding evil. Old Osborne's scowl had never before looked so deadly to her. His eyes had followed her out of the room, as if she was guilty of something. Oh, those women! They nurse their forebodings, and make darlings of their ugliest thoughts.\nHis father's gloom had also made George Osborne anxious. How was he to extract that money he needed from the governor? He began praising his father's wine. That was generally a successful means of cajoling the old gentleman.\n\"We never got such Madeira in the West Indies, sir, as yours. Colonel Heavytop took off three bottles of that you sent me down, the other day.\"\n\"Did he?\" said the old gentleman. \"It is devilish fine wine,\" and he looked more good-humoured. \"Ring the bell for the claret, George, and we'll see if that's as good as the Madeira. And while we are drinking it, I'll talk to you about a matter of importance.\"\nAmelia heard the bell ringing as she sat nervously upstairs. She thought, somehow, it was a mysterious and presentimental bell.\n\"What I want to know, George,\" the old gentleman said, \"is, how you and - ah - that little thing upstairs, are carrying on?\"\n\"I think, sir, it is not hard to see,\" George said with a self-satisfied grin. \"Pretty clear, sir. What capital wine!\"\n\"What d'you mean, pretty clear, sir?\"\n\"Why, hang it, sir, I'm a modest man, but I do own that she's devilish fond of me.\"\n\"And you yourself?\"\n\"Why, sir, didn't you order me to marry her, and ain't I a good boy?\"\n\"A pretty boy, indeed. I've heard of your doings, sir, with Lord Tarquin, Captain Crawley of the Guards, and that set. Have a care sir, have a care.\"\nGeorge was alarmed when he heard these names, fearing his father might have been informed of certain transactions at play. But the old man went on serenely:\n\"Well, well, young men will be young men. And the comfort to me is, George, that living in the best society in England, as my means allow you to do-\"\n\"Thank you, sir,\" said George, making his point at once. \"One can't live with these great folks for nothing; and my purse, sir, look at it.\" He held up a little purse which had been netted by Amelia, and contained the very last of Dobbin's pound notes.\n\"You shan't want, sir. Call on Mr. Chopper as you go through the City tomorrow; he'll have something for you. I don't grudge money when I know you're in good society, because I know that good society can never go wrong. I was a humbly born man - but you have had advantages. Make good use of 'em. Mix with the young nobility. And as for the pink bonnets\" (here there was a knowing and not very pleasant leer) \"why, boys will be boys. Only there's one thing I order you to avoid, or I'll cut you off with a shilling, by Jove; and that's gambling.\"\n\"Oh, of course, sir,\" said George.\n\"But to return to the other business about Amelia: why shouldn't you marry higher than a stockbroker's daughter, George?\"\n\"It's a family business, sir. You and Mr. Sedley made the match a hundred years ago.\"\n\"I don't deny it; but people's positions alter, sir. I don't deny that Sedley made my fortune, or rather put me in the way of acquiring, by my own talents, my high position in the tallow trade and the City of London. But George! I tell you in confidence I don't like the looks of Mr. Sedley's affairs. My chief clerk, Mr. Chopper, does not like the looks of 'em, and he knows the Exchange as well as any man in London. Unless I see Amelia's ten thousand down you don't marry her. I'll have no lame duck's daughter in my family. Pass the wine, sir - or ring for coffee.\"\nMr. Osborne spread out the evening paper, and George knew that the conversation was ended.\nHe hurried upstairs to Amelia in the highest spirits. What was it that made him more attentive and tender than he had been for a long time? Was it that his generous heart warmed to her at the prospect of misfortune; or that the idea of losing the dear little prize made him value it more?\nShe lived upon the recollections of that happy evening for many days afterwards, remembering his words and looks. It seemed to her no night ever passed so quickly at Mr. Osborne's house before.\nGeorge took a tender leave of her the next morning; and then hurried off to the City, where he visited Mr. Chopper, his father's head clerk, and received a document which he exchanged at the bank for a pocketful of money. As George entered the bank, old John Sedley was leaving, looking very dismal. But his godson was much too elated to notice the worthy stockbroker's depression.\nAs the swinging doors of Hulker, Bullock & Co. closed upon Mr. Sedley, Mr. Quill the cashier winked at Mr. Driver, the clerk at the next desk. Mr. Driver winked back.\n\"No go,\" Mr. D. whispered.\n\"Not at no price,\" Mr. Q. said. \"Mr. George Osborne, sir, how will you take it?\" George eagerly crammed notes into his pockets, and later paid Dobbin fifty pounds at mess.\nThat evening Amelia wrote him the tenderest of long letters. Her heart was overflowing, but it still foreboded evil. What was the cause of Mr. Osborne's dark looks? she asked. Had any difference arisen between him and her papa? Her poor papa returned so melancholy from the City, that all were alarmed about him at home. In all, there were four pages of loves and fears and hopes and forebodings.\n\"Poor dear little Emmy. How fond she is of me,\" George said, as he read the letter; \"and Gad, what a headache that punch has given me!\" Poor little Emmy, indeed.",
        "paragraph_chars": [
            [
                0,
                350
            ],
            [
                350,
                452
            ],
            [
                452,
                751
            ],
            [
                751,
                1276
            ],
            [
                1276,
                1548
            ],
            [
                1548,
                1922
            ],
            [
                1922,
                2423
            ],
            [
                2423,
                2633
            ],
            [
                2633,
                2673
            ],
            [
                2673,
                2924
            ],
            [
                2924,
                2965
            ],
            [
                2965,
                3012
            ],
            [
                3012,
                3037
            ],
            [
                3037,
                3102
            ],
            [
                3102,
                3186
            ],
            [
                3186,
                3369
            ],
            [
                3369,
                3550
            ],
            [
                3550,
                3616
            ],
            [
                3616,
                3708
            ],
            [
                3708,
                4452
            ],
            [
                4452,
                4604
            ],
            [
                4604,
                4701
            ],
            [
                4701,
                5031
            ],
            [
                5031,
                5167
            ],
            [
                5167,
                5565
            ],
            [
                5565,
                5665
            ],
            [
                5665,
                5842
            ],
            [
                5842,
                6105
            ],
            [
                6105,
                6535
            ],
            [
                6535,
                6726
            ],
            [
                6726,
                7184
            ],
            [
                7184,
                7639
            ],
            [
                7639,
                8164
            ],
            [
                8164,
                8611
            ],
            [
                8611,
                8940
            ],
            [
                8940,
                9383
            ],
            [
                9383,
                9459
            ],
            [
                9459,
                9626
            ],
            [
                9626,
                9756
            ],
            [
                9756,
                9786
            ],
            [
                9786,
                9819
            ],
            [
                9819,
                9877
            ],
            [
                9877,
                10121
            ],
            [
                10121,
                10212
            ],
            [
                10212,
                10496
            ],
            [
                10496,
                10588
            ],
            [
                10588,
                10766
            ],
            [
                10766,
                11002
            ],
            [
                11002,
                11277
            ],
            [
                11277,
                11946
            ],
            [
                11946,
                12171
            ],
            [
                12171,
                12315
            ],
            [
                12315,
                12576
            ],
            [
                12576,
                12704
            ],
            [
                12704,
                12829
            ],
            [
                12829,
                12948
            ],
            [
                12948,
                12986
            ],
            [
                12986,
                13070
            ],
            [
                13070,
                13090
            ],
            [
                13090,
                13160
            ],
            [
                13160,
                13310
            ],
            [
                13310,
                13467
            ],
            [
                13467,
                13617
            ],
            [
                13617,
                13870
            ],
            [
                13870,
                14417
            ],
            [
                14417,
                14452
            ],
            [
                14452,
                14574
            ],
            [
                14574,
                14660
            ],
            [
                14660,
                15230
            ],
            [
                15230,
                15321
            ],
            [
                15321,
                15610
            ],
            [
                15610,
                15804
            ],
            [
                15804,
                16186
            ],
            [
                16186,
                16353
            ],
            [
                16353,
                16380
            ],
            [
                16380,
                16552
            ],
            [
                16552,
                16949
            ],
            [
                16949,
                17110
            ]
        ],
        "segment_chars": [
            [
                0,
                217
            ],
            [
                217,
                350
            ],
            [
                350,
                408
            ],
            [
                408,
                452
            ],
            [
                452,
                519
            ],
            [
                519,
                556
            ],
            [
                556,
                751
            ],
            [
                751,
                947
            ],
            [
                947,
                1040
            ],
            [
                1040,
                1066
            ],
            [
                1066,
                1192
            ],
            [
                1192,
                1276
            ],
            [
                1276,
                1548
            ],
            [
                1548,
                1662
            ],
            [
                1662,
                1922
            ],
            [
                1922,
                1991
            ],
            [
                1991,
                2058
            ],
            [
                2058,
                2127
            ],
            [
                2127,
                2235
            ],
            [
                2235,
                2312
            ],
            [
                2312,
                2423
            ],
            [
                2423,
                2475
            ],
            [
                2475,
                2504
            ],
            [
                2504,
                2578
            ],
            [
                2578,
                2633
            ],
            [
                2633,
                2673
            ],
            [
                2673,
                2713
            ],
            [
                2713,
                2823
            ],
            [
                2823,
                2874
            ],
            [
                2874,
                2924
            ],
            [
                2924,
                2943
            ],
            [
                2943,
                2965
            ],
            [
                2965,
                3012
            ],
            [
                3012,
                3037
            ],
            [
                3037,
                3089
            ],
            [
                3089,
                3102
            ],
            [
                3102,
                3159
            ],
            [
                3159,
                3186
            ],
            [
                3186,
                3287
            ],
            [
                3287,
                3369
            ],
            [
                3369,
                3375
            ],
            [
                3375,
                3436
            ],
            [
                3436,
                3550
            ],
            [
                3550,
                3616
            ],
            [
                3616,
                3659
            ],
            [
                3659,
                3672
            ],
            [
                3672,
                3708
            ],
            [
                3708,
                3841
            ],
            [
                3841,
                3882
            ],
            [
                3882,
                3968
            ],
            [
                3968,
                4013
            ],
            [
                4013,
                4076
            ],
            [
                4076,
                4094
            ],
            [
                4094,
                4118
            ],
            [
                4118,
                4169
            ],
            [
                4169,
                4247
            ],
            [
                4247,
                4428
            ],
            [
                4428,
                4452
            ],
            [
                4452,
                4604
            ],
            [
                4604,
                4701
            ],
            [
                4701,
                4761
            ],
            [
                4761,
                4914
            ],
            [
                4914,
                4946
            ],
            [
                4946,
                4978
            ],
            [
                4978,
                5031
            ],
            [
                5031,
                5167
            ],
            [
                5167,
                5237
            ],
            [
                5237,
                5416
            ],
            [
                5416,
                5565
            ],
            [
                5565,
                5665
            ],
            [
                5665,
                5762
            ],
            [
                5762,
                5842
            ],
            [
                5842,
                6105
            ],
            [
                6105,
                6172
            ],
            [
                6172,
                6248
            ],
            [
                6248,
                6304
            ],
            [
                6304,
                6535
            ],
            [
                6535,
                6726
            ],
            [
                6726,
                6828
            ],
            [
                6828,
                6955
            ],
            [
                6955,
                7030
            ],
            [
                7030,
                7184
            ],
            [
                7184,
                7257
            ],
            [
                7257,
                7639
            ],
            [
                7639,
                7707
            ],
            [
                7707,
                7826
            ],
            [
                7826,
                7898
            ],
            [
                7898,
                8015
            ],
            [
                8015,
                8079
            ],
            [
                8079,
                8164
            ],
            [
                8164,
                8412
            ],
            [
                8412,
                8611
            ],
            [
                8611,
                8654
            ],
            [
                8654,
                8940
            ],
            [
                8940,
                8964
            ],
            [
                8964,
                9189
            ],
            [
                9189,
                9383
            ],
            [
                9383,
                9459
            ],
            [
                9459,
                9507
            ],
            [
                9507,
                9626
            ],
            [
                9626,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9786
            ],
            [
                9786,
                9819
            ],
            [
                9819,
                9842
            ],
            [
                9842,
                9868
            ],
            [
                9868,
                9877
            ],
            [
                9877,
                9894
            ],
            [
                9894,
                9941
            ],
            [
                9941,
                10014
            ],
            [
                10014,
                10121
            ],
            [
                10121,
                10142
            ],
            [
                10142,
                10212
            ],
            [
                10212,
                10391
            ],
            [
                10391,
                10453
            ],
            [
                10453,
                10496
            ],
            [
                10496,
                10504
            ],
            [
                10504,
                10588
            ],
            [
                10588,
                10638
            ],
            [
                10638,
                10679
            ],
            [
                10679,
                10693
            ],
            [
                10693,
                10766
            ],
            [
                10766,
                11002
            ],
            [
                11002,
                11061
            ],
            [
                11061,
                11086
            ],
            [
                11086,
                11127
            ],
            [
                11127,
                11143
            ],
            [
                11143,
                11277
            ],
            [
                11277,
                11339
            ],
            [
                11339,
                11387
            ],
            [
                11387,
                11483
            ],
            [
                11483,
                11714
            ],
            [
                11714,
                11776
            ],
            [
                11776,
                11854
            ],
            [
                11854,
                11871
            ],
            [
                11871,
                11946
            ],
            [
                11946,
                12003
            ],
            [
                12003,
                12065
            ],
            [
                12065,
                12102
            ],
            [
                12102,
                12171
            ],
            [
                12171,
                12233
            ],
            [
                12233,
                12315
            ],
            [
                12315,
                12325
            ],
            [
                12325,
                12349
            ],
            [
                12349,
                12411
            ],
            [
                12411,
                12498
            ],
            [
                12498,
                12576
            ],
            [
                12576,
                12637
            ],
            [
                12637,
                12704
            ],
            [
                12704,
                12829
            ],
            [
                12829,
                12908
            ],
            [
                12908,
                12928
            ],
            [
                12928,
                12948
            ],
            [
                12948,
                12986
            ],
            [
                12986,
                13070
            ],
            [
                13070,
                13090
            ],
            [
                13090,
                13160
            ],
            [
                13160,
                13183
            ],
            [
                13183,
                13279
            ],
            [
                13279,
                13310
            ],
            [
                13310,
                13433
            ],
            [
                13433,
                13467
            ],
            [
                13467,
                13509
            ],
            [
                13509,
                13617
            ],
            [
                13617,
                13674
            ],
            [
                13674,
                13758
            ],
            [
                13758,
                13870
            ],
            [
                13870,
                13893
            ],
            [
                13893,
                13980
            ],
            [
                13980,
                14090
            ],
            [
                14090,
                14145
            ],
            [
                14145,
                14167
            ],
            [
                14167,
                14196
            ],
            [
                14196,
                14304
            ],
            [
                14304,
                14417
            ],
            [
                14417,
                14452
            ],
            [
                14452,
                14574
            ],
            [
                14574,
                14604
            ],
            [
                14604,
                14660
            ],
            [
                14660,
                14713
            ],
            [
                14713,
                14877
            ],
            [
                14877,
                14889
            ],
            [
                14889,
                14962
            ],
            [
                14962,
                15079
            ],
            [
                15079,
                15140
            ],
            [
                15140,
                15188
            ],
            [
                15188,
                15230
            ],
            [
                15230,
                15321
            ],
            [
                15321,
                15375
            ],
            [
                15375,
                15461
            ],
            [
                15461,
                15610
            ],
            [
                15610,
                15724
            ],
            [
                15724,
                15804
            ],
            [
                15804,
                16026
            ],
            [
                16026,
                16104
            ],
            [
                16104,
                16186
            ],
            [
                16186,
                16329
            ],
            [
                16329,
                16353
            ],
            [
                16353,
                16380
            ],
            [
                16380,
                16412
            ],
            [
                16412,
                16461
            ],
            [
                16461,
                16552
            ],
            [
                16552,
                16613
            ],
            [
                16613,
                16669
            ],
            [
                16669,
                16717
            ],
            [
                16717,
                16728
            ],
            [
                16728,
                16780
            ],
            [
                16780,
                16873
            ],
            [
                16873,
                16949
            ],
            [
                16949,
                16973
            ],
            [
                16973,
                17085
            ],
            [
                17085,
                17110
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                20,
                143
            ],
            [
                150,
                179
            ],
            [
                180,
                195
            ],
            [
                196,
                198
            ],
            [
                199,
                210
            ],
            [
                215,
                217
            ],
            [
                217,
                345
            ],
            [
                348,
                350
            ],
            [
                350,
                408
            ],
            [
                408,
                438
            ],
            [
                439,
                451
            ],
            [
                452,
                519
            ],
            [
                519,
                556
            ],
            [
                556,
                653
            ],
            [
                654,
                658
            ],
            [
                659,
                675
            ],
            [
                675,
                751
            ],
            [
                751,
                813
            ],
            [
                813,
                947
            ],
            [
                947,
                977
            ],
            [
                978,
                998
            ],
            [
                999,
                1002
            ],
            [
                1003,
                1038
            ],
            [
                1038,
                1040
            ],
            [
                1040,
                1066
            ],
            [
                1066,
                1109
            ],
            [
                1110,
                1115
            ],
            [
                1116,
                1119
            ],
            [
                1123,
                1124
            ],
            [
                1125,
                1159
            ],
            [
                1160,
                1177
            ],
            [
                1186,
                1192
            ],
            [
                1192,
                1275
            ],
            [
                1276,
                1326
            ],
            [
                1327,
                1347
            ],
            [
                1354,
                1392
            ],
            [
                1402,
                1423
            ],
            [
                1424,
                1448
            ],
            [
                1448,
                1449
            ],
            [
                1450,
                1452
            ],
            [
                1453,
                1474
            ],
            [
                1475,
                1477
            ],
            [
                1478,
                1530
            ],
            [
                1531,
                1546
            ],
            [
                1546,
                1548
            ],
            [
                1548,
                1606
            ],
            [
                1607,
                1662
            ],
            [
                1662,
                1730
            ],
            [
                1731,
                1738
            ],
            [
                1747,
                1750
            ],
            [
                1751,
                1754
            ],
            [
                1763,
                1803
            ],
            [
                1804,
                1805
            ],
            [
                1810,
                1853
            ],
            [
                1853,
                1921
            ],
            [
                1922,
                1929
            ],
            [
                1930,
                1936
            ],
            [
                1937,
                1966
            ],
            [
                1966,
                1972
            ],
            [
                1973,
                1989
            ],
            [
                1989,
                1991
            ],
            [
                1991,
                2040
            ],
            [
                2056,
                2058
            ],
            [
                2058,
                2127
            ],
            [
                2127,
                2235
            ],
            [
                2235,
                2238
            ],
            [
                2239,
                2270
            ],
            [
                2271,
                2312
            ],
            [
                2312,
                2364
            ],
            [
                2365,
                2372
            ],
            [
                2377,
                2384
            ],
            [
                2385,
                2423
            ],
            [
                2423,
                2475
            ],
            [
                2475,
                2504
            ],
            [
                2504,
                2578
            ],
            [
                2578,
                2597
            ],
            [
                2598,
                2622
            ],
            [
                2622,
                2633
            ],
            [
                2633,
                2673
            ],
            [
                2673,
                2699
            ],
            [
                2711,
                2713
            ],
            [
                2713,
                2751
            ],
            [
                2751,
                2752
            ],
            [
                2753,
                2767
            ],
            [
                2768,
                2823
            ],
            [
                2823,
                2872
            ],
            [
                2872,
                2874
            ],
            [
                2874,
                2924
            ],
            [
                2924,
                2943
            ],
            [
                2943,
                2957
            ],
            [
                2963,
                2965
            ],
            [
                2965,
                2997
            ],
            [
                3005,
                3009
            ],
            [
                3009,
                3012
            ],
            [
                3012,
                3036
            ],
            [
                3037,
                3086
            ],
            [
                3089,
                3102
            ],
            [
                3102,
                3159
            ],
            [
                3159,
                3186
            ],
            [
                3186,
                3287
            ],
            [
                3287,
                3313
            ],
            [
                3317,
                3335
            ],
            [
                3342,
                3369
            ],
            [
                3369,
                3370
            ],
            [
                3373,
                3375
            ],
            [
                3375,
                3388
            ],
            [
                3394,
                3436
            ],
            [
                3436,
                3550
            ],
            [
                3550,
                3616
            ],
            [
                3616,
                3631
            ],
            [
                3634,
                3659
            ],
            [
                3659,
                3672
            ],
            [
                3672,
                3708
            ],
            [
                3708,
                3748
            ],
            [
                3751,
                3768
            ],
            [
                3774,
                3841
            ],
            [
                3841,
                3882
            ],
            [
                3882,
                3917
            ],
            [
                3918,
                3923
            ],
            [
                3928,
                3966
            ],
            [
                3966,
                3968
            ],
            [
                3968,
                3971
            ],
            [
                3972,
                3995
            ],
            [
                4009,
                4013
            ],
            [
                4013,
                4076
            ],
            [
                4076,
                4094
            ],
            [
                4094,
                4100
            ],
            [
                4101,
                4116
            ],
            [
                4116,
                4118
            ],
            [
                4118,
                4121
            ],
            [
                4122,
                4130
            ],
            [
                4137,
                4167
            ],
            [
                4167,
                4168
            ],
            [
                4169,
                4200
            ],
            [
                4201,
                4229
            ],
            [
                4229,
                4230
            ],
            [
                4231,
                4245
            ],
            [
                4245,
                4247
            ],
            [
                4247,
                4250
            ],
            [
                4251,
                4252
            ],
            [
                4253,
                4267
            ],
            [
                4267,
                4335
            ],
            [
                4340,
                4342
            ],
            [
                4343,
                4375
            ],
            [
                4376,
                4390
            ],
            [
                4391,
                4417
            ],
            [
                4428,
                4452
            ],
            [
                4452,
                4514
            ],
            [
                4515,
                4555
            ],
            [
                4556,
                4557
            ],
            [
                4558,
                4562
            ],
            [
                4563,
                4604
            ],
            [
                4604,
                4648
            ],
            [
                4659,
                4667
            ],
            [
                4668,
                4701
            ],
            [
                4701,
                4761
            ],
            [
                4761,
                4914
            ],
            [
                4914,
                4946
            ],
            [
                4946,
                4978
            ],
            [
                4978,
                5031
            ],
            [
                5031,
                5049
            ],
            [
                5052,
                5130
            ],
            [
                5136,
                5140
            ],
            [
                5141,
                5167
            ],
            [
                5167,
                5173
            ],
            [
                5173,
                5174
            ],
            [
                5175,
                5184
            ],
            [
                5184,
                5210
            ],
            [
                5211,
                5223
            ],
            [
                5224,
                5226
            ],
            [
                5227,
                5235
            ],
            [
                5235,
                5237
            ],
            [
                5237,
                5312
            ],
            [
                5317,
                5330
            ],
            [
                5335,
                5416
            ],
            [
                5416,
                5465
            ],
            [
                5466,
                5477
            ],
            [
                5478,
                5565
            ],
            [
                5565,
                5568
            ],
            [
                5574,
                5577
            ],
            [
                5578,
                5600
            ],
            [
                5601,
                5607
            ],
            [
                5608,
                5615
            ],
            [
                5620,
                5663
            ],
            [
                5663,
                5664
            ],
            [
                5665,
                5688
            ],
            [
                5694,
                5729
            ],
            [
                5729,
                5759
            ],
            [
                5759,
                5762
            ],
            [
                5762,
                5764
            ],
            [
                5765,
                5771
            ],
            [
                5776,
                5778
            ],
            [
                5779,
                5790
            ],
            [
                5791,
                5796
            ],
            [
                5803,
                5810
            ],
            [
                5814,
                5826
            ],
            [
                5827,
                5842
            ],
            [
                5842,
                6098
            ],
            [
                6103,
                6104
            ],
            [
                6105,
                6172
            ],
            [
                6172,
                6212
            ],
            [
                6217,
                6248
            ],
            [
                6248,
                6251
            ],
            [
                6252,
                6265
            ],
            [
                6266,
                6269
            ],
            [
                6270,
                6287
            ],
            [
                6288,
                6302
            ],
            [
                6302,
                6304
            ],
            [
                6304,
                6309
            ],
            [
                6310,
                6397
            ],
            [
                6397,
                6398
            ],
            [
                6399,
                6414
            ],
            [
                6415,
                6425
            ],
            [
                6426,
                6428
            ],
            [
                6433,
                6438
            ],
            [
                6439,
                6461
            ],
            [
                6462,
                6534
            ],
            [
                6535,
                6552
            ],
            [
                6553,
                6575
            ],
            [
                6575,
                6726
            ],
            [
                6726,
                6746
            ],
            [
                6751,
                6828
            ],
            [
                6828,
                6864
            ],
            [
                6879,
                6883
            ],
            [
                6885,
                6890
            ],
            [
                6894,
                6947
            ],
            [
                6953,
                6955
            ],
            [
                6955,
                7030
            ],
            [
                7030,
                7148
            ],
            [
                7149,
                7184
            ],
            [
                7184,
                7205
            ],
            [
                7210,
                7257
            ],
            [
                7257,
                7270
            ],
            [
                7276,
                7294
            ],
            [
                7294,
                7295
            ],
            [
                7296,
                7299
            ],
            [
                7306,
                7349
            ],
            [
                7351,
                7354
            ],
            [
                7364,
                7381
            ],
            [
                7383,
                7386
            ],
            [
                7387,
                7393
            ],
            [
                7394,
                7396
            ],
            [
                7397,
                7406
            ],
            [
                7407,
                7417
            ],
            [
                7422,
                7426
            ],
            [
                7426,
                7505
            ],
            [
                7512,
                7526
            ],
            [
                7526,
                7638
            ],
            [
                7639,
                7707
            ],
            [
                7707,
                7732
            ],
            [
                7733,
                7826
            ],
            [
                7826,
                7898
            ],
            [
                7898,
                7956
            ],
            [
                7957,
                7963
            ],
            [
                7964,
                7969
            ],
            [
                7970,
                8015
            ],
            [
                8015,
                8047
            ],
            [
                8061,
                8077
            ],
            [
                8079,
                8098
            ],
            [
                8106,
                8108
            ],
            [
                8113,
                8128
            ],
            [
                8128,
                8149
            ],
            [
                8155,
                8157
            ],
            [
                8162,
                8164
            ],
            [
                8169,
                8177
            ],
            [
                8178,
                8223
            ],
            [
                8224,
                8252
            ],
            [
                8252,
                8296
            ],
            [
                8306,
                8327
            ],
            [
                8330,
                8410
            ],
            [
                8410,
                8412
            ],
            [
                8417,
                8419
            ],
            [
                8425,
                8443
            ],
            [
                8475,
                8577
            ],
            [
                8588,
                8609
            ],
            [
                8611,
                8653
            ],
            [
                8654,
                8656
            ],
            [
                8657,
                8771
            ],
            [
                8773,
                8776
            ],
            [
                8777,
                8814
            ],
            [
                8815,
                8829
            ],
            [
                8829,
                8940
            ],
            [
                8940,
                8946
            ],
            [
                8947,
                8964
            ],
            [
                8964,
                9061
            ],
            [
                9062,
                9096
            ],
            [
                9097,
                9103
            ],
            [
                9104,
                9108
            ],
            [
                9109,
                9115
            ],
            [
                9116,
                9119
            ],
            [
                9120,
                9139
            ],
            [
                9140,
                9154
            ],
            [
                9155,
                9159
            ],
            [
                9163,
                9189
            ],
            [
                9189,
                9208
            ],
            [
                9217,
                9238
            ],
            [
                9238,
                9281
            ],
            [
                9282,
                9327
            ],
            [
                9328,
                9332
            ],
            [
                9352,
                9382
            ],
            [
                9383,
                9407
            ],
            [
                9427,
                9428
            ],
            [
                9430,
                9459
            ],
            [
                9460,
                9504
            ],
            [
                9507,
                9538
            ],
            [
                9539,
                9545
            ],
            [
                9546,
                9548
            ],
            [
                9551,
                9558
            ],
            [
                9559,
                9626
            ],
            [
                9626,
                9630
            ],
            [
                9634,
                9718
            ],
            [
                9728,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9786
            ],
            [
                9786,
                9816
            ],
            [
                9819,
                9842
            ],
            [
                9842,
                9868
            ],
            [
                9868,
                9876
            ],
            [
                9877,
                9894
            ],
            [
                9902,
                9941
            ],
            [
                9941,
                9944
            ],
            [
                9945,
                9984
            ],
            [
                9988,
                10014
            ],
            [
                10014,
                10029
            ],
            [
                10029,
                10053
            ],
            [
                10054,
                10071
            ],
            [
                10071,
                10121
            ],
            [
                10121,
                10139
            ],
            [
                10139,
                10142
            ],
            [
                10142,
                10206
            ],
            [
                10210,
                10211
            ],
            [
                10212,
                10275
            ],
            [
                10276,
                10287
            ],
            [
                10288,
                10291
            ],
            [
                10292,
                10301
            ],
            [
                10302,
                10343
            ],
            [
                10348,
                10365
            ],
            [
                10379,
                10391
            ],
            [
                10391,
                10440
            ],
            [
                10441,
                10453
            ],
            [
                10453,
                10495
            ],
            [
                10496,
                10504
            ],
            [
                10509,
                10520
            ],
            [
                10520,
                10539
            ],
            [
                10547,
                10588
            ],
            [
                10588,
                10620
            ],
            [
                10621,
                10628
            ],
            [
                10629,
                10636
            ],
            [
                10636,
                10638
            ],
            [
                10638,
                10661
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10693
            ],
            [
                10693,
                10697
            ],
            [
                10701,
                10705
            ],
            [
                10705,
                10717
            ],
            [
                10727,
                10766
            ],
            [
                10768,
                10788
            ],
            [
                10789,
                10795
            ],
            [
                10796,
                10803
            ],
            [
                10810,
                10819
            ],
            [
                10820,
                10823
            ],
            [
                10824,
                10828
            ],
            [
                10829,
                10849
            ],
            [
                10861,
                10877
            ],
            [
                10878,
                10881
            ],
            [
                10882,
                10969
            ],
            [
                10971,
                11002
            ],
            [
                11002,
                11061
            ],
            [
                11061,
                11086
            ],
            [
                11086,
                11103
            ],
            [
                11106,
                11127
            ],
            [
                11127,
                11141
            ],
            [
                11143,
                11215
            ],
            [
                11216,
                11252
            ],
            [
                11252,
                11253
            ],
            [
                11258,
                11275
            ],
            [
                11275,
                11277
            ],
            [
                11288,
                11291
            ],
            [
                11292,
                11298
            ],
            [
                11299,
                11317
            ],
            [
                11318,
                11320
            ],
            [
                11321,
                11337
            ],
            [
                11337,
                11339
            ],
            [
                11339,
                11387
            ],
            [
                11387,
                11434
            ],
            [
                11435,
                11441
            ],
            [
                11442,
                11453
            ],
            [
                11459,
                11463
            ],
            [
                11464,
                11483
            ],
            [
                11483,
                11494
            ],
            [
                11495,
                11524
            ],
            [
                11525,
                11543
            ],
            [
                11549,
                11677
            ],
            [
                11677,
                11682
            ],
            [
                11687,
                11714
            ],
            [
                11714,
                11733
            ],
            [
                11734,
                11776
            ],
            [
                11776,
                11784
            ],
            [
                11785,
                11788
            ],
            [
                11789,
                11828
            ],
            [
                11833,
                11854
            ],
            [
                11854,
                11871
            ],
            [
                11871,
                11881
            ],
            [
                11882,
                11887
            ],
            [
                11899,
                11944
            ],
            [
                11944,
                11946
            ],
            [
                11959,
                11964
            ],
            [
                11965,
                11973
            ],
            [
                11979,
                11993
            ],
            [
                12001,
                12003
            ],
            [
                12003,
                12035
            ],
            [
                12046,
                12063
            ],
            [
                12063,
                12065
            ],
            [
                12065,
                12102
            ],
            [
                12102,
                12171
            ],
            [
                12171,
                12233
            ],
            [
                12233,
                12298
            ],
            [
                12299,
                12315
            ],
            [
                12315,
                12325
            ],
            [
                12325,
                12349
            ],
            [
                12349,
                12376
            ],
            [
                12377,
                12380
            ],
            [
                12384,
                12409
            ],
            [
                12409,
                12411
            ],
            [
                12411,
                12412
            ],
            [
                12440,
                12449
            ],
            [
                12450,
                12496
            ],
            [
                12496,
                12498
            ],
            [
                12498,
                12501
            ],
            [
                12508,
                12576
            ],
            [
                12576,
                12592
            ],
            [
                12593,
                12637
            ],
            [
                12637,
                12703
            ],
            [
                12704,
                12758
            ],
            [
                12759,
                12760
            ],
            [
                12760,
                12775
            ],
            [
                12778,
                12780
            ],
            [
                12783,
                12829
            ],
            [
                12829,
                12879
            ],
            [
                12880,
                12908
            ],
            [
                12908,
                12926
            ],
            [
                12928,
                12948
            ],
            [
                12948,
                12986
            ],
            [
                13006,
                13022
            ],
            [
                13024,
                13047
            ],
            [
                13048,
                13067
            ],
            [
                13070,
                13090
            ],
            [
                13090,
                13157
            ],
            [
                13160,
                13183
            ],
            [
                13183,
                13184
            ],
            [
                13188,
                13264
            ],
            [
                13265,
                13279
            ],
            [
                13279,
                13310
            ],
            [
                13310,
                13342
            ],
            [
                13349,
                13354
            ],
            [
                13364,
                13433
            ],
            [
                13433,
                13444
            ],
            [
                13457,
                13467
            ],
            [
                13467,
                13509
            ],
            [
                13509,
                13589
            ],
            [
                13590,
                13598
            ],
            [
                13599,
                13614
            ],
            [
                13617,
                13634
            ],
            [
                13640,
                13674
            ],
            [
                13674,
                13755
            ],
            [
                13758,
                13777
            ],
            [
                13784,
                13870
            ],
            [
                13870,
                13893
            ],
            [
                13893,
                13939
            ],
            [
                13948,
                13980
            ],
            [
                13980,
                14090
            ],
            [
                14090,
                14113
            ],
            [
                14116,
                14145
            ],
            [
                14145,
                14149
            ],
            [
                14150,
                14167
            ],
            [
                14167,
                14196
            ],
            [
                14196,
                14223
            ],
            [
                14225,
                14230
            ],
            [
                14231,
                14236
            ],
            [
                14241,
                14263
            ],
            [
                14273,
                14277
            ],
            [
                14280,
                14283
            ],
            [
                14285,
                14304
            ],
            [
                14304,
                14348
            ],
            [
                14352,
                14417
            ],
            [
                14417,
                14452
            ],
            [
                14452,
                14571
            ],
            [
                14571,
                14574
            ],
            [
                14574,
                14602
            ],
            [
                14602,
                14604
            ],
            [
                14604,
                14660
            ],
            [
                14660,
                14713
            ],
            [
                14713,
                14814
            ],
            [
                14814,
                14815
            ],
            [
                14824,
                14832
            ],
            [
                14833,
                14877
            ],
            [
                14881,
                14889
            ],
            [
                14889,
                14962
            ],
            [
                14962,
                15029
            ],
            [
                15030,
                15035
            ],
            [
                15049,
                15079
            ],
            [
                15079,
                15140
            ],
            [
                15140,
                15188
            ],
            [
                15188,
                15206
            ],
            [
                15209,
                15230
            ],
            [
                15232,
                15287
            ],
            [
                15288,
                15296
            ],
            [
                15310,
                15319
            ],
            [
                15319,
                15321
            ],
            [
                15321,
                15375
            ],
            [
                15375,
                15415
            ],
            [
                15420,
                15426
            ],
            [
                15427,
                15459
            ],
            [
                15459,
                15461
            ],
            [
                15461,
                15610
            ],
            [
                15610,
                15712
            ],
            [
                15717,
                15722
            ],
            [
                15722,
                15724
            ],
            [
                15724,
                15740
            ],
            [
                15741,
                15802
            ],
            [
                15802,
                15804
            ],
            [
                15804,
                15810
            ],
            [
                15811,
                15937
            ],
            [
                15943,
                15957
            ],
            [
                15958,
                15990
            ],
            [
                16000,
                16005
            ],
            [
                16006,
                16026
            ],
            [
                16026,
                16047
            ],
            [
                16052,
                16073
            ],
            [
                16081,
                16104
            ],
            [
                16104,
                16141
            ],
            [
                16149,
                16184
            ],
            [
                16184,
                16185
            ],
            [
                16186,
                16266
            ],
            [
                16267,
                16278
            ],
            [
                16279,
                16317
            ],
            [
                16323,
                16327
            ],
            [
                16327,
                16329
            ],
            [
                16329,
                16346
            ],
            [
                16351,
                16353
            ],
            [
                16353,
                16380
            ],
            [
                16380,
                16412
            ],
            [
                16412,
                16461
            ],
            [
                16461,
                16467
            ],
            [
                16468,
                16475
            ],
            [
                16476,
                16483
            ],
            [
                16484,
                16511
            ],
            [
                16518,
                16542
            ],
            [
                16543,
                16552
            ],
            [
                16552,
                16556
            ],
            [
                16557,
                16613
            ],
            [
                16613,
                16638
            ],
            [
                16638,
                16669
            ],
            [
                16669,
                16717
            ],
            [
                16717,
                16728
            ],
            [
                16728,
                16780
            ],
            [
                16780,
                16871
            ],
            [
                16873,
                16875
            ],
            [
                16879,
                16949
            ],
            [
                16949,
                16954
            ],
            [
                16960,
                16973
            ],
            [
                16973,
                17015
            ],
            [
                17021,
                17024
            ],
            [
                17033,
                17063
            ],
            [
                17064,
                17085
            ],
            [
                17085,
                17110
            ]
        ],
        "row_chars": [
            [
                0,
                217
            ],
            [
                217,
                350
            ],
            [
                350,
                408
            ],
            [
                408,
                452
            ],
            [
                452,
                519
            ],
            [
                519,
                556
            ],
            [
                556,
                751
            ],
            [
                751,
                947
            ],
            [
                947,
                1040
            ],
            [
                1040,
                1066
            ],
            [
                1066,
                1192
            ],
            [
                1192,
                1276
            ],
            [
                1276,
                1276
            ],
            [
                1276,
                1276
            ],
            [
                1276,
                1548
            ],
            [
                1548,
                1662
            ],
            [
                1662,
                1922
            ],
            [
                1922,
                1991
            ],
            [
                1991,
                2058
            ],
            [
                2058,
                2127
            ],
            [
                2127,
                2235
            ],
            [
                2235,
                2312
            ],
            [
                2312,
                2423
            ],
            [
                2423,
                2475
            ],
            [
                2475,
                2504
            ],
            [
                2504,
                2578
            ],
            [
                2578,
                2578
            ],
            [
                2578,
                2633
            ],
            [
                2633,
                2673
            ],
            [
                2673,
                2713
            ],
            [
                2713,
                2823
            ],
            [
                2823,
                2874
            ],
            [
                2874,
                2874
            ],
            [
                2874,
                2924
            ],
            [
                2924,
                2943
            ],
            [
                2943,
                2965
            ],
            [
                2965,
                3012
            ],
            [
                3012,
                3037
            ],
            [
                3037,
                3037
            ],
            [
                3037,
                3089
            ],
            [
                3089,
                3102
            ],
            [
                3102,
                3159
            ],
            [
                3159,
                3186
            ],
            [
                3186,
                3287
            ],
            [
                3287,
                3369
            ],
            [
                3369,
                3375
            ],
            [
                3375,
                3436
            ],
            [
                3436,
                3550
            ],
            [
                3550,
                3616
            ],
            [
                3616,
                3659
            ],
            [
                3659,
                3672
            ],
            [
                3672,
                3708
            ],
            [
                3708,
                3841
            ],
            [
                3841,
                3882
            ],
            [
                3882,
                3968
            ],
            [
                3968,
                4013
            ],
            [
                4013,
                4076
            ],
            [
                4076,
                4094
            ],
            [
                4094,
                4118
            ],
            [
                4118,
                4247
            ],
            [
                4247,
                4452
            ],
            [
                4452,
                4604
            ],
            [
                4604,
                4701
            ],
            [
                4701,
                4761
            ],
            [
                4761,
                4914
            ],
            [
                4914,
                4946
            ],
            [
                4946,
                4978
            ],
            [
                4978,
                5031
            ],
            [
                5031,
                5167
            ],
            [
                5167,
                5237
            ],
            [
                5237,
                5416
            ],
            [
                5416,
                5416
            ],
            [
                5416,
                5565
            ],
            [
                5565,
                5665
            ],
            [
                5665,
                5762
            ],
            [
                5762,
                5842
            ],
            [
                5842,
                6105
            ],
            [
                6105,
                6172
            ],
            [
                6172,
                6248
            ],
            [
                6248,
                6304
            ],
            [
                6304,
                6304
            ],
            [
                6304,
                6535
            ],
            [
                6535,
                6535
            ],
            [
                6535,
                6535
            ],
            [
                6535,
                6535
            ],
            [
                6535,
                6726
            ],
            [
                6726,
                6828
            ],
            [
                6828,
                6955
            ],
            [
                6955,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7030
            ],
            [
                7030,
                7184
            ],
            [
                7184,
                7257
            ],
            [
                7257,
                7639
            ],
            [
                7639,
                7707
            ],
            [
                7707,
                7826
            ],
            [
                7826,
                7898
            ],
            [
                7898,
                8015
            ],
            [
                8015,
                8164
            ],
            [
                8164,
                8412
            ],
            [
                8412,
                8412
            ],
            [
                8412,
                8654
            ],
            [
                8654,
                8940
            ],
            [
                8940,
                8964
            ],
            [
                8964,
                9189
            ],
            [
                9189,
                9383
            ],
            [
                9383,
                9459
            ],
            [
                9459,
                9459
            ],
            [
                9459,
                9626
            ],
            [
                9626,
                9756
            ],
            [
                9756,
                9766
            ],
            [
                9766,
                9786
            ],
            [
                9786,
                9819
            ],
            [
                9819,
                9842
            ],
            [
                9842,
                9868
            ],
            [
                9868,
                9877
            ],
            [
                9877,
                9877
            ],
            [
                9877,
                9894
            ],
            [
                9894,
                9941
            ],
            [
                9941,
                10014
            ],
            [
                10014,
                10121
            ],
            [
                10121,
                10142
            ],
            [
                10142,
                10212
            ],
            [
                10212,
                10391
            ],
            [
                10391,
                10453
            ],
            [
                10453,
                10496
            ],
            [
                10496,
                10496
            ],
            [
                10496,
                10504
            ],
            [
                10504,
                10588
            ],
            [
                10588,
                10638
            ],
            [
                10638,
                10679
            ],
            [
                10679,
                10693
            ],
            [
                10693,
                10766
            ],
            [
                10766,
                11002
            ],
            [
                11002,
                11002
            ],
            [
                11002,
                11061
            ],
            [
                11061,
                11086
            ],
            [
                11086,
                11127
            ],
            [
                11127,
                11143
            ],
            [
                11143,
                11277
            ],
            [
                11277,
                11339
            ],
            [
                11339,
                11387
            ],
            [
                11387,
                11483
            ],
            [
                11483,
                11714
            ],
            [
                11714,
                11776
            ],
            [
                11776,
                11854
            ],
            [
                11854,
                11854
            ],
            [
                11854,
                11854
            ],
            [
                11854,
                11871
            ],
            [
                11871,
                11946
            ],
            [
                11946,
                12003
            ],
            [
                12003,
                12065
            ],
            [
                12065,
                12102
            ],
            [
                12102,
                12171
            ],
            [
                12171,
                12233
            ],
            [
                12233,
                12315
            ],
            [
                12315,
                12325
            ],
            [
                12325,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12349
            ],
            [
                12349,
                12411
            ],
            [
                12411,
                12498
            ],
            [
                12498,
                12576
            ],
            [
                12576,
                12637
            ],
            [
                12637,
                12704
            ],
            [
                12704,
                12704
            ],
            [
                12704,
                12829
            ],
            [
                12829,
                12908
            ],
            [
                12908,
                12948
            ],
            [
                12948,
                12986
            ],
            [
                12986,
                12986
            ],
            [
                12986,
                13070
            ],
            [
                13070,
                13070
            ],
            [
                13070,
                13090
            ],
            [
                13090,
                13160
            ],
            [
                13160,
                13160
            ],
            [
                13160,
                13183
            ],
            [
                13183,
                13279
            ],
            [
                13279,
                13310
            ],
            [
                13310,
                13310
            ],
            [
                13310,
                13310
            ],
            [
                13310,
                13310
            ],
            [
                13310,
                13310
            ],
            [
                13310,
                13433
            ],
            [
                13433,
                13467
            ],
            [
                13467,
                13509
            ],
            [
                13509,
                13617
            ],
            [
                13617,
                13674
            ],
            [
                13674,
                13870
            ],
            [
                13870,
                13893
            ],
            [
                13893,
                13893
            ],
            [
                13893,
                13893
            ],
            [
                13893,
                13980
            ],
            [
                13980,
                14090
            ],
            [
                14090,
                14090
            ],
            [
                14090,
                14145
            ],
            [
                14145,
                14167
            ],
            [
                14167,
                14196
            ],
            [
                14196,
                14196
            ],
            [
                14196,
                14304
            ],
            [
                14304,
                14417
            ],
            [
                14417,
                14452
            ],
            [
                14452,
                14574
            ],
            [
                14574,
                14604
            ],
            [
                14604,
                14660
            ],
            [
                14660,
                14713
            ],
            [
                14713,
                14877
            ],
            [
                14877,
                14877
            ],
            [
                14877,
                14889
            ],
            [
                14889,
                14962
            ],
            [
                14962,
                15079
            ],
            [
                15079,
                15079
            ],
            [
                15079,
                15079
            ],
            [
                15079,
                15079
            ],
            [
                15079,
                15140
            ],
            [
                15140,
                15188
            ],
            [
                15188,
                15230
            ],
            [
                15230,
                15321
            ],
            [
                15321,
                15375
            ],
            [
                15375,
                15461
            ],
            [
                15461,
                15610
            ],
            [
                15610,
                15724
            ],
            [
                15724,
                15804
            ],
            [
                15804,
                16026
            ],
            [
                16026,
                16104
            ],
            [
                16104,
                16186
            ],
            [
                16186,
                16186
            ],
            [
                16186,
                16329
            ],
            [
                16329,
                16353
            ],
            [
                16353,
                16380
            ],
            [
                16380,
                16412
            ],
            [
                16412,
                16461
            ],
            [
                16461,
                16552
            ],
            [
                16552,
                16613
            ],
            [
                16613,
                16669
            ],
            [
                16669,
                16717
            ],
            [
                16717,
                16728
            ],
            [
                16728,
                16780
            ],
            [
                16780,
                16949
            ],
            [
                16949,
                16973
            ],
            [
                16973,
                17085
            ],
            [
                17085,
                17110
            ]
        ]
    }
}