{
    "original": {
        "text": "If there is any exhibition in all Vanity Fair which Satire and Sentiment can visit arm in arm together; where you light on the strangest contrasts laughable and tearful: where you may be gentle and pathetic, or savage and cynical with perfect propriety: it is at one of those public assemblies, a crowd of which are advertised every day in the last page of the Times newspaper, and over which the late Mr. George Robins used to preside with so much dignity. There are very few London people, as I fancy, who have not attended at these meetings, and all with a taste for moralizing must have thought, with a sensation and interest not a little startling and queer, of the day when their turn shall come too, and Mr. Hammerdown will sell by the orders of Diogenes' assignees, or will be instructed by the executors, to offer to public competition, the library, furniture, plate, wardrobe, and choice cellar of wines of Epicurus deceased.\nEven with the most selfish disposition, the Vanity Fairian, as he witnesses this sordid part of the obsequies of a departed friend, can't but feel some sympathies and regret. My Lord Dives's remains are in the family vault: the statuaries are cutting an inscription veraciously commemorating his virtues, and the sorrows of his heir, who is disposing of his goods. What guest at Dives's table can pass the familiar house without a sigh?--the familiar house of which the lights used to shine so cheerfully at seven o'clock, of which the hall-doors opened so readily, of which the obsequious servants, as you passed up the comfortable stair, sounded your name from landing to landing, until it reached the apartment where jolly old Dives welcomed his friends! What a number of them he had; and what a noble way of entertaining them. How witty people used to be here who were morose when they got out of the door; and how courteous and friendly men who slandered and hated each other everywhere else! He was pompous, but with such a cook what would one not swallow? he was rather dull, perhaps, but would not such wine make any conversation pleasant? We must get some of his Burgundy at any price, the mourners cry at his club. \"I got this box at old Dives's sale,\" Pincher says, handing it round, \"one of Louis XV's mistresses--pretty thing, is it not?--sweet miniature,\" and they talk of the way in which young Dives is dissipating his fortune.\nHow changed the house is, though! The front is patched over with bills, setting forth the particulars of the furniture in staring capitals. They have hung a shred of carpet out of an upstairs window--a half dozen of porters are lounging on the dirty steps--the hall swarms with dingy guests of oriental countenance, who thrust printed cards into your hand, and offer to bid. Old women and amateurs have invaded the upper apartments, pinching the bed-curtains, poking into the feathers, shampooing the mattresses, and clapping the wardrobe drawers to and fro. Enterprising young housekeepers are measuring the looking-glasses and hangings to see if they will suit the new menage (Snob will brag for years that he has purchased this or that at Dives's sale), and Mr. Hammerdown is sitting on the great mahogany dining-tables, in the dining-room below, waving the ivory hammer, and employing all the artifices of eloquence, enthusiasm, entreaty, reason, despair; shouting to his people; satirizing Mr. Davids for his sluggishness; inspiriting Mr. Moss into action; imploring, commanding, bellowing, until down comes the hammer like fate, and we pass to the next lot. O Dives, who would ever have thought, as we sat round the broad table sparkling with plate and spotless linen, to have seen such a dish at the head of it as that roaring auctioneer?\nIt was rather late in the sale. The excellent drawing-room furniture by the best makers; the rare and famous wines selected, regardless of cost, and with the well-known taste of the purchaser; the rich and complete set of family plate had been sold on the previous days. Certain of the best wines (which all had a great character among amateurs in the neighbourhood) had been purchased for his master, who knew them very well, by the butler of our friend John Osborne, Esquire, of Russell Square. A small portion of the most useful articles of the plate had been bought by some young stockbrokers from the City. And now the public being invited to the purchase of minor objects, it happened that the orator on the table was expatiating on the merits of a picture, which he sought to recommend to his audience: it was by no means so select or numerous a company as had attended the previous days of the auction.\n\"No. 369,\" roared Mr. Hammerdown. \"Portrait of a gentleman on an elephant. Who'll bid for the gentleman on the elephant? Lift up the picture, Blowman, and let the company examine this lot.\" A long, pale, military-looking gentleman, seated demurely at the mahogany table, could not help grinning as this valuable lot was shown by Mr. Blowman. \"Turn the elephant to the Captain, Blowman. What shall we say, sir, for the elephant?\" but the Captain, blushing in a very hurried and discomfited manner, turned away his head.\n\"Shall we say twenty guineas for this work of art?--fifteen, five, name your own price. The gentleman without the elephant is worth five pound.\"\n\"I wonder it ain't come down with him,\" said a professional wag, \"he's anyhow a precious big one\"; at which (for the elephant-rider was represented as of a very stout figure) there was a general giggle in the room.\n\"Don't be trying to deprecate the value of the lot, Mr. Moss,\" Mr. Hammerdown said; \"let the company examine it as a work of art--the attitude of the gallant animal quite according to natur'; the gentleman in a nankeen jacket, his gun in his hand, is going to the chase; in the distance a banyhann tree and a pagody, most likely resemblances of some interesting spot in our famous Eastern possessions. How much for this lot? Come, gentlemen, don't keep me here all day.\"\nSome one bid five shillings, at which the military gentleman looked towards the quarter from which this splendid offer had come, and there saw another officer with a young lady on his arm, who both appeared to be highly amused with the scene, and to whom, finally, this lot was knocked down for half a guinea. He at the table looked more surprised and discomposed than ever when he spied this pair, and his head sank into his military collar, and he turned his back upon them, so as to avoid them altogether.\nOf all the other articles which Mr. Hammerdown had the honour to offer for public competition that day it is not our purpose to make mention, save of one only, a little square piano, which came down from the upper regions of the house (the state grand piano having been disposed of previously); this the young lady tried with a rapid and skilful hand (making the officer blush and start again), and for it, when its turn came, her agent began to bid.\nBut there was an opposition here. The Hebrew aide-de-camp in the service of the officer at the table bid against the Hebrew gentleman employed by the elephant purchasers, and a brisk battle ensued over this little piano, the combatants being greatly encouraged by Mr. Hammerdown.\nAt last, when the competition had been prolonged for some time, the elephant captain and lady desisted from the race; and the hammer coming down, the auctioneer said:--\"Mr. Lewis, twenty-five,\" and Mr. Lewis's chief thus became the proprietor of the little square piano. Having effected the purchase, he sate up as if he was greatly relieved, and the unsuccessful competitors catching a glimpse of him at this moment, the lady said to her friend,\n\"Why, Rawdon, it's Captain Dobbin.\"\nI suppose Becky was discontented with the new piano her husband had hired for her, or perhaps the proprietors of that instrument had fetched it away, declining farther credit, or perhaps she had a particular attachment for the one which she had just tried to purchase, recollecting it in old days, when she used to play upon it, in the little sitting-room of our dear Amelia Sedley.\nThe sale was at the old house in Russell Square, where we passed some evenings together at the beginning of this story. Good old John Sedley was a ruined man. His name had been proclaimed as a defaulter on the Stock Exchange, and his bankruptcy and commercial extermination had followed. Mr. Osborne's butler came to buy some of the famous port wine to transfer to the cellars over the way. As for one dozen well-manufactured silver spoons and forks at per oz., and one dozen dessert ditto ditto, there were three young stockbrokers (Messrs. Dale, Spiggot, and Dale, of Threadneedle Street, indeed), who, having had dealings with the old man, and kindnesses from him in days when he was kind to everybody with whom he dealt, sent this little spar out of the wreck with their love to good Mrs. Sedley; and with respect to the piano, as it had been Amelia's, and as she might miss it and want one now, and as Captain William Dobbin could no more play upon it than he could dance on the tight rope, it is probable that he did not purchase the instrument for his own use.\nIn a word, it arrived that evening at a wonderful small cottage in a street leading from the Fulham Road--one of those streets which have the finest romantic names--(this was called St. Adelaide Villas, Anna-Maria Road West), where the houses look like baby-houses; where the people, looking out of the first-floor windows, must infallibly, as you think, sit with their feet in the parlours; where the shrubs in the little gardens in front bloom with a perennial display of little children's pinafores, little red socks, caps, &c. (polyandria polygynia); whence you hear the sound of jingling spinets and women singing; where little porter pots hang on the railings sunning themselves; whither of evenings you see City clerks padding wearily: here it was that Mr. Clapp, the clerk of Mr. Sedley, had his domicile, and in this asylum the good old gentleman hid his head with his wife and daughter when the crash came.\nJos Sedley had acted as a man of his disposition would, when the announcement of the family misfortune reached him. He did not come to London, but he wrote to his mother to draw upon his agents for whatever money was wanted, so that his kind broken-spirited old parents had no present poverty to fear. This done, Jos went on at the boarding-house at Cheltenham pretty much as before. He drove his curricle; he drank his claret; he played his rubber; he told his Indian stories, and the Irish widow consoled and flattered him as usual. His present of money, needful as it was, made little impression on his parents; and I have heard Amelia say that the first day on which she saw her father lift up his head after the failure was on the receipt of the packet of forks and spoons with the young stockbrokers' love, over which he burst out crying like a child, being greatly more affected than even his wife, to whom the present was addressed. Edward Dale, the junior of the house, who purchased the spoons for the firm, was, in fact, very sweet upon Amelia, and offered for her in spite of all. He married Miss Louisa Cutts (daughter of Higham and Cutts, the eminent cornfactors) with a handsome fortune in 1820; and is now living in splendour, and with a numerous family, at his elegant villa, Muswell Hill. But we must not let the recollections of this good fellow cause us to diverge from the principal history.\nI hope the reader has much too good an opinion of Captain and Mrs. Crawley to suppose that they ever would have dreamed of paying a visit to so remote a district as Bloomsbury, if they thought the family whom they proposed to honour with a visit were not merely out of fashion, but out of money, and could be serviceable to them in no possible manner. Rebecca was entirely surprised at the sight of the comfortable old house where she had met with no small kindness, ransacked by brokers and bargainers, and its quiet family treasures given up to public desecration and plunder. A month after her flight, she had bethought her of Amelia, and Rawdon, with a horse-laugh, had expressed a perfect willingness to see young George Osborne again. \"He's a very agreeable acquaintance, Beck,\" the wag added. \"I'd like to sell him another horse, Beck. I'd like to play a few more games at billiards with him. He'd be what I call useful just now, Mrs. C.--ha, ha!\" by which sort of speech it is not to be supposed that Rawdon Crawley had a deliberate desire to cheat Mr. Osborne at play, but only wished to take that fair advantage of him which almost every sporting gentleman in Vanity Fair considers to be his due from his neighbour.\nThe old aunt was long in \"coming-to.\" A month had elapsed. Rawdon was denied the door by Mr. Bowls; his servants could not get a lodgment in the house at Park Lane; his letters were sent back unopened. Miss Crawley never stirred out--she was unwell--and Mrs. Bute remained still and never left her. Crawley and his wife both of them augured evil from the continued presence of Mrs. Bute.\n\"Gad, I begin to perceive now why she was always bringing us together at Queen's Crawley,\" Rawdon said.\n\"What an artful little woman!\" ejaculated Rebecca.\n\"Well, I don't regret it, if you don't,\" the Captain cried, still in an amorous rapture with his wife, who rewarded him with a kiss by way of reply, and was indeed not a little gratified by the generous confidence of her husband.\n\"If he had but a little more brains,\" she thought to herself, \"I might make something of him\"; but she never let him perceive the opinion she had of him; listened with indefatigable complacency to his stories of the stable and the mess; laughed at all his jokes; felt the greatest interest in Jack Spatterdash, whose cab-horse had come down, and Bob Martingale, who had been taken up in a gambling-house, and Tom Cinqbars, who was going to ride the steeplechase. When he came home she was alert and happy: when he went out she pressed him to go: when he stayed at home, she played and sang for him, made him good drinks, superintended his dinner, warmed his slippers, and steeped his soul in comfort. The best of women (I have heard my grandmother say) are hypocrites. We don't know how much they hide from us: how watchful they are when they seem most artless and confidential: how often those frank smiles which they wear so easily, are traps to cajole or elude or disarm--I don't mean in your mere coquettes, but your domestic models, and paragons of female virtue. Who has not seen a woman hide the dulness of a stupid husband, or coax the fury of a savage one? We accept this amiable slavishness, and praise a woman for it: we call this pretty treachery truth. A good housewife is of necessity a humbug; and Cornelia's husband was hoodwinked, as Potiphar was--only in a different way.\nBy these attentions, that veteran rake, Rawdon Crawley, found himself converted into a very happy and submissive married man. His former haunts knew him not. They asked about him once or twice at his clubs, but did not miss him much: in those booths of Vanity Fair people seldom do miss each other. His secluded wife ever smiling and cheerful, his little comfortable lodgings, snug meals, and homely evenings, had all the charms of novelty and secrecy. The marriage was not yet declared to the world, or published in the Morning Post. All his creditors would have come rushing on him in a body, had they known that he was united to a woman without fortune. \"My relations won't cry fie upon me,\" Becky said, with rather a bitter laugh; and she was quite contented to wait until the old aunt should be reconciled, before she claimed her place in society. So she lived at Brompton, and meanwhile saw no one, or only those few of her husband's male companions who were admitted into her little dining-room. These were all charmed with her. The little dinners, the laughing and chatting, the music afterwards, delighted all who participated in these enjoyments. Major Martingale never thought about asking to see the marriage licence, Captain Cinqbars was perfectly enchanted with her skill in making punch. And young Lieutenant Spatterdash (who was fond of piquet, and whom Crawley would often invite) was evidently and quickly smitten by Mrs. Crawley; but her own circumspection and modesty never forsook her for a moment, and Crawley's reputation as a fire-eating and jealous warrior was a further and complete defence to his little wife.\nThere are gentlemen of very good blood and fashion in this city, who never have entered a lady's drawing-room; so that though Rawdon Crawley's marriage might be talked about in his county, where, of course, Mrs. Bute had spread the news, in London it was doubted, or not heeded, or not talked about at all. He lived comfortably on credit. He had a large capital of debts, which laid out judiciously, will carry a man along for many years, and on which certain men about town contrive to live a hundred times better than even men with ready money can do. Indeed who is there that walks London streets, but can point out a half-dozen of men riding by him splendidly, while he is on foot, courted by fashion, bowed into their carriages by tradesmen, denying themselves nothing, and living on who knows what? We see Jack Thriftless prancing in the park, or darting in his brougham down Pall Mall: we eat his dinners served on his miraculous plate. \"How did this begin,\" we say, \"or where will it end?\" \"My dear fellow,\" I heard Jack once say, \"I owe money in every capital in Europe.\" The end must come some day, but in the meantime Jack thrives as much as ever; people are glad enough to shake him by the hand, ignore the little dark stories that are whispered every now and then against him, and pronounce him a good-natured, jovial, reckless fellow.\nTruth obliges us to confess that Rebecca had married a gentleman of this order. Everything was plentiful in his house but ready money, of which their menage pretty early felt the want; and reading the Gazette one day, and coming upon the announcement of \"Lieutenant G. Osborne to be Captain by purchase, vice Smith, who exchanges,\" Rawdon uttered that sentiment regarding Amelia's lover, which ended in the visit to Russell Square.\nWhen Rawdon and his wife wished to communicate with Captain Dobbin at the sale, and to know particulars of the catastrophe which had befallen Rebecca's old acquaintances, the Captain had vanished; and such information as they got was from a stray porter or broker at the auction.\n\"Look at them with their hooked beaks,\" Becky said, getting into the buggy, her picture under her arm, in great glee. \"They're like vultures after a battle.\"\n\"Don't know. Never was in action, my dear. Ask Martingale; he was in Spain, aide-de-camp to General Blazes.\"\n\"He was a very kind old man, Mr. Sedley,\" Rebecca said; \"I'm really sorry he's gone wrong.\"\n\"O stockbrokers--bankrupts--used to it, you know,\" Rawdon replied, cutting a fly off the horse's ear.\n\"I wish we could have afforded some of the plate, Rawdon,\" the wife continued sentimentally. \"Five-and-twenty guineas was monstrously dear for that little piano. We chose it at Broadwood's for Amelia, when she came from school. It only cost five-and-thirty then.\"\n\"What-d'-ye-call'em--'Osborne,' will cry off now, I suppose, since the family is smashed. How cut up your pretty little friend will be; hey, Becky?\"\n\"I daresay she'll recover it,\" Becky said with a smile--and they drove on and talked about something else.",
        "paragraph_chars": [
            [
                0,
                936
            ],
            [
                936,
                2380
            ],
            [
                2380,
                3726
            ],
            [
                3726,
                4637
            ],
            [
                4637,
                5156
            ],
            [
                5156,
                5301
            ],
            [
                5301,
                5516
            ],
            [
                5516,
                5987
            ],
            [
                5987,
                6496
            ],
            [
                6496,
                6947
            ],
            [
                6947,
                7227
            ],
            [
                7227,
                7674
            ],
            [
                7674,
                7710
            ],
            [
                7710,
                8093
            ],
            [
                8093,
                9161
            ],
            [
                9161,
                10078
            ],
            [
                10078,
                11491
            ],
            [
                11491,
                12717
            ],
            [
                12717,
                13105
            ],
            [
                13105,
                13209
            ],
            [
                13209,
                13260
            ],
            [
                13260,
                13490
            ],
            [
                13490,
                14880
            ],
            [
                14880,
                16517
            ],
            [
                16517,
                17866
            ],
            [
                17866,
                18298
            ],
            [
                18298,
                18578
            ],
            [
                18578,
                18736
            ],
            [
                18736,
                18845
            ],
            [
                18845,
                18937
            ],
            [
                18937,
                19039
            ],
            [
                19039,
                19303
            ],
            [
                19303,
                19452
            ],
            [
                19452,
                19558
            ]
        ],
        "segment_chars": [
            [
                0,
                458
            ],
            [
                458,
                936
            ],
            [
                936,
                1111
            ],
            [
                1111,
                1301
            ],
            [
                1301,
                1694
            ],
            [
                1694,
                1767
            ],
            [
                1767,
                1934
            ],
            [
                1934,
                1999
            ],
            [
                1999,
                2084
            ],
            [
                2084,
                2161
            ],
            [
                2161,
                2380
            ],
            [
                2380,
                2414
            ],
            [
                2414,
                2520
            ],
            [
                2520,
                2755
            ],
            [
                2755,
                2939
            ],
            [
                2939,
                3544
            ],
            [
                3544,
                3726
            ],
            [
                3726,
                3758
            ],
            [
                3758,
                3997
            ],
            [
                3997,
                4223
            ],
            [
                4223,
                4338
            ],
            [
                4338,
                4637
            ],
            [
                4637,
                4642
            ],
            [
                4642,
                4671
            ],
            [
                4671,
                4712
            ],
            [
                4712,
                4758
            ],
            [
                4758,
                4827
            ],
            [
                4827,
                4979
            ],
            [
                4979,
                5023
            ],
            [
                5023,
                5066
            ],
            [
                5066,
                5156
            ],
            [
                5156,
                5244
            ],
            [
                5244,
                5301
            ],
            [
                5301,
                5516
            ],
            [
                5516,
                5918
            ],
            [
                5918,
                5941
            ],
            [
                5941,
                5987
            ],
            [
                5987,
                6297
            ],
            [
                6297,
                6496
            ],
            [
                6496,
                6947
            ],
            [
                6947,
                6981
            ],
            [
                6981,
                7227
            ],
            [
                7227,
                7498
            ],
            [
                7498,
                7674
            ],
            [
                7674,
                7710
            ],
            [
                7710,
                8093
            ],
            [
                8093,
                8213
            ],
            [
                8213,
                8252
            ],
            [
                8252,
                8381
            ],
            [
                8381,
                8484
            ],
            [
                8484,
                9161
            ],
            [
                9161,
                10078
            ],
            [
                10078,
                10194
            ],
            [
                10194,
                10380
            ],
            [
                10380,
                10462
            ],
            [
                10462,
                10613
            ],
            [
                10613,
                11019
            ],
            [
                11019,
                11171
            ],
            [
                11171,
                11385
            ],
            [
                11385,
                11491
            ],
            [
                11491,
                11843
            ],
            [
                11843,
                12070
            ],
            [
                12070,
                12232
            ],
            [
                12232,
                12291
            ],
            [
                12291,
                12334
            ],
            [
                12334,
                12391
            ],
            [
                12391,
                12446
            ],
            [
                12446,
                12717
            ],
            [
                12717,
                12755
            ],
            [
                12755,
                12776
            ],
            [
                12776,
                12919
            ],
            [
                12919,
                13016
            ],
            [
                13016,
                13105
            ],
            [
                13105,
                13209
            ],
            [
                13209,
                13240
            ],
            [
                13240,
                13260
            ],
            [
                13260,
                13490
            ],
            [
                13490,
                13953
            ],
            [
                13953,
                14191
            ],
            [
                14191,
                14259
            ],
            [
                14259,
                14559
            ],
            [
                14559,
                14656
            ],
            [
                14656,
                14756
            ],
            [
                14756,
                14880
            ],
            [
                14880,
                15006
            ],
            [
                15006,
                15038
            ],
            [
                15038,
                15179
            ],
            [
                15179,
                15333
            ],
            [
                15333,
                15415
            ],
            [
                15415,
                15537
            ],
            [
                15537,
                15733
            ],
            [
                15733,
                15883
            ],
            [
                15883,
                15916
            ],
            [
                15916,
                16037
            ],
            [
                16037,
                16183
            ],
            [
                16183,
                16517
            ],
            [
                16517,
                16824
            ],
            [
                16824,
                16856
            ],
            [
                16856,
                17071
            ],
            [
                17071,
                17322
            ],
            [
                17322,
                17461
            ],
            [
                17461,
                17515
            ],
            [
                17515,
                17598
            ],
            [
                17598,
                17866
            ],
            [
                17866,
                17946
            ],
            [
                17946,
                18298
            ],
            [
                18298,
                18578
            ],
            [
                18578,
                18696
            ],
            [
                18696,
                18736
            ],
            [
                18736,
                18749
            ],
            [
                18749,
                18779
            ],
            [
                18779,
                18845
            ],
            [
                18845,
                18937
            ],
            [
                18937,
                19039
            ],
            [
                19039,
                19132
            ],
            [
                19132,
                19201
            ],
            [
                19201,
                19267
            ],
            [
                19267,
                19303
            ],
            [
                19303,
                19393
            ],
            [
                19393,
                19452
            ],
            [
                19452,
                19558
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                27,
                29
            ],
            [
                34,
                45
            ],
            [
                104,
                109
            ],
            [
                52,
                72
            ],
            [
                83,
                102
            ],
            [
                206,
                207
            ],
            [
                254,
                282
            ],
            [
                306,
                336
            ],
            [
                120,
                122
            ],
            [
                340,
                377
            ],
            [
                675,
                679
            ],
            [
                711,
                725
            ],
            [
                846,
                869
            ],
            [
                870,
                897
            ],
            [
                908,
                916
            ],
            [
                123,
                126
            ],
            [
                926,
                934
            ],
            [
                208,
                210
            ],
            [
                934,
                936
            ],
            [
                936,
                940
            ],
            [
                946,
                962
            ],
            [
                980,
                994
            ],
            [
                1078,
                1087
            ],
            [
                1109,
                1111
            ],
            [
                1111,
                1159
            ],
            [
                1228,
                1231
            ],
            [
                1274,
                1276
            ],
            [
                1299,
                1301
            ],
            [
                1301,
                1372
            ],
            [
                1694,
                1710
            ],
            [
                1719,
                1727
            ],
            [
                1716,
                1718
            ],
            [
                1761,
                1767
            ],
            [
                1999,
                2012
            ],
            [
                1941,
                1948
            ],
            [
                2013,
                2051
            ],
            [
                2052,
                2084
            ],
            [
                2084,
                2147
            ],
            [
                2159,
                2160
            ],
            [
                2380,
                2414
            ],
            [
                2414,
                2444
            ],
            [
                2485,
                2498
            ],
            [
                2499,
                2520
            ],
            [
                2520,
                2578
            ],
            [
                2596,
                2635
            ],
            [
                2637,
                2670
            ],
            [
                2753,
                2755
            ],
            [
                2755,
                2764
            ],
            [
                2778,
                2800
            ],
            [
                2811,
                2865
            ],
            [
                2893,
                2939
            ],
            [
                2939,
                3017
            ],
            [
                3202,
                3203
            ],
            [
                3137,
                3196
            ],
            [
                3228,
                3258
            ],
            [
                3269,
                3272
            ],
            [
                3352,
                3355
            ],
            [
                3290,
                3299
            ],
            [
                3440,
                3543
            ],
            [
                3726,
                3747
            ],
            [
                3752,
                3758
            ],
            [
                3758,
                3771
            ],
            [
                3785,
                3794
            ],
            [
                3849,
                3850
            ],
            [
                3815,
                3840
            ],
            [
                3869,
                3870
            ],
            [
                3919,
                3997
            ],
            [
                4005,
                4016
            ],
            [
                4093,
                4126
            ],
            [
                4151,
                4194
            ],
            [
                4204,
                4223
            ],
            [
                4223,
                4238
            ],
            [
                4267,
                4338
            ],
            [
                4338,
                4345
            ],
            [
                4488,
                4489
            ],
            [
                4346,
                4349
            ],
            [
                4387,
                4404
            ],
            [
                4374,
                4377
            ],
            [
                4446,
                4453
            ],
            [
                4465,
                4488
            ],
            [
                4371,
                4373
            ],
            [
                4526,
                4534
            ],
            [
                4417,
                4421
            ],
            [
                4539,
                4542
            ],
            [
                4555,
                4564
            ],
            [
                4587,
                4589
            ],
            [
                4433,
                4435
            ],
            [
                4603,
                4637
            ],
            [
                4637,
                4642
            ],
            [
                4642,
                4671
            ],
            [
                4671,
                4712
            ],
            [
                4712,
                4758
            ],
            [
                4758,
                4786
            ],
            [
                4824,
                4826
            ],
            [
                4827,
                4875
            ],
            [
                4885,
                4978
            ],
            [
                4979,
                5023
            ],
            [
                5023,
                5065
            ],
            [
                5070,
                5091
            ],
            [
                5132,
                5156
            ],
            [
                5156,
                5184
            ],
            [
                5208,
                5232
            ],
            [
                5237,
                5244
            ],
            [
                5244,
                5301
            ],
            [
                5366,
                5371
            ],
            [
                5379,
                5397
            ],
            [
                5338,
                5364
            ],
            [
                5400,
                5408
            ],
            [
                5476,
                5516
            ],
            [
                5918,
                5941
            ],
            [
                5941,
                5987
            ],
            [
                5996,
                6014
            ],
            [
                6025,
                6028
            ],
            [
                6138,
                6179
            ],
            [
                6180,
                6184
            ],
            [
                6200,
                6213
            ],
            [
                6228,
                6297
            ],
            [
                6300,
                6319
            ],
            [
                6339,
                6350
            ],
            [
                6361,
                6389
            ],
            [
                6434,
                6462
            ],
            [
                6494,
                6496
            ],
            [
                6496,
                6542
            ],
            [
                6590,
                6598
            ],
            [
                6636,
                6637
            ],
            [
                6629,
                6636
            ],
            [
                6650,
                6654
            ],
            [
                6646,
                6649
            ],
            [
                6654,
                6677
            ],
            [
                6731,
                6735
            ],
            [
                6742,
                6753
            ],
            [
                6543,
                6546
            ],
            [
                6761,
                6788
            ],
            [
                6796,
                6816
            ],
            [
                6791,
                6795
            ],
            [
                6817,
                6823
            ],
            [
                6834,
                6846
            ],
            [
                6677,
                6678
            ],
            [
                6830,
                6833
            ],
            [
                6903,
                6947
            ],
            [
                6947,
                6979
            ],
            [
                7023,
                7047
            ],
            [
                6979,
                6980
            ],
            [
                7122,
                7167
            ],
            [
                7197,
                7227
            ],
            [
                7227,
                7234
            ],
            [
                7291,
                7303
            ],
            [
                7312,
                7315
            ],
            [
                7316,
                7320
            ],
            [
                7335,
                7352
            ],
            [
                7304,
                7311
            ],
            [
                7448,
                7458
            ],
            [
                7470,
                7498
            ],
            [
                7528,
                7530
            ],
            [
                7536,
                7551
            ],
            [
                7560,
                7602
            ],
            [
                7612,
                7628
            ],
            [
                7645,
                7674
            ],
            [
                7674,
                7710
            ],
            [
                7720,
                7803
            ],
            [
                7839,
                7858
            ],
            [
                7992,
                7994
            ],
            [
                7886,
                7968
            ],
            [
                7977,
                7991
            ],
            [
                7998,
                8006
            ],
            [
                8008,
                8037
            ],
            [
                8039,
                8045
            ],
            [
                8053,
                8093
            ],
            [
                8093,
                8112
            ],
            [
                8117,
                8140
            ],
            [
                8211,
                8213
            ],
            [
                8213,
                8252
            ],
            [
                8252,
                8337
            ],
            [
                8367,
                8380
            ],
            [
                8381,
                8484
            ],
            [
                8484,
                8500
            ],
            [
                8519,
                8542
            ],
            [
                8588,
                8589
            ],
            [
                8601,
                8682
            ],
            [
                8693,
                8696
            ],
            [
                8705,
                8708
            ],
            [
                8740,
                8755
            ],
            [
                8723,
                8734
            ],
            [
                8760,
                8762
            ],
            [
                8763,
                8767
            ],
            [
                8816,
                8892
            ],
            [
                8914,
                8956
            ],
            [
                9000,
                9041
            ],
            [
                9047,
                9091
            ],
            [
                9104,
                9119
            ],
            [
                8972,
                8974
            ],
            [
                9144,
                9161
            ],
            [
                9299,
                9302
            ],
            [
                9175,
                9200
            ],
            [
                9211,
                9236
            ],
            [
                9250,
                9265
            ],
            [
                9170,
                9171
            ],
            [
                9520,
                9524
            ],
            [
                9732,
                9735
            ],
            [
                9310,
                9318
            ],
            [
                9271,
                9273
            ],
            [
                9343,
                9362
            ],
            [
                9690,
                9691
            ],
            [
                9393,
                9403
            ],
            [
                9404,
                9426
            ],
            [
                9433,
                9443
            ],
            [
                9445,
                9489
            ],
            [
                9362,
                9363
            ],
            [
                9505,
                9508
            ],
            [
                9509,
                9515
            ],
            [
                9294,
                9298
            ],
            [
                9525,
                9551
            ],
            [
                9559,
                9591
            ],
            [
                9601,
                9634
            ],
            [
                9642,
                9652
            ],
            [
                9973,
                9978
            ],
            [
                9635,
                9641
            ],
            [
                9801,
                9845
            ],
            [
                9443,
                9444
            ],
            [
                9161,
                9163
            ],
            [
                9932,
                9935
            ],
            [
                9858,
                9866
            ],
            [
                9500,
                9501
            ],
            [
                9867,
                9902
            ],
            [
                9902,
                9931
            ],
            [
                9945,
                9955
            ],
            [
                9936,
                9941
            ],
            [
                9662,
                9663
            ],
            [
                9680,
                9681
            ],
            [
                9697,
                9700
            ],
            [
                9994,
                10020
            ],
            [
                10030,
                10078
            ],
            [
                10078,
                10088
            ],
            [
                10132,
                10138
            ],
            [
                10156,
                10192
            ],
            [
                10197,
                10233
            ],
            [
                10237,
                10250
            ],
            [
                10261,
                10275
            ],
            [
                10285,
                10290
            ],
            [
                10301,
                10305
            ],
            [
                10111,
                10114
            ],
            [
                10320,
                10335
            ],
            [
                10340,
                10380
            ],
            [
                10380,
                10462
            ],
            [
                10462,
                10508
            ],
            [
                10531,
                10554
            ],
            [
                10611,
                10613
            ],
            [
                10613,
                10692
            ],
            [
                10740,
                10742
            ],
            [
                10825,
                10890
            ],
            [
                10905,
                10934
            ],
            [
                11017,
                11018
            ],
            [
                11843,
                11850
            ],
            [
                11926,
                11929
            ],
            [
                11855,
                11915
            ],
            [
                11958,
                11970
            ],
            [
                11983,
                11994
            ],
            [
                11999,
                12044
            ],
            [
                12061,
                12070
            ],
            [
                12070,
                12103
            ],
            [
                12106,
                12113
            ],
            [
                12118,
                12139
            ],
            [
                12161,
                12164
            ],
            [
                12197,
                12203
            ],
            [
                12210,
                12231
            ],
            [
                12232,
                12273
            ],
            [
                12289,
                12291
            ],
            [
                12292,
                12327
            ],
            [
                12346,
                12391
            ],
            [
                12391,
                12398
            ],
            [
                12411,
                12426
            ],
            [
                12437,
                12446
            ],
            [
                12470,
                12514
            ],
            [
                12578,
                12584
            ],
            [
                12539,
                12577
            ],
            [
                12585,
                12717
            ],
            [
                12717,
                12729
            ],
            [
                12755,
                12776
            ],
            [
                12776,
                12782
            ],
            [
                12886,
                12919
            ],
            [
                12919,
                12949
            ],
            [
                12951,
                12965
            ],
            [
                12967,
                12980
            ],
            [
                13000,
                13016
            ],
            [
                13016,
                13041
            ],
            [
                13050,
                13105
            ],
            [
                13105,
                13121
            ],
            [
                13131,
                13208
            ],
            [
                13260,
                13261
            ],
            [
                13267,
                13298
            ],
            [
                13301,
                13312
            ],
            [
                13320,
                13391
            ],
            [
                13407,
                13423
            ],
            [
                13437,
                13490
            ],
            [
                13490,
                13582
            ],
            [
                13585,
                13615
            ],
            [
                13620,
                13627
            ],
            [
                13628,
                13631
            ],
            [
                13644,
                13652
            ],
            [
                13684,
                13751
            ],
            [
                13830,
                13835
            ],
            [
                13758,
                13782
            ],
            [
                13951,
                13953
            ],
            [
                13953,
                14110
            ],
            [
                14125,
                14190
            ],
            [
                14191,
                14259
            ],
            [
                14259,
                14322
            ],
            [
                14367,
                14397
            ],
            [
                14425,
                14447
            ],
            [
                14457,
                14463
            ],
            [
                14423,
                14424
            ],
            [
                14478,
                14480
            ],
            [
                14532,
                14559
            ],
            [
                14559,
                14592
            ],
            [
                14596,
                14656
            ],
            [
                14656,
                14717
            ],
            [
                14754,
                14756
            ],
            [
                14756,
                14797
            ],
            [
                14878,
                14880
            ],
            [
                14920,
                14934
            ],
            [
                14936,
                14949
            ],
            [
                14965,
                15006
            ],
            [
                15006,
                15038
            ],
            [
                15038,
                15112
            ],
            [
                15177,
                15179
            ],
            [
                15179,
                15182
            ],
            [
                15214,
                15222
            ],
            [
                15192,
                15196
            ],
            [
                15222,
                15267
            ],
            [
                15269,
                15288
            ],
            [
                15290,
                15333
            ],
            [
                15333,
                15379
            ],
            [
                15419,
                15463
            ],
            [
                15379,
                15380
            ],
            [
                15479,
                15483
            ],
            [
                15475,
                15478
            ],
            [
                15484,
                15536
            ],
            [
                15773,
                15776
            ],
            [
                15788,
                15792
            ],
            [
                15599,
                15600
            ],
            [
                15799,
                15835
            ],
            [
                15585,
                15586
            ],
            [
                15836,
                15839
            ],
            [
                15889,
                15916
            ],
            [
                15916,
                15952
            ],
            [
                16183,
                16186
            ],
            [
                15967,
                15972
            ],
            [
                15983,
                15994
            ],
            [
                15963,
                15966
            ],
            [
                16327,
                16336
            ],
            [
                16360,
                16441
            ],
            [
                16454,
                16475
            ],
            [
                16489,
                16517
            ],
            [
                16643,
                16657
            ],
            [
                16827,
                16856
            ],
            [
                16856,
                16954
            ],
            [
                17069,
                17071
            ],
            [
                17946,
                18009
            ],
            [
                18023,
                18029
            ],
            [
                18036,
                18044
            ],
            [
                18296,
                18298
            ],
            [
                18055,
                18087
            ],
            [
                18100,
                18168
            ],
            [
                18195,
                18204
            ],
            [
                18213,
                18217
            ],
            [
                18252,
                18296
            ],
            [
                18051,
                18054
            ],
            [
                18298,
                18322
            ],
            [
                18330,
                18332
            ],
            [
                18350,
                18364
            ],
            [
                18405,
                18439
            ],
            [
                18368,
                18371
            ],
            [
                18467,
                18551
            ],
            [
                18576,
                18578
            ],
            [
                18696,
                18733
            ],
            [
                18615,
                18617
            ],
            [
                18624,
                18628
            ],
            [
                18618,
                18623
            ],
            [
                18694,
                18695
            ],
            [
                18736,
                18749
            ],
            [
                18749,
                18777
            ],
            [
                18777,
                18778
            ],
            [
                18845,
                18937
            ],
            [
                18937,
                18952
            ],
            [
                18962,
                18963
            ],
            [
                18965,
                19002
            ],
            [
                19037,
                19039
            ],
            [
                19039,
                19087
            ],
            [
                19095,
                19132
            ],
            [
                19132,
                19201
            ],
            [
                19267,
                19295
            ],
            [
                19240,
                19244
            ],
            [
                19232,
                19238
            ],
            [
                19204,
                19221
            ],
            [
                19300,
                19303
            ],
            [
                19303,
                19304
            ],
            [
                19325,
                19332
            ],
            [
                19335,
                19362
            ],
            [
                19391,
                19393
            ],
            [
                19393,
                19437
            ],
            [
                19439,
                19452
            ],
            [
                19452,
                19477
            ],
            [
                19480,
                19506
            ],
            [
                19508,
                19558
            ]
        ],
        "row_chars": [
            [
                0,
                936
            ],
            [
                936,
                1111
            ],
            [
                1111,
                1301
            ],
            [
                1301,
                1694
            ],
            [
                1694,
                1767
            ],
            [
                1767,
                1934
            ],
            [
                1934,
                2084
            ],
            [
                2084,
                2161
            ],
            [
                2161,
                2380
            ],
            [
                2380,
                2414
            ],
            [
                2414,
                2520
            ],
            [
                2520,
                2755
            ],
            [
                2755,
                2939
            ],
            [
                2939,
                3544
            ],
            [
                3544,
                3726
            ],
            [
                3726,
                3758
            ],
            [
                3758,
                3997
            ],
            [
                3997,
                4223
            ],
            [
                4223,
                4338
            ],
            [
                4338,
                4637
            ],
            [
                4637,
                4642
            ],
            [
                4642,
                4671
            ],
            [
                4671,
                4712
            ],
            [
                4712,
                4758
            ],
            [
                4758,
                4827
            ],
            [
                4827,
                4979
            ],
            [
                4979,
                5023
            ],
            [
                5023,
                5066
            ],
            [
                5066,
                5156
            ],
            [
                5156,
                5244
            ],
            [
                5244,
                5301
            ],
            [
                5301,
                5516
            ],
            [
                5516,
                5918
            ],
            [
                5918,
                5941
            ],
            [
                5941,
                5987
            ],
            [
                5987,
                6297
            ],
            [
                6297,
                6496
            ],
            [
                6496,
                6947
            ],
            [
                6947,
                7227
            ],
            [
                7227,
                7498
            ],
            [
                7498,
                7674
            ],
            [
                7674,
                7710
            ],
            [
                7710,
                8093
            ],
            [
                8093,
                8213
            ],
            [
                8213,
                8252
            ],
            [
                8252,
                8381
            ],
            [
                8381,
                8484
            ],
            [
                8484,
                9161
            ],
            [
                9161,
                10078
            ],
            [
                10078,
                10380
            ],
            [
                10380,
                10462
            ],
            [
                10462,
                10613
            ],
            [
                10613,
                11019
            ],
            [
                11019,
                11171
            ],
            [
                11171,
                11385
            ],
            [
                11385,
                11491
            ],
            [
                11491,
                11843
            ],
            [
                11843,
                12070
            ],
            [
                12070,
                12232
            ],
            [
                12232,
                12291
            ],
            [
                12291,
                12391
            ],
            [
                12391,
                12446
            ],
            [
                12446,
                12717
            ],
            [
                12717,
                12776
            ],
            [
                12776,
                12919
            ],
            [
                12919,
                13016
            ],
            [
                13016,
                13105
            ],
            [
                13105,
                13209
            ],
            [
                13209,
                13240
            ],
            [
                13240,
                13260
            ],
            [
                13260,
                13490
            ],
            [
                13490,
                13953
            ],
            [
                13953,
                14191
            ],
            [
                14191,
                14259
            ],
            [
                14259,
                14559
            ],
            [
                14559,
                14656
            ],
            [
                14656,
                14756
            ],
            [
                14756,
                14880
            ],
            [
                14880,
                15006
            ],
            [
                15006,
                15038
            ],
            [
                15038,
                15179
            ],
            [
                15179,
                15333
            ],
            [
                15333,
                15537
            ],
            [
                15537,
                15916
            ],
            [
                15916,
                16517
            ],
            [
                16517,
                16856
            ],
            [
                16856,
                17071
            ],
            [
                17071,
                17322
            ],
            [
                17322,
                17461
            ],
            [
                17461,
                17515
            ],
            [
                17515,
                17598
            ],
            [
                17598,
                17866
            ],
            [
                17866,
                17946
            ],
            [
                17946,
                18298
            ],
            [
                18298,
                18578
            ],
            [
                18578,
                18736
            ],
            [
                18736,
                18749
            ],
            [
                18749,
                18779
            ],
            [
                18779,
                18845
            ],
            [
                18845,
                18937
            ],
            [
                18937,
                19039
            ],
            [
                19039,
                19132
            ],
            [
                19132,
                19201
            ],
            [
                19201,
                19303
            ],
            [
                19303,
                19393
            ],
            [
                19393,
                19452
            ],
            [
                19452,
                19558
            ]
        ]
    },
    "abridged": {
        "text": "If there is any place in Vanity Fair where Satire and Sentiment go arm in arm together, it is at one of those public gatherings which are advertised every day on the last page of the Times newspaper, when Mr. Hammerdown auctions off the library, furniture, silver plate, wardrobe, and choice wines of the deceased or bankrupt.\nEven the most selfish Vanity Fairian must feel some sympathy at these events. My Lord Dives's remains are in the family vault: his gravestone is being inscribed. What guest at Dives's table can pass the familiar house without a sigh? What a number of friends jolly old Dives had; and how nobly he entertained them. He was rather pompous and dull, perhaps, but would not such wine and food make any conversation pleasant? We must get some of his Burgundy at any price, the mourners cry.\nHow changed the house is, though! The front is patched over with notices describing the furniture for sale in staring capitals. They have hung a shred of carpet out of an upstairs window - porters are lounging on the dirty steps - the hall swarms with dingy guests. Old women have invaded the upper floors, pinching the bed-curtains, poking into the feathers, and clapping the wardrobe drawers to and fro. Enterprising young housekeepers are measuring the looking-glasses and hangings, and Mr. Hammerdown is sitting on the great mahogany dining-table, waving the ivory hammer, and using all his eloquence; imploring, commanding, bellowing, until down comes the hammer like fate, and we pass to the next lot.\nIt was rather late in this sale. The excellent furniture, the rare and famous wines, the rich and complete set of family plate had been sold on the previous days. Some of the best had been purchased for his master, by the butler of our friend John Osborne, of Russell Square. A small portion of the plate had been bought by some young stockbrokers from the City. And now, at the sale of minor objects, the auctioneer was expounding the merits of a picture to an audience that was not so select as on the previous days of the auction.\n\"No. 369,\" roared Mr. Hammerdown. \"Portrait of a gentleman on an elephant. Who'll bid for the gentleman on the elephant? Lift up the picture, Blowman.\"\nA long, pale, military-looking gentleman, seated at the mahogany table, could not help grinning as this valuable lot was shown by Mr. Blowman.\n\"Turn the elephant to the Captain, Blowman. What shall we say, sir, for the elephant?\"\nThe Captain, blushing awkwardly, turned away his head.\n\"Shall we say twenty guineas?\" cried the auctioneer. \"Fifteen, five, name your price. The gentleman without the elephant is worth five pound.\"\n\"He's a precious big one,\" said a professional wag; at which there was a general giggle in the room.\n\"How much for this lot? Come, gentlemen, don't keep me here all day.\"\nSomeone bid five shillings. Near the bidder was an officer with a young lady on his arm, who were both highly amused, and to whom, finally, this lot was knocked down for half a guinea. The Captain at the table looked discomposed when he spied this pair, and he turned his back upon them.\nOf all the other articles which Mr. Hammerdown auctioned that day, we will mention only one, a little square piano (the grand piano had been disposed of previously.) The young lady tried this with a skilful hand, and when its turn came, her agent began to bid.\nBut there was an opposition here: the officer at the table. A brisk battle ensued over this little piano, encouraged by Mr. Hammerdown.\nAt last the elephant purchaser and his lady abandoned the race; and the military captain became the owner of the little square piano. He sat up as if he was relieved, and the unsuccessful competitors caught a glimpse of him. The lady said to her friend,\n\"Why, Rawdon, it's Captain Dobbin.\"\nMaybe Becky was discontented with the new piano her husband had hired for her, or perhaps its owners had fetched it away as it was not paid for: or perhaps she had a particular attachment for the one which she had just tried to buy, recollecting old days when she used to play upon it in the sitting-room of our dear Amelia Sedley.\nFor the sale was at the Sedleys' house in Russell Square. Good old John Sedley was a ruined man. His name had been proclaimed as a defaulter on the Stock Exchange, and his bankruptcy had followed.\nMr. Osborne's butler came to buy some of the famous port wine to transfer to the cellars over the way. As for one dozen silver spoons and forks, three young stockbrokers (Messrs. Dale, Spiggot, and Dale, of Threadneedle Street,) who had received kindnesses from the old man in better days, sent this little spar out of the wreck with their love to good Mrs. Sedley. Respecting the piano, as it had been Amelia's, and as Captain William Dobbin could no more play it than he could dance on the tight rope, it seems that he did not buy it for his own use.\nThe piano arrived that evening at a small cottage in a street off the Fulham Road, with the romantic name of St. Adelaide Villas. The houses there look like baby-houses; the people looking out of the first-floor windows, must, you would think, have their feet in the parlours below. The shrubs in the little gardens bloom with a perennial display of children's clothing, and little beer pots hang on the railings sunning themselves.\nHere, in the evenings, you see City clerks padding wearily home: here it was that Mr. Clapp, Mr. Sedley's clerk, lived, and here the good old gentleman hid with his wife and daughter when the crash came.\nJos Sedley, when news of the family misfortune reached him, did not come to London, but he wrote and told his mother to ask his agents for any money they needed, so his broken-spirited parents had no present poverty to fear. This done, Jos went on at the boarding-house at Cheltenham pretty much as before. He drove his curricle; he drank his claret; he told his Indian stories. His present of money, needful as it was, made little impression on his parents; yet on receiving the packet of forks and spoons with the young stockbrokers' love, old Mr Sedley burst out crying like a child.\nRebecca had been entirely surprised at the sight of the comfortable old house ransacked by bargainers, its quiet family treasures given up to public plunder. A month after her flight, she had thought of Amelia, and Rawdon had been willing to see George Osborne again.\n\"He's a very agreeable acquaintance, Beck. I'd like to sell him another horse, and play a few more games at billiards with him. He'd be useful just now - ha, ha!\" It is not to be supposed that Rawdon Crawley wished to cheat Mr. Osborne at play, but only to take that fair advantage of him which almost every sporting gentleman in Vanity Fair considers to be his due from his neighbour.\nThe old aunt had not yet come round, although a month had elapsed. Rawdon's letters were sent back unopened. Miss Crawley never stirred out - she was unwell - and Mrs. Bute never left her. Crawley and his wife both augured evil from the continued presence of Mrs. Bute.\n\"Gad, I begin to see now why she was always bringing us together at Queen's Crawley,\" Rawdon said. \"But I don't regret it, if you don't.\" The Captain was still in an amorous rapture with his wife, who rewarded him with a kiss, and was indeed gratified by the generous confidence of her husband.\n\"If he had but a little more brains,\" she thought to herself, \"I might make something of him;\" but she never let him perceive her opinion. She listened tirelessly to his stories of the stable and the mess; laughed at all his jokes, and showed the greatest interest in his raffish friends. When he came home she was alert and happy: when he went out she pressed him to go: when he stayed at home, she played and sang for him, made him good drinks, supervised his dinner, warmed his slippers, and steeped his soul in comfort.\nThe best of women (I have heard my grandmother say) are hypocrites. We don't know how much they hide from us: how watchful they are: how often those frank smiles are traps to cajole or disarm us, even in paragons of female virtue. Who has not seen a woman hide the dullness of a stupid husband, or coax the fury of a savage one? We accept this amiable slavishness, and praise a woman for it. A good housewife is of necessity a humbug.\nThus Rawdon Crawley found himself a very happy and submissive married man. His former haunts knew him not. They asked about him once or twice at his clubs, but did not miss him much. His cheerful wife, his little comfortable lodgings, snug meals and homely evenings had all the charms of novelty and secrecy. The marriage was not yet declared to the world; his creditors would have come rushing on him, if they had known that he was united to a woman without fortune.\nBecky saw only a few of her husband's male companions, who were all charmed with her. The little dinners, the laughing and chatter and music, delighted the soldiers; but her modesty never forsook her for a moment, and Crawley's reputation as a fire-eating warrior was a further defence to his little wife.\nRawdon Crawley lived comfortably on credit. He had a large capital of debts, which laid out judiciously, will carry a man along for many years. Everything was plentiful in his house but ready money, of which they pretty soon felt the lack.\nReading the Gazette one day, and seeing the announcement of \"Lieutenant G. Osborne to be Captain by purchase,\" Rawdon expressed that willingness to see him again, which ended in the visit to Russell Square and the sale. But when Rawdon and his wife wanted to ask Captain Dobbin about the catastrophe which had befallen the Sedleys, the Captain had vanished; and such information as they got was from a stray porter.\n\"They're like vultures after a battle,\" said Becky.\n\"Don't know. Never was in action, my dear,\" said Rawdon.\n\"He was a very kind old man, Mr. Sedley,\" Rebecca said; \"I'm really sorry he's gone wrong.\"\n\"O stockbrokers - bankrupts - used to it, you know,\" Rawdon replied.\n\"I wish we could have afforded some of the plate,\" the wife continued sentimentally. \"Five-and-twenty guineas was monstrously dear for that little piano. It only cost five-and-thirty when Amelia chose it at Broadwoods.\"\n\"Osborne will cry off now, I suppose. How cut up your pretty little friend will be, hey, Becky?\"\n\"I daresay she'll recover,\" Becky said with a smile - and they drove on and talked about something else.",
        "paragraph_chars": [
            [
                0,
                327
            ],
            [
                327,
                813
            ],
            [
                813,
                1521
            ],
            [
                1521,
                2055
            ],
            [
                2055,
                2207
            ],
            [
                2207,
                2350
            ],
            [
                2350,
                2437
            ],
            [
                2437,
                2492
            ],
            [
                2492,
                2635
            ],
            [
                2635,
                2736
            ],
            [
                2736,
                2806
            ],
            [
                2806,
                3094
            ],
            [
                3094,
                3355
            ],
            [
                3355,
                3491
            ],
            [
                3491,
                3745
            ],
            [
                3745,
                3781
            ],
            [
                3781,
                4113
            ],
            [
                4113,
                4310
            ],
            [
                4310,
                4863
            ],
            [
                4863,
                5296
            ],
            [
                5296,
                5500
            ],
            [
                5500,
                6087
            ],
            [
                6087,
                6355
            ],
            [
                6355,
                6741
            ],
            [
                6741,
                7011
            ],
            [
                7011,
                7306
            ],
            [
                7306,
                7830
            ],
            [
                7830,
                8265
            ],
            [
                8265,
                8733
            ],
            [
                8733,
                9039
            ],
            [
                9039,
                9279
            ],
            [
                9279,
                9695
            ],
            [
                9695,
                9747
            ],
            [
                9747,
                9804
            ],
            [
                9804,
                9896
            ],
            [
                9896,
                9965
            ],
            [
                9965,
                10185
            ],
            [
                10185,
                10282
            ],
            [
                10282,
                10386
            ]
        ],
        "segment_chars": [
            [
                0,
                327
            ],
            [
                327,
                405
            ],
            [
                405,
                489
            ],
            [
                489,
                561
            ],
            [
                561,
                642
            ],
            [
                642,
                748
            ],
            [
                748,
                813
            ],
            [
                813,
                847
            ],
            [
                847,
                941
            ],
            [
                941,
                1079
            ],
            [
                1079,
                1219
            ],
            [
                1219,
                1521
            ],
            [
                1521,
                1554
            ],
            [
                1554,
                1684
            ],
            [
                1684,
                1797
            ],
            [
                1797,
                1884
            ],
            [
                1884,
                2055
            ],
            [
                2055,
                2060
            ],
            [
                2060,
                2089
            ],
            [
                2089,
                2130
            ],
            [
                2130,
                2176
            ],
            [
                2176,
                2207
            ],
            [
                2207,
                2350
            ],
            [
                2350,
                2394
            ],
            [
                2394,
                2437
            ],
            [
                2437,
                2492
            ],
            [
                2492,
                2523
            ],
            [
                2523,
                2545
            ],
            [
                2545,
                2578
            ],
            [
                2578,
                2635
            ],
            [
                2635,
                2736
            ],
            [
                2736,
                2760
            ],
            [
                2760,
                2806
            ],
            [
                2806,
                2834
            ],
            [
                2834,
                2991
            ],
            [
                2991,
                3094
            ],
            [
                3094,
                3260
            ],
            [
                3260,
                3355
            ],
            [
                3355,
                3415
            ],
            [
                3415,
                3491
            ],
            [
                3491,
                3625
            ],
            [
                3625,
                3716
            ],
            [
                3716,
                3745
            ],
            [
                3745,
                3781
            ],
            [
                3781,
                4113
            ],
            [
                4113,
                4171
            ],
            [
                4171,
                4210
            ],
            [
                4210,
                4310
            ],
            [
                4310,
                4413
            ],
            [
                4413,
                4676
            ],
            [
                4676,
                4863
            ],
            [
                4863,
                4993
            ],
            [
                4993,
                5146
            ],
            [
                5146,
                5296
            ],
            [
                5296,
                5500
            ],
            [
                5500,
                5725
            ],
            [
                5725,
                5807
            ],
            [
                5807,
                5879
            ],
            [
                5879,
                6087
            ],
            [
                6087,
                6245
            ],
            [
                6245,
                6355
            ],
            [
                6355,
                6398
            ],
            [
                6398,
                6483
            ],
            [
                6483,
                6518
            ],
            [
                6518,
                6741
            ],
            [
                6741,
                6808
            ],
            [
                6808,
                6850
            ],
            [
                6850,
                6930
            ],
            [
                6930,
                7011
            ],
            [
                7011,
                7110
            ],
            [
                7110,
                7149
            ],
            [
                7149,
                7306
            ],
            [
                7306,
                7445
            ],
            [
                7445,
                7595
            ],
            [
                7595,
                7830
            ],
            [
                7830,
                7898
            ],
            [
                7898,
                8061
            ],
            [
                8061,
                8159
            ],
            [
                8159,
                8222
            ],
            [
                8222,
                8265
            ],
            [
                8265,
                8340
            ],
            [
                8340,
                8372
            ],
            [
                8372,
                8448
            ],
            [
                8448,
                8574
            ],
            [
                8574,
                8733
            ],
            [
                8733,
                8819
            ],
            [
                8819,
                9039
            ],
            [
                9039,
                9083
            ],
            [
                9083,
                9183
            ],
            [
                9183,
                9279
            ],
            [
                9279,
                9499
            ],
            [
                9499,
                9695
            ],
            [
                9695,
                9747
            ],
            [
                9747,
                9760
            ],
            [
                9760,
                9804
            ],
            [
                9804,
                9896
            ],
            [
                9896,
                9965
            ],
            [
                9965,
                10050
            ],
            [
                10050,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10223
            ],
            [
                10223,
                10282
            ],
            [
                10282,
                10386
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                22,
                24
            ],
            [
                25,
                36
            ],
            [
                37,
                42
            ],
            [
                43,
                63
            ],
            [
                67,
                86
            ],
            [
                86,
                87
            ],
            [
                88,
                116
            ],
            [
                128,
                158
            ],
            [
                159,
                161
            ],
            [
                162,
                199
            ],
            [
                200,
                204
            ],
            [
                205,
                219
            ],
            [
                233,
                256
            ],
            [
                264,
                291
            ],
            [
                292,
                300
            ],
            [
                301,
                304
            ],
            [
                305,
                313
            ],
            [
                314,
                316
            ],
            [
                325,
                327
            ],
            [
                327,
                331
            ],
            [
                332,
                348
            ],
            [
                349,
                363
            ],
            [
                369,
                378
            ],
            [
                403,
                405
            ],
            [
                405,
                453
            ],
            [
                454,
                457
            ],
            [
                469,
                471
            ],
            [
                487,
                489
            ],
            [
                489,
                560
            ],
            [
                561,
                577
            ],
            [
                602,
                610
            ],
            [
                621,
                623
            ],
            [
                636,
                642
            ],
            [
                642,
                655
            ],
            [
                656,
                663
            ],
            [
                668,
                706
            ],
            [
                716,
                748
            ],
            [
                748,
                811
            ],
            [
                811,
                812
            ],
            [
                813,
                847
            ],
            [
                847,
                877
            ],
            [
                897,
                910
            ],
            [
                920,
                941
            ],
            [
                941,
                999
            ],
            [
                1002,
                1041
            ],
            [
                1044,
                1077
            ],
            [
                1077,
                1079
            ],
            [
                1079,
                1088
            ],
            [
                1089,
                1111
            ],
            [
                1118,
                1172
            ],
            [
                1173,
                1219
            ],
            [
                1219,
                1297
            ],
            [
                1297,
                1298
            ],
            [
                1299,
                1358
            ],
            [
                1363,
                1393
            ],
            [
                1400,
                1403
            ],
            [
                1404,
                1407
            ],
            [
                1408,
                1417
            ],
            [
                1417,
                1520
            ],
            [
                1521,
                1542
            ],
            [
                1548,
                1554
            ],
            [
                1554,
                1567
            ],
            [
                1568,
                1577
            ],
            [
                1577,
                1578
            ],
            [
                1579,
                1604
            ],
            [
                1604,
                1605
            ],
            [
                1606,
                1684
            ],
            [
                1689,
                1700
            ],
            [
                1701,
                1734
            ],
            [
                1734,
                1777
            ],
            [
                1778,
                1797
            ],
            [
                1797,
                1812
            ],
            [
                1813,
                1884
            ],
            [
                1884,
                1891
            ],
            [
                1891,
                1892
            ],
            [
                1896,
                1899
            ],
            [
                1905,
                1922
            ],
            [
                1923,
                1926
            ],
            [
                1938,
                1945
            ],
            [
                1953,
                1976
            ],
            [
                1977,
                1979
            ],
            [
                1983,
                1991
            ],
            [
                1992,
                1996
            ],
            [
                1997,
                2000
            ],
            [
                2005,
                2014
            ],
            [
                2015,
                2017
            ],
            [
                2018,
                2020
            ],
            [
                2021,
                2055
            ],
            [
                2055,
                2060
            ],
            [
                2060,
                2089
            ],
            [
                2089,
                2130
            ],
            [
                2130,
                2176
            ],
            [
                2176,
                2204
            ],
            [
                2204,
                2206
            ],
            [
                2207,
                2255
            ],
            [
                2256,
                2349
            ],
            [
                2350,
                2394
            ],
            [
                2394,
                2436
            ],
            [
                2437,
                2458
            ],
            [
                2468,
                2492
            ],
            [
                2492,
                2520
            ],
            [
                2546,
                2570
            ],
            [
                2571,
                2578
            ],
            [
                2578,
                2635
            ],
            [
                2635,
                2640
            ],
            [
                2641,
                2659
            ],
            [
                2659,
                2685
            ],
            [
                2687,
                2695
            ],
            [
                2696,
                2736
            ],
            [
                2737,
                2760
            ],
            [
                2760,
                2806
            ],
            [
                2814,
                2832
            ],
            [
                2839,
                2842
            ],
            [
                2857,
                2898
            ],
            [
                2904,
                2908
            ],
            [
                2909,
                2922
            ],
            [
                2922,
                2991
            ],
            [
                3003,
                3022
            ],
            [
                3023,
                3034
            ],
            [
                3035,
                3063
            ],
            [
                3064,
                3092
            ],
            [
                3092,
                3094
            ],
            [
                3094,
                3140
            ],
            [
                3151,
                3159
            ],
            [
                3159,
                3160
            ],
            [
                3169,
                3176
            ],
            [
                3177,
                3181
            ],
            [
                3182,
                3185
            ],
            [
                3185,
                3208
            ],
            [
                3209,
                3213
            ],
            [
                3214,
                3225
            ],
            [
                3226,
                3229
            ],
            [
                3230,
                3257
            ],
            [
                3260,
                3280
            ],
            [
                3281,
                3285
            ],
            [
                3286,
                3292
            ],
            [
                3293,
                3305
            ],
            [
                3305,
                3306
            ],
            [
                3307,
                3310
            ],
            [
                3311,
                3355
            ],
            [
                3355,
                3387
            ],
            [
                3389,
                3413
            ],
            [
                3413,
                3414
            ],
            [
                3415,
                3460
            ],
            [
                3461,
                3491
            ],
            [
                3491,
                3498
            ],
            [
                3499,
                3511
            ],
            [
                3522,
                3525
            ],
            [
                3530,
                3534
            ],
            [
                3545,
                3562
            ],
            [
                3572,
                3579
            ],
            [
                3580,
                3590
            ],
            [
                3597,
                3625
            ],
            [
                3625,
                3627
            ],
            [
                3632,
                3647
            ],
            [
                3648,
                3690
            ],
            [
                3698,
                3714
            ],
            [
                3716,
                3745
            ],
            [
                3745,
                3781
            ],
            [
                3787,
                3870
            ],
            [
                3882,
                3901
            ],
            [
                3905,
                3907
            ],
            [
                3926,
                4008
            ],
            [
                4012,
                4026
            ],
            [
                4027,
                4035
            ],
            [
                4036,
                4065
            ],
            [
                4066,
                4072
            ],
            [
                4073,
                4113
            ],
            [
                4117,
                4136
            ],
            [
                4146,
                4169
            ],
            [
                4169,
                4171
            ],
            [
                4171,
                4210
            ],
            [
                4210,
                4295
            ],
            [
                4296,
                4309
            ],
            [
                4310,
                4413
            ],
            [
                4413,
                4429
            ],
            [
                4430,
                4453
            ],
            [
                4453,
                4454
            ],
            [
                4455,
                4536
            ],
            [
                4539,
                4542
            ],
            [
                4543,
                4546
            ],
            [
                4556,
                4571
            ],
            [
                4572,
                4583
            ],
            [
                4584,
                4586
            ],
            [
                4594,
                4598
            ],
            [
                4598,
                4674
            ],
            [
                4687,
                4729
            ],
            [
                4730,
                4771
            ],
            [
                4772,
                4816
            ],
            [
                4823,
                4838
            ],
            [
                4843,
                4845
            ],
            [
                4846,
                4863
            ],
            [
                4863,
                4866
            ],
            [
                4873,
                4898
            ],
            [
                4899,
                4924
            ],
            [
                4929,
                4944
            ],
            [
                4944,
                4945
            ],
            [
                4946,
                4950
            ],
            [
                4951,
                4954
            ],
            [
                4955,
                4963
            ],
            [
                4969,
                4971
            ],
            [
                4972,
                4991
            ],
            [
                4991,
                4992
            ],
            [
                4993,
                5003
            ],
            [
                5010,
                5032
            ],
            [
                5033,
                5043
            ],
            [
                5044,
                5088
            ],
            [
                5088,
                5089
            ],
            [
                5090,
                5093
            ],
            [
                5100,
                5106
            ],
            [
                5107,
                5111
            ],
            [
                5112,
                5138
            ],
            [
                5146,
                5178
            ],
            [
                5179,
                5212
            ],
            [
                5213,
                5223
            ],
            [
                5232,
                5237
            ],
            [
                5238,
                5244
            ],
            [
                5250,
                5294
            ],
            [
                5300,
                5301
            ],
            [
                5302,
                5304
            ],
            [
                5305,
                5308
            ],
            [
                5309,
                5317
            ],
            [
                5317,
                5318
            ],
            [
                5319,
                5354
            ],
            [
                5359,
                5388
            ],
            [
                5389,
                5399
            ],
            [
                5402,
                5407
            ],
            [
                5407,
                5408
            ],
            [
                5414,
                5415
            ],
            [
                5416,
                5419
            ],
            [
                5425,
                5451
            ],
            [
                5452,
                5500
            ],
            [
                5500,
                5510
            ],
            [
                5510,
                5516
            ],
            [
                5522,
                5558
            ],
            [
                5560,
                5596
            ],
            [
                5606,
                5619
            ],
            [
                5624,
                5638
            ],
            [
                5643,
                5648
            ],
            [
                5660,
                5664
            ],
            [
                5665,
                5668
            ],
            [
                5669,
                5684
            ],
            [
                5685,
                5725
            ],
            [
                5725,
                5807
            ],
            [
                5807,
                5853
            ],
            [
                5854,
                5877
            ],
            [
                5877,
                5879
            ],
            [
                5879,
                5958
            ],
            [
                5963,
                5965
            ],
            [
                5976,
                6041
            ],
            [
                6056,
                6085
            ],
            [
                6085,
                6086
            ],
            [
                6087,
                6094
            ],
            [
                6095,
                6098
            ],
            [
                6104,
                6164
            ],
            [
                6165,
                6177
            ],
            [
                6178,
                6189
            ],
            [
                6190,
                6235
            ],
            [
                6236,
                6245
            ],
            [
                6245,
                6278
            ],
            [
                6279,
                6286
            ],
            [
                6287,
                6308
            ],
            [
                6309,
                6312
            ],
            [
                6326,
                6332
            ],
            [
                6333,
                6354
            ],
            [
                6355,
                6396
            ],
            [
                6396,
                6398
            ],
            [
                6398,
                6433
            ],
            [
                6438,
                6483
            ],
            [
                6483,
                6490
            ],
            [
                6491,
                6506
            ],
            [
                6509,
                6518
            ],
            [
                6518,
                6562
            ],
            [
                6563,
                6569
            ],
            [
                6570,
                6608
            ],
            [
                6609,
                6741
            ],
            [
                6741,
                6753
            ],
            [
                6787,
                6808
            ],
            [
                6808,
                6814
            ],
            [
                6817,
                6850
            ],
            [
                6850,
                6880
            ],
            [
                6883,
                6897
            ],
            [
                6900,
                6913
            ],
            [
                6914,
                6930
            ],
            [
                6930,
                6955
            ],
            [
                6956,
                7011
            ],
            [
                7011,
                7027
            ],
            [
                7032,
                7109
            ],
            [
                7110,
                7111
            ],
            [
                7115,
                7146
            ],
            [
                7149,
                7160
            ],
            [
                7165,
                7236
            ],
            [
                7236,
                7252
            ],
            [
                7253,
                7306
            ],
            [
                7306,
                7398
            ],
            [
                7401,
                7431
            ],
            [
                7436,
                7443
            ],
            [
                7445,
                7448
            ],
            [
                7449,
                7457
            ],
            [
                7469,
                7536
            ],
            [
                7536,
                7541
            ],
            [
                7549,
                7573
            ],
            [
                7593,
                7595
            ],
            [
                7595,
                7752
            ],
            [
                7764,
                7829
            ],
            [
                7830,
                7898
            ],
            [
                7898,
                7961
            ],
            [
                7961,
                7991
            ],
            [
                7992,
                8014
            ],
            [
                8015,
                8021
            ],
            [
                8024,
                8025
            ],
            [
                8031,
                8033
            ],
            [
                8034,
                8061
            ],
            [
                8061,
                8094
            ],
            [
                8099,
                8159
            ],
            [
                8159,
                8220
            ],
            [
                8220,
                8222
            ],
            [
                8222,
                8263
            ],
            [
                8263,
                8265
            ],
            [
                8270,
                8284
            ],
            [
                8285,
                8298
            ],
            [
                8299,
                8340
            ],
            [
                8340,
                8372
            ],
            [
                8372,
                8446
            ],
            [
                8446,
                8448
            ],
            [
                8448,
                8451
            ],
            [
                8452,
                8460
            ],
            [
                8461,
                8465
            ],
            [
                8465,
                8510
            ],
            [
                8511,
                8530
            ],
            [
                8531,
                8574
            ],
            [
                8574,
                8620
            ],
            [
                8622,
                8666
            ],
            [
                8666,
                8667
            ],
            [
                8671,
                8675
            ],
            [
                8676,
                8679
            ],
            [
                8680,
                8732
            ],
            [
                8739,
                8742
            ],
            [
                8743,
                8747
            ],
            [
                8748,
                8749
            ],
            [
                8750,
                8786
            ],
            [
                8786,
                8787
            ],
            [
                8788,
                8791
            ],
            [
                8792,
                8819
            ],
            [
                8819,
                8855
            ],
            [
                8864,
                8867
            ],
            [
                8868,
                8873
            ],
            [
                8873,
                8884
            ],
            [
                8885,
                8888
            ],
            [
                8897,
                8906
            ],
            [
                8907,
                8988
            ],
            [
                8989,
                9010
            ],
            [
                9011,
                9039
            ],
            [
                9039,
                9053
            ],
            [
                9054,
                9083
            ],
            [
                9083,
                9181
            ],
            [
                9181,
                9183
            ],
            [
                9183,
                9246
            ],
            [
                9252,
                9258
            ],
            [
                9264,
                9272
            ],
            [
                9277,
                9279
            ],
            [
                9279,
                9311
            ],
            [
                9319,
                9387
            ],
            [
                9387,
                9396
            ],
            [
                9407,
                9411
            ],
            [
                9440,
                9484
            ],
            [
                9485,
                9488
            ],
            [
                9503,
                9527
            ],
            [
                9535,
                9537
            ],
            [
                9542,
                9556
            ],
            [
                9563,
                9597
            ],
            [
                9598,
                9601
            ],
            [
                9609,
                9693
            ],
            [
                9693,
                9695
            ],
            [
                9695,
                9732
            ],
            [
                9732,
                9734
            ],
            [
                9735,
                9739
            ],
            [
                9740,
                9745
            ],
            [
                9745,
                9746
            ],
            [
                9747,
                9760
            ],
            [
                9760,
                9788
            ],
            [
                9802,
                9803
            ],
            [
                9804,
                9896
            ],
            [
                9896,
                9911
            ],
            [
                9922,
                9923
            ],
            [
                9926,
                9963
            ],
            [
                9963,
                9965
            ],
            [
                9965,
                10013
            ],
            [
                10013,
                10050
            ],
            [
                10050,
                10119
            ],
            [
                10119,
                10147
            ],
            [
                10148,
                10152
            ],
            [
                10153,
                10159
            ],
            [
                10160,
                10177
            ],
            [
                10182,
                10185
            ],
            [
                10185,
                10186
            ],
            [
                10186,
                10193
            ],
            [
                10194,
                10221
            ],
            [
                10221,
                10223
            ],
            [
                10223,
                10267
            ],
            [
                10269,
                10282
            ],
            [
                10282,
                10307
            ],
            [
                10307,
                10333
            ],
            [
                10336,
                10386
            ]
        ],
        "row_chars": [
            [
                0,
                327
            ],
            [
                327,
                405
            ],
            [
                405,
                489
            ],
            [
                489,
                561
            ],
            [
                561,
                642
            ],
            [
                642,
                642
            ],
            [
                642,
                748
            ],
            [
                748,
                813
            ],
            [
                813,
                813
            ],
            [
                813,
                847
            ],
            [
                847,
                941
            ],
            [
                941,
                1079
            ],
            [
                1079,
                1219
            ],
            [
                1219,
                1521
            ],
            [
                1521,
                1521
            ],
            [
                1521,
                1554
            ],
            [
                1554,
                1684
            ],
            [
                1684,
                1797
            ],
            [
                1797,
                1884
            ],
            [
                1884,
                2055
            ],
            [
                2055,
                2060
            ],
            [
                2060,
                2089
            ],
            [
                2089,
                2130
            ],
            [
                2130,
                2176
            ],
            [
                2176,
                2207
            ],
            [
                2207,
                2350
            ],
            [
                2350,
                2394
            ],
            [
                2394,
                2437
            ],
            [
                2437,
                2492
            ],
            [
                2492,
                2578
            ],
            [
                2578,
                2635
            ],
            [
                2635,
                2736
            ],
            [
                2736,
                2736
            ],
            [
                2736,
                2760
            ],
            [
                2760,
                2806
            ],
            [
                2806,
                2991
            ],
            [
                2991,
                3094
            ],
            [
                3094,
                3355
            ],
            [
                3355,
                3491
            ],
            [
                3491,
                3625
            ],
            [
                3625,
                3745
            ],
            [
                3745,
                3781
            ],
            [
                3781,
                4113
            ],
            [
                4113,
                4171
            ],
            [
                4171,
                4210
            ],
            [
                4210,
                4310
            ],
            [
                4310,
                4413
            ],
            [
                4413,
                4863
            ],
            [
                4863,
                5500
            ],
            [
                5500,
                5725
            ],
            [
                5725,
                5807
            ],
            [
                5807,
                5879
            ],
            [
                5879,
                6087
            ],
            [
                6087,
                6087
            ],
            [
                6087,
                6087
            ],
            [
                6087,
                6087
            ],
            [
                6087,
                6087
            ],
            [
                6087,
                6245
            ],
            [
                6245,
                6355
            ],
            [
                6355,
                6398
            ],
            [
                6398,
                6483
            ],
            [
                6483,
                6518
            ],
            [
                6518,
                6741
            ],
            [
                6741,
                6808
            ],
            [
                6808,
                6850
            ],
            [
                6850,
                6930
            ],
            [
                6930,
                7011
            ],
            [
                7011,
                7110
            ],
            [
                7110,
                7110
            ],
            [
                7110,
                7110
            ],
            [
                7110,
                7306
            ],
            [
                7306,
                7595
            ],
            [
                7595,
                7830
            ],
            [
                7830,
                7898
            ],
            [
                7898,
                8061
            ],
            [
                8061,
                8159
            ],
            [
                8159,
                8222
            ],
            [
                8222,
                8265
            ],
            [
                8265,
                8340
            ],
            [
                8340,
                8372
            ],
            [
                8372,
                8448
            ],
            [
                8448,
                8574
            ],
            [
                8574,
                8733
            ],
            [
                8733,
                8819
            ],
            [
                8819,
                9039
            ],
            [
                9039,
                9083
            ],
            [
                9083,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9183
            ],
            [
                9183,
                9499
            ],
            [
                9499,
                9695
            ],
            [
                9695,
                9747
            ],
            [
                9747,
                9760
            ],
            [
                9760,
                9804
            ],
            [
                9804,
                9804
            ],
            [
                9804,
                9896
            ],
            [
                9896,
                9965
            ],
            [
                9965,
                10050
            ],
            [
                10050,
                10119
            ],
            [
                10119,
                10185
            ],
            [
                10185,
                10223
            ],
            [
                10223,
                10282
            ],
            [
                10282,
                10386
            ]
        ]
    }
}