{
    "original": {
        "text": "Our surprised story now finds itself for a moment among very famous events and personages, and hanging on to the skirts of history. When the eagles of Napoleon Bonaparte, the Corsican upstart, were flying from Provence, where they had perched after a brief sojourn in Elba, and from steeple to steeple until they reached the towers of Notre Dame, I wonder whether the Imperial birds had any eye for a little corner of the parish of Bloomsbury, London, which you might have thought so quiet, that even the whirring and flapping of those mighty wings would pass unobserved there?\n\"Napoleon has landed at Cannes.\" Such news might create a panic at Vienna, and cause Russia to drop his cards, and take Prussia into a corner, and Talleyrand and Metternich to wag their heads together, while Prince Hardenberg, and even the present Marquis of Londonderry, were puzzled; but how was this intelligence to affect a young lady in Russell Square, before whose door the watchman sang the hours when she was asleep: who, if she strolled in the square, was guarded there by the railings and the beadle: who, if she walked ever so short a distance to buy a ribbon in Southampton Row, was followed by Black Sambo with an enormous cane: who was always cared for, dressed, put to bed, and watched over by ever so many guardian angels, with and without wages? Bon Dieu, I say, is it not hard that the fateful rush of the great Imperial struggle can't take place without affecting a poor little harmless girl of eighteen, who is occupied in billing and cooing, or working muslin collars in Russell Square? You too, kindly, homely flower!--is the great roaring war tempest coming to sweep you down, here, although cowering under the shelter of Holborn? Yes; Napoleon is flinging his last stake, and poor little Emmy Sedley's happiness forms, somehow, part of it.\nIn the first place, her father's fortune was swept down with that fatal news. All his speculations had of late gone wrong with the luckless old gentleman. Ventures had failed; merchants had broken; funds had risen when he calculated they would fall. What need to particularize? If success is rare and slow, everybody knows how quick and easy ruin is. Old Sedley had kept his own sad counsel. Everything seemed to go on as usual in the quiet, opulent house; the good-natured mistress pursuing, quite unsuspiciously, her bustling idleness, and daily easy avocations; the daughter absorbed still in one selfish, tender thought, and quite regardless of all the world besides, when that final crash came, under which the worthy family fell.\nOne night Mrs. Sedley was writing cards for a party; the Osbornes had given one, and she must not be behindhand; John Sedley, who had come home very late from the City, sate silent at the chimney side, while his wife was prattling to him; Emmy had gone up to her room ailing and low-spirited. \"She's not happy,\" the mother went on. \"George Osborne neglects her. I've no patience with the airs of those people. The girls have not been in the house these three weeks; and George has been twice in town without coming. Edward Dale saw him at the Opera. Edward would marry her I'm sure: and there's Captain Dobbin who, I think, would--only I hate all army men. Such a dandy as George has become. With his military airs, indeed! We must show some folks that we're as good as they. Only give Edward Dale any encouragement, and you'll see. We must have a party, Mr. S. Why don't you speak, John? Shall I say Tuesday fortnight? Why don't you answer? Good God, John, what has happened?\"\nJohn Sedley sprang up out of his chair to meet his wife, who ran to him. He seized her in his arms, and said with a hasty voice, \"We're ruined, Mary. We've got the world to begin over again, dear. It's best that you should know all, and at once.\" As he spoke, he trembled in every limb, and almost fell. He thought the news would have overpowered his wife--his wife, to whom he had never said a hard word. But it was he that was the most moved, sudden as the shock was to her. When he sank back into his seat, it was the wife that took the office of consoler. She took his trembling hand, and kissed it, and put it round her neck: she called him her John--her dear John--her old man--her kind old man; she poured out a hundred words of incoherent love and tenderness; her faithful voice and simple caresses wrought this sad heart up to an inexpressible delight and anguish, and cheered and solaced his over-burdened soul.\nOnly once in the course of the long night as they sate together, and poor Sedley opened his pent-up soul, and told the story of his losses and embarrassments--the treason of some of his oldest friends, the manly kindness of some, from whom he never could have expected it--in a general confession--only once did the faithful wife give way to emotion.\n\"My God, my God, it will break Emmy's heart,\" she said.\nThe father had forgotten the poor girl. She was lying, awake and unhappy, overhead. In the midst of friends, home, and kind parents, she was alone. To how many people can any one tell all? Who will be open where there is no sympathy, or has call to speak to those who never can understand? Our gentle Amelia was thus solitary. She had no confidante, so to speak, ever since she had anything to confide. She could not tell the old mother her doubts and cares; the would-be sisters seemed every day more strange to her. And she had misgivings and fears which she dared not acknowledge to herself, though she was always secretly brooding over them.\nHer heart tried to persist in asserting that George Osborne was worthy and faithful to her, though she knew otherwise. How many a thing had she said, and got no echo from him. How many suspicions of selfishness and indifference had she to encounter and obstinately overcome. To whom could the poor little martyr tell these daily struggles and tortures? Her hero himself only half understood her. She did not dare to own that the man she loved was her inferior; or to feel that she had given her heart away too soon. Given once, the pure bashful maiden was too modest, too tender, too trustful, too weak, too much woman to recall it. We are Turks with the affections of our women; and have made them subscribe to our doctrine too. We let their bodies go abroad liberally enough, with smiles and ringlets and pink bonnets to disguise them instead of veils and yakmaks. But their souls must be seen by only one man, and they obey not unwillingly, and consent to remain at home as our slaves--ministering to us and doing drudgery for us.\nSo imprisoned and tortured was this gentle little heart, when in the month of March, Anno Domini 1815, Napoleon landed at Cannes, and Louis XVIII fled, and all Europe was in alarm, and the funds fell, and old John Sedley was ruined.\nWe are not going to follow the worthy old stockbroker through those last pangs and agonies of ruin through which he passed before his commercial demise befell. They declared him at the Stock Exchange; he was absent from his house of business: his bills were protested: his act of bankruptcy formal. The house and furniture of Russell Square were seized and sold up, and he and his family were thrust away, as we have seen, to hide their heads where they might.\nJohn Sedley had not the heart to review the domestic establishment who have appeared now and anon in our pages and of whom he was now forced by poverty to take leave. The wages of those worthy people were discharged with that punctuality which men frequently show who only owe in great sums--they were sorry to leave good places--but they did not break their hearts at parting from their adored master and mistress. Amelia's maid was profuse in condolences, but went off quite resigned to better herself in a genteeler quarter of the town. Black Sambo, with the infatuation of his profession, determined on setting up a public-house. Honest old Mrs. Blenkinsop indeed, who had seen the birth of Jos and Amelia, and the wooing of John Sedley and his wife, was for staying by them without wages, having amassed a considerable sum in their service: and she accompanied the fallen people into their new and humble place of refuge, where she tended them and grumbled against them for a while.\nOf all Sedley's opponents in his debates with his creditors which now ensued, and harassed the feelings of the humiliated old gentleman so severely, that in six weeks he oldened more than he had done for fifteen years before--the most determined and obstinate seemed to be John Osborne, his old friend and neighbour--John Osborne, whom he had set up in life--who was under a hundred obligations to him--and whose son was to marry Sedley's daughter. Any one of these circumstances would account for the bitterness of Osborne's opposition.\nWhen one man has been under very remarkable obligations to another, with whom he subsequently quarrels, a common sense of decency, as it were, makes of the former a much severer enemy than a mere stranger would be. To account for your own hard-heartedness and ingratitude in such a case, you are bound to prove the other party's crime. It is not that you are selfish, brutal, and angry at the failure of a speculation--no, no--it is that your partner has led you into it by the basest treachery and with the most sinister motives. From a mere sense of consistency, a persecutor is bound to show that the fallen man is a villain--otherwise he, the persecutor, is a wretch himself.\nAnd as a general rule, which may make all creditors who are inclined to be severe pretty comfortable in their minds, no men embarrassed are altogether honest, very likely. They conceal something; they exaggerate chances of good luck; hide away the real state of affairs; say that things are flourishing when they are hopeless, keep a smiling face (a dreary smile it is) upon the verge of bankruptcy--are ready to lay hold of any pretext for delay or of any money, so as to stave off the inevitable ruin a few days longer. \"Down with such dishonesty,\" says the creditor in triumph, and reviles his sinking enemy. \"You fool, why do you catch at a straw?\" calm good sense says to the man that is drowning. \"You villain, why do you shrink from plunging into the irretrievable Gazette?\" says prosperity to the poor devil battling in that black gulf. Who has not remarked the readiness with which the closest of friends and honestest of men suspect and accuse each other of cheating when they fall out on money matters? Everybody does it. Everybody is right, I suppose, and the world is a rogue.\nThen Osborne had the intolerable sense of former benefits to goad and irritate him: these are always a cause of hostility aggravated. Finally, he had to break off the match between Sedley's daughter and his son; and as it had gone very far indeed, and as the poor girl's happiness and perhaps character were compromised, it was necessary to show the strongest reasons for the rupture, and for John Osborne to prove John Sedley to be a very bad character indeed.\nAt the meetings of creditors, then, he comported himself with a savageness and scorn towards Sedley, which almost succeeded in breaking the heart of that ruined bankrupt man. On George's intercourse with Amelia he put an instant veto--menacing the youth with maledictions if he broke his commands, and vilipending the poor innocent girl as the basest and most artful of vixens. One of the great conditions of anger and hatred is, that you must tell and believe lies against the hated object, in order, as we said, to be consistent.\nWhen the great crash came--the announcement of ruin, and the departure from Russell Square, and the declaration that all was over between her and George--all over between her and love, her and happiness, her and faith in the world--a brutal letter from John Osborne told her in a few curt lines that her father's conduct had been of such a nature that all engagements between the families were at an end--when the final award came, it did not shock her so much as her parents, as her mother rather expected (for John Sedley himself was entirely prostrate in the ruins of his own affairs and shattered honour). Amelia took the news very palely and calmly. It was only the confirmation of the dark presages which had long gone before. It was the mere reading of the sentence--of the crime she had long ago been guilty--the crime of loving wrongly, too violently, against reason. She told no more of her thoughts now than she had before. She seemed scarcely more unhappy now when convinced all hope was over, than before when she felt but dared not confess that it was gone. So she changed from the large house to the small one without any mark or difference; remained in her little room for the most part; pined silently; and died away day by day. I do not mean to say that all females are so. My dear Miss Bullock, I do not think your heart would break in this way. You are a strong-minded young woman with proper principles. I do not venture to say that mine would; it has suffered, and, it must be confessed, survived. But there are some souls thus gently constituted, thus frail, and delicate, and tender.\nWhenever old John Sedley thought of the affair between George and Amelia, or alluded to it, it was with bitterness almost as great as Mr. Osborne himself had shown. He cursed Osborne and his family as heartless, wicked, and ungrateful. No power on earth, he swore, would induce him to marry his daughter to the son of such a villain, and he ordered Emmy to banish George from her mind, and to return all the presents and letters which she had ever had from him.\nShe promised acquiescence, and tried to obey. She put up the two or three trinkets: and, as for the letters, she drew them out of the place where she kept them; and read them over--as if she did not know them by heart already: but she could not part with them. That effort was too much for her; she placed them back in her bosom again--as you have seen a woman nurse a child that is dead. Young Amelia felt that she would die or lose her senses outright, if torn away from this last consolation. How she used to blush and lighten up when those letters came! How she used to trip away with a beating heart, so that she might read unseen! If they were cold, yet how perversely this fond little soul interpreted them into warmth. If they were short or selfish, what excuses she found for the writer!\nIt was over these few worthless papers that she brooded and brooded. She lived in her past life--every letter seemed to recall some circumstance of it. How well she remembered them all! His looks and tones, his dress, what he said and how--these relics and remembrances of dead affection were all that were left her in the world. And the business of her life, was--to watch the corpse of Love.\nTo death she looked with inexpressible longing. Then, she thought, I shall always be able to follow him. I am not praising her conduct or setting her up as a model for Miss Bullock to imitate. Miss B. knows how to regulate her feelings better than this poor little creature. Miss B. would never have committed herself as that imprudent Amelia had done; pledged her love irretrievably; confessed her heart away, and got back nothing--only a brittle promise which was snapt and worthless in a moment. A long engagement is a partnership which one party is free to keep or to break, but which involves all the capital of the other.\nBe cautious then, young ladies; be wary how you engage. Be shy of loving frankly; never tell all you feel, or (a better way still), feel very little. See the consequences of being prematurely honest and confiding, and mistrust yourselves and everybody. Get yourselves married as they do in France, where the lawyers are the bridesmaids and confidantes. At any rate, never have any feelings which may make you uncomfortable, or make any promises which you cannot at any required moment command and withdraw. That is the way to get on, and be respected, and have a virtuous character in Vanity Fair.\nIf Amelia could have heard the comments regarding her which were made in the circle from which her father's ruin had just driven her, she would have seen what her own crimes were, and how entirely her character was jeopardised. Such criminal imprudence Mrs. Smith never knew of; such horrid familiarities Mrs. Brown had always condemned, and the end might be a warning to HER daughters. \"Captain Osborne, of course, could not marry a bankrupt's daughter,\" the Misses Dobbin said. \"It was quite enough to have been swindled by the father. As for that little Amelia, her folly had really passed all--\"\n\"All what?\" Captain Dobbin roared out. \"Haven't they been engaged ever since they were children? Wasn't it as good as a marriage? Dare any soul on earth breathe a word against the sweetest, the purest, the tenderest, the most angelical of young women?\"\n\"La, William, don't be so highty-tighty with US. We're not men. We can't fight you,\" Miss Jane said. \"We've said nothing against Miss Sedley: but that her conduct throughout was MOST IMPRUDENT, not to call it by any worse name; and that her parents are people who certainly merit their misfortunes.\"\n\"Hadn't you better, now that Miss Sedley is free, propose for her yourself, William?\" Miss Ann asked sarcastically. \"It would be a most eligible family connection. He! he!\"\n\"I marry her!\" Dobbin said, blushing very much, and talking quick. \"If you are so ready, young ladies, to chop and change, do you suppose that she is? Laugh and sneer at that angel. She can't hear it; and she's miserable and unfortunate, and deserves to be laughed at. Go on joking, Ann. You're the wit of the family, and the others like to hear it.\"\n\"I must tell you again we're not in a barrack, William,\" Miss Ann remarked.\n\"In a barrack, by Jove--I wish anybody in a barrack would say what you do,\" cried out this uproused British lion. \"I should like to hear a man breathe a word against her, by Jupiter. But men don't talk in this way, Ann: it's only women, who get together and hiss, and shriek, and cackle. There, get away--don't begin to cry. I only said you were a couple of geese,\" Will Dobbin said, perceiving Miss Ann's pink eyes were beginning to moisten as usual. \"Well, you're not geese, you're swans--anything you like, only do, do leave Miss Sedley alone.\"\nAnything like William's infatuation about that silly little flirting, ogling thing was never known, the mamma and sisters agreed together in thinking: and they trembled lest, her engagement being off with Osborne, she should take up immediately her other admirer and Captain. In which forebodings these worthy young women no doubt judged according to the best of their experience; or rather (for as yet they had had no opportunities of marrying or of jilting) according to their own notions of right and wrong.\n\"It is a mercy, Mamma, that the regiment is ordered abroad,\" the girls said. \"THIS danger, at any rate, is spared our brother.\"\nSuch, indeed, was the fact; and so it is that the French Emperor comes in to perform a part in this domestic comedy of Vanity Fair which we are now playing, and which would never have been enacted without the intervention of this august mute personage. It was he that ruined the Bourbons and Mr. John Sedley. It was he whose arrival in his capital called up all France in arms to defend him there; and all Europe to oust him. While the French nation and army were swearing fidelity round the eagles in the Champ de Mars, four mighty European hosts were getting in motion for the great chasse a l'aigle; and one of these was a British army, of which two heroes of ours, Captain Dobbin and Captain Osborne, formed a portion.\nThe news of Napoleon's escape and landing was received by the gallant --th with a fiery delight and enthusiasm, which everybody can understand who knows that famous corps. From the colonel to the smallest drummer in the regiment, all were filled with hope and ambition and patriotic fury; and thanked the French Emperor as for a personal kindness in coming to disturb the peace of Europe. Now was the time the --th had so long panted for, to show their comrades in arms that they could fight as well as the Peninsular veterans, and that all the pluck and valour of the --th had not been killed by the West Indies and the yellow fever. Stubble and Spooney looked to get their companies without purchase. Before the end of the campaign (which she resolved to share), Mrs. Major O'Dowd hoped to write herself Mrs. Colonel O'Dowd, C.B. Our two friends (Dobbin and Osborne) were quite as much excited as the rest: and each in his way--Mr. Dobbin very quietly, Mr. Osborne very loudly and energetically--was bent upon doing his duty, and gaining his share of honour and distinction.\nThe agitation thrilling through the country and army in consequence of this news was so great, that private matters were little heeded: and hence probably George Osborne, just gazetted to his company, busy with preparations for the march, which must come inevitably, and panting for further promotion--was not so much affected by other incidents which would have interested him at a more quiet period. He was not, it must be confessed, very much cast down by good old Mr. Sedley's catastrophe. He tried his new uniform, which became him very handsomely, on the day when the first meeting of the creditors of the unfortunate gentleman took place. His father told him of the wicked, rascally, shameful conduct of the bankrupt, reminded him of what he had said about Amelia, and that their connection was broken off for ever; and gave him that evening a good sum of money to pay for the new clothes and epaulets in which he looked so well. Money was always useful to this free-handed young fellow, and he took it without many words. The bills were up in the Sedley house, where he had passed so many, many happy hours. He could see them as he walked from home that night (to the Old Slaughters', where he put up when in town) shining white in the moon. That comfortable home was shut, then, upon Amelia and her parents: where had they taken refuge? The thought of their ruin affected him not a little. He was very melancholy that night in the coffee-room at the Slaughters'; and drank a good deal, as his comrades remarked there.\nDobbin came in presently, cautioned him about the drink, which he only took, he said, because he was deuced low; but when his friend began to put to him clumsy inquiries, and asked him for news in a significant manner, Osborne declined entering into conversation with him, avowing, however, that he was devilish disturbed and unhappy.\nThree days afterwards, Dobbin found Osborne in his room at the barracks--his head on the table, a number of papers about, the young Captain evidently in a state of great despondency. \"She--she's sent me back some things I gave her--some damned trinkets. Look here!\" There was a little packet directed in the well-known hand to Captain George Osborne, and some things lying about--a ring, a silver knife he had bought, as a boy, for her at a fair; a gold chain, and a locket with hair in it. \"It's all over,\" said he, with a groan of sickening remorse. \"Look, Will, you may read it if you like.\"\nThere was a little letter of a few lines, to which he pointed, which said:\nMy papa has ordered me to return to you these presents, which you made in happier days to me; and I am to write to you for the last time. I think, I know you feel as much as I do the blow which has come upon us. It is I that absolve you from an engagement which is impossible in our present misery. I am sure you had no share in it, or in the cruel suspicions of Mr. Osborne, which are the hardest of all our griefs to bear. Farewell. Farewell. I pray God to strengthen me to bear this and other calamities, and to bless you always. A.\nI shall often play upon the piano--your piano. It was like you to send it.\nDobbin was very soft-hearted. The sight of women and children in pain always used to melt him. The idea of Amelia broken-hearted and lonely tore that good-natured soul with anguish. And he broke out into an emotion, which anybody who likes may consider unmanly. He swore that Amelia was an angel, to which Osborne said aye with all his heart. He, too, had been reviewing the history of their lives--and had seen her from her childhood to her present age, so sweet, so innocent, so charmingly simple, and artlessly fond and tender.\nWhat a pang it was to lose all that: to have had it and not prized it! A thousand homely scenes and recollections crowded on him--in which he always saw her good and beautiful. And for himself, he blushed with remorse and shame, as the remembrance of his own selfishness and indifference contrasted with that perfect purity. For a while, glory, war, everything was forgotten, and the pair of friends talked about her only.\n\"Where are they?\" Osborne asked, after a long talk, and a long pause--and, in truth, with no little shame at thinking that he had taken no steps to follow her. \"Where are they? There's no address to the note.\"\nDobbin knew. He had not merely sent the piano; but had written a note to Mrs. Sedley, and asked permission to come and see her--and he had seen her, and Amelia too, yesterday, before he came down to Chatham; and, what is more, he had brought that farewell letter and packet which had so moved them.\nThe good-natured fellow had found Mrs. Sedley only too willing to receive him, and greatly agitated by the arrival of the piano, which, as she conjectured, MUST have come from George, and was a signal of amity on his part. Captain Dobbin did not correct this error of the worthy lady, but listened to all her story of complaints and misfortunes with great sympathy--condoled with her losses and privations, and agreed in reprehending the cruel conduct of Mr. Osborne towards his first benefactor. When she had eased her overflowing bosom somewhat, and poured forth many of her sorrows, he had the courage to ask actually to see Amelia, who was above in her room as usual, and whom her mother led trembling downstairs.\nHer appearance was so ghastly, and her look of despair so pathetic, that honest William Dobbin was frightened as he beheld it; and read the most fatal forebodings in that pale fixed face. After sitting in his company a minute or two, she put the packet into his hand, and said, \"Take this to Captain Osborne, if you please, and--and I hope he's quite well--and it was very kind of you to come and see us--and we like our new house very much. And I--I think I'll go upstairs, Mamma, for I'm not very strong.\" And with this, and a curtsey and a smile, the poor child went her way. The mother, as she led her up, cast back looks of anguish towards Dobbin. The good fellow wanted no such appeal. He loved her himself too fondly for that. Inexpressible grief, and pity, and terror pursued him, and he came away as if he was a criminal after seeing her.\nWhen Osborne heard that his friend had found her, he made hot and anxious inquiries regarding the poor child. How was she? How did she look? What did she say? His comrade took his hand, and looked him in the face.\n\"George, she's dying,\" William Dobbin said--and could speak no more.\nThere was a buxom Irish servant-girl, who performed all the duties of the little house where the Sedley family had found refuge: and this girl had in vain, on many previous days, striven to give Amelia aid or consolation. Emmy was much too sad to answer, or even to be aware of the attempts the other was making in her favour.\nFour hours after the talk between Dobbin and Osborne, this servant-maid came into Amelia's room, where she sate as usual, brooding silently over her letters--her little treasures. The girl, smiling, and looking arch and happy, made many trials to attract poor Emmy's attention, who, however, took no heed of her.\n\"Miss Emmy,\" said the girl.\n\"I'm coming,\" Emmy said, not looking round.\n\"There's a message,\" the maid went on. \"There's something--somebody--sure, here's a new letter for you--don't be reading them old ones any more.\" And she gave her a letter, which Emmy took, and read.\n\"I must see you,\" the letter said. \"Dearest Emmy--dearest love--dearest wife, come to me.\"\nGeorge and her mother were outside, waiting until she had read the letter.",
        "paragraph_chars": [
            [
                0,
                578
            ],
            [
                578,
                1842
            ],
            [
                1842,
                2578
            ],
            [
                2578,
                3556
            ],
            [
                3556,
                4478
            ],
            [
                4478,
                4829
            ],
            [
                4829,
                4885
            ],
            [
                4885,
                5531
            ],
            [
                5531,
                6565
            ],
            [
                6565,
                6798
            ],
            [
                6798,
                7259
            ],
            [
                7259,
                8247
            ],
            [
                8247,
                8785
            ],
            [
                8785,
                9465
            ],
            [
                9465,
                10555
            ],
            [
                10555,
                11017
            ],
            [
                11017,
                11549
            ],
            [
                11549,
                13157
            ],
            [
                13157,
                13619
            ],
            [
                13619,
                14416
            ],
            [
                14416,
                14810
            ],
            [
                14810,
                15438
            ],
            [
                15438,
                16036
            ],
            [
                16036,
                16636
            ],
            [
                16636,
                16889
            ],
            [
                16889,
                17189
            ],
            [
                17189,
                17362
            ],
            [
                17362,
                17713
            ],
            [
                17713,
                17789
            ],
            [
                17789,
                18337
            ],
            [
                18337,
                18848
            ],
            [
                18848,
                18976
            ],
            [
                18976,
                19699
            ],
            [
                19699,
                20776
            ],
            [
                20776,
                22303
            ],
            [
                22303,
                22638
            ],
            [
                22638,
                23233
            ],
            [
                23233,
                23308
            ],
            [
                23308,
                23844
            ],
            [
                23844,
                23919
            ],
            [
                23919,
                24450
            ],
            [
                24450,
                24873
            ],
            [
                24873,
                25083
            ],
            [
                25083,
                25382
            ],
            [
                25382,
                26100
            ],
            [
                26100,
                26948
            ],
            [
                26948,
                27162
            ],
            [
                27162,
                27231
            ],
            [
                27231,
                27558
            ],
            [
                27558,
                27871
            ],
            [
                27871,
                27899
            ],
            [
                27899,
                27943
            ],
            [
                27943,
                28143
            ],
            [
                28143,
                28234
            ],
            [
                28234,
                28308
            ]
        ],
        "segment_chars": [
            [
                0,
                132
            ],
            [
                132,
                578
            ],
            [
                578,
                611
            ],
            [
                611,
                1341
            ],
            [
                1341,
                1586
            ],
            [
                1586,
                1732
            ],
            [
                1732,
                1842
            ],
            [
                1842,
                1920
            ],
            [
                1920,
                1997
            ],
            [
                1997,
                2092
            ],
            [
                2092,
                2120
            ],
            [
                2120,
                2193
            ],
            [
                2193,
                2234
            ],
            [
                2234,
                2578
            ],
            [
                2578,
                2871
            ],
            [
                2871,
                2910
            ],
            [
                2910,
                2940
            ],
            [
                2940,
                2988
            ],
            [
                2988,
                3094
            ],
            [
                3094,
                3128
            ],
            [
                3128,
                3235
            ],
            [
                3235,
                3270
            ],
            [
                3270,
                3302
            ],
            [
                3302,
                3354
            ],
            [
                3354,
                3411
            ],
            [
                3411,
                3467
            ],
            [
                3467,
                3498
            ],
            [
                3498,
                3520
            ],
            [
                3520,
                3556
            ],
            [
                3556,
                3629
            ],
            [
                3629,
                3706
            ],
            [
                3706,
                3753
            ],
            [
                3753,
                3803
            ],
            [
                3803,
                3860
            ],
            [
                3860,
                3962
            ],
            [
                3962,
                4033
            ],
            [
                4033,
                4116
            ],
            [
                4116,
                4478
            ],
            [
                4478,
                4829
            ],
            [
                4829,
                4885
            ],
            [
                4885,
                4925
            ],
            [
                4925,
                4969
            ],
            [
                4969,
                5033
            ],
            [
                5033,
                5074
            ],
            [
                5074,
                5175
            ],
            [
                5175,
                5212
            ],
            [
                5212,
                5288
            ],
            [
                5288,
                5403
            ],
            [
                5403,
                5531
            ],
            [
                5531,
                5650
            ],
            [
                5650,
                5707
            ],
            [
                5707,
                5806
            ],
            [
                5806,
                5884
            ],
            [
                5884,
                5927
            ],
            [
                5927,
                6047
            ],
            [
                6047,
                6164
            ],
            [
                6164,
                6261
            ],
            [
                6261,
                6398
            ],
            [
                6398,
                6565
            ],
            [
                6565,
                6798
            ],
            [
                6798,
                6958
            ],
            [
                6958,
                7097
            ],
            [
                7097,
                7259
            ],
            [
                7259,
                7426
            ],
            [
                7426,
                7675
            ],
            [
                7675,
                7799
            ],
            [
                7799,
                7893
            ],
            [
                7893,
                8247
            ],
            [
                8247,
                8696
            ],
            [
                8696,
                8785
            ],
            [
                8785,
                9000
            ],
            [
                9000,
                9121
            ],
            [
                9121,
                9316
            ],
            [
                9316,
                9465
            ],
            [
                9465,
                9637
            ],
            [
                9637,
                9987
            ],
            [
                9987,
                10077
            ],
            [
                10077,
                10118
            ],
            [
                10118,
                10168
            ],
            [
                10168,
                10247
            ],
            [
                10247,
                10310
            ],
            [
                10310,
                10479
            ],
            [
                10479,
                10498
            ],
            [
                10498,
                10555
            ],
            [
                10555,
                10689
            ],
            [
                10689,
                11017
            ],
            [
                11017,
                11192
            ],
            [
                11192,
                11395
            ],
            [
                11395,
                11549
            ],
            [
                11549,
                12159
            ],
            [
                12159,
                12204
            ],
            [
                12204,
                12282
            ],
            [
                12282,
                12426
            ],
            [
                12426,
                12484
            ],
            [
                12484,
                12621
            ],
            [
                12621,
                12795
            ],
            [
                12795,
                12841
            ],
            [
                12841,
                12914
            ],
            [
                12914,
                12974
            ],
            [
                12974,
                13069
            ],
            [
                13069,
                13157
            ],
            [
                13157,
                13322
            ],
            [
                13322,
                13393
            ],
            [
                13393,
                13619
            ],
            [
                13619,
                13665
            ],
            [
                13665,
                13880
            ],
            [
                13880,
                14008
            ],
            [
                14008,
                14115
            ],
            [
                14115,
                14177
            ],
            [
                14177,
                14256
            ],
            [
                14256,
                14346
            ],
            [
                14346,
                14416
            ],
            [
                14416,
                14485
            ],
            [
                14485,
                14568
            ],
            [
                14568,
                14602
            ],
            [
                14602,
                14746
            ],
            [
                14746,
                14810
            ],
            [
                14810,
                14858
            ],
            [
                14858,
                14915
            ],
            [
                14915,
                15003
            ],
            [
                15003,
                15085
            ],
            [
                15085,
                15309
            ],
            [
                15309,
                15438
            ],
            [
                15438,
                15494
            ],
            [
                15494,
                15588
            ],
            [
                15588,
                15691
            ],
            [
                15691,
                15791
            ],
            [
                15791,
                15945
            ],
            [
                15945,
                16036
            ],
            [
                16036,
                16264
            ],
            [
                16264,
                16423
            ],
            [
                16423,
                16516
            ],
            [
                16516,
                16574
            ],
            [
                16574,
                16636
            ],
            [
                16636,
                16648
            ],
            [
                16648,
                16675
            ],
            [
                16675,
                16733
            ],
            [
                16733,
                16766
            ],
            [
                16766,
                16889
            ],
            [
                16889,
                16938
            ],
            [
                16938,
                16953
            ],
            [
                16953,
                16990
            ],
            [
                16990,
                17189
            ],
            [
                17189,
                17275
            ],
            [
                17275,
                17305
            ],
            [
                17305,
                17353
            ],
            [
                17353,
                17357
            ],
            [
                17357,
                17362
            ],
            [
                17362,
                17377
            ],
            [
                17377,
                17429
            ],
            [
                17429,
                17513
            ],
            [
                17513,
                17544
            ],
            [
                17544,
                17631
            ],
            [
                17631,
                17650
            ],
            [
                17650,
                17713
            ],
            [
                17713,
                17789
            ],
            [
                17789,
                17903
            ],
            [
                17903,
                17972
            ],
            [
                17972,
                18077
            ],
            [
                18077,
                18114
            ],
            [
                18114,
                18241
            ],
            [
                18241,
                18337
            ],
            [
                18337,
                18613
            ],
            [
                18613,
                18848
            ],
            [
                18848,
                18925
            ],
            [
                18925,
                18976
            ],
            [
                18976,
                19229
            ],
            [
                19229,
                19285
            ],
            [
                19285,
                19402
            ],
            [
                19402,
                19699
            ],
            [
                19699,
                19871
            ],
            [
                19871,
                20088
            ],
            [
                20088,
                20334
            ],
            [
                20334,
                20402
            ],
            [
                20402,
                20531
            ],
            [
                20531,
                20776
            ],
            [
                20776,
                21178
            ],
            [
                21178,
                21270
            ],
            [
                21270,
                21422
            ],
            [
                21422,
                21713
            ],
            [
                21713,
                21806
            ],
            [
                21806,
                21892
            ],
            [
                21892,
                22026
            ],
            [
                22026,
                22122
            ],
            [
                22122,
                22175
            ],
            [
                22175,
                22303
            ],
            [
                22303,
                22638
            ],
            [
                22638,
                22821
            ],
            [
                22821,
                22892
            ],
            [
                22892,
                22904
            ],
            [
                22904,
                23129
            ],
            [
                23129,
                23190
            ],
            [
                23190,
                23233
            ],
            [
                23233,
                23308
            ],
            [
                23308,
                23446
            ],
            [
                23446,
                23520
            ],
            [
                23520,
                23607
            ],
            [
                23607,
                23733
            ],
            [
                23733,
                23743
            ],
            [
                23743,
                23753
            ],
            [
                23753,
                23841
            ],
            [
                23841,
                23844
            ],
            [
                23844,
                23891
            ],
            [
                23891,
                23919
            ],
            [
                23919,
                23949
            ],
            [
                23949,
                24014
            ],
            [
                24014,
                24101
            ],
            [
                24101,
                24181
            ],
            [
                24181,
                24262
            ],
            [
                24262,
                24450
            ],
            [
                24450,
                24521
            ],
            [
                24521,
                24627
            ],
            [
                24627,
                24775
            ],
            [
                24775,
                24873
            ],
            [
                24873,
                24891
            ],
            [
                24891,
                25033
            ],
            [
                25033,
                25050
            ],
            [
                25050,
                25083
            ],
            [
                25083,
                25096
            ],
            [
                25096,
                25382
            ],
            [
                25382,
                25605
            ],
            [
                25605,
                25879
            ],
            [
                25879,
                26100
            ],
            [
                26100,
                26288
            ],
            [
                26288,
                26542
            ],
            [
                26542,
                26608
            ],
            [
                26608,
                26679
            ],
            [
                26679,
                26753
            ],
            [
                26753,
                26792
            ],
            [
                26792,
                26834
            ],
            [
                26834,
                26948
            ],
            [
                26948,
                27058
            ],
            [
                27058,
                27071
            ],
            [
                27071,
                27089
            ],
            [
                27089,
                27107
            ],
            [
                27107,
                27162
            ],
            [
                27162,
                27231
            ],
            [
                27231,
                27453
            ],
            [
                27453,
                27558
            ],
            [
                27558,
                27738
            ],
            [
                27738,
                27871
            ],
            [
                27871,
                27899
            ],
            [
                27899,
                27943
            ],
            [
                27943,
                27982
            ],
            [
                27982,
                28089
            ],
            [
                28089,
                28143
            ],
            [
                28143,
                28178
            ],
            [
                28178,
                28234
            ],
            [
                28234,
                28308
            ]
        ],
        "overlap_chars": [
            [
                0,
                74
            ],
            [
                89,
                132
            ],
            [
                132,
                218
            ],
            [
                291,
                293
            ],
            [
                321,
                417
            ],
            [
                432,
                489
            ],
            [
                491,
                513
            ],
            [
                527,
                578
            ],
            [
                578,
                611
            ],
            [
                611,
                719
            ],
            [
                862,
                880
            ],
            [
                894,
                934
            ],
            [
                1087,
                1107
            ],
            [
                809,
                813
            ],
            [
                1122,
                1123
            ],
            [
                1116,
                1121
            ],
            [
                1124,
                1148
            ],
            [
                1167,
                1184
            ],
            [
                1191,
                1244
            ],
            [
                1267,
                1286
            ],
            [
                1292,
                1315
            ],
            [
                1339,
                1341
            ],
            [
                1622,
                1651
            ],
            [
                1652,
                1667
            ],
            [
                1672,
                1676
            ],
            [
                1862,
                1892
            ],
            [
                1898,
                1920
            ],
            [
                1920,
                1944
            ],
            [
                1953,
                1963
            ],
            [
                1995,
                1997
            ],
            [
                1997,
                2031
            ],
            [
                2038,
                2063
            ],
            [
                2064,
                2092
            ],
            [
                2120,
                2192
            ],
            [
                2193,
                2212
            ],
            [
                2232,
                2234
            ],
            [
                2234,
                2378
            ],
            [
                2405,
                2518
            ],
            [
                2554,
                2557
            ],
            [
                2524,
                2540
            ],
            [
                2576,
                2578
            ],
            [
                2578,
                2689
            ],
            [
                2691,
                2746
            ],
            [
                2752,
                2758
            ],
            [
                2780,
                2815
            ],
            [
                2817,
                2870
            ],
            [
                2871,
                2889
            ],
            [
                2890,
                2900
            ],
            [
                2908,
                2910
            ],
            [
                2910,
                2940
            ],
            [
                2940,
                2988
            ],
            [
                3048,
                3092
            ],
            [
                3092,
                3094
            ],
            [
                3094,
                3128
            ],
            [
                3128,
                3150
            ],
            [
                3200,
                3201
            ],
            [
                3151,
                3164
            ],
            [
                3202,
                3207
            ],
            [
                3173,
                3187
            ],
            [
                3191,
                3200
            ],
            [
                3209,
                3235
            ],
            [
                3235,
                3247
            ],
            [
                3251,
                3268
            ],
            [
                3302,
                3354
            ],
            [
                3411,
                3439
            ],
            [
                3467,
                3498
            ],
            [
                3498,
                3511
            ],
            [
                3518,
                3520
            ],
            [
                3520,
                3556
            ],
            [
                3556,
                3594
            ],
            [
                3611,
                3612
            ],
            [
                3632,
                3664
            ],
            [
                3683,
                3706
            ],
            [
                3753,
                3803
            ],
            [
                3803,
                3841
            ],
            [
                3858,
                3860
            ],
            [
                3860,
                3911
            ],
            [
                3962,
                3999
            ],
            [
                3960,
                3961
            ],
            [
                4033,
                4065
            ],
            [
                4116,
                4119
            ],
            [
                4125,
                4158
            ],
            [
                4185,
                4205
            ],
            [
                4216,
                4225
            ],
            [
                4240,
                4322
            ],
            [
                4114,
                4115
            ],
            [
                4324,
                4346
            ],
            [
                4354,
                4362
            ],
            [
                4371,
                4385
            ],
            [
                4409,
                4441
            ],
            [
                4454,
                4478
            ],
            [
                4478,
                4527
            ],
            [
                4533,
                4558
            ],
            [
                4588,
                4616
            ],
            [
                4574,
                4575
            ],
            [
                4637,
                4683
            ],
            [
                4690,
                4701
            ],
            [
                4776,
                4829
            ],
            [
                4829,
                4885
            ],
            [
                4885,
                4925
            ],
            [
                4925,
                4938
            ],
            [
                4940,
                4957
            ],
            [
                4959,
                4969
            ],
            [
                4969,
                4993
            ],
            [
                5018,
                5033
            ],
            [
                5175,
                5192
            ],
            [
                5216,
                5233
            ],
            [
                5288,
                5306
            ],
            [
                5311,
                5371
            ],
            [
                5387,
                5403
            ],
            [
                5403,
                5531
            ],
            [
                5531,
                5614
            ],
            [
                5621,
                5650
            ],
            [
                5707,
                5766
            ],
            [
                5784,
                5804
            ],
            [
                5806,
                5828
            ],
            [
                5843,
                5869
            ],
            [
                5882,
                5884
            ],
            [
                5884,
                5927
            ],
            [
                5927,
                5946
            ],
            [
                5951,
                6047
            ],
            [
                6083,
                6097
            ],
            [
                6109,
                6163
            ],
            [
                6568,
                6629
            ],
            [
                6643,
                6648
            ],
            [
                6662,
                6666
            ],
            [
                6668,
                6683
            ],
            [
                6693,
                6798
            ],
            [
                7018,
                7021
            ],
            [
                7078,
                7088
            ],
            [
                7002,
                7005
            ],
            [
                7089,
                7097
            ],
            [
                7097,
                7219
            ],
            [
                7257,
                7259
            ],
            [
                7426,
                7429
            ],
            [
                7459,
                7474
            ],
            [
                7551,
                7587
            ],
            [
                7589,
                7624
            ],
            [
                7673,
                7675
            ],
            [
                7799,
                7810
            ],
            [
                7852,
                7893
            ],
            [
                7893,
                7919
            ],
            [
                7968,
                7969
            ],
            [
                7920,
                7927
            ],
            [
                8038,
                8233
            ],
            [
                8245,
                8247
            ],
            [
                8247,
                8306
            ],
            [
                8323,
                8324
            ],
            [
                8307,
                8316
            ],
            [
                8425,
                8429
            ],
            [
                8401,
                8413
            ],
            [
                8430,
                8434
            ],
            [
                8338,
                8341
            ],
            [
                8451,
                8471
            ],
            [
                8473,
                8481
            ],
            [
                8497,
                8506
            ],
            [
                8520,
                8562
            ],
            [
                8694,
                8695
            ],
            [
                8564,
                8604
            ],
            [
                8606,
                8648
            ],
            [
                8650,
                8676
            ],
            [
                8785,
                8812
            ],
            [
                8829,
                8865
            ],
            [
                8879,
                8888
            ],
            [
                8948,
                9000
            ],
            [
                9000,
                9023
            ],
            [
                9045,
                9121
            ],
            [
                9121,
                9170
            ],
            [
                9204,
                9210
            ],
            [
                9212,
                9239
            ],
            [
                9244,
                9247
            ],
            [
                9256,
                9279
            ],
            [
                9314,
                9315
            ],
            [
                10555,
                10615
            ],
            [
                10625,
                10637
            ],
            [
                10687,
                10689
            ],
            [
                10689,
                11017
            ],
            [
                11017,
                11055
            ],
            [
                11079,
                11116
            ],
            [
                11118,
                11130
            ],
            [
                11153,
                11156
            ],
            [
                11187,
                11190
            ],
            [
                11157,
                11162
            ],
            [
                11190,
                11192
            ],
            [
                11228,
                11230
            ],
            [
                11195,
                11201
            ],
            [
                11221,
                11227
            ],
            [
                11313,
                11314
            ],
            [
                11319,
                11322
            ],
            [
                11331,
                11339
            ],
            [
                11349,
                11360
            ],
            [
                11372,
                11394
            ],
            [
                11549,
                11574
            ],
            [
                11600,
                11601
            ],
            [
                11781,
                11848
            ],
            [
                11901,
                11952
            ],
            [
                12159,
                12204
            ],
            [
                12204,
                12235
            ],
            [
                12240,
                12244
            ],
            [
                12280,
                12282
            ],
            [
                12282,
                12292
            ],
            [
                12313,
                12321
            ],
            [
                12370,
                12385
            ],
            [
                12395,
                12426
            ],
            [
                12484,
                12520
            ],
            [
                12521,
                12620
            ],
            [
                12621,
                12681
            ],
            [
                12704,
                12733
            ],
            [
                12753,
                12794
            ],
            [
                13157,
                13230
            ],
            [
                13249,
                13302
            ],
            [
                13320,
                13322
            ],
            [
                13322,
                13367
            ],
            [
                13377,
                13380
            ],
            [
                13369,
                13375
            ],
            [
                13391,
                13393
            ],
            [
                13393,
                13619
            ],
            [
                13619,
                13622
            ],
            [
                13650,
                13665
            ],
            [
                13846,
                13849
            ],
            [
                13728,
                13736
            ],
            [
                13742,
                13745
            ],
            [
                13715,
                13726
            ],
            [
                13780,
                13798
            ],
            [
                13800,
                13844
            ],
            [
                13850,
                13880
            ],
            [
                13914,
                13953
            ],
            [
                13955,
                14008
            ],
            [
                14115,
                14136
            ],
            [
                14152,
                14177
            ],
            [
                14177,
                14202
            ],
            [
                14225,
                14256
            ],
            [
                14346,
                14416
            ],
            [
                14416,
                14471
            ],
            [
                14656,
                14668
            ],
            [
                14686,
                14746
            ],
            [
                14810,
                14858
            ],
            [
                14858,
                14914
            ],
            [
                14915,
                14973
            ],
            [
                14991,
                15003
            ],
            [
                15299,
                15300
            ],
            [
                15011,
                15083
            ],
            [
                15219,
                15224
            ],
            [
                15093,
                15104
            ],
            [
                15205,
                15219
            ],
            [
                15234,
                15241
            ],
            [
                15248,
                15265
            ],
            [
                15009,
                15010
            ],
            [
                15438,
                15449
            ],
            [
                15454,
                15494
            ],
            [
                15494,
                15543
            ],
            [
                15545,
                15549
            ],
            [
                15551,
                15557
            ],
            [
                15562,
                15567
            ],
            [
                15570,
                15588
            ],
            [
                15588,
                15617
            ],
            [
                15641,
                15691
            ],
            [
                15945,
                15970
            ],
            [
                16020,
                16036
            ],
            [
                16036,
                16075
            ],
            [
                16086,
                16119
            ],
            [
                16125,
                16130
            ],
            [
                16149,
                16152
            ],
            [
                16168,
                16198
            ],
            [
                16203,
                16214
            ],
            [
                16262,
                16264
            ],
            [
                16423,
                16516
            ],
            [
                16516,
                16574
            ],
            [
                16574,
                16580
            ],
            [
                16593,
                16632
            ],
            [
                16636,
                16648
            ],
            [
                16648,
                16675
            ],
            [
                16675,
                16733
            ],
            [
                16766,
                16841
            ],
            [
                16857,
                16889
            ],
            [
                16889,
                16928
            ],
            [
                16971,
                16990
            ],
            [
                16990,
                17029
            ],
            [
                17035,
                17051
            ],
            [
                17063,
                17082
            ],
            [
                17117,
                17120
            ],
            [
                17126,
                17137
            ],
            [
                17153,
                17162
            ],
            [
                17169,
                17189
            ],
            [
                17189,
                17275
            ],
            [
                17275,
                17305
            ],
            [
                17305,
                17333
            ],
            [
                17341,
                17353
            ],
            [
                17353,
                17357
            ],
            [
                17357,
                17362
            ],
            [
                17362,
                17364
            ],
            [
                17365,
                17377
            ],
            [
                17377,
                17398
            ],
            [
                17427,
                17429
            ],
            [
                17429,
                17513
            ],
            [
                17513,
                17544
            ],
            [
                17544,
                17631
            ],
            [
                17631,
                17650
            ],
            [
                17650,
                17678
            ],
            [
                17710,
                17713
            ],
            [
                17713,
                17714
            ],
            [
                17736,
                17789
            ],
            [
                17789,
                17790
            ],
            [
                17828,
                17879
            ],
            [
                17889,
                17903
            ],
            [
                17903,
                17972
            ],
            [
                17972,
                18024
            ],
            [
                18026,
                18077
            ],
            [
                18077,
                18083
            ],
            [
                18094,
                18099
            ],
            [
                18109,
                18114
            ],
            [
                18114,
                18152
            ],
            [
                18239,
                18241
            ],
            [
                18242,
                18278
            ],
            [
                18280,
                18303
            ],
            [
                18311,
                18337
            ],
            [
                18451,
                18465
            ],
            [
                18379,
                18383
            ],
            [
                18351,
                18358
            ],
            [
                18420,
                18423
            ],
            [
                18361,
                18366
            ],
            [
                18384,
                18396
            ],
            [
                18414,
                18419
            ],
            [
                18488,
                18569
            ],
            [
                18582,
                18599
            ],
            [
                18435,
                18440
            ],
            [
                18604,
                18612
            ],
            [
                18848,
                18925
            ],
            [
                18925,
                18976
            ],
            [
                19008,
                19106
            ],
            [
                19227,
                19229
            ],
            [
                19229,
                19250
            ],
            [
                19268,
                19285
            ],
            [
                19285,
                19311
            ],
            [
                19324,
                19366
            ],
            [
                19372,
                19402
            ],
            [
                19402,
                19425
            ],
            [
                19440,
                19457
            ],
            [
                19495,
                19517
            ],
            [
                19524,
                19546
            ],
            [
                19577,
                19624
            ],
            [
                19625,
                19635
            ],
            [
                19643,
                19689
            ],
            [
                19697,
                19699
            ],
            [
                19699,
                19756
            ],
            [
                19761,
                19768
            ],
            [
                19774,
                19809
            ],
            [
                19869,
                19871
            ],
            [
                19871,
                19911
            ],
            [
                19927,
                19986
            ],
            [
                20086,
                20088
            ],
            [
                20088,
                20104
            ],
            [
                20114,
                20117
            ],
            [
                20126,
                20160
            ],
            [
                20169,
                20225
            ],
            [
                20332,
                20333
            ],
            [
                20334,
                20367
            ],
            [
                20400,
                20402
            ],
            [
                20402,
                20432
            ],
            [
                20464,
                20531
            ],
            [
                20531,
                20546
            ],
            [
                20568,
                20572
            ],
            [
                20579,
                20581
            ],
            [
                20587,
                20607
            ],
            [
                20631,
                20695
            ],
            [
                20612,
                20616
            ],
            [
                20701,
                20758
            ],
            [
                20774,
                20776
            ],
            [
                21154,
                21156
            ],
            [
                20847,
                20851
            ],
            [
                20790,
                20799
            ],
            [
                20869,
                20870
            ],
            [
                20876,
                20910
            ],
            [
                20916,
                20921
            ],
            [
                20931,
                20945
            ],
            [
                20975,
                21007
            ],
            [
                21008,
                21014
            ],
            [
                21078,
                21121
            ],
            [
                21134,
                21138
            ],
            [
                21176,
                21178
            ],
            [
                21178,
                21234
            ],
            [
                21240,
                21270
            ],
            [
                21270,
                21380
            ],
            [
                21410,
                21422
            ],
            [
                21422,
                21455
            ],
            [
                21465,
                21513
            ],
            [
                21552,
                21556
            ],
            [
                21563,
                21573
            ],
            [
                21540,
                21546
            ],
            [
                21574,
                21611
            ],
            [
                21625,
                21671
            ],
            [
                21685,
                21712
            ],
            [
                21806,
                21815
            ],
            [
                21821,
                21872
            ],
            [
                21879,
                21892
            ],
            [
                21892,
                21922
            ],
            [
                21923,
                21937
            ],
            [
                21999,
                22026
            ],
            [
                22175,
                22227
            ],
            [
                22248,
                22295
            ],
            [
                22301,
                22303
            ],
            [
                22303,
                22359
            ],
            [
                22474,
                22477
            ],
            [
                22436,
                22444
            ],
            [
                22456,
                22472
            ],
            [
                22522,
                22538
            ],
            [
                22378,
                22379
            ],
            [
                22594,
                22638
            ],
            [
                22638,
                22709
            ],
            [
                22711,
                22759
            ],
            [
                22760,
                22777
            ],
            [
                22808,
                22815
            ],
            [
                22819,
                22820
            ],
            [
                22821,
                22825
            ],
            [
                22833,
                22850
            ],
            [
                22882,
                22890
            ],
            [
                22858,
                22868
            ],
            [
                22890,
                22892
            ],
            [
                22892,
                22904
            ],
            [
                22904,
                22929
            ],
            [
                23112,
                23116
            ],
            [
                23018,
                23019
            ],
            [
                23127,
                23129
            ],
            [
                23129,
                23167
            ],
            [
                23188,
                23190
            ],
            [
                23190,
                23191
            ],
            [
                23203,
                23233
            ],
            [
                23252,
                23258
            ],
            [
                23302,
                23308
            ],
            [
                23308,
                23373
            ],
            [
                23398,
                23400
            ],
            [
                23379,
                23394
            ],
            [
                23400,
                23446
            ],
            [
                23455,
                23470
            ],
            [
                23479,
                23520
            ],
            [
                23526,
                23527
            ],
            [
                23533,
                23607
            ],
            [
                23607,
                23633
            ],
            [
                23644,
                23708
            ],
            [
                23713,
                23733
            ],
            [
                23733,
                23743
            ],
            [
                23753,
                23841
            ],
            [
                23841,
                23844
            ],
            [
                23844,
                23877
            ],
            [
                23879,
                23891
            ],
            [
                23891,
                23919
            ],
            [
                23919,
                23949
            ],
            [
                23949,
                24014
            ],
            [
                24014,
                24101
            ],
            [
                24181,
                24215
            ],
            [
                24225,
                24232
            ],
            [
                24242,
                24261
            ],
            [
                24264,
                24279
            ],
            [
                24302,
                24304
            ],
            [
                24335,
                24353
            ],
            [
                24372,
                24437
            ],
            [
                24448,
                24449
            ],
            [
                24450,
                24521
            ],
            [
                24644,
                24667
            ],
            [
                24677,
                24685
            ],
            [
                24698,
                24704
            ],
            [
                24709,
                24753
            ],
            [
                24759,
                24775
            ],
            [
                24775,
                24873
            ],
            [
                24873,
                24891
            ],
            [
                24891,
                24904
            ],
            [
                24948,
                24957
            ],
            [
                24991,
                25033
            ],
            [
                25050,
                25083
            ],
            [
                25083,
                25096
            ],
            [
                25096,
                25128
            ],
            [
                25257,
                25258
            ],
            [
                25130,
                25172
            ],
            [
                25218,
                25257
            ],
            [
                25380,
                25381
            ],
            [
                25406,
                25517
            ],
            [
                25521,
                25524
            ],
            [
                25536,
                25564
            ],
            [
                25603,
                25605
            ],
            [
                25605,
                25635
            ],
            [
                25762,
                25765
            ],
            [
                25641,
                25646
            ],
            [
                25665,
                25690
            ],
            [
                25715,
                25746
            ],
            [
                25877,
                25879
            ],
            [
                25968,
                25970
            ],
            [
                26003,
                26025
            ],
            [
                26032,
                26043
            ],
            [
                26052,
                26100
            ],
            [
                26100,
                26172
            ],
            [
                26180,
                26209
            ],
            [
                26225,
                26226
            ],
            [
                26213,
                26215
            ],
            [
                26231,
                26288
            ],
            [
                26288,
                26325
            ],
            [
                26332,
                26352
            ],
            [
                26353,
                26427
            ],
            [
                26429,
                26455
            ],
            [
                26461,
                26503
            ],
            [
                26509,
                26542
            ],
            [
                26542,
                26547
            ],
            [
                26549,
                26607
            ],
            [
                26608,
                26616
            ],
            [
                26627,
                26664
            ],
            [
                26677,
                26679
            ],
            [
                26834,
                26854
            ],
            [
                26859,
                26863
            ],
            [
                26865,
                26883
            ],
            [
                26893,
                26905
            ],
            [
                26946,
                26948
            ],
            [
                26953,
                26960
            ],
            [
                27001,
                27005
            ],
            [
                27014,
                27031
            ],
            [
                26993,
                26996
            ],
            [
                27056,
                27058
            ],
            [
                27058,
                27071
            ],
            [
                27089,
                27107
            ],
            [
                27107,
                27162
            ],
            [
                27162,
                27204
            ],
            [
                27206,
                27231
            ],
            [
                27231,
                27377
            ],
            [
                27418,
                27453
            ],
            [
                27453,
                27477
            ],
            [
                27497,
                27508
            ],
            [
                27546,
                27549
            ],
            [
                27513,
                27521
            ],
            [
                27556,
                27558
            ],
            [
                27558,
                27634
            ],
            [
                27635,
                27664
            ],
            [
                27680,
                27688
            ],
            [
                27698,
                27714
            ],
            [
                27716,
                27737
            ],
            [
                27871,
                27899
            ],
            [
                27899,
                27943
            ],
            [
                27943,
                27982
            ],
            [
                27982,
                28000
            ],
            [
                28012,
                28045
            ],
            [
                28047,
                28089
            ],
            [
                28089,
                28143
            ],
            [
                28143,
                28178
            ],
            [
                28178,
                28191
            ],
            [
                28193,
                28205
            ],
            [
                28207,
                28234
            ],
            [
                28234,
                28277
            ],
            [
                28307,
                28308
            ]
        ],
        "row_chars": [
            [
                0,
                132
            ],
            [
                132,
                578
            ],
            [
                578,
                611
            ],
            [
                611,
                1341
            ],
            [
                1341,
                1586
            ],
            [
                1586,
                1732
            ],
            [
                1732,
                1842
            ],
            [
                1842,
                1920
            ],
            [
                1920,
                1997
            ],
            [
                1997,
                2092
            ],
            [
                2092,
                2120
            ],
            [
                2120,
                2193
            ],
            [
                2193,
                2234
            ],
            [
                2234,
                2578
            ],
            [
                2578,
                2871
            ],
            [
                2871,
                2910
            ],
            [
                2910,
                2940
            ],
            [
                2940,
                2988
            ],
            [
                2988,
                3094
            ],
            [
                3094,
                3128
            ],
            [
                3128,
                3235
            ],
            [
                3235,
                3270
            ],
            [
                3270,
                3302
            ],
            [
                3302,
                3354
            ],
            [
                3354,
                3411
            ],
            [
                3411,
                3498
            ],
            [
                3498,
                3520
            ],
            [
                3520,
                3556
            ],
            [
                3556,
                3706
            ],
            [
                3706,
                3753
            ],
            [
                3753,
                3803
            ],
            [
                3803,
                3860
            ],
            [
                3860,
                4033
            ],
            [
                4033,
                4478
            ],
            [
                4478,
                4829
            ],
            [
                4829,
                4885
            ],
            [
                4885,
                4925
            ],
            [
                4925,
                4969
            ],
            [
                4969,
                5033
            ],
            [
                5033,
                5074
            ],
            [
                5074,
                5175
            ],
            [
                5175,
                5403
            ],
            [
                5403,
                5531
            ],
            [
                5531,
                5650
            ],
            [
                5650,
                5707
            ],
            [
                5707,
                5806
            ],
            [
                5806,
                5884
            ],
            [
                5884,
                5927
            ],
            [
                5927,
                6047
            ],
            [
                6047,
                6164
            ],
            [
                6164,
                6261
            ],
            [
                6261,
                6398
            ],
            [
                6398,
                6565
            ],
            [
                6565,
                6798
            ],
            [
                6798,
                6958
            ],
            [
                6958,
                7097
            ],
            [
                7097,
                7259
            ],
            [
                7259,
                7426
            ],
            [
                7426,
                7675
            ],
            [
                7675,
                7799
            ],
            [
                7799,
                7893
            ],
            [
                7893,
                8247
            ],
            [
                8247,
                8696
            ],
            [
                8696,
                8785
            ],
            [
                8785,
                9000
            ],
            [
                9000,
                9121
            ],
            [
                9121,
                9316
            ],
            [
                9316,
                9465
            ],
            [
                9465,
                9637
            ],
            [
                9637,
                9987
            ],
            [
                9987,
                10077
            ],
            [
                10077,
                10118
            ],
            [
                10118,
                10168
            ],
            [
                10168,
                10247
            ],
            [
                10247,
                10310
            ],
            [
                10310,
                10479
            ],
            [
                10479,
                10498
            ],
            [
                10498,
                10555
            ],
            [
                10555,
                10689
            ],
            [
                10689,
                11017
            ],
            [
                11017,
                11192
            ],
            [
                11192,
                11395
            ],
            [
                11395,
                11549
            ],
            [
                11549,
                12159
            ],
            [
                12159,
                12204
            ],
            [
                12204,
                12282
            ],
            [
                12282,
                12426
            ],
            [
                12426,
                12484
            ],
            [
                12484,
                12621
            ],
            [
                12621,
                12795
            ],
            [
                12795,
                12841
            ],
            [
                12841,
                12914
            ],
            [
                12914,
                12974
            ],
            [
                12974,
                13069
            ],
            [
                13069,
                13157
            ],
            [
                13157,
                13322
            ],
            [
                13322,
                13393
            ],
            [
                13393,
                13619
            ],
            [
                13619,
                13665
            ],
            [
                13665,
                13880
            ],
            [
                13880,
                14008
            ],
            [
                14008,
                14115
            ],
            [
                14115,
                14177
            ],
            [
                14177,
                14256
            ],
            [
                14256,
                14346
            ],
            [
                14346,
                14416
            ],
            [
                14416,
                14746
            ],
            [
                14746,
                14810
            ],
            [
                14810,
                14858
            ],
            [
                14858,
                14915
            ],
            [
                14915,
                15003
            ],
            [
                15003,
                15309
            ],
            [
                15309,
                15438
            ],
            [
                15438,
                15494
            ],
            [
                15494,
                15588
            ],
            [
                15588,
                15691
            ],
            [
                15691,
                15791
            ],
            [
                15791,
                15945
            ],
            [
                15945,
                16036
            ],
            [
                16036,
                16264
            ],
            [
                16264,
                16423
            ],
            [
                16423,
                16516
            ],
            [
                16516,
                16574
            ],
            [
                16574,
                16636
            ],
            [
                16636,
                16648
            ],
            [
                16648,
                16675
            ],
            [
                16675,
                16733
            ],
            [
                16733,
                16766
            ],
            [
                16766,
                16889
            ],
            [
                16889,
                16990
            ],
            [
                16990,
                17189
            ],
            [
                17189,
                17275
            ],
            [
                17275,
                17305
            ],
            [
                17305,
                17353
            ],
            [
                17353,
                17357
            ],
            [
                17357,
                17362
            ],
            [
                17362,
                17377
            ],
            [
                17377,
                17429
            ],
            [
                17429,
                17513
            ],
            [
                17513,
                17544
            ],
            [
                17544,
                17631
            ],
            [
                17631,
                17650
            ],
            [
                17650,
                17713
            ],
            [
                17713,
                17789
            ],
            [
                17789,
                17903
            ],
            [
                17903,
                17972
            ],
            [
                17972,
                18077
            ],
            [
                18077,
                18114
            ],
            [
                18114,
                18241
            ],
            [
                18241,
                18337
            ],
            [
                18337,
                18613
            ],
            [
                18613,
                18848
            ],
            [
                18848,
                18925
            ],
            [
                18925,
                18976
            ],
            [
                18976,
                19229
            ],
            [
                19229,
                19285
            ],
            [
                19285,
                19402
            ],
            [
                19402,
                19699
            ],
            [
                19699,
                19871
            ],
            [
                19871,
                20088
            ],
            [
                20088,
                20334
            ],
            [
                20334,
                20402
            ],
            [
                20402,
                20531
            ],
            [
                20531,
                20776
            ],
            [
                20776,
                21178
            ],
            [
                21178,
                21270
            ],
            [
                21270,
                21422
            ],
            [
                21422,
                21713
            ],
            [
                21713,
                21806
            ],
            [
                21806,
                21892
            ],
            [
                21892,
                22026
            ],
            [
                22026,
                22122
            ],
            [
                22122,
                22175
            ],
            [
                22175,
                22303
            ],
            [
                22303,
                22638
            ],
            [
                22638,
                22821
            ],
            [
                22821,
                22892
            ],
            [
                22892,
                22904
            ],
            [
                22904,
                23129
            ],
            [
                23129,
                23190
            ],
            [
                23190,
                23233
            ],
            [
                23233,
                23308
            ],
            [
                23308,
                23446
            ],
            [
                23446,
                23520
            ],
            [
                23520,
                23607
            ],
            [
                23607,
                23733
            ],
            [
                23733,
                23743
            ],
            [
                23743,
                23753
            ],
            [
                23753,
                23841
            ],
            [
                23841,
                23844
            ],
            [
                23844,
                23891
            ],
            [
                23891,
                23919
            ],
            [
                23919,
                23949
            ],
            [
                23949,
                24014
            ],
            [
                24014,
                24101
            ],
            [
                24101,
                24181
            ],
            [
                24181,
                24262
            ],
            [
                24262,
                24450
            ],
            [
                24450,
                24521
            ],
            [
                24521,
                24627
            ],
            [
                24627,
                24775
            ],
            [
                24775,
                24873
            ],
            [
                24873,
                24891
            ],
            [
                24891,
                25033
            ],
            [
                25033,
                25050
            ],
            [
                25050,
                25083
            ],
            [
                25083,
                25096
            ],
            [
                25096,
                25382
            ],
            [
                25382,
                25605
            ],
            [
                25605,
                25879
            ],
            [
                25879,
                26100
            ],
            [
                26100,
                26288
            ],
            [
                26288,
                26542
            ],
            [
                26542,
                26608
            ],
            [
                26608,
                26679
            ],
            [
                26679,
                26753
            ],
            [
                26753,
                26792
            ],
            [
                26792,
                26834
            ],
            [
                26834,
                26948
            ],
            [
                26948,
                27058
            ],
            [
                27058,
                27071
            ],
            [
                27071,
                27089
            ],
            [
                27089,
                27107
            ],
            [
                27107,
                27162
            ],
            [
                27162,
                27231
            ],
            [
                27231,
                27453
            ],
            [
                27453,
                27558
            ],
            [
                27558,
                27738
            ],
            [
                27738,
                27871
            ],
            [
                27871,
                27899
            ],
            [
                27899,
                27943
            ],
            [
                27943,
                27982
            ],
            [
                27982,
                28089
            ],
            [
                28089,
                28143
            ],
            [
                28143,
                28178
            ],
            [
                28178,
                28234
            ],
            [
                28234,
                28308
            ]
        ]
    },
    "abridged": {
        "text": "Our surprised story now finds itself for a moment among very famous events, and hanging on to the skirts of history. When the eagles of Napoleon Bonaparte, the Corsican upstart, were flying from Provence to the towers of Notre Dame, I wonder whether the Imperial birds had any eye for a little corner of Bloomsbury, London, which you might have thought so quiet that even the whirring of those mighty wings would pass unobserved there?\n\"Napoleon has landed at Cannes.\" Such news might create a panic at Vienna, and cause Russia to drop his cards, and take Prussia into a corner; but how was this news to affect a young lady in Russell Square: who, if she walked even a short distance to buy a ribbon, was followed by Sambo with an enormous cane: who was always cared for and watched over by so many guardian angels? Yet the great roaring war tempest was coming to sweep her family down.\nHer father's fortune was swept away with that fatal news. All his speculations had gone wrong. Ventures had failed; merchants had gone broke; funds had risen when he had calculated they would fall. If success is rare and slow, everybody knows how quick and easy ruin is.\nOld Sedley had kept silent. Everything seemed to go on as usual in the quiet, opulent house; the good-natured mistress pursuing, quite unsuspiciously, her bustling idleness; the daughter absorbed still in one selfish, tender thought, and quite regardless of all the world besides, when the final crash came.\nOne night Mrs. Sedley was writing cards for a party; the Osbornes had given one, and she must not be behindhand. John Sedley, who had come home very late from the City, sat silent while his wife was prattling to him. Emmy had gone up to her room ailing and low-spirited.\n\"She's not happy,\" said the mother. \"George Osborne neglects her. I've no patience with the airs of those people. George has been twice in town without coming here. Edward Dale saw him at the Opera. Edward would marry her, I'm sure: and so would Captain Dobbin, I think - only I hate all army men. Such a dandy George has become! We must show some folks that we're as good as they. We must have a party, Mr. S. Shall I say Tuesday fortnight? Why don't you speak, John? Good God, John, what has happened?\"\nJohn Sedley sprang up out of his chair, seized her in his arms, and said, \"We're ruined, Mary. It's best that you should know all, and at once.\" As he spoke, he trembled in every limb. He thought the news would have overpowered his wife; but it was he that was the most moved.\nWhen he sank back into his seat, she held his trembling hand, and kissed it: she called him her dear John - her kind old man; she poured out a hundred words of incoherent love and tenderness. Her faithful voice and caresses caused this sad heart delight and anguish, and cheered his over-burdened soul.\nOnly once in the course of the long night as they sat together, and poor Sedley told the story of his losses - the treason of some of his oldest friends, the kindness of others - only once did the faithful wife give way to emotion.\n\"My God, my God, it will break Emmy's heart,\" she said.\nThe father had forgotten the poor girl. She was lying awake and unhappy overhead. In the midst of friends, she was alone. Our gentle Amelia had no confidante; she could not tell her old mother her doubts and cares; the would-be sisters seemed strange to her. And she had misgivings and fears which she dared not acknowledge to herself, though she was always secretly brooding over them.\nHer heart tried to persist in asserting that George Osborne was worthy and faithful, though she knew otherwise. How many suspicions of selfishness and indifference had she obstinately overcome! To whom could the poor girl tell these daily struggles? Her hero himself only half understood her. She did not dare to admit that the man she loved was her inferior; or to feel that she had given her heart away too soon. She was too modest, too trustful, too weak, too much woman to recall it.\nThus imprisoned and tortured was this gentle little heart, when in March 1815 Napoleon landed in France, and Louis XVIII fled, and all Europe was in alarm, and the funds fell, and old John Sedley was ruined.\nHis bankruptcy was made formal. The house and furniture of Russell Square were seized and sold up, and he and his family were thrust away, as we have seen.\nThe servants were discharged - they were sorry to leave good places, but they did not break their hearts. Black Sambo determined on setting up a public-house. Honest old Mrs. Blenkinsop, indeed, would have stayed without wages, having amassed a considerable sum in their service: and she accompanied the fallen people into their new and humble place of refuge, where she tended them and grumbled against them.\nOf all Sedley's opponents in his debates with his creditors, which now aged him more in six weeks than the fifteen years before - the most obstinate opponent was John Osborne, his old friend and neighbour. John Osborne, whom he had set up in life - who was under a hundred obligations to him - and whose son was to marry Amelia.\nBut when one man has been under obligations to another, with whom he quarrels, he becomes a much severer enemy than a mere stranger would be. To account for your own ingratitude in such a case, you are bound to prove the other party's crime. It is not that you are selfish, brutal, and angry - no, no - it is that your partner has made you so by the basest treachery.\nThen Osborne had the intolerable sense of former benefits to irritate him. Finally, he had to break off the match between Sedley's daughter and his son; and as it had gone very far indeed, and as the poor girl's happiness and perhaps character were compromised, it was necessary to show the strongest reasons for the rupture, and for John Osborne to prove John Sedley to be a very bad character indeed.\nAt the meetings of creditors, then, he showed a savageness and scorn towards Sedley which almost broke the other man's heart. He forbade George to meet Amelia, vilifying the poor girl as the most artful of vixens.\nWhen the great crash came, a brutal letter from John Osborne told her in a few curt lines that all engagements between the families were at an end. Amelia took the news very palely and calmly. It was only the confirmation of her previous dark fears. It was the sentence for her crime of loving too violently, against reason. She seemed scarcely more unhappy now, when convinced all hope was over, than before when she felt but dared not confess that it was gone.\nSo she changed from the large house to the small one without remark; remained in her little room and pined silently; and died away day by day.\nWhenever old John Sedley thought of the affair between George and Amelia, it was with bitterness almost as great as Mr. Osborne's. He cursed Osborne and his family as heartless and wicked. No power on earth, he swore, would induce him to marry his daughter to the son of such a villain, and he ordered Emmy to banish George from her mind, and to return all the presents and letters which she had ever had from him.\nShe tried to obey. But when she drew out the letters and read them over - as if she did not know them by heart already - she could not part with them. She placed them back in her bosom again - as you have seen a woman nurse a child that is dead. How she used to blush when those letters came! How she used to trip away so that she might read unseen! If they were short or selfish, what excuses she found for the writer!\nIt was over these few worthless papers that she brooded; these relics of dead affection were all that were left her in the world. To death she looked with inexpressible longing. Then, she thought, I shall always be able to follow him.\nI am not praising her conduct or setting her up as a model to imitate. A strong-minded girl knows how to regulate her feelings better than this poor little creature, and would never pledge her heart away for nothing but a brittle promise.\nBe cautious, young ladies; be wary how you engage. Be shy of loving frankly; never tell all you feel; or (better still) feel very little. See the consequences of being too confiding, and mistrust yourselves and everybody. That is the way to get on in Vanity Fair.\nIf Amelia could have heard the comments about her which were made in the circle which they had left, she would have seen what her crimes were. \"Captain Osborne, of course, could not marry a bankrupt's daughter,\" the Misses Dobbin said. \"It was quite enough to have been swindled by the father. As for Amelia, her folly had really passed all-\"\n\"All what?\" Captain Dobbin roared out. \"Haven't they been engaged ever since they were children? Dare any soul on earth breathe a word against the sweetest, the purest, the most angelical of young women?\"\n\"La, William, don't be so highty-tighty,\" Miss Jane said. \"We've said nothing against Miss Sedley, except that her conduct was most imprudent, and her parents certainly deserve their misfortunes.\"\n\"Hadn't you better, now that Miss Sedley is free, propose for her yourself, William?\" Miss Ann asked sarcastically. \"It would be a most eligible connection. He! he!\"\n\"I, marry her!\" Dobbin said, blushing. \"If you are so ready, young ladies, to chop and change, do you suppose that she is? Laugh and sneer at that angel. She can't hear it; and she's miserable and unfortunate, and deserves to be laughed at. Go on joking, Ann. You're the wit of the family.\"\n\"We're not in a barrack, William,\" Miss Ann remarked.\n\"Nobody in a barrack would say what you do,\" cried out this roused British lion. \"I should like to hear a man breathe a word against her, by Jupiter. But men don't talk in this way, Ann: it's only women who get together and hiss, and shriek, and cackle. There, don't cry. I only said you were a couple of geese. Well, you're not geese, you're swans - anything you like, only leave Miss Sedley alone.\"\nThe sisters agreed that William was infatuated with the silly little thing; and they trembled lest, her engagement being off with Osborne, she should take up her other admirer, the Captain.\n\"It is a mercy, Mamma, that the regiment is ordered abroad,\" the girls said. \"This danger, at any rate, is spared our brother.\"\nSo it is that the French Emperor comes in to perform a part in this domestic comedy of Vanity Fair. It was he that ruined Mr. John Sedley. It was he whose arrival in Paris called up all France in arms to defend him; and all Europe to oust him. While the French nation was swearing fidelity, four mighty European armies were getting in motion; and one of these was a British army, of which our two heroes, Captain Dobbin and Captain Osborne, formed a part.\nThe news of Napoleon's escape and landing was received by their gallant regiment with a fiery delight and enthusiasm. From the colonel to the smallest drummer, all were filled with hope and ambition and patriotic fury. Now was the time they had panted for, to show their comrades that they could fight as well as the Peninsular veterans.\nStubble and Spooney looked to get promotion. Before the end of the campaign, Mrs. Major O'Dowd hoped to write herself Mrs. Colonel O'Dowd, C.B. Our two friends were just as excited as the rest: Mr. Dobbin very quietly, Mr. Osborne very loudly and energetically - each bent upon doing his duty, and gaining his share of honour.\nAt this thrilling time, private matters were little heeded. Hence George Osborne, busy with preparations for the coming march, was not so much affected by other incidents as he might otherwise have been. He was not, it must be confessed, very much cast down by old Mr. Sedley's catastrophe. He tried his new uniform, which became him very handsomely, on the day when the first meeting of the creditors took place. His father told him of the wicked, shameful conduct of the bankrupt, reminded him that his connection with Amelia was broken off for ever; and gave him a good sum of money to pay for the new clothes in which he looked so well.\nThe bills of sale went up in the Sedley house, where he had passed so many happy hours. He could see them as he walked away from home that evening, shining white in the moon. He was very melancholy that night in the coffee-room; and drank a good deal, as his comrades remarked.\nDobbin came in presently, cautioned him about the drink, and began to make clumsy inquiries. Osborne declined answering, saying that he was devilish disturbed and unhappy.\nThree days afterwards, Dobbin found Osborne in his room at the barracks - his head on the table, a number of papers about, and the young Captain greatly despondent.\n\"She sent me back some trinkets I gave her. Look here!\" There was a little packet with a letter. \"It's all over,\" said he, with a groan. \"You may read it if you like.\"\nThe letter said:\nMy papa has ordered me to return to you these presents, which you gave me in happier days; and I am to write to you for the last time. I know you feel as I do the blow which has come upon us. I absolve you from an engagement which is impossible in our present misery. I am sure you had no share in the cruel suspicions of Mr. Osborne, which are the hardest of our griefs to bear. Farewell. I pray God to strengthen me to bear this and other calamities, and to bless you always. A.\nI shall often play upon the piano - your piano. It was like you to send it.\nDobbin was very soft-hearted. The sight of women and children in pain always used to melt him. The idea of Amelia broken-hearted and lonely tore that good-natured soul with anguish. He swore that Amelia was an angel, and Osborne agreed with all his heart.\nOsborne, too, had been thinking of Amelia from her childhood, so sweet, so innocent, so charmingly simple, and artlessly fond. What a pang it was to lose all that: to have had it and not prized it! He blushed with remorse, as the memory of his selfishness and indifference contrasted with her perfect purity. For a while, glory, war, everything was forgotten, and the pair of friends talked about her only.\n\"Where are they?\" Osborne asked - in truth, ashamed that he had taken no steps to follow her. \"There's no address to the note.\"\nDobbin knew. He had not merely sent the piano, but had written a note to Mrs. Sedley, and had seen her, and Amelia too, yesterday. He had found Mrs. Sedley only too willing to receive him, and greatly agitated by the arrival of the piano, which, she guessed, MUST have come from George. Captain Dobbin did not correct her error, but listened to all her misfortunes with great sympathy. Then he asked to see Amelia, who was in her room, and whom her mother led trembling downstairs.\nHer appearance was so ghastly, and her look of despair so pathetic, that William Dobbin was frightened; he read the most fatal forebodings in that pale fixed face. After sitting in his company a minute, she put the packet of trinkets into his hand, and said, \"Take this to Captain Osborne, if you please, and - and I hope he's quite well. It was very kind of you to come and see us. We like our new house very much. And I - I think I'll go upstairs, Mamma, for I'm not very strong.\"\nAnd with a curtsey and a smile, the poor child left. Inexpressible grief, pity and terror pursued Dobbin when he came away.\nOsborne made anxious inquiries about her. How was she? What did she say? His comrade took his hand, and looked him in the face.\n\"George, she's dying,\" William Dobbin said - and could speak no more.\nThere was a buxom Irish servant-girl, who performed all the duties of the little house where the Sedley family had found refuge: and this girl had often tried to give Amelia aid or consolation. Emmy was much too sad to be aware of her attempts.\nFour hours after the talk between Dobbin and Osborne, this servant-maid came smiling into Amelia's room, where she sat brooding over her letters - her little treasures.\n\"Miss Emmy,\" said the girl.\n\"I'm coming,\" Emmy said, not looking round.\n\"There's a message,\" the maid went on. \"There's something - somebody - sure, here's a new letter for you - don't be reading them old ones any more.\" And she gave her a letter, which Emmy took, and read.\n\"I must see you,\" the letter said. \"Dearest Emmy - dearest love - dearest wife, come to me.\"\nGeorge and her mother were outside, waiting for her.",
        "paragraph_chars": [
            [
                0,
                436
            ],
            [
                436,
                887
            ],
            [
                887,
                1158
            ],
            [
                1158,
                1466
            ],
            [
                1466,
                1737
            ],
            [
                1737,
                2242
            ],
            [
                2242,
                2519
            ],
            [
                2519,
                2822
            ],
            [
                2822,
                3054
            ],
            [
                3054,
                3110
            ],
            [
                3110,
                3497
            ],
            [
                3497,
                3985
            ],
            [
                3985,
                4193
            ],
            [
                4193,
                4349
            ],
            [
                4349,
                4759
            ],
            [
                4759,
                5088
            ],
            [
                5088,
                5456
            ],
            [
                5456,
                5859
            ],
            [
                5859,
                6073
            ],
            [
                6073,
                6536
            ],
            [
                6536,
                6679
            ],
            [
                6679,
                7094
            ],
            [
                7094,
                7514
            ],
            [
                7514,
                7749
            ],
            [
                7749,
                7988
            ],
            [
                7988,
                8252
            ],
            [
                8252,
                8595
            ],
            [
                8595,
                8800
            ],
            [
                8800,
                8997
            ],
            [
                8997,
                9163
            ],
            [
                9163,
                9454
            ],
            [
                9454,
                9508
            ],
            [
                9508,
                9909
            ],
            [
                9909,
                10099
            ],
            [
                10099,
                10227
            ],
            [
                10227,
                10683
            ],
            [
                10683,
                11021
            ],
            [
                11021,
                11348
            ],
            [
                11348,
                11989
            ],
            [
                11989,
                12267
            ],
            [
                12267,
                12439
            ],
            [
                12439,
                12604
            ],
            [
                12604,
                12772
            ],
            [
                12772,
                12789
            ],
            [
                12789,
                13270
            ],
            [
                13270,
                13346
            ],
            [
                13346,
                13602
            ],
            [
                13602,
                14009
            ],
            [
                14009,
                14137
            ],
            [
                14137,
                14619
            ],
            [
                14619,
                15102
            ],
            [
                15102,
                15226
            ],
            [
                15226,
                15354
            ],
            [
                15354,
                15424
            ],
            [
                15424,
                15669
            ],
            [
                15669,
                15838
            ],
            [
                15838,
                15866
            ],
            [
                15866,
                15910
            ],
            [
                15910,
                16113
            ],
            [
                16113,
                16206
            ],
            [
                16206,
                16258
            ]
        ],
        "segment_chars": [
            [
                0,
                117
            ],
            [
                117,
                436
            ],
            [
                436,
                469
            ],
            [
                469,
                816
            ],
            [
                816,
                887
            ],
            [
                887,
                945
            ],
            [
                945,
                982
            ],
            [
                982,
                1085
            ],
            [
                1085,
                1158
            ],
            [
                1158,
                1186
            ],
            [
                1186,
                1466
            ],
            [
                1466,
                1579
            ],
            [
                1579,
                1683
            ],
            [
                1683,
                1737
            ],
            [
                1737,
                1773
            ],
            [
                1773,
                1803
            ],
            [
                1803,
                1851
            ],
            [
                1851,
                1902
            ],
            [
                1902,
                1936
            ],
            [
                1936,
                2035
            ],
            [
                2035,
                2067
            ],
            [
                2067,
                2119
            ],
            [
                2119,
                2179
            ],
            [
                2179,
                2206
            ],
            [
                2206,
                2242
            ],
            [
                2242,
                2337
            ],
            [
                2337,
                2387
            ],
            [
                2387,
                2427
            ],
            [
                2427,
                2519
            ],
            [
                2519,
                2711
            ],
            [
                2711,
                2822
            ],
            [
                2822,
                3054
            ],
            [
                3054,
                3110
            ],
            [
                3110,
                3150
            ],
            [
                3150,
                3192
            ],
            [
                3192,
                3232
            ],
            [
                3232,
                3369
            ],
            [
                3369,
                3497
            ],
            [
                3497,
                3609
            ],
            [
                3609,
                3691
            ],
            [
                3691,
                3747
            ],
            [
                3747,
                3790
            ],
            [
                3790,
                3912
            ],
            [
                3912,
                3985
            ],
            [
                3985,
                4193
            ],
            [
                4193,
                4225
            ],
            [
                4225,
                4349
            ],
            [
                4349,
                4455
            ],
            [
                4455,
                4508
            ],
            [
                4508,
                4759
            ],
            [
                4759,
                4965
            ],
            [
                4965,
                5088
            ],
            [
                5088,
                5230
            ],
            [
                5230,
                5330
            ],
            [
                5330,
                5456
            ],
            [
                5456,
                5531
            ],
            [
                5531,
                5859
            ],
            [
                5859,
                5985
            ],
            [
                5985,
                6073
            ],
            [
                6073,
                6221
            ],
            [
                6221,
                6266
            ],
            [
                6266,
                6323
            ],
            [
                6323,
                6398
            ],
            [
                6398,
                6536
            ],
            [
                6536,
                6679
            ],
            [
                6679,
                6810
            ],
            [
                6810,
                6868
            ],
            [
                6868,
                7094
            ],
            [
                7094,
                7113
            ],
            [
                7113,
                7245
            ],
            [
                7245,
                7340
            ],
            [
                7340,
                7387
            ],
            [
                7387,
                7444
            ],
            [
                7444,
                7514
            ],
            [
                7514,
                7644
            ],
            [
                7644,
                7692
            ],
            [
                7692,
                7749
            ],
            [
                7749,
                7820
            ],
            [
                7820,
                7988
            ],
            [
                7988,
                8039
            ],
            [
                8039,
                8126
            ],
            [
                8126,
                8210
            ],
            [
                8210,
                8252
            ],
            [
                8252,
                8395
            ],
            [
                8395,
                8488
            ],
            [
                8488,
                8546
            ],
            [
                8546,
                8595
            ],
            [
                8595,
                8607
            ],
            [
                8607,
                8634
            ],
            [
                8634,
                8692
            ],
            [
                8692,
                8800
            ],
            [
                8800,
                8858
            ],
            [
                8858,
                8997
            ],
            [
                8997,
                9083
            ],
            [
                9083,
                9113
            ],
            [
                9113,
                9154
            ],
            [
                9154,
                9158
            ],
            [
                9158,
                9163
            ],
            [
                9163,
                9179
            ],
            [
                9179,
                9202
            ],
            [
                9202,
                9286
            ],
            [
                9286,
                9317
            ],
            [
                9317,
                9404
            ],
            [
                9404,
                9423
            ],
            [
                9423,
                9454
            ],
            [
                9454,
                9508
            ],
            [
                9508,
                9589
            ],
            [
                9589,
                9658
            ],
            [
                9658,
                9762
            ],
            [
                9762,
                9780
            ],
            [
                9780,
                9820
            ],
            [
                9820,
                9909
            ],
            [
                9909,
                10099
            ],
            [
                10099,
                10176
            ],
            [
                10176,
                10227
            ],
            [
                10227,
                10327
            ],
            [
                10327,
                10366
            ],
            [
                10366,
                10471
            ],
            [
                10471,
                10683
            ],
            [
                10683,
                10801
            ],
            [
                10801,
                10902
            ],
            [
                10902,
                11021
            ],
            [
                11021,
                11066
            ],
            [
                11066,
                11165
            ],
            [
                11165,
                11348
            ],
            [
                11348,
                11408
            ],
            [
                11408,
                11552
            ],
            [
                11552,
                11639
            ],
            [
                11639,
                11762
            ],
            [
                11762,
                11989
            ],
            [
                11989,
                12077
            ],
            [
                12077,
                12164
            ],
            [
                12164,
                12267
            ],
            [
                12267,
                12360
            ],
            [
                12360,
                12439
            ],
            [
                12439,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12660
            ],
            [
                12660,
                12701
            ],
            [
                12701,
                12741
            ],
            [
                12741,
                12772
            ],
            [
                12772,
                12789
            ],
            [
                12789,
                12924
            ],
            [
                12924,
                12981
            ],
            [
                12981,
                13057
            ],
            [
                13057,
                13169
            ],
            [
                13169,
                13179
            ],
            [
                13179,
                13267
            ],
            [
                13267,
                13270
            ],
            [
                13270,
                13318
            ],
            [
                13318,
                13346
            ],
            [
                13346,
                13376
            ],
            [
                13376,
                13441
            ],
            [
                13441,
                13528
            ],
            [
                13528,
                13602
            ],
            [
                13602,
                13729
            ],
            [
                13729,
                13800
            ],
            [
                13800,
                13911
            ],
            [
                13911,
                14009
            ],
            [
                14009,
                14027
            ],
            [
                14027,
                14103
            ],
            [
                14103,
                14137
            ],
            [
                14137,
                14150
            ],
            [
                14150,
                14268
            ],
            [
                14268,
                14424
            ],
            [
                14424,
                14523
            ],
            [
                14523,
                14619
            ],
            [
                14619,
                14783
            ],
            [
                14783,
                14958
            ],
            [
                14958,
                15002
            ],
            [
                15002,
                15035
            ],
            [
                15035,
                15102
            ],
            [
                15102,
                15155
            ],
            [
                15155,
                15226
            ],
            [
                15226,
                15268
            ],
            [
                15268,
                15281
            ],
            [
                15281,
                15299
            ],
            [
                15299,
                15354
            ],
            [
                15354,
                15424
            ],
            [
                15424,
                15618
            ],
            [
                15618,
                15669
            ],
            [
                15669,
                15838
            ],
            [
                15838,
                15866
            ],
            [
                15866,
                15910
            ],
            [
                15910,
                15949
            ],
            [
                15949,
                16059
            ],
            [
                16059,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16206
            ],
            [
                16206,
                16258
            ]
        ],
        "overlap_chars": [
            [
                0,
                74
            ],
            [
                74,
                117
            ],
            [
                117,
                203
            ],
            [
                204,
                206
            ],
            [
                207,
                303
            ],
            [
                304,
                361
            ],
            [
                362,
                384
            ],
            [
                385,
                436
            ],
            [
                436,
                469
            ],
            [
                469,
                577
            ],
            [
                577,
                595
            ],
            [
                601,
                641
            ],
            [
                641,
                661
            ],
            [
                662,
                666
            ],
            [
                667,
                668
            ],
            [
                669,
                674
            ],
            [
                675,
                699
            ],
            [
                699,
                716
            ],
            [
                717,
                770
            ],
            [
                771,
                790
            ],
            [
                791,
                814
            ],
            [
                814,
                816
            ],
            [
                820,
                849
            ],
            [
                854,
                869
            ],
            [
                881,
                885
            ],
            [
                887,
                917
            ],
            [
                923,
                945
            ],
            [
                945,
                969
            ],
            [
                970,
                980
            ],
            [
                980,
                982
            ],
            [
                982,
                1016
            ],
            [
                1027,
                1052
            ],
            [
                1057,
                1085
            ],
            [
                1085,
                1157
            ],
            [
                1158,
                1177
            ],
            [
                1184,
                1186
            ],
            [
                1186,
                1330
            ],
            [
                1330,
                1443
            ],
            [
                1444,
                1447
            ],
            [
                1448,
                1464
            ],
            [
                1464,
                1466
            ],
            [
                1466,
                1577
            ],
            [
                1579,
                1634
            ],
            [
                1639,
                1645
            ],
            [
                1646,
                1681
            ],
            [
                1683,
                1736
            ],
            [
                1737,
                1755
            ],
            [
                1761,
                1771
            ],
            [
                1771,
                1773
            ],
            [
                1773,
                1803
            ],
            [
                1803,
                1851
            ],
            [
                1851,
                1895
            ],
            [
                1900,
                1902
            ],
            [
                1902,
                1936
            ],
            [
                1936,
                1958
            ],
            [
                1958,
                1959
            ],
            [
                1960,
                1973
            ],
            [
                1977,
                1982
            ],
            [
                1983,
                1997
            ],
            [
                1997,
                2006
            ],
            [
                2009,
                2035
            ],
            [
                2035,
                2047
            ],
            [
                2048,
                2065
            ],
            [
                2067,
                2119
            ],
            [
                2119,
                2147
            ],
            [
                2148,
                2179
            ],
            [
                2179,
                2192
            ],
            [
                2204,
                2206
            ],
            [
                2206,
                2242
            ],
            [
                2242,
                2280
            ],
            [
                2280,
                2281
            ],
            [
                2282,
                2314
            ],
            [
                2314,
                2337
            ],
            [
                2337,
                2387
            ],
            [
                2387,
                2425
            ],
            [
                2425,
                2427
            ],
            [
                2427,
                2478
            ],
            [
                2480,
                2517
            ],
            [
                2517,
                2518
            ],
            [
                2519,
                2551
            ],
            [
                2552,
                2555
            ],
            [
                2561,
                2594
            ],
            [
                2594,
                2614
            ],
            [
                2615,
                2624
            ],
            [
                2627,
                2709
            ],
            [
                2709,
                2710
            ],
            [
                2711,
                2733
            ],
            [
                2734,
                2742
            ],
            [
                2750,
                2764
            ],
            [
                2765,
                2797
            ],
            [
                2798,
                2822
            ],
            [
                2822,
                2871
            ],
            [
                2876,
                2901
            ],
            [
                2902,
                2930
            ],
            [
                2931,
                2932
            ],
            [
                2933,
                2979
            ],
            [
                2980,
                2991
            ],
            [
                3001,
                3054
            ],
            [
                3054,
                3110
            ],
            [
                3110,
                3150
            ],
            [
                3150,
                3163
            ],
            [
                3164,
                3181
            ],
            [
                3182,
                3192
            ],
            [
                3192,
                3216
            ],
            [
                3217,
                3232
            ],
            [
                3232,
                3249
            ],
            [
                3250,
                3267
            ],
            [
                3269,
                3287
            ],
            [
                3292,
                3352
            ],
            [
                3353,
                3369
            ],
            [
                3369,
                3497
            ],
            [
                3497,
                3580
            ],
            [
                3580,
                3609
            ],
            [
                3609,
                3668
            ],
            [
                3669,
                3689
            ],
            [
                3691,
                3713
            ],
            [
                3719,
                3745
            ],
            [
                3745,
                3747
            ],
            [
                3747,
                3790
            ],
            [
                3790,
                3809
            ],
            [
                3816,
                3912
            ],
            [
                3916,
                3930
            ],
            [
                3930,
                3984
            ],
            [
                3990,
                4051
            ],
            [
                4052,
                4057
            ],
            [
                4058,
                4062
            ],
            [
                4063,
                4078
            ],
            [
                4088,
                4193
            ],
            [
                4193,
                4196
            ],
            [
                4197,
                4207
            ],
            [
                4208,
                4211
            ],
            [
                4217,
                4225
            ],
            [
                4225,
                4347
            ],
            [
                4347,
                4349
            ],
            [
                4349,
                4352
            ],
            [
                4362,
                4377
            ],
            [
                4380,
                4416
            ],
            [
                4418,
                4453
            ],
            [
                4453,
                4455
            ],
            [
                4455,
                4466
            ],
            [
                4467,
                4508
            ],
            [
                4508,
                4534
            ],
            [
                4534,
                4535
            ],
            [
                4536,
                4543
            ],
            [
                4562,
                4757
            ],
            [
                4757,
                4759
            ],
            [
                4759,
                4818
            ],
            [
                4818,
                4819
            ],
            [
                4820,
                4829
            ],
            [
                4839,
                4843
            ],
            [
                4844,
                4856
            ],
            [
                4857,
                4861
            ],
            [
                4862,
                4865
            ],
            [
                4866,
                4886
            ],
            [
                4889,
                4897
            ],
            [
                4898,
                4907
            ],
            [
                4921,
                4963
            ],
            [
                4963,
                4964
            ],
            [
                4965,
                5005
            ],
            [
                5008,
                5050
            ],
            [
                5053,
                5079
            ],
            [
                5092,
                5119
            ],
            [
                5120,
                5156
            ],
            [
                5157,
                5166
            ],
            [
                5178,
                5230
            ],
            [
                5230,
                5253
            ],
            [
                5254,
                5330
            ],
            [
                5330,
                5379
            ],
            [
                5382,
                5388
            ],
            [
                5391,
                5418
            ],
            [
                5424,
                5427
            ],
            [
                5431,
                5454
            ],
            [
                5454,
                5455
            ],
            [
                5456,
                5516
            ],
            [
                5517,
                5529
            ],
            [
                5529,
                5531
            ],
            [
                5531,
                5859
            ],
            [
                5859,
                5897
            ],
            [
                5905,
                5942
            ],
            [
                5943,
                5955
            ],
            [
                5962,
                5965
            ],
            [
                5972,
                5975
            ],
            [
                5978,
                5983
            ],
            [
                5983,
                5985
            ],
            [
                5985,
                5987
            ],
            [
                5996,
                6002
            ],
            [
                6011,
                6017
            ],
            [
                6017,
                6018
            ],
            [
                6019,
                6022
            ],
            [
                6029,
                6037
            ],
            [
                6038,
                6049
            ],
            [
                6050,
                6072
            ],
            [
                6073,
                6098
            ],
            [
                6098,
                6099
            ],
            [
                6100,
                6167
            ],
            [
                6168,
                6219
            ],
            [
                6221,
                6266
            ],
            [
                6266,
                6297
            ],
            [
                6311,
                6315
            ],
            [
                6321,
                6323
            ],
            [
                6323,
                6333
            ],
            [
                6334,
                6342
            ],
            [
                6351,
                6366
            ],
            [
                6367,
                6398
            ],
            [
                6398,
                6434
            ],
            [
                6436,
                6535
            ],
            [
                6536,
                6596
            ],
            [
                6603,
                6632
            ],
            [
                6637,
                6678
            ],
            [
                6679,
                6752
            ],
            [
                6753,
                6806
            ],
            [
                6808,
                6810
            ],
            [
                6810,
                6855
            ],
            [
                6856,
                6859
            ],
            [
                6860,
                6866
            ],
            [
                6866,
                6868
            ],
            [
                6868,
                7094
            ],
            [
                7094,
                7097
            ],
            [
                7098,
                7113
            ],
            [
                7113,
                7116
            ],
            [
                7122,
                7130
            ],
            [
                7131,
                7134
            ],
            [
                7135,
                7146
            ],
            [
                7147,
                7165
            ],
            [
                7168,
                7212
            ],
            [
                7215,
                7245
            ],
            [
                7245,
                7284
            ],
            [
                7287,
                7340
            ],
            [
                7340,
                7361
            ],
            [
                7362,
                7387
            ],
            [
                7387,
                7412
            ],
            [
                7413,
                7444
            ],
            [
                7444,
                7514
            ],
            [
                7514,
                7569
            ],
            [
                7571,
                7583
            ],
            [
                7584,
                7644
            ],
            [
                7644,
                7692
            ],
            [
                7692,
                7748
            ],
            [
                7749,
                7807
            ],
            [
                7808,
                7820
            ],
            [
                7820,
                7821
            ],
            [
                7841,
                7913
            ],
            [
                7913,
                7918
            ],
            [
                7919,
                7930
            ],
            [
                7938,
                7952
            ],
            [
                7957,
                7964
            ],
            [
                7969,
                7986
            ],
            [
                7986,
                7987
            ],
            [
                7988,
                7999
            ],
            [
                7999,
                8039
            ],
            [
                8039,
                8088
            ],
            [
                8090,
                8094
            ],
            [
                8094,
                8100
            ],
            [
                8101,
                8106
            ],
            [
                8108,
                8126
            ],
            [
                8126,
                8155
            ],
            [
                8160,
                8210
            ],
            [
                8210,
                8235
            ],
            [
                8236,
                8252
            ],
            [
                8252,
                8291
            ],
            [
                8298,
                8331
            ],
            [
                8332,
                8337
            ],
            [
                8343,
                8346
            ],
            [
                8351,
                8381
            ],
            [
                8382,
                8393
            ],
            [
                8393,
                8395
            ],
            [
                8395,
                8488
            ],
            [
                8488,
                8546
            ],
            [
                8546,
                8552
            ],
            [
                8553,
                8592
            ],
            [
                8595,
                8607
            ],
            [
                8607,
                8634
            ],
            [
                8634,
                8692
            ],
            [
                8692,
                8767
            ],
            [
                8768,
                8800
            ],
            [
                8800,
                8839
            ],
            [
                8839,
                8858
            ],
            [
                8858,
                8897
            ],
            [
                8906,
                8922
            ],
            [
                8923,
                8942
            ],
            [
                8943,
                8946
            ],
            [
                8947,
                8958
            ],
            [
                8959,
                8968
            ],
            [
                8977,
                8997
            ],
            [
                8997,
                9083
            ],
            [
                9083,
                9113
            ],
            [
                9113,
                9141
            ],
            [
                9142,
                9154
            ],
            [
                9154,
                9158
            ],
            [
                9158,
                9163
            ],
            [
                9163,
                9165
            ],
            [
                9167,
                9179
            ],
            [
                9179,
                9200
            ],
            [
                9200,
                9202
            ],
            [
                9202,
                9286
            ],
            [
                9286,
                9317
            ],
            [
                9317,
                9404
            ],
            [
                9404,
                9423
            ],
            [
                9423,
                9451
            ],
            [
                9451,
                9454
            ],
            [
                9454,
                9455
            ],
            [
                9455,
                9508
            ],
            [
                9508,
                9509
            ],
            [
                9516,
                9567
            ],
            [
                9575,
                9589
            ],
            [
                9589,
                9658
            ],
            [
                9658,
                9710
            ],
            [
                9711,
                9762
            ],
            [
                9762,
                9768
            ],
            [
                9769,
                9774
            ],
            [
                9775,
                9780
            ],
            [
                9780,
                9818
            ],
            [
                9818,
                9820
            ],
            [
                9820,
                9856
            ],
            [
                9859,
                9882
            ],
            [
                9883,
                9909
            ],
            [
                9913,
                9927
            ],
            [
                9928,
                9932
            ],
            [
                9933,
                9940
            ],
            [
                9941,
                9944
            ],
            [
                9945,
                9950
            ],
            [
                9965,
                9977
            ],
            [
                9978,
                9983
            ],
            [
                9985,
                10066
            ],
            [
                10067,
                10084
            ],
            [
                10084,
                10089
            ],
            [
                10090,
                10098
            ],
            [
                10099,
                10176
            ],
            [
                10176,
                10227
            ],
            [
                10227,
                10325
            ],
            [
                10325,
                10327
            ],
            [
                10327,
                10348
            ],
            [
                10349,
                10366
            ],
            [
                10366,
                10392
            ],
            [
                10399,
                10441
            ],
            [
                10441,
                10471
            ],
            [
                10471,
                10494
            ],
            [
                10499,
                10516
            ],
            [
                10516,
                10538
            ],
            [
                10546,
                10568
            ],
            [
                10568,
                10615
            ],
            [
                10620,
                10630
            ],
            [
                10630,
                10676
            ],
            [
                10681,
                10683
            ],
            [
                10683,
                10740
            ],
            [
                10747,
                10754
            ],
            [
                10764,
                10799
            ],
            [
                10799,
                10801
            ],
            [
                10801,
                10841
            ],
            [
                10841,
                10900
            ],
            [
                10900,
                10902
            ],
            [
                10902,
                10918
            ],
            [
                10924,
                10927
            ],
            [
                10928,
                10962
            ],
            [
                10963,
                11019
            ],
            [
                11019,
                11020
            ],
            [
                11021,
                11054
            ],
            [
                11064,
                11066
            ],
            [
                11066,
                11096
            ],
            [
                11098,
                11165
            ],
            [
                11165,
                11180
            ],
            [
                11181,
                11185
            ],
            [
                11191,
                11193
            ],
            [
                11194,
                11214
            ],
            [
                11217,
                11281
            ],
            [
                11284,
                11288
            ],
            [
                11289,
                11346
            ],
            [
                11346,
                11348
            ],
            [
                11348,
                11350
            ],
            [
                11351,
                11355
            ],
            [
                11356,
                11365
            ],
            [
                11370,
                11371
            ],
            [
                11372,
                11406
            ],
            [
                11408,
                11413
            ],
            [
                11414,
                11428
            ],
            [
                11428,
                11460
            ],
            [
                11468,
                11474
            ],
            [
                11475,
                11518
            ],
            [
                11541,
                11545
            ],
            [
                11550,
                11552
            ],
            [
                11552,
                11608
            ],
            [
                11609,
                11639
            ],
            [
                11639,
                11749
            ],
            [
                11750,
                11762
            ],
            [
                11762,
                11795
            ],
            [
                11795,
                11843
            ],
            [
                11844,
                11848
            ],
            [
                11853,
                11863
            ],
            [
                11869,
                11875
            ],
            [
                11876,
                11913
            ],
            [
                11914,
                11960
            ],
            [
                11961,
                11988
            ],
            [
                11989,
                11998
            ],
            [
                12012,
                12063
            ],
            [
                12064,
                12077
            ],
            [
                12077,
                12107
            ],
            [
                12113,
                12127
            ],
            [
                12137,
                12164
            ],
            [
                12164,
                12216
            ],
            [
                12218,
                12265
            ],
            [
                12265,
                12267
            ],
            [
                12267,
                12323
            ],
            [
                12324,
                12327
            ],
            [
                12328,
                12336
            ],
            [
                12342,
                12358
            ],
            [
                12360,
                12376
            ],
            [
                12386,
                12387
            ],
            [
                12395,
                12439
            ],
            [
                12439,
                12510
            ],
            [
                12513,
                12561
            ],
            [
                12566,
                12583
            ],
            [
                12592,
                12599
            ],
            [
                12602,
                12603
            ],
            [
                12604,
                12608
            ],
            [
                12609,
                12626
            ],
            [
                12627,
                12635
            ],
            [
                12636,
                12646
            ],
            [
                12646,
                12648
            ],
            [
                12648,
                12660
            ],
            [
                12660,
                12685
            ],
            [
                12686,
                12690
            ],
            [
                12691,
                12692
            ],
            [
                12699,
                12701
            ],
            [
                12701,
                12739
            ],
            [
                12739,
                12741
            ],
            [
                12741,
                12742
            ],
            [
                12742,
                12772
            ],
            [
                12776,
                12782
            ],
            [
                12783,
                12789
            ],
            [
                12789,
                12854
            ],
            [
                12860,
                12862
            ],
            [
                12863,
                12878
            ],
            [
                12878,
                12924
            ],
            [
                12924,
                12939
            ],
            [
                12940,
                12981
            ],
            [
                12981,
                12982
            ],
            [
                12983,
                13057
            ],
            [
                13057,
                13083
            ],
            [
                13084,
                13148
            ],
            [
                13149,
                13169
            ],
            [
                13169,
                13179
            ],
            [
                13179,
                13267
            ],
            [
                13267,
                13270
            ],
            [
                13270,
                13303
            ],
            [
                13306,
                13318
            ],
            [
                13318,
                13346
            ],
            [
                13346,
                13376
            ],
            [
                13376,
                13441
            ],
            [
                13441,
                13528
            ],
            [
                13528,
                13562
            ],
            [
                13567,
                13574
            ],
            [
                13582,
                13601
            ],
            [
                13609,
                13624
            ],
            [
                13634,
                13636
            ],
            [
                13644,
                13662
            ],
            [
                13662,
                13727
            ],
            [
                13727,
                13728
            ],
            [
                13729,
                13800
            ],
            [
                13800,
                13823
            ],
            [
                13823,
                13831
            ],
            [
                13839,
                13845
            ],
            [
                13846,
                13890
            ],
            [
                13895,
                13911
            ],
            [
                13911,
                14009
            ],
            [
                14009,
                14027
            ],
            [
                14027,
                14040
            ],
            [
                14043,
                14052
            ],
            [
                14061,
                14103
            ],
            [
                14104,
                14137
            ],
            [
                14137,
                14150
            ],
            [
                14150,
                14182
            ],
            [
                14182,
                14183
            ],
            [
                14184,
                14226
            ],
            [
                14227,
                14266
            ],
            [
                14266,
                14267
            ],
            [
                14271,
                14382
            ],
            [
                14383,
                14386
            ],
            [
                14394,
                14422
            ],
            [
                14422,
                14424
            ],
            [
                14424,
                14454
            ],
            [
                14455,
                14458
            ],
            [
                14459,
                14464
            ],
            [
                14464,
                14489
            ],
            [
                14490,
                14521
            ],
            [
                14521,
                14523
            ],
            [
                14528,
                14530
            ],
            [
                14537,
                14559
            ],
            [
                14560,
                14571
            ],
            [
                14571,
                14619
            ],
            [
                14619,
                14691
            ],
            [
                14692,
                14721
            ],
            [
                14721,
                14722
            ],
            [
                14723,
                14725
            ],
            [
                14726,
                14783
            ],
            [
                14783,
                14820
            ],
            [
                14820,
                14840
            ],
            [
                14853,
                14927
            ],
            [
                14930,
                14956
            ],
            [
                14958,
                15000
            ],
            [
                15002,
                15035
            ],
            [
                15035,
                15040
            ],
            [
                15043,
                15101
            ],
            [
                15102,
                15110
            ],
            [
                15111,
                15148
            ],
            [
                15153,
                15155
            ],
            [
                15155,
                15175
            ],
            [
                15176,
                15180
            ],
            [
                15181,
                15199
            ],
            [
                15212,
                15224
            ],
            [
                15224,
                15226
            ],
            [
                15226,
                15233
            ],
            [
                15234,
                15238
            ],
            [
                15239,
                15256
            ],
            [
                15263,
                15266
            ],
            [
                15266,
                15268
            ],
            [
                15268,
                15281
            ],
            [
                15281,
                15299
            ],
            [
                15299,
                15354
            ],
            [
                15354,
                15396
            ],
            [
                15399,
                15424
            ],
            [
                15424,
                15570
            ],
            [
                15583,
                15618
            ],
            [
                15618,
                15642
            ],
            [
                15643,
                15654
            ],
            [
                15655,
                15658
            ],
            [
                15659,
                15667
            ],
            [
                15667,
                15669
            ],
            [
                15669,
                15745
            ],
            [
                15754,
                15783
            ],
            [
                15788,
                15796
            ],
            [
                15797,
                15813
            ],
            [
                15816,
                15837
            ],
            [
                15838,
                15866
            ],
            [
                15866,
                15910
            ],
            [
                15910,
                15949
            ],
            [
                15949,
                15967
            ],
            [
                15981,
                16014
            ],
            [
                16017,
                16059
            ],
            [
                16059,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16161
            ],
            [
                16164,
                16176
            ],
            [
                16179,
                16206
            ],
            [
                16206,
                16249
            ],
            [
                16257,
                16258
            ]
        ],
        "row_chars": [
            [
                0,
                117
            ],
            [
                117,
                436
            ],
            [
                436,
                469
            ],
            [
                469,
                816
            ],
            [
                816,
                816
            ],
            [
                816,
                887
            ],
            [
                887,
                887
            ],
            [
                887,
                945
            ],
            [
                945,
                982
            ],
            [
                982,
                1085
            ],
            [
                1085,
                1085
            ],
            [
                1085,
                1158
            ],
            [
                1158,
                1186
            ],
            [
                1186,
                1466
            ],
            [
                1466,
                1737
            ],
            [
                1737,
                1773
            ],
            [
                1773,
                1803
            ],
            [
                1803,
                1851
            ],
            [
                1851,
                1902
            ],
            [
                1902,
                1936
            ],
            [
                1936,
                2035
            ],
            [
                2035,
                2067
            ],
            [
                2067,
                2067
            ],
            [
                2067,
                2119
            ],
            [
                2119,
                2119
            ],
            [
                2119,
                2179
            ],
            [
                2179,
                2206
            ],
            [
                2206,
                2242
            ],
            [
                2242,
                2337
            ],
            [
                2337,
                2337
            ],
            [
                2337,
                2387
            ],
            [
                2387,
                2427
            ],
            [
                2427,
                2519
            ],
            [
                2519,
                2822
            ],
            [
                2822,
                3054
            ],
            [
                3054,
                3110
            ],
            [
                3110,
                3150
            ],
            [
                3150,
                3192
            ],
            [
                3192,
                3232
            ],
            [
                3232,
                3232
            ],
            [
                3232,
                3232
            ],
            [
                3232,
                3369
            ],
            [
                3369,
                3497
            ],
            [
                3497,
                3609
            ],
            [
                3609,
                3609
            ],
            [
                3609,
                3691
            ],
            [
                3691,
                3747
            ],
            [
                3747,
                3790
            ],
            [
                3790,
                3912
            ],
            [
                3912,
                3985
            ],
            [
                3985,
                3985
            ],
            [
                3985,
                3985
            ],
            [
                3985,
                3985
            ],
            [
                3985,
                4193
            ],
            [
                4193,
                4193
            ],
            [
                4193,
                4225
            ],
            [
                4225,
                4349
            ],
            [
                4349,
                4349
            ],
            [
                4349,
                4455
            ],
            [
                4455,
                4455
            ],
            [
                4455,
                4508
            ],
            [
                4508,
                4759
            ],
            [
                4759,
                5088
            ],
            [
                5088,
                5088
            ],
            [
                5088,
                5230
            ],
            [
                5230,
                5330
            ],
            [
                5330,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5456
            ],
            [
                5456,
                5531
            ],
            [
                5531,
                5859
            ],
            [
                5859,
                5985
            ],
            [
                5985,
                6073
            ],
            [
                6073,
                6073
            ],
            [
                6073,
                6221
            ],
            [
                6221,
                6266
            ],
            [
                6266,
                6323
            ],
            [
                6323,
                6398
            ],
            [
                6398,
                6398
            ],
            [
                6398,
                6536
            ],
            [
                6536,
                6679
            ],
            [
                6679,
                6679
            ],
            [
                6679,
                6679
            ],
            [
                6679,
                6679
            ],
            [
                6679,
                6679
            ],
            [
                6679,
                6679
            ],
            [
                6679,
                6810
            ],
            [
                6810,
                6868
            ],
            [
                6868,
                7094
            ],
            [
                7094,
                7113
            ],
            [
                7113,
                7245
            ],
            [
                7245,
                7340
            ],
            [
                7340,
                7340
            ],
            [
                7340,
                7387
            ],
            [
                7387,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7514
            ],
            [
                7514,
                7644
            ],
            [
                7644,
                7644
            ],
            [
                7644,
                7692
            ],
            [
                7692,
                7749
            ],
            [
                7749,
                7820
            ],
            [
                7820,
                7988
            ],
            [
                7988,
                7988
            ],
            [
                7988,
                8039
            ],
            [
                8039,
                8126
            ],
            [
                8126,
                8210
            ],
            [
                8210,
                8210
            ],
            [
                8210,
                8210
            ],
            [
                8210,
                8252
            ],
            [
                8252,
                8395
            ],
            [
                8395,
                8395
            ],
            [
                8395,
                8488
            ],
            [
                8488,
                8546
            ],
            [
                8546,
                8595
            ],
            [
                8595,
                8607
            ],
            [
                8607,
                8634
            ],
            [
                8634,
                8692
            ],
            [
                8692,
                8692
            ],
            [
                8692,
                8800
            ],
            [
                8800,
                8858
            ],
            [
                8858,
                8997
            ],
            [
                8997,
                9083
            ],
            [
                9083,
                9113
            ],
            [
                9113,
                9154
            ],
            [
                9154,
                9158
            ],
            [
                9158,
                9163
            ],
            [
                9163,
                9179
            ],
            [
                9179,
                9202
            ],
            [
                9202,
                9286
            ],
            [
                9286,
                9317
            ],
            [
                9317,
                9404
            ],
            [
                9404,
                9423
            ],
            [
                9423,
                9454
            ],
            [
                9454,
                9508
            ],
            [
                9508,
                9589
            ],
            [
                9589,
                9658
            ],
            [
                9658,
                9762
            ],
            [
                9762,
                9780
            ],
            [
                9780,
                9820
            ],
            [
                9820,
                9909
            ],
            [
                9909,
                10099
            ],
            [
                10099,
                10099
            ],
            [
                10099,
                10176
            ],
            [
                10176,
                10227
            ],
            [
                10227,
                10327
            ],
            [
                10327,
                10366
            ],
            [
                10366,
                10471
            ],
            [
                10471,
                10683
            ],
            [
                10683,
                10801
            ],
            [
                10801,
                10902
            ],
            [
                10902,
                11021
            ],
            [
                11021,
                11066
            ],
            [
                11066,
                11165
            ],
            [
                11165,
                11348
            ],
            [
                11348,
                11552
            ],
            [
                11552,
                11639
            ],
            [
                11639,
                11762
            ],
            [
                11762,
                11989
            ],
            [
                11989,
                11989
            ],
            [
                11989,
                12077
            ],
            [
                12077,
                12164
            ],
            [
                12164,
                12164
            ],
            [
                12164,
                12164
            ],
            [
                12164,
                12267
            ],
            [
                12267,
                12439
            ],
            [
                12439,
                12604
            ],
            [
                12604,
                12648
            ],
            [
                12648,
                12660
            ],
            [
                12660,
                12701
            ],
            [
                12701,
                12741
            ],
            [
                12741,
                12772
            ],
            [
                12772,
                12789
            ],
            [
                12789,
                12924
            ],
            [
                12924,
                12981
            ],
            [
                12981,
                13057
            ],
            [
                13057,
                13169
            ],
            [
                13169,
                13179
            ],
            [
                13179,
                13179
            ],
            [
                13179,
                13267
            ],
            [
                13267,
                13270
            ],
            [
                13270,
                13318
            ],
            [
                13318,
                13346
            ],
            [
                13346,
                13376
            ],
            [
                13376,
                13441
            ],
            [
                13441,
                13528
            ],
            [
                13528,
                13528
            ],
            [
                13528,
                13602
            ],
            [
                13602,
                13729
            ],
            [
                13729,
                13800
            ],
            [
                13800,
                13800
            ],
            [
                13800,
                13911
            ],
            [
                13911,
                14009
            ],
            [
                14009,
                14027
            ],
            [
                14027,
                14103
            ],
            [
                14103,
                14103
            ],
            [
                14103,
                14137
            ],
            [
                14137,
                14150
            ],
            [
                14150,
                14268
            ],
            [
                14268,
                14424
            ],
            [
                14424,
                14523
            ],
            [
                14523,
                14619
            ],
            [
                14619,
                14783
            ],
            [
                14783,
                15035
            ],
            [
                15035,
                15102
            ],
            [
                15102,
                15155
            ],
            [
                15155,
                15155
            ],
            [
                15155,
                15155
            ],
            [
                15155,
                15155
            ],
            [
                15155,
                15226
            ],
            [
                15226,
                15268
            ],
            [
                15268,
                15281
            ],
            [
                15281,
                15281
            ],
            [
                15281,
                15299
            ],
            [
                15299,
                15354
            ],
            [
                15354,
                15424
            ],
            [
                15424,
                15618
            ],
            [
                15618,
                15669
            ],
            [
                15669,
                15838
            ],
            [
                15838,
                15838
            ],
            [
                15838,
                15866
            ],
            [
                15866,
                15910
            ],
            [
                15910,
                15949
            ],
            [
                15949,
                16059
            ],
            [
                16059,
                16113
            ],
            [
                16113,
                16148
            ],
            [
                16148,
                16206
            ],
            [
                16206,
                16258
            ]
        ]
    }
}