{
    "original": {
        "text": "We have seen how Mrs. Firkin, the lady's maid, as soon as any event of importance to the Crawley family came to her knowledge, felt bound to communicate it to Mrs. Bute Crawley, at the Rectory; and have before mentioned how particularly kind and attentive that good-natured lady was to Miss Crawley's confidential servant. She had been a gracious friend to Miss Briggs, the companion, also; and had secured the latter's good-will by a number of those attentions and promises, which cost so little in the making, and are yet so valuable and agreeable to the recipient. Indeed every good economist and manager of a household must know how cheap and yet how amiable these professions are, and what a flavour they give to the most homely dish in life. Who was the blundering idiot who said that \"fine words butter no parsnips\"? Half the parsnips of society are served and rendered palatable with no other sauce. As the immortal Alexis Soyer can make more delicious soup for a half-penny than an ignorant cook can concoct with pounds of vegetables and meat, so a skilful artist will make a few simple and pleasing phrases go farther than ever so much substantial benefit-stock in the hands of a mere bungler. Nay, we know that substantial benefits often sicken some stomachs; whereas, most will digest any amount of fine words, and be always eager for more of the same food. Mrs. Bute had told Briggs and Firkin so often of the depth of her affection for them; and what she would do, if she had Miss Crawley's fortune, for friends so excellent and attached, that the ladies in question had the deepest regard for her; and felt as much gratitude and confidence as if Mrs. Bute had loaded them with the most expensive favours.\nRawdon Crawley, on the other hand, like a selfish heavy dragoon as he was, never took the least trouble to conciliate his aunt's aides-de-camp, showed his contempt for the pair with entire frankness--made Firkin pull off his boots on one occasion--sent her out in the rain on ignominious messages--and if he gave her a guinea, flung it to her as if it were a box on the ear. As his aunt, too, made a butt of Briggs, the Captain followed the example, and levelled his jokes at her--jokes about as delicate as a kick from his charger. Whereas, Mrs. Bute consulted her in matters of taste or difficulty, admired her poetry, and by a thousand acts of kindness and politeness, showed her appreciation of Briggs; and if she made Firkin a twopenny-halfpenny present, accompanied it with so many compliments, that the twopence-half-penny was transmuted into gold in the heart of the grateful waiting-maid, who, besides, was looking forwards quite contentedly to some prodigious benefit which must happen to her on the day when Mrs. Bute came into her fortune.\nThe different conduct of these two people is pointed out respectfully to the attention of persons commencing the world. Praise everybody, I say to such: never be squeamish, but speak out your compliment both point-blank in a man's face, and behind his back, when you know there is a reasonable chance of his hearing it again. Never lose a chance of saying a kind word. As Collingwood never saw a vacant place in his estate but he took an acorn out of his pocket and popped it in; so deal with your compliments through life. An acorn costs nothing; but it may sprout into a prodigious bit of timber.\nIn a word, during Rawdon Crawley's prosperity, he was only obeyed with sulky acquiescence; when his disgrace came, there was nobody to help or pity him. Whereas, when Mrs. Bute took the command at Miss Crawley's house, the garrison there were charmed to act under such a leader, expecting all sorts of promotion from her promises, her generosity, and her kind words.\nThat he would consider himself beaten, after one defeat, and make no attempt to regain the position he had lost, Mrs. Bute Crawley never allowed herself to suppose. She knew Rebecca to be too clever and spirited and desperate a woman to submit without a struggle; and felt that she must prepare for that combat, and be incessantly watchful against assault; or mine, or surprise.\nIn the first place, though she held the town, was she sure of the principal inhabitant? Would Miss Crawley herself hold out; and had she not a secret longing to welcome back the ousted adversary? The old lady liked Rawdon, and Rebecca, who amused her. Mrs. Bute could not disguise from herself the fact that none of her party could so contribute to the pleasures of the town-bred lady. \"My girls' singing, after that little odious governess's, I know is unbearable,\" the candid Rector's wife owned to herself. \"She always used to go to sleep when Martha and Louisa played their duets. Jim's stiff college manners and poor dear Bute's talk about his dogs and horses always annoyed her. If I took her to the Rectory, she would grow angry with us all, and fly, I know she would; and might fall into that horrid Rawdon's clutches again, and be the victim of that little viper of a Sharp. Meanwhile, it is clear to me that she is exceedingly unwell, and cannot move for some weeks, at any rate; during which we must think of some plan to protect her from the arts of those unprincipled people.\"\nIn the very best of moments, if anybody told Miss Crawley that she was, or looked ill, the trembling old lady sent off for her doctor; and I daresay she was very unwell after the sudden family event, which might serve to shake stronger nerves than hers. At least, Mrs. Bute thought it was her duty to inform the physician, and the apothecary, and the dame-de-compagnie, and the domestics, that Miss Crawley was in a most critical state, and that they were to act accordingly. She had the street laid knee-deep with straw; and the knocker put by with Mr. Bowls's plate. She insisted that the Doctor should call twice a day; and deluged her patient with draughts every two hours. When anybody entered the room, she uttered a shshshsh so sibilant and ominous, that it frightened the poor old lady in her bed, from which she could not look without seeing Mrs. Bute's beady eyes eagerly fixed on her, as the latter sate steadfast in the arm-chair by the bedside. They seemed to lighten in the dark (for she kept the curtains closed) as she moved about the room on velvet paws like a cat. There Miss Crawley lay for days--ever so many days--Mr. Bute reading books of devotion to her: for nights, long nights, during which she had to hear the watchman sing, the night-light sputter; visited at midnight, the last thing, by the stealthy apothecary; and then left to look at Mrs. Bute's twinkling eyes, or the flicks of yellow that the rushlight threw on the dreary darkened ceiling. Hygeia herself would have fallen sick under such a regimen; and how much more this poor old nervous victim? It has been said that when she was in health and good spirits, this venerable inhabitant of Vanity Fair had as free notions about religion and morals as Monsieur de Voltaire himself could desire, but when illness overtook her, it was aggravated by the most dreadful terrors of death, and an utter cowardice took possession of the prostrate old sinner.\nSick-bed homilies and pious reflections are, to be sure, out of place in mere story-books, and we are not going (after the fashion of some novelists of the present day) to cajole the public into a sermon, when it is only a comedy that the reader pays his money to witness. But, without preaching, the truth may surely be borne in mind, that the bustle, and triumph, and laughter, and gaiety which Vanity Fair exhibits in public, do not always pursue the performer into private life, and that the most dreary depression of spirits and dismal repentances sometimes overcome him. Recollection of the best ordained banquets will scarcely cheer sick epicures. Reminiscences of the most becoming dresses and brilliant ball triumphs will go very little way to console faded beauties. Perhaps statesmen, at a particular period of existence, are not much gratified at thinking over the most triumphant divisions; and the success or the pleasure of yesterday becomes of very small account when a certain (albeit uncertain) morrow is in view, about which all of us must some day or other be speculating. O brother wearers of motley! Are there not moments when one grows sick of grinning and tumbling, and the jingling of cap and bells? This, dear friends and companions, is my amiable object--to walk with you through the Fair, to examine the shops and the shows there; and that we should all come home after the flare, and the noise, and the gaiety, and be perfectly miserable in private.\n\"If that poor man of mine had a head on his shoulders,\" Mrs. Bute Crawley thought to herself, \"how useful he might be, under present circumstances, to this unhappy old lady! He might make her repent of her shocking free-thinking ways; he might urge her to do her duty, and cast off that odious reprobate who has disgraced himself and his family; and he might induce her to do justice to my dear girls and the two boys, who require and deserve, I am sure, every assistance which their relatives can give them.\"\nAnd, as the hatred of vice is always a progress towards virtue, Mrs. Bute Crawley endeavoured to instil her sister-in-law a proper abhorrence for all Rawdon Crawley's manifold sins: of which his uncle's wife brought forward such a catalogue as indeed would have served to condemn a whole regiment of young officers. If a man has committed wrong in life, I don't know any moralist more anxious to point his errors out to the world than his own relations; so Mrs. Bute showed a perfect family interest and knowledge of Rawdon's history. She had all the particulars of that ugly quarrel with Captain Marker, in which Rawdon, wrong from the beginning, ended in shooting the Captain. She knew how the unhappy Lord Dovedale, whose mamma had taken a house at Oxford, so that he might be educated there, and who had never touched a card in his life till he came to London, was perverted by Rawdon at the Cocoa-Tree, made helplessly tipsy by this abominable seducer and perverter of youth, and fleeced of four thousand pounds. She described with the most vivid minuteness the agonies of the country families whom he had ruined--the sons whom he had plunged into dishonour and poverty--the daughters whom he had inveigled into perdition. She knew the poor tradesmen who were bankrupt by his extravagance--the mean shifts and rogueries with which he had ministered to it--the astounding falsehoods by which he had imposed upon the most generous of aunts, and the ingratitude and ridicule by which he had repaid her sacrifices. She imparted these stories gradually to Miss Crawley; gave her the whole benefit of them; felt it to be her bounden duty as a Christian woman and mother of a family to do so; had not the smallest remorse or compunction for the victim whom her tongue was immolating; nay, very likely thought her act was quite meritorious, and plumed herself upon her resolute manner of performing it. Yes, if a man's character is to be abused, say what you will, there's nobody like a relation to do the business. And one is bound to own, regarding this unfortunate wretch of a Rawdon Crawley, that the mere truth was enough to condemn him, and that all inventions of scandal were quite superfluous pains on his friends' parts.\nRebecca, too, being now a relative, came in for the fullest share of Mrs. Bute's kind inquiries. This indefatigable pursuer of truth (having given strict orders that the door was to be denied to all emissaries or letters from Rawdon), took Miss Crawley's carriage, and drove to her old friend Miss Pinkerton, at Minerva House, Chiswick Mall, to whom she announced the dreadful intelligence of Captain Rawdon's seduction by Miss Sharp, and from whom she got sundry strange particulars regarding the ex-governess's birth and early history. The friend of the Lexicographer had plenty of information to give. Miss Jemima was made to fetch the drawing-master's receipts and letters. This one was from a spunging-house: that entreated an advance: another was full of gratitude for Rebecca's reception by the ladies of Chiswick: and the last document from the unlucky artist's pen was that in which, from his dying bed, he recommended his orphan child to Miss Pinkerton's protection. There were juvenile letters and petitions from Rebecca, too, in the collection, imploring aid for her father or declaring her own gratitude. Perhaps in Vanity Fair there are no better satires than letters. Take a bundle of your dear friend's of ten years back--your dear friend whom you hate now. Look at a file of your sister's! how you clung to each other till you quarrelled about the twenty-pound legacy! Get down the round-hand scrawls of your son who has half broken your heart with selfish undutifulness since; or a parcel of your own, breathing endless ardour and love eternal, which were sent back by your mistress when she married the Nabob--your mistress for whom you now care no more than for Queen Elizabeth. Vows, love, promises, confidences, gratitude, how queerly they read after a while! There ought to be a law in Vanity Fair ordering the destruction of every written document (except receipted tradesmen's bills) after a certain brief and proper interval. Those quacks and misanthropes who advertise indelible Japan ink should be made to perish along with their wicked discoveries. The best ink for Vanity Fair use would be one that faded utterly in a couple of days, and left the paper clean and blank, so that you might write on it to somebody else.\nFrom Miss Pinkerton's the indefatigable Mrs. Bute followed the track of Sharp and his daughter back to the lodgings in Greek Street, which the defunct painter had occupied; and where portraits of the landlady in white satin, and of the husband in brass buttons, done by Sharp in lieu of a quarter's rent, still decorated the parlour walls. Mrs. Stokes was a communicative person, and quickly told all she knew about Mr. Sharp; how dissolute and poor he was; how good-natured and amusing; how he was always hunted by bailiffs and duns; how, to the landlady's horror, though she never could abide the woman, he did not marry his wife till a short time before her death; and what a queer little wild vixen his daughter was; how she kept them all laughing with her fun and mimicry; how she used to fetch the gin from the public-house, and was known in all the studios in the quarter--in brief, Mrs. Bute got such a full account of her new niece's parentage, education, and behaviour as would scarcely have pleased Rebecca, had the latter known that such inquiries were being made concerning her.\nOf all these industrious researches Miss Crawley had the full benefit. Mrs. Rawdon Crawley was the daughter of an opera-girl. She had danced herself. She had been a model to the painters. She was brought up as became her mother's daughter. She drank gin with her father, &c. &c. It was a lost woman who was married to a lost man; and the moral to be inferred from Mrs. Bute's tale was, that the knavery of the pair was irremediable, and that no properly conducted person should ever notice them again.\nThese were the materials which prudent Mrs. Bute gathered together in Park Lane, the provisions and ammunition as it were with which she fortified the house against the siege which she knew that Rawdon and his wife would lay to Miss Crawley.\nBut if a fault may be found with her arrangements, it is this, that she was too eager: she managed rather too well; undoubtedly she made Miss Crawley more ill than was necessary; and though the old invalid succumbed to her authority, it was so harassing and severe, that the victim would be inclined to escape at the very first chance which fell in her way. Managing women, the ornaments of their sex--women who order everything for everybody, and know so much better than any person concerned what is good for their neighbours, don't sometimes speculate upon the possibility of a domestic revolt, or upon other extreme consequences resulting from their overstrained authority.\nThus, for instance, Mrs. Bute, with the best intentions no doubt in the world, and wearing herself to death as she did by foregoing sleep, dinner, fresh air, for the sake of her invalid sister-in-law, carried her conviction of the old lady's illness so far that she almost managed her into her coffin. She pointed out her sacrifices and their results one day to the constant apothecary, Mr. Clump.\n\"I am sure, my dear Mr. Clump,\" she said, \"no efforts of mine have been wanting to restore our dear invalid, whom the ingratitude of her nephew has laid on the bed of sickness. I never shrink from personal discomfort: I never refuse to sacrifice myself.\"\n\"Your devotion, it must be confessed, is admirable,\" Mr. Clump says, with a low bow; \"but--\"\n\"I have scarcely closed my eyes since my arrival: I give up sleep, health, every comfort, to my sense of duty. When my poor James was in the smallpox, did I allow any hireling to nurse him? No.\"\n\"You did what became an excellent mother, my dear Madam--the best of mothers; but--\"\n\"As the mother of a family and the wife of an English clergyman, I humbly trust that my principles are good,\" Mrs. Bute said, with a happy solemnity of conviction; \"and, as long as Nature supports me, never, never, Mr. Clump, will I desert the post of duty. Others may bring that grey head with sorrow to the bed of sickness (here Mrs. Bute, waving her hand, pointed to one of old Miss Crawley's coffee-coloured fronts, which was perched on a stand in the dressing-room), but I will never quit it. Ah, Mr. Clump! I fear, I know, that the couch needs spiritual as well as medical consolation.\"\n\"What I was going to observe, my dear Madam,\"--here the resolute Clump once more interposed with a bland air--\"what I was going to observe when you gave utterance to sentiments which do you so much honour, was that I think you alarm yourself needlessly about our kind friend, and sacrifice your own health too prodigally in her favour.\"\n\"I would lay down my life for my duty, or for any member of my husband's family,\" Mrs. Bute interposed.\n\"Yes, Madam, if need were; but we don't want Mrs Bute Crawley to be a martyr,\" Clump said gallantly. \"Dr Squills and myself have both considered Miss Crawley's case with every anxiety and care, as you may suppose. We see her low-spirited and nervous; family events have agitated her.\"\n\"Her nephew will come to perdition,\" Mrs. Crawley cried.\n\"Have agitated her: and you arrived like a guardian angel, my dear Madam, a positive guardian angel, I assure you, to soothe her under the pressure of calamity. But Dr. Squills and I were thinking that our amiable friend is not in such a state as renders confinement to her bed necessary. She is depressed, but this confinement perhaps adds to her depression. She should have change, fresh air, gaiety; the most delightful remedies in the pharmacopoeia,\" Mr. Clump said, grinning and showing his handsome teeth. \"Persuade her to rise, dear Madam; drag her from her couch and her low spirits; insist upon her taking little drives. They will restore the roses too to your cheeks, if I may so speak to Mrs. Bute Crawley.\"\n\"The sight of her horrid nephew casually in the Park, where I am told the wretch drives with the brazen partner of his crimes,\" Mrs. Bute said (letting the cat of selfishness out of the bag of secrecy), \"would cause her such a shock, that we should have to bring her back to bed again. She must not go out, Mr. Clump. She shall not go out as long as I remain to watch over her; And as for my health, what matters it? I give it cheerfully, sir. I sacrifice it at the altar of my duty.\"\n\"Upon my word, Madam,\" Mr. Clump now said bluntly, \"I won't answer for her life if she remains locked up in that dark room. She is so nervous that we may lose her any day; and if you wish Captain Crawley to be her heir, I warn you frankly, Madam, that you are doing your very best to serve him.\"\n\"Gracious mercy! is her life in danger?\" Mrs. Bute cried. \"Why, why, Mr. Clump, did you not inform me sooner?\"\nThe night before, Mr. Clump and Dr. Squills had had a consultation (over a bottle of wine at the house of Sir Lapin Warren, whose lady was about to present him with a thirteenth blessing), regarding Miss Crawley and her case.\n\"What a little harpy that woman from Hampshire is, Clump,\" Squills remarked, \"that has seized upon old Tilly Crawley. Devilish good Madeira.\"\n\"What a fool Rawdon Crawley has been,\" Clump replied, \"to go and marry a governess! There was something about the girl, too.\"\n\"Green eyes, fair skin, pretty figure, famous frontal development,\" Squills remarked. \"There is something about her; and Crawley was a fool, Squills.\"\n\"A d---- fool--always was,\" the apothecary replied.\n\"Of course the old girl will fling him over,\" said the physician, and after a pause added, \"She'll cut up well, I suppose.\"\n\"Cut up,\" says Clump with a grin; \"I wouldn't have her cut up for two hundred a year.\"\n\"That Hampshire woman will kill her in two months, Clump, my boy, if she stops about her,\" Dr. Squills said. \"Old woman; full feeder; nervous subject; palpitation of the heart; pressure on the brain; apoplexy; off she goes. Get her up, Clump; get her out: or I wouldn't give many weeks' purchase for your two hundred a year.\" And it was acting upon this hint that the worthy apothecary spoke with so much candour to Mrs. Bute Crawley.\nHaving the old lady under her hand: in bed: with nobody near, Mrs. Bute had made more than one assault upon her, to induce her to alter her will. But Miss Crawley's usual terrors regarding death increased greatly when such dismal propositions were made to her, and Mrs. Bute saw that she must get her patient into cheerful spirits and health before she could hope to attain the pious object which she had in view. Whither to take her was the next puzzle. The only place where she is not likely to meet those odious Rawdons is at church, and that won't amuse her, Mrs. Bute justly felt. \"We must go and visit our beautiful suburbs of London,\" she then thought. \"I hear they are the most picturesque in the world\"; and so she had a sudden interest for Hampstead, and Hornsey, and found that Dulwich had great charms for her, and getting her victim into her carriage, drove her to those rustic spots, beguiling the little journeys with conversations about Rawdon and his wife, and telling every story to the old lady which could add to her indignation against this pair of reprobates.\nPerhaps Mrs. Bute pulled the string unnecessarily tight. For though she worked up Miss Crawley to a proper dislike of her disobedient nephew, the invalid had a great hatred and secret terror of her victimizer, and panted to escape from her. After a brief space, she rebelled against Highgate and Hornsey utterly. She would go into the Park. Mrs. Bute knew they would meet the abominable Rawdon there, and she was right. One day in the ring, Rawdon's stanhope came in sight; Rebecca was seated by him. In the enemy's equipage Miss Crawley occupied her usual place, with Mrs. Bute on her left, the poodle and Miss Briggs on the back seat. It was a nervous moment, and Rebecca's heart beat quick as she recognized the carriage; and as the two vehicles crossed each other in a line, she clasped her hands, and looked towards the spinster with a face of agonized attachment and devotion. Rawdon himself trembled, and his face grew purple behind his dyed mustachios. Only old Briggs was moved in the other carriage, and cast her great eyes nervously towards her old friends. Miss Crawley's bonnet was resolutely turned towards the Serpentine. Mrs. Bute happened to be in ecstasies with the poodle, and was calling him a little darling, and a sweet little zoggy, and a pretty pet. The carriages moved on, each in his line.\n\"Done, by Jove,\" Rawdon said to his wife.\n\"Try once more, Rawdon,\" Rebecca answered. \"Could not you lock your wheels into theirs, dearest?\"\nRawdon had not the heart for that manoeuvre. When the carriages met again, he stood up in his stanhope; he raised his hand ready to doff his hat; he looked with all his eyes. But this time Miss Crawley's face was not turned away; she and Mrs. Bute looked him full in the face, and cut their nephew pitilessly. He sank back in his seat with an oath, and striking out of the ring, dashed away desperately homewards.\nIt was a gallant and decided triumph for Mrs. Bute. But she felt the danger of many such meetings, as she saw the evident nervousness of Miss Crawley; and she determined that it was most necessary for her dear friend's health, that they should leave town for a while, and recommended Brighton very strongly.",
        "paragraph_chars": [
            [
                0,
                1720
            ],
            [
                1720,
                2772
            ],
            [
                2772,
                3371
            ],
            [
                3371,
                3738
            ],
            [
                3738,
                4117
            ],
            [
                4117,
                5207
            ],
            [
                5207,
                7142
            ],
            [
                7142,
                8621
            ],
            [
                8621,
                9131
            ],
            [
                9131,
                11358
            ],
            [
                11358,
                13606
            ],
            [
                13606,
                14698
            ],
            [
                14698,
                15200
            ],
            [
                15200,
                15442
            ],
            [
                15442,
                16120
            ],
            [
                16120,
                16518
            ],
            [
                16518,
                16773
            ],
            [
                16773,
                16866
            ],
            [
                16866,
                17061
            ],
            [
                17061,
                17146
            ],
            [
                17146,
                17739
            ],
            [
                17739,
                18076
            ],
            [
                18076,
                18180
            ],
            [
                18180,
                18465
            ],
            [
                18465,
                18522
            ],
            [
                18522,
                19241
            ],
            [
                19241,
                19726
            ],
            [
                19726,
                20022
            ],
            [
                20022,
                20133
            ],
            [
                20133,
                20359
            ],
            [
                20359,
                20501
            ],
            [
                20501,
                20627
            ],
            [
                20627,
                20778
            ],
            [
                20778,
                20830
            ],
            [
                20830,
                20954
            ],
            [
                20954,
                21041
            ],
            [
                21041,
                21476
            ],
            [
                21476,
                22558
            ],
            [
                22558,
                23874
            ],
            [
                23874,
                23916
            ],
            [
                23916,
                24014
            ],
            [
                24014,
                24428
            ],
            [
                24428,
                24735
            ]
        ],
        "segment_chars": [
            [
                0,
                323
            ],
            [
                323,
                568
            ],
            [
                568,
                748
            ],
            [
                748,
                824
            ],
            [
                824,
                908
            ],
            [
                908,
                1204
            ],
            [
                1204,
                1370
            ],
            [
                1370,
                1720
            ],
            [
                1720,
                2095
            ],
            [
                2095,
                2253
            ],
            [
                2253,
                2772
            ],
            [
                2772,
                2892
            ],
            [
                2892,
                3098
            ],
            [
                3098,
                3141
            ],
            [
                3141,
                3296
            ],
            [
                3296,
                3371
            ],
            [
                3371,
                3524
            ],
            [
                3524,
                3738
            ],
            [
                3738,
                3903
            ],
            [
                3903,
                4117
            ],
            [
                4117,
                4205
            ],
            [
                4205,
                4313
            ],
            [
                4313,
                4369
            ],
            [
                4369,
                4503
            ],
            [
                4503,
                4627
            ],
            [
                4627,
                4702
            ],
            [
                4702,
                4802
            ],
            [
                4802,
                5001
            ],
            [
                5001,
                5207
            ],
            [
                5207,
                5461
            ],
            [
                5461,
                5683
            ],
            [
                5683,
                5776
            ],
            [
                5776,
                5885
            ],
            [
                5885,
                6165
            ],
            [
                6165,
                6290
            ],
            [
                6290,
                6682
            ],
            [
                6682,
                6790
            ],
            [
                6790,
                7142
            ],
            [
                7142,
                7415
            ],
            [
                7415,
                7719
            ],
            [
                7719,
                7797
            ],
            [
                7797,
                7919
            ],
            [
                7919,
                8235
            ],
            [
                8235,
                8264
            ],
            [
                8264,
                8367
            ],
            [
                8367,
                8621
            ],
            [
                8621,
                8795
            ],
            [
                8795,
                9131
            ],
            [
                9131,
                9447
            ],
            [
                9447,
                9666
            ],
            [
                9666,
                9810
            ],
            [
                9810,
                10149
            ],
            [
                10149,
                10359
            ],
            [
                10359,
                10647
            ],
            [
                10647,
                11031
            ],
            [
                11031,
                11144
            ],
            [
                11144,
                11358
            ],
            [
                11358,
                11455
            ],
            [
                11455,
                11896
            ],
            [
                11896,
                11963
            ],
            [
                11963,
                12036
            ],
            [
                12036,
                12335
            ],
            [
                12335,
                12476
            ],
            [
                12476,
                12541
            ],
            [
                12541,
                12632
            ],
            [
                12632,
                12665
            ],
            [
                12665,
                12744
            ],
            [
                12744,
                13057
            ],
            [
                13057,
                13140
            ],
            [
                13140,
                13310
            ],
            [
                13310,
                13436
            ],
            [
                13436,
                13606
            ],
            [
                13606,
                13946
            ],
            [
                13946,
                14698
            ],
            [
                14698,
                14769
            ],
            [
                14769,
                14824
            ],
            [
                14824,
                14848
            ],
            [
                14848,
                14886
            ],
            [
                14886,
                14938
            ],
            [
                14938,
                15200
            ],
            [
                15200,
                15442
            ],
            [
                15442,
                15800
            ],
            [
                15800,
                16120
            ],
            [
                16120,
                16422
            ],
            [
                16422,
                16518
            ],
            [
                16518,
                16695
            ],
            [
                16695,
                16773
            ],
            [
                16773,
                16866
            ],
            [
                16866,
                16977
            ],
            [
                16977,
                17056
            ],
            [
                17056,
                17061
            ],
            [
                17061,
                17146
            ],
            [
                17146,
                17404
            ],
            [
                17404,
                17644
            ],
            [
                17644,
                17659
            ],
            [
                17659,
                17739
            ],
            [
                17739,
                18076
            ],
            [
                18076,
                18180
            ],
            [
                18180,
                18281
            ],
            [
                18281,
                18394
            ],
            [
                18394,
                18465
            ],
            [
                18465,
                18522
            ],
            [
                18522,
                18683
            ],
            [
                18683,
                18811
            ],
            [
                18811,
                18882
            ],
            [
                18882,
                19034
            ],
            [
                19034,
                19152
            ],
            [
                19152,
                19241
            ],
            [
                19241,
                19527
            ],
            [
                19527,
                19559
            ],
            [
                19559,
                19658
            ],
            [
                19658,
                19685
            ],
            [
                19685,
                19726
            ],
            [
                19726,
                19850
            ],
            [
                19850,
                20022
            ],
            [
                20022,
                20039
            ],
            [
                20039,
                20063
            ],
            [
                20063,
                20080
            ],
            [
                20080,
                20133
            ],
            [
                20133,
                20359
            ],
            [
                20359,
                20477
            ],
            [
                20477,
                20501
            ],
            [
                20501,
                20585
            ],
            [
                20585,
                20627
            ],
            [
                20627,
                20713
            ],
            [
                20713,
                20778
            ],
            [
                20778,
                20830
            ],
            [
                20830,
                20954
            ],
            [
                20954,
                21041
            ],
            [
                21041,
                21150
            ],
            [
                21150,
                21265
            ],
            [
                21265,
                21367
            ],
            [
                21367,
                21476
            ],
            [
                21476,
                21622
            ],
            [
                21622,
                21890
            ],
            [
                21890,
                21931
            ],
            [
                21931,
                22062
            ],
            [
                22062,
                22136
            ],
            [
                22136,
                22558
            ],
            [
                22558,
                22615
            ],
            [
                22615,
                22799
            ],
            [
                22799,
                22871
            ],
            [
                22871,
                22899
            ],
            [
                22899,
                22978
            ],
            [
                22978,
                23059
            ],
            [
                23059,
                23195
            ],
            [
                23195,
                23441
            ],
            [
                23441,
                23519
            ],
            [
                23519,
                23627
            ],
            [
                23627,
                23695
            ],
            [
                23695,
                23832
            ],
            [
                23832,
                23874
            ],
            [
                23874,
                23916
            ],
            [
                23916,
                23959
            ],
            [
                23959,
                24014
            ],
            [
                24014,
                24059
            ],
            [
                24059,
                24189
            ],
            [
                24189,
                24324
            ],
            [
                24324,
                24428
            ],
            [
                24428,
                24480
            ],
            [
                24480,
                24735
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                210,
                223
            ],
            [
                237,
                255
            ],
            [
                17,
                20
            ],
            [
                164,
                176
            ],
            [
                279,
                285
            ],
            [
                22,
                29
            ],
            [
                286,
                323
            ],
            [
                323,
                326
            ],
            [
                336,
                398
            ],
            [
                420,
                429
            ],
            [
                445,
                450
            ],
            [
                466,
                474
            ],
            [
                476,
                526
            ],
            [
                540,
                568
            ],
            [
                568,
                595
            ],
            [
                623,
                642
            ],
            [
                647,
                650
            ],
            [
                655,
                668
            ],
            [
                681,
                748
            ],
            [
                1370,
                1418
            ],
            [
                1432,
                1454
            ],
            [
                1551,
                1552
            ],
            [
                1456,
                1459
            ],
            [
                1429,
                1431
            ],
            [
                1460,
                1477
            ],
            [
                1514,
                1517
            ],
            [
                1477,
                1513
            ],
            [
                1553,
                1561
            ],
            [
                1562,
                1568
            ],
            [
                1581,
                1624
            ],
            [
                1655,
                1691
            ],
            [
                1701,
                1720
            ],
            [
                1720,
                1759
            ],
            [
                1888,
                1891
            ],
            [
                1762,
                1783
            ],
            [
                1787,
                1848
            ],
            [
                2093,
                2095
            ],
            [
                2095,
                2106
            ],
            [
                2113,
                2156
            ],
            [
                2161,
                2199
            ],
            [
                2251,
                2253
            ],
            [
                2253,
                2260
            ],
            [
                2262,
                2305
            ],
            [
                2319,
                2344
            ],
            [
                2392,
                2425
            ],
            [
                2348,
                2358
            ],
            [
                2425,
                2460
            ],
            [
                2471,
                2519
            ],
            [
                2521,
                2538
            ],
            [
                2550,
                2553
            ],
            [
                2671,
                2673
            ],
            [
                2570,
                2581
            ],
            [
                2612,
                2616
            ],
            [
                2595,
                2603
            ],
            [
                2582,
                2587
            ],
            [
                2770,
                2772
            ],
            [
                2892,
                2915
            ],
            [
                2923,
                2979
            ],
            [
                2916,
                2918
            ],
            [
                2995,
                3043
            ],
            [
                3073,
                3075
            ],
            [
                3088,
                3090
            ],
            [
                3096,
                3098
            ],
            [
                3098,
                3141
            ],
            [
                3265,
                3281
            ],
            [
                3210,
                3212
            ],
            [
                3296,
                3318
            ],
            [
                3320,
                3371
            ],
            [
                3382,
                3436
            ],
            [
                3460,
                3485
            ],
            [
                3496,
                3502
            ],
            [
                3519,
                3524
            ],
            [
                3590,
                3602
            ],
            [
                3565,
                3588
            ],
            [
                3609,
                3648
            ],
            [
                3529,
                3531
            ],
            [
                3538,
                3541
            ],
            [
                3543,
                3547
            ],
            [
                3648,
                3700
            ],
            [
                3718,
                3738
            ],
            [
                3851,
                3901
            ],
            [
                3738,
                3742
            ],
            [
                3746,
                3751
            ],
            [
                3769,
                3775
            ],
            [
                3783,
                3793
            ],
            [
                3901,
                3903
            ],
            [
                3903,
                3949
            ],
            [
                3964,
                4077
            ],
            [
                4115,
                4117
            ],
            [
                4117,
                4136
            ],
            [
                4205,
                4240
            ],
            [
                4203,
                4204
            ],
            [
                4246,
                4290
            ],
            [
                4332,
                4338
            ],
            [
                4340,
                4351
            ],
            [
                4311,
                4312
            ],
            [
                4313,
                4331
            ],
            [
                4240,
                4241
            ],
            [
                4357,
                4369
            ],
            [
                4369,
                4436
            ],
            [
                4443,
                4448
            ],
            [
                4452,
                4462
            ],
            [
                4463,
                4465
            ],
            [
                4470,
                4479
            ],
            [
                4501,
                4502
            ],
            [
                4503,
                4533
            ],
            [
                4541,
                4560
            ],
            [
                4568,
                4583
            ],
            [
                4615,
                4627
            ],
            [
                4702,
                4707
            ],
            [
                4714,
                4802
            ],
            [
                4802,
                4873
            ],
            [
                4891,
                4912
            ],
            [
                4957,
                4960
            ],
            [
                4934,
                4942
            ],
            [
                4968,
                4970
            ],
            [
                4913,
                4931
            ],
            [
                4950,
                4953
            ],
            [
                4971,
                5001
            ],
            [
                5001,
                5011
            ],
            [
                5035,
                5053
            ],
            [
                5060,
                5081
            ],
            [
                5087,
                5092
            ],
            [
                5105,
                5127
            ],
            [
                5150,
                5166
            ],
            [
                5179,
                5207
            ],
            [
                5252,
                5264
            ],
            [
                5274,
                5277
            ],
            [
                5425,
                5427
            ],
            [
                5326,
                5340
            ],
            [
                5234,
                5235
            ],
            [
                5342,
                5405
            ],
            [
                5459,
                5461
            ],
            [
                5461,
                5557
            ],
            [
                5594,
                5642
            ],
            [
                5681,
                5683
            ],
            [
                5683,
                5727
            ],
            [
                5757,
                5758
            ],
            [
                5727,
                5728
            ],
            [
                5776,
                5858
            ],
            [
                5859,
                5885
            ],
            [
                5983,
                6000
            ],
            [
                6028,
                6042
            ],
            [
                6013,
                6017
            ],
            [
                6004,
                6011
            ],
            [
                6043,
                6101
            ],
            [
                6163,
                6165
            ],
            [
                6165,
                6179
            ],
            [
                6188,
                6199
            ],
            [
                6235,
                6289
            ],
            [
                6290,
                6316
            ],
            [
                6331,
                6340
            ],
            [
                6467,
                6468
            ],
            [
                6573,
                6576
            ],
            [
                6344,
                6388
            ],
            [
                6397,
                6456
            ],
            [
                6680,
                6682
            ],
            [
                6812,
                6857
            ],
            [
                7130,
                7133
            ],
            [
                6868,
                6897
            ],
            [
                6901,
                6939
            ],
            [
                6984,
                7019
            ],
            [
                7038,
                7072
            ],
            [
                7140,
                7141
            ],
            [
                7483,
                7520
            ],
            [
                7533,
                7623
            ],
            [
                7717,
                7719
            ],
            [
                8264,
                8367
            ],
            [
                8367,
                8385
            ],
            [
                8400,
                8422
            ],
            [
                8424,
                8458
            ],
            [
                8505,
                8543
            ],
            [
                8559,
                8564
            ],
            [
                8386,
                8389
            ],
            [
                8574,
                8621
            ],
            [
                8621,
                8702
            ],
            [
                8713,
                8738
            ],
            [
                8793,
                8795
            ],
            [
                8795,
                8808
            ],
            [
                8813,
                8835
            ],
            [
                8850,
                8902
            ],
            [
                8809,
                8812
            ],
            [
                8908,
                8914
            ],
            [
                9063,
                9064
            ],
            [
                8951,
                8954
            ],
            [
                8994,
                9015
            ],
            [
                9038,
                9043
            ],
            [
                9056,
                9063
            ],
            [
                9076,
                9131
            ],
            [
                9195,
                9212
            ],
            [
                9225,
                9234
            ],
            [
                9235,
                9297
            ],
            [
                9307,
                9312
            ],
            [
                9168,
                9169
            ],
            [
                9150,
                9152
            ],
            [
                9411,
                9447
            ],
            [
                9598,
                9614
            ],
            [
                9635,
                9666
            ],
            [
                9666,
                9681
            ],
            [
                9694,
                9735
            ],
            [
                9745,
                9751
            ],
            [
                9808,
                9810
            ],
            [
                9810,
                9822
            ],
            [
                9835,
                9849
            ],
            [
                9931,
                9971
            ],
            [
                9994,
                10060
            ],
            [
                10110,
                10149
            ],
            [
                10149,
                10162
            ],
            [
                10194,
                10212
            ],
            [
                10221,
                10248
            ],
            [
                10250,
                10283
            ],
            [
                10298,
                10305
            ],
            [
                10307,
                10332
            ],
            [
                10343,
                10359
            ],
            [
                10359,
                10367
            ],
            [
                10492,
                10546
            ],
            [
                10408,
                10411
            ],
            [
                10556,
                10564
            ],
            [
                10573,
                10582
            ],
            [
                10599,
                10607
            ],
            [
                10456,
                10460
            ],
            [
                10611,
                10634
            ],
            [
                10645,
                10646
            ],
            [
                10647,
                10650
            ],
            [
                10660,
                10673
            ],
            [
                10684,
                10699
            ],
            [
                10916,
                10917
            ],
            [
                10742,
                10754
            ],
            [
                10773,
                10782
            ],
            [
                10763,
                10767
            ],
            [
                10822,
                10850
            ],
            [
                10866,
                10869
            ],
            [
                10706,
                10709
            ],
            [
                10874,
                10880
            ],
            [
                11029,
                11031
            ],
            [
                11036,
                11072
            ],
            [
                11091,
                11144
            ],
            [
                11144,
                11167
            ],
            [
                11224,
                11243
            ],
            [
                11184,
                11195
            ],
            [
                11208,
                11214
            ],
            [
                11244,
                11270
            ],
            [
                11295,
                11305
            ],
            [
                11356,
                11358
            ],
            [
                11358,
                11370
            ],
            [
                11392,
                11455
            ],
            [
                11636,
                11669
            ],
            [
                11685,
                11699
            ],
            [
                11797,
                11814
            ],
            [
                11822,
                11829
            ],
            [
                11610,
                11612
            ],
            [
                11881,
                11896
            ],
            [
                11963,
                12026
            ],
            [
                12027,
                12036
            ],
            [
                12335,
                12362
            ],
            [
                12377,
                12394
            ],
            [
                12413,
                12460
            ],
            [
                12465,
                12476
            ],
            [
                12476,
                12541
            ],
            [
                13057,
                13062
            ],
            [
                13069,
                13077
            ],
            [
                13090,
                13140
            ],
            [
                13140,
                13229
            ],
            [
                13267,
                13282
            ],
            [
                13300,
                13308
            ],
            [
                13289,
                13292
            ],
            [
                13354,
                13363
            ],
            [
                13370,
                13383
            ],
            [
                13434,
                13436
            ],
            [
                13436,
                13540
            ],
            [
                13551,
                13556
            ],
            [
                13604,
                13606
            ],
            [
                13606,
                13627
            ],
            [
                13737,
                13738
            ],
            [
                13628,
                13708
            ],
            [
                13713,
                13737
            ],
            [
                13944,
                13946
            ],
            [
                13946,
                13957
            ],
            [
                14201,
                14204
            ],
            [
                13998,
                14067
            ],
            [
                14098,
                14130
            ],
            [
                14139,
                14170
            ],
            [
                14210,
                14366
            ],
            [
                14375,
                14382
            ],
            [
                13984,
                13989
            ],
            [
                14392,
                14435
            ],
            [
                14696,
                14698
            ],
            [
                14769,
                14824
            ],
            [
                14824,
                14848
            ],
            [
                14848,
                14886
            ],
            [
                14938,
                14968
            ],
            [
                14971,
                14972
            ],
            [
                14975,
                14976
            ],
            [
                14980,
                15041
            ],
            [
                15079,
                15082
            ],
            [
                15084,
                15092
            ],
            [
                15108,
                15112
            ],
            [
                15198,
                15200
            ],
            [
                15200,
                15210
            ],
            [
                15281,
                15310
            ],
            [
                15322,
                15332
            ],
            [
                15239,
                15248
            ],
            [
                15337,
                15350
            ],
            [
                15270,
                15279
            ],
            [
                15351,
                15441
            ],
            [
                15442,
                15445
            ],
            [
                15510,
                15527
            ],
            [
                15529,
                15557
            ],
            [
                15570,
                15619
            ],
            [
                15491,
                15492
            ],
            [
                15621,
                15624
            ],
            [
                15679,
                15706
            ],
            [
                15708,
                15716
            ],
            [
                15636,
                15639
            ],
            [
                15733,
                15751
            ],
            [
                15798,
                15800
            ],
            [
                15844,
                15884
            ],
            [
                15971,
                15976
            ],
            [
                15987,
                15996
            ],
            [
                15816,
                15819
            ],
            [
                16062,
                16074
            ],
            [
                15830,
                15832
            ],
            [
                16090,
                16120
            ],
            [
                16120,
                16124
            ],
            [
                16140,
                16184
            ],
            [
                16319,
                16422
            ],
            [
                16422,
                16452
            ],
            [
                16471,
                16485
            ],
            [
                16495,
                16518
            ],
            [
                16518,
                16589
            ],
            [
                16598,
                16625
            ],
            [
                16693,
                16695
            ],
            [
                16695,
                16709
            ],
            [
                16734,
                16773
            ],
            [
                16773,
                16787
            ],
            [
                16811,
                16835
            ],
            [
                16840,
                16862
            ],
            [
                16864,
                16866
            ],
            [
                16866,
                16867
            ],
            [
                16916,
                16977
            ],
            [
                16977,
                16995
            ],
            [
                17003,
                17056
            ],
            [
                17056,
                17061
            ],
            [
                17061,
                17116
            ],
            [
                17137,
                17142
            ],
            [
                17144,
                17146
            ],
            [
                17146,
                17149
            ],
            [
                17177,
                17270
            ],
            [
                17272,
                17276
            ],
            [
                17279,
                17284
            ],
            [
                17298,
                17352
            ],
            [
                17372,
                17385
            ],
            [
                17398,
                17404
            ],
            [
                17644,
                17659
            ],
            [
                17659,
                17665
            ],
            [
                17675,
                17683
            ],
            [
                17690,
                17739
            ],
            [
                17739,
                17784
            ],
            [
                17791,
                17809
            ],
            [
                17820,
                17830
            ],
            [
                17943,
                17944
            ],
            [
                17849,
                17850
            ],
            [
                17945,
                18048
            ],
            [
                17932,
                17936
            ],
            [
                18073,
                18076
            ],
            [
                18076,
                18113
            ],
            [
                18180,
                18191
            ],
            [
                18205,
                18224
            ],
            [
                18242,
                18281
            ],
            [
                18281,
                18296
            ],
            [
                18309,
                18337
            ],
            [
                18405,
                18465
            ],
            [
                18465,
                18481
            ],
            [
                18487,
                18522
            ],
            [
                18522,
                18523
            ],
            [
                18542,
                18595
            ],
            [
                18637,
                18650
            ],
            [
                18681,
                18683
            ],
            [
                18683,
                18704
            ],
            [
                18719,
                18723
            ],
            [
                18777,
                18799
            ],
            [
                18743,
                18749
            ],
            [
                18800,
                18811
            ],
            [
                18811,
                18832
            ],
            [
                18882,
                18923
            ],
            [
                18974,
                19001
            ],
            [
                19032,
                19034
            ],
            [
                19034,
                19068
            ],
            [
                19114,
                19152
            ],
            [
                19152,
                19179
            ],
            [
                19184,
                19198
            ],
            [
                19180,
                19183
            ],
            [
                19238,
                19241
            ],
            [
                19241,
                19272
            ],
            [
                19282,
                19293
            ],
            [
                19366,
                19383
            ],
            [
                19293,
                19294
            ],
            [
                19444,
                19527
            ],
            [
                19527,
                19559
            ],
            [
                19623,
                19640
            ],
            [
                19685,
                19699
            ],
            [
                19668,
                19678
            ],
            [
                19700,
                19726
            ],
            [
                19726,
                19850
            ],
            [
                19850,
                20009
            ],
            [
                20016,
                20022
            ],
            [
                20022,
                20039
            ],
            [
                20039,
                20063
            ],
            [
                20063,
                20080
            ],
            [
                20080,
                20084
            ],
            [
                20102,
                20133
            ],
            [
                20133,
                20149
            ],
            [
                20149,
                20199
            ],
            [
                20272,
                20277
            ],
            [
                20332,
                20359
            ],
            [
                20359,
                20366
            ],
            [
                20374,
                20475
            ],
            [
                20501,
                20585
            ],
            [
                20585,
                20627
            ],
            [
                20627,
                20664
            ],
            [
                20711,
                20713
            ],
            [
                20841,
                20873
            ],
            [
                21042,
                21098
            ],
            [
                21107,
                21113
            ],
            [
                21148,
                21150
            ],
            [
                21151,
                21161
            ],
            [
                21175,
                21182
            ],
            [
                21239,
                21265
            ],
            [
                21265,
                21295
            ],
            [
                21364,
                21366
            ],
            [
                21367,
                21370
            ],
            [
                21371,
                21377
            ],
            [
                21400,
                21432
            ],
            [
                21438,
                21440
            ],
            [
                21454,
                21476
            ],
            [
                21525,
                21531
            ],
            [
                21532,
                21570
            ],
            [
                21579,
                21583
            ],
            [
                21589,
                21622
            ],
            [
                21622,
                21640
            ],
            [
                21665,
                21705
            ],
            [
                21719,
                21806
            ],
            [
                21818,
                21834
            ],
            [
                21888,
                21889
            ],
            [
                21946,
                21951
            ],
            [
                21898,
                21929
            ],
            [
                22011,
                22012
            ],
            [
                21952,
                21955
            ],
            [
                21959,
                21962
            ],
            [
                21970,
                21977
            ],
            [
                21991,
                21994
            ],
            [
                21929,
                21930
            ],
            [
                22062,
                22070
            ],
            [
                22078,
                22117
            ],
            [
                22127,
                22136
            ],
            [
                22136,
                22186
            ],
            [
                22303,
                22340
            ],
            [
                22196,
                22199
            ],
            [
                22341,
                22353
            ],
            [
                22360,
                22372
            ],
            [
                22543,
                22545
            ],
            [
                22226,
                22235
            ],
            [
                22189,
                22192
            ],
            [
                22265,
                22272
            ],
            [
                22372,
                22387
            ],
            [
                22395,
                22524
            ],
            [
                22556,
                22558
            ],
            [
                22558,
                22615
            ],
            [
                22615,
                22618
            ],
            [
                22700,
                22717
            ],
            [
                22724,
                22799
            ],
            [
                22799,
                22812
            ],
            [
                22818,
                22832
            ],
            [
                22871,
                22883
            ],
            [
                22889,
                22899
            ],
            [
                22899,
                22977
            ],
            [
                22978,
                22992
            ],
            [
                22997,
                23007
            ],
            [
                23017,
                23059
            ],
            [
                23059,
                23073
            ],
            [
                23083,
                23149
            ],
            [
                23161,
                23195
            ],
            [
                23195,
                23250
            ],
            [
                23254,
                23268
            ],
            [
                23287,
                23325
            ],
            [
                23335,
                23441
            ],
            [
                23441,
                23447
            ],
            [
                23456,
                23518
            ],
            [
                23545,
                23567
            ],
            [
                23524,
                23534
            ],
            [
                23572,
                23627
            ],
            [
                23627,
                23695
            ],
            [
                23695,
                23704
            ],
            [
                23754,
                23757
            ],
            [
                23733,
                23748
            ],
            [
                23750,
                23753
            ],
            [
                23832,
                23854
            ],
            [
                23872,
                23874
            ],
            [
                23916,
                23948
            ],
            [
                23957,
                23959
            ],
            [
                23959,
                24014
            ],
            [
                24014,
                24059
            ],
            [
                24059,
                24100
            ],
            [
                24121,
                24158
            ],
            [
                24187,
                24189
            ],
            [
                24189,
                24215
            ],
            [
                24227,
                24230
            ],
            [
                24238,
                24324
            ],
            [
                24324,
                24366
            ],
            [
                24393,
                24399
            ],
            [
                24405,
                24428
            ],
            [
                24428,
                24436
            ],
            [
                24449,
                24480
            ],
            [
                24480,
                24526
            ],
            [
                24696,
                24699
            ],
            [
                24598,
                24602
            ],
            [
                24625,
                24628
            ],
            [
                24538,
                24541
            ],
            [
                24562,
                24564
            ],
            [
                24629,
                24654
            ],
            [
                24660,
                24694
            ],
            [
                24577,
                24586
            ],
            [
                24700,
                24735
            ]
        ],
        "row_chars": [
            [
                0,
                323
            ],
            [
                323,
                568
            ],
            [
                568,
                748
            ],
            [
                748,
                824
            ],
            [
                824,
                908
            ],
            [
                908,
                1204
            ],
            [
                1204,
                1370
            ],
            [
                1370,
                1720
            ],
            [
                1720,
                2095
            ],
            [
                2095,
                2253
            ],
            [
                2253,
                2772
            ],
            [
                2772,
                2892
            ],
            [
                2892,
                3098
            ],
            [
                3098,
                3141
            ],
            [
                3141,
                3371
            ],
            [
                3371,
                3524
            ],
            [
                3524,
                3738
            ],
            [
                3738,
                3903
            ],
            [
                3903,
                4117
            ],
            [
                4117,
                4369
            ],
            [
                4369,
                4503
            ],
            [
                4503,
                4627
            ],
            [
                4627,
                4702
            ],
            [
                4702,
                4802
            ],
            [
                4802,
                5001
            ],
            [
                5001,
                5207
            ],
            [
                5207,
                5461
            ],
            [
                5461,
                5683
            ],
            [
                5683,
                5885
            ],
            [
                5885,
                6165
            ],
            [
                6165,
                6290
            ],
            [
                6290,
                6682
            ],
            [
                6682,
                6790
            ],
            [
                6790,
                7142
            ],
            [
                7142,
                7415
            ],
            [
                7415,
                7719
            ],
            [
                7719,
                7797
            ],
            [
                7797,
                7919
            ],
            [
                7919,
                8235
            ],
            [
                8235,
                8264
            ],
            [
                8264,
                8367
            ],
            [
                8367,
                8621
            ],
            [
                8621,
                8795
            ],
            [
                8795,
                9131
            ],
            [
                9131,
                9447
            ],
            [
                9447,
                9666
            ],
            [
                9666,
                9810
            ],
            [
                9810,
                10149
            ],
            [
                10149,
                10359
            ],
            [
                10359,
                10647
            ],
            [
                10647,
                11031
            ],
            [
                11031,
                11144
            ],
            [
                11144,
                11358
            ],
            [
                11358,
                11455
            ],
            [
                11455,
                11896
            ],
            [
                11896,
                11963
            ],
            [
                11963,
                12036
            ],
            [
                12036,
                12335
            ],
            [
                12335,
                12476
            ],
            [
                12476,
                12541
            ],
            [
                12541,
                12632
            ],
            [
                12632,
                12665
            ],
            [
                12665,
                12744
            ],
            [
                12744,
                13057
            ],
            [
                13057,
                13140
            ],
            [
                13140,
                13436
            ],
            [
                13436,
                13606
            ],
            [
                13606,
                13946
            ],
            [
                13946,
                14698
            ],
            [
                14698,
                14769
            ],
            [
                14769,
                14824
            ],
            [
                14824,
                14848
            ],
            [
                14848,
                14886
            ],
            [
                14886,
                14938
            ],
            [
                14938,
                15200
            ],
            [
                15200,
                15442
            ],
            [
                15442,
                15800
            ],
            [
                15800,
                16120
            ],
            [
                16120,
                16422
            ],
            [
                16422,
                16518
            ],
            [
                16518,
                16695
            ],
            [
                16695,
                16773
            ],
            [
                16773,
                16866
            ],
            [
                16866,
                16977
            ],
            [
                16977,
                17056
            ],
            [
                17056,
                17061
            ],
            [
                17061,
                17146
            ],
            [
                17146,
                17404
            ],
            [
                17404,
                17644
            ],
            [
                17644,
                17659
            ],
            [
                17659,
                17739
            ],
            [
                17739,
                18076
            ],
            [
                18076,
                18180
            ],
            [
                18180,
                18281
            ],
            [
                18281,
                18465
            ],
            [
                18465,
                18522
            ],
            [
                18522,
                18683
            ],
            [
                18683,
                18811
            ],
            [
                18811,
                19034
            ],
            [
                19034,
                19152
            ],
            [
                19152,
                19241
            ],
            [
                19241,
                19527
            ],
            [
                19527,
                19559
            ],
            [
                19559,
                19726
            ],
            [
                19726,
                19850
            ],
            [
                19850,
                20022
            ],
            [
                20022,
                20039
            ],
            [
                20039,
                20063
            ],
            [
                20063,
                20080
            ],
            [
                20080,
                20133
            ],
            [
                20133,
                20359
            ],
            [
                20359,
                20477
            ],
            [
                20477,
                20501
            ],
            [
                20501,
                20585
            ],
            [
                20585,
                20627
            ],
            [
                20627,
                20713
            ],
            [
                20713,
                20778
            ],
            [
                20778,
                20830
            ],
            [
                20830,
                20954
            ],
            [
                20954,
                21041
            ],
            [
                21041,
                21150
            ],
            [
                21150,
                21265
            ],
            [
                21265,
                21367
            ],
            [
                21367,
                21476
            ],
            [
                21476,
                21622
            ],
            [
                21622,
                21890
            ],
            [
                21890,
                22062
            ],
            [
                22062,
                22136
            ],
            [
                22136,
                22558
            ],
            [
                22558,
                22615
            ],
            [
                22615,
                22799
            ],
            [
                22799,
                22899
            ],
            [
                22899,
                22978
            ],
            [
                22978,
                23059
            ],
            [
                23059,
                23195
            ],
            [
                23195,
                23441
            ],
            [
                23441,
                23519
            ],
            [
                23519,
                23627
            ],
            [
                23627,
                23695
            ],
            [
                23695,
                23874
            ],
            [
                23874,
                23916
            ],
            [
                23916,
                23959
            ],
            [
                23959,
                24014
            ],
            [
                24014,
                24059
            ],
            [
                24059,
                24189
            ],
            [
                24189,
                24324
            ],
            [
                24324,
                24428
            ],
            [
                24428,
                24480
            ],
            [
                24480,
                24735
            ]
        ]
    },
    "abridged": {
        "text": "We have mentioned how kind and attentive Mrs Bute Crawley was to Firkin, Miss Crawley's confidential servant. She was a gracious friend to Miss Briggs, the companion, also; and had gained her good-will with those promises which cost so little in the making, and are yet so agreeable to the recipient. Indeed every good economist must know how cheap yet amiable these attentions are, and what a flavour they give to the most homely dish in life. Mrs. Bute had told Briggs and Firkin so often of her affection for them, and of what she would do for them, if she had Miss Crawley's fortune, that the two ladies had the deepest regard for her; and felt as grateful as if Mrs. Bute had loaded them with expensive favours.\nRawdon Crawley, on the other hand, like the selfish heavy dragoon he was, never took the least trouble to conciliate his aunt's companions. As his aunt made a butt of Briggs, the Captain followed her example, and levelled his jokes at her. Whereas Mrs. Bute consulted her in matters of taste, admired her poetry, and showed her appreciation of Briggs in a thousand ways; and if she made Firkin a twopenny present, accompanied it with so many compliments that the twopence was changed to gold in the maid's grateful heart.\nPraise everybody, I say: never be squeamish, but speak out your compliment both to a man's face, and behind his back, when you know he may get to hear of it. Never lose a chance of saying a kind word. Plant your compliments like acorns: an acorn costs nothing, but it may sprout into a prodigious bit of timber.\nDuring Rawdon Crawley's prosperity, he was only obeyed sulkily; when his disgrace came, nobody pitied him. But the garrison at Miss Crawley's house were charmed to act under such a leader as Mrs Bute, expecting all sorts of promotion from her promises and her kind words.\nMrs. Bute Crawley never allowed herself to suppose that Rawdon would be beaten by one defeat. She knew Rebecca to be too clever and spirited a woman to submit without a struggle; and felt that she must prepare for that combat, and be incessantly watchful.\nIn the first place, would Miss Crawley herself hold out? Had she not a secret longing to welcome back Rawdon and Rebecca? The old lady liked them; they amused her. Mrs. Bute could not disguise from herself the fact that none of her own family could contribute much to Miss Crawley's pleasures.\n\"My girls' singing, after that odious governess's, is unbearable,\" she admitted to herself. \"Jim's college manners and poor dear Bute's talk about his dogs and horses always annoyed her. If I took her to the Rectory, she would grow angry with us all, and fly; and might fall into the clutches of that horrid Rawdon and that little viper of a Sharp. Meanwhile, she is exceedingly ill, and cannot move for weeks; during which we must protect her from those unprincipled people.\"\nMiss Crawley was always ready to send for her doctor, and I daresay she was very unwell after the sudden family event. At least, Mrs. Bute thought it was her duty to inform the physician, and the apothecary, and the household, that Miss Crawley was in a most critical state. She had the street laid knee-deep with straw to muffle sounds; she insisted that the Doctor should call twice a day; and deluged her patient with medicinal draughts every two hours. The poor old lady could not look up from her bed without seeing Mrs. Bute's beady eyes eagerly fixed on her. They seemed to shine in the dark as she moved about the room on velvet paws like a cat.\nThere Miss Crawley lay for many days - Mrs. Bute reading books of devotion to her: for long nights, during which she had to hear the watchman sing. When she was in health and good spirits, this old inhabitant of Vanity Fair had free notions about religion and morals, but when illness overtook her, it brought the most dreadful terrors of death. For the bustle, and triumph, and laughter which Vanity Fair exhibits in public, do not always pursue the performer into private life. Are there not moments when one grows sick of grinning and tumbling, and the jingling of cap and bells? This, dear friends, is my amiable object - to walk with you through the Fair, so that we should all come home after the noise and gaiety, and be perfectly miserable in private.\n\"If that poor man of mine had a head on his shoulders,\" Mrs. Bute Crawley thought, \"how useful he might be! He might make this old lady repent of her shocking ways; he might urge her to do her duty, and cast off her odious nephew, and do justice to my dear children, who deserve every assistance which their relatives can give them.\"\nMrs. Bute Crawley tried to instil in her sister-in-law a proper abhorrence for all Rawdon Crawley's many sins: producing a list of them long enough for a whole regiment of young officers. She showed a perfect knowledge of Rawdon's history. She had all the details of that ugly quarrel with Captain Marker, when Rawdon shot him. She knew how young Lord Dovedale, who had never touched a card in his life, was perverted by Rawdon at the Cocoa-Tree, made helplessly tipsy, and fleeced of four thousand pounds. She described the agonies of the families whom he had ruined - the sons whom he had plunged into poverty - the daughters whom he had lured into perdition. She knew the astounding falsehoods by which he had imposed upon his generous aunt, and the ridicule with which he had repaid her.\nShe told these stories to Miss Crawley, feeling it to be her Christian duty. She had not the smallest remorse for her victim. If a man's character is to be abused, there's nobody like a relation to do the business. And one is bound to own that the mere truth about the unfortunate Rawdon was enough to condemn him, without any invention of scandal.\nRebecca, too, came in for the fullest share of Mrs. Bute's kind inquiries. Mrs. Bute visited her old friend Miss Pinkerton, at Chiswick Mall, from whom she got various strange facts about Rebecca's early history. Miss Jemima was made to fetch the drawing-master's receipts and begging-letters. There were juvenile letters from Rebecca, too, imploring aid for her father or declaring her gratitude. Perhaps in Vanity Fair there are no better satires than letters. Vows, promises, gratitude, how queerly they read after a while! There ought to be a law in Vanity Fair ordering the destruction of every written document after a certain interval - and indelible ink should be abolished. The best ink for Vanity Fair use would be one that faded utterly in a couple of days, and left the paper blank.\nFrom Miss Pinkerton's, the indefatigable Mrs. Bute followed the track of Sharp and his daughter back to their former lodgings in Greek Street. Mrs. Stokes the landlady told all she knew about Mr. Sharp; how dissolute and poor he was; how he was always hunted by bailiffs; how, to the landlady's horror, he did not marry his wife till a short time before her death; and what a queer little wild vixen his daughter was; how she kept them all laughing with her mimicry, and used to fetch the gin from the public-house.\nSo, in Mrs. Bute's tale, Mrs. Rawdon Crawley was the daughter of an opera-girl. She had danced herself. She had been a model to the painters. She drank gin with her father, etc. etc. She was a lost woman who was married to a lost man; and the moral was that the pair were beyond redemption.\nThese were the provisions and ammunition with which Mrs. Bute fortified the Park Lane house against the siege which she knew that Rawdon and his wife would lay to Miss Crawley. But she was too eager. She managed rather too well; she made Miss Crawley more ill than was necessary, and was so harassing and severe that the old lady might have been inclined to escape by dying. Women who order everything for everybody don't always speculate about the consequences of their overstrained authority.\nThus Mrs. Bute, with the best intentions no doubt, carried her conviction of the old lady's illness so far that she almost managed her into her coffin. She pointed out her sacrifices one day to the apothecary, Mr. Clump.\n\"I am sure, my dear Mr. Clump,\" she said, \"no efforts of mine have been lacking to restore our dear invalid. I never shrink: I never refuse to sacrifice myself.\"\n\"Your devotion is admirable,\" Mr. Clump said, with a low bow; \"but -\"\n\"I give up sleep, health, every comfort, to my sense of duty. When my poor James had the smallpox, did I allow any hireling to nurse him? No.\"\n\"You did what became an excellent mother, my dear Madam; but -\"\n\"As the wife of an English clergyman, I humbly trust that my principles are good,\" Mrs. Bute said with happy conviction; \"and, as long as Nature supports me, never will I desert my duty. Ah, Mr. Clump! I fear that the invalid needs spiritual as well as medical consolation.\"\n\"What I was going to observe, my dear Madam,\" the resolute Clump interposed, \"was that I think you alarm yourself needlessly about our kind friend, and sacrifice your own health too much.\"\n\"I would lay down my life for my duty.\"\n\"Yes, Madam; but we don't want you to be a martyr,\" Clump said gallantly. \"Dr Squills and both considered Miss Crawley to be low-spirited and nervous; family events have agitated her.\"\n\"Her nephew will go to perdition,\" Mrs. Crawley cried.\n\"And you arrived like a guardian angel, my dear Madam, to soothe her. But Dr. Squills and I think that confinement to her bed is not necessary. She is depressed, but she should have change, fresh air, gaiety,\" Mr. Clump said, grinning. \"Persuade her to rise, dear Madam; insist upon her taking little drives. They will restore the roses to your cheeks too.\"\n\"The sight of her horrid nephew in the Park,\" Mrs. Bute said, \"would cause her such a shock, that we should have to bring her back to bed again. She must not go out, Mr. Clump. As for my health, I sacrifice it cheerfully at the altar of my duty.\"\n\"Upon my word, Madam,\" Mr. Clump now said bluntly, \"I won't answer for her life if she remains locked up in that dark room. She is so nervous that we may lose her any day; and if you wish Captain Crawley to be her heir, I warn you frankly, Madam, that you are doing your very best to aid him.\"\n\"Gracious mercy! is her life in danger?\" Mrs. Bute cried. \"Why did you not inform me sooner?\"\nThe night before this, Mr. Clump and Dr. Squills had had a consultation about Miss Crawley and her case.\n\"What a harpy that woman from Hampshire is, Clump,\" Squills remarked, \"that has seized upon old Tilly Crawley.\"\n\"What a fool Rawdon Crawley has been,\" Clump replied, \"to go and marry a governess! There was something about the girl, too.\"\n\"Green eyes, fair skin, pretty figure. The old girl will fling him over. But that Hampshire woman will kill her in two months, Clump, if she stays there. Old woman; nervous palpitations; apoplexy; off she goes. Get her up, Clump; get her out.\"\nAnd thus it was that the worthy apothecary spoke so candidly to Mrs. Bute Crawley.\nWhen nobody was near, Mrs. Bute had made more than one attack upon Miss Crawley to induce her to alter her will. But Miss Crawley's terror of death increased greatly when such dismal suggestions were made to her, and Mrs. Bute saw that she must get her patient into cheerful spirits before she could succeed.\nWhere to take her was the next puzzle, if she was not to meet Rawdon Crawley.\n\"We must visit our beautiful suburbs of London,\" Mrs. Bute thought. \"I hear they are the most picturesque in the world.\" Getting her victim into her carriage, she drove her to the rustic spots of Hampstead and Dulwich, beguiling the journeys with conversations about Rawdon and his wife, and telling every story to the old lady which could add to her indignation.\nPerhaps Mrs. Bute pulled the string unnecessarily tight. For the invalid had a hatred and secret terror of her victimizer, and panted to escape from her. After a brief time, she rebelled: she would go to the Park. Mrs. Bute knew they would meet the abominable Rawdon there, and she was right.\nOne day in the Park, Rawdon's carriage came in sight; Rebecca was seated by him. In the enemy's carriage Miss Crawley occupied her usual place, with Mrs. Bute on her left, and Miss Briggs on the back seat. It was a nervous moment, and Rebecca's heart beat quick when she recognized them. As the two vehicles crossed each other, she clasped her hands, and looked towards the spinster with a face of agonized attachment and devotion. Rawdon trembled, and his face grew purple behind his dyed mustachios.\nIn the other carriage, old Briggs cast her great eyes nervously towards her old friends. Miss Crawley's bonnet was resolutely turned towards the Serpentine. Mrs. Bute was busy playing with the poodle; and the carriages moved on.\n\"Try once more, Rawdon,\" Rebecca urged. \"Could not you lock your wheels into theirs, dearest?\"\nRawdon had not the heart for that manoeuvre. When the carriages met again, he stood up, and raised his hand ready to doff his hat. But this time Miss Crawley did not turn away; she and Mrs. Bute looked him full in the face, and cut their nephew pitilessly. He sank back in his seat with an oath, and dashed desperately homewards.\nIt was a decided triumph for Mrs. Bute. But she felt the danger of many such meetings, and decided that for the sake of her dear friend's health, they should leave town for a while; and she recommended Brighton very strongly.",
        "paragraph_chars": [
            [
                0,
                717
            ],
            [
                717,
                1239
            ],
            [
                1239,
                1551
            ],
            [
                1551,
                1823
            ],
            [
                1823,
                2079
            ],
            [
                2079,
                2373
            ],
            [
                2373,
                2850
            ],
            [
                2850,
                3504
            ],
            [
                3504,
                4264
            ],
            [
                4264,
                4598
            ],
            [
                4598,
                5390
            ],
            [
                5390,
                5739
            ],
            [
                5739,
                6534
            ],
            [
                6534,
                7050
            ],
            [
                7050,
                7341
            ],
            [
                7341,
                7836
            ],
            [
                7836,
                8057
            ],
            [
                8057,
                8219
            ],
            [
                8219,
                8289
            ],
            [
                8289,
                8432
            ],
            [
                8432,
                8496
            ],
            [
                8496,
                8771
            ],
            [
                8771,
                8960
            ],
            [
                8960,
                9000
            ],
            [
                9000,
                9185
            ],
            [
                9185,
                9240
            ],
            [
                9240,
                9598
            ],
            [
                9598,
                9845
            ],
            [
                9845,
                10139
            ],
            [
                10139,
                10233
            ],
            [
                10233,
                10338
            ],
            [
                10338,
                10450
            ],
            [
                10450,
                10576
            ],
            [
                10576,
                10820
            ],
            [
                10820,
                10903
            ],
            [
                10903,
                11212
            ],
            [
                11212,
                11290
            ],
            [
                11290,
                11654
            ],
            [
                11654,
                11947
            ],
            [
                11947,
                12449
            ],
            [
                12449,
                12678
            ],
            [
                12678,
                12773
            ],
            [
                12773,
                13103
            ],
            [
                13103,
                13328
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                301
            ],
            [
                301,
                445
            ],
            [
                445,
                717
            ],
            [
                717,
                857
            ],
            [
                857,
                957
            ],
            [
                957,
                1239
            ],
            [
                1239,
                1397
            ],
            [
                1397,
                1440
            ],
            [
                1440,
                1551
            ],
            [
                1551,
                1658
            ],
            [
                1658,
                1823
            ],
            [
                1823,
                1917
            ],
            [
                1917,
                2079
            ],
            [
                2079,
                2136
            ],
            [
                2136,
                2201
            ],
            [
                2201,
                2243
            ],
            [
                2243,
                2373
            ],
            [
                2373,
                2465
            ],
            [
                2465,
                2560
            ],
            [
                2560,
                2722
            ],
            [
                2722,
                2850
            ],
            [
                2850,
                2969
            ],
            [
                2969,
                3125
            ],
            [
                3125,
                3307
            ],
            [
                3307,
                3416
            ],
            [
                3416,
                3504
            ],
            [
                3504,
                3652
            ],
            [
                3652,
                3850
            ],
            [
                3850,
                3984
            ],
            [
                3984,
                4087
            ],
            [
                4087,
                4264
            ],
            [
                4264,
                4372
            ],
            [
                4372,
                4598
            ],
            [
                4598,
                4786
            ],
            [
                4786,
                4838
            ],
            [
                4838,
                4926
            ],
            [
                4926,
                5105
            ],
            [
                5105,
                5260
            ],
            [
                5260,
                5390
            ],
            [
                5390,
                5467
            ],
            [
                5467,
                5516
            ],
            [
                5516,
                5605
            ],
            [
                5605,
                5739
            ],
            [
                5739,
                5814
            ],
            [
                5814,
                5952
            ],
            [
                5952,
                6033
            ],
            [
                6033,
                6137
            ],
            [
                6137,
                6202
            ],
            [
                6202,
                6266
            ],
            [
                6266,
                6422
            ],
            [
                6422,
                6534
            ],
            [
                6534,
                6677
            ],
            [
                6677,
                7050
            ],
            [
                7050,
                7130
            ],
            [
                7130,
                7154
            ],
            [
                7154,
                7192
            ],
            [
                7192,
                7233
            ],
            [
                7233,
                7341
            ],
            [
                7341,
                7518
            ],
            [
                7518,
                7541
            ],
            [
                7541,
                7716
            ],
            [
                7716,
                7836
            ],
            [
                7836,
                7988
            ],
            [
                7988,
                8057
            ],
            [
                8057,
                8166
            ],
            [
                8166,
                8219
            ],
            [
                8219,
                8289
            ],
            [
                8289,
                8351
            ],
            [
                8351,
                8427
            ],
            [
                8427,
                8432
            ],
            [
                8432,
                8496
            ],
            [
                8496,
                8683
            ],
            [
                8683,
                8698
            ],
            [
                8698,
                8771
            ],
            [
                8771,
                8960
            ],
            [
                8960,
                9000
            ],
            [
                9000,
                9074
            ],
            [
                9074,
                9185
            ],
            [
                9185,
                9240
            ],
            [
                9240,
                9310
            ],
            [
                9310,
                9384
            ],
            [
                9384,
                9476
            ],
            [
                9476,
                9549
            ],
            [
                9549,
                9598
            ],
            [
                9598,
                9743
            ],
            [
                9743,
                9775
            ],
            [
                9775,
                9845
            ],
            [
                9845,
                9969
            ],
            [
                9969,
                10139
            ],
            [
                10139,
                10156
            ],
            [
                10156,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10197,
                10233
            ],
            [
                10233,
                10338
            ],
            [
                10338,
                10450
            ],
            [
                10450,
                10534
            ],
            [
                10534,
                10576
            ],
            [
                10576,
                10615
            ],
            [
                10615,
                10649
            ],
            [
                10649,
                10730
            ],
            [
                10730,
                10787
            ],
            [
                10787,
                10820
            ],
            [
                10820,
                10903
            ],
            [
                10903,
                11016
            ],
            [
                11016,
                11212
            ],
            [
                11212,
                11290
            ],
            [
                11290,
                11358
            ],
            [
                11358,
                11411
            ],
            [
                11411,
                11654
            ],
            [
                11654,
                11711
            ],
            [
                11711,
                11808
            ],
            [
                11808,
                11868
            ],
            [
                11868,
                11947
            ],
            [
                11947,
                12028
            ],
            [
                12028,
                12153
            ],
            [
                12153,
                12235
            ],
            [
                12235,
                12379
            ],
            [
                12379,
                12449
            ],
            [
                12449,
                12538
            ],
            [
                12538,
                12606
            ],
            [
                12606,
                12678
            ],
            [
                12678,
                12718
            ],
            [
                12718,
                12773
            ],
            [
                12773,
                12818
            ],
            [
                12818,
                12904
            ],
            [
                12904,
                13030
            ],
            [
                13030,
                13103
            ],
            [
                13103,
                13143
            ],
            [
                13143,
                13328
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                8,
                21
            ],
            [
                22,
                40
            ],
            [
                41,
                44
            ],
            [
                45,
                57
            ],
            [
                58,
                64
            ],
            [
                65,
                72
            ],
            [
                73,
                110
            ],
            [
                110,
                113
            ],
            [
                118,
                180
            ],
            [
                192,
                201
            ],
            [
                207,
                212
            ],
            [
                213,
                221
            ],
            [
                222,
                272
            ],
            [
                273,
                301
            ],
            [
                301,
                328
            ],
            [
                329,
                348
            ],
            [
                349,
                352
            ],
            [
                353,
                366
            ],
            [
                378,
                445
            ],
            [
                445,
                493
            ],
            [
                494,
                516
            ],
            [
                516,
                517
            ],
            [
                518,
                521
            ],
            [
                522,
                524
            ],
            [
                525,
                542
            ],
            [
                543,
                546
            ],
            [
                551,
                587
            ],
            [
                588,
                596
            ],
            [
                601,
                607
            ],
            [
                608,
                651
            ],
            [
                661,
                697
            ],
            [
                698,
                717
            ],
            [
                717,
                756
            ],
            [
                757,
                760
            ],
            [
                761,
                782
            ],
            [
                783,
                844
            ],
            [
                855,
                857
            ],
            [
                857,
                868
            ],
            [
                869,
                912
            ],
            [
                917,
                955
            ],
            [
                955,
                957
            ],
            [
                957,
                964
            ],
            [
                965,
                1008
            ],
            [
                1008,
                1033
            ],
            [
                1034,
                1067
            ],
            [
                1071,
                1081
            ],
            [
                1086,
                1121
            ],
            [
                1122,
                1170
            ],
            [
                1171,
                1188
            ],
            [
                1189,
                1192
            ],
            [
                1201,
                1203
            ],
            [
                1204,
                1215
            ],
            [
                1216,
                1220
            ],
            [
                1223,
                1231
            ],
            [
                1232,
                1237
            ],
            [
                1237,
                1239
            ],
            [
                1239,
                1262
            ],
            [
                1262,
                1318
            ],
            [
                1319,
                1321
            ],
            [
                1322,
                1370
            ],
            [
                1390,
                1392
            ],
            [
                1393,
                1395
            ],
            [
                1395,
                1397
            ],
            [
                1397,
                1440
            ],
            [
                1446,
                1462
            ],
            [
                1468,
                1470
            ],
            [
                1476,
                1498
            ],
            [
                1500,
                1551
            ],
            [
                1551,
                1605
            ],
            [
                1613,
                1638
            ],
            [
                1639,
                1645
            ],
            [
                1653,
                1658
            ],
            [
                1662,
                1674
            ],
            [
                1675,
                1698
            ],
            [
                1699,
                1738
            ],
            [
                1739,
                1741
            ],
            [
                1742,
                1745
            ],
            [
                1746,
                1750
            ],
            [
                1750,
                1802
            ],
            [
                1803,
                1823
            ],
            [
                1823,
                1873
            ],
            [
                1874,
                1878
            ],
            [
                1886,
                1891
            ],
            [
                1895,
                1901
            ],
            [
                1905,
                1915
            ],
            [
                1915,
                1917
            ],
            [
                1917,
                1963
            ],
            [
                1964,
                2077
            ],
            [
                2077,
                2079
            ],
            [
                2079,
                2098
            ],
            [
                2099,
                2134
            ],
            [
                2134,
                2135
            ],
            [
                2136,
                2180
            ],
            [
                2181,
                2187
            ],
            [
                2188,
                2199
            ],
            [
                2199,
                2200
            ],
            [
                2201,
                2219
            ],
            [
                2224,
                2225
            ],
            [
                2231,
                2243
            ],
            [
                2243,
                2310
            ],
            [
                2322,
                2327
            ],
            [
                2328,
                2338
            ],
            [
                2344,
                2346
            ],
            [
                2362,
                2371
            ],
            [
                2371,
                2372
            ],
            [
                2373,
                2403
            ],
            [
                2404,
                2423
            ],
            [
                2424,
                2439
            ],
            [
                2453,
                2465
            ],
            [
                2466,
                2471
            ],
            [
                2472,
                2560
            ],
            [
                2560,
                2631
            ],
            [
                2631,
                2652
            ],
            [
                2653,
                2656
            ],
            [
                2657,
                2665
            ],
            [
                2666,
                2668
            ],
            [
                2669,
                2687
            ],
            [
                2688,
                2691
            ],
            [
                2692,
                2722
            ],
            [
                2722,
                2732
            ],
            [
                2733,
                2751
            ],
            [
                2755,
                2776
            ],
            [
                2777,
                2782
            ],
            [
                2782,
                2804
            ],
            [
                2805,
                2821
            ],
            [
                2822,
                2850
            ],
            [
                2850,
                2862
            ],
            [
                2863,
                2866
            ],
            [
                2880,
                2882
            ],
            [
                2888,
                2902
            ],
            [
                2902,
                2903
            ],
            [
                2904,
                2967
            ],
            [
                2967,
                2969
            ],
            [
                2969,
                3065
            ],
            [
                3075,
                3123
            ],
            [
                3123,
                3125
            ],
            [
                3125,
                3169
            ],
            [
                3173,
                3174
            ],
            [
                3186,
                3187
            ],
            [
                3188,
                3270
            ],
            [
                3281,
                3307
            ],
            [
                3307,
                3324
            ],
            [
                3325,
                3339
            ],
            [
                3343,
                3347
            ],
            [
                3348,
                3355
            ],
            [
                3356,
                3414
            ],
            [
                3414,
                3416
            ],
            [
                3416,
                3430
            ],
            [
                3437,
                3448
            ],
            [
                3449,
                3503
            ],
            [
                3504,
                3530
            ],
            [
                3531,
                3540
            ],
            [
                3541,
                3542
            ],
            [
                3543,
                3546
            ],
            [
                3546,
                3590
            ],
            [
                3591,
                3650
            ],
            [
                3650,
                3652
            ],
            [
                3652,
                3697
            ],
            [
                3698,
                3701
            ],
            [
                3702,
                3731
            ],
            [
                3732,
                3770
            ],
            [
                3770,
                3805
            ],
            [
                3814,
                3848
            ],
            [
                3848,
                3849
            ],
            [
                3854,
                3891
            ],
            [
                3892,
                3982
            ],
            [
                3982,
                3984
            ],
            [
                3984,
                4087
            ],
            [
                4087,
                4105
            ],
            [
                4105,
                4127
            ],
            [
                4130,
                4164
            ],
            [
                4168,
                4206
            ],
            [
                4207,
                4212
            ],
            [
                4213,
                4216
            ],
            [
                4217,
                4264
            ],
            [
                4264,
                4345
            ],
            [
                4345,
                4370
            ],
            [
                4370,
                4372
            ],
            [
                4372,
                4385
            ],
            [
                4400,
                4422
            ],
            [
                4423,
                4475
            ],
            [
                4476,
                4479
            ],
            [
                4480,
                4486
            ],
            [
                4493,
                4494
            ],
            [
                4495,
                4498
            ],
            [
                4499,
                4520
            ],
            [
                4529,
                4534
            ],
            [
                4535,
                4542
            ],
            [
                4543,
                4598
            ],
            [
                4598,
                4615
            ],
            [
                4622,
                4631
            ],
            [
                4635,
                4697
            ],
            [
                4703,
                4708
            ],
            [
                4719,
                4720
            ],
            [
                4726,
                4728
            ],
            [
                4750,
                4786
            ],
            [
                4790,
                4806
            ],
            [
                4807,
                4838
            ],
            [
                4838,
                4853
            ],
            [
                4862,
                4903
            ],
            [
                4909,
                4915
            ],
            [
                4924,
                4926
            ],
            [
                4926,
                4938
            ],
            [
                4945,
                4959
            ],
            [
                4960,
                5000
            ],
            [
                5000,
                5066
            ],
            [
                5066,
                5105
            ],
            [
                5105,
                5118
            ],
            [
                5119,
                5137
            ],
            [
                5138,
                5165
            ],
            [
                5168,
                5201
            ],
            [
                5202,
                5209
            ],
            [
                5212,
                5237
            ],
            [
                5244,
                5260
            ],
            [
                5260,
                5268
            ],
            [
                5269,
                5323
            ],
            [
                5324,
                5327
            ],
            [
                5328,
                5336
            ],
            [
                5341,
                5350
            ],
            [
                5351,
                5359
            ],
            [
                5360,
                5364
            ],
            [
                5365,
                5388
            ],
            [
                5388,
                5389
            ],
            [
                5390,
                5393
            ],
            [
                5399,
                5412
            ],
            [
                5413,
                5428
            ],
            [
                5428,
                5429
            ],
            [
                5438,
                5450
            ],
            [
                5451,
                5460
            ],
            [
                5461,
                5465
            ],
            [
                5471,
                5499
            ],
            [
                5500,
                5503
            ],
            [
                5504,
                5507
            ],
            [
                5508,
                5514
            ],
            [
                5514,
                5516
            ],
            [
                5516,
                5552
            ],
            [
                5552,
                5605
            ],
            [
                5605,
                5628
            ],
            [
                5629,
                5648
            ],
            [
                5659,
                5670
            ],
            [
                5671,
                5677
            ],
            [
                5678,
                5704
            ],
            [
                5727,
                5737
            ],
            [
                5737,
                5739
            ],
            [
                5739,
                5751
            ],
            [
                5751,
                5814
            ],
            [
                5832,
                5865
            ],
            [
                5866,
                5880
            ],
            [
                5881,
                5898
            ],
            [
                5907,
                5914
            ],
            [
                5934,
                5936
            ],
            [
                5937,
                5952
            ],
            [
                5952,
                6015
            ],
            [
                6024,
                6033
            ],
            [
                6033,
                6060
            ],
            [
                6061,
                6078
            ],
            [
                6078,
                6125
            ],
            [
                6126,
                6137
            ],
            [
                6137,
                6202
            ],
            [
                6202,
                6207
            ],
            [
                6208,
                6216
            ],
            [
                6216,
                6266
            ],
            [
                6266,
                6355
            ],
            [
                6356,
                6371
            ],
            [
                6372,
                6380
            ],
            [
                6383,
                6386
            ],
            [
                6387,
                6396
            ],
            [
                6397,
                6410
            ],
            [
                6420,
                6422
            ],
            [
                6422,
                6526
            ],
            [
                6527,
                6532
            ],
            [
                6532,
                6534
            ],
            [
                6534,
                6555
            ],
            [
                6555,
                6556
            ],
            [
                6557,
                6637
            ],
            [
                6651,
                6675
            ],
            [
                6675,
                6677
            ],
            [
                6677,
                6688
            ],
            [
                6689,
                6692
            ],
            [
                6702,
                6771
            ],
            [
                6772,
                6804
            ],
            [
                6804,
                6835
            ],
            [
                6835,
                6991
            ],
            [
                6992,
                6999
            ],
            [
                6999,
                7004
            ],
            [
                7005,
                7048
            ],
            [
                7048,
                7050
            ],
            [
                7075,
                7130
            ],
            [
                7130,
                7154
            ],
            [
                7154,
                7192
            ],
            [
                7192,
                7222
            ],
            [
                7226,
                7227
            ],
            [
                7231,
                7232
            ],
            [
                7237,
                7298
            ],
            [
                7299,
                7302
            ],
            [
                7303,
                7311
            ],
            [
                7312,
                7316
            ],
            [
                7339,
                7341
            ],
            [
                7341,
                7351
            ],
            [
                7352,
                7381
            ],
            [
                7382,
                7392
            ],
            [
                7393,
                7402
            ],
            [
                7403,
                7416
            ],
            [
                7417,
                7426
            ],
            [
                7427,
                7517
            ],
            [
                7518,
                7521
            ],
            [
                7522,
                7539
            ],
            [
                7541,
                7569
            ],
            [
                7570,
                7619
            ],
            [
                7619,
                7620
            ],
            [
                7621,
                7624
            ],
            [
                7625,
                7652
            ],
            [
                7653,
                7661
            ],
            [
                7662,
                7665
            ],
            [
                7687,
                7705
            ],
            [
                7714,
                7716
            ],
            [
                7716,
                7756
            ],
            [
                7757,
                7762
            ],
            [
                7770,
                7779
            ],
            [
                7786,
                7789
            ],
            [
                7790,
                7802
            ],
            [
                7803,
                7805
            ],
            [
                7806,
                7836
            ],
            [
                7836,
                7840
            ],
            [
                7841,
                7885
            ],
            [
                7885,
                7988
            ],
            [
                7988,
                8018
            ],
            [
                8019,
                8033
            ],
            [
                8034,
                8057
            ],
            [
                8057,
                8128
            ],
            [
                8137,
                8164
            ],
            [
                8164,
                8166
            ],
            [
                8166,
                8180
            ],
            [
                8180,
                8219
            ],
            [
                8219,
                8233
            ],
            [
                8234,
                8258
            ],
            [
                8263,
                8285
            ],
            [
                8287,
                8289
            ],
            [
                8289,
                8290
            ],
            [
                8290,
                8351
            ],
            [
                8351,
                8369
            ],
            [
                8374,
                8427
            ],
            [
                8427,
                8432
            ],
            [
                8432,
                8487
            ],
            [
                8487,
                8492
            ],
            [
                8494,
                8496
            ],
            [
                8496,
                8499
            ],
            [
                8500,
                8593
            ],
            [
                8594,
                8598
            ],
            [
                8599,
                8604
            ],
            [
                8605,
                8659
            ],
            [
                8660,
                8673
            ],
            [
                8677,
                8683
            ],
            [
                8683,
                8698
            ],
            [
                8698,
                8704
            ],
            [
                8705,
                8713
            ],
            [
                8722,
                8771
            ],
            [
                8771,
                8816
            ],
            [
                8817,
                8835
            ],
            [
                8836,
                8846
            ],
            [
                8846,
                8847
            ],
            [
                8848,
                8849
            ],
            [
                8849,
                8952
            ],
            [
                8953,
                8957
            ],
            [
                8957,
                8960
            ],
            [
                8960,
                8997
            ],
            [
                9000,
                9011
            ],
            [
                9011,
                9030
            ],
            [
                9035,
                9074
            ],
            [
                9074,
                9089
            ],
            [
                9090,
                9118
            ],
            [
                9125,
                9185
            ],
            [
                9185,
                9201
            ],
            [
                9205,
                9240
            ],
            [
                9240,
                9241
            ],
            [
                9241,
                9294
            ],
            [
                9295,
                9308
            ],
            [
                9308,
                9310
            ],
            [
                9310,
                9331
            ],
            [
                9338,
                9342
            ],
            [
                9343,
                9365
            ],
            [
                9366,
                9372
            ],
            [
                9373,
                9384
            ],
            [
                9384,
                9405
            ],
            [
                9406,
                9447
            ],
            [
                9447,
                9474
            ],
            [
                9474,
                9476
            ],
            [
                9476,
                9510
            ],
            [
                9511,
                9549
            ],
            [
                9549,
                9576
            ],
            [
                9577,
                9591
            ],
            [
                9592,
                9595
            ],
            [
                9595,
                9598
            ],
            [
                9598,
                9629
            ],
            [
                9630,
                9641
            ],
            [
                9641,
                9658
            ],
            [
                9658,
                9659
            ],
            [
                9660,
                9743
            ],
            [
                9743,
                9775
            ],
            [
                9775,
                9792
            ],
            [
                9793,
                9807
            ],
            [
                9808,
                9818
            ],
            [
                9819,
                9845
            ],
            [
                9845,
                9969
            ],
            [
                9969,
                10128
            ],
            [
                10133,
                10139
            ],
            [
                10139,
                10156
            ],
            [
                10156,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10197,
                10201
            ],
            [
                10202,
                10233
            ],
            [
                10233,
                10249
            ],
            [
                10254,
                10304
            ],
            [
                10305,
                10310
            ],
            [
                10311,
                10338
            ],
            [
                10338,
                10345
            ],
            [
                10346,
                10447
            ],
            [
                10450,
                10534
            ],
            [
                10534,
                10576
            ],
            [
                10576,
                10613
            ],
            [
                10613,
                10615
            ],
            [
                10615,
                10647
            ],
            [
                10653,
                10709
            ],
            [
                10710,
                10716
            ],
            [
                10728,
                10730
            ],
            [
                10730,
                10740
            ],
            [
                10741,
                10748
            ],
            [
                10761,
                10787
            ],
            [
                10787,
                10817
            ],
            [
                10817,
                10819
            ],
            [
                10820,
                10823
            ],
            [
                10829,
                10835
            ],
            [
                10836,
                10868
            ],
            [
                10869,
                10871
            ],
            [
                10881,
                10903
            ],
            [
                10908,
                10914
            ],
            [
                10919,
                10957
            ],
            [
                10965,
                10969
            ],
            [
                10983,
                11016
            ],
            [
                11016,
                11034
            ],
            [
                11045,
                11085
            ],
            [
                11098,
                11185
            ],
            [
                11186,
                11202
            ],
            [
                11210,
                11211
            ],
            [
                11212,
                11217
            ],
            [
                11218,
                11249
            ],
            [
                11249,
                11250
            ],
            [
                11254,
                11257
            ],
            [
                11262,
                11265
            ],
            [
                11266,
                11273
            ],
            [
                11274,
                11277
            ],
            [
                11288,
                11289
            ],
            [
                11290,
                11298
            ],
            [
                11299,
                11338
            ],
            [
                11349,
                11358
            ],
            [
                11358,
                11408
            ],
            [
                11411,
                11448
            ],
            [
                11449,
                11452
            ],
            [
                11453,
                11465
            ],
            [
                11470,
                11482
            ],
            [
                11483,
                11485
            ],
            [
                11486,
                11495
            ],
            [
                11496,
                11499
            ],
            [
                11500,
                11507
            ],
            [
                11507,
                11522
            ],
            [
                11523,
                11652
            ],
            [
                11652,
                11654
            ],
            [
                11654,
                11711
            ],
            [
                11711,
                11714
            ],
            [
                11715,
                11732
            ],
            [
                11733,
                11808
            ],
            [
                11808,
                11821
            ],
            [
                11826,
                11840
            ],
            [
                11842,
                11854
            ],
            [
                11858,
                11868
            ],
            [
                11868,
                11946
            ],
            [
                11947,
                11961
            ],
            [
                11966,
                11976
            ],
            [
                11986,
                12028
            ],
            [
                12028,
                12042
            ],
            [
                12052,
                12118
            ],
            [
                12119,
                12153
            ],
            [
                12153,
                12208
            ],
            [
                12214,
                12228
            ],
            [
                12235,
                12273
            ],
            [
                12273,
                12379
            ],
            [
                12379,
                12385
            ],
            [
                12386,
                12448
            ],
            [
                12449,
                12471
            ],
            [
                12472,
                12482
            ],
            [
                12483,
                12538
            ],
            [
                12538,
                12606
            ],
            [
                12606,
                12615
            ],
            [
                12616,
                12619
            ],
            [
                12633,
                12648
            ],
            [
                12650,
                12653
            ],
            [
                12654,
                12676
            ],
            [
                12676,
                12678
            ],
            [
                12678,
                12710
            ],
            [
                12716,
                12718
            ],
            [
                12718,
                12773
            ],
            [
                12773,
                12818
            ],
            [
                12818,
                12859
            ],
            [
                12865,
                12902
            ],
            [
                12902,
                12904
            ],
            [
                12904,
                12930
            ],
            [
                12935,
                12938
            ],
            [
                12944,
                13030
            ],
            [
                13030,
                13072
            ],
            [
                13073,
                13079
            ],
            [
                13080,
                13103
            ],
            [
                13103,
                13111
            ],
            [
                13112,
                13143
            ],
            [
                13143,
                13189
            ],
            [
                13190,
                13193
            ],
            [
                13202,
                13206
            ],
            [
                13207,
                13210
            ],
            [
                13211,
                13214
            ],
            [
                13220,
                13222
            ],
            [
                13223,
                13248
            ],
            [
                13249,
                13283
            ],
            [
                13283,
                13292
            ],
            [
                13293,
                13328
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                301
            ],
            [
                301,
                445
            ],
            [
                445,
                445
            ],
            [
                445,
                445
            ],
            [
                445,
                445
            ],
            [
                445,
                445
            ],
            [
                445,
                717
            ],
            [
                717,
                857
            ],
            [
                857,
                957
            ],
            [
                957,
                1239
            ],
            [
                1239,
                1239
            ],
            [
                1239,
                1397
            ],
            [
                1397,
                1440
            ],
            [
                1440,
                1551
            ],
            [
                1551,
                1658
            ],
            [
                1658,
                1823
            ],
            [
                1823,
                1917
            ],
            [
                1917,
                2079
            ],
            [
                2079,
                2243
            ],
            [
                2243,
                2373
            ],
            [
                2373,
                2465
            ],
            [
                2465,
                2465
            ],
            [
                2465,
                2560
            ],
            [
                2560,
                2722
            ],
            [
                2722,
                2850
            ],
            [
                2850,
                2969
            ],
            [
                2969,
                3125
            ],
            [
                3125,
                3307
            ],
            [
                3307,
                3416
            ],
            [
                3416,
                3504
            ],
            [
                3504,
                3652
            ],
            [
                3652,
                3652
            ],
            [
                3652,
                3850
            ],
            [
                3850,
                3850
            ],
            [
                3850,
                3984
            ],
            [
                3984,
                3984
            ],
            [
                3984,
                3984
            ],
            [
                3984,
                3984
            ],
            [
                3984,
                3984
            ],
            [
                3984,
                4087
            ],
            [
                4087,
                4264
            ],
            [
                4264,
                4372
            ],
            [
                4372,
                4598
            ],
            [
                4598,
                4786
            ],
            [
                4786,
                4838
            ],
            [
                4838,
                4926
            ],
            [
                4926,
                5105
            ],
            [
                5105,
                5260
            ],
            [
                5260,
                5390
            ],
            [
                5390,
                5516
            ],
            [
                5516,
                5605
            ],
            [
                5605,
                5739
            ],
            [
                5739,
                5814
            ],
            [
                5814,
                5952
            ],
            [
                5952,
                5952
            ],
            [
                5952,
                6033
            ],
            [
                6033,
                6033
            ],
            [
                6033,
                6137
            ],
            [
                6137,
                6202
            ],
            [
                6202,
                6202
            ],
            [
                6202,
                6202
            ],
            [
                6202,
                6202
            ],
            [
                6202,
                6202
            ],
            [
                6202,
                6266
            ],
            [
                6266,
                6422
            ],
            [
                6422,
                6534
            ],
            [
                6534,
                6677
            ],
            [
                6677,
                7050
            ],
            [
                7050,
                7050
            ],
            [
                7050,
                7130
            ],
            [
                7130,
                7154
            ],
            [
                7154,
                7192
            ],
            [
                7192,
                7192
            ],
            [
                7192,
                7341
            ],
            [
                7341,
                7518
            ],
            [
                7518,
                7716
            ],
            [
                7716,
                7836
            ],
            [
                7836,
                7988
            ],
            [
                7988,
                8057
            ],
            [
                8057,
                8166
            ],
            [
                8166,
                8219
            ],
            [
                8219,
                8289
            ],
            [
                8289,
                8351
            ],
            [
                8351,
                8427
            ],
            [
                8427,
                8432
            ],
            [
                8432,
                8496
            ],
            [
                8496,
                8683
            ],
            [
                8683,
                8683
            ],
            [
                8683,
                8698
            ],
            [
                8698,
                8771
            ],
            [
                8771,
                8960
            ],
            [
                8960,
                9000
            ],
            [
                9000,
                9074
            ],
            [
                9074,
                9185
            ],
            [
                9185,
                9240
            ],
            [
                9240,
                9310
            ],
            [
                9310,
                9384
            ],
            [
                9384,
                9476
            ],
            [
                9476,
                9549
            ],
            [
                9549,
                9598
            ],
            [
                9598,
                9743
            ],
            [
                9743,
                9775
            ],
            [
                9775,
                9845
            ],
            [
                9845,
                9969
            ],
            [
                9969,
                10139
            ],
            [
                10139,
                10156
            ],
            [
                10156,
                10180
            ],
            [
                10180,
                10197
            ],
            [
                10197,
                10233
            ],
            [
                10233,
                10338
            ],
            [
                10338,
                10450
            ],
            [
                10450,
                10450
            ],
            [
                10450,
                10534
            ],
            [
                10534,
                10576
            ],
            [
                10576,
                10615
            ],
            [
                10615,
                10615
            ],
            [
                10615,
                10615
            ],
            [
                10615,
                10649
            ],
            [
                10649,
                10649
            ],
            [
                10649,
                10730
            ],
            [
                10730,
                10787
            ],
            [
                10787,
                10820
            ],
            [
                10820,
                10903
            ],
            [
                10903,
                11016
            ],
            [
                11016,
                11212
            ],
            [
                11212,
                11290
            ],
            [
                11290,
                11358
            ],
            [
                11358,
                11654
            ],
            [
                11654,
                11711
            ],
            [
                11711,
                11808
            ],
            [
                11808,
                11868
            ],
            [
                11868,
                11947
            ],
            [
                11947,
                12028
            ],
            [
                12028,
                12153
            ],
            [
                12153,
                12379
            ],
            [
                12379,
                12449
            ],
            [
                12449,
                12538
            ],
            [
                12538,
                12606
            ],
            [
                12606,
                12678
            ],
            [
                12678,
                12678
            ],
            [
                12678,
                12718
            ],
            [
                12718,
                12773
            ],
            [
                12773,
                12818
            ],
            [
                12818,
                12904
            ],
            [
                12904,
                13030
            ],
            [
                13030,
                13103
            ],
            [
                13103,
                13143
            ],
            [
                13143,
                13328
            ]
        ]
    }
}