{
    "original": {
        "text": "Without knowing how, Captain William Dobbin found himself the great promoter, arranger, and manager of the match between George Osborne and Amelia. But for him it never would have taken place: he could not but confess as much to himself, and smiled rather bitterly as he thought that he of all men in the world should be the person upon whom the care of this marriage had fallen. But though indeed the conducting of this negotiation was about as painful a task as could be set to him, yet when he had a duty to perform, Captain Dobbin was accustomed to go through it without many words or much hesitation: and, having made up his mind completely, that if Miss Sedley was balked of her husband she would die of the disappointment, he was determined to use all his best endeavours to keep her alive.\nI forbear to enter into minute particulars of the interview between George and Amelia, when the former was brought back to the feet (or should we venture to say the arms?) of his young mistress by the intervention of his friend honest William. A much harder heart than George's would have melted at the sight of that sweet face so sadly ravaged by grief and despair, and at the simple tender accents in which she told her little broken-hearted story: but as she did not faint when her mother, trembling, brought Osborne to her; and as she only gave relief to her overcharged grief, by laying her head on her lover's shoulder and there weeping for a while the most tender, copious, and refreshing tears--old Mrs. Sedley, too greatly relieved, thought it was best to leave the young persons to themselves; and so quitted Emmy crying over George's hand, and kissing it humbly, as if he were her supreme chief and master, and as if she were quite a guilty and unworthy person needing every favour and grace from him.\nThis prostration and sweet unrepining obedience exquisitely touched and flattered George Osborne. He saw a slave before him in that simple yielding faithful creature, and his soul within him thrilled secretly somehow at the knowledge of his power. He would be generous-minded, Sultan as he was, and raise up this kneeling Esther and make a queen of her: besides, her sadness and beauty touched him as much as her submission, and so he cheered her, and raised her up and forgave her, so to speak. All her hopes and feelings, which were dying and withering, this her sun having been removed from her, bloomed again and at once, its light being restored. You would scarcely have recognised the beaming little face upon Amelia's pillow that night as the one that was laid there the night before, so wan, so lifeless, so careless of all round about. The honest Irish maid-servant, delighted with the change, asked leave to kiss the face that had grown all of a sudden so rosy. Amelia put her arms round the girl's neck and kissed her with all her heart, like a child. She was little more. She had that night a sweet refreshing sleep, like one--and what a spring of inexpressible happiness as she woke in the morning sunshine!\n\"He will be here again to-day,\" Amelia thought. \"He is the greatest and best of men.\" And the fact is, that George thought he was one of the generousest creatures alive: and that he was making a tremendous sacrifice in marrying this young creature.\nWhile she and Osborne were having their delightful tete-a-tete above stairs, old Mrs. Sedley and Captain Dobbin were conversing below upon the state of the affairs, and the chances and future arrangements of the young people. Mrs. Sedley having brought the two lovers together and left them embracing each other with all their might, like a true woman, was of opinion that no power on earth would induce Mr. Sedley to consent to the match between his daughter and the son of a man who had so shamefully, wickedly, and monstrously treated him. And she told a long story about happier days and their earlier splendours, when Osborne lived in a very humble way in the New Road, and his wife was too glad to receive some of Jos's little baby things, with which Mrs. Sedley accommodated her at the birth of one of Osborne's own children. The fiendish ingratitude of that man, she was sure, had broken Mr. S.'s heart: and as for a marriage, he would never, never, never, never consent.\n\"They must run away together, Ma'am,\" Dobbin said, laughing, \"and follow the example of Captain Rawdon Crawley, and Miss Emmy's friend the little governess.\" Was it possible? Well she never! Mrs. Sedley was all excitement about this news. She wished that Blenkinsop were here to hear it: Blenkinsop always mistrusted that Miss Sharp.-- What an escape Jos had had! and she described the already well-known love-passages between Rebecca and the Collector of Boggley Wollah.\nIt was not, however, Mr. Sedley's wrath which Dobbin feared, so much as that of the other parent concerned, and he owned that he had a very considerable doubt and anxiety respecting the behaviour of the black-browed old tyrant of a Russia merchant in Russell Square. He has forbidden the match peremptorily, Dobbin thought. He knew what a savage determined man Osborne was, and how he stuck by his word. \"The only chance George has of reconcilement,\" argued his friend, \"is by distinguishing himself in the coming campaign. If he dies they both go together. If he fails in distinction--what then? He has some money from his mother, I have heard enough to purchase his majority--or he must sell out and go and dig in Canada, or rough it in a cottage in the country.\" With such a partner Dobbin thought he would not mind Siberia--and, strange to say, this absurd and utterly imprudent young fellow never for a moment considered that the want of means to keep a nice carriage and horses, and of an income which should enable its possessors to entertain their friends genteelly, ought to operate as bars to the union of George and Miss Sedley.\nIt was these weighty considerations which made him think too that the marriage should take place as quickly as possible. Was he anxious himself, I wonder, to have it over?--as people, when death has occurred, like to press forward the funeral, or when a parting is resolved upon, hasten it. It is certain that Mr. Dobbin, having taken the matter in hand, was most extraordinarily eager in the conduct of it. He urged on George the necessity of immediate action: he showed the chances of reconciliation with his father, which a favourable mention of his name in the Gazette must bring about. If need were he would go himself and brave both the fathers in the business. At all events, he besought George to go through with it before the orders came, which everybody expected, for the departure of the regiment from England on foreign service.\nBent upon these hymeneal projects, and with the applause and consent of Mrs. Sedley, who did not care to break the matter personally to her husband, Mr. Dobbin went to seek John Sedley at his house of call in the City, the Tapioca Coffee-house, where, since his own offices were shut up, and fate had overtaken him, the poor broken-down old gentleman used to betake himself daily, and write letters and receive them, and tie them up into mysterious bundles, several of which he carried in the flaps of his coat. I don't know anything more dismal than that business and bustle and mystery of a ruined man: those letters from the wealthy which he shows you: those worn greasy documents promising support and offering condolence which he places wistfully before you, and on which he builds his hopes of restoration and future fortune. My beloved reader has no doubt in the course of his experience been waylaid by many such a luckless companion. He takes you into the corner; he has his bundle of papers out of his gaping coat pocket; and the tape off, and the string in his mouth, and the favourite letters selected and laid before you; and who does not know the sad eager half-crazy look which he fixes on you with his hopeless eyes?\nChanged into a man of this sort, Dobbin found the once florid, jovial, and prosperous John Sedley. His coat, that used to be so glossy and trim, was white at the seams, and the buttons showed the copper. His face had fallen in, and was unshorn; his frill and neckcloth hung limp under his bagging waistcoat. When he used to treat the boys in old days at a coffee-house, he would shout and laugh louder than anybody there, and have all the waiters skipping round him; it was quite painful to see how humble and civil he was to John of the Tapioca, a blear-eyed old attendant in dingy stockings and cracked pumps, whose business it was to serve glasses of wafers, and bumpers of ink in pewter, and slices of paper to the frequenters of this dreary house of entertainment, where nothing else seemed to be consumed. As for William Dobbin, whom he had tipped repeatedly in his youth, and who had been the old gentleman's butt on a thousand occasions, old Sedley gave his hand to him in a very hesitating humble manner now, and called him \"Sir.\" A feeling of shame and remorse took possession of William Dobbin as the broken old man so received and addressed him, as if he himself had been somehow guilty of the misfortunes which had brought Sedley so low.\n\"I am very glad to see you, Captain Dobbin, sir,\" says he, after a skulking look or two at his visitor (whose lanky figure and military appearance caused some excitement likewise to twinkle in the blear eyes of the waiter in the cracked dancing pumps, and awakened the old lady in black, who dozed among the mouldy old coffee-cups in the bar). \"How is the worthy alderman, and my lady, your excellent mother, sir?\" He looked round at the waiter as he said, \"My lady,\" as much as to say, \"Hark ye, John, I have friends still, and persons of rank and reputation, too.\" \"Are you come to do anything in my way, sir? My young friends Dale and Spiggot do all my business for me now, until my new offices are ready; for I'm only here temporarily, you know, Captain. What can we do for you, sir? Will you like to take anything?\"\nDobbin, with a great deal of hesitation and stuttering, protested that he was not in the least hungry or thirsty; that he had no business to transact; that he only came to ask if Mr. Sedley was well, and to shake hands with an old friend; and, he added, with a desperate perversion of truth, \"My mother is very well--that is, she's been very unwell, and is only waiting for the first fine day to go out and call upon Mrs. Sedley. How is Mrs. Sedley, sir? I hope she's quite well.\" And here he paused, reflecting on his own consummate hypocrisy; for the day was as fine, and the sunshine as bright as it ever is in Coffin Court, where the Tapioca Coffee-house is situated: and Mr. Dobbin remembered that he had seen Mrs. Sedley himself only an hour before, having driven Osborne down to Fulham in his gig, and left him there tete-a-tete with Miss Amelia.\n\"My wife will be very happy to see her ladyship,\" Sedley replied, pulling out his papers. \"I've a very kind letter here from your father, sir, and beg my respectful compliments to him. Lady D. will find us in rather a smaller house than we were accustomed to receive our friends in; but it's snug, and the change of air does good to my daughter, who was suffering in town rather--you remember little Emmy, sir?--yes, suffering a good deal.\" The old gentleman's eyes were wandering as he spoke, and he was thinking of something else, as he sate thrumming on his papers and fumbling at the worn red tape.\n\"You're a military man,\" he went on; \"I ask you, Bill Dobbin, could any man ever have speculated upon the return of that Corsican scoundrel from Elba? When the allied sovereigns were here last year, and we gave 'em that dinner in the City, sir, and we saw the Temple of Concord, and the fireworks, and the Chinese bridge in St. James's Park, could any sensible man suppose that peace wasn't really concluded, after we'd actually sung Te Deum for it, sir? I ask you, William, could I suppose that the Emperor of Austria was a damned traitor--a traitor, and nothing more? I don't mince words--a double-faced infernal traitor and schemer, who meant to have his son-in-law back all along. And I say that the escape of Boney from Elba was a damned imposition and plot, sir, in which half the powers of Europe were concerned, to bring the funds down, and to ruin this country. That's why I'm here, William. That's why my name's in the Gazette. Why, sir?--because I trusted the Emperor of Russia and the Prince Regent. Look here. Look at my papers. Look what the funds were on the 1st of March--what the French fives were when I bought for the count. And what they're at now. There was collusion, sir, or that villain never would have escaped. Where was the English Commissioner who allowed him to get away? He ought to be shot, sir--brought to a court-martial, and shot, by Jove.\"\n\"We're going to hunt Boney out, sir,\" Dobbin said, rather alarmed at the fury of the old man, the veins of whose forehead began to swell, and who sate drumming his papers with his clenched fist. \"We are going to hunt him out, sir--the Duke's in Belgium already, and we expect marching orders every day.\"\n\"Give him no quarter. Bring back the villain's head, sir. Shoot the coward down, sir,\" Sedley roared. \"I'd enlist myself, by--; but I'm a broken old man--ruined by that damned scoundrel--and by a parcel of swindling thieves in this country whom I made, sir, and who are rolling in their carriages now,\" he added, with a break in his voice.\nDobbin was not a little affected by the sight of this once kind old friend, crazed almost with misfortune and raving with senile anger. Pity the fallen gentleman: you to whom money and fair repute are the chiefest good; and so, surely, are they in Vanity Fair.\n\"Yes,\" he continued, \"there are some vipers that you warm, and they sting you afterwards. There are some beggars that you put on horseback, and they're the first to ride you down. You know whom I mean, William Dobbin, my boy. I mean a purse-proud villain in Russell Square, whom I knew without a shilling, and whom I pray and hope to see a beggar as he was when I befriended him.\"\n\"I have heard something of this, sir, from my friend George,\" Dobbin said, anxious to come to his point. \"The quarrel between you and his father has cut him up a great deal, sir. Indeed, I'm the bearer of a message from him.\"\n\"O, THAT'S your errand, is it?\" cried the old man, jumping up. \"What! perhaps he condoles with me, does he? Very kind of him, the stiff-backed prig, with his dandified airs and West End swagger. He's hankering about my house, is he still? If my son had the courage of a man, he'd shoot him. He's as big a villain as his father. I won't have his name mentioned in my house. I curse the day that ever I let him into it; and I'd rather see my daughter dead at my feet than married to him.\"\n\"His father's harshness is not George's fault, sir. Your daughter's love for him is as much your doing as his. Who are you, that you are to play with two young people's affections and break their hearts at your will?\"\n\"Recollect it's not his father that breaks the match off,\" old Sedley cried out. \"It's I that forbid it. That family and mine are separated for ever. I'm fallen low, but not so low as that: no, no. And so you may tell the whole race--son, and father and sisters, and all.\"\n\"It's my belief, sir, that you have not the power or the right to separate those two,\" Dobbin answered in a low voice; \"and that if you don't give your daughter your consent it will be her duty to marry without it. There's no reason she should die or live miserably because you are wrong-headed. To my thinking, she's just as much married as if the banns had been read in all the churches in London. And what better answer can there be to Osborne's charges against you, as charges there are, than that his son claims to enter your family and marry your daughter?\"\nA light of something like satisfaction seemed to break over old Sedley as this point was put to him: but he still persisted that with his consent the marriage between Amelia and George should never take place.\n\"We must do it without,\" Dobbin said, smiling, and told Mr. Sedley, as he had told Mrs. Sedley in the day, before, the story of Rebecca's elopement with Captain Crawley. It evidently amused the old gentleman. \"You're terrible fellows, you Captains,\" said he, tying up his papers; and his face wore something like a smile upon it, to the astonishment of the blear-eyed waiter who now entered, and had never seen such an expression upon Sedley's countenance since he had used the dismal coffee-house.\nThe idea of hitting his enemy Osborne such a blow soothed, perhaps, the old gentleman: and, their colloquy presently ending, he and Dobbin parted pretty good friends.\n\"My sisters say she has diamonds as big as pigeons' eggs,\" George said, laughing. \"How they must set off her complexion! A perfect illumination it must be when her jewels are on her neck. Her jet-black hair is as curly as Sambo's. I dare say she wore a nose ring when she went to court; and with a plume of feathers in her top-knot she would look a perfect Belle Sauvage.\"\nGeorge, in conversation with Amelia, was rallying the appearance of a young lady of whom his father and sisters had lately made the acquaintance, and who was an object of vast respect to the Russell Square family. She was reported to have I don't know how many plantations in the West Indies; a deal of money in the funds; and three stars to her name in the East India stockholders' list. She had a mansion in Surrey, and a house in Portland Place. The name of the rich West India heiress had been mentioned with applause in the Morning Post. Mrs. Haggistoun, Colonel Haggistoun's widow, her relative, \"chaperoned\" her, and kept her house. She was just from school, where she had completed her education, and George and his sisters had met her at an evening party at old Hulker's house, Devonshire Place (Hulker, Bullock, and Co. were long the correspondents of her house in the West Indies), and the girls had made the most cordial advances to her, which the heiress had received with great good humour. An orphan in her position--with her money--so interesting! the Misses Osborne said. They were full of their new friend when they returned from the Hulker ball to Miss Wirt, their companion; they had made arrangements for continually meeting, and had the carriage and drove to see her the very next day. Mrs. Haggistoun, Colonel Haggistoun's widow, a relation of Lord Binkie, and always talking of him, struck the dear unsophisticated girls as rather haughty, and too much inclined to talk about her great relations: but Rhoda was everything they could wish--the frankest, kindest, most agreeable creature--wanting a little polish, but so good-natured. The girls Christian-named each other at once.\n\"You should have seen her dress for court, Emmy,\" Osborne cried, laughing. \"She came to my sisters to show it off, before she was presented in state by my Lady Binkie, the Haggistoun's kinswoman. She's related to every one, that Haggistoun. Her diamonds blazed out like Vauxhall on the night we were there. (Do you remember Vauxhall, Emmy, and Jos singing to his dearest diddle diddle darling?) Diamonds and mahogany, my dear! think what an advantageous contrast--and the white feathers in her hair--I mean in her wool. She had earrings like chandeliers; you might have lighted 'em up, by Jove--and a yellow satin train that streeled after her like the tail of a comet.\"\n\"How old is she?\" asked Emmy, to whom George was rattling away regarding this dark paragon, on the morning of their reunion--rattling away as no other man in the world surely could.\n\"Why the Black Princess, though she has only just left school, must be two or three and twenty. And you should see the hand she writes! Mrs. Colonel Haggistoun usually writes her letters, but in a moment of confidence, she put pen to paper for my sisters; she spelt satin satting, and Saint James's, Saint Jams.\"\n\"Why, surely it must be Miss Swartz, the parlour boarder,\" Emmy said, remembering that good-natured young mulatto girl, who had been so hysterically affected when Amelia left Miss Pinkerton's academy.\n\"The very name,\" George said. \"Her father was a German Jew--a slave-owner they say--connected with the Cannibal Islands in some way or other. He died last year, and Miss Pinkerton has finished her education. She can play two pieces on the piano; she knows three songs; she can write when Mrs. Haggistoun is by to spell for her; and Jane and Maria already have got to love her as a sister.\"\n\"I wish they would have loved me,\" said Emmy, wistfully. \"They were always very cold to me.\"\n\"My dear child, they would have loved you if you had had two hundred thousand pounds,\" George replied. \"That is the way in which they have been brought up. Ours is a ready-money society. We live among bankers and City big-wigs, and be hanged to them, and every man, as he talks to you, is jingling his guineas in his pocket. There is that jackass Fred Bullock is going to marry Maria--there's Goldmore, the East India Director, there's Dipley, in the tallow trade--OUR trade,\" George said, with an uneasy laugh and a blush. \"Curse the whole pack of money-grubbing vulgarians! I fall asleep at their great heavy dinners. I feel ashamed in my father's great stupid parties. I've been accustomed to live with gentlemen, and men of the world and fashion, Emmy, not with a parcel of turtle-fed tradesmen. Dear little woman, you are the only person of our set who ever looked, or thought, or spoke like a lady: and you do it because you're an angel and can't help it. Don't remonstrate. You are the only lady. Didn't Miss Crawley remark it, who has lived in the best company in Europe? And as for Crawley, of the Life Guards, hang it, he's a fine fellow: and I like him for marrying the girl he had chosen.\"\nAmelia admired Mr. Crawley very much, too, for this; and trusted Rebecca would be happy with him, and hoped (with a laugh) Jos would be consoled. And so the pair went on prattling, as in quite early days. Amelia's confidence being perfectly restored to her, though she expressed a great deal of pretty jealousy about Miss Swartz, and professed to be dreadfully frightened--like a hypocrite as she was--lest George should forget her for the heiress and her money and her estates in Saint Kitt's. But the fact is, she was a great deal too happy to have fears or doubts or misgivings of any sort: and having George at her side again, was not afraid of any heiress or beauty, or indeed of any sort of danger.\nWhen Captain Dobbin came back in the afternoon to these people--which he did with a great deal of sympathy for them--it did his heart good to see how Amelia had grown young again--how she laughed, and chirped, and sang familiar old songs at the piano, which were only interrupted by the bell from without proclaiming Mr. Sedley's return from the City, before whom George received a signal to retreat.\nBeyond the first smile of recognition--and even that was an hypocrisy, for she thought his arrival rather provoking--Miss Sedley did not once notice Dobbin during his visit. But he was content, so that he saw her happy; and thankful to have been the means of making her so.",
        "paragraph_chars": [
            [
                0,
                798
            ],
            [
                798,
                1811
            ],
            [
                1811,
                3032
            ],
            [
                3032,
                3281
            ],
            [
                3281,
                4261
            ],
            [
                4261,
                4733
            ],
            [
                4733,
                5873
            ],
            [
                5873,
                6714
            ],
            [
                6714,
                7947
            ],
            [
                7947,
                9198
            ],
            [
                9198,
                10019
            ],
            [
                10019,
                10873
            ],
            [
                10873,
                11476
            ],
            [
                11476,
                12851
            ],
            [
                12851,
                13155
            ],
            [
                13155,
                13495
            ],
            [
                13495,
                13756
            ],
            [
                13756,
                14137
            ],
            [
                14137,
                14363
            ],
            [
                14363,
                14850
            ],
            [
                14850,
                15068
            ],
            [
                15068,
                15341
            ],
            [
                15341,
                15905
            ],
            [
                15905,
                16115
            ],
            [
                16115,
                16614
            ],
            [
                16614,
                16781
            ],
            [
                16781,
                17154
            ],
            [
                17154,
                18857
            ],
            [
                18857,
                19528
            ],
            [
                19528,
                19710
            ],
            [
                19710,
                20023
            ],
            [
                20023,
                20224
            ],
            [
                20224,
                20614
            ],
            [
                20614,
                20707
            ],
            [
                20707,
                21909
            ],
            [
                21909,
                22614
            ],
            [
                22614,
                23015
            ],
            [
                23015,
                23288
            ]
        ],
        "segment_chars": [
            [
                0,
                148
            ],
            [
                148,
                380
            ],
            [
                380,
                798
            ],
            [
                798,
                970
            ],
            [
                970,
                1042
            ],
            [
                1042,
                1811
            ],
            [
                1811,
                1909
            ],
            [
                1909,
                2059
            ],
            [
                2059,
                2307
            ],
            [
                2307,
                2463
            ],
            [
                2463,
                2656
            ],
            [
                2656,
                2783
            ],
            [
                2783,
                2874
            ],
            [
                2874,
                2895
            ],
            [
                2895,
                3032
            ],
            [
                3032,
                3080
            ],
            [
                3080,
                3118
            ],
            [
                3118,
                3281
            ],
            [
                3281,
                3507
            ],
            [
                3507,
                3824
            ],
            [
                3824,
                4114
            ],
            [
                4114,
                4261
            ],
            [
                4261,
                4419
            ],
            [
                4419,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4500
            ],
            [
                4500,
                4625
            ],
            [
                4625,
                4733
            ],
            [
                4733,
                5000
            ],
            [
                5000,
                5057
            ],
            [
                5057,
                5137
            ],
            [
                5137,
                5257
            ],
            [
                5257,
                5291
            ],
            [
                5291,
                5330
            ],
            [
                5330,
                5499
            ],
            [
                5499,
                5873
            ],
            [
                5873,
                5994
            ],
            [
                5994,
                6164
            ],
            [
                6164,
                6281
            ],
            [
                6281,
                6464
            ],
            [
                6464,
                6541
            ],
            [
                6541,
                6714
            ],
            [
                6714,
                7226
            ],
            [
                7226,
                7546
            ],
            [
                7546,
                7657
            ],
            [
                7657,
                7947
            ],
            [
                7947,
                8046
            ],
            [
                8046,
                8151
            ],
            [
                8151,
                8255
            ],
            [
                8255,
                8759
            ],
            [
                8759,
                8987
            ],
            [
                8987,
                9198
            ],
            [
                9198,
                9542
            ],
            [
                9542,
                9613
            ],
            [
                9613,
                9765
            ],
            [
                9765,
                9810
            ],
            [
                9810,
                9957
            ],
            [
                9957,
                9986
            ],
            [
                9986,
                10019
            ],
            [
                10019,
                10449
            ],
            [
                10449,
                10474
            ],
            [
                10474,
                10500
            ],
            [
                10500,
                10873
            ],
            [
                10873,
                10963
            ],
            [
                10963,
                11058
            ],
            [
                11058,
                11314
            ],
            [
                11314,
                11476
            ],
            [
                11476,
                11627
            ],
            [
                11627,
                11931
            ],
            [
                11931,
                12046
            ],
            [
                12046,
                12161
            ],
            [
                12161,
                12347
            ],
            [
                12347,
                12377
            ],
            [
                12377,
                12414
            ],
            [
                12414,
                12488
            ],
            [
                12488,
                12499
            ],
            [
                12499,
                12518
            ],
            [
                12518,
                12620
            ],
            [
                12620,
                12645
            ],
            [
                12645,
                12713
            ],
            [
                12713,
                12777
            ],
            [
                12777,
                12851
            ],
            [
                12851,
                13046
            ],
            [
                13046,
                13155
            ],
            [
                13155,
                13177
            ],
            [
                13177,
                13213
            ],
            [
                13213,
                13257
            ],
            [
                13257,
                13495
            ],
            [
                13495,
                13631
            ],
            [
                13631,
                13756
            ],
            [
                13756,
                13846
            ],
            [
                13846,
                13936
            ],
            [
                13936,
                13982
            ],
            [
                13982,
                14137
            ],
            [
                14137,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14363
            ],
            [
                14363,
                14395
            ],
            [
                14395,
                14426
            ],
            [
                14426,
                14433
            ],
            [
                14433,
                14471
            ],
            [
                14471,
                14558
            ],
            [
                14558,
                14602
            ],
            [
                14602,
                14654
            ],
            [
                14654,
                14691
            ],
            [
                14691,
                14736
            ],
            [
                14736,
                14850
            ],
            [
                14850,
                14902
            ],
            [
                14902,
                14961
            ],
            [
                14961,
                15068
            ],
            [
                15068,
                15149
            ],
            [
                15149,
                15173
            ],
            [
                15173,
                15218
            ],
            [
                15218,
                15266
            ],
            [
                15266,
                15341
            ],
            [
                15341,
                15556
            ],
            [
                15556,
                15637
            ],
            [
                15637,
                15741
            ],
            [
                15741,
                15905
            ],
            [
                15905,
                16115
            ],
            [
                16115,
                16285
            ],
            [
                16285,
                16324
            ],
            [
                16324,
                16614
            ],
            [
                16614,
                16781
            ],
            [
                16781,
                16863
            ],
            [
                16863,
                16902
            ],
            [
                16902,
                16969
            ],
            [
                16969,
                17012
            ],
            [
                17012,
                17154
            ],
            [
                17154,
                17368
            ],
            [
                17368,
                17543
            ],
            [
                17543,
                17603
            ],
            [
                17603,
                17697
            ],
            [
                17697,
                17794
            ],
            [
                17794,
                18159
            ],
            [
                18159,
                18218
            ],
            [
                18218,
                18243
            ],
            [
                18243,
                18462
            ],
            [
                18462,
                18811
            ],
            [
                18811,
                18857
            ],
            [
                18857,
                18932
            ],
            [
                18932,
                19053
            ],
            [
                19053,
                19098
            ],
            [
                19098,
                19164
            ],
            [
                19164,
                19252
            ],
            [
                19252,
                19284
            ],
            [
                19284,
                19377
            ],
            [
                19377,
                19528
            ],
            [
                19528,
                19546
            ],
            [
                19546,
                19710
            ],
            [
                19710,
                19806
            ],
            [
                19806,
                19846
            ],
            [
                19846,
                20023
            ],
            [
                20023,
                20224
            ],
            [
                20224,
                20254
            ],
            [
                20254,
                20366
            ],
            [
                20366,
                20432
            ],
            [
                20432,
                20614
            ],
            [
                20614,
                20671
            ],
            [
                20671,
                20707
            ],
            [
                20707,
                20810
            ],
            [
                20810,
                20863
            ],
            [
                20863,
                20894
            ],
            [
                20894,
                21032
            ],
            [
                21032,
                21231
            ],
            [
                21231,
                21283
            ],
            [
                21283,
                21327
            ],
            [
                21327,
                21379
            ],
            [
                21379,
                21507
            ],
            [
                21507,
                21669
            ],
            [
                21669,
                21688
            ],
            [
                21688,
                21711
            ],
            [
                21711,
                21787
            ],
            [
                21787,
                21909
            ],
            [
                21909,
                22055
            ],
            [
                22055,
                22114
            ],
            [
                22114,
                22404
            ],
            [
                22404,
                22614
            ],
            [
                22614,
                23015
            ],
            [
                23015,
                23189
            ],
            [
                23189,
                23288
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                92,
                148
            ],
            [
                156,
                195
            ],
            [
                242,
                286
            ],
            [
                236,
                237
            ],
            [
                287,
                310
            ],
            [
                311,
                324
            ],
            [
                226,
                228
            ],
            [
                337,
                341
            ],
            [
                354,
                358
            ],
            [
                368,
                380
            ],
            [
                380,
                390
            ],
            [
                564,
                566
            ],
            [
                433,
                436
            ],
            [
                446,
                453
            ],
            [
                477,
                483
            ],
            [
                518,
                538
            ],
            [
                508,
                510
            ],
            [
                759,
                762
            ],
            [
                503,
                507
            ],
            [
                567,
                574
            ],
            [
                594,
                634
            ],
            [
                647,
                651
            ],
            [
                655,
                670
            ],
            [
                413,
                415
            ],
            [
                678,
                680
            ],
            [
                714,
                750
            ],
            [
                782,
                798
            ],
            [
                798,
                799
            ],
            [
                811,
                821
            ],
            [
                890,
                893
            ],
            [
                841,
                847
            ],
            [
                858,
                883
            ],
            [
                1042,
                1128
            ],
            [
                1135,
                1145
            ],
            [
                1156,
                1163
            ],
            [
                1508,
                1509
            ],
            [
                1274,
                1289
            ],
            [
                1302,
                1324
            ],
            [
                1163,
                1164
            ],
            [
                1207,
                1210
            ],
            [
                1390,
                1432
            ],
            [
                1453,
                1468
            ],
            [
                1479,
                1499
            ],
            [
                1622,
                1648
            ],
            [
                1256,
                1259
            ],
            [
                1661,
                1719
            ],
            [
                1333,
                1336
            ],
            [
                1735,
                1740
            ],
            [
                1754,
                1762
            ],
            [
                1809,
                1811
            ],
            [
                1811,
                1815
            ],
            [
                1832,
                1837
            ],
            [
                1849,
                1858
            ],
            [
                1871,
                1909
            ],
            [
                1909,
                1981
            ],
            [
                2002,
                2019
            ],
            [
                2028,
                2059
            ],
            [
                2059,
                2070
            ],
            [
                2071,
                2086
            ],
            [
                2088,
                2094
            ],
            [
                2086,
                2087
            ],
            [
                2140,
                2164
            ],
            [
                2240,
                2245
            ],
            [
                2263,
                2306
            ],
            [
                2307,
                2314
            ],
            [
                2346,
                2351
            ],
            [
                2315,
                2320
            ],
            [
                2410,
                2423
            ],
            [
                2461,
                2463
            ],
            [
                2463,
                2497
            ],
            [
                2502,
                2526
            ],
            [
                2536,
                2553
            ],
            [
                2557,
                2601
            ],
            [
                2654,
                2656
            ],
            [
                2656,
                2719
            ],
            [
                2726,
                2733
            ],
            [
                2849,
                2852
            ],
            [
                2858,
                2859
            ],
            [
                2783,
                2839
            ],
            [
                2860,
                2874
            ],
            [
                2874,
                2895
            ],
            [
                2895,
                2902
            ],
            [
                2914,
                2938
            ],
            [
                2950,
                2970
            ],
            [
                2985,
                3032
            ],
            [
                3032,
                3054
            ],
            [
                3061,
                3080
            ],
            [
                3080,
                3118
            ],
            [
                3118,
                3121
            ],
            [
                3140,
                3200
            ],
            [
                3133,
                3134
            ],
            [
                3202,
                3205
            ],
            [
                3214,
                3259
            ],
            [
                3279,
                3281
            ],
            [
                3281,
                3307
            ],
            [
                3356,
                3397
            ],
            [
                3420,
                3423
            ],
            [
                3466,
                3472
            ],
            [
                3486,
                3507
            ],
            [
                3507,
                3518
            ],
            [
                3649,
                3653
            ],
            [
                3672,
                3783
            ],
            [
                3811,
                3824
            ],
            [
                3824,
                3868
            ],
            [
                3897,
                3938
            ],
            [
                3954,
                3972
            ],
            [
                3977,
                3992
            ],
            [
                4001,
                4026
            ],
            [
                4032,
                4049
            ],
            [
                4063,
                4066
            ],
            [
                4112,
                4114
            ],
            [
                4114,
                4230
            ],
            [
                4252,
                4261
            ],
            [
                4261,
                4323
            ],
            [
                4349,
                4399
            ],
            [
                4407,
                4418
            ],
            [
                4419,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4500
            ],
            [
                4597,
                4624
            ],
            [
                4733,
                4792
            ],
            [
                4794,
                4812
            ],
            [
                4859,
                4865
            ],
            [
                4873,
                4885
            ],
            [
                4896,
                4903
            ],
            [
                4915,
                4959
            ],
            [
                4981,
                5000
            ],
            [
                5057,
                5078
            ],
            [
                5079,
                5136
            ],
            [
                5137,
                5183
            ],
            [
                5201,
                5257
            ],
            [
                5257,
                5291
            ],
            [
                5291,
                5302
            ],
            [
                5385,
                5387
            ],
            [
                5363,
                5364
            ],
            [
                5330,
                5363
            ],
            [
                5411,
                5437
            ],
            [
                5449,
                5499
            ],
            [
                5499,
                5559
            ],
            [
                5871,
                5873
            ],
            [
                5930,
                5994
            ],
            [
                5994,
                6008
            ],
            [
                6016,
                6044
            ],
            [
                6046,
                6056
            ],
            [
                6125,
                6126
            ],
            [
                6062,
                6067
            ],
            [
                6080,
                6115
            ],
            [
                6162,
                6164
            ],
            [
                6284,
                6289
            ],
            [
                6293,
                6299
            ],
            [
                6300,
                6303
            ],
            [
                6333,
                6334
            ],
            [
                6464,
                6466
            ],
            [
                6477,
                6500
            ],
            [
                6507,
                6523
            ],
            [
                6462,
                6463
            ],
            [
                6753,
                6757
            ],
            [
                6786,
                6797
            ],
            [
                6775,
                6782
            ],
            [
                6861,
                6898
            ],
            [
                6920,
                6932
            ],
            [
                6899,
                6901
            ],
            [
                6933,
                6964
            ],
            [
                7030,
                7072
            ],
            [
                7088,
                7104
            ],
            [
                7113,
                7124
            ],
            [
                7105,
                7112
            ],
            [
                6998,
                7000
            ],
            [
                7200,
                7202
            ],
            [
                7152,
                7170
            ],
            [
                7224,
                7226
            ],
            [
                7226,
                7264
            ],
            [
                7283,
                7289
            ],
            [
                7302,
                7317
            ],
            [
                7356,
                7368
            ],
            [
                7325,
                7349
            ],
            [
                7317,
                7318
            ],
            [
                7376,
                7380
            ],
            [
                7476,
                7477
            ],
            [
                7381,
                7415
            ],
            [
                7482,
                7510
            ],
            [
                7544,
                7546
            ],
            [
                7660,
                7718
            ],
            [
                7791,
                7818
            ],
            [
                7832,
                7947
            ],
            [
                7983,
                8001
            ],
            [
                8010,
                8016
            ],
            [
                8018,
                8044
            ],
            [
                7947,
                7978
            ],
            [
                8044,
                8046
            ],
            [
                8046,
                8081
            ],
            [
                8090,
                8114
            ],
            [
                8149,
                8151
            ],
            [
                8151,
                8187
            ],
            [
                8190,
                8195
            ],
            [
                8206,
                8235
            ],
            [
                8244,
                8255
            ],
            [
                8414,
                8472
            ],
            [
                8277,
                8280
            ],
            [
                8496,
                8510
            ],
            [
                8757,
                8759
            ],
            [
                8759,
                8781
            ],
            [
                8830,
                8846
            ],
            [
                8863,
                8867
            ],
            [
                8847,
                8850
            ],
            [
                8860,
                8862
            ],
            [
                8868,
                8892
            ],
            [
                8897,
                8945
            ],
            [
                8953,
                8959
            ],
            [
                8963,
                8987
            ],
            [
                8987,
                9005
            ],
            [
                9045,
                9085
            ],
            [
                9100,
                9148
            ],
            [
                9183,
                9189
            ],
            [
                9193,
                9198
            ],
            [
                9198,
                9247
            ],
            [
                9253,
                9255
            ],
            [
                9542,
                9582
            ],
            [
                9584,
                9588
            ],
            [
                9599,
                9613
            ],
            [
                9613,
                9668
            ],
            [
                9677,
                9684
            ],
            [
                9686,
                9715
            ],
            [
                9735,
                9742
            ],
            [
                9716,
                9721
            ],
            [
                9810,
                9846
            ],
            [
                9851,
                9957
            ],
            [
                9957,
                9986
            ],
            [
                9986,
                9994
            ],
            [
                10003,
                10019
            ],
            [
                10019,
                10025
            ],
            [
                10075,
                10100
            ],
            [
                10114,
                10131
            ],
            [
                10367,
                10372
            ],
            [
                10170,
                10256
            ],
            [
                10447,
                10448
            ],
            [
                10263,
                10271
            ],
            [
                10309,
                10321
            ],
            [
                10373,
                10417
            ],
            [
                10422,
                10447
            ],
            [
                10873,
                10963
            ],
            [
                10963,
                11014
            ],
            [
                11056,
                11058
            ],
            [
                11058,
                11131
            ],
            [
                11154,
                11197
            ],
            [
                11206,
                11217
            ],
            [
                11198,
                11202
            ],
            [
                11253,
                11283
            ],
            [
                11223,
                11226
            ],
            [
                11290,
                11314
            ],
            [
                11314,
                11353
            ],
            [
                11404,
                11411
            ],
            [
                11445,
                11446
            ],
            [
                11454,
                11474
            ],
            [
                11430,
                11440
            ],
            [
                11474,
                11476
            ],
            [
                11476,
                11524
            ],
            [
                11538,
                11561
            ],
            [
                11578,
                11627
            ],
            [
                11972,
                12015
            ],
            [
                12046,
                12065
            ],
            [
                12159,
                12161
            ],
            [
                12190,
                12195
            ],
            [
                12180,
                12186
            ],
            [
                12196,
                12218
            ],
            [
                12234,
                12347
            ],
            [
                12347,
                12375
            ],
            [
                12425,
                12488
            ],
            [
                12499,
                12518
            ],
            [
                12518,
                12549
            ],
            [
                12554,
                12562
            ],
            [
                12620,
                12645
            ],
            [
                12645,
                12664
            ],
            [
                12669,
                12713
            ],
            [
                12777,
                12791
            ],
            [
                12811,
                12829
            ],
            [
                12831,
                12851
            ],
            [
                12851,
                12923
            ],
            [
                12936,
                12943
            ],
            [
                12924,
                12928
            ],
            [
                12989,
                12992
            ],
            [
                12932,
                12935
            ],
            [
                12949,
                12954
            ],
            [
                13011,
                13014
            ],
            [
                12964,
                12972
            ],
            [
                13044,
                13046
            ],
            [
                13046,
                13047
            ],
            [
                13082,
                13155
            ],
            [
                13177,
                13213
            ],
            [
                13213,
                13234
            ],
            [
                13239,
                13257
            ],
            [
                13257,
                13275
            ],
            [
                13283,
                13307
            ],
            [
                13316,
                13340
            ],
            [
                13342,
                13348
            ],
            [
                13371,
                13411
            ],
            [
                13495,
                13505
            ],
            [
                13519,
                13570
            ],
            [
                13578,
                13584
            ],
            [
                13571,
                13577
            ],
            [
                13585,
                13630
            ],
            [
                13756,
                13762
            ],
            [
                13766,
                13787
            ],
            [
                13861,
                13894
            ],
            [
                13956,
                13972
            ],
            [
                13894,
                13935
            ],
            [
                13982,
                14072
            ],
            [
                14082,
                14137
            ],
            [
                14137,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14325
            ],
            [
                14342,
                14363
            ],
            [
                14363,
                14395
            ],
            [
                14395,
                14426
            ],
            [
                14426,
                14433
            ],
            [
                14441,
                14471
            ],
            [
                14471,
                14492
            ],
            [
                14506,
                14510
            ],
            [
                14512,
                14520
            ],
            [
                14540,
                14544
            ],
            [
                14498,
                14499
            ],
            [
                14545,
                14558
            ],
            [
                14558,
                14562
            ],
            [
                14595,
                14600
            ],
            [
                14563,
                14594
            ],
            [
                14600,
                14602
            ],
            [
                14654,
                14691
            ],
            [
                14736,
                14776
            ],
            [
                14820,
                14822
            ],
            [
                14779,
                14816
            ],
            [
                14828,
                14850
            ],
            [
                14850,
                14902
            ],
            [
                14902,
                14961
            ],
            [
                14961,
                14973
            ],
            [
                14987,
                15068
            ],
            [
                15068,
                15069
            ],
            [
                15155,
                15156
            ],
            [
                15162,
                15168
            ],
            [
                15111,
                15120
            ],
            [
                15124,
                15143
            ],
            [
                15171,
                15173
            ],
            [
                15173,
                15218
            ],
            [
                15218,
                15256
            ],
            [
                15341,
                15342
            ],
            [
                15368,
                15464
            ],
            [
                15470,
                15556
            ],
            [
                15637,
                15741
            ],
            [
                15741,
                15809
            ],
            [
                15831,
                15905
            ],
            [
                15905,
                15997
            ],
            [
                16004,
                16033
            ],
            [
                16051,
                16113
            ],
            [
                16034,
                16050
            ],
            [
                16113,
                16115
            ],
            [
                16115,
                16181
            ],
            [
                16230,
                16285
            ],
            [
                16285,
                16287
            ],
            [
                16298,
                16323
            ],
            [
                16324,
                16435
            ],
            [
                16612,
                16614
            ],
            [
                16673,
                16680
            ],
            [
                16614,
                16671
            ],
            [
                16682,
                16704
            ],
            [
                16739,
                16759
            ],
            [
                16767,
                16781
            ],
            [
                16781,
                16863
            ],
            [
                16863,
                16902
            ],
            [
                16969,
                17012
            ],
            [
                17012,
                17071
            ],
            [
                17128,
                17154
            ],
            [
                17154,
                17161
            ],
            [
                17178,
                17194
            ],
            [
                17222,
                17234
            ],
            [
                17238,
                17246
            ],
            [
                17258,
                17276
            ],
            [
                17298,
                17368
            ],
            [
                17368,
                17392
            ],
            [
                17415,
                17462
            ],
            [
                17475,
                17476
            ],
            [
                17551,
                17603
            ],
            [
                17697,
                17712
            ],
            [
                17756,
                17794
            ],
            [
                17794,
                17797
            ],
            [
                18061,
                18064
            ],
            [
                17802,
                17806
            ],
            [
                17812,
                17818
            ],
            [
                17857,
                17917
            ],
            [
                17818,
                17833
            ],
            [
                18126,
                18134
            ],
            [
                18135,
                18158
            ],
            [
                18159,
                18168
            ],
            [
                18186,
                18200
            ],
            [
                18202,
                18218
            ],
            [
                18218,
                18243
            ],
            [
                18243,
                18247
            ],
            [
                18426,
                18431
            ],
            [
                18332,
                18337
            ],
            [
                18413,
                18421
            ],
            [
                18432,
                18438
            ],
            [
                18261,
                18277
            ],
            [
                18443,
                18462
            ],
            [
                18462,
                18477
            ],
            [
                18561,
                18571
            ],
            [
                18593,
                18617
            ],
            [
                18675,
                18688
            ],
            [
                18717,
                18763
            ],
            [
                18477,
                18478
            ],
            [
                18700,
                18704
            ],
            [
                18773,
                18810
            ],
            [
                18857,
                18882
            ],
            [
                18893,
                18898
            ],
            [
                18883,
                18888
            ],
            [
                18898,
                18932
            ],
            [
                18932,
                18970
            ],
            [
                19051,
                19053
            ],
            [
                19098,
                19164
            ],
            [
                19164,
                19252
            ],
            [
                19252,
                19284
            ],
            [
                19321,
                19355
            ],
            [
                19357,
                19377
            ],
            [
                19377,
                19411
            ],
            [
                19452,
                19481
            ],
            [
                19491,
                19519
            ],
            [
                19525,
                19528
            ],
            [
                19528,
                19546
            ],
            [
                19546,
                19556
            ],
            [
                19708,
                19710
            ],
            [
                19710,
                19714
            ],
            [
                19771,
                19772
            ],
            [
                19715,
                19733
            ],
            [
                19773,
                19804
            ],
            [
                19733,
                19771
            ],
            [
                19804,
                19806
            ],
            [
                19806,
                19824
            ],
            [
                19829,
                19833
            ],
            [
                20023,
                20122
            ],
            [
                20129,
                20158
            ],
            [
                20172,
                20224
            ],
            [
                20224,
                20254
            ],
            [
                20254,
                20282
            ],
            [
                20284,
                20297
            ],
            [
                20369,
                20432
            ],
            [
                20432,
                20530
            ],
            [
                20534,
                20578
            ],
            [
                20591,
                20614
            ],
            [
                20614,
                20626
            ],
            [
                20638,
                20671
            ],
            [
                20671,
                20707
            ],
            [
                20707,
                20810
            ],
            [
                20810,
                20826
            ],
            [
                20836,
                20863
            ],
            [
                20894,
                20934
            ],
            [
                20996,
                21004
            ],
            [
                21009,
                21019
            ],
            [
                20956,
                20957
            ],
            [
                21041,
                21066
            ],
            [
                21067,
                21090
            ],
            [
                21229,
                21231
            ],
            [
                21232,
                21247
            ],
            [
                21256,
                21270
            ],
            [
                21248,
                21255
            ],
            [
                21281,
                21283
            ],
            [
                21283,
                21327
            ],
            [
                21507,
                21576
            ],
            [
                21590,
                21610
            ],
            [
                21667,
                21669
            ],
            [
                21669,
                21688
            ],
            [
                21688,
                21711
            ],
            [
                21711,
                21787
            ],
            [
                21787,
                21909
            ],
            [
                21909,
                21935
            ],
            [
                21947,
                21996
            ],
            [
                22005,
                22016
            ],
            [
                22032,
                22055
            ],
            [
                22055,
                22095
            ],
            [
                22102,
                22114
            ],
            [
                22114,
                22133
            ],
            [
                22306,
                22309
            ],
            [
                22140,
                22158
            ],
            [
                22165,
                22177
            ],
            [
                22243,
                22280
            ],
            [
                22311,
                22356
            ],
            [
                22226,
                22237
            ],
            [
                22371,
                22404
            ],
            [
                22404,
                22459
            ],
            [
                22493,
                22496
            ],
            [
                22469,
                22475
            ],
            [
                22501,
                22506
            ],
            [
                22514,
                22569
            ],
            [
                22579,
                22614
            ],
            [
                22614,
                22643
            ],
            [
                22661,
                22663
            ],
            [
                22725,
                22729
            ],
            [
                22644,
                22660
            ],
            [
                22822,
                22823
            ],
            [
                22731,
                22792
            ],
            [
                22794,
                22814
            ],
            [
                22828,
                22832
            ],
            [
                22852,
                22864
            ],
            [
                23013,
                23015
            ],
            [
                23015,
                23052
            ],
            [
                23054,
                23130
            ],
            [
                23132,
                23189
            ],
            [
                23189,
                23207
            ],
            [
                23224,
                23288
            ]
        ],
        "row_chars": [
            [
                0,
                148
            ],
            [
                148,
                380
            ],
            [
                380,
                798
            ],
            [
                798,
                970
            ],
            [
                970,
                1042
            ],
            [
                1042,
                1811
            ],
            [
                1811,
                1909
            ],
            [
                1909,
                2059
            ],
            [
                2059,
                2307
            ],
            [
                2307,
                2463
            ],
            [
                2463,
                2656
            ],
            [
                2656,
                2874
            ],
            [
                2874,
                2895
            ],
            [
                2895,
                3032
            ],
            [
                3032,
                3080
            ],
            [
                3080,
                3118
            ],
            [
                3118,
                3281
            ],
            [
                3281,
                3507
            ],
            [
                3507,
                3824
            ],
            [
                3824,
                4114
            ],
            [
                4114,
                4261
            ],
            [
                4261,
                4419
            ],
            [
                4419,
                4436
            ],
            [
                4436,
                4452
            ],
            [
                4452,
                4500
            ],
            [
                4500,
                4625
            ],
            [
                4625,
                4733
            ],
            [
                4733,
                5000
            ],
            [
                5000,
                5057
            ],
            [
                5057,
                5137
            ],
            [
                5137,
                5257
            ],
            [
                5257,
                5291
            ],
            [
                5291,
                5499
            ],
            [
                5499,
                5873
            ],
            [
                5873,
                5994
            ],
            [
                5994,
                6164
            ],
            [
                6164,
                6281
            ],
            [
                6281,
                6541
            ],
            [
                6541,
                6714
            ],
            [
                6714,
                7226
            ],
            [
                7226,
                7546
            ],
            [
                7546,
                7657
            ],
            [
                7657,
                7947
            ],
            [
                7947,
                8046
            ],
            [
                8046,
                8151
            ],
            [
                8151,
                8255
            ],
            [
                8255,
                8759
            ],
            [
                8759,
                8987
            ],
            [
                8987,
                9198
            ],
            [
                9198,
                9542
            ],
            [
                9542,
                9613
            ],
            [
                9613,
                9765
            ],
            [
                9765,
                9810
            ],
            [
                9810,
                9957
            ],
            [
                9957,
                9986
            ],
            [
                9986,
                10019
            ],
            [
                10019,
                10449
            ],
            [
                10449,
                10474
            ],
            [
                10474,
                10500
            ],
            [
                10500,
                10873
            ],
            [
                10873,
                10963
            ],
            [
                10963,
                11058
            ],
            [
                11058,
                11314
            ],
            [
                11314,
                11476
            ],
            [
                11476,
                11627
            ],
            [
                11627,
                11931
            ],
            [
                11931,
                12046
            ],
            [
                12046,
                12161
            ],
            [
                12161,
                12347
            ],
            [
                12347,
                12488
            ],
            [
                12488,
                12499
            ],
            [
                12499,
                12518
            ],
            [
                12518,
                12645
            ],
            [
                12645,
                12713
            ],
            [
                12713,
                12777
            ],
            [
                12777,
                12851
            ],
            [
                12851,
                13046
            ],
            [
                13046,
                13155
            ],
            [
                13155,
                13177
            ],
            [
                13177,
                13213
            ],
            [
                13213,
                13257
            ],
            [
                13257,
                13495
            ],
            [
                13495,
                13631
            ],
            [
                13631,
                13756
            ],
            [
                13756,
                13982
            ],
            [
                13982,
                14137
            ],
            [
                14137,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14363
            ],
            [
                14363,
                14395
            ],
            [
                14395,
                14426
            ],
            [
                14426,
                14433
            ],
            [
                14433,
                14471
            ],
            [
                14471,
                14558
            ],
            [
                14558,
                14602
            ],
            [
                14602,
                14654
            ],
            [
                14654,
                14691
            ],
            [
                14691,
                14736
            ],
            [
                14736,
                14850
            ],
            [
                14850,
                14902
            ],
            [
                14902,
                14961
            ],
            [
                14961,
                15068
            ],
            [
                15068,
                15173
            ],
            [
                15173,
                15218
            ],
            [
                15218,
                15266
            ],
            [
                15266,
                15341
            ],
            [
                15341,
                15556
            ],
            [
                15556,
                15637
            ],
            [
                15637,
                15741
            ],
            [
                15741,
                15905
            ],
            [
                15905,
                16115
            ],
            [
                16115,
                16285
            ],
            [
                16285,
                16324
            ],
            [
                16324,
                16614
            ],
            [
                16614,
                16781
            ],
            [
                16781,
                16863
            ],
            [
                16863,
                16902
            ],
            [
                16902,
                16969
            ],
            [
                16969,
                17012
            ],
            [
                17012,
                17154
            ],
            [
                17154,
                17368
            ],
            [
                17368,
                17603
            ],
            [
                17603,
                17697
            ],
            [
                17697,
                17794
            ],
            [
                17794,
                18159
            ],
            [
                18159,
                18218
            ],
            [
                18218,
                18243
            ],
            [
                18243,
                18462
            ],
            [
                18462,
                18811
            ],
            [
                18811,
                18857
            ],
            [
                18857,
                18932
            ],
            [
                18932,
                19053
            ],
            [
                19053,
                19098
            ],
            [
                19098,
                19164
            ],
            [
                19164,
                19252
            ],
            [
                19252,
                19284
            ],
            [
                19284,
                19377
            ],
            [
                19377,
                19528
            ],
            [
                19528,
                19546
            ],
            [
                19546,
                19710
            ],
            [
                19710,
                19806
            ],
            [
                19806,
                19846
            ],
            [
                19846,
                20023
            ],
            [
                20023,
                20224
            ],
            [
                20224,
                20254
            ],
            [
                20254,
                20432
            ],
            [
                20432,
                20614
            ],
            [
                20614,
                20671
            ],
            [
                20671,
                20707
            ],
            [
                20707,
                20810
            ],
            [
                20810,
                20863
            ],
            [
                20863,
                20894
            ],
            [
                20894,
                21231
            ],
            [
                21231,
                21283
            ],
            [
                21283,
                21327
            ],
            [
                21327,
                21379
            ],
            [
                21379,
                21507
            ],
            [
                21507,
                21669
            ],
            [
                21669,
                21688
            ],
            [
                21688,
                21711
            ],
            [
                21711,
                21787
            ],
            [
                21787,
                21909
            ],
            [
                21909,
                22055
            ],
            [
                22055,
                22114
            ],
            [
                22114,
                22404
            ],
            [
                22404,
                22614
            ],
            [
                22614,
                23015
            ],
            [
                23015,
                23189
            ],
            [
                23189,
                23288
            ]
        ]
    },
    "abridged": {
        "text": "Without knowing how, Captain William Dobbin found himself the manager of the match between George Osborne and Amelia. Without him it never would have taken place: he smiled rather bitterly as he thought that he, of all men in the world, should be the one to whom this task had fallen. But though it was painful to him, Captain Dobbin was used to doing his duty without hesitation: and, having made up his mind that Miss Sedley was in danger of dying of disappointment, he was determined to keep her alive.\nI will not enter into the details of the meeting between George and Amelia. A much harder heart than George's would have melted at the sight of that sweet face so ravaged by despair. When her mother brought Osborne to her, she laid her head on her lover's shoulder and there wept the most tender and refreshing tears. After crying over George's hand, she kissed it humbly, as if he were her supreme chief and master, and she quite unworthy.\nThis sweet obedience touched and flattered George Osborne. He saw a slave before him in that simple yielding faithful creature, and thrilled secretly at the knowledge of his power. He would be a generous-minded Sultan, and make a queen of her: so he raised her up and forgave her, so to speak.\nAll her dying hopes bloomed again. You would scarcely have recognised her beaming little face upon her pillow that night compared to the one that was laid there the night before. The honest Irish maid-servant, delighted with the change, asked to kiss her, and Amelia put her arms round the girl's neck and kissed her like a child. She was little more. She had a sweet refreshing sleep - and what a spring of happiness as she woke in the morning sunshine!\n\"He will be here again today,\" Amelia thought. \"He is the greatest and best of men.\" And George thought he was one of the generousest creatures alive, and was making a tremendous sacrifice in marrying her.\nWhile she and Osborne were meeting, old Mrs. Sedley and Captain Dobbin were talking downstairs about the future of the young people. Mrs. Sedley thought that nothing would induce Mr. Sedley to consent to the match between his daughter and the son of a man who had so shamefully treated him. And she told a long story about happier days, when Osborne lived in a very humble way, and his wife was glad to receive Jos's little baby things, which Mrs. Sedley passed on to her. The fiendish ingratitude of that man, she was sure, had broken Mr. S.'s heart: and as for a marriage, he would never consent.\n\"They must run away together, Ma'am,\" Dobbin said, laughing, \"like Captain Rawdon Crawley, and Miss Emmy's friend the governess.\"\nWas it possible? Well she never! Mrs. Sedley was all excitement about this news. What an escape Jos had had!\nIt was not, however, Mr. Sedley's wrath which Dobbin feared so much as that of George's father. He had considerable anxiety about the behaviour of the black-browed old tyrant in Russell Square. He knew what a savage, determined man Osborne was, and how he stuck by his word.\n\"The only chance George has of reconcilement,\" thought Dobbin, \"is by distinguishing himself in the coming campaign. If he dies they both go together. If he fails to distinguish himself, he has some money from his mother - or he must sell out and go to Canada, or rough it in a cottage in the country.\" With such a partner Dobbin thought he would not mind Siberia.\nHe thought too that the marriage should take place as quickly as possible. Was he anxious, I wonder, to have it over? - as people, after a death, like to press forward the funeral. Dobbin urged George to marry before the regiment departed from England: if necessary he would go himself and see both the fathers.\nWith Mrs. Sedley's consent, Mr. Dobbin went to seek John Sedley in the City, at the Tapioca Coffee-house, where the poor broken-down old gentleman used to go daily, and write and receive letters tied up in mysterious bundles. I don't know anything more dismal than the bustle of a ruined man as he shows you letters from the wealthy: worn, greasy documents promising support, on which he builds his hopes. Such a man takes you into the corner; he has his bundle of papers out, and the favourite letters laid before you; and who does not know the sad eager half-crazy look which he fixes on you with his hopeless eyes?\nDobbin found the once jovial and prosperous John Sedley changed into a man of this sort. His coat, that used to be so glossy, was white at the seams. His face had fallen in, and was unshaved; his neckcloth hung limp under his sagging waistcoat. It was quite painful to see how humble and civil he was to the blear-eyed old waiter. As for William Dobbin, who had been the butt of the old man's humour on a thousand occasions, Sedley gave his hand to him in a very hesitating manner, and called him \"Sir.\" A feeling of shame overcame Dobbin as the broken old man so received him, as if he himself had been somehow guilty of bringing Sedley low.\n\"I am very glad to see you, Captain Dobbin, sir,\" said he. \"How is the worthy alderman, and my lady your mother, sir?\" He looked round at the waiter as he said, \"My lady,\" as if to say, Hark ye, John, I have friends of rank still. \"My young friends Dale and Spiggot do my business for me now, until my new offices are ready; for I'm only here temporarily, you know, Captain. What can we do for you, sir? Will you take anything?\"\nDobbin protested that he was not hungry or thirsty, and that he only came to ask if Mr. Sedley was well, and to shake hands with an old friend. He added, \"My mother is only waiting for the first fine day to go and call upon Mrs. Sedley.\"\n\"My wife will be very happy to see her ladyship,\" Sedley replied, pulling out his papers. \"I've a very kind letter here from your father, sir. Lady D. will find us in rather a smaller house than we were accustomed to; but it's snug, and the change of air does my daughter good - you remember little Emmy, sir? - she was suffering a good deal.\" The old gentleman's eyes were wandering, as he fumbled at the worn red tape around his papers.\n\"You're a military man,\" he went on; \"I ask you, could any man ever have predicted the return of that Corsican scoundrel from Elba? The Emperor of Austria was a damned traitor. I don't mince words. Boney's escape from Elba was a damned plot, sir, in which half the powers of Europe were concerned, to bring the funds down, and to ruin this country. That's why I'm here, William - because I trusted the Emperor of Russia and the Prince Regent. Look at my papers. Look what the funds were on the first of March - and what they're at now. There was collusion, or that villain never would have escaped. He ought to be brought to a court-martial and shot, by Jove.\"\n\"We're going to hunt Boney out, sir,\" Dobbin said, rather alarmed at the old man's fury and the swelling veins on his forehead. \"The Duke's in Belgium already, and we expect marching orders every day.\"\n\"Bring back the villain's head, sir. Shoot the coward down,\" Sedley roared. \"I'd enlist myself - but I'm a broken old man - ruined by that damned scoundrel and by thieves in this country whom I made, sir!\"\nDobbin was affected by the sight of this once kind old friend, almost crazed with misfortune and raving with senile anger.\n\"Yes,\" Sedley continued, \"there are beggars that you put on horseback, William Dobbin, and they're the first to ride you down. I mean a purse-proud villain in Russell Square, whom I knew without a shilling, and whom I hope to see a beggar as he was when I befriended him.\"\n\"I have heard something of this, sir, from my friend George,\" Dobbin said, anxious to come to his point. \"The quarrel between you and his father has cut him up a great deal, sir. Indeed, I have a message from him.\"\n\"O, that's your errand, is it?\" cried the old man, jumping up. \"What! he condoles with me, does he? Very kind of him, the prig with his West-end swagger. He's still hankering about my house, is he? He's as big a villain as his father. I curse the day that ever I let him into my house; and I'd rather see my daughter dead than married to him.\"\n\"His father's harshness is not George's fault, sir. Your daughter's love for him is as much your doing as his. Who are you, to play with two young people's affections and break their hearts at your will?\"\n\"I forbid the match,\" old Sedley cried. \"That family and mine are separated for ever. I'm fallen low, but not so low as that.\"\n\"You have not the power or the right to separate those two,\" Dobbin answered in a low voice; \"and if you don't give your daughter your consent it will be her duty to marry without it. To my thinking, she's just as much married as if the banns had been read in all the churches in London. And what better answer can there be to Osborne's charges against you, than that his son claims to enter your family and marry your daughter?\"\nA light of something like satisfaction seemed to break over old Sedley as this point was put: but he still persisted that the marriage between Amelia and George should never take place with his consent.\n\"We must do it without,\" Dobbin said, smiling, and told Mr. Sedley the story of Rebecca's elopement with Captain Crawley. It amused the old gentleman.\n\"You're terrible fellows, you Captains,\" said he, tying up his papers; and his face wore something like a smile.\nPerhaps the idea of hitting his enemy Osborne such a blow soothed the old gentleman: and he and Dobbin parted good friends.\n*\n\"My sisters say she has diamonds as big as pigeons' eggs,\" George said, laughing. \"How they must set off her complexion! Her jet-black hair is as curly as Sambo's. I dare say she wore a nose ring when she went to court; and looked a perfect Belle Sauvage.\"\nGeorge, talking with Amelia, was describing a young lady, a West Indian heiress whom his sisters had lately met, and who was an object of vast respect to the Russell Square family. She was reported to have numerous plantations in the West Indies; a deal of money; a mansion in Surrey, and a house in Portland Place. Mrs. Haggistoun \"chaperoned\" her, and kept her house. She had just left school, and George and his sisters had met her at an evening party, where she had received them with great good humour.\nAn orphan - with her money - so interesting! the Misses Osborne said. They drove in their carriage to see their new friend the very next day. Mrs. Haggistoun struck the girls as rather haughty, but Rhoda was the frankest, kindest, most agreeable creature, they said - wanting a little polish, but so good-natured.\n\"You should have seen her court dress, Emmy,\" Osborne cried, laughing. \"She came to my sisters to show it off. Her diamonds blazed out like Vauxhall on the night we were there. (Do you remember Vauxhall, Emmy, and Jos singing to his dearest diddle diddle darling?) Diamonds and mahogany, my dear! and the white feathers in her hair - I mean in her wool. She had earrings like chandeliers; and a yellow satin train that streamed after her like the tail of a cornet.\"\n\"How old is she?\" asked Emmy.\n\"Why, the Black Princess must be two or three and twenty, though she has only just left school. And you should see her hand-writing!\"\n\"Why, surely it must be Miss Swartz, the parlour boarder,\" Emmy said, remembering that good-natured mulatto girl, who had been so affected when Amelia left Miss Pinkerton's academy.\n\"The very name,\" George said. \"Her father was a German Jew - a slave-owner who died last year, and Miss Pinkerton has finished her education. She can play two pieces on the piano; she knows three songs; she can write when Mrs. Haggistoun is there to spell for her; and Jane and Maria already love her as a sister.\"\n\"I wish they had loved me,\" said Emmy, wistfully. \"They were always very cold to me.\"\n\"My dear child, they would have loved you if you had had two hundred thousand pounds,\" George replied. \"That is the way they have been brought up. We live among bankers and City big-wigs, who are always jingling their guineas in their pockets, like that jackass Fred Bullock who is going to marry Maria. Curse the whole money-grubbing pack of them! I fall asleep at their great heavy dinners. Dear little woman, you are the only person of our set who ever looked or spoke like a lady. Don't remonstrate. You are the only lady. Didn't Miss Crawley remark it, who has lived in the best company in Europe? And as for Crawley, of the Life Guards, hang it, he's a fine fellow: and I like him for marrying the girl he had chosen.\"\nAmelia admired Mr. Crawley too, for this; and trusted Rebecca would be happy, and hoped Jos would be consoled. And so the pair went on prattling, as in early days. Amelia's confidence was perfectly restored, though she professed to be dreadfully frightened lest George should forget her for the heiress Miss Swartz and her estates in Saint Kitt's. But the fact is, she was a great deal too happy to have any doubts: and with George at her side again, was not afraid of any heiress, or indeed of any sort of danger.\nWhen Captain Dobbin came back to them in the afternoon, it did his heart good to see how Amelia had grown young again - how she laughed, and sang at the piano.\nBeyond the first smile of recognition - and even that was an hypocrisy, for she thought his arrival rather provoking - Miss Sedley did not once notice Dobbin during his visit. But he was content to see her happy; and thankful to have been the means of making her so.",
        "paragraph_chars": [
            [
                0,
                506
            ],
            [
                506,
                947
            ],
            [
                947,
                1241
            ],
            [
                1241,
                1696
            ],
            [
                1696,
                1902
            ],
            [
                1902,
                2501
            ],
            [
                2501,
                2631
            ],
            [
                2631,
                2740
            ],
            [
                2740,
                3015
            ],
            [
                3015,
                3380
            ],
            [
                3380,
                3692
            ],
            [
                3692,
                4310
            ],
            [
                4310,
                4953
            ],
            [
                4953,
                5382
            ],
            [
                5382,
                5620
            ],
            [
                5620,
                6059
            ],
            [
                6059,
                6720
            ],
            [
                6720,
                6922
            ],
            [
                6922,
                7128
            ],
            [
                7128,
                7251
            ],
            [
                7251,
                7524
            ],
            [
                7524,
                7739
            ],
            [
                7739,
                8083
            ],
            [
                8083,
                8288
            ],
            [
                8288,
                8415
            ],
            [
                8415,
                8845
            ],
            [
                8845,
                9048
            ],
            [
                9048,
                9199
            ],
            [
                9199,
                9312
            ],
            [
                9312,
                9436
            ],
            [
                9436,
                9438
            ],
            [
                9438,
                9695
            ],
            [
                9695,
                10203
            ],
            [
                10203,
                10517
            ],
            [
                10517,
                10983
            ],
            [
                10983,
                11013
            ],
            [
                11013,
                11147
            ],
            [
                11147,
                11329
            ],
            [
                11329,
                11644
            ],
            [
                11644,
                11730
            ],
            [
                11730,
                12455
            ],
            [
                12455,
                12970
            ],
            [
                12970,
                13130
            ],
            [
                13130,
                13396
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                285
            ],
            [
                285,
                506
            ],
            [
                506,
                582
            ],
            [
                582,
                689
            ],
            [
                689,
                824
            ],
            [
                824,
                947
            ],
            [
                947,
                1006
            ],
            [
                1006,
                1128
            ],
            [
                1128,
                1241
            ],
            [
                1241,
                1276
            ],
            [
                1276,
                1420
            ],
            [
                1420,
                1572
            ],
            [
                1572,
                1593
            ],
            [
                1593,
                1696
            ],
            [
                1696,
                1743
            ],
            [
                1743,
                1781
            ],
            [
                1781,
                1902
            ],
            [
                1902,
                2035
            ],
            [
                2035,
                2193
            ],
            [
                2193,
                2375
            ],
            [
                2375,
                2501
            ],
            [
                2501,
                2631
            ],
            [
                2631,
                2648
            ],
            [
                2648,
                2664
            ],
            [
                2664,
                2712
            ],
            [
                2712,
                2740
            ],
            [
                2740,
                2836
            ],
            [
                2836,
                2934
            ],
            [
                2934,
                3015
            ],
            [
                3015,
                3132
            ],
            [
                3132,
                3166
            ],
            [
                3166,
                3318
            ],
            [
                3318,
                3380
            ],
            [
                3380,
                3455
            ],
            [
                3455,
                3498
            ],
            [
                3498,
                3561
            ],
            [
                3561,
                3692
            ],
            [
                3692,
                3918
            ],
            [
                3918,
                4098
            ],
            [
                4098,
                4310
            ],
            [
                4310,
                4399
            ],
            [
                4399,
                4460
            ],
            [
                4460,
                4555
            ],
            [
                4555,
                4641
            ],
            [
                4641,
                4814
            ],
            [
                4814,
                4953
            ],
            [
                4953,
                5012
            ],
            [
                5012,
                5072
            ],
            [
                5072,
                5184
            ],
            [
                5184,
                5328
            ],
            [
                5328,
                5357
            ],
            [
                5357,
                5382
            ],
            [
                5382,
                5526
            ],
            [
                5526,
                5620
            ],
            [
                5620,
                5710
            ],
            [
                5710,
                5763
            ],
            [
                5763,
                5930
            ],
            [
                5930,
                5964
            ],
            [
                5964,
                6059
            ],
            [
                6059,
                6191
            ],
            [
                6191,
                6236
            ],
            [
                6236,
                6257
            ],
            [
                6257,
                6408
            ],
            [
                6408,
                6502
            ],
            [
                6502,
                6521
            ],
            [
                6521,
                6595
            ],
            [
                6595,
                6658
            ],
            [
                6658,
                6720
            ],
            [
                6720,
                6848
            ],
            [
                6848,
                6922
            ],
            [
                6922,
                6959
            ],
            [
                6959,
                6998
            ],
            [
                6998,
                7128
            ],
            [
                7128,
                7251
            ],
            [
                7251,
                7378
            ],
            [
                7378,
                7524
            ],
            [
                7524,
                7629
            ],
            [
                7629,
                7703
            ],
            [
                7703,
                7739
            ],
            [
                7739,
                7771
            ],
            [
                7771,
                7802
            ],
            [
                7802,
                7809
            ],
            [
                7809,
                7839
            ],
            [
                7839,
                7893
            ],
            [
                7893,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                8083
            ],
            [
                8083,
                8135
            ],
            [
                8135,
                8194
            ],
            [
                8194,
                8288
            ],
            [
                8288,
                8328
            ],
            [
                8328,
                8374
            ],
            [
                8374,
                8415
            ],
            [
                8415,
                8599
            ],
            [
                8599,
                8703
            ],
            [
                8703,
                8845
            ],
            [
                8845,
                9048
            ],
            [
                9048,
                9170
            ],
            [
                9170,
                9199
            ],
            [
                9199,
                9312
            ],
            [
                9312,
                9436
            ],
            [
                9436,
                9438
            ],
            [
                9438,
                9520
            ],
            [
                9520,
                9559
            ],
            [
                9559,
                9602
            ],
            [
                9602,
                9695
            ],
            [
                9695,
                9876
            ],
            [
                9876,
                10011
            ],
            [
                10011,
                10065
            ],
            [
                10065,
                10203
            ],
            [
                10203,
                10248
            ],
            [
                10248,
                10273
            ],
            [
                10273,
                10345
            ],
            [
                10345,
                10517
            ],
            [
                10517,
                10588
            ],
            [
                10588,
                10628
            ],
            [
                10628,
                10694
            ],
            [
                10694,
                10782
            ],
            [
                10782,
                10814
            ],
            [
                10814,
                10871
            ],
            [
                10871,
                10983
            ],
            [
                10983,
                11001
            ],
            [
                11001,
                11013
            ],
            [
                11013,
                11109
            ],
            [
                11109,
                11147
            ],
            [
                11147,
                11329
            ],
            [
                11329,
                11359
            ],
            [
                11359,
                11471
            ],
            [
                11471,
                11644
            ],
            [
                11644,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11833
            ],
            [
                11833,
                11877
            ],
            [
                11877,
                12034
            ],
            [
                12034,
                12079
            ],
            [
                12079,
                12123
            ],
            [
                12123,
                12215
            ],
            [
                12215,
                12234
            ],
            [
                12234,
                12257
            ],
            [
                12257,
                12333
            ],
            [
                12333,
                12455
            ],
            [
                12455,
                12566
            ],
            [
                12566,
                12619
            ],
            [
                12619,
                12803
            ],
            [
                12803,
                12970
            ],
            [
                12970,
                13130
            ],
            [
                13130,
                13306
            ],
            [
                13306,
                13396
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                62,
                118
            ],
            [
                126,
                165
            ],
            [
                166,
                210
            ],
            [
                210,
                211
            ],
            [
                212,
                235
            ],
            [
                237,
                250
            ],
            [
                255,
                257
            ],
            [
                258,
                262
            ],
            [
                263,
                267
            ],
            [
                273,
                285
            ],
            [
                285,
                295
            ],
            [
                296,
                298
            ],
            [
                299,
                302
            ],
            [
                303,
                310
            ],
            [
                311,
                317
            ],
            [
                317,
                337
            ],
            [
                343,
                345
            ],
            [
                352,
                355
            ],
            [
                356,
                360
            ],
            [
                361,
                368
            ],
            [
                369,
                409
            ],
            [
                410,
                414
            ],
            [
                415,
                430
            ],
            [
                441,
                443
            ],
            [
                450,
                452
            ],
            [
                453,
                489
            ],
            [
                490,
                506
            ],
            [
                506,
                507
            ],
            [
                517,
                527
            ],
            [
                528,
                531
            ],
            [
                540,
                546
            ],
            [
                555,
                580
            ],
            [
                582,
                668
            ],
            [
                669,
                679
            ],
            [
                680,
                687
            ],
            [
                687,
                688
            ],
            [
                689,
                704
            ],
            [
                705,
                727
            ],
            [
                727,
                728
            ],
            [
                729,
                732
            ],
            [
                738,
                780
            ],
            [
                786,
                801
            ],
            [
                802,
                822
            ],
            [
                830,
                856
            ],
            [
                857,
                860
            ],
            [
                868,
                926
            ],
            [
                927,
                930
            ],
            [
                931,
                936
            ],
            [
                937,
                945
            ],
            [
                945,
                947
            ],
            [
                947,
                951
            ],
            [
                952,
                957
            ],
            [
                958,
                967
            ],
            [
                968,
                1006
            ],
            [
                1006,
                1078
            ],
            [
                1079,
                1096
            ],
            [
                1097,
                1128
            ],
            [
                1128,
                1139
            ],
            [
                1142,
                1157
            ],
            [
                1158,
                1164
            ],
            [
                1164,
                1165
            ],
            [
                1166,
                1190
            ],
            [
                1191,
                1196
            ],
            [
                1197,
                1240
            ],
            [
                1241,
                1248
            ],
            [
                1249,
                1254
            ],
            [
                1255,
                1260
            ],
            [
                1261,
                1274
            ],
            [
                1274,
                1276
            ],
            [
                1276,
                1310
            ],
            [
                1315,
                1339
            ],
            [
                1344,
                1361
            ],
            [
                1374,
                1418
            ],
            [
                1418,
                1420
            ],
            [
                1420,
                1483
            ],
            [
                1484,
                1491
            ],
            [
                1492,
                1495
            ],
            [
                1495,
                1496
            ],
            [
                1501,
                1557
            ],
            [
                1558,
                1572
            ],
            [
                1572,
                1593
            ],
            [
                1593,
                1600
            ],
            [
                1601,
                1625
            ],
            [
                1628,
                1648
            ],
            [
                1649,
                1696
            ],
            [
                1696,
                1718
            ],
            [
                1724,
                1743
            ],
            [
                1743,
                1781
            ],
            [
                1781,
                1784
            ],
            [
                1785,
                1845
            ],
            [
                1845,
                1846
            ],
            [
                1847,
                1850
            ],
            [
                1851,
                1896
            ],
            [
                1900,
                1902
            ],
            [
                1902,
                1928
            ],
            [
                1936,
                1977
            ],
            [
                2003,
                2006
            ],
            [
                2007,
                2013
            ],
            [
                2014,
                2035
            ],
            [
                2035,
                2046
            ],
            [
                2055,
                2059
            ],
            [
                2068,
                2179
            ],
            [
                2180,
                2193
            ],
            [
                2193,
                2237
            ],
            [
                2237,
                2278
            ],
            [
                2278,
                2296
            ],
            [
                2297,
                2312
            ],
            [
                2313,
                2338
            ],
            [
                2339,
                2356
            ],
            [
                2370,
                2373
            ],
            [
                2373,
                2375
            ],
            [
                2375,
                2491
            ],
            [
                2492,
                2501
            ],
            [
                2501,
                2563
            ],
            [
                2568,
                2618
            ],
            [
                2619,
                2630
            ],
            [
                2631,
                2648
            ],
            [
                2648,
                2664
            ],
            [
                2664,
                2712
            ],
            [
                2712,
                2739
            ],
            [
                2740,
                2799
            ],
            [
                2800,
                2818
            ],
            [
                2836,
                2842
            ],
            [
                2843,
                2855
            ],
            [
                2856,
                2863
            ],
            [
                2870,
                2914
            ],
            [
                2915,
                2934
            ],
            [
                2934,
                2955
            ],
            [
                2957,
                3014
            ],
            [
                3015,
                3061
            ],
            [
                3076,
                3132
            ],
            [
                3132,
                3166
            ],
            [
                3166,
                3177
            ],
            [
                3178,
                3180
            ],
            [
                3200,
                3201
            ],
            [
                3202,
                3235
            ],
            [
                3238,
                3264
            ],
            [
                3268,
                3318
            ],
            [
                3318,
                3378
            ],
            [
                3378,
                3380
            ],
            [
                3391,
                3455
            ],
            [
                3455,
                3469
            ],
            [
                3469,
                3497
            ],
            [
                3500,
                3510
            ],
            [
                3517,
                3518
            ],
            [
                3519,
                3524
            ],
            [
                3524,
                3559
            ],
            [
                3559,
                3561
            ],
            [
                3568,
                3573
            ],
            [
                3574,
                3580
            ],
            [
                3597,
                3600
            ],
            [
                3631,
                3632
            ],
            [
                3633,
                3635
            ],
            [
                3646,
                3669
            ],
            [
                3674,
                3690
            ],
            [
                3690,
                3691
            ],
            [
                3692,
                3696
            ],
            [
                3697,
                3708
            ],
            [
                3711,
                3718
            ],
            [
                3718,
                3755
            ],
            [
                3756,
                3768
            ],
            [
                3769,
                3771
            ],
            [
                3772,
                3803
            ],
            [
                3804,
                3846
            ],
            [
                3850,
                3866
            ],
            [
                3867,
                3878
            ],
            [
                3879,
                3886
            ],
            [
                3892,
                3894
            ],
            [
                3895,
                3897
            ],
            [
                3898,
                3916
            ],
            [
                3916,
                3918
            ],
            [
                3918,
                3956
            ],
            [
                3961,
                3967
            ],
            [
                3968,
                3983
            ],
            [
                3987,
                3999
            ],
            [
                4000,
                4024
            ],
            [
                4024,
                4025
            ],
            [
                4026,
                4030
            ],
            [
                4030,
                4031
            ],
            [
                4032,
                4066
            ],
            [
                4068,
                4096
            ],
            [
                4096,
                4098
            ],
            [
                4109,
                4167
            ],
            [
                4167,
                4194
            ],
            [
                4195,
                4310
            ],
            [
                4313,
                4331
            ],
            [
                4332,
                4338
            ],
            [
                4339,
                4365
            ],
            [
                4366,
                4397
            ],
            [
                4397,
                4399
            ],
            [
                4399,
                4434
            ],
            [
                4434,
                4458
            ],
            [
                4458,
                4460
            ],
            [
                4460,
                4496
            ],
            [
                4500,
                4505
            ],
            [
                4506,
                4535
            ],
            [
                4544,
                4555
            ],
            [
                4555,
                4613
            ],
            [
                4614,
                4617
            ],
            [
                4618,
                4632
            ],
            [
                4639,
                4641
            ],
            [
                4641,
                4663
            ],
            [
                4664,
                4680
            ],
            [
                4681,
                4685
            ],
            [
                4693,
                4696
            ],
            [
                4700,
                4702
            ],
            [
                4710,
                4734
            ],
            [
                4735,
                4783
            ],
            [
                4784,
                4790
            ],
            [
                4790,
                4814
            ],
            [
                4814,
                4832
            ],
            [
                4842,
                4882
            ],
            [
                4883,
                4931
            ],
            [
                4941,
                4947
            ],
            [
                4948,
                4953
            ],
            [
                4953,
                5002
            ],
            [
                5008,
                5010
            ],
            [
                5012,
                5052
            ],
            [
                5053,
                5057
            ],
            [
                5058,
                5072
            ],
            [
                5072,
                5127
            ],
            [
                5131,
                5138
            ],
            [
                5139,
                5168
            ],
            [
                5169,
                5176
            ],
            [
                5177,
                5182
            ],
            [
                5185,
                5221
            ],
            [
                5222,
                5328
            ],
            [
                5328,
                5357
            ],
            [
                5357,
                5365
            ],
            [
                5366,
                5382
            ],
            [
                5382,
                5388
            ],
            [
                5389,
                5414
            ],
            [
                5415,
                5432
            ],
            [
                5432,
                5437
            ],
            [
                5438,
                5524
            ],
            [
                5524,
                5525
            ],
            [
                5526,
                5534
            ],
            [
                5534,
                5546
            ],
            [
                5547,
                5591
            ],
            [
                5592,
                5617
            ],
            [
                5620,
                5710
            ],
            [
                5710,
                5761
            ],
            [
                5761,
                5763
            ],
            [
                5763,
                5836
            ],
            [
                5836,
                5879
            ],
            [
                5880,
                5891
            ],
            [
                5892,
                5896
            ],
            [
                5899,
                5929
            ],
            [
                5936,
                5939
            ],
            [
                5940,
                5964
            ],
            [
                5964,
                6003
            ],
            [
                6003,
                6010
            ],
            [
                6011,
                6012
            ],
            [
                6019,
                6039
            ],
            [
                6047,
                6057
            ],
            [
                6057,
                6059
            ],
            [
                6059,
                6107
            ],
            [
                6108,
                6131
            ],
            [
                6142,
                6191
            ],
            [
                6191,
                6234
            ],
            [
                6236,
                6255
            ],
            [
                6255,
                6257
            ],
            [
                6257,
                6262
            ],
            [
                6265,
                6271
            ],
            [
                6272,
                6294
            ],
            [
                6295,
                6408
            ],
            [
                6408,
                6436
            ],
            [
                6439,
                6502
            ],
            [
                6502,
                6521
            ],
            [
                6521,
                6552
            ],
            [
                6559,
                6567
            ],
            [
                6570,
                6595
            ],
            [
                6595,
                6614
            ],
            [
                6614,
                6658
            ],
            [
                6658,
                6672
            ],
            [
                6681,
                6699
            ],
            [
                6700,
                6720
            ],
            [
                6720,
                6792
            ],
            [
                6793,
                6800
            ],
            [
                6803,
                6807
            ],
            [
                6808,
                6811
            ],
            [
                6812,
                6815
            ],
            [
                6825,
                6830
            ],
            [
                6834,
                6837
            ],
            [
                6838,
                6846
            ],
            [
                6846,
                6848
            ],
            [
                6848,
                6849
            ],
            [
                6849,
                6922
            ],
            [
                6923,
                6959
            ],
            [
                6959,
                6980
            ],
            [
                6980,
                6998
            ],
            [
                6998,
                7016
            ],
            [
                7019,
                7043
            ],
            [
                7053,
                7077
            ],
            [
                7078,
                7084
            ],
            [
                7085,
                7125
            ],
            [
                7128,
                7138
            ],
            [
                7139,
                7190
            ],
            [
                7191,
                7197
            ],
            [
                7198,
                7204
            ],
            [
                7205,
                7250
            ],
            [
                7251,
                7257
            ],
            [
                7265,
                7286
            ],
            [
                7287,
                7320
            ],
            [
                7320,
                7336
            ],
            [
                7336,
                7377
            ],
            [
                7378,
                7468
            ],
            [
                7469,
                7524
            ],
            [
                7524,
                7629
            ],
            [
                7629,
                7703
            ],
            [
                7703,
                7712
            ],
            [
                7718,
                7739
            ],
            [
                7739,
                7771
            ],
            [
                7771,
                7802
            ],
            [
                7802,
                7809
            ],
            [
                7809,
                7839
            ],
            [
                7839,
                7860
            ],
            [
                7861,
                7865
            ],
            [
                7866,
                7874
            ],
            [
                7875,
                7879
            ],
            [
                7879,
                7880
            ],
            [
                7880,
                7893
            ],
            [
                7893,
                7897
            ],
            [
                7898,
                7903
            ],
            [
                7904,
                7935
            ],
            [
                7935,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                8014
            ],
            [
                8015,
                8017
            ],
            [
                8023,
                8060
            ],
            [
                8061,
                8083
            ],
            [
                8083,
                8135
            ],
            [
                8135,
                8194
            ],
            [
                8194,
                8206
            ],
            [
                8207,
                8288
            ],
            [
                8288,
                8289
            ],
            [
                8289,
                8290
            ],
            [
                8291,
                8297
            ],
            [
                8298,
                8307
            ],
            [
                8307,
                8326
            ],
            [
                8326,
                8328
            ],
            [
                8329,
                8374
            ],
            [
                8374,
                8412
            ],
            [
                8415,
                8416
            ],
            [
                8416,
                8512
            ],
            [
                8513,
                8599
            ],
            [
                8599,
                8703
            ],
            [
                8703,
                8771
            ],
            [
                8771,
                8845
            ],
            [
                8845,
                8937
            ],
            [
                8937,
                8966
            ],
            [
                8967,
                9029
            ],
            [
                9030,
                9046
            ],
            [
                9046,
                9048
            ],
            [
                9048,
                9114
            ],
            [
                9115,
                9170
            ],
            [
                9170,
                9172
            ],
            [
                9173,
                9198
            ],
            [
                9199,
                9310
            ],
            [
                9310,
                9312
            ],
            [
                9312,
                9319
            ],
            [
                9320,
                9377
            ],
            [
                9378,
                9400
            ],
            [
                9401,
                9421
            ],
            [
                9422,
                9436
            ],
            [
                9438,
                9520
            ],
            [
                9520,
                9559
            ],
            [
                9559,
                9602
            ],
            [
                9602,
                9661
            ],
            [
                9669,
                9695
            ],
            [
                9695,
                9702
            ],
            [
                9711,
                9727
            ],
            [
                9739,
                9751
            ],
            [
                9775,
                9783
            ],
            [
                9784,
                9802
            ],
            [
                9806,
                9876
            ],
            [
                9876,
                9900
            ],
            [
                9910,
                9957
            ],
            [
                9957,
                9958
            ],
            [
                9959,
                10011
            ],
            [
                10011,
                10026
            ],
            [
                10027,
                10065
            ],
            [
                10065,
                10068
            ],
            [
                10069,
                10072
            ],
            [
                10073,
                10077
            ],
            [
                10083,
                10089
            ],
            [
                10089,
                10149
            ],
            [
                10149,
                10164
            ],
            [
                10165,
                10173
            ],
            [
                10179,
                10202
            ],
            [
                10203,
                10212
            ],
            [
                10215,
                10229
            ],
            [
                10232,
                10248
            ],
            [
                10248,
                10273
            ],
            [
                10273,
                10277
            ],
            [
                10278,
                10283
            ],
            [
                10287,
                10292
            ],
            [
                10293,
                10301
            ],
            [
                10302,
                10308
            ],
            [
                10309,
                10325
            ],
            [
                10326,
                10345
            ],
            [
                10345,
                10360
            ],
            [
                10361,
                10371
            ],
            [
                10372,
                10396
            ],
            [
                10397,
                10410
            ],
            [
                10411,
                10457
            ],
            [
                10457,
                10458
            ],
            [
                10459,
                10463
            ],
            [
                10479,
                10516
            ],
            [
                10517,
                10542
            ],
            [
                10543,
                10548
            ],
            [
                10549,
                10554
            ],
            [
                10554,
                10588
            ],
            [
                10588,
                10626
            ],
            [
                10626,
                10628
            ],
            [
                10628,
                10694
            ],
            [
                10694,
                10782
            ],
            [
                10782,
                10814
            ],
            [
                10814,
                10848
            ],
            [
                10851,
                10871
            ],
            [
                10871,
                10905
            ],
            [
                10906,
                10935
            ],
            [
                10945,
                10973
            ],
            [
                10980,
                10983
            ],
            [
                10983,
                11001
            ],
            [
                11001,
                11011
            ],
            [
                11011,
                11013
            ],
            [
                11013,
                11017
            ],
            [
                11017,
                11018
            ],
            [
                11019,
                11037
            ],
            [
                11038,
                11069
            ],
            [
                11069,
                11107
            ],
            [
                11107,
                11109
            ],
            [
                11109,
                11127
            ],
            [
                11132,
                11136
            ],
            [
                11147,
                11246
            ],
            [
                11247,
                11276
            ],
            [
                11277,
                11329
            ],
            [
                11329,
                11359
            ],
            [
                11359,
                11387
            ],
            [
                11390,
                11403
            ],
            [
                11408,
                11471
            ],
            [
                11471,
                11569
            ],
            [
                11576,
                11620
            ],
            [
                11621,
                11644
            ],
            [
                11644,
                11656
            ],
            [
                11661,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11833
            ],
            [
                11833,
                11849
            ],
            [
                11850,
                11877
            ],
            [
                11877,
                11917
            ],
            [
                11933,
                11941
            ],
            [
                11948,
                11958
            ],
            [
                11972,
                11973
            ],
            [
                11979,
                12004
            ],
            [
                12009,
                12032
            ],
            [
                12032,
                12034
            ],
            [
                12034,
                12049
            ],
            [
                12050,
                12064
            ],
            [
                12065,
                12072
            ],
            [
                12077,
                12079
            ],
            [
                12079,
                12123
            ],
            [
                12123,
                12192
            ],
            [
                12193,
                12213
            ],
            [
                12213,
                12215
            ],
            [
                12215,
                12234
            ],
            [
                12234,
                12257
            ],
            [
                12257,
                12333
            ],
            [
                12333,
                12455
            ],
            [
                12455,
                12481
            ],
            [
                12482,
                12531
            ],
            [
                12531,
                12542
            ],
            [
                12543,
                12566
            ],
            [
                12566,
                12606
            ],
            [
                12607,
                12619
            ],
            [
                12619,
                12638
            ],
            [
                12639,
                12642
            ],
            [
                12643,
                12661
            ],
            [
                12661,
                12673
            ],
            [
                12674,
                12711
            ],
            [
                12712,
                12757
            ],
            [
                12758,
                12769
            ],
            [
                12770,
                12803
            ],
            [
                12803,
                12858
            ],
            [
                12859,
                12862
            ],
            [
                12863,
                12869
            ],
            [
                12869,
                12874
            ],
            [
                12880,
                12935
            ],
            [
                12935,
                12970
            ],
            [
                12970,
                12999
            ],
            [
                13000,
                13002
            ],
            [
                13003,
                13007
            ],
            [
                13008,
                13024
            ],
            [
                13024,
                13025
            ],
            [
                13026,
                13087
            ],
            [
                13090,
                13110
            ],
            [
                13111,
                13115
            ],
            [
                13116,
                13128
            ],
            [
                13128,
                13130
            ],
            [
                13130,
                13167
            ],
            [
                13170,
                13246
            ],
            [
                13249,
                13306
            ],
            [
                13306,
                13324
            ],
            [
                13332,
                13396
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                285
            ],
            [
                285,
                506
            ],
            [
                506,
                582
            ],
            [
                582,
                582
            ],
            [
                582,
                947
            ],
            [
                947,
                1006
            ],
            [
                1006,
                1128
            ],
            [
                1128,
                1241
            ],
            [
                1241,
                1276
            ],
            [
                1276,
                1420
            ],
            [
                1420,
                1572
            ],
            [
                1572,
                1593
            ],
            [
                1593,
                1696
            ],
            [
                1696,
                1743
            ],
            [
                1743,
                1781
            ],
            [
                1781,
                1902
            ],
            [
                1902,
                2035
            ],
            [
                2035,
                2193
            ],
            [
                2193,
                2375
            ],
            [
                2375,
                2501
            ],
            [
                2501,
                2631
            ],
            [
                2631,
                2648
            ],
            [
                2648,
                2664
            ],
            [
                2664,
                2712
            ],
            [
                2712,
                2740
            ],
            [
                2740,
                2740
            ],
            [
                2740,
                2934
            ],
            [
                2934,
                2934
            ],
            [
                2934,
                3015
            ],
            [
                3015,
                3132
            ],
            [
                3132,
                3166
            ],
            [
                3166,
                3318
            ],
            [
                3318,
                3380
            ],
            [
                3380,
                3455
            ],
            [
                3455,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3692
            ],
            [
                3692,
                3692
            ],
            [
                3692,
                3918
            ],
            [
                3918,
                4098
            ],
            [
                4098,
                4098
            ],
            [
                4098,
                4310
            ],
            [
                4310,
                4399
            ],
            [
                4399,
                4460
            ],
            [
                4460,
                4555
            ],
            [
                4555,
                4641
            ],
            [
                4641,
                4814
            ],
            [
                4814,
                4953
            ],
            [
                4953,
                5012
            ],
            [
                5012,
                5072
            ],
            [
                5072,
                5184
            ],
            [
                5184,
                5184
            ],
            [
                5184,
                5328
            ],
            [
                5328,
                5357
            ],
            [
                5357,
                5382
            ],
            [
                5382,
                5620
            ],
            [
                5620,
                5620
            ],
            [
                5620,
                5620
            ],
            [
                5620,
                5620
            ],
            [
                5620,
                5710
            ],
            [
                5710,
                5763
            ],
            [
                5763,
                5964
            ],
            [
                5964,
                6059
            ],
            [
                6059,
                6191
            ],
            [
                6191,
                6191
            ],
            [
                6191,
                6236
            ],
            [
                6236,
                6257
            ],
            [
                6257,
                6408
            ],
            [
                6408,
                6502
            ],
            [
                6502,
                6502
            ],
            [
                6502,
                6521
            ],
            [
                6521,
                6595
            ],
            [
                6595,
                6658
            ],
            [
                6658,
                6658
            ],
            [
                6658,
                6720
            ],
            [
                6720,
                6848
            ],
            [
                6848,
                6922
            ],
            [
                6922,
                6922
            ],
            [
                6922,
                6959
            ],
            [
                6959,
                6998
            ],
            [
                6998,
                7128
            ],
            [
                7128,
                7251
            ],
            [
                7251,
                7251
            ],
            [
                7251,
                7378
            ],
            [
                7378,
                7524
            ],
            [
                7524,
                7629
            ],
            [
                7629,
                7703
            ],
            [
                7703,
                7739
            ],
            [
                7739,
                7771
            ],
            [
                7771,
                7802
            ],
            [
                7802,
                7809
            ],
            [
                7809,
                7839
            ],
            [
                7839,
                7893
            ],
            [
                7893,
                7937
            ],
            [
                7937,
                7937
            ],
            [
                7937,
                7974
            ],
            [
                7974,
                7974
            ],
            [
                7974,
                8083
            ],
            [
                8083,
                8135
            ],
            [
                8135,
                8194
            ],
            [
                8194,
                8288
            ],
            [
                8288,
                8328
            ],
            [
                8328,
                8374
            ],
            [
                8374,
                8415
            ],
            [
                8415,
                8415
            ],
            [
                8415,
                8599
            ],
            [
                8599,
                8599
            ],
            [
                8599,
                8703
            ],
            [
                8703,
                8845
            ],
            [
                8845,
                9048
            ],
            [
                9048,
                9170
            ],
            [
                9170,
                9199
            ],
            [
                9199,
                9312
            ],
            [
                9312,
                9436
            ],
            [
                9436,
                9520
            ],
            [
                9520,
                9559
            ],
            [
                9559,
                9559
            ],
            [
                9559,
                9602
            ],
            [
                9602,
                9695
            ],
            [
                9695,
                9876
            ],
            [
                9876,
                10011
            ],
            [
                10011,
                10011
            ],
            [
                10011,
                10065
            ],
            [
                10065,
                10203
            ],
            [
                10203,
                10248
            ],
            [
                10248,
                10273
            ],
            [
                10273,
                10345
            ],
            [
                10345,
                10517
            ],
            [
                10517,
                10517
            ],
            [
                10517,
                10588
            ],
            [
                10588,
                10628
            ],
            [
                10628,
                10628
            ],
            [
                10628,
                10694
            ],
            [
                10694,
                10782
            ],
            [
                10782,
                10814
            ],
            [
                10814,
                10871
            ],
            [
                10871,
                10983
            ],
            [
                10983,
                11001
            ],
            [
                11001,
                11013
            ],
            [
                11013,
                11109
            ],
            [
                11109,
                11147
            ],
            [
                11147,
                11147
            ],
            [
                11147,
                11329
            ],
            [
                11329,
                11359
            ],
            [
                11359,
                11471
            ],
            [
                11471,
                11644
            ],
            [
                11644,
                11694
            ],
            [
                11694,
                11730
            ],
            [
                11730,
                11833
            ],
            [
                11833,
                11877
            ],
            [
                11877,
                11877
            ],
            [
                11877,
                12034
            ],
            [
                12034,
                12079
            ],
            [
                12079,
                12123
            ],
            [
                12123,
                12123
            ],
            [
                12123,
                12123
            ],
            [
                12123,
                12215
            ],
            [
                12215,
                12234
            ],
            [
                12234,
                12257
            ],
            [
                12257,
                12333
            ],
            [
                12333,
                12455
            ],
            [
                12455,
                12566
            ],
            [
                12566,
                12619
            ],
            [
                12619,
                12803
            ],
            [
                12803,
                12970
            ],
            [
                12970,
                13130
            ],
            [
                13130,
                13306
            ],
            [
                13306,
                13396
            ]
        ]
    }
}