{
    "original": {
        "text": "Love may be felt for any young lady endowed with such qualities as Miss Swartz possessed; and a great dream of ambition entered into old Mr. Osborne's soul, which she was to realize. He encouraged, with the utmost enthusiasm and friendliness, his daughters' amiable attachment to the young heiress, and protested that it gave him the sincerest pleasure as a father to see the love of his girls so well disposed.\n\"You won't find,\" he would say to Miss Rhoda, \"that splendour and rank to which you are accustomed at the West End, my dear Miss, at our humble mansion in Russell Square. My daughters are plain, disinterested girls, but their hearts are in the right place, and they've conceived an attachment for you which does them honour--I say, which does them honour. I'm a plain, simple, humble British merchant--an honest one, as my respected friends Hulker and Bullock will vouch, who were the correspondents of your late lamented father. You'll find us a united, simple, happy, and I think I may say respected, family--a plain table, a plain people, but a warm welcome, my dear Miss Rhoda--Rhoda, let me say, for my heart warms to you, it does really. I'm a frank man, and I like you. A glass of Champagne! Hicks, Champagne to Miss Swartz.\"\nThere is little doubt that old Osborne believed all he said, and that the girls were quite earnest in their protestations of affection for Miss Swartz. People in Vanity Fair fasten on to rich folks quite naturally. If the simplest people are disposed to look not a little kindly on great Prosperity (for I defy any member of the British public to say that the notion of Wealth has not something awful and pleasing to him; and you, if you are told that the man next you at dinner has got half a million, not to look at him with a certain interest)--if the simple look benevolently on money, how much more do your old worldlings regard it! Their affections rush out to meet and welcome money. Their kind sentiments awaken spontaneously towards the interesting possessors of it. I know some respectable people who don't consider themselves at liberty to indulge in friendship for any individual who has not a certain competency, or place in society. They give a loose to their feelings on proper occasions. And the proof is, that the major part of the Osborne family, who had not, in fifteen years, been able to get up a hearty regard for Amelia Sedley, became as fond of Miss Swartz in the course of a single evening as the most romantic advocate of friendship at first sight could desire.\nWhat a match for George she'd be (the sisters and Miss Wirt agreed), and how much better than that insignificant little Amelia! Such a dashing young fellow as he is, with his good looks, rank, and accomplishments, would be the very husband for her. Visions of balls in Portland Place, presentations at Court, and introductions to half the peerage, filled the minds of the young ladies; who talked of nothing but George and his grand acquaintances to their beloved new friend.\nOld Osborne thought she would be a great match, too, for his son. He should leave the army; he should go into Parliament; he should cut a figure in the fashion and in the state. His blood boiled with honest British exultation, as he saw the name of Osborne ennobled in the person of his son, and thought that he might be the progenitor of a glorious line of baronets. He worked in the City and on 'Change, until he knew everything relating to the fortune of the heiress, how her money was placed, and where her estates lay. Young Fred Bullock, one of his chief informants, would have liked to make a bid for her himself (it was so the young banker expressed it), only he was booked to Maria Osborne. But not being able to secure her as a wife, the disinterested Fred quite approved of her as a sister-in-law. \"Let George cut in directly and win her,\" was his advice. \"Strike while the iron's hot, you know--while she's fresh to the town: in a few weeks some d---- fellow from the West End will come in with a title and a rotten rent-roll and cut all us City men out, as Lord Fitzrufus did last year with Miss Grogram, who was actually engaged to Podder, of Podder & Brown's. The sooner it is done the better, Mr. Osborne; them's my sentiments,\" the wag said; though, when Osborne had left the bank parlour, Mr. Bullock remembered Amelia, and what a pretty girl she was, and how attached to George Osborne; and he gave up at least ten seconds of his valuable time to regretting the misfortune which had befallen that unlucky young woman.\nWhile thus George Osborne's good feelings, and his good friend and genius, Dobbin, were carrying back the truant to Amelia's feet, George's parent and sisters were arranging this splendid match for him, which they never dreamed he would resist.\nWhen the elder Osborne gave what he called \"a hint,\" there was no possibility for the most obtuse to mistake his meaning. He called kicking a footman downstairs a hint to the latter to leave his service. With his usual frankness and delicacy he told Mrs. Haggistoun that he would give her a cheque for five thousand pounds on the day his son was married to her ward; and called that proposal a hint, and considered it a very dexterous piece of diplomacy. He gave George finally such another hint regarding the heiress; and ordered him to marry her out of hand, as he would have ordered his butler to draw a cork, or his clerk to write a letter.\nThis imperative hint disturbed George a good deal. He was in the very first enthusiasm and delight of his second courtship of Amelia, which was inexpressibly sweet to him. The contrast of her manners and appearance with those of the heiress, made the idea of a union with the latter appear doubly ludicrous and odious. Carriages and opera-boxes, thought he; fancy being seen in them by the side of such a mahogany charmer as that! Add to all that the junior Osborne was quite as obstinate as the senior: when he wanted a thing, quite as firm in his resolution to get it; and quite as violent when angered, as his father in his most stern moments.\nOn the first day when his father formally gave him the hint that he was to place his affections at Miss Swartz's feet, George temporised with the old gentleman. \"You should have thought of the matter sooner, sir,\" he said. \"It can't be done now, when we're expecting every day to go on foreign service. Wait till my return, if I do return\"; and then he represented, that the time when the regiment was daily expecting to quit England, was exceedingly ill-chosen: that the few days or weeks during which they were still to remain at home, must be devoted to business and not to love-making: time enough for that when he came home with his majority; \"for, I promise you,\" said he, with a satisfied air, \"that one way or other you shall read the name of George Osborne in the Gazette.\"\nThe father's reply to this was founded upon the information which he had got in the City: that the West End chaps would infallibly catch hold of the heiress if any delay took place: that if he didn't marry Miss S., he might at least have an engagement in writing, to come into effect when he returned to England; and that a man who could get ten thousand a year by staying at home, was a fool to risk his life abroad.\n\"So that you would have me shown up as a coward, sir, and our name dishonoured for the sake of Miss Swartz's money,\" George interposed.\nThis remark staggered the old gentleman; but as he had to reply to it, and as his mind was nevertheless made up, he said, \"You will dine here to-morrow, sir, and every day Miss Swartz comes, you will be here to pay your respects to her. If you want for money, call upon Mr. Chopper.\" Thus a new obstacle was in George's way, to interfere with his plans regarding Amelia; and about which he and Dobbin had more than one confidential consultation. His friend's opinion respecting the line of conduct which he ought to pursue, we know already. And as for Osborne, when he was once bent on a thing, a fresh obstacle or two only rendered him the more resolute.\nThe dark object of the conspiracy into which the chiefs of the Osborne family had entered, was quite ignorant of all their plans regarding her (which, strange to say, her friend and chaperon did not divulge), and, taking all the young ladies' flattery for genuine sentiment, and being, as we have before had occasion to show, of a very warm and impetuous nature, responded to their affection with quite a tropical ardour. And if the truth may be told, I dare say that she too had some selfish attraction in the Russell Square house; and in a word, thought George Osborne a very nice young man. His whiskers had made an impression upon her, on the very first night she beheld them at the ball at Messrs. Hulkers; and, as we know, she was not the first woman who had been charmed by them. George had an air at once swaggering and melancholy, languid and fierce. He looked like a man who had passions, secrets, and private harrowing griefs and adventures. His voice was rich and deep. He would say it was a warm evening, or ask his partner to take an ice, with a tone as sad and confidential as if he were breaking her mother's death to her, or preluding a declaration of love. He trampled over all the young bucks of his father's circle, and was the hero among those third-rate men. Some few sneered at him and hated him. Some, like Dobbin, fanatically admired him. And his whiskers had begun to do their work, and to curl themselves round the affections of Miss Swartz.\nWhenever there was a chance of meeting him in Russell Square, that simple and good-natured young woman was quite in a flurry to see her dear Misses Osborne. She went to great expenses in new gowns, and bracelets, and bonnets, and in prodigious feathers. She adorned her person with her utmost skill to please the Conqueror, and exhibited all her simple accomplishments to win his favour. The girls would ask her, with the greatest gravity, for a little music, and she would sing her three songs and play her two little pieces as often as ever they asked, and with an always increasing pleasure to herself. During these delectable entertainments, Miss Wirt and the chaperon sate by, and conned over the peerage, and talked about the nobility.\nThe day after George had his hint from his father, and a short time before the hour of dinner, he was lolling upon a sofa in the drawing-room in a very becoming and perfectly natural attitude of melancholy. He had been, at his father's request, to Mr. Chopper in the City (the old gentleman, though he gave great sums to his son, would never specify any fixed allowance for him, and rewarded him only as he was in the humour). He had then been to pass three hours with Amelia, his dear little Amelia, at Fulham; and he came home to find his sisters spread in starched muslin in the drawing-room, the dowagers cackling in the background, and honest Swartz in her favourite amber-coloured satin, with turquoise bracelets, countless rings, flowers, feathers, and all sorts of tags and gimcracks, about as elegantly decorated as a she chimney-sweep on May-day.\nThe girls, after vain attempts to engage him in conversation, talked about fashions and the last drawing-room until he was perfectly sick of their chatter. He contrasted their behaviour with little Emmy's--their shrill voices with her tender ringing tones; their attitudes and their elbows and their starch, with her humble soft movements and modest graces. Poor Swartz was seated in a place where Emmy had been accustomed to sit. Her bejewelled hands lay sprawling in her amber satin lap. Her tags and ear-rings twinkled, and her big eyes rolled about. She was doing nothing with perfect contentment, and thinking herself charming. Anything so becoming as the satin the sisters had never seen.\n\"Dammy,\" George said to a confidential friend, \"she looked like a China doll, which has nothing to do all day but to grin and wag its head. By Jove, Will, it was all I I could do to prevent myself from throwing the sofa-cushion at her.\" He restrained that exhibition of sentiment, however.\nThe sisters began to play the Battle of Prague. \"Stop that d---- thing,\" George howled out in a fury from the sofa. \"It makes me mad. You play us something, Miss Swartz, do. Sing something, anything but the Battle of Prague.\"\n\"Shall I sing 'Blue Eyed Mary' or the air from the Cabinet?\" Miss Swartz asked.\n\"That sweet thing from the Cabinet,\" the sisters said.\n\"We've had that,\" replied the misanthrope on the sofa.\n\"I can sing 'Fluvy du Tajy,'\" Swartz said, in a meek voice, \"if I had the words.\" It was the last of the worthy young woman's collection.\n\"O, 'Fleuve du Tage,'\" Miss Maria cried; \"we have the song,\" and went off to fetch the book in which it was.\nNow it happened that this song, then in the height of the fashion, had been given to the young ladies by a young friend of theirs, whose name was on the title, and Miss Swartz, having concluded the ditty with George's applause (for he remembered that it was a favourite of Amelia's), was hoping for an encore perhaps, and fiddling with the leaves of the music, when her eye fell upon the title, and she saw \"Amelia Sedley\" written in the comer.\n\"Lor!\" cried Miss Swartz, spinning swiftly round on the music-stool, \"is it my Amelia? Amelia that was at Miss P.'s at Hammersmith? I know it is. It's her, and-- Tell me about her--where is she?\"\n\"Don't mention her,\" Miss Maria Osborne said hastily. \"Her family has disgraced itself. Her father cheated Papa, and as for her, she is never to be mentioned HERE.\" This was Miss Maria's return for George's rudeness about the Battle of Prague.\n\"Are you a friend of Amelia's?\" George said, bouncing up. \"God bless you for it, Miss Swartz. Don't believe what the girls say. SHE'S not to blame at any rate. She's the best--\"\n\"You know you're not to speak about her, George,\" cried Jane. \"Papa forbids it.\"\n\"Who's to prevent me?\" George cried out. \"I will speak of her. I say she's the best, the kindest, the gentlest, the sweetest girl in England; and that, bankrupt or no, my sisters are not fit to hold candles to her. If you like her, go and see her, Miss Swartz; she wants friends now; and I say, God bless everybody who befriends her. Anybody who speaks kindly of her is my friend; anybody who speaks against her is my enemy. Thank you, Miss Swartz\"; and he went up and wrung her hand.\n\"George! George!\" one of the sisters cried imploringly.\n\"I say,\" George said fiercely, \"I thank everybody who loves Amelia Sed--\" He stopped. Old Osborne was in the room with a face livid with rage, and eyes like hot coals.\nThough George had stopped in his sentence, yet, his blood being up, he was not to be cowed by all the generations of Osborne; rallying instantly, he replied to the bullying look of his father, with another so indicative of resolution and defiance that the elder man quailed in his turn, and looked away. He felt that the tussle was coming. \"Mrs. Haggistoun, let me take you down to dinner,\" he said. \"Give your arm to Miss Swartz, George,\" and they marched.\n\"Miss Swartz, I love Amelia, and we've been engaged almost all our lives,\" Osborne said to his partner; and during all the dinner, George rattled on with a volubility which surprised himself, and made his father doubly nervous for the fight which was to take place as soon as the ladies were gone.\nThe difference between the pair was, that while the father was violent and a bully, the son had thrice the nerve and courage of the parent, and could not merely make an attack, but resist it; and finding that the moment was now come when the contest between him and his father was to be decided, he took his dinner with perfect coolness and appetite before the engagement began. Old Osborne, on the contrary, was nervous, and drank much. He floundered in his conversation with the ladies, his neighbours: George's coolness only rendering him more angry. It made him half mad to see the calm way in which George, flapping his napkin, and with a swaggering bow, opened the door for the ladies to leave the room; and filling himself a glass of wine, smacked it, and looked his father full in the face, as if to say, \"Gentlemen of the Guard, fire first.\" The old man also took a supply of ammunition, but his decanter clinked against the glass as he tried to fill it.\nAfter giving a great heave, and with a purple choking face, he then began. \"How dare you, sir, mention that person's name before Miss Swartz to-day, in my drawing-room? I ask you, sir, how dare you do it?\"\n\"Stop, sir,\" says George, \"don't say dare, sir. Dare isn't a word to be used to a Captain in the British Army.\"\n\"I shall say what I like to my son, sir. I can cut him off with a shilling if I like. I can make him a beggar if I like. I WILL say what I like,\" the elder said.\n\"I'm a gentleman though I AM your son, sir,\" George answered haughtily. \"Any communications which you have to make to me, or any orders which you may please to give, I beg may be couched in that kind of language which I am accustomed to hear.\"\nWhenever the lad assumed his haughty manner, it always created either great awe or great irritation in the parent. Old Osborne stood in secret terror of his son as a better gentleman than himself; and perhaps my readers may have remarked in their experience of this Vanity Fair of ours, that there is no character which a low-minded man so much mistrusts as that of a gentleman.\n\"My father didn't give me the education you have had, nor the advantages you have had, nor the money you have had. If I had kept the company SOME FOLKS have had through MY MEANS, perhaps my son wouldn't have any reason to brag, sir, of his SUPERIORITY and WEST END AIRS (these words were uttered in the elder Osborne's most sarcastic tones). But it wasn't considered the part of a gentleman, in MY time, for a man to insult his father. If I'd done any such thing, mine would have kicked me downstairs, sir.\"\n\"I never insulted you, sir. I said I begged you to remember your son was a gentleman as well as yourself. I know very well that you give me plenty of money,\" said George (fingering a bundle of notes which he had got in the morning from Mr. Chopper). \"You tell it me often enough, sir. There's no fear of my forgetting it.\"\n\"I wish you'd remember other things as well, sir,\" the sire answered. \"I wish you'd remember that in this house--so long as you choose to HONOUR it with your COMPANY, Captain--I'm the master, and that name, and that that--that you--that I say--\"\n\"That what, sir?\" George asked, with scarcely a sneer, filling another glass of claret.\n\"----!\" burst out his father with a screaming oath--\"that the name of those Sedleys never be mentioned here, sir--not one of the whole damned lot of 'em, sir.\"\n\"It wasn't I, sir, that introduced Miss Sedley's name. It was my sisters who spoke ill of her to Miss Swartz; and by Jove I'll defend her wherever I go. Nobody shall speak lightly of that name in my presence. Our family has done her quite enough injury already, I think, and may leave off reviling her now she's down. I'll shoot any man but you who says a word against her.\"\n\"Go on, sir, go on,\" the old gentleman said, his eyes starting out of his head.\n\"Go on about what, sir? about the way in which we've treated that angel of a girl? Who told me to love her? It was your doing. I might have chosen elsewhere, and looked higher, perhaps, than your society: but I obeyed you. And now that her heart's mine you give me orders to fling it away, and punish her, kill her perhaps--for the faults of other people. It's a shame, by Heavens,\" said George, working himself up into passion and enthusiasm as he proceeded, \"to play at fast and loose with a young girl's affections--and with such an angel as that--one so superior to the people amongst whom she lived, that she might have excited envy, only she was so good and gentle, that it's a wonder anybody dared to hate her. If I desert her, sir, do you suppose she forgets me?\"\n\"I ain't going to have any of this dam sentimental nonsense and humbug here, sir,\" the father cried out. \"There shall be no beggar-marriages in my family. If you choose to fling away eight thousand a year, which you may have for the asking, you may do it: but by Jove you take your pack and walk out of this house, sir. Will you do as I tell you, once for all, sir, or will you not?\"\n\"Marry that mulatto woman?\" George said, pulling up his shirt-collars. \"I don't like the colour, sir. Ask the black that sweeps opposite Fleet Market, sir. I'm not going to marry a Hottentot Venus.\"\nMr. Osborne pulled frantically at the cord by which he was accustomed to summon the butler when he wanted wine--and almost black in the face, ordered that functionary to call a coach for Captain Osborne.\n\"I've done it,\" said George, coming into the Slaughters' an hour afterwards, looking very pale.\n\"What, my boy?\" says Dobbin.\nGeorge told what had passed between his father and himself.\n\"I'll marry her to-morrow,\" he said with an oath. \"I love her more every day, Dobbin.\"",
        "paragraph_chars": [
            [
                0,
                412
            ],
            [
                412,
                1245
            ],
            [
                1245,
                2533
            ],
            [
                2533,
                3009
            ],
            [
                3009,
                4546
            ],
            [
                4546,
                4791
            ],
            [
                4791,
                5436
            ],
            [
                5436,
                6083
            ],
            [
                6083,
                6866
            ],
            [
                6866,
                7284
            ],
            [
                7284,
                7420
            ],
            [
                7420,
                8076
            ],
            [
                8076,
                9545
            ],
            [
                9545,
                10287
            ],
            [
                10287,
                11144
            ],
            [
                11144,
                11839
            ],
            [
                11839,
                12129
            ],
            [
                12129,
                12355
            ],
            [
                12355,
                12435
            ],
            [
                12435,
                12490
            ],
            [
                12490,
                12545
            ],
            [
                12545,
                12683
            ],
            [
                12683,
                12792
            ],
            [
                12792,
                13237
            ],
            [
                13237,
                13433
            ],
            [
                13433,
                13677
            ],
            [
                13677,
                13855
            ],
            [
                13855,
                13936
            ],
            [
                13936,
                14421
            ],
            [
                14421,
                14477
            ],
            [
                14477,
                14645
            ],
            [
                14645,
                15103
            ],
            [
                15103,
                15401
            ],
            [
                15401,
                16365
            ],
            [
                16365,
                16571
            ],
            [
                16571,
                16683
            ],
            [
                16683,
                16845
            ],
            [
                16845,
                17089
            ],
            [
                17089,
                17468
            ],
            [
                17468,
                17976
            ],
            [
                17976,
                18299
            ],
            [
                18299,
                18545
            ],
            [
                18545,
                18633
            ],
            [
                18633,
                18793
            ],
            [
                18793,
                19168
            ],
            [
                19168,
                19248
            ],
            [
                19248,
                20020
            ],
            [
                20020,
                20404
            ],
            [
                20404,
                20603
            ],
            [
                20603,
                20807
            ],
            [
                20807,
                20903
            ],
            [
                20903,
                20932
            ],
            [
                20932,
                20992
            ],
            [
                20992,
                21078
            ]
        ],
        "segment_chars": [
            [
                0,
                183
            ],
            [
                183,
                412
            ],
            [
                412,
                583
            ],
            [
                583,
                768
            ],
            [
                768,
                942
            ],
            [
                942,
                1156
            ],
            [
                1156,
                1189
            ],
            [
                1189,
                1211
            ],
            [
                1211,
                1245
            ],
            [
                1245,
                1397
            ],
            [
                1397,
                1460
            ],
            [
                1460,
                1883
            ],
            [
                1883,
                1936
            ],
            [
                1936,
                2021
            ],
            [
                2021,
                2192
            ],
            [
                2192,
                2249
            ],
            [
                2249,
                2533
            ],
            [
                2533,
                2661
            ],
            [
                2661,
                2782
            ],
            [
                2782,
                3009
            ],
            [
                3009,
                3075
            ],
            [
                3075,
                3187
            ],
            [
                3187,
                3377
            ],
            [
                3377,
                3533
            ],
            [
                3533,
                3709
            ],
            [
                3709,
                3818
            ],
            [
                3818,
                3876
            ],
            [
                3876,
                4184
            ],
            [
                4184,
                4546
            ],
            [
                4546,
                4791
            ],
            [
                4791,
                4913
            ],
            [
                4913,
                4995
            ],
            [
                4995,
                5246
            ],
            [
                5246,
                5436
            ],
            [
                5436,
                5487
            ],
            [
                5487,
                5608
            ],
            [
                5608,
                5755
            ],
            [
                5755,
                5867
            ],
            [
                5867,
                6083
            ],
            [
                6083,
                6244
            ],
            [
                6244,
                6306
            ],
            [
                6306,
                6386
            ],
            [
                6386,
                6866
            ],
            [
                6866,
                7284
            ],
            [
                7284,
                7420
            ],
            [
                7420,
                7657
            ],
            [
                7657,
                7704
            ],
            [
                7704,
                7866
            ],
            [
                7866,
                7961
            ],
            [
                7961,
                8076
            ],
            [
                8076,
                8498
            ],
            [
                8498,
                8670
            ],
            [
                8670,
                8863
            ],
            [
                8863,
                8936
            ],
            [
                8936,
                9029
            ],
            [
                9029,
                9058
            ],
            [
                9058,
                9251
            ],
            [
                9251,
                9357
            ],
            [
                9357,
                9396
            ],
            [
                9396,
                9440
            ],
            [
                9440,
                9545
            ],
            [
                9545,
                9702
            ],
            [
                9702,
                9799
            ],
            [
                9799,
                9933
            ],
            [
                9933,
                10151
            ],
            [
                10151,
                10287
            ],
            [
                10287,
                10494
            ],
            [
                10494,
                10714
            ],
            [
                10714,
                11144
            ],
            [
                11144,
                11300
            ],
            [
                11300,
                11502
            ],
            [
                11502,
                11575
            ],
            [
                11575,
                11634
            ],
            [
                11634,
                11698
            ],
            [
                11698,
                11777
            ],
            [
                11777,
                11839
            ],
            [
                11839,
                11979
            ],
            [
                11979,
                12076
            ],
            [
                12076,
                12129
            ],
            [
                12129,
                12177
            ],
            [
                12177,
                12245
            ],
            [
                12245,
                12263
            ],
            [
                12263,
                12303
            ],
            [
                12303,
                12355
            ],
            [
                12355,
                12416
            ],
            [
                12416,
                12435
            ],
            [
                12435,
                12490
            ],
            [
                12490,
                12545
            ],
            [
                12545,
                12627
            ],
            [
                12627,
                12683
            ],
            [
                12683,
                12792
            ],
            [
                12792,
                13237
            ],
            [
                13237,
                13244
            ],
            [
                13244,
                13324
            ],
            [
                13324,
                13369
            ],
            [
                13369,
                13383
            ],
            [
                13383,
                13433
            ],
            [
                13433,
                13487
            ],
            [
                13487,
                13521
            ],
            [
                13521,
                13598
            ],
            [
                13598,
                13677
            ],
            [
                13677,
                13709
            ],
            [
                13709,
                13735
            ],
            [
                13735,
                13771
            ],
            [
                13771,
                13805
            ],
            [
                13805,
                13837
            ],
            [
                13837,
                13855
            ],
            [
                13855,
                13917
            ],
            [
                13917,
                13936
            ],
            [
                13936,
                13959
            ],
            [
                13959,
                13977
            ],
            [
                13977,
                13999
            ],
            [
                13999,
                14151
            ],
            [
                14151,
                14270
            ],
            [
                14270,
                14361
            ],
            [
                14361,
                14421
            ],
            [
                14421,
                14430
            ],
            [
                14430,
                14439
            ],
            [
                14439,
                14477
            ],
            [
                14477,
                14563
            ],
            [
                14563,
                14645
            ],
            [
                14645,
                14949
            ],
            [
                14949,
                14985
            ],
            [
                14985,
                15045
            ],
            [
                15045,
                15103
            ],
            [
                15103,
                15401
            ],
            [
                15401,
                15780
            ],
            [
                15780,
                15839
            ],
            [
                15839,
                15955
            ],
            [
                15955,
                16252
            ],
            [
                16252,
                16365
            ],
            [
                16365,
                16440
            ],
            [
                16440,
                16534
            ],
            [
                16534,
                16571
            ],
            [
                16571,
                16619
            ],
            [
                16619,
                16683
            ],
            [
                16683,
                16724
            ],
            [
                16724,
                16769
            ],
            [
                16769,
                16804
            ],
            [
                16804,
                16845
            ],
            [
                16845,
                16917
            ],
            [
                16917,
                17089
            ],
            [
                17089,
                17204
            ],
            [
                17204,
                17468
            ],
            [
                17468,
                17583
            ],
            [
                17583,
                17810
            ],
            [
                17810,
                17904
            ],
            [
                17904,
                17976
            ],
            [
                17976,
                18004
            ],
            [
                18004,
                18082
            ],
            [
                18082,
                18226
            ],
            [
                18226,
                18261
            ],
            [
                18261,
                18299
            ],
            [
                18299,
                18369
            ],
            [
                18369,
                18545
            ],
            [
                18545,
                18563
            ],
            [
                18563,
                18633
            ],
            [
                18633,
                18641
            ],
            [
                18641,
                18793
            ],
            [
                18793,
                18848
            ],
            [
                18848,
                18946
            ],
            [
                18946,
                19002
            ],
            [
                19002,
                19111
            ],
            [
                19111,
                19168
            ],
            [
                19168,
                19248
            ],
            [
                19248,
                19272
            ],
            [
                19272,
                19331
            ],
            [
                19331,
                19356
            ],
            [
                19356,
                19375
            ],
            [
                19375,
                19471
            ],
            [
                19471,
                19604
            ],
            [
                19604,
                19966
            ],
            [
                19966,
                20020
            ],
            [
                20020,
                20125
            ],
            [
                20125,
                20175
            ],
            [
                20175,
                20340
            ],
            [
                20340,
                20404
            ],
            [
                20404,
                20432
            ],
            [
                20432,
                20475
            ],
            [
                20475,
                20506
            ],
            [
                20506,
                20560
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20807
            ],
            [
                20807,
                20903
            ],
            [
                20903,
                20919
            ],
            [
                20919,
                20932
            ],
            [
                20932,
                20992
            ],
            [
                20992,
                21042
            ],
            [
                21042,
                21078
            ]
        ],
        "overlap_chars": [
            [
                133,
                148
            ],
            [
                94,
                101
            ],
            [
                111,
                119
            ],
            [
                297,
                302
            ],
            [
                186,
                196
            ],
            [
                243,
                257
            ],
            [
                44,
                48
            ],
            [
                67,
                78
            ],
            [
                410,
                412
            ],
            [
                412,
                427
            ],
            [
                459,
                473
            ],
            [
                483,
                510
            ],
            [
                427,
                456
            ],
            [
                456,
                459
            ],
            [
                542,
                583
            ],
            [
                583,
                672
            ],
            [
                705,
                712
            ],
            [
                750,
                768
            ],
            [
                768,
                779
            ],
            [
                787,
                812
            ],
            [
                942,
                1013
            ],
            [
                1015,
                1021
            ],
            [
                1023,
                1092
            ],
            [
                1154,
                1156
            ],
            [
                1189,
                1211
            ],
            [
                1211,
                1227
            ],
            [
                1231,
                1245
            ],
            [
                1245,
                1346
            ],
            [
                1347,
                1352
            ],
            [
                1380,
                1397
            ],
            [
                1397,
                1460
            ],
            [
                1883,
                1936
            ],
            [
                2290,
                2362
            ],
            [
                2370,
                2425
            ],
            [
                2443,
                2480
            ],
            [
                2519,
                2533
            ],
            [
                2533,
                2661
            ],
            [
                2692,
                2694
            ],
            [
                2747,
                2752
            ],
            [
                2777,
                2780
            ],
            [
                2661,
                2675
            ],
            [
                2765,
                2772
            ],
            [
                2780,
                2782
            ],
            [
                2782,
                2917
            ],
            [
                3007,
                3009
            ],
            [
                3009,
                3055
            ],
            [
                3062,
                3075
            ],
            [
                3075,
                3129
            ],
            [
                3185,
                3187
            ],
            [
                3204,
                3235
            ],
            [
                3239,
                3277
            ],
            [
                3292,
                3299
            ],
            [
                3282,
                3288
            ],
            [
                3299,
                3333
            ],
            [
                3345,
                3377
            ],
            [
                3387,
                3398
            ],
            [
                3413,
                3414
            ],
            [
                3421,
                3439
            ],
            [
                3467,
                3478
            ],
            [
                3456,
                3463
            ],
            [
                3506,
                3533
            ],
            [
                3533,
                3563
            ],
            [
                3570,
                3628
            ],
            [
                3672,
                3709
            ],
            [
                3709,
                3752
            ],
            [
                3771,
                3817
            ],
            [
                3818,
                3876
            ],
            [
                3876,
                3914
            ],
            [
                4041,
                4042
            ],
            [
                3916,
                3966
            ],
            [
                3973,
                4027
            ],
            [
                4051,
                4054
            ],
            [
                4059,
                4074
            ],
            [
                4182,
                4184
            ],
            [
                4184,
                4194
            ],
            [
                4206,
                4229
            ],
            [
                4251,
                4253
            ],
            [
                4316,
                4327
            ],
            [
                4262,
                4274
            ],
            [
                4274,
                4275
            ],
            [
                4328,
                4350
            ],
            [
                4358,
                4364
            ],
            [
                4370,
                4485
            ],
            [
                4490,
                4500
            ],
            [
                4544,
                4546
            ],
            [
                4546,
                4551
            ],
            [
                4557,
                4608
            ],
            [
                4621,
                4668
            ],
            [
                4619,
                4620
            ],
            [
                4693,
                4791
            ],
            [
                4791,
                4868
            ],
            [
                4900,
                4913
            ],
            [
                4913,
                4961
            ],
            [
                4976,
                4995
            ],
            [
                4995,
                5079
            ],
            [
                5093,
                5161
            ],
            [
                5195,
                5205
            ],
            [
                5169,
                5184
            ],
            [
                5226,
                5246
            ],
            [
                5246,
                5260
            ],
            [
                5274,
                5286
            ],
            [
                5297,
                5338
            ],
            [
                5350,
                5436
            ],
            [
                5436,
                5440
            ],
            [
                5457,
                5487
            ],
            [
                5487,
                5496
            ],
            [
                5538,
                5608
            ],
            [
                5608,
                5676
            ],
            [
                5678,
                5725
            ],
            [
                5733,
                5742
            ],
            [
                5753,
                5755
            ],
            [
                5800,
                5810
            ],
            [
                5819,
                5866
            ],
            [
                5790,
                5792
            ],
            [
                5782,
                5789
            ],
            [
                5945,
                5947
            ],
            [
                5902,
                5927
            ],
            [
                6045,
                6055
            ],
            [
                5962,
                5963
            ],
            [
                6007,
                6040
            ],
            [
                6081,
                6083
            ],
            [
                6100,
                6115
            ],
            [
                6090,
                6095
            ],
            [
                6125,
                6142
            ],
            [
                6182,
                6193
            ],
            [
                6200,
                6208
            ],
            [
                6242,
                6243
            ],
            [
                6244,
                6306
            ],
            [
                6306,
                6386
            ],
            [
                6386,
                6421
            ],
            [
                6433,
                6435
            ],
            [
                6449,
                6462
            ],
            [
                6685,
                6688
            ],
            [
                6481,
                6484
            ],
            [
                6694,
                6720
            ],
            [
                6729,
                6866
            ],
            [
                6866,
                6876
            ],
            [
                6956,
                6985
            ],
            [
                6997,
                7002
            ],
            [
                7011,
                7128
            ],
            [
                7177,
                7284
            ],
            [
                7284,
                7287
            ],
            [
                7293,
                7420
            ],
            [
                7420,
                7464
            ],
            [
                7498,
                7510
            ],
            [
                7524,
                7531
            ],
            [
                7533,
                7561
            ],
            [
                7571,
                7657
            ],
            [
                7657,
                7663
            ],
            [
                7673,
                7704
            ],
            [
                7704,
                7743
            ],
            [
                8039,
                8043
            ],
            [
                8053,
                8076
            ],
            [
                8167,
                8192
            ],
            [
                8199,
                8204
            ],
            [
                8215,
                8246
            ],
            [
                8258,
                8264
            ],
            [
                8267,
                8282
            ],
            [
                8076,
                8079
            ],
            [
                8139,
                8141
            ],
            [
                8317,
                8339
            ],
            [
                8349,
                8360
            ],
            [
                8402,
                8467
            ],
            [
                8490,
                8493
            ],
            [
                8496,
                8497
            ],
            [
                8498,
                8501
            ],
            [
                8528,
                8547
            ],
            [
                8624,
                8670
            ],
            [
                8670,
                8722
            ],
            [
                8728,
                8767
            ],
            [
                8861,
                8863
            ],
            [
                8863,
                8936
            ],
            [
                8936,
                8956
            ],
            [
                8965,
                9029
            ],
            [
                9029,
                9058
            ],
            [
                9058,
                9092
            ],
            [
                9129,
                9167
            ],
            [
                9228,
                9251
            ],
            [
                9251,
                9310
            ],
            [
                9355,
                9357
            ],
            [
                9362,
                9380
            ],
            [
                9396,
                9440
            ],
            [
                9440,
                9466
            ],
            [
                9489,
                9545
            ],
            [
                9545,
                9587
            ],
            [
                9605,
                9611
            ],
            [
                9623,
                9702
            ],
            [
                9702,
                9719
            ],
            [
                9729,
                9742
            ],
            [
                9747,
                9757
            ],
            [
                9762,
                9769
            ],
            [
                9743,
                9746
            ],
            [
                9789,
                9797
            ],
            [
                9769,
                9770
            ],
            [
                9865,
                9867
            ],
            [
                9822,
                9853
            ],
            [
                9931,
                9933
            ],
            [
                9933,
                9956
            ],
            [
                9985,
                10056
            ],
            [
                10064,
                10070
            ],
            [
                9956,
                9957
            ],
            [
                10191,
                10215
            ],
            [
                10223,
                10225
            ],
            [
                10285,
                10287
            ],
            [
                10287,
                10337
            ],
            [
                10382,
                10408
            ],
            [
                10355,
                10361
            ],
            [
                10374,
                10380
            ],
            [
                10429,
                10447
            ],
            [
                10470,
                10494
            ],
            [
                10494,
                10558
            ],
            [
                10714,
                10725
            ],
            [
                10739,
                10755
            ],
            [
                10764,
                10835
            ],
            [
                10843,
                11031
            ],
            [
                11043,
                11046
            ],
            [
                11033,
                11041
            ],
            [
                11078,
                11113
            ],
            [
                11118,
                11144
            ],
            [
                11144,
                11153
            ],
            [
                11206,
                11227
            ],
            [
                11254,
                11300
            ],
            [
                11300,
                11348
            ],
            [
                11350,
                11385
            ],
            [
                11394,
                11420
            ],
            [
                11444,
                11450
            ],
            [
                11452,
                11460
            ],
            [
                11468,
                11502
            ],
            [
                11502,
                11524
            ],
            [
                11536,
                11546
            ],
            [
                11567,
                11575
            ],
            [
                11575,
                11634
            ],
            [
                11634,
                11637
            ],
            [
                11647,
                11698
            ],
            [
                11698,
                11776
            ],
            [
                11839,
                11843
            ],
            [
                11845,
                11979
            ],
            [
                11994,
                12004
            ],
            [
                12007,
                12076
            ],
            [
                12076,
                12089
            ],
            [
                12118,
                12129
            ],
            [
                12129,
                12175
            ],
            [
                12175,
                12176
            ],
            [
                12177,
                12189
            ],
            [
                12194,
                12215
            ],
            [
                12230,
                12245
            ],
            [
                12245,
                12263
            ],
            [
                12263,
                12297
            ],
            [
                12301,
                12303
            ],
            [
                12303,
                12307
            ],
            [
                12319,
                12355
            ],
            [
                12355,
                12416
            ],
            [
                12416,
                12435
            ],
            [
                12435,
                12490
            ],
            [
                12490,
                12515
            ],
            [
                12543,
                12545
            ],
            [
                12545,
                12556
            ],
            [
                12558,
                12571
            ],
            [
                12575,
                12586
            ],
            [
                12593,
                12597
            ],
            [
                12603,
                12627
            ],
            [
                12627,
                12645
            ],
            [
                12671,
                12683
            ],
            [
                12683,
                12747
            ],
            [
                12748,
                12774
            ],
            [
                12784,
                12790
            ],
            [
                12775,
                12777
            ],
            [
                12790,
                12792
            ],
            [
                12792,
                12822
            ],
            [
                12859,
                12898
            ],
            [
                12905,
                12950
            ],
            [
                12950,
                12967
            ],
            [
                13195,
                13237
            ],
            [
                13237,
                13244
            ],
            [
                13244,
                13324
            ],
            [
                13324,
                13352
            ],
            [
                13367,
                13369
            ],
            [
                13399,
                13416
            ],
            [
                13418,
                13433
            ],
            [
                13433,
                13487
            ],
            [
                13487,
                13521
            ],
            [
                13521,
                13598
            ],
            [
                13598,
                13677
            ],
            [
                13677,
                13709
            ],
            [
                13709,
                13735
            ],
            [
                13735,
                13771
            ],
            [
                13771,
                13805
            ],
            [
                13805,
                13837
            ],
            [
                13837,
                13851
            ],
            [
                13855,
                13917
            ],
            [
                13917,
                13936
            ],
            [
                13936,
                13959
            ],
            [
                13959,
                13971
            ],
            [
                13975,
                13977
            ],
            [
                13999,
                14033
            ],
            [
                14038,
                14047
            ],
            [
                14052,
                14151
            ],
            [
                14168,
                14200
            ],
            [
                14207,
                14270
            ],
            [
                14270,
                14315
            ],
            [
                14359,
                14361
            ],
            [
                14361,
                14383
            ],
            [
                14386,
                14421
            ],
            [
                14421,
                14430
            ],
            [
                14430,
                14439
            ],
            [
                14446,
                14477
            ],
            [
                14477,
                14547
            ],
            [
                14551,
                14563
            ],
            [
                14563,
                14645
            ],
            [
                14645,
                14670
            ],
            [
                14686,
                14691
            ],
            [
                14693,
                14702
            ],
            [
                14709,
                14711
            ],
            [
                14713,
                14735
            ],
            [
                14769,
                14817
            ],
            [
                14823,
                14836
            ],
            [
                14838,
                14842
            ],
            [
                14818,
                14822
            ],
            [
                14851,
                14853
            ],
            [
                14879,
                14882
            ],
            [
                14892,
                14918
            ],
            [
                14932,
                14935
            ],
            [
                14943,
                14948
            ],
            [
                14985,
                15045
            ],
            [
                15045,
                15103
            ],
            [
                15103,
                15217
            ],
            [
                15222,
                15233
            ],
            [
                15241,
                15275
            ],
            [
                15299,
                15314
            ],
            [
                15322,
                15329
            ],
            [
                15334,
                15367
            ],
            [
                15379,
                15401
            ],
            [
                15401,
                15436
            ],
            [
                15438,
                15463
            ],
            [
                15476,
                15477
            ],
            [
                15464,
                15471
            ],
            [
                15478,
                15496
            ],
            [
                15667,
                15670
            ],
            [
                15518,
                15525
            ],
            [
                15778,
                15779
            ],
            [
                15545,
                15596
            ],
            [
                15697,
                15737
            ],
            [
                15780,
                15839
            ],
            [
                15839,
                15889
            ],
            [
                15906,
                15928
            ],
            [
                15939,
                15955
            ],
            [
                15955,
                16012
            ],
            [
                16038,
                16147
            ],
            [
                16164,
                16215
            ],
            [
                16239,
                16252
            ],
            [
                16252,
                16365
            ],
            [
                16397,
                16440
            ],
            [
                16440,
                16505
            ],
            [
                16512,
                16534
            ],
            [
                16550,
                16571
            ],
            [
                16571,
                16619
            ],
            [
                16619,
                16683
            ],
            [
                16683,
                16724
            ],
            [
                16724,
                16769
            ],
            [
                16769,
                16802
            ],
            [
                16826,
                16845
            ],
            [
                16845,
                16917
            ],
            [
                16917,
                17089
            ],
            [
                17089,
                17204
            ],
            [
                17204,
                17289
            ],
            [
                17327,
                17329
            ],
            [
                17355,
                17366
            ],
            [
                17374,
                17375
            ],
            [
                17381,
                17468
            ],
            [
                17468,
                17525
            ],
            [
                17530,
                17540
            ],
            [
                17563,
                17568
            ],
            [
                17581,
                17583
            ],
            [
                17583,
                17719
            ],
            [
                17810,
                17834
            ],
            [
                17849,
                17858
            ],
            [
                17858,
                17904
            ],
            [
                17904,
                17976
            ],
            [
                17976,
                18004
            ],
            [
                18004,
                18082
            ],
            [
                18082,
                18145
            ],
            [
                18214,
                18215
            ],
            [
                18226,
                18235
            ],
            [
                18239,
                18261
            ],
            [
                18261,
                18299
            ],
            [
                18299,
                18349
            ],
            [
                18359,
                18369
            ],
            [
                18369,
                18410
            ],
            [
                18412,
                18464
            ],
            [
                18475,
                18504
            ],
            [
                18521,
                18529
            ],
            [
                18510,
                18514
            ],
            [
                18545,
                18563
            ],
            [
                18563,
                18575
            ],
            [
                18598,
                18633
            ],
            [
                18633,
                18634
            ],
            [
                18638,
                18641
            ],
            [
                18641,
                18683
            ],
            [
                18685,
                18745
            ],
            [
                18747,
                18785
            ],
            [
                18790,
                18793
            ],
            [
                18793,
                18848
            ],
            [
                18848,
                18914
            ],
            [
                18915,
                18946
            ],
            [
                18946,
                18975
            ],
            [
                18986,
                19002
            ],
            [
                19002,
                19071
            ],
            [
                19082,
                19094
            ],
            [
                19109,
                19111
            ],
            [
                19111,
                19168
            ],
            [
                19168,
                19248
            ],
            [
                19248,
                19272
            ],
            [
                19272,
                19331
            ],
            [
                19331,
                19356
            ],
            [
                19356,
                19362
            ],
            [
                19373,
                19375
            ],
            [
                19375,
                19423
            ],
            [
                19451,
                19471
            ],
            [
                19471,
                19570
            ],
            [
                19572,
                19575
            ],
            [
                19590,
                19602
            ],
            [
                19580,
                19586
            ],
            [
                19602,
                19604
            ],
            [
                19604,
                19667
            ],
            [
                19930,
                19931
            ],
            [
                19668,
                19675
            ],
            [
                19706,
                19716
            ],
            [
                19720,
                19765
            ],
            [
                19767,
                19797
            ],
            [
                19803,
                19814
            ],
            [
                19851,
                19852
            ],
            [
                19900,
                19918
            ],
            [
                19964,
                19966
            ],
            [
                19966,
                20020
            ],
            [
                20020,
                20125
            ],
            [
                20125,
                20175
            ],
            [
                20175,
                20202
            ],
            [
                20249,
                20252
            ],
            [
                20203,
                20224
            ],
            [
                20259,
                20279
            ],
            [
                20232,
                20235
            ],
            [
                20311,
                20340
            ],
            [
                20340,
                20366
            ],
            [
                20386,
                20404
            ],
            [
                20404,
                20432
            ],
            [
                20432,
                20443
            ],
            [
                20473,
                20475
            ],
            [
                20475,
                20506
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20640
            ],
            [
                20715,
                20752
            ],
            [
                20683,
                20693
            ],
            [
                20770,
                20807
            ],
            [
                20807,
                20863
            ],
            [
                20864,
                20903
            ],
            [
                20903,
                20919
            ],
            [
                20924,
                20931
            ],
            [
                20932,
                20992
            ],
            [
                20992,
                21007
            ],
            [
                21017,
                21042
            ],
            [
                21042,
                21078
            ]
        ],
        "row_chars": [
            [
                0,
                412
            ],
            [
                412,
                583
            ],
            [
                583,
                768
            ],
            [
                768,
                1156
            ],
            [
                1156,
                1189
            ],
            [
                1189,
                1211
            ],
            [
                1211,
                1245
            ],
            [
                1245,
                1397
            ],
            [
                1397,
                1460
            ],
            [
                1460,
                1883
            ],
            [
                1883,
                1936
            ],
            [
                1936,
                2021
            ],
            [
                2021,
                2192
            ],
            [
                2192,
                2249
            ],
            [
                2249,
                2533
            ],
            [
                2533,
                2661
            ],
            [
                2661,
                2782
            ],
            [
                2782,
                3009
            ],
            [
                3009,
                3075
            ],
            [
                3075,
                3187
            ],
            [
                3187,
                3377
            ],
            [
                3377,
                3533
            ],
            [
                3533,
                3709
            ],
            [
                3709,
                3818
            ],
            [
                3818,
                3876
            ],
            [
                3876,
                4184
            ],
            [
                4184,
                4546
            ],
            [
                4546,
                4791
            ],
            [
                4791,
                4913
            ],
            [
                4913,
                4995
            ],
            [
                4995,
                5246
            ],
            [
                5246,
                5436
            ],
            [
                5436,
                5487
            ],
            [
                5487,
                5608
            ],
            [
                5608,
                5755
            ],
            [
                5755,
                5867
            ],
            [
                5867,
                6083
            ],
            [
                6083,
                6244
            ],
            [
                6244,
                6306
            ],
            [
                6306,
                6386
            ],
            [
                6386,
                6866
            ],
            [
                6866,
                7284
            ],
            [
                7284,
                7420
            ],
            [
                7420,
                7657
            ],
            [
                7657,
                7704
            ],
            [
                7704,
                8076
            ],
            [
                8076,
                8498
            ],
            [
                8498,
                8670
            ],
            [
                8670,
                8863
            ],
            [
                8863,
                8936
            ],
            [
                8936,
                9029
            ],
            [
                9029,
                9058
            ],
            [
                9058,
                9251
            ],
            [
                9251,
                9357
            ],
            [
                9357,
                9440
            ],
            [
                9440,
                9545
            ],
            [
                9545,
                9702
            ],
            [
                9702,
                9933
            ],
            [
                9933,
                10287
            ],
            [
                10287,
                10494
            ],
            [
                10494,
                10714
            ],
            [
                10714,
                11144
            ],
            [
                11144,
                11300
            ],
            [
                11300,
                11502
            ],
            [
                11502,
                11575
            ],
            [
                11575,
                11634
            ],
            [
                11634,
                11698
            ],
            [
                11698,
                11777
            ],
            [
                11777,
                11839
            ],
            [
                11839,
                11979
            ],
            [
                11979,
                12076
            ],
            [
                12076,
                12129
            ],
            [
                12129,
                12177
            ],
            [
                12177,
                12245
            ],
            [
                12245,
                12263
            ],
            [
                12263,
                12303
            ],
            [
                12303,
                12355
            ],
            [
                12355,
                12416
            ],
            [
                12416,
                12435
            ],
            [
                12435,
                12490
            ],
            [
                12490,
                12545
            ],
            [
                12545,
                12627
            ],
            [
                12627,
                12683
            ],
            [
                12683,
                12792
            ],
            [
                12792,
                13237
            ],
            [
                13237,
                13244
            ],
            [
                13244,
                13324
            ],
            [
                13324,
                13369
            ],
            [
                13369,
                13383
            ],
            [
                13383,
                13433
            ],
            [
                13433,
                13487
            ],
            [
                13487,
                13521
            ],
            [
                13521,
                13598
            ],
            [
                13598,
                13677
            ],
            [
                13677,
                13709
            ],
            [
                13709,
                13735
            ],
            [
                13735,
                13771
            ],
            [
                13771,
                13805
            ],
            [
                13805,
                13837
            ],
            [
                13837,
                13855
            ],
            [
                13855,
                13917
            ],
            [
                13917,
                13936
            ],
            [
                13936,
                13959
            ],
            [
                13959,
                13977
            ],
            [
                13977,
                13999
            ],
            [
                13999,
                14151
            ],
            [
                14151,
                14270
            ],
            [
                14270,
                14361
            ],
            [
                14361,
                14421
            ],
            [
                14421,
                14430
            ],
            [
                14430,
                14439
            ],
            [
                14439,
                14477
            ],
            [
                14477,
                14563
            ],
            [
                14563,
                14645
            ],
            [
                14645,
                14949
            ],
            [
                14949,
                14985
            ],
            [
                14985,
                15045
            ],
            [
                15045,
                15103
            ],
            [
                15103,
                15401
            ],
            [
                15401,
                15780
            ],
            [
                15780,
                15839
            ],
            [
                15839,
                15955
            ],
            [
                15955,
                16252
            ],
            [
                16252,
                16365
            ],
            [
                16365,
                16440
            ],
            [
                16440,
                16534
            ],
            [
                16534,
                16571
            ],
            [
                16571,
                16619
            ],
            [
                16619,
                16683
            ],
            [
                16683,
                16724
            ],
            [
                16724,
                16769
            ],
            [
                16769,
                16845
            ],
            [
                16845,
                16917
            ],
            [
                16917,
                17089
            ],
            [
                17089,
                17204
            ],
            [
                17204,
                17468
            ],
            [
                17468,
                17583
            ],
            [
                17583,
                17810
            ],
            [
                17810,
                17904
            ],
            [
                17904,
                17976
            ],
            [
                17976,
                18004
            ],
            [
                18004,
                18082
            ],
            [
                18082,
                18226
            ],
            [
                18226,
                18261
            ],
            [
                18261,
                18299
            ],
            [
                18299,
                18369
            ],
            [
                18369,
                18545
            ],
            [
                18545,
                18563
            ],
            [
                18563,
                18633
            ],
            [
                18633,
                18641
            ],
            [
                18641,
                18793
            ],
            [
                18793,
                18848
            ],
            [
                18848,
                18946
            ],
            [
                18946,
                19002
            ],
            [
                19002,
                19111
            ],
            [
                19111,
                19168
            ],
            [
                19168,
                19248
            ],
            [
                19248,
                19272
            ],
            [
                19272,
                19331
            ],
            [
                19331,
                19356
            ],
            [
                19356,
                19375
            ],
            [
                19375,
                19471
            ],
            [
                19471,
                19604
            ],
            [
                19604,
                19966
            ],
            [
                19966,
                20020
            ],
            [
                20020,
                20125
            ],
            [
                20125,
                20175
            ],
            [
                20175,
                20340
            ],
            [
                20340,
                20404
            ],
            [
                20404,
                20432
            ],
            [
                20432,
                20475
            ],
            [
                20475,
                20506
            ],
            [
                20506,
                20560
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20807
            ],
            [
                20807,
                20903
            ],
            [
                20903,
                20919
            ],
            [
                20919,
                20932
            ],
            [
                20932,
                20992
            ],
            [
                20992,
                21042
            ],
            [
                21042,
                21078
            ]
        ]
    },
    "abridged": {
        "text": "Old Mr. Osborne had a great ambition, and encouraged his daughters' friendship with Miss Swartz enthusiastically.\n\"You won't find that splendour to which you are accustomed,\" he would say to Miss Rhoda Swartz, \"at our humble mansion in Russell Square. My daughters are plain, disinterested girls, but their hearts are in the right place, and their affection for you does them honour. I'm a plain, humble British merchant; but you'll find us a united, simple, happy, and I think I may say respected family - a plain table, a plain people, but a warm welcome, my dear Miss Rhoda. A glass of Champagne! Hicks, Champagne for Miss Swartz.\"\nThere is little doubt that old Osborne believed all he said, and that the girls were quite earnest in protesting their love for Miss Swartz. People in Vanity Fair fasten on to rich folks quite naturally. Their affections rush out to meet and welcome money. The Osborne family, who had not, in fifteen years, been able to get up a regard for Amelia Sedley, became as fond of Miss Swartz during a single evening as the most romantic reader could desire.\nWhat a match for George she'd be (the sisters and Miss Wirt agreed), and how much better than that insignificant little Amelia! He would make her such a dashing husband. Visions of balls in Portland Place, presentations at Court, and introductions to half the peerage, filled the minds of the young ladies.\nOld Osborne thought she would be a great match for his son. He should leave the army; he should go into Parliament. With honest British exultation, he saw the name of Osborne ennobled in his son's person, and thought that he might be the first of a glorious line of baronets. Through working in the City, he knew everything about the heiress's fortune and where her estates lay. Young Fred Bullock, one of his informants, would have liked to make a bid for her himself, only he was booked to Maria Osborne. But not being able to secure her as a wife, Fred quite approved of her as a sister-in-law.\n\"Let George cut in directly and win her,\" was his advice. \"Strike while the iron's hot, you know - while she's fresh to the town: in a few weeks some fellow from the West End will come in with a title and cut us City men out. The sooner the better, Mr. Osborne,\" Mr. Bullock said; though later, he remembered Amelia, and how pretty she was, and how attached to George Osborne; and he gave up at least ten seconds of his valuable time to regretting her misfortune.\nSo while George Osborne's good feelings, and his good friend Dobbin, were carrying back the truant to Amelia, his father and sisters were arranging this splendid match for him, which they never dreamed he would resist.\nWhen the elder Osborne gave what he called \"a hint,\" there was no possibility of mistaking his meaning. He called kicking a footman downstairs a hint to leave his service. With his usual frankness and delicacy he told Mrs. Haggistoun that he would give her five thousand pounds on the day his son was married to her ward; and considered that proposal a great piece of diplomacy. He gave George another hint about the heiress; and ordered him to marry her, as he would have ordered his butler to draw a cork, or his clerk to write a letter.\nThis order disturbed George a good deal. He was in his second courtship of Amelia, which was inexpressibly sweet to him. The contrast of her manners and appearance with those of the heiress made the idea of a union with the latter appear ludicrous. Fancy being seen by the side of such a mahogany charmer as that! he thought. And he was quite as obstinate as his father, and quite as violent when angered.\nWhen his father first gave him the hint about Miss Swartz, George put him off.\n\"You should have thought of the matter sooner, sir,\" he said. \"It can't be done now, when we're expecting every day to go on foreign service. Wait till my return, if I do return.\" He argued that the time for marriage was when he came home with his promotion; \"for, I promise you,\" said he, with a satisfied air, \"that one way or other you shall read the name of George Osborne in the Gazette.\"\nThe father replied that the West End chaps would catch the heiress if any delay took place: that if he didn't marry Miss S., he might at least have an engagement in writing; and that a man who could get ten thousand a year by staying at home, was a fool to risk his life abroad.\n\"So you would have me shown up as a coward, sir, and our name dishonoured for the sake of Miss Swartz's money,\" George interposed.\nThis remark staggered the old gentleman; but his mind was made up. He said, \"You will dine here tomorrow, sir, and every day Miss Swartz comes, you will be here to pay your respects to her. If you need money, call upon Mr. Chopper.\" Thus a new obstacle was in George's way: but it only made him the more resolute.\nMiss Swartz herself was quite ignorant of all these plans for her (which, strange to say, her chaperone did not divulge). She took the Misses Osbornes' flattery for genuine feeling, and being of a very warm and impetuous nature, responded to their affection ardently.\nAnd I dare say that she thought George Osborne a very nice young man. His whiskers had made an impression upon her, on the first night she beheld them at the ball. George had an air at once swaggering and melancholy, languid and fierce. He looked like a man with passions, secrets, and private harrowing griefs and adventures. His voice was rich and deep. He would say it was a warm evening with a tone as sad and confidential as a declaration of love. He trampled over all the young bucks of his father's circle. A few sneered at him; some, like Dobbin, fanatically admired him. And his whiskers had begun to curl themselves round the affections of Miss Swartz.\nWhenever there was a chance of meeting him, that good-natured young woman was quite in a flurry to see her dear Misses Osborne. She went to great expense in new gowns, bracelets, bonnets and feathers, adorning herself with her utmost skill to please him. The girls would ask her for a little music, and she would sing her three songs and play her two pieces, while Miss Wirt and the chaperone sat by.\nThe day after George had his hint from his father, he was lolling upon a sofa before dinner in a very becoming attitude of melancholy. He had been, at his father's request, to Mr. Chopper in the City. He had then passed three hours with his dear little Amelia, at Fulham; and he came home to find his sisters in starched muslin in the drawing-room, the dowagers cackling in the background, and honest Swartz in her favourite amber-coloured satin, with turquoise bracelets, countless rings, flowers and feathers, about as elegantly decorated as a chimney-sweep on May-day.\nThe girls talked about fashions until he was perfectly sick of their chatter. He contrasted their behaviour with little Emmy's - their shrill voices with her tender tones; their attitudes and starch with her soft movements and modest graces. Poor Swartz was seated where Emmy used to sit. Her bejewelled hands lay sprawling in her amber satin lap. Her ear-rings twinkled, and her big eyes rolled about. She was doing nothing with perfect contentment, and thinking herself charming.\n\"Damme,\" George said to a confidential friend, \"she looked like a China doll, which has nothing to do all day but to grin and wag its head. It was all I could do to prevent myself from throwing the sofa-cushion at her.\" He restrained himself, however.\nThe sisters began to play the Battle of Prague at the piano.\n\"Stop that d___ d thing,\" George howled from the sofa. \"It makes me mad. You play us something, Miss Swartz. Sing anything but the Battle of Prague.\"\n\"Shall I sing 'Blue Eyed Mary' or the air from the Cabinet?\" Miss Swartz asked.\n\"That sweet thing from the Cabinet,\" the sisters said.\n\"We've had that,\" replied George.\n\"I can sing Fluvy du Tajy,\" Miss Swartz said meekly, \"if I had the words.\" It was the last of her collection.\n\"O, 'Fleuve du Tage,'\" Miss Maria cried; \"we have the song,\" and she went off to fetch the book it was in.\nNow it happened that this song had been given to the young ladies by a friend of theirs, whose name was on the title page, and Miss Swartz saw \"Amelia Sedley\" written in the comer.\n\"Lor!\" cried Miss Swartz, spinning swiftly round on the music-stool, \"is it my Amelia? Amelia that was at Miss P.'s? Tell me about her - where is she?\"\n\"Don't mention her,\" Miss Maria Osborne said hastily. \"Her family has disgraced itself. Her father cheated Papa, and as for her, she is never to be mentioned here.\" This was Miss Maria's return for George's rudeness about the Battle of Prague.\n\"Are you a friend of Amelia's?\" George said, bouncing up. \"God bless you for it, Miss Swartz. Don't believe what the girls say. She's not to blame at any rate. She's the best-\"\n\"You know you're not to speak about her, George,\" cried Jane. \"Papa forbids it.\"\n\"Who's to prevent me?\" George cried. \"I say she's the best, the kindest, gentlest, sweetest girl in England; and that, bankrupt or no, my sisters are not fit to hold candles to her. Go and see her, Miss Swartz; she needs friends now; and I say, God bless everybody who befriends her. Anybody who speaks kindly of her is my friend. Thank you, Miss Swartz;\" and he went up and wrung her hand.\n\"George! George!\" the sisters cried imploringly.\n\"I say,\" George said fiercely, \"I thank everybody who loves Amelia Sed-\" He stopped. Old Osborne was in the room with a face livid with rage, and eyes like hot coals.\nThough George had stopped, yet his blood was up. He was not to be cowed; rallying instantly, he replied to the bullying frown of his father with a look so resolute and defiant that the elder man quailed and turned away.\n\"Mrs. Haggistoun, let me take you down to dinner,\" he said. \"Give your arm to Miss Swartz, George,\" and they marched.\n\"Miss Swartz, I love Amelia, and we've been engaged almost all our lives,\" Osborne said to his partner; and during the dinner, he rattled on with a volubility which made his father nervous about the fight which was to take place once the ladies were gone.\nThe difference between the pair was that while the father was a violent bully, the son had three times his courage. He could not merely make an attack, but resist it; and he took his dinner with perfect coolness.\nOld Osborne, on the contrary, was nervous, and drank much. He floundered in his conversation with the ladies, George's coolness only making him more angry. It made him half mad to see the calm way in which George, with a swaggering bow, opened the door for the ladies to leave the room; and filling himself a glass of wine, looked his father full in the face, as if to say, \"Fire first.\" The old man also took a supply of ammunition, but his decanter clinked against the glass as he tried to fill it.\nWith a purple choking face, he then began. \"How dare you, sir, mention that person's name before Miss Swartz, in my drawing-room? How dare you do it?\"\n\"Stop, sir,\" says George, \"don't say dare, sir. Dare isn't a word to be used to a Captain in the British Army.\"\n\"I shall say what I like to my son, sir. I can cut him off with a shilling if I like. I can make him a beggar if I like,\" the elder said.\n\"I'm a gentleman though I am your son, sir,\" George answered haughtily. \"Any communications which you have to make to me, or any orders which you may please to give, I beg may be couched in that kind of language which I am accustomed to hear.\"\nWhenever the lad assumed his haughty manner, it always created either great awe or great irritation in the parent. Old Osborne stood in secret terror of his son as a better gentleman than himself; and in Vanity Fair, there is no character which a low-minded man so much mistrusts as that of a gentleman.\n\"My father didn't give me the education you have had, nor your advantages or money. If I had kept the company some folks have had through my means, perhaps my son wouldn't have any reason to brag, sir, of his superiority. But it wasn't considered gentlemanly, in my time, for a man to insult his father. If I'd done any such thing, mine would have kicked me downstairs, sir.\"\n\"I never insulted you, sir. I said I begged you to remember your son was a gentleman as well as yourself. I know very well that you give me plenty of money,\" said George. \"You tell me often enough, sir. There's no fear of my forgetting it.\"\n\"I wish you'd remember other things as well, sir,\" his father answered. \"I wish you'd remember that in this house - so long as you choose to honour it with your company - I'm the master, and that name - that you - that-\"\n\"That what, sir?\" George asked, filling another glass of claret.\n\"--!\" burst out his father with a screaming oath. \"That the name of those Sedleys never be mentioned here, sir - not one of the whole damned lot of 'em.\"\n\"It wasn't I, sir, that introduced Miss Sedley's name. It was my sisters who spoke ill of her to Miss Swartz; and by Jove, I'll defend her wherever I go. Nobody shall speak lightly of her in my presence. Our family has done her quite enough injury already, I think, and may stop reviling her. I'll shoot any man but you who says a word against her.\"\n\"Go on, sir, go on,\" the old gentleman said, his eyes starting out of his head.\n\"Go on about what, sir? about the way in which we've treated that angel of a girl? Who told me to love her? It was you. I might have chosen elsewhere, and looked higher: but I obeyed you. And now that her heart's mine you give me orders to fling it away, and punish her, kill her perhaps - for other people's faults. It's a shame, by Heavens,\" said George, working himself up into a passion, \"to play fast and loose with a young girl's affections - and with such an angel as that - so superior, so good and gentle. If I desert her, sir, do you suppose she forgets me?\"\n\"I ain't going to have any of this dam sentimental nonsense and humbug here, sir,\" the father cried out. \"There shall be no beggar-marriages in my family. If you choose to fling away the chance of eight thousand a year, you may do it: but you will walk out of this house, sir. Will you do as I tell you, or will you not?\"\n\"Marry that mulatto woman?\" George said. \"I don't like the colour, sir. I'm not going to marry a Hottentot Venus.\"\nMr. Osborne pulled frantically at the bell-cord, and almost black in the face, ordered the butler to call a coach for Captain Osborne.\n\"I've done it,\" said George, coming into the Slaughters' Coffee-house an hour afterwards, looking very pale.\n\"What, my boy?\" said Dobbin. George told what had passed between his father and himself.\n\"I'll marry her tomorrow,\" he said with an oath. \"I love her more every day, Dobbin.\"",
        "paragraph_chars": [
            [
                0,
                114
            ],
            [
                114,
                635
            ],
            [
                635,
                1087
            ],
            [
                1087,
                1394
            ],
            [
                1394,
                1992
            ],
            [
                1992,
                2456
            ],
            [
                2456,
                2675
            ],
            [
                2675,
                3215
            ],
            [
                3215,
                3621
            ],
            [
                3621,
                3700
            ],
            [
                3700,
                4094
            ],
            [
                4094,
                4373
            ],
            [
                4373,
                4504
            ],
            [
                4504,
                4818
            ],
            [
                4818,
                5086
            ],
            [
                5086,
                5749
            ],
            [
                5749,
                6150
            ],
            [
                6150,
                6722
            ],
            [
                6722,
                7204
            ],
            [
                7204,
                7456
            ],
            [
                7456,
                7517
            ],
            [
                7517,
                7667
            ],
            [
                7667,
                7747
            ],
            [
                7747,
                7802
            ],
            [
                7802,
                7836
            ],
            [
                7836,
                7946
            ],
            [
                7946,
                8053
            ],
            [
                8053,
                8234
            ],
            [
                8234,
                8386
            ],
            [
                8386,
                8630
            ],
            [
                8630,
                8807
            ],
            [
                8807,
                8888
            ],
            [
                8888,
                9279
            ],
            [
                9279,
                9328
            ],
            [
                9328,
                9495
            ],
            [
                9495,
                9715
            ],
            [
                9715,
                9833
            ],
            [
                9833,
                10089
            ],
            [
                10089,
                10302
            ],
            [
                10302,
                10803
            ],
            [
                10803,
                10954
            ],
            [
                10954,
                11066
            ],
            [
                11066,
                11204
            ],
            [
                11204,
                11448
            ],
            [
                11448,
                11752
            ],
            [
                11752,
                12128
            ],
            [
                12128,
                12369
            ],
            [
                12369,
                12590
            ],
            [
                12590,
                12655
            ],
            [
                12655,
                12809
            ],
            [
                12809,
                13159
            ],
            [
                13159,
                13239
            ],
            [
                13239,
                13808
            ],
            [
                13808,
                14130
            ],
            [
                14130,
                14245
            ],
            [
                14245,
                14380
            ],
            [
                14380,
                14489
            ],
            [
                14489,
                14578
            ],
            [
                14578,
                14663
            ]
        ],
        "segment_chars": [
            [
                0,
                114
            ],
            [
                114,
                252
            ],
            [
                252,
                384
            ],
            [
                384,
                578
            ],
            [
                578,
                600
            ],
            [
                600,
                635
            ],
            [
                635,
                776
            ],
            [
                776,
                839
            ],
            [
                839,
                892
            ],
            [
                892,
                1087
            ],
            [
                1087,
                1215
            ],
            [
                1215,
                1257
            ],
            [
                1257,
                1394
            ],
            [
                1394,
                1454
            ],
            [
                1454,
                1510
            ],
            [
                1510,
                1670
            ],
            [
                1670,
                1773
            ],
            [
                1773,
                1901
            ],
            [
                1901,
                1992
            ],
            [
                1992,
                2050
            ],
            [
                2050,
                2218
            ],
            [
                2218,
                2456
            ],
            [
                2456,
                2675
            ],
            [
                2675,
                2779
            ],
            [
                2779,
                2847
            ],
            [
                2847,
                3054
            ],
            [
                3054,
                3215
            ],
            [
                3215,
                3256
            ],
            [
                3256,
                3336
            ],
            [
                3336,
                3464
            ],
            [
                3464,
                3529
            ],
            [
                3529,
                3541
            ],
            [
                3541,
                3621
            ],
            [
                3621,
                3700
            ],
            [
                3700,
                3762
            ],
            [
                3762,
                3842
            ],
            [
                3842,
                3880
            ],
            [
                3880,
                4094
            ],
            [
                4094,
                4373
            ],
            [
                4373,
                4504
            ],
            [
                4504,
                4571
            ],
            [
                4571,
                4694
            ],
            [
                4694,
                4737
            ],
            [
                4737,
                4818
            ],
            [
                4818,
                4940
            ],
            [
                4940,
                5086
            ],
            [
                5086,
                5156
            ],
            [
                5156,
                5250
            ],
            [
                5250,
                5323
            ],
            [
                5323,
                5413
            ],
            [
                5413,
                5442
            ],
            [
                5442,
                5539
            ],
            [
                5539,
                5600
            ],
            [
                5600,
                5666
            ],
            [
                5666,
                5749
            ],
            [
                5749,
                5877
            ],
            [
                5877,
                6004
            ],
            [
                6004,
                6150
            ],
            [
                6150,
                6285
            ],
            [
                6285,
                6351
            ],
            [
                6351,
                6722
            ],
            [
                6722,
                6800
            ],
            [
                6800,
                6964
            ],
            [
                6964,
                7011
            ],
            [
                7011,
                7070
            ],
            [
                7070,
                7125
            ],
            [
                7125,
                7204
            ],
            [
                7204,
                7344
            ],
            [
                7344,
                7424
            ],
            [
                7424,
                7456
            ],
            [
                7456,
                7517
            ],
            [
                7517,
                7572
            ],
            [
                7572,
                7590
            ],
            [
                7590,
                7626
            ],
            [
                7626,
                7667
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7747
            ],
            [
                7747,
                7802
            ],
            [
                7802,
                7836
            ],
            [
                7836,
                7911
            ],
            [
                7911,
                7946
            ],
            [
                7946,
                8053
            ],
            [
                8053,
                8234
            ],
            [
                8234,
                8241
            ],
            [
                8241,
                8321
            ],
            [
                8321,
                8351
            ],
            [
                8351,
                8386
            ],
            [
                8386,
                8440
            ],
            [
                8440,
                8474
            ],
            [
                8474,
                8551
            ],
            [
                8551,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8688
            ],
            [
                8688,
                8724
            ],
            [
                8724,
                8758
            ],
            [
                8758,
                8790
            ],
            [
                8790,
                8807
            ],
            [
                8807,
                8869
            ],
            [
                8869,
                8888
            ],
            [
                8888,
                8911
            ],
            [
                8911,
                8925
            ],
            [
                8925,
                9070
            ],
            [
                9070,
                9172
            ],
            [
                9172,
                9219
            ],
            [
                9219,
                9279
            ],
            [
                9279,
                9288
            ],
            [
                9288,
                9297
            ],
            [
                9297,
                9328
            ],
            [
                9328,
                9413
            ],
            [
                9413,
                9495
            ],
            [
                9495,
                9544
            ],
            [
                9544,
                9715
            ],
            [
                9715,
                9775
            ],
            [
                9775,
                9833
            ],
            [
                9833,
                10089
            ],
            [
                10089,
                10205
            ],
            [
                10205,
                10302
            ],
            [
                10302,
                10361
            ],
            [
                10361,
                10458
            ],
            [
                10458,
                10690
            ],
            [
                10690,
                10803
            ],
            [
                10803,
                10846
            ],
            [
                10846,
                10933
            ],
            [
                10933,
                10954
            ],
            [
                10954,
                11002
            ],
            [
                11002,
                11066
            ],
            [
                11066,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11204
            ],
            [
                11204,
                11276
            ],
            [
                11276,
                11448
            ],
            [
                11448,
                11563
            ],
            [
                11563,
                11752
            ],
            [
                11752,
                11836
            ],
            [
                11836,
                11974
            ],
            [
                11974,
                12056
            ],
            [
                12056,
                12128
            ],
            [
                12128,
                12156
            ],
            [
                12156,
                12234
            ],
            [
                12234,
                12299
            ],
            [
                12299,
                12331
            ],
            [
                12331,
                12369
            ],
            [
                12369,
                12441
            ],
            [
                12441,
                12590
            ],
            [
                12590,
                12608
            ],
            [
                12608,
                12655
            ],
            [
                12655,
                12661
            ],
            [
                12661,
                12705
            ],
            [
                12705,
                12809
            ],
            [
                12809,
                12864
            ],
            [
                12864,
                12963
            ],
            [
                12963,
                13013
            ],
            [
                13013,
                13102
            ],
            [
                13102,
                13159
            ],
            [
                13159,
                13239
            ],
            [
                13239,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13347
            ],
            [
                13347,
                13359
            ],
            [
                13359,
                13427
            ],
            [
                13427,
                13556
            ],
            [
                13556,
                13754
            ],
            [
                13754,
                13808
            ],
            [
                13808,
                13913
            ],
            [
                13913,
                13963
            ],
            [
                13963,
                14085
            ],
            [
                14085,
                14130
            ],
            [
                14130,
                14158
            ],
            [
                14158,
                14171
            ],
            [
                14171,
                14202
            ],
            [
                14202,
                14245
            ],
            [
                14245,
                14380
            ],
            [
                14380,
                14489
            ],
            [
                14489,
                14505
            ],
            [
                14505,
                14518
            ],
            [
                14518,
                14578
            ],
            [
                14578,
                14627
            ],
            [
                14627,
                14663
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                20,
                27
            ],
            [
                28,
                36
            ],
            [
                36,
                41
            ],
            [
                42,
                52
            ],
            [
                53,
                67
            ],
            [
                79,
                83
            ],
            [
                84,
                95
            ],
            [
                112,
                114
            ],
            [
                114,
                129
            ],
            [
                130,
                144
            ],
            [
                145,
                172
            ],
            [
                172,
                201
            ],
            [
                208,
                211
            ],
            [
                211,
                252
            ],
            [
                252,
                341
            ],
            [
                358,
                365
            ],
            [
                366,
                384
            ],
            [
                384,
                395
            ],
            [
                395,
                420
            ],
            [
                426,
                497
            ],
            [
                498,
                504
            ],
            [
                507,
                576
            ],
            [
                576,
                578
            ],
            [
                578,
                600
            ],
            [
                600,
                616
            ],
            [
                621,
                635
            ],
            [
                635,
                736
            ],
            [
                748,
                753
            ],
            [
                759,
                776
            ],
            [
                776,
                839
            ],
            [
                839,
                892
            ],
            [
                892,
                964
            ],
            [
                965,
                1020
            ],
            [
                1028,
                1065
            ],
            [
                1073,
                1087
            ],
            [
                1087,
                1215
            ],
            [
                1215,
                1217
            ],
            [
                1218,
                1223
            ],
            [
                1229,
                1232
            ],
            [
                1233,
                1247
            ],
            [
                1248,
                1255
            ],
            [
                1255,
                1257
            ],
            [
                1257,
                1392
            ],
            [
                1392,
                1394
            ],
            [
                1394,
                1440
            ],
            [
                1441,
                1454
            ],
            [
                1454,
                1508
            ],
            [
                1508,
                1510
            ],
            [
                1510,
                1541
            ],
            [
                1542,
                1580
            ],
            [
                1581,
                1588
            ],
            [
                1591,
                1597
            ],
            [
                1597,
                1631
            ],
            [
                1638,
                1670
            ],
            [
                1686,
                1697
            ],
            [
                1697,
                1698
            ],
            [
                1699,
                1717
            ],
            [
                1724,
                1735
            ],
            [
                1738,
                1745
            ],
            [
                1746,
                1773
            ],
            [
                1773,
                1803
            ],
            [
                1804,
                1862
            ],
            [
                1864,
                1901
            ],
            [
                1901,
                1944
            ],
            [
                1945,
                1991
            ],
            [
                1992,
                2050
            ],
            [
                2050,
                2088
            ],
            [
                2089,
                2090
            ],
            [
                2091,
                2141
            ],
            [
                2142,
                2196
            ],
            [
                2197,
                2200
            ],
            [
                2201,
                2216
            ],
            [
                2216,
                2218
            ],
            [
                2218,
                2228
            ],
            [
                2229,
                2252
            ],
            [
                2252,
                2254
            ],
            [
                2255,
                2266
            ],
            [
                2267,
                2279
            ],
            [
                2285,
                2286
            ],
            [
                2290,
                2312
            ],
            [
                2317,
                2323
            ],
            [
                2324,
                2439
            ],
            [
                2444,
                2454
            ],
            [
                2454,
                2456
            ],
            [
                2459,
                2464
            ],
            [
                2465,
                2516
            ],
            [
                2517,
                2564
            ],
            [
                2564,
                2565
            ],
            [
                2577,
                2675
            ],
            [
                2675,
                2752
            ],
            [
                2766,
                2779
            ],
            [
                2779,
                2827
            ],
            [
                2828,
                2847
            ],
            [
                2847,
                2931
            ],
            [
                2932,
                3000
            ],
            [
                3001,
                3011
            ],
            [
                3012,
                3027
            ],
            [
                3034,
                3054
            ],
            [
                3054,
                3068
            ],
            [
                3069,
                3081
            ],
            [
                3088,
                3129
            ],
            [
                3129,
                3215
            ],
            [
                3215,
                3219
            ],
            [
                3226,
                3256
            ],
            [
                3256,
                3265
            ],
            [
                3266,
                3336
            ],
            [
                3336,
                3404
            ],
            [
                3405,
                3452
            ],
            [
                3453,
                3462
            ],
            [
                3462,
                3464
            ],
            [
                3470,
                3480
            ],
            [
                3481,
                3528
            ],
            [
                3529,
                3531
            ],
            [
                3532,
                3539
            ],
            [
                3545,
                3547
            ],
            [
                3548,
                3573
            ],
            [
                3574,
                3584
            ],
            [
                3584,
                3585
            ],
            [
                3586,
                3619
            ],
            [
                3619,
                3621
            ],
            [
                3621,
                3636
            ],
            [
                3637,
                3642
            ],
            [
                3643,
                3660
            ],
            [
                3667,
                3678
            ],
            [
                3678,
                3686
            ],
            [
                3698,
                3699
            ],
            [
                3700,
                3762
            ],
            [
                3762,
                3842
            ],
            [
                3842,
                3877
            ],
            [
                3880,
                3882
            ],
            [
                3890,
                3903
            ],
            [
                3904,
                3907
            ],
            [
                3917,
                3920
            ],
            [
                3921,
                3947
            ],
            [
                3957,
                4094
            ],
            [
                4094,
                4104
            ],
            [
                4113,
                4142
            ],
            [
                4143,
                4148
            ],
            [
                4149,
                4266
            ],
            [
                4266,
                4373
            ],
            [
                4373,
                4376
            ],
            [
                4377,
                4504
            ],
            [
                4504,
                4548
            ],
            [
                4549,
                4561
            ],
            [
                4562,
                4569
            ],
            [
                4571,
                4599
            ],
            [
                4608,
                4694
            ],
            [
                4694,
                4700
            ],
            [
                4706,
                4737
            ],
            [
                4737,
                4776
            ],
            [
                4785,
                4789
            ],
            [
                4795,
                4818
            ],
            [
                4838,
                4863
            ],
            [
                4870,
                4875
            ],
            [
                4880,
                4911
            ],
            [
                4912,
                4918
            ],
            [
                4922,
                4937
            ],
            [
                4949,
                4952
            ],
            [
                4960,
                4962
            ],
            [
                4968,
                4990
            ],
            [
                4998,
                5009
            ],
            [
                5010,
                5075
            ],
            [
                5076,
                5079
            ],
            [
                5084,
                5085
            ],
            [
                5086,
                5089
            ],
            [
                5090,
                5109
            ],
            [
                5110,
                5156
            ],
            [
                5156,
                5208
            ],
            [
                5209,
                5248
            ],
            [
                5248,
                5250
            ],
            [
                5250,
                5323
            ],
            [
                5323,
                5343
            ],
            [
                5349,
                5413
            ],
            [
                5413,
                5442
            ],
            [
                5442,
                5476
            ],
            [
                5477,
                5515
            ],
            [
                5516,
                5539
            ],
            [
                5539,
                5598
            ],
            [
                5598,
                5600
            ],
            [
                5602,
                5620
            ],
            [
                5622,
                5666
            ],
            [
                5666,
                5692
            ],
            [
                5693,
                5749
            ],
            [
                5749,
                5791
            ],
            [
                5791,
                5797
            ],
            [
                5798,
                5877
            ],
            [
                5877,
                5894
            ],
            [
                5903,
                5916
            ],
            [
                5917,
                5927
            ],
            [
                5928,
                5935
            ],
            [
                5936,
                5939
            ],
            [
                5940,
                5948
            ],
            [
                5948,
                5949
            ],
            [
                5952,
                5954
            ],
            [
                5967,
                5998
            ],
            [
                6002,
                6004
            ],
            [
                6004,
                6027
            ],
            [
                6028,
                6099
            ],
            [
                6100,
                6106
            ],
            [
                6106,
                6107
            ],
            [
                6114,
                6138
            ],
            [
                6146,
                6148
            ],
            [
                6148,
                6150
            ],
            [
                6150,
                6200
            ],
            [
                6201,
                6227
            ],
            [
                6228,
                6234
            ],
            [
                6235,
                6241
            ],
            [
                6242,
                6260
            ],
            [
                6261,
                6285
            ],
            [
                6285,
                6349
            ],
            [
                6351,
                6362
            ],
            [
                6370,
                6386
            ],
            [
                6387,
                6458
            ],
            [
                6459,
                6647
            ],
            [
                6648,
                6651
            ],
            [
                6652,
                6660
            ],
            [
                6660,
                6695
            ],
            [
                6696,
                6722
            ],
            [
                6722,
                6731
            ],
            [
                6732,
                6753
            ],
            [
                6754,
                6800
            ],
            [
                6800,
                6848
            ],
            [
                6851,
                6886
            ],
            [
                6887,
                6913
            ],
            [
                6914,
                6920
            ],
            [
                6921,
                6929
            ],
            [
                6930,
                6964
            ],
            [
                6964,
                6986
            ],
            [
                6987,
                6997
            ],
            [
                7003,
                7011
            ],
            [
                7011,
                7070
            ],
            [
                7070,
                7073
            ],
            [
                7074,
                7125
            ],
            [
                7125,
                7203
            ],
            [
                7204,
                7208
            ],
            [
                7210,
                7344
            ],
            [
                7344,
                7354
            ],
            [
                7355,
                7424
            ],
            [
                7424,
                7437
            ],
            [
                7445,
                7456
            ],
            [
                7456,
                7502
            ],
            [
                7515,
                7516
            ],
            [
                7517,
                7529
            ],
            [
                7535,
                7556
            ],
            [
                7557,
                7572
            ],
            [
                7572,
                7590
            ],
            [
                7590,
                7624
            ],
            [
                7624,
                7626
            ],
            [
                7626,
                7630
            ],
            [
                7631,
                7667
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7747
            ],
            [
                7747,
                7802
            ],
            [
                7802,
                7827
            ],
            [
                7834,
                7836
            ],
            [
                7836,
                7847
            ],
            [
                7848,
                7861
            ],
            [
                7869,
                7880
            ],
            [
                7881,
                7885
            ],
            [
                7887,
                7911
            ],
            [
                7911,
                7929
            ],
            [
                7934,
                7946
            ],
            [
                7946,
                8010
            ],
            [
                8015,
                8041
            ],
            [
                8042,
                8048
            ],
            [
                8049,
                8051
            ],
            [
                8051,
                8053
            ],
            [
                8053,
                8083
            ],
            [
                8084,
                8123
            ],
            [
                8124,
                8169
            ],
            [
                8174,
                8191
            ],
            [
                8192,
                8234
            ],
            [
                8234,
                8241
            ],
            [
                8241,
                8321
            ],
            [
                8321,
                8349
            ],
            [
                8349,
                8351
            ],
            [
                8351,
                8368
            ],
            [
                8371,
                8386
            ],
            [
                8386,
                8440
            ],
            [
                8440,
                8474
            ],
            [
                8474,
                8551
            ],
            [
                8551,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8688
            ],
            [
                8688,
                8724
            ],
            [
                8724,
                8758
            ],
            [
                8758,
                8790
            ],
            [
                8790,
                8804
            ],
            [
                8807,
                8869
            ],
            [
                8869,
                8888
            ],
            [
                8888,
                8911
            ],
            [
                8911,
                8923
            ],
            [
                8923,
                8925
            ],
            [
                8926,
                8960
            ],
            [
                8961,
                8970
            ],
            [
                8971,
                9070
            ],
            [
                9070,
                9102
            ],
            [
                9109,
                9172
            ],
            [
                9172,
                9217
            ],
            [
                9217,
                9219
            ],
            [
                9219,
                9241
            ],
            [
                9244,
                9279
            ],
            [
                9279,
                9288
            ],
            [
                9288,
                9297
            ],
            [
                9297,
                9328
            ],
            [
                9328,
                9398
            ],
            [
                9401,
                9413
            ],
            [
                9413,
                9495
            ],
            [
                9495,
                9520
            ],
            [
                9520,
                9525
            ],
            [
                9526,
                9535
            ],
            [
                9540,
                9542
            ],
            [
                9544,
                9566
            ],
            [
                9566,
                9614
            ],
            [
                9621,
                9634
            ],
            [
                9635,
                9639
            ],
            [
                9642,
                9646
            ],
            [
                9647,
                9649
            ],
            [
                9659,
                9662
            ],
            [
                9671,
                9697
            ],
            [
                9698,
                9701
            ],
            [
                9709,
                9714
            ],
            [
                9715,
                9775
            ],
            [
                9775,
                9833
            ],
            [
                9833,
                9947
            ],
            [
                9948,
                9959
            ],
            [
                9963,
                9997
            ],
            [
                9998,
                10013
            ],
            [
                10014,
                10021
            ],
            [
                10028,
                10061
            ],
            [
                10067,
                10089
            ],
            [
                10089,
                10124
            ],
            [
                10125,
                10150
            ],
            [
                10151,
                10152
            ],
            [
                10153,
                10160
            ],
            [
                10161,
                10179
            ],
            [
                10192,
                10195
            ],
            [
                10196,
                10203
            ],
            [
                10203,
                10204
            ],
            [
                10208,
                10259
            ],
            [
                10260,
                10300
            ],
            [
                10302,
                10361
            ],
            [
                10361,
                10411
            ],
            [
                10412,
                10434
            ],
            [
                10442,
                10458
            ],
            [
                10458,
                10515
            ],
            [
                10516,
                10625
            ],
            [
                10626,
                10677
            ],
            [
                10677,
                10690
            ],
            [
                10690,
                10803
            ],
            [
                10803,
                10846
            ],
            [
                10846,
                10911
            ],
            [
                10911,
                10933
            ],
            [
                10933,
                10954
            ],
            [
                10954,
                11002
            ],
            [
                11002,
                11066
            ],
            [
                11066,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11185
            ],
            [
                11185,
                11204
            ],
            [
                11204,
                11276
            ],
            [
                11276,
                11448
            ],
            [
                11448,
                11563
            ],
            [
                11563,
                11648
            ],
            [
                11649,
                11651
            ],
            [
                11652,
                11663
            ],
            [
                11663,
                11664
            ],
            [
                11665,
                11752
            ],
            [
                11752,
                11809
            ],
            [
                11815,
                11825
            ],
            [
                11829,
                11834
            ],
            [
                11834,
                11836
            ],
            [
                11836,
                11972
            ],
            [
                11974,
                11998
            ],
            [
                11999,
                12008
            ],
            [
                12010,
                12056
            ],
            [
                12056,
                12128
            ],
            [
                12128,
                12156
            ],
            [
                12156,
                12234
            ],
            [
                12234,
                12297
            ],
            [
                12297,
                12298
            ],
            [
                12299,
                12308
            ],
            [
                12309,
                12331
            ],
            [
                12331,
                12369
            ],
            [
                12369,
                12419
            ],
            [
                12431,
                12441
            ],
            [
                12441,
                12482
            ],
            [
                12485,
                12537
            ],
            [
                12540,
                12569
            ],
            [
                12572,
                12580
            ],
            [
                12583,
                12587
            ],
            [
                12590,
                12608
            ],
            [
                12608,
                12620
            ],
            [
                12620,
                12655
            ],
            [
                12655,
                12656
            ],
            [
                12658,
                12661
            ],
            [
                12661,
                12703
            ],
            [
                12705,
                12765
            ],
            [
                12768,
                12806
            ],
            [
                12806,
                12809
            ],
            [
                12809,
                12864
            ],
            [
                12864,
                12930
            ],
            [
                12932,
                12963
            ],
            [
                12963,
                12992
            ],
            [
                12997,
                13013
            ],
            [
                13013,
                13082
            ],
            [
                13088,
                13100
            ],
            [
                13100,
                13102
            ],
            [
                13102,
                13159
            ],
            [
                13159,
                13239
            ],
            [
                13239,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13347
            ],
            [
                13347,
                13353
            ],
            [
                13357,
                13359
            ],
            [
                13359,
                13407
            ],
            [
                13407,
                13427
            ],
            [
                13427,
                13526
            ],
            [
                13529,
                13532
            ],
            [
                13533,
                13545
            ],
            [
                13548,
                13554
            ],
            [
                13554,
                13556
            ],
            [
                13556,
                13619
            ],
            [
                13620,
                13621
            ],
            [
                13622,
                13629
            ],
            [
                13629,
                13639
            ],
            [
                13640,
                13685
            ],
            [
                13688,
                13718
            ],
            [
                13721,
                13732
            ],
            [
                13732,
                13733
            ],
            [
                13734,
                13752
            ],
            [
                13752,
                13754
            ],
            [
                13754,
                13808
            ],
            [
                13808,
                13913
            ],
            [
                13913,
                13963
            ],
            [
                13963,
                13990
            ],
            [
                13991,
                13994
            ],
            [
                14005,
                14026
            ],
            [
                14026,
                14046
            ],
            [
                14047,
                14050
            ],
            [
                14056,
                14085
            ],
            [
                14085,
                14111
            ],
            [
                14112,
                14130
            ],
            [
                14130,
                14158
            ],
            [
                14158,
                14169
            ],
            [
                14169,
                14171
            ],
            [
                14171,
                14202
            ],
            [
                14202,
                14245
            ],
            [
                14245,
                14282
            ],
            [
                14294,
                14331
            ],
            [
                14332,
                14342
            ],
            [
                14343,
                14380
            ],
            [
                14380,
                14436
            ],
            [
                14450,
                14489
            ],
            [
                14489,
                14505
            ],
            [
                14510,
                14517
            ],
            [
                14518,
                14578
            ],
            [
                14578,
                14593
            ],
            [
                14602,
                14627
            ],
            [
                14627,
                14663
            ]
        ],
        "row_chars": [
            [
                0,
                114
            ],
            [
                114,
                252
            ],
            [
                252,
                384
            ],
            [
                384,
                578
            ],
            [
                578,
                578
            ],
            [
                578,
                600
            ],
            [
                600,
                635
            ],
            [
                635,
                776
            ],
            [
                776,
                839
            ],
            [
                839,
                839
            ],
            [
                839,
                892
            ],
            [
                892,
                892
            ],
            [
                892,
                892
            ],
            [
                892,
                892
            ],
            [
                892,
                1087
            ],
            [
                1087,
                1215
            ],
            [
                1215,
                1257
            ],
            [
                1257,
                1394
            ],
            [
                1394,
                1454
            ],
            [
                1454,
                1510
            ],
            [
                1510,
                1670
            ],
            [
                1670,
                1773
            ],
            [
                1773,
                1901
            ],
            [
                1901,
                1992
            ],
            [
                1992,
                2050
            ],
            [
                2050,
                2218
            ],
            [
                2218,
                2456
            ],
            [
                2456,
                2675
            ],
            [
                2675,
                2779
            ],
            [
                2779,
                2847
            ],
            [
                2847,
                3054
            ],
            [
                3054,
                3215
            ],
            [
                3215,
                3256
            ],
            [
                3256,
                3336
            ],
            [
                3336,
                3464
            ],
            [
                3464,
                3541
            ],
            [
                3541,
                3621
            ],
            [
                3621,
                3700
            ],
            [
                3700,
                3762
            ],
            [
                3762,
                3842
            ],
            [
                3842,
                4094
            ],
            [
                4094,
                4373
            ],
            [
                4373,
                4504
            ],
            [
                4504,
                4694
            ],
            [
                4694,
                4737
            ],
            [
                4737,
                4818
            ],
            [
                4818,
                5086
            ],
            [
                5086,
                5156
            ],
            [
                5156,
                5250
            ],
            [
                5250,
                5323
            ],
            [
                5323,
                5413
            ],
            [
                5413,
                5442
            ],
            [
                5442,
                5539
            ],
            [
                5539,
                5600
            ],
            [
                5600,
                5666
            ],
            [
                5666,
                5749
            ],
            [
                5749,
                5877
            ],
            [
                5877,
                6004
            ],
            [
                6004,
                6150
            ],
            [
                6150,
                6285
            ],
            [
                6285,
                6351
            ],
            [
                6351,
                6722
            ],
            [
                6722,
                6800
            ],
            [
                6800,
                6964
            ],
            [
                6964,
                7011
            ],
            [
                7011,
                7070
            ],
            [
                7070,
                7125
            ],
            [
                7125,
                7204
            ],
            [
                7204,
                7204
            ],
            [
                7204,
                7344
            ],
            [
                7344,
                7424
            ],
            [
                7424,
                7456
            ],
            [
                7456,
                7517
            ],
            [
                7517,
                7572
            ],
            [
                7572,
                7590
            ],
            [
                7590,
                7626
            ],
            [
                7626,
                7667
            ],
            [
                7667,
                7728
            ],
            [
                7728,
                7747
            ],
            [
                7747,
                7802
            ],
            [
                7802,
                7836
            ],
            [
                7836,
                7911
            ],
            [
                7911,
                7946
            ],
            [
                7946,
                8053
            ],
            [
                8053,
                8234
            ],
            [
                8234,
                8241
            ],
            [
                8241,
                8321
            ],
            [
                8321,
                8351
            ],
            [
                8351,
                8351
            ],
            [
                8351,
                8386
            ],
            [
                8386,
                8440
            ],
            [
                8440,
                8474
            ],
            [
                8474,
                8551
            ],
            [
                8551,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8688
            ],
            [
                8688,
                8724
            ],
            [
                8724,
                8758
            ],
            [
                8758,
                8790
            ],
            [
                8790,
                8807
            ],
            [
                8807,
                8869
            ],
            [
                8869,
                8888
            ],
            [
                8888,
                8911
            ],
            [
                8911,
                8925
            ],
            [
                8925,
                8925
            ],
            [
                8925,
                9070
            ],
            [
                9070,
                9172
            ],
            [
                9172,
                9219
            ],
            [
                9219,
                9279
            ],
            [
                9279,
                9288
            ],
            [
                9288,
                9297
            ],
            [
                9297,
                9328
            ],
            [
                9328,
                9413
            ],
            [
                9413,
                9495
            ],
            [
                9495,
                9715
            ],
            [
                9715,
                9715
            ],
            [
                9715,
                9775
            ],
            [
                9775,
                9833
            ],
            [
                9833,
                10089
            ],
            [
                10089,
                10302
            ],
            [
                10302,
                10361
            ],
            [
                10361,
                10458
            ],
            [
                10458,
                10690
            ],
            [
                10690,
                10803
            ],
            [
                10803,
                10846
            ],
            [
                10846,
                10933
            ],
            [
                10933,
                10954
            ],
            [
                10954,
                11002
            ],
            [
                11002,
                11066
            ],
            [
                11066,
                11107
            ],
            [
                11107,
                11152
            ],
            [
                11152,
                11204
            ],
            [
                11204,
                11276
            ],
            [
                11276,
                11448
            ],
            [
                11448,
                11563
            ],
            [
                11563,
                11752
            ],
            [
                11752,
                11836
            ],
            [
                11836,
                11974
            ],
            [
                11974,
                12056
            ],
            [
                12056,
                12128
            ],
            [
                12128,
                12156
            ],
            [
                12156,
                12234
            ],
            [
                12234,
                12299
            ],
            [
                12299,
                12331
            ],
            [
                12331,
                12369
            ],
            [
                12369,
                12441
            ],
            [
                12441,
                12590
            ],
            [
                12590,
                12608
            ],
            [
                12608,
                12655
            ],
            [
                12655,
                12661
            ],
            [
                12661,
                12809
            ],
            [
                12809,
                12864
            ],
            [
                12864,
                12963
            ],
            [
                12963,
                13013
            ],
            [
                13013,
                13102
            ],
            [
                13102,
                13159
            ],
            [
                13159,
                13239
            ],
            [
                13239,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13347
            ],
            [
                13347,
                13359
            ],
            [
                13359,
                13427
            ],
            [
                13427,
                13556
            ],
            [
                13556,
                13754
            ],
            [
                13754,
                13808
            ],
            [
                13808,
                13913
            ],
            [
                13913,
                13963
            ],
            [
                13963,
                14085
            ],
            [
                14085,
                14130
            ],
            [
                14130,
                14158
            ],
            [
                14158,
                14171
            ],
            [
                14171,
                14202
            ],
            [
                14202,
                14202
            ],
            [
                14202,
                14245
            ],
            [
                14245,
                14380
            ],
            [
                14380,
                14489
            ],
            [
                14489,
                14505
            ],
            [
                14505,
                14518
            ],
            [
                14518,
                14578
            ],
            [
                14578,
                14627
            ],
            [
                14627,
                14663
            ]
        ]
    }
}