{
    "original": {
        "text": "What is the secret mesmerism which friendship possesses, and under the operation of which a person ordinarily sluggish, or cold, or timid, becomes wise, active, and resolute, in another's behalf? As Alexis, after a few passes from Dr. Elliotson, despises pain, reads with the back of his head, sees miles off, looks into next week, and performs other wonders, of which, in his own private normal condition, he is quite incapable; so you see, in the affairs of the world and under the magnetism of friendships, the modest man becomes bold, the shy confident, the lazy active, or the impetuous prudent and peaceful. What is it, on the other hand, that makes the lawyer eschew his own cause, and call in his learned brother as an adviser? And what causes the doctor, when ailing, to send for his rival, and not sit down and examine his own tongue in the chimney glass, or write his own prescription at his study-table? I throw out these queries for intelligent readers to answer, who know, at once, how credulous we are, and how sceptical, how soft and how obstinate, how firm for others and how diffident about ourselves: meanwhile, it is certain that our friend William Dobbin, who was personally of so complying a disposition that if his parents had pressed him much, it is probable he would have stepped down into the kitchen and married the cook, and who, to further his own interests, would have found the most insuperable difficulty in walking across the street, found himself as busy and eager in the conduct of George Osborne's affairs, as the most selfish tactician could be in the pursuit of his own.\nWhilst our friend George and his young wife were enjoying the first blushing days of the honeymoon at Brighton, honest William was left as George's plenipotentiary in London, to transact all the business part of the marriage. His duty it was to call upon old Sedley and his wife, and to keep the former in good humour: to draw Jos and his brother-in-law nearer together, so that Jos's position and dignity, as collector of Boggley Wollah, might compensate for his father's loss of station, and tend to reconcile old Osborne to the alliance: and finally, to communicate it to the latter in such a way as should least irritate the old gentleman.\nNow, before he faced the head of the Osborne house with the news which it was his duty to tell, Dobbin bethought him that it would be politic to make friends of the rest of the family, and, if possible, have the ladies on his side. They can't be angry in their hearts, thought he. No woman ever was really angry at a romantic marriage. A little crying out, and they must come round to their brother; when the three of us will lay siege to old Mr. Osborne. So this Machiavellian captain of infantry cast about him for some happy means or stratagem by which he could gently and gradually bring the Misses Osborne to a knowledge of their brother's secret.\nBy a little inquiry regarding his mother's engagements, he was pretty soon able to find out by whom of her ladyship's friends parties were given at that season; where he would be likely to meet Osborne's sisters; and, though he had that abhorrence of routs and evening parties which many sensible men, alas! entertain, he soon found one where the Misses Osborne were to be present. Making his appearance at the ball, where he danced a couple of sets with both of them, and was prodigiously polite, he actually had the courage to ask Miss Osborne for a few minutes' conversation at an early hour the next day, when he had, he said, to communicate to her news of the very greatest interest.\nWhat was it that made her start back, and gaze upon him for a moment, and then on the ground at her feet, and make as if she would faint on his arm, had he not by opportunely treading on her toes, brought the young lady back to self-control? Why was she so violently agitated at Dobbin's request? This can never be known. But when he came the next day, Maria was not in the drawing-room with her sister, and Miss Wirt went off for the purpose of fetching the latter, and the Captain and Miss Osborne were left together. They were both so silent that the ticktock of the Sacrifice of Iphigenia clock on the mantelpiece became quite rudely audible.\n\"What a nice party it was last night,\" Miss Osborne at length began, encouragingly; \"and--and how you're improved in your dancing, Captain Dobbin. Surely somebody has taught you,\" she added, with amiable archness.\n\"You should see me dance a reel with Mrs. Major O'Dowd of ours; and a jig--did you ever see a jig? But I think anybody could dance with you, Miss Osborne, who dance so well.\"\n\"Is the Major's lady young and beautiful, Captain?\" the fair questioner continued. \"Ah, what a terrible thing it must be to be a soldier's wife! I wonder they have any spirits to dance, and in these dreadful times of war, too! O Captain Dobbin, I tremble sometimes when I think of our dearest George, and the dangers of the poor soldier. Are there many married officers of the --th, Captain Dobbin?\"\n\"Upon my word, she's playing her hand rather too openly,\" Miss Wirt thought; but this observation is merely parenthetic, and was not heard through the crevice of the door at which the governess uttered it.\n\"One of our young men is just married,\" Dobbin said, now coming to the point. \"It was a very old attachment, and the young couple are as poor as church mice.\" \"O, how delightful! O, how romantic!\" Miss Osborne cried, as the Captain said \"old attachment\" and \"poor.\" Her sympathy encouraged him.\n\"The finest young fellow in the regiment,\" he continued. \"Not a braver or handsomer officer in the army; and such a charming wife! How you would like her! how you will like her when you know her, Miss Osborne.\" The young lady thought the actual moment had arrived, and that Dobbin's nervousness which now came on and was visible in many twitchings of his face, in his manner of beating the ground with his great feet, in the rapid buttoning and unbuttoning of his frock-coat, &c.--Miss Osborne, I say, thought that when he had given himself a little air, he would unbosom himself entirely, and prepared eagerly to listen. And the clock, in the altar on which Iphigenia was situated, beginning, after a preparatory convulsion, to toll twelve, the mere tolling seemed as if it would last until one--so prolonged was the knell to the anxious spinster.\n\"But it's not about marriage that I came to speak--that is that marriage--that is--no, I mean--my dear Miss Osborne, it's about our dear friend George,\" Dobbin said.\n\"About George?\" she said in a tone so discomfited that Maria and Miss Wirt laughed at the other side of the door, and even that abandoned wretch of a Dobbin felt inclined to smile himself; for he was not altogether unconscious of the state of affairs: George having often bantered him gracefully and said, \"Hang it, Will, why don't you take old Jane? She'll have you if you ask her. I'll bet you five to two she will.\"\n\"Yes, about George, then,\" he continued. \"There has been a difference between him and Mr. Osborne. And I regard him so much--for you know we have been like brothers--that I hope and pray the quarrel may be settled. We must go abroad, Miss Osborne. We may be ordered off at a day's warning. Who knows what may happen in the campaign? Don't be agitated, dear Miss Osborne; and those two at least should part friends.\"\n\"There has been no quarrel, Captain Dobbin, except a little usual scene with Papa,\" the lady said. \"We are expecting George back daily. What Papa wanted was only for his good. He has but to come back, and I'm sure all will be well; and dear Rhoda, who went away from here in sad sad anger, I know will forgive him. Woman forgives but too readily, Captain.\"\n\"Such an angel as YOU I am sure would,\" Mr. Dobbin said, with atrocious astuteness. \"And no man can pardon himself for giving a woman pain. What would you feel, if a man were faithless to you?\"\n\"I should perish--I should throw myself out of window--I should take poison--I should pine and die. I know I should,\" Miss cried, who had nevertheless gone through one or two affairs of the heart without any idea of suicide.\n\"And there are others,\" Dobbin continued, \"as true and as kind-hearted as yourself. I'm not speaking about the West Indian heiress, Miss Osborne, but about a poor girl whom George once loved, and who was bred from her childhood to think of nobody but him. I've seen her in her poverty uncomplaining, broken-hearted, without a fault. It is of Miss Sedley I speak. Dear Miss Osborne, can your generous heart quarrel with your brother for being faithful to her? Could his own conscience ever forgive him if he deserted her? Be her friend--she always loved you--and--and I am come here charged by George to tell you that he holds his engagement to her as the most sacred duty he has; and to entreat you, at least, to be on his side.\"\nWhen any strong emotion took possession of Mr. Dobbin, and after the first word or two of hesitation, he could speak with perfect fluency, and it was evident that his eloquence on this occasion made some impression upon the lady whom he addressed.\n\"Well,\" said she, \"this is--most surprising--most painful--most extraordinary--what will Papa say?--that George should fling away such a superb establishment as was offered to him but at any rate he has found a very brave champion in you, Captain Dobbin. It is of no use, however,\" she continued, after a pause; \"I feel for poor Miss Sedley, most certainly--most sincerely, you know. We never thought the match a good one, though we were always very kind to her here--very. But Papa will never consent, I am sure. And a well brought up young woman, you know--with a well-regulated mind, must--George must give her up, dear Captain Dobbin, indeed he must.\"\n\"Ought a man to give up the woman he loved, just when misfortune befell her?\" Dobbin said, holding out his hand. \"Dear Miss Osborne, is this the counsel I hear from you? My dear young lady! you must befriend her. He can't give her up. He must not give her up. Would a man, think you, give YOU up if you were poor?\"\nThis adroit question touched the heart of Miss Jane Osborne not a little. \"I don't know whether we poor girls ought to believe what you men say, Captain,\" she said. \"There is that in woman's tenderness which induces her to believe too easily. I'm afraid you are cruel, cruel deceivers,\"--and Dobbin certainly thought he felt a pressure of the hand which Miss Osborne had extended to him.\nHe dropped it in some alarm. \"Deceivers!\" said he. \"No, dear Miss Osborne, all men are not; your brother is not; George has loved Amelia Sedley ever since they were children; no wealth would make him marry any but her. Ought he to forsake her? Would you counsel him to do so?\"\nWhat could Miss Jane say to such a question, and with her own peculiar views? She could not answer it, so she parried it by saying, \"Well, if you are not a deceiver, at least you are very romantic\"; and Captain William let this observation pass without challenge.\nAt length when, by the help of farther polite speeches, he deemed that Miss Osborne was sufficiently prepared to receive the whole news, he poured it into her ear. \"George could not give up Amelia--George was married to her\"--and then he related the circumstances of the marriage as we know them already: how the poor girl would have died had not her lover kept his faith: how Old Sedley had refused all consent to the match, and a licence had been got: and Jos Sedley had come from Cheltenham to give away the bride: how they had gone to Brighton in Jos's chariot-and-four to pass the honeymoon: and how George counted on his dear kind sisters to befriend him with their father, as women--so true and tender as they were--assuredly would do. And so, asking permission (readily granted) to see her again, and rightly conjecturing that the news he had brought would be told in the next five minutes to the other ladies, Captain Dobbin made his bow and took his leave.\nHe was scarcely out of the house, when Miss Maria and Miss Wirt rushed in to Miss Osborne, and the whole wonderful secret was imparted to them by that lady. To do them justice, neither of the sisters was very much displeased. There is something about a runaway match with which few ladies can be seriously angry, and Amelia rather rose in their estimation, from the spirit which she had displayed in consenting to the union. As they debated the story, and prattled about it, and wondered what Papa would do and say, came a loud knock, as of an avenging thunder-clap, at the door, which made these conspirators start. It must be Papa, they thought. But it was not he. It was only Mr. Frederick Bullock, who had come from the City according to appointment, to conduct the ladies to a flower-show.\nThis gentleman, as may be imagined, was not kept long in ignorance of the secret. But his face, when he heard it, showed an amazement which was very different to that look of sentimental wonder which the countenances of the sisters wore. Mr. Bullock was a man of the world, and a junior partner of a wealthy firm. He knew what money was, and the value of it: and a delightful throb of expectation lighted up his little eyes, and caused him to smile on his Maria, as he thought that by this piece of folly of Mr. George's she might be worth thirty thousand pounds more than he had ever hoped to get with her.\n\"Gad! Jane,\" said he, surveying even the elder sister with some interest, \"Eels will be sorry he cried off. You may be a fifty thousand pounder yet.\"\nThe sisters had never thought of the money question up to that moment, but Fred Bullock bantered them with graceful gaiety about it during their forenoon's excursion; and they had risen not a little in their own esteem by the time when, the morning amusement over, they drove back to dinner. And do not let my respected reader exclaim against this selfishness as unnatural. It was but this present morning, as he rode on the omnibus from Richmond; while it changed horses, this present chronicler, being on the roof, marked three little children playing in a puddle below, very dirty, and friendly, and happy. To these three presently came another little one. \"POLLY,\" says she, \"YOUR SISTER'S GOT A PENNY.\" At which the children got up from the puddle instantly, and ran off to pay their court to Peggy. And as the omnibus drove off I saw Peggy with the infantine procession at her tail, marching with great dignity towards the stall of a neighbouring lollipop-woman.",
        "paragraph_chars": [
            [
                0,
                1609
            ],
            [
                1609,
                2253
            ],
            [
                2253,
                2906
            ],
            [
                2906,
                3595
            ],
            [
                3595,
                4242
            ],
            [
                4242,
                4456
            ],
            [
                4456,
                4631
            ],
            [
                4631,
                5031
            ],
            [
                5031,
                5237
            ],
            [
                5237,
                5532
            ],
            [
                5532,
                6381
            ],
            [
                6381,
                6547
            ],
            [
                6547,
                6966
            ],
            [
                6966,
                7382
            ],
            [
                7382,
                7739
            ],
            [
                7739,
                7933
            ],
            [
                7933,
                8158
            ],
            [
                8158,
                8888
            ],
            [
                8888,
                9136
            ],
            [
                9136,
                9792
            ],
            [
                9792,
                10107
            ],
            [
                10107,
                10495
            ],
            [
                10495,
                10772
            ],
            [
                10772,
                11036
            ],
            [
                11036,
                12003
            ],
            [
                12003,
                12798
            ],
            [
                12798,
                13406
            ],
            [
                13406,
                13556
            ],
            [
                13556,
                14524
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                614
            ],
            [
                614,
                736
            ],
            [
                736,
                916
            ],
            [
                916,
                1609
            ],
            [
                1609,
                1835
            ],
            [
                1835,
                2253
            ],
            [
                2253,
                2485
            ],
            [
                2485,
                2534
            ],
            [
                2534,
                2589
            ],
            [
                2589,
                2709
            ],
            [
                2709,
                2906
            ],
            [
                2906,
                3214
            ],
            [
                3214,
                3288
            ],
            [
                3288,
                3595
            ],
            [
                3595,
                3837
            ],
            [
                3837,
                3892
            ],
            [
                3892,
                3917
            ],
            [
                3917,
                4115
            ],
            [
                4115,
                4242
            ],
            [
                4242,
                4389
            ],
            [
                4389,
                4456
            ],
            [
                4456,
                4555
            ],
            [
                4555,
                4631
            ],
            [
                4631,
                4683
            ],
            [
                4683,
                4714
            ],
            [
                4714,
                4776
            ],
            [
                4776,
                4858
            ],
            [
                4858,
                4969
            ],
            [
                4969,
                5031
            ],
            [
                5031,
                5237
            ],
            [
                5237,
                5315
            ],
            [
                5315,
                5396
            ],
            [
                5396,
                5416
            ],
            [
                5416,
                5434
            ],
            [
                5434,
                5503
            ],
            [
                5503,
                5532
            ],
            [
                5532,
                5589
            ],
            [
                5589,
                5663
            ],
            [
                5663,
                5687
            ],
            [
                5687,
                5743
            ],
            [
                5743,
                6154
            ],
            [
                6154,
                6381
            ],
            [
                6381,
                6547
            ],
            [
                6547,
                6563
            ],
            [
                6563,
                6898
            ],
            [
                6898,
                6930
            ],
            [
                6930,
                6966
            ],
            [
                6966,
                7007
            ],
            [
                7007,
                7065
            ],
            [
                7065,
                7181
            ],
            [
                7181,
                7214
            ],
            [
                7214,
                7256
            ],
            [
                7256,
                7299
            ],
            [
                7299,
                7382
            ],
            [
                7382,
                7481
            ],
            [
                7481,
                7518
            ],
            [
                7518,
                7558
            ],
            [
                7558,
                7697
            ],
            [
                7697,
                7739
            ],
            [
                7739,
                7823
            ],
            [
                7823,
                7879
            ],
            [
                7879,
                7933
            ],
            [
                7933,
                8033
            ],
            [
                8033,
                8158
            ],
            [
                8158,
                8242
            ],
            [
                8242,
                8414
            ],
            [
                8414,
                8491
            ],
            [
                8491,
                8521
            ],
            [
                8521,
                8617
            ],
            [
                8617,
                8679
            ],
            [
                8679,
                8888
            ],
            [
                8888,
                9136
            ],
            [
                9136,
                9391
            ],
            [
                9391,
                9520
            ],
            [
                9520,
                9610
            ],
            [
                9610,
                9650
            ],
            [
                9650,
                9792
            ],
            [
                9792,
                9870
            ],
            [
                9870,
                9905
            ],
            [
                9905,
                9962
            ],
            [
                9962,
                9982
            ],
            [
                9982,
                10005
            ],
            [
                10005,
                10027
            ],
            [
                10027,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10181
            ],
            [
                10181,
                10272
            ],
            [
                10272,
                10350
            ],
            [
                10350,
                10495
            ],
            [
                10495,
                10524
            ],
            [
                10524,
                10537
            ],
            [
                10537,
                10546
            ],
            [
                10546,
                10714
            ],
            [
                10714,
                10739
            ],
            [
                10739,
                10772
            ],
            [
                10772,
                10850
            ],
            [
                10850,
                11036
            ],
            [
                11036,
                11200
            ],
            [
                11200,
                11779
            ],
            [
                11779,
                12003
            ],
            [
                12003,
                12160
            ],
            [
                12160,
                12229
            ],
            [
                12229,
                12428
            ],
            [
                12428,
                12620
            ],
            [
                12620,
                12651
            ],
            [
                12651,
                12670
            ],
            [
                12670,
                12798
            ],
            [
                12798,
                12880
            ],
            [
                12880,
                13036
            ],
            [
                13036,
                13112
            ],
            [
                13112,
                13406
            ],
            [
                13406,
                13412
            ],
            [
                13412,
                13514
            ],
            [
                13514,
                13556
            ],
            [
                13556,
                13848
            ],
            [
                13848,
                13930
            ],
            [
                13930,
                14166
            ],
            [
                14166,
                14216
            ],
            [
                14216,
                14264
            ],
            [
                14264,
                14361
            ],
            [
                14361,
                14524
            ]
        ],
        "overlap_chars": [
            [
                474,
                574
            ],
            [
                332,
                335
            ],
            [
                578,
                599
            ],
            [
                612,
                614
            ],
            [
                1010,
                1012
            ],
            [
                1069,
                1084
            ],
            [
                975,
                976
            ],
            [
                1093,
                1118
            ],
            [
                1018,
                1021
            ],
            [
                1161,
                1175
            ],
            [
                1177,
                1184
            ],
            [
                1199,
                1211
            ],
            [
                1226,
                1261
            ],
            [
                966,
                968
            ],
            [
                985,
                986
            ],
            [
                1283,
                1296
            ],
            [
                1331,
                1347
            ],
            [
                1467,
                1501
            ],
            [
                1517,
                1541
            ],
            [
                1543,
                1562
            ],
            [
                1573,
                1584
            ],
            [
                1589,
                1609
            ],
            [
                1609,
                1615
            ],
            [
                1627,
                1744
            ],
            [
                1773,
                1795
            ],
            [
                1800,
                1835
            ],
            [
                1851,
                1887
            ],
            [
                1926,
                1947
            ],
            [
                1948,
                2002
            ],
            [
                2016,
                2046
            ],
            [
                2048,
                2089
            ],
            [
                1887,
                1892
            ],
            [
                2108,
                2162
            ],
            [
                1893,
                1895
            ],
            [
                1901,
                1904
            ],
            [
                2184,
                2187
            ],
            [
                2163,
                2165
            ],
            [
                2251,
                2253
            ],
            [
                2253,
                2303
            ],
            [
                2347,
                2355
            ],
            [
                2358,
                2365
            ],
            [
                2375,
                2386
            ],
            [
                2395,
                2485
            ],
            [
                2485,
                2504
            ],
            [
                2520,
                2532
            ],
            [
                2534,
                2589
            ],
            [
                2614,
                2634
            ],
            [
                2651,
                2652
            ],
            [
                2610,
                2613
            ],
            [
                2658,
                2709
            ],
            [
                2709,
                2774
            ],
            [
                2781,
                2786
            ],
            [
                2800,
                2824
            ],
            [
                2839,
                2881
            ],
            [
                2898,
                2906
            ],
            [
                3225,
                3227
            ],
            [
                3051,
                3053
            ],
            [
                3183,
                3188
            ],
            [
                3032,
                3039
            ],
            [
                3073,
                3122
            ],
            [
                3124,
                3133
            ],
            [
                3143,
                3148
            ],
            [
                3167,
                3182
            ],
            [
                2960,
                2964
            ],
            [
                3295,
                3312
            ],
            [
                2909,
                2910
            ],
            [
                3317,
                3321
            ],
            [
                3067,
                3072
            ],
            [
                3040,
                3044
            ],
            [
                3279,
                3287
            ],
            [
                3329,
                3360
            ],
            [
                3369,
                3378
            ],
            [
                3439,
                3443
            ],
            [
                3444,
                3483
            ],
            [
                3490,
                3495
            ],
            [
                3505,
                3514
            ],
            [
                3526,
                3539
            ],
            [
                3555,
                3595
            ],
            [
                3621,
                3650
            ],
            [
                3663,
                3673
            ],
            [
                3688,
                3690
            ],
            [
                3677,
                3687
            ],
            [
                3699,
                3704
            ],
            [
                3710,
                3742
            ],
            [
                3835,
                3837
            ],
            [
                3837,
                3851
            ],
            [
                3862,
                3870
            ],
            [
                3890,
                3892
            ],
            [
                3892,
                3916
            ],
            [
                3917,
                3947
            ],
            [
                3948,
                4021
            ],
            [
                4113,
                4114
            ],
            [
                4066,
                4113
            ],
            [
                4240,
                4242
            ],
            [
                4242,
                4330
            ],
            [
                4332,
                4389
            ],
            [
                4389,
                4431
            ],
            [
                4446,
                4450
            ],
            [
                4454,
                4456
            ],
            [
                4456,
                4510
            ],
            [
                4555,
                4631
            ],
            [
                4631,
                4683
            ],
            [
                4703,
                4714
            ],
            [
                4714,
                4718
            ],
            [
                4726,
                4734
            ],
            [
                4752,
                4776
            ],
            [
                4776,
                4789
            ],
            [
                4810,
                4815
            ],
            [
                4821,
                4851
            ],
            [
                4856,
                4858
            ],
            [
                4858,
                4969
            ],
            [
                4969,
                5000
            ],
            [
                5028,
                5031
            ],
            [
                5031,
                5106
            ],
            [
                5150,
                5151
            ],
            [
                5178,
                5196
            ],
            [
                5235,
                5237
            ],
            [
                5237,
                5288
            ],
            [
                5313,
                5315
            ],
            [
                5315,
                5395
            ],
            [
                5396,
                5416
            ],
            [
                5419,
                5434
            ],
            [
                5434,
                5452
            ],
            [
                5532,
                5587
            ],
            [
                5587,
                5589
            ],
            [
                5589,
                5663
            ],
            [
                5663,
                5687
            ],
            [
                5691,
                5699
            ],
            [
                5709,
                5742
            ],
            [
                5743,
                5800
            ],
            [
                6126,
                6153
            ],
            [
                6381,
                6430
            ],
            [
                6432,
                6439
            ],
            [
                6464,
                6474
            ],
            [
                6476,
                6547
            ],
            [
                6547,
                6563
            ],
            [
                6563,
                6669
            ],
            [
                6697,
                6726
            ],
            [
                6734,
                6746
            ],
            [
                6774,
                6797
            ],
            [
                6966,
                6984
            ],
            [
                6990,
                7007
            ],
            [
                7007,
                7065
            ],
            [
                7069,
                7084
            ],
            [
                7132,
                7143
            ],
            [
                7153,
                7181
            ],
            [
                7214,
                7231
            ],
            [
                7236,
                7256
            ],
            [
                7256,
                7299
            ],
            [
                7299,
                7336
            ],
            [
                7341,
                7382
            ],
            [
                7382,
                7441
            ],
            [
                7448,
                7481
            ],
            [
                7481,
                7518
            ],
            [
                7518,
                7558
            ],
            [
                7558,
                7564
            ],
            [
                7569,
                7586
            ],
            [
                7596,
                7622
            ],
            [
                7628,
                7656
            ],
            [
                7661,
                7697
            ],
            [
                7697,
                7739
            ],
            [
                7739,
                7823
            ],
            [
                7879,
                7933
            ],
            [
                7933,
                7949
            ],
            [
                7988,
                8008
            ],
            [
                8010,
                8031
            ],
            [
                8048,
                8158
            ],
            [
                8158,
                8208
            ],
            [
                8229,
                8242
            ],
            [
                8242,
                8245
            ],
            [
                8308,
                8414
            ],
            [
                8414,
                8491
            ],
            [
                8491,
                8521
            ],
            [
                8521,
                8617
            ],
            [
                8617,
                8679
            ],
            [
                8679,
                8692
            ],
            [
                8725,
                8808
            ],
            [
                8818,
                8824
            ],
            [
                8836,
                8856
            ],
            [
                8868,
                8888
            ],
            [
                8888,
                8911
            ],
            [
                8931,
                8942
            ],
            [
                8990,
                9009
            ],
            [
                9055,
                9064
            ],
            [
                9025,
                9030
            ],
            [
                9068,
                9072
            ],
            [
                9082,
                9116
            ],
            [
                9134,
                9136
            ],
            [
                9136,
                9162
            ],
            [
                9164,
                9179
            ],
            [
                9181,
                9193
            ],
            [
                9215,
                9234
            ],
            [
                9316,
                9331
            ],
            [
                9241,
                9247
            ],
            [
                9335,
                9391
            ],
            [
                9391,
                9476
            ],
            [
                9518,
                9520
            ],
            [
                9566,
                9602
            ],
            [
                9608,
                9610
            ],
            [
                9610,
                9650
            ],
            [
                9729,
                9792
            ],
            [
                9792,
                9870
            ],
            [
                9870,
                9905
            ],
            [
                9905,
                9962
            ],
            [
                9962,
                9982
            ],
            [
                10027,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10166
            ],
            [
                10179,
                10181
            ],
            [
                10181,
                10272
            ],
            [
                10350,
                10391
            ],
            [
                10399,
                10405
            ],
            [
                10416,
                10445
            ],
            [
                10450,
                10454
            ],
            [
                10395,
                10398
            ],
            [
                10498,
                10523
            ],
            [
                10524,
                10537
            ],
            [
                10537,
                10546
            ],
            [
                10546,
                10569
            ],
            [
                10582,
                10585
            ],
            [
                10570,
                10581
            ],
            [
                10585,
                10606
            ],
            [
                10608,
                10631
            ],
            [
                10639,
                10668
            ],
            [
                10712,
                10714
            ],
            [
                10714,
                10739
            ],
            [
                10739,
                10748
            ],
            [
                10757,
                10772
            ],
            [
                10777,
                10792
            ],
            [
                10800,
                10815
            ],
            [
                10848,
                10850
            ],
            [
                10878,
                10968
            ],
            [
                10971,
                10994
            ],
            [
                11012,
                11036
            ],
            [
                11046,
                11050
            ],
            [
                11092,
                11094
            ],
            [
                11102,
                11148
            ],
            [
                11157,
                11185
            ],
            [
                11198,
                11200
            ],
            [
                11200,
                11201
            ],
            [
                11234,
                11255
            ],
            [
                11226,
                11232
            ],
            [
                11259,
                11260
            ],
            [
                11600,
                11601
            ],
            [
                11262,
                11315
            ],
            [
                11554,
                11600
            ],
            [
                11618,
                11718
            ],
            [
                11729,
                11744
            ],
            [
                11719,
                11724
            ],
            [
                11769,
                11779
            ],
            [
                11779,
                11852
            ],
            [
                11866,
                11879
            ],
            [
                11895,
                11969
            ],
            [
                11983,
                12003
            ],
            [
                12003,
                12097
            ],
            [
                12098,
                12124
            ],
            [
                12158,
                12160
            ],
            [
                12160,
                12229
            ],
            [
                12229,
                12358
            ],
            [
                12426,
                12428
            ],
            [
                12428,
                12435
            ],
            [
                12459,
                12473
            ],
            [
                12444,
                12453
            ],
            [
                12476,
                12506
            ],
            [
                12514,
                12518
            ],
            [
                12524,
                12537
            ],
            [
                12583,
                12593
            ],
            [
                12613,
                12620
            ],
            [
                12670,
                12717
            ],
            [
                12758,
                12798
            ],
            [
                12798,
                12812
            ],
            [
                12834,
                12837
            ],
            [
                12868,
                12880
            ],
            [
                12884,
                12887
            ],
            [
                12922,
                12931
            ],
            [
                12938,
                12959
            ],
            [
                12998,
                13001
            ],
            [
                12973,
                12991
            ],
            [
                13015,
                13029
            ],
            [
                13034,
                13036
            ],
            [
                13036,
                13112
            ],
            [
                13112,
                13134
            ],
            [
                13155,
                13194
            ],
            [
                13203,
                13282
            ],
            [
                13306,
                13318
            ],
            [
                13297,
                13302
            ],
            [
                13319,
                13377
            ],
            [
                13383,
                13388
            ],
            [
                13404,
                13406
            ],
            [
                13406,
                13412
            ],
            [
                13412,
                13481
            ],
            [
                13514,
                13556
            ],
            [
                13556,
                13598
            ],
            [
                13608,
                13678
            ],
            [
                13688,
                13700
            ],
            [
                13721,
                13741
            ],
            [
                13755,
                13786
            ],
            [
                13821,
                13847
            ],
            [
                13899,
                13903
            ],
            [
                13928,
                13930
            ],
            [
                14052,
                14053
            ],
            [
                13941,
                13945
            ],
            [
                13954,
                13962
            ],
            [
                13977,
                13988
            ],
            [
                13969,
                13976
            ],
            [
                14021,
                14028
            ],
            [
                14080,
                14121
            ],
            [
                14127,
                14139
            ],
            [
                14141,
                14153
            ],
            [
                14164,
                14166
            ],
            [
                14196,
                14214
            ],
            [
                14191,
                14195
            ],
            [
                14214,
                14216
            ],
            [
                14216,
                14264
            ],
            [
                14264,
                14361
            ],
            [
                14361,
                14417
            ],
            [
                14421,
                14480
            ],
            [
                14494,
                14495
            ],
            [
                14509,
                14517
            ],
            [
                14485,
                14490
            ],
            [
                14523,
                14524
            ]
        ],
        "row_chars": [
            [
                0,
                196
            ],
            [
                196,
                614
            ],
            [
                614,
                736
            ],
            [
                736,
                916
            ],
            [
                916,
                1609
            ],
            [
                1609,
                1835
            ],
            [
                1835,
                2253
            ],
            [
                2253,
                2485
            ],
            [
                2485,
                2589
            ],
            [
                2589,
                2709
            ],
            [
                2709,
                2906
            ],
            [
                2906,
                3595
            ],
            [
                3595,
                3837
            ],
            [
                3837,
                3892
            ],
            [
                3892,
                3917
            ],
            [
                3917,
                4242
            ],
            [
                4242,
                4389
            ],
            [
                4389,
                4456
            ],
            [
                4456,
                4555
            ],
            [
                4555,
                4631
            ],
            [
                4631,
                4683
            ],
            [
                4683,
                4714
            ],
            [
                4714,
                4776
            ],
            [
                4776,
                4858
            ],
            [
                4858,
                4969
            ],
            [
                4969,
                5031
            ],
            [
                5031,
                5237
            ],
            [
                5237,
                5315
            ],
            [
                5315,
                5396
            ],
            [
                5396,
                5416
            ],
            [
                5416,
                5434
            ],
            [
                5434,
                5503
            ],
            [
                5503,
                5532
            ],
            [
                5532,
                5589
            ],
            [
                5589,
                5663
            ],
            [
                5663,
                5687
            ],
            [
                5687,
                5743
            ],
            [
                5743,
                6154
            ],
            [
                6154,
                6381
            ],
            [
                6381,
                6547
            ],
            [
                6547,
                6563
            ],
            [
                6563,
                6898
            ],
            [
                6898,
                6930
            ],
            [
                6930,
                6966
            ],
            [
                6966,
                7007
            ],
            [
                7007,
                7065
            ],
            [
                7065,
                7181
            ],
            [
                7181,
                7214
            ],
            [
                7214,
                7256
            ],
            [
                7256,
                7299
            ],
            [
                7299,
                7382
            ],
            [
                7382,
                7481
            ],
            [
                7481,
                7518
            ],
            [
                7518,
                7558
            ],
            [
                7558,
                7697
            ],
            [
                7697,
                7739
            ],
            [
                7739,
                7823
            ],
            [
                7823,
                7879
            ],
            [
                7879,
                7933
            ],
            [
                7933,
                8158
            ],
            [
                8158,
                8242
            ],
            [
                8242,
                8414
            ],
            [
                8414,
                8491
            ],
            [
                8491,
                8521
            ],
            [
                8521,
                8617
            ],
            [
                8617,
                8679
            ],
            [
                8679,
                8888
            ],
            [
                8888,
                9136
            ],
            [
                9136,
                9391
            ],
            [
                9391,
                9520
            ],
            [
                9520,
                9610
            ],
            [
                9610,
                9650
            ],
            [
                9650,
                9792
            ],
            [
                9792,
                9870
            ],
            [
                9870,
                9905
            ],
            [
                9905,
                9962
            ],
            [
                9962,
                9982
            ],
            [
                9982,
                10005
            ],
            [
                10005,
                10027
            ],
            [
                10027,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10181
            ],
            [
                10181,
                10272
            ],
            [
                10272,
                10350
            ],
            [
                10350,
                10524
            ],
            [
                10524,
                10537
            ],
            [
                10537,
                10546
            ],
            [
                10546,
                10714
            ],
            [
                10714,
                10739
            ],
            [
                10739,
                10772
            ],
            [
                10772,
                10850
            ],
            [
                10850,
                11036
            ],
            [
                11036,
                11200
            ],
            [
                11200,
                11779
            ],
            [
                11779,
                12003
            ],
            [
                12003,
                12160
            ],
            [
                12160,
                12229
            ],
            [
                12229,
                12428
            ],
            [
                12428,
                12620
            ],
            [
                12620,
                12651
            ],
            [
                12651,
                12670
            ],
            [
                12670,
                12798
            ],
            [
                12798,
                12880
            ],
            [
                12880,
                13036
            ],
            [
                13036,
                13112
            ],
            [
                13112,
                13406
            ],
            [
                13406,
                13412
            ],
            [
                13412,
                13556
            ],
            [
                13556,
                13848
            ],
            [
                13848,
                13930
            ],
            [
                13930,
                14166
            ],
            [
                14166,
                14216
            ],
            [
                14216,
                14264
            ],
            [
                14264,
                14361
            ],
            [
                14361,
                14524
            ]
        ]
    },
    "abridged": {
        "text": "Under the magnetism of friendships, the modest man becomes bold, the shy confident, the lazy active, and the impetuous prudent. We can be firm for others, though diffident about ourselves; and so William Dobbin - who was so complying that if his parents had pressed him to, he would have married the cook - found himself as busy and eager in George Osborne's affairs as the most selfish man could be in pursuit of his own.\nWhilst George and his young wife were enjoying the first blushing days of the honeymoon at Brighton, honest William was left in London, to transact the business part of the marriage. He had to call upon old Sedley and his wife: to draw Jos and his new brother-in-law nearer together, so that Jos's position as collector of Boggley Wollah might compensate for his father's loss of status, and help to reconcile old Osborne to the alliance: and finally, he had to tell the news of the marriage to George's father.\nNow, before he faced the head of the Osborne house, Dobbin thought it would be wise to make friends of the rest of the family, and, if possible, have the ladies on his side. They can't be angry, thought he: no woman ever was really angry at a romantic marriage. They must come round; and the three of us will lay siege to old Mr. Osborne. So this Machiavellian captain of infantry cast about him for some means by which he could gently bring the Misses Osborne to a knowledge of the secret.\nHe learnt at which parties he would be likely to meet Osborne's sisters; and though he abhorred evening parties, he made his appearance at a ball where they were present. Here he danced a couple of sets with them, and asked Miss Jane Osborne for a few minutes' conversation early next day, in order, he said, to give her news of the very greatest interest.\nWhy did she start back, and gaze upon him, and then at the ground, and act as if she would faint on his arm? Why was she so agitated? This can never be known.\nBut when he came the next day, Miss Maria was not in the drawing-room with her sister, and Miss Wirt went off. The Captain and Miss Osborne were left together in silence.\n\"What a nice party it was last night,\" Miss Osborne at length began, encouragingly; \"and - and how you're improved in your dancing, Captain Dobbin. Surely somebody has taught you,\" she added archly.\n\"You should see me dance a reel with Mrs. Major O'Dowd. But I think anybody could dance with you, Miss Osborne, who dance so well.\"\n\"Is the Major's lady young and beautiful, Captain?\" she continued. \"Ah, how terrible to be a soldier's wife! I wonder they can dance in these dreadful times of war! O Captain Dobbin, I tremble sometimes when I think of our dearest George, and the dangers of the poor soldier. Are there many married officers in your regiment?\"\n\"Upon my word, she's playing her hand rather too openly,\" Miss Wirt thought, from the crevice of the doorway.\n\"One of our young men is just married,\" Dobbin said. \"It was a very old attachment, and the young couple are as poor as church mice.\"\n\"O, how delightful! How romantic!\" Miss Osborne cried.\n\"The finest young fellow in the regiment,\" he continued, encouraged. \"Not a braver or handsomer officer in the army; and such a charming wife! How you would like her! You will when you know her, Miss Osborne.\"\nThe young lady thought the actual moment had arrived, and prepared eagerly to listen.\n\"But it's not about marriage that I came to speak - that is - no, I mean - my dear Miss Osborne, it's about our dear friend George,\" Dobbin said.\n\"About George?\" she said in a tone so discomfited that Maria and Miss Wirt laughed at the other side of the door, and even Dobbin felt inclined to smile; for he was aware of the state of affairs.\n\"Yes, about George,\" he continued. \"There has been a difference between him and Mr. Osborne. I regard him so highly that I hope the quarrel may be settled. We may be ordered abroad at a day's warning. Who knows what may happen in the campaign? Don't be agitated, dear Miss Osborne; but those two at least should part friends.\"\n\"There has been no quarrel, Captain Dobbin, except a little scene with Papa,\" the lady said. \"We are expecting George back daily. What Papa wanted was only for his good. He has only to come back, and all will be well; and dear Miss Swartz, who went away from here in sad anger, I know will forgive him. Woman forgives but too readily, Captain.\"\n\"Such an angel as you I am sure would,\" Mr. Dobbin said, with atrocious astuteness. \"What would you feel, if a man were faithless to you?\"\n\"I should perish - I should take poison - I should pine and die,\" Miss cried, who had nevertheless gone through one or two affairs of the heart without any idea of suicide.\n\"And there are others,\" Dobbin continued, \"as true as yourself. I'm talking about a poor girl whom George once loved, and who was bred from her childhood to think of nobody but him. I've seen her in her poverty uncomplaining, broken-hearted, without a fault. It is of Miss Sedley I speak. Dear Miss Osborne, can your generous heart quarrel with your brother for being faithful to her? Could his own conscience ever forgive him if he deserted her? Be her friend. I am come here charged by George to tell you that he holds his engagement to her as sacred; and to entreat you to be on his side.\"\nWhen any strong emotion possessed Mr. Dobbin, he could speak with eloquence, and this made some impression upon the lady.\n\"Well,\" said she, \"this is most surprising - most painful - what will Papa say? But at any rate George has found a very brave champion in you, Captain Dobbin. It is of no use, however,\" she continued, after a pause; \"I feel for poor Miss Sedley. We were always very kind to her here. But Papa will never consent, I am sure. George must give her up, dear Captain Dobbin, indeed he must.\"\n\"Ought a man to give up the woman he loved, just when misfortune befell her?\" Dobbin said, holding out his hand. \"Dear Miss Osborne, is this the counsel I hear from you? My dear young lady! He must not give her up. Would a man, think you, give you up if you were poor?\"\nThis adroit question touched the heart of Miss Jane Osborne. \"I don't know whether we poor girls ought to believe what you men say, Captain,\" she said. \"I'm afraid you are cruel, cruel deceivers.\" Dobbin thought he felt a pressure of her hand, and dropped it in some alarm.\n\"Deceivers!\" said he. \"No, dear Miss Osborne, not all men are; your brother is not. George has loved Amelia ever since they were children. Ought he to forsake her? Would you tell him to do so?\"\nHow could Miss Jane answer such a question? She parried it by saying, \"Well, if you are not a deceiver, at least you are very romantic,\" and Captain William let that pass without challenge.\nWhen he judged that Miss Osborne was sufficiently prepared to hear the whole news, he poured it out. \"George was married to Amelia\" - and then he related the circumstances of the marriage; how they had gone to Brighton in Jos's chariot for the honeymoon: and how George counted on his dear kind sisters to befriend him with their father, as true and tender women would do. And so, asking permission (readily granted) to see her again, and rightly guessing that the news would be told in the next five minutes to the other ladies, Captain Dobbin bowed and took his leave.\nHe was scarcely out of the house, when Miss Maria and Miss Wirt rushed in to Miss Osborne, and learnt the whole wonderful secret from her. To do them justice, neither of the sisters was very much displeased. There is something about a runaway match with which few ladies can be seriously angry, and Amelia rather rose in their estimation. As they prattled about the story, and wondered what Papa would say, there was a loud knock, which made them start. But it was only Mr. Frederick Bullock, who had come to conduct the ladies to a flower-show.\nThis gentleman was soon told the secret. His amazement was very different to the sentimental wonder of the sisters. Mr. Bullock was a man of the world, and a junior partner of a wealthy firm. He knew what money was: and a delightful throb of expectation lit up his little eyes, and caused him to smile on his Maria, as he thought that by Mr. George's folly she might be worth thirty thousand pounds more than he had hoped.\n\"Gad! Jane,\" said he, surveying even the elder sister with some interest, \"you may be a fifty thousand pounder yet.\"\nThe sisters had never thought of the money up to that moment, but Fred Bullock bantered them with graceful gaiety during their outing; and they had risen in their own esteem by the time they drove back to dinner.\nThis was only natural. Why, only this morning, when the omnibus I rode on stopped to change horses, I noticed three little children playing in a puddle, very dirty and friendly. Another little one came along. \"POLLY,\" says she, \"YOUR SISTER'S GOT A PENNY.\" At which the children got up from the puddle instantly, and ran off to pay their court to Peggy. And as the omnibus drove off I saw Peggy with the infant procession at her tail, marching with great dignity towards a lollipop stall.",
        "paragraph_chars": [
            [
                0,
                423
            ],
            [
                423,
                935
            ],
            [
                935,
                1426
            ],
            [
                1426,
                1783
            ],
            [
                1783,
                1942
            ],
            [
                1942,
                2113
            ],
            [
                2113,
                2312
            ],
            [
                2312,
                2444
            ],
            [
                2444,
                2771
            ],
            [
                2771,
                2881
            ],
            [
                2881,
                3015
            ],
            [
                3015,
                3070
            ],
            [
                3070,
                3280
            ],
            [
                3280,
                3366
            ],
            [
                3366,
                3512
            ],
            [
                3512,
                3708
            ],
            [
                3708,
                4035
            ],
            [
                4035,
                4380
            ],
            [
                4380,
                4519
            ],
            [
                4519,
                4692
            ],
            [
                4692,
                5285
            ],
            [
                5285,
                5407
            ],
            [
                5407,
                5794
            ],
            [
                5794,
                6064
            ],
            [
                6064,
                6338
            ],
            [
                6338,
                6532
            ],
            [
                6532,
                6722
            ],
            [
                6722,
                7293
            ],
            [
                7293,
                7839
            ],
            [
                7839,
                8262
            ],
            [
                8262,
                8379
            ],
            [
                8379,
                8592
            ],
            [
                8592,
                9080
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                423
            ],
            [
                423,
                606
            ],
            [
                606,
                935
            ],
            [
                935,
                1109
            ],
            [
                1109,
                1197
            ],
            [
                1197,
                1274
            ],
            [
                1274,
                1426
            ],
            [
                1426,
                1597
            ],
            [
                1597,
                1783
            ],
            [
                1783,
                1892
            ],
            [
                1892,
                1917
            ],
            [
                1917,
                1942
            ],
            [
                1942,
                2053
            ],
            [
                2053,
                2113
            ],
            [
                2113,
                2261
            ],
            [
                2261,
                2312
            ],
            [
                2312,
                2368
            ],
            [
                2368,
                2444
            ],
            [
                2444,
                2496
            ],
            [
                2496,
                2511
            ],
            [
                2511,
                2553
            ],
            [
                2553,
                2609
            ],
            [
                2609,
                2720
            ],
            [
                2720,
                2771
            ],
            [
                2771,
                2881
            ],
            [
                2881,
                2934
            ],
            [
                2934,
                3015
            ],
            [
                3015,
                3035
            ],
            [
                3035,
                3050
            ],
            [
                3050,
                3070
            ],
            [
                3070,
                3139
            ],
            [
                3139,
                3213
            ],
            [
                3213,
                3237
            ],
            [
                3237,
                3280
            ],
            [
                3280,
                3366
            ],
            [
                3366,
                3512
            ],
            [
                3512,
                3528
            ],
            [
                3528,
                3708
            ],
            [
                3708,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3864
            ],
            [
                3864,
                3909
            ],
            [
                3909,
                3952
            ],
            [
                3952,
                4035
            ],
            [
                4035,
                4128
            ],
            [
                4128,
                4165
            ],
            [
                4165,
                4205
            ],
            [
                4205,
                4338
            ],
            [
                4338,
                4380
            ],
            [
                4380,
                4464
            ],
            [
                4464,
                4519
            ],
            [
                4519,
                4692
            ],
            [
                4692,
                4756
            ],
            [
                4756,
                4874
            ],
            [
                4874,
                4951
            ],
            [
                4951,
                4981
            ],
            [
                4981,
                5077
            ],
            [
                5077,
                5139
            ],
            [
                5139,
                5154
            ],
            [
                5154,
                5285
            ],
            [
                5285,
                5407
            ],
            [
                5407,
                5487
            ],
            [
                5487,
                5566
            ],
            [
                5566,
                5653
            ],
            [
                5653,
                5691
            ],
            [
                5691,
                5731
            ],
            [
                5731,
                5794
            ],
            [
                5794,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5964
            ],
            [
                5964,
                5984
            ],
            [
                5984,
                6009
            ],
            [
                6009,
                6064
            ],
            [
                6064,
                6125
            ],
            [
                6125,
                6216
            ],
            [
                6216,
                6261
            ],
            [
                6261,
                6338
            ],
            [
                6338,
                6351
            ],
            [
                6351,
                6360
            ],
            [
                6360,
                6422
            ],
            [
                6422,
                6477
            ],
            [
                6477,
                6502
            ],
            [
                6502,
                6532
            ],
            [
                6532,
                6576
            ],
            [
                6576,
                6722
            ],
            [
                6722,
                6823
            ],
            [
                6823,
                7095
            ],
            [
                7095,
                7293
            ],
            [
                7293,
                7432
            ],
            [
                7432,
                7501
            ],
            [
                7501,
                7632
            ],
            [
                7632,
                7747
            ],
            [
                7747,
                7839
            ],
            [
                7839,
                7880
            ],
            [
                7880,
                7955
            ],
            [
                7955,
                8031
            ],
            [
                8031,
                8262
            ],
            [
                8262,
                8268
            ],
            [
                8268,
                8379
            ],
            [
                8379,
                8592
            ],
            [
                8592,
                8615
            ],
            [
                8615,
                8770
            ],
            [
                8770,
                8801
            ],
            [
                8801,
                8849
            ],
            [
                8849,
                8946
            ],
            [
                8946,
                9080
            ]
        ],
        "overlap_chars": [
            [
                0,
                100
            ],
            [
                101,
                104
            ],
            [
                105,
                126
            ],
            [
                126,
                128
            ],
            [
                128,
                130
            ],
            [
                138,
                153
            ],
            [
                153,
                154
            ],
            [
                162,
                187
            ],
            [
                189,
                192
            ],
            [
                196,
                210
            ],
            [
                213,
                220
            ],
            [
                221,
                233
            ],
            [
                234,
                269
            ],
            [
                270,
                272
            ],
            [
                272,
                273
            ],
            [
                274,
                287
            ],
            [
                288,
                304
            ],
            [
                307,
                341
            ],
            [
                342,
                366
            ],
            [
                367,
                386
            ],
            [
                391,
                402
            ],
            [
                403,
                423
            ],
            [
                423,
                429
            ],
            [
                430,
                547
            ],
            [
                548,
                570
            ],
            [
                571,
                606
            ],
            [
                613,
                649
            ],
            [
                649,
                670
            ],
            [
                675,
                729
            ],
            [
                730,
                760
            ],
            [
                761,
                802
            ],
            [
                809,
                814
            ],
            [
                820,
                874
            ],
            [
                882,
                884
            ],
            [
                890,
                893
            ],
            [
                902,
                905
            ],
            [
                915,
                917
            ],
            [
                933,
                935
            ],
            [
                935,
                985
            ],
            [
                985,
                993
            ],
            [
                994,
                1001
            ],
            [
                1002,
                1013
            ],
            [
                1019,
                1109
            ],
            [
                1109,
                1128
            ],
            [
                1128,
                1140
            ],
            [
                1142,
                1197
            ],
            [
                1197,
                1217
            ],
            [
                1217,
                1218
            ],
            [
                1219,
                1222
            ],
            [
                1223,
                1274
            ],
            [
                1274,
                1339
            ],
            [
                1340,
                1345
            ],
            [
                1346,
                1370
            ],
            [
                1371,
                1413
            ],
            [
                1418,
                1426
            ],
            [
                1426,
                1428
            ],
            [
                1436,
                1438
            ],
            [
                1439,
                1444
            ],
            [
                1445,
                1452
            ],
            [
                1453,
                1502
            ],
            [
                1503,
                1512
            ],
            [
                1513,
                1518
            ],
            [
                1522,
                1537
            ],
            [
                1537,
                1541
            ],
            [
                1547,
                1564
            ],
            [
                1565,
                1566
            ],
            [
                1567,
                1571
            ],
            [
                1572,
                1577
            ],
            [
                1583,
                1587
            ],
            [
                1588,
                1596
            ],
            [
                1602,
                1633
            ],
            [
                1634,
                1643
            ],
            [
                1650,
                1654
            ],
            [
                1660,
                1699
            ],
            [
                1700,
                1705
            ],
            [
                1706,
                1715
            ],
            [
                1724,
                1737
            ],
            [
                1743,
                1783
            ],
            [
                1795,
                1824
            ],
            [
                1824,
                1834
            ],
            [
                1835,
                1837
            ],
            [
                1838,
                1848
            ],
            [
                1848,
                1853
            ],
            [
                1858,
                1890
            ],
            [
                1890,
                1892
            ],
            [
                1892,
                1906
            ],
            [
                1907,
                1915
            ],
            [
                1915,
                1917
            ],
            [
                1917,
                1941
            ],
            [
                1942,
                1972
            ],
            [
                1978,
                2051
            ],
            [
                2051,
                2052
            ],
            [
                2053,
                2100
            ],
            [
                2111,
                2113
            ],
            [
                2113,
                2201
            ],
            [
                2204,
                2261
            ],
            [
                2261,
                2303
            ],
            [
                2304,
                2308
            ],
            [
                2310,
                2312
            ],
            [
                2312,
                2366
            ],
            [
                2368,
                2444
            ],
            [
                2444,
                2496
            ],
            [
                2500,
                2511
            ],
            [
                2511,
                2515
            ],
            [
                2520,
                2528
            ],
            [
                2529,
                2553
            ],
            [
                2553,
                2566
            ],
            [
                2571,
                2576
            ],
            [
                2577,
                2607
            ],
            [
                2607,
                2609
            ],
            [
                2609,
                2720
            ],
            [
                2720,
                2751
            ],
            [
                2768,
                2771
            ],
            [
                2771,
                2846
            ],
            [
                2846,
                2847
            ],
            [
                2853,
                2871
            ],
            [
                2879,
                2881
            ],
            [
                2881,
                2932
            ],
            [
                2932,
                2934
            ],
            [
                2934,
                3014
            ],
            [
                3015,
                3035
            ],
            [
                3035,
                3050
            ],
            [
                3050,
                3068
            ],
            [
                3070,
                3125
            ],
            [
                3137,
                3139
            ],
            [
                3139,
                3213
            ],
            [
                3213,
                3237
            ],
            [
                3237,
                3245
            ],
            [
                3246,
                3279
            ],
            [
                3280,
                3337
            ],
            [
                3338,
                3365
            ],
            [
                3366,
                3415
            ],
            [
                3418,
                3425
            ],
            [
                3428,
                3438
            ],
            [
                3441,
                3512
            ],
            [
                3512,
                3528
            ],
            [
                3528,
                3634
            ],
            [
                3635,
                3664
            ],
            [
                3664,
                3676
            ],
            [
                3683,
                3706
            ],
            [
                3708,
                3726
            ],
            [
                3726,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3816
            ],
            [
                3824,
                3835
            ],
            [
                3836,
                3864
            ],
            [
                3864,
                3881
            ],
            [
                3889,
                3909
            ],
            [
                3909,
                3952
            ],
            [
                3952,
                3989
            ],
            [
                3994,
                4035
            ],
            [
                4035,
                4094
            ],
            [
                4095,
                4128
            ],
            [
                4128,
                4165
            ],
            [
                4165,
                4205
            ],
            [
                4205,
                4211
            ],
            [
                4217,
                4234
            ],
            [
                4235,
                4261
            ],
            [
                4273,
                4301
            ],
            [
                4302,
                4338
            ],
            [
                4338,
                4380
            ],
            [
                4380,
                4464
            ],
            [
                4465,
                4519
            ],
            [
                4519,
                4535
            ],
            [
                4538,
                4558
            ],
            [
                4561,
                4582
            ],
            [
                4582,
                4692
            ],
            [
                4692,
                4742
            ],
            [
                4743,
                4756
            ],
            [
                4756,
                4759
            ],
            [
                4768,
                4874
            ],
            [
                4874,
                4951
            ],
            [
                4951,
                4981
            ],
            [
                4981,
                5077
            ],
            [
                5077,
                5139
            ],
            [
                5139,
                5152
            ],
            [
                5154,
                5237
            ],
            [
                5238,
                5244
            ],
            [
                5244,
                5264
            ],
            [
                5265,
                5285
            ],
            [
                5285,
                5308
            ],
            [
                5319,
                5330
            ],
            [
                5331,
                5350
            ],
            [
                5351,
                5360
            ],
            [
                5360,
                5365
            ],
            [
                5366,
                5370
            ],
            [
                5371,
                5405
            ],
            [
                5405,
                5407
            ],
            [
                5407,
                5433
            ],
            [
                5434,
                5449
            ],
            [
                5452,
                5464
            ],
            [
                5467,
                5486
            ],
            [
                5487,
                5502
            ],
            [
                5503,
                5509
            ],
            [
                5510,
                5566
            ],
            [
                5566,
                5651
            ],
            [
                5651,
                5653
            ],
            [
                5653,
                5689
            ],
            [
                5689,
                5691
            ],
            [
                5691,
                5731
            ],
            [
                5731,
                5794
            ],
            [
                5794,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5964
            ],
            [
                5964,
                5984
            ],
            [
                5984,
                6009
            ],
            [
                6009,
                6064
            ],
            [
                6064,
                6123
            ],
            [
                6123,
                6125
            ],
            [
                6125,
                6216
            ],
            [
                6217,
                6258
            ],
            [
                6261,
                6267
            ],
            [
                6268,
                6297
            ],
            [
                6302,
                6306
            ],
            [
                6308,
                6311
            ],
            [
                6312,
                6337
            ],
            [
                6338,
                6351
            ],
            [
                6351,
                6360
            ],
            [
                6360,
                6383
            ],
            [
                6384,
                6387
            ],
            [
                6388,
                6399
            ],
            [
                6399,
                6420
            ],
            [
                6422,
                6445
            ],
            [
                6446,
                6475
            ],
            [
                6475,
                6477
            ],
            [
                6477,
                6502
            ],
            [
                6502,
                6511
            ],
            [
                6517,
                6532
            ],
            [
                6536,
                6551
            ],
            [
                6559,
                6574
            ],
            [
                6574,
                6576
            ],
            [
                6576,
                6666
            ],
            [
                6669,
                6692
            ],
            [
                6698,
                6722
            ],
            [
                6722,
                6726
            ],
            [
                6727,
                6729
            ],
            [
                6737,
                6783
            ],
            [
                6789,
                6817
            ],
            [
                6821,
                6823
            ],
            [
                6823,
                6824
            ],
            [
                6824,
                6845
            ],
            [
                6846,
                6852
            ],
            [
                6852,
                6853
            ],
            [
                6854,
                6855
            ],
            [
                6856,
                6909
            ],
            [
                6911,
                6957
            ],
            [
                6962,
                7062
            ],
            [
                7063,
                7078
            ],
            [
                7079,
                7084
            ],
            [
                7085,
                7095
            ],
            [
                7095,
                7168
            ],
            [
                7178,
                7191
            ],
            [
                7192,
                7266
            ],
            [
                7273,
                7293
            ],
            [
                7293,
                7387
            ],
            [
                7395,
                7421
            ],
            [
                7430,
                7432
            ],
            [
                7432,
                7501
            ],
            [
                7501,
                7630
            ],
            [
                7630,
                7632
            ],
            [
                7632,
                7639
            ],
            [
                7640,
                7654
            ],
            [
                7655,
                7664
            ],
            [
                7664,
                7694
            ],
            [
                7695,
                7699
            ],
            [
                7710,
                7723
            ],
            [
                7724,
                7734
            ],
            [
                7740,
                7747
            ],
            [
                7751,
                7798
            ],
            [
                7799,
                7839
            ],
            [
                7839,
                7853
            ],
            [
                7854,
                7857
            ],
            [
                7868,
                7880
            ],
            [
                7880,
                7883
            ],
            [
                7884,
                7893
            ],
            [
                7894,
                7915
            ],
            [
                7916,
                7919
            ],
            [
                7920,
                7938
            ],
            [
                7939,
                7953
            ],
            [
                7953,
                7955
            ],
            [
                7955,
                8031
            ],
            [
                8031,
                8053
            ],
            [
                8053,
                8092
            ],
            [
                8097,
                8176
            ],
            [
                8177,
                8189
            ],
            [
                8190,
                8195
            ],
            [
                8196,
                8254
            ],
            [
                8255,
                8260
            ],
            [
                8260,
                8262
            ],
            [
                8262,
                8268
            ],
            [
                8268,
                8337
            ],
            [
                8337,
                8379
            ],
            [
                8379,
                8421
            ],
            [
                8422,
                8492
            ],
            [
                8493,
                8505
            ],
            [
                8512,
                8532
            ],
            [
                8533,
                8564
            ],
            [
                8565,
                8591
            ],
            [
                8592,
                8596
            ],
            [
                8613,
                8615
            ],
            [
                8618,
                8619
            ],
            [
                8625,
                8629
            ],
            [
                8630,
                8638
            ],
            [
                8644,
                8655
            ],
            [
                8658,
                8665
            ],
            [
                8684,
                8691
            ],
            [
                8702,
                8743
            ],
            [
                8743,
                8755
            ],
            [
                8756,
                8768
            ],
            [
                8768,
                8770
            ],
            [
                8770,
                8788
            ],
            [
                8789,
                8793
            ],
            [
                8799,
                8801
            ],
            [
                8801,
                8849
            ],
            [
                8849,
                8946
            ],
            [
                8946,
                9002
            ],
            [
                9003,
                9062
            ],
            [
                9063,
                9064
            ],
            [
                9065,
                9073
            ],
            [
                9074,
                9079
            ],
            [
                9079,
                9080
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                128
            ],
            [
                128,
                128
            ],
            [
                128,
                128
            ],
            [
                128,
                423
            ],
            [
                423,
                606
            ],
            [
                606,
                935
            ],
            [
                935,
                1109
            ],
            [
                1109,
                1197
            ],
            [
                1197,
                1274
            ],
            [
                1274,
                1426
            ],
            [
                1426,
                1783
            ],
            [
                1783,
                1892
            ],
            [
                1892,
                1917
            ],
            [
                1917,
                1942
            ],
            [
                1942,
                2113
            ],
            [
                2113,
                2261
            ],
            [
                2261,
                2312
            ],
            [
                2312,
                2368
            ],
            [
                2368,
                2444
            ],
            [
                2444,
                2496
            ],
            [
                2496,
                2511
            ],
            [
                2511,
                2553
            ],
            [
                2553,
                2609
            ],
            [
                2609,
                2720
            ],
            [
                2720,
                2771
            ],
            [
                2771,
                2881
            ],
            [
                2881,
                2934
            ],
            [
                2934,
                3015
            ],
            [
                3015,
                3035
            ],
            [
                3035,
                3050
            ],
            [
                3050,
                3070
            ],
            [
                3070,
                3070
            ],
            [
                3070,
                3139
            ],
            [
                3139,
                3213
            ],
            [
                3213,
                3237
            ],
            [
                3237,
                3280
            ],
            [
                3280,
                3366
            ],
            [
                3366,
                3366
            ],
            [
                3366,
                3512
            ],
            [
                3512,
                3528
            ],
            [
                3528,
                3708
            ],
            [
                3708,
                3708
            ],
            [
                3708,
                3708
            ],
            [
                3708,
                3743
            ],
            [
                3743,
                3801
            ],
            [
                3801,
                3864
            ],
            [
                3864,
                3864
            ],
            [
                3864,
                3909
            ],
            [
                3909,
                3952
            ],
            [
                3952,
                4035
            ],
            [
                4035,
                4128
            ],
            [
                4128,
                4165
            ],
            [
                4165,
                4205
            ],
            [
                4205,
                4338
            ],
            [
                4338,
                4380
            ],
            [
                4380,
                4464
            ],
            [
                4464,
                4464
            ],
            [
                4464,
                4519
            ],
            [
                4519,
                4692
            ],
            [
                4692,
                4756
            ],
            [
                4756,
                4874
            ],
            [
                4874,
                4951
            ],
            [
                4951,
                4981
            ],
            [
                4981,
                5077
            ],
            [
                5077,
                5139
            ],
            [
                5139,
                5285
            ],
            [
                5285,
                5407
            ],
            [
                5407,
                5566
            ],
            [
                5566,
                5653
            ],
            [
                5653,
                5691
            ],
            [
                5691,
                5731
            ],
            [
                5731,
                5794
            ],
            [
                5794,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5964
            ],
            [
                5964,
                5984
            ],
            [
                5984,
                5984
            ],
            [
                5984,
                5984
            ],
            [
                5984,
                6009
            ],
            [
                6009,
                6064
            ],
            [
                6064,
                6125
            ],
            [
                6125,
                6216
            ],
            [
                6216,
                6216
            ],
            [
                6216,
                6338
            ],
            [
                6338,
                6351
            ],
            [
                6351,
                6360
            ],
            [
                6360,
                6477
            ],
            [
                6477,
                6502
            ],
            [
                6502,
                6532
            ],
            [
                6532,
                6576
            ],
            [
                6576,
                6722
            ],
            [
                6722,
                6823
            ],
            [
                6823,
                7095
            ],
            [
                7095,
                7293
            ],
            [
                7293,
                7432
            ],
            [
                7432,
                7501
            ],
            [
                7501,
                7632
            ],
            [
                7632,
                7747
            ],
            [
                7747,
                7747
            ],
            [
                7747,
                7747
            ],
            [
                7747,
                7839
            ],
            [
                7839,
                7880
            ],
            [
                7880,
                7955
            ],
            [
                7955,
                8031
            ],
            [
                8031,
                8262
            ],
            [
                8262,
                8268
            ],
            [
                8268,
                8379
            ],
            [
                8379,
                8592
            ],
            [
                8592,
                8615
            ],
            [
                8615,
                8770
            ],
            [
                8770,
                8801
            ],
            [
                8801,
                8849
            ],
            [
                8849,
                8946
            ],
            [
                8946,
                9080
            ]
        ]
    }
}