{
    "original": {
        "text": "So having prepared the sisters, Dobbin hastened away to the City to perform the rest and more difficult part of the task which he had undertaken. The idea of facing old Osborne rendered him not a little nervous, and more than once he thought of leaving the young ladies to communicate the secret, which, as he was aware, they could not long retain. But he had promised to report to George upon the manner in which the elder Osborne bore the intelligence; so going into the City to the paternal counting-house in Thames Street, he despatched thence a note to Mr. Osborne begging for a half-hour's conversation relative to the affairs of his son George. Dobbin's messenger returned from Mr. Osborne's house of business, with the compliments of the latter, who would be very happy to see the Captain immediately, and away accordingly Dobbin went to confront him.\nThe Captain, with a half-guilty secret to confess, and with the prospect of a painful and stormy interview before him, entered Mr. Osborne's offices with a most dismal countenance and abashed gait, and, passing through the outer room where Mr. Chopper presided, was greeted by that functionary from his desk with a waggish air which farther discomfited him. Mr. Chopper winked and nodded and pointed his pen towards his patron's door, and said, \"You'll find the governor all right,\" with the most provoking good humour.\nOsborne rose too, and shook him heartily by the hand, and said, \"How do, my dear boy?\" with a cordiality that made poor George's ambassador feel doubly guilty. His hand lay as if dead in the old gentleman's grasp. He felt that he, Dobbin, was more or less the cause of all that had happened. It was he had brought back George to Amelia: it was he had applauded, encouraged, transacted almost the marriage which he was come to reveal to George's father: and the latter was receiving him with smiles of welcome; patting him on the shoulder, and calling him \"Dobbin, my dear boy.\" The envoy had indeed good reason to hang his head.\nOsborne fully believed that Dobbin had come to announce his son's surrender. Mr. Chopper and his principal were talking over the matter between George and his father, at the very moment when Dobbin's messenger arrived. Both agreed that George was sending in his submission. Both had been expecting it for some days--and \"Lord! Chopper, what a marriage we'll have!\" Mr. Osborne said to his clerk, snapping his big fingers, and jingling all the guineas and shillings in his great pockets as he eyed his subordinate with a look of triumph.\nWith similar operations conducted in both pockets, and a knowing jolly air, Osborne from his chair regarded Dobbin seated blank and silent opposite to him. \"What a bumpkin he is for a Captain in the army,\" old Osborne thought. \"I wonder George hasn't taught him better manners.\"\nAt last Dobbin summoned courage to begin. \"Sir,\" said he, \"I've brought you some very grave news. I have been at the Horse Guards this morning, and there's no doubt that our regiment will be ordered abroad, and on its way to Belgium before the week is over. And you know, sir, that we shan't be home again before a tussle which may be fatal to many of us.\" Osborne looked grave. \"My s--, the regiment will do its duty, sir, I daresay,\" he said.\n\"The French are very strong, sir,\" Dobbin went on. \"The Russians and Austrians will be a long time before they can bring their troops down. We shall have the first of the fight, sir; and depend on it Boney will take care that it shall be a hard one.\"\n\"What are you driving at, Dobbin?\" his interlocutor said, uneasy and with a scowl. \"I suppose no Briton's afraid of any d---- Frenchman, hey?\"\n\"I only mean, that before we go, and considering the great and certain risk that hangs over every one of us--if there are any differences between you and George--it would be as well, sir, that--that you should shake hands: wouldn't it? Should anything happen to him, I think you would never forgive yourself if you hadn't parted in charity.\"\nAs he said this, poor William Dobbin blushed crimson, and felt and owned that he himself was a traitor. But for him, perhaps, this severance need never have taken place. Why had not George's marriage been delayed? What call was there to press it on so eagerly? He felt that George would have parted from Amelia at any rate without a mortal pang. Amelia, too, MIGHT have recovered the shock of losing him. It was his counsel had brought about this marriage, and all that was to ensue from it. And why was it? Because he loved her so much that he could not bear to see her unhappy: or because his own sufferings of suspense were so unendurable that he was glad to crush them at once--as we hasten a funeral after a death, or, when a separation from those we love is imminent, cannot rest until the parting be over.\n\"You are a good fellow, William,\" said Mr. Osborne in a softened voice; \"and me and George shouldn't part in anger, that is true. Look here. I've done for him as much as any father ever did. He's had three times as much money from me, as I warrant your father ever gave you. But I don't brag about that. How I've toiled for him, and worked and employed my talents and energy, I won't say. Ask Chopper. Ask himself. Ask the City of London. Well, I propose to him such a marriage as any nobleman in the land might be proud of--the only thing in life I ever asked him--and he refuses me. Am I wrong? Is the quarrel of MY making? What do I seek but his good, for which I've been toiling like a convict ever since he was born? Nobody can say there's anything selfish in me. Let him come back. I say, here's my hand. I say, forget and forgive. As for marrying now, it's out of the question. Let him and Miss S. make it up, and make out the marriage afterwards, when he comes back a Colonel; for he shall be a Colonel, by G-- he shall, if money can do it. I'm glad you've brought him round. I know it's you, Dobbin. You've took him out of many a scrape before. Let him come. I shan't be hard. Come along, and dine in Russell Square to-day: both of you. The old shop, the old hour. You'll find a neck of venison, and no questions asked.\"\nThis praise and confidence smote Dobbin's heart very keenly. Every moment the colloquy continued in this tone, he felt more and more guilty. \"Sir,\" said he, \"I fear you deceive yourself. I am sure you do. George is much too high-minded a man ever to marry for money. A threat on your part that you would disinherit him in case of disobedience would only be followed by resistance on his.\"\n\"Why, hang it, man, you don't call offering him eight or ten thousand a year threatening him?\" Mr. Osborne said, with still provoking good humour. \"'Gad, if Miss S. will have me, I'm her man. I ain't particular about a shade or so of tawny.\" And the old gentleman gave his knowing grin and coarse laugh.\n\"You forget, sir, previous engagements into which Captain Osborne had entered,\" the ambassador said, gravely.\n\"What engagements? What the devil do you mean? You don't mean,\" Mr. Osborne continued, gathering wrath and astonishment as the thought now first came upon him; \"you don't mean that he's such a d---- fool as to be still hankering after that swindling old bankrupt's daughter? You've not come here for to make me suppose that he wants to marry HER? Marry HER, that IS a good one. My son and heir marry a beggar's girl out of a gutter. D---- him, if he does, let him buy a broom and sweep a crossing. She was always dangling and ogling after him, I recollect now; and I've no doubt she was put on by her old sharper of a father.\"\n\"Mr. Sedley was your very good friend, sir,\" Dobbin interposed, almost pleased at finding himself growing angry. \"Time was you called him better names than rogue and swindler. The match was of your making. George had no right to play fast and loose--\"\n\"Fast and loose!\" howled out old Osborne. \"Fast and loose! Why, hang me, those are the very words my gentleman used himself when he gave himself airs, last Thursday was a fortnight, and talked about the British army to his father who made him. What, it's you who have been a setting of him up--is it? and my service to you, CAPTAIN. It's you who want to introduce beggars into my family. Thank you for nothing, Captain. Marry HER indeed--he, he! why should he? I warrant you she'd go to him fast enough without.\"\n\"Sir,\" said Dobbin, starting up in undisguised anger; \"no man shall abuse that lady in my hearing, and you least of all.\"\n\"O, you're a-going to call me out, are you? Stop, let me ring the bell for pistols for two. Mr. George sent you here to insult his father, did he?\" Osborne said, pulling at the bell-cord.\n\"Mr. Osborne,\" said Dobbin, with a faltering voice, \"it's you who are insulting the best creature in the world. You had best spare her, sir, for she's your son's wife.\"\nAnd with this, feeling that he could say no more, Dobbin went away, Osborne sinking back in his chair, and looking wildly after him. A clerk came in, obedient to the bell; and the Captain was scarcely out of the court where Mr. Osborne's offices were, when Mr. Chopper the chief clerk came rushing hatless after him.\n\"For God's sake, what is it?\" Mr. Chopper said, catching the Captain by the skirt. \"The governor's in a fit. What has Mr. George been doing?\"\n\"He married Miss Sedley five days ago,\" Dobbin replied. \"I was his groomsman, Mr. Chopper, and you must stand his friend.\"\nThe old clerk shook his head. \"If that's your news, Captain, it's bad. The governor will never forgive him.\"\nDobbin begged Chopper to report progress to him at the hotel where he was stopping, and walked off moodily westwards, greatly perturbed as to the past and the future.\nWhen the Russell Square family came to dinner that evening, they found the father of the house seated in his usual place, but with that air of gloom on his face, which, whenever it appeared there, kept the whole circle silent. The ladies, and Mr. Bullock who dined with them, felt that the news had been communicated to Mr. Osborne. His dark looks affected Mr. Bullock so far as to render him still and quiet: but he was unusually bland and attentive to Miss Maria, by whom he sat, and to her sister presiding at the head of the table.\nMiss Wirt, by consequence, was alone on her side of the board, a gap being left between her and Miss Jane Osborne. Now this was George's place when he dined at home; and his cover, as we said, was laid for him in expectation of that truant's return. Nothing occurred during dinner-time except smiling Mr. Frederick's flagging confidential whispers, and the clinking of plate and china, to interrupt the silence of the repast. The servants went about stealthily doing their duty. Mutes at funerals could not look more glum than the domestics of Mr. Osborne The neck of venison of which he had invited Dobbin to partake, was carved by him in perfect silence; but his own share went away almost untasted, though he drank much, and the butler assiduously filled his glass.\nAt last, just at the end of the dinner, his eyes, which had been staring at everybody in turn, fixed themselves for a while upon the plate laid for George. He pointed to it presently with his left hand. His daughters looked at him and did not comprehend, or choose to comprehend, the signal; nor did the servants at first understand it.\n\"Take that plate away,\" at last he said, getting up with an oath--and with this pushing his chair back, he walked into his own room.\nBehind Mr. Osborne's dining-room was the usual apartment which went in his house by the name of the study; and was sacred to the master of the house. Hither Mr. Osborne would retire of a Sunday forenoon when not minded to go to church; and here pass the morning in his crimson leather chair, reading the paper. A couple of glazed book-cases were here, containing standard works in stout gilt bindings. The \"Annual Register,\" the \"Gentleman's Magazine,\" \"Blair's Sermons,\" and \"Hume and Smollett.\" From year's end to year's end he never took one of these volumes from the shelf; but there was no member of the family that would dare for his life to touch one of the books, except upon those rare Sunday evenings when there was no dinner-party, and when the great scarlet Bible and Prayer-book were taken out from the corner where they stood beside his copy of the Peerage, and the servants being rung up to the dining parlour, Osborne read the evening service to his family in a loud grating pompous voice. No member of the household, child, or domestic, ever entered that room without a certain terror. Here he checked the housekeeper's accounts, and overhauled the butler's cellar-book. Hence he could command, across the clean gravel court-yard, the back entrance of the stables with which one of his bells communicated, and into this yard the coachman issued from his premises as into a dock, and Osborne swore at him from the study window. Four times a year Miss Wirt entered this apartment to get her salary; and his daughters to receive their quarterly allowance. George as a boy had been horsewhipped in this room many times; his mother sitting sick on the stair listening to the cuts of the whip. The boy was scarcely ever known to cry under the punishment; the poor woman used to fondle and kiss him secretly, and give him money to soothe him when he came out.\nThere was a picture of the family over the mantelpiece, removed thither from the front room after Mrs. Osborne's death--George was on a pony, the elder sister holding him up a bunch of flowers; the younger led by her mother's hand; all with red cheeks and large red mouths, simpering on each other in the approved family-portrait manner. The mother lay underground now, long since forgotten--the sisters and brother had a hundred different interests of their own, and, familiar still, were utterly estranged from each other. Some few score of years afterwards, when all the parties represented are grown old, what bitter satire there is in those flaunting childish family-portraits, with their farce of sentiment and smiling lies, and innocence so self-conscious and self-satisfied. Osborne's own state portrait, with that of his great silver inkstand and arm-chair, had taken the place of honour in the dining-room, vacated by the family-piece.\nTo this study old Osborne retired then, greatly to the relief of the small party whom he left. When the servants had withdrawn, they began to talk for a while volubly but very low; then they went upstairs quietly, Mr. Bullock accompanying them stealthily on his creaking shoes. He had no heart to sit alone drinking wine, and so close to the terrible old gentleman in the study hard at hand.\nAn hour at least after dark, the butler, not having received any summons, ventured to tap at his door and take him in wax candles and tea. The master of the house sate in his chair, pretending to read the paper, and when the servant, placing the lights and refreshment on the table by him, retired, Mr. Osborne got up and locked the door after him. This time there was no mistaking the matter; all the household knew that some great catastrophe was going to happen which was likely direly to affect Master George.\nIn the large shining mahogany escritoire Mr. Osborne had a drawer especially devoted to his son's affairs and papers. Here he kept all the documents relating to him ever since he had been a boy: here were his prize copy-books and drawing-books, all bearing George's hand, and that of the master: here were his first letters in large round-hand sending his love to papa and mamma, and conveying his petitions for a cake. His dear godpapa Sedley was more than once mentioned in them. Curses quivered on old Osborne's livid lips, and horrid hatred and disappointment writhed in his heart, as looking through some of these papers he came on that name. They were all marked and docketed, and tied with red tape. It was--\"From Georgy, requesting 5s., April 23, 18--; answered, April 25\"--or \"Georgy about a pony, October 13\"--and so forth. In another packet were \"Dr. S.'s accounts\"--\"G.'s tailor's bills and outfits, drafts on me by G. Osborne, jun.,\" &c.--his letters from the West Indies--his agent's letters, and the newspapers containing his commissions: here was a whip he had when a boy, and in a paper a locket containing his hair, which his mother used to wear.\nTurning one over after another, and musing over these memorials, the unhappy man passed many hours. His dearest vanities, ambitious hopes, had all been here. What pride he had in his boy! He was the handsomest child ever seen. Everybody said he was like a nobleman's son. A royal princess had remarked him, and kissed him, and asked his name in Kew Gardens. What City man could show such another? Could a prince have been better cared for? Anything that money could buy had been his son's. He used to go down on speech-days with four horses and new liveries, and scatter new shillings among the boys at the school where George was: when he went with George to the depot of his regiment, before the boy embarked for Canada, he gave the officers such a dinner as the Duke of York might have sat down to. Had he ever refused a bill when George drew one? There they were--paid without a word. Many a general in the army couldn't ride the horses he had! He had the child before his eyes, on a hundred different days when he remembered George after dinner, when he used to come in as bold as a lord and drink off his glass by his father's side, at the head of the table--on the pony at Brighton, when he cleared the hedge and kept up with the huntsman--on the day when he was presented to the Prince Regent at the levee, when all Saint James's couldn't produce a finer young fellow. And this, this was the end of all!--to marry a bankrupt and fly in the face of duty and fortune! What humiliation and fury: what pangs of sickening rage, balked ambition and love; what wounds of outraged vanity, tenderness even, had this old worldling now to suffer under!\nHaving examined these papers, and pondered over this one and the other, in that bitterest of all helpless woe, with which miserable men think of happy past times--George's father took the whole of the documents out of the drawer in which he had kept them so long, and locked them into a writing-box, which he tied, and sealed with his seal. Then he opened the book-case, and took down the great red Bible we have spoken of a pompous book, seldom looked at, and shining all over with gold. There was a frontispiece to the volume, representing Abraham sacrificing Isaac. Here, according to custom, Osborne had recorded on the fly-leaf, and in his large clerk-like hand, the dates of his marriage and his wife's death, and the births and Christian names of his children. Jane came first, then George Sedley Osborne, then Maria Frances, and the days of the christening of each. Taking a pen, he carefully obliterated George's names from the page; and when the leaf was quite dry, restored the volume to the place from which he had moved it. Then he took a document out of another drawer, where his own private papers were kept; and having read it, crumpled it up and lighted it at one of the candles, and saw it burn entirely away in the grate. It was his will; which being burned, he sate down and wrote off a letter, and rang for his servant, whom he charged to deliver it in the morning. It was morning already: as he went up to bed, the whole house was alight with the sunshine; and the birds were singing among the fresh green leaves in Russell Square.\nAnxious to keep all Mr. Osborne's family and dependants in good humour, and to make as many friends as possible for George in his hour of adversity, William Dobbin, who knew the effect which good dinners and good wines have upon the soul of man, wrote off immediately on his return to his inn the most hospitable of invitations to Thomas Chopper, Esquire, begging that gentleman to dine with him at the Slaughters' next day. The note reached Mr. Chopper before he left the City, and the instant reply was, that \"Mr. Chopper presents his respectful compliments, and will have the honour and pleasure of waiting on Captain D.\" The invitation and the rough draft of the answer were shown to Mrs. Chopper and her daughters on his return to Somers' Town that evening, and they talked about military gents and West End men with great exultation as the family sate and partook of tea. When the girls had gone to rest, Mr. and Mrs. C. discoursed upon the strange events which were occurring in the governor's family. Never had the clerk seen his principal so moved. When he went in to Mr. Osborne, after Captain Dobbin's departure, Mr. Chopper found his chief black in the face, and all but in a fit: some dreadful quarrel, he was certain, had occurred between Mr. O. and the young Captain. Chopper had been instructed to make out an account of all sums paid to Captain Osborne within the last three years. \"And a precious lot of money he has had too,\" the chief clerk said, and respected his old and young master the more, for the liberal way in which the guineas had been flung about. The dispute was something about Miss Sedley. Mrs. Chopper vowed and declared she pitied that poor young lady to lose such a handsome young fellow as the Capting. As the daughter of an unlucky speculator, who had paid a very shabby dividend, Mr. Chopper had no great regard for Miss Sedley. He respected the house of Osborne before all others in the City of London: and his hope and wish was that Captain George should marry a nobleman's daughter. The clerk slept a great deal sounder than his principal that night; and, cuddling his children after breakfast (of which he partook with a very hearty appetite, though his modest cup of life was only sweetened with brown sugar), he set off in his best Sunday suit and frilled shirt for business, promising his admiring wife not to punish Captain D.'s port too severely that evening.\nMr. Osborne's countenance, when he arrived in the City at his usual time, struck those dependants who were accustomed, for good reasons, to watch its expression, as peculiarly ghastly and worn. At twelve o'clock Mr. Higgs (of the firm of Higgs & Blatherwick, solicitors, Bedford Row) called by appointment, and was ushered into the governor's private room, and closeted there for more than an hour. At about one Mr. Chopper received a note brought by Captain Dobbin's man, and containing an inclosure for Mr. Osborne, which the clerk went in and delivered. A short time afterwards Mr. Chopper and Mr. Birch, the next clerk, were summoned, and requested to witness a paper. \"I've been making a new will,\" Mr. Osborne said, to which these gentlemen appended their names accordingly. No conversation passed. Mr. Higgs looked exceedingly grave as he came into the outer rooms, and very hard in Mr. Chopper's face; but there were not any explanations. It was remarked that Mr. Osborne was particularly quiet and gentle all day, to the surprise of those who had augured ill from his darkling demeanour. He called no man names that day, and was not heard to swear once. He left business early; and before going away, summoned his chief clerk once more, and having given him general instructions, asked him, after some seeming hesitation and reluctance to speak, if he knew whether Captain Dobbin was in town?\nChopper said he believed he was. Indeed both of them knew the fact perfectly.\nOsborne took a letter directed to that officer, and giving it to the clerk, requested the latter to deliver it into Dobbin's own hands immediately.\n\"And now, Chopper,\" says he, taking his hat, and with a strange look, \"my mind will be easy.\" Exactly as the clock struck two (there was no doubt an appointment between the pair) Mr. Frederick Bullock called, and he and Mr. Osborne walked away together.\nThe Colonel of the --th regiment, in which Messieurs Dobbin and Osborne had companies, was an old General who had made his first campaign under Wolfe at Quebec, and was long since quite too old and feeble for command; but he took some interest in the regiment of which he was the nominal head, and made certain of his young officers welcome at his table, a kind of hospitality which I believe is not now common amongst his brethren. Captain Dobbin was an especial favourite of this old General. Dobbin was versed in the literature of his profession, and could talk about the great Frederick, and the Empress Queen, and their wars, almost as well as the General himself, who was indifferent to the triumphs of the present day, and whose heart was with the tacticians of fifty years back. This officer sent a summons to Dobbin to come and breakfast with him, on the morning when Mr. Osborne altered his will and Mr. Chopper put on his best shirt frill, and then informed his young favourite, a couple of days in advance, of that which they were all expecting--a marching order to go to Belgium. The order for the regiment to hold itself in readiness would leave the Horse Guards in a day or two; and as transports were in plenty, they would get their route before the week was over. Recruits had come in during the stay of the regiment at Chatham; and the old General hoped that the regiment which had helped to beat Montcalm in Canada, and to rout Mr. Washington on Long Island, would prove itself worthy of its historical reputation on the oft-trodden battle-grounds of the Low Countries. \"And so, my good friend, if you have any affaire la,\" said the old General, taking a pinch of snuff with his trembling white old hand, and then pointing to the spot of his robe de chambre under which his heart was still feebly beating, \"if you have any Phillis to console, or to bid farewell to papa and mamma, or any will to make, I recommend you to set about your business without delay.\" With which the General gave his young friend a finger to shake, and a good-natured nod of his powdered and pigtailed head; and the door being closed upon Dobbin, sate down to pen a poulet (he was exceedingly vain of his French) to Mademoiselle Amenaide of His Majesty's Theatre.\nThis news made Dobbin grave, and he thought of our friends at Brighton, and then he was ashamed of himself that Amelia was always the first thing in his thoughts (always before anybody--before father and mother, sisters and duty--always at waking and sleeping indeed, and all day long); and returning to his hotel, he sent off a brief note to Mr. Osborne acquainting him with the information which he had received, and which might tend farther, he hoped, to bring about a reconciliation with George.\nThis note, despatched by the same messenger who had carried the invitation to Chopper on the previous day, alarmed the worthy clerk not a little. It was inclosed to him, and as he opened the letter he trembled lest the dinner should be put off on which he was calculating. His mind was inexpressibly relieved when he found that the envelope was only a reminder for himself. (\"I shall expect you at half-past five,\" Captain Dobbin wrote.) He was very much interested about his employer's family; but, que voulez-vous? a grand dinner was of more concern to him than the affairs of any other mortal.\nDobbin was quite justified in repeating the General's information to any officers of the regiment whom he should see in the course of his peregrinations; accordingly he imparted it to Ensign Stubble, whom he met at the agent's, and who--such was his military ardour--went off instantly to purchase a new sword at the accoutrement-maker's. Here this young fellow, who, though only seventeen years of age, and about sixty-five inches high, with a constitution naturally rickety and much impaired by premature brandy and water, had an undoubted courage and a lion's heart, poised, tried, bent, and balanced a weapon such as he thought would do execution amongst Frenchmen. Shouting \"Ha, ha!\" and stamping his little feet with tremendous energy, he delivered the point twice or thrice at Captain Dobbin, who parried the thrust laughingly with his bamboo walking-stick.\nMr. Stubble, as may be supposed from his size and slenderness, was of the Light Bobs. Ensign Spooney, on the contrary, was a tall youth, and belonged to (Captain Dobbin's) the Grenadier Company, and he tried on a new bearskin cap, under which he looked savage beyond his years. Then these two lads went off to the Slaughters', and having ordered a famous dinner, sate down and wrote off letters to the kind anxious parents at home--letters full of love and heartiness, and pluck and bad spelling. Ah! there were many anxious hearts beating through England at that time; and mothers' prayers and tears flowing in many homesteads.\nSeeing young Stubble engaged in composition at one of the coffee-room tables at the Slaughters', and the tears trickling down his nose on to the paper (for the youngster was thinking of his mamma, and that he might never see her again), Dobbin, who was going to write off a letter to George Osborne, relented, and locked up his desk. \"Why should I?\" said he. \"Let her have this night happy. I'll go and see my parents early in the morning, and go down to Brighton myself to-morrow.\"\nSo he went up and laid his big hand on young Stubble's shoulder, and backed up that young champion, and told him if he would leave off brandy and water he would be a good soldier, as he always was a gentlemanly good-hearted fellow. Young Stubble's eyes brightened up at this, for Dobbin was greatly respected in the regiment, as the best officer and the cleverest man in it.\n\"Thank you, Dobbin,\" he said, rubbing his eyes with his knuckles, \"I was just--just telling her I would. And, O Sir, she's so dam kind to me.\" The water pumps were at work again, and I am not sure that the soft-hearted Captain's eyes did not also twinkle.\nThe two ensigns, the Captain, and Mr. Chopper, dined together in the same box. Chopper brought the letter from Mr. Osborne, in which the latter briefly presented his compliments to Captain Dobbin, and requested him to forward the inclosed to Captain George Osborne. Chopper knew nothing further; he described Mr. Osborne's appearance, it is true, and his interview with his lawyer, wondered how the governor had sworn at nobody, and--especially as the wine circled round--abounded in speculations and conjectures. But these grew more vague with every glass, and at length became perfectly unintelligible. At a late hour Captain Dobbin put his guest into a hackney coach, in a hiccupping state, and swearing that he would be the kick--the kick--Captain's friend for ever and ever.\nWhen Captain Dobbin took leave of Miss Osborne we have said that he asked leave to come and pay her another visit, and the spinster expected him for some hours the next day, when, perhaps, had he come, and had he asked her that question which she was prepared to answer, she would have declared herself as her brother's friend, and a reconciliation might have been effected between George and his angry father. But though she waited at home the Captain never came. He had his own affairs to pursue; his own parents to visit and console; and at an early hour of the day to take his place on the Lightning coach, and go down to his friends at Brighton. In the course of the day Miss Osborne heard her father give orders that that meddling scoundrel, Captain Dobbin, should never be admitted within his doors again, and any hopes in which she may have indulged privately were thus abruptly brought to an end. Mr. Frederick Bullock came, and was particularly affectionate to Maria, and attentive to the broken-spirited old gentleman. For though he said his mind would be easy, the means which he had taken to secure quiet did not seem to have succeeded as yet, and the events of the past two days had visibly shattered him.",
        "paragraph_chars": [
            [
                0,
                860
            ],
            [
                860,
                1380
            ],
            [
                1380,
                2009
            ],
            [
                2009,
                2546
            ],
            [
                2546,
                2825
            ],
            [
                2825,
                3270
            ],
            [
                3270,
                3521
            ],
            [
                3521,
                3664
            ],
            [
                3664,
                4006
            ],
            [
                4006,
                4819
            ],
            [
                4819,
                6149
            ],
            [
                6149,
                6538
            ],
            [
                6538,
                6842
            ],
            [
                6842,
                6952
            ],
            [
                6952,
                7579
            ],
            [
                7579,
                7831
            ],
            [
                7831,
                8344
            ],
            [
                8344,
                8466
            ],
            [
                8466,
                8654
            ],
            [
                8654,
                8823
            ],
            [
                8823,
                9140
            ],
            [
                9140,
                9282
            ],
            [
                9282,
                9405
            ],
            [
                9405,
                9514
            ],
            [
                9514,
                9681
            ],
            [
                9681,
                10217
            ],
            [
                10217,
                10986
            ],
            [
                10986,
                11323
            ],
            [
                11323,
                11456
            ],
            [
                11456,
                13326
            ],
            [
                13326,
                14272
            ],
            [
                14272,
                14664
            ],
            [
                14664,
                15178
            ],
            [
                15178,
                16343
            ],
            [
                16343,
                17993
            ],
            [
                17993,
                19547
            ],
            [
                19547,
                21956
            ],
            [
                21956,
                23358
            ],
            [
                23358,
                23436
            ],
            [
                23436,
                23584
            ],
            [
                23584,
                23838
            ],
            [
                23838,
                26097
            ],
            [
                26097,
                26597
            ],
            [
                26597,
                27194
            ],
            [
                27194,
                28059
            ],
            [
                28059,
                28688
            ],
            [
                28688,
                29171
            ],
            [
                29171,
                29546
            ],
            [
                29546,
                29802
            ],
            [
                29802,
                30582
            ],
            [
                30582,
                31801
            ]
        ],
        "segment_chars": [
            [
                0,
                146
            ],
            [
                146,
                349
            ],
            [
                349,
                652
            ],
            [
                652,
                860
            ],
            [
                860,
                1218
            ],
            [
                1218,
                1380
            ],
            [
                1380,
                1467
            ],
            [
                1467,
                1540
            ],
            [
                1540,
                1594
            ],
            [
                1594,
                1672
            ],
            [
                1672,
                1958
            ],
            [
                1958,
                2009
            ],
            [
                2009,
                2086
            ],
            [
                2086,
                2228
            ],
            [
                2228,
                2283
            ],
            [
                2283,
                2336
            ],
            [
                2336,
                2374
            ],
            [
                2374,
                2546
            ],
            [
                2546,
                2702
            ],
            [
                2702,
                2773
            ],
            [
                2773,
                2825
            ],
            [
                2825,
                2867
            ],
            [
                2867,
                2923
            ],
            [
                2923,
                3083
            ],
            [
                3083,
                3182
            ],
            [
                3182,
                3204
            ],
            [
                3204,
                3270
            ],
            [
                3270,
                3321
            ],
            [
                3321,
                3410
            ],
            [
                3410,
                3521
            ],
            [
                3521,
                3556
            ],
            [
                3556,
                3604
            ],
            [
                3604,
                3664
            ],
            [
                3664,
                3900
            ],
            [
                3900,
                4006
            ],
            [
                4006,
                4110
            ],
            [
                4110,
                4176
            ],
            [
                4176,
                4220
            ],
            [
                4220,
                4267
            ],
            [
                4267,
                4352
            ],
            [
                4352,
                4411
            ],
            [
                4411,
                4498
            ],
            [
                4498,
                4514
            ],
            [
                4514,
                4819
            ],
            [
                4819,
                4949
            ],
            [
                4949,
                4960
            ],
            [
                4960,
                5010
            ],
            [
                5010,
                5094
            ],
            [
                5094,
                5123
            ],
            [
                5123,
                5208
            ],
            [
                5208,
                5221
            ],
            [
                5221,
                5234
            ],
            [
                5234,
                5258
            ],
            [
                5258,
                5404
            ],
            [
                5404,
                5416
            ],
            [
                5416,
                5445
            ],
            [
                5445,
                5541
            ],
            [
                5541,
                5588
            ],
            [
                5588,
                5607
            ],
            [
                5607,
                5630
            ],
            [
                5630,
                5657
            ],
            [
                5657,
                5704
            ],
            [
                5704,
                5868
            ],
            [
                5868,
                5903
            ],
            [
                5903,
                5928
            ],
            [
                5928,
                5973
            ],
            [
                5973,
                5987
            ],
            [
                5987,
                6005
            ],
            [
                6005,
                6065
            ],
            [
                6065,
                6093
            ],
            [
                6093,
                6149
            ],
            [
                6149,
                6210
            ],
            [
                6210,
                6290
            ],
            [
                6290,
                6336
            ],
            [
                6336,
                6354
            ],
            [
                6354,
                6416
            ],
            [
                6416,
                6538
            ],
            [
                6538,
                6633
            ],
            [
                6633,
                6685
            ],
            [
                6685,
                6730
            ],
            [
                6730,
                6780
            ],
            [
                6780,
                6842
            ],
            [
                6842,
                6952
            ],
            [
                6952,
                6971
            ],
            [
                6971,
                6999
            ],
            [
                6999,
                7227
            ],
            [
                7227,
                7299
            ],
            [
                7299,
                7330
            ],
            [
                7330,
                7385
            ],
            [
                7385,
                7450
            ],
            [
                7450,
                7579
            ],
            [
                7579,
                7692
            ],
            [
                7692,
                7755
            ],
            [
                7755,
                7785
            ],
            [
                7785,
                7831
            ],
            [
                7831,
                7849
            ],
            [
                7849,
                7873
            ],
            [
                7873,
                7890
            ],
            [
                7890,
                8075
            ],
            [
                8075,
                8132
            ],
            [
                8132,
                8164
            ],
            [
                8164,
                8219
            ],
            [
                8219,
                8251
            ],
            [
                8251,
                8277
            ],
            [
                8277,
                8292
            ],
            [
                8292,
                8344
            ],
            [
                8344,
                8466
            ],
            [
                8466,
                8510
            ],
            [
                8510,
                8558
            ],
            [
                8558,
                8614
            ],
            [
                8614,
                8654
            ],
            [
                8654,
                8766
            ],
            [
                8766,
                8823
            ],
            [
                8823,
                8956
            ],
            [
                8956,
                9140
            ],
            [
                9140,
                9170
            ],
            [
                9170,
                9223
            ],
            [
                9223,
                9249
            ],
            [
                9249,
                9282
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9405
            ],
            [
                9405,
                9435
            ],
            [
                9435,
                9476
            ],
            [
                9476,
                9514
            ],
            [
                9514,
                9681
            ],
            [
                9681,
                9908
            ],
            [
                9908,
                10014
            ],
            [
                10014,
                10217
            ],
            [
                10217,
                10332
            ],
            [
                10332,
                10467
            ],
            [
                10467,
                10643
            ],
            [
                10643,
                10696
            ],
            [
                10696,
                10986
            ],
            [
                10986,
                11142
            ],
            [
                11142,
                11189
            ],
            [
                11189,
                11323
            ],
            [
                11323,
                11456
            ],
            [
                11456,
                11606
            ],
            [
                11606,
                11767
            ],
            [
                11767,
                11858
            ],
            [
                11858,
                11953
            ],
            [
                11953,
                12462
            ],
            [
                12462,
                12559
            ],
            [
                12559,
                12644
            ],
            [
                12644,
                12900
            ],
            [
                12900,
                13026
            ],
            [
                13026,
                13161
            ],
            [
                13161,
                13326
            ],
            [
                13326,
                13664
            ],
            [
                13664,
                13851
            ],
            [
                13851,
                14109
            ],
            [
                14109,
                14272
            ],
            [
                14272,
                14367
            ],
            [
                14367,
                14550
            ],
            [
                14550,
                14664
            ],
            [
                14664,
                14803
            ],
            [
                14803,
                15013
            ],
            [
                15013,
                15178
            ],
            [
                15178,
                15296
            ],
            [
                15296,
                15598
            ],
            [
                15598,
                15660
            ],
            [
                15660,
                15826
            ],
            [
                15826,
                15885
            ],
            [
                15885,
                16012
            ],
            [
                16012,
                16343
            ],
            [
                16343,
                16443
            ],
            [
                16443,
                16501
            ],
            [
                16501,
                16531
            ],
            [
                16531,
                16570
            ],
            [
                16570,
                16615
            ],
            [
                16615,
                16701
            ],
            [
                16701,
                16740
            ],
            [
                16740,
                16783
            ],
            [
                16783,
                16833
            ],
            [
                16833,
                17145
            ],
            [
                17145,
                17194
            ],
            [
                17194,
                17232
            ],
            [
                17232,
                17292
            ],
            [
                17292,
                17720
            ],
            [
                17720,
                17817
            ],
            [
                17817,
                17993
            ],
            [
                17993,
                18334
            ],
            [
                18334,
                18482
            ],
            [
                18482,
                18562
            ],
            [
                18562,
                18761
            ],
            [
                18761,
                18867
            ],
            [
                18867,
                19030
            ],
            [
                19030,
                19234
            ],
            [
                19234,
                19380
            ],
            [
                19380,
                19547
            ],
            [
                19547,
                19972
            ],
            [
                19972,
                20425
            ],
            [
                20425,
                20556
            ],
            [
                20556,
                20605
            ],
            [
                20605,
                20830
            ],
            [
                20830,
                20946
            ],
            [
                20946,
                21126
            ],
            [
                21126,
                21171
            ],
            [
                21171,
                21288
            ],
            [
                21288,
                21416
            ],
            [
                21416,
                21573
            ],
            [
                21573,
                21956
            ],
            [
                21956,
                22150
            ],
            [
                22150,
                22355
            ],
            [
                22355,
                22513
            ],
            [
                22513,
                22629
            ],
            [
                22629,
                22737
            ],
            [
                22737,
                22761
            ],
            [
                22761,
                22903
            ],
            [
                22903,
                23053
            ],
            [
                23053,
                23119
            ],
            [
                23119,
                23358
            ],
            [
                23358,
                23391
            ],
            [
                23391,
                23436
            ],
            [
                23436,
                23584
            ],
            [
                23584,
                23678
            ],
            [
                23678,
                23838
            ],
            [
                23838,
                24271
            ],
            [
                24271,
                24333
            ],
            [
                24333,
                24625
            ],
            [
                24625,
                24931
            ],
            [
                24931,
                25119
            ],
            [
                25119,
                25427
            ],
            [
                25427,
                25818
            ],
            [
                25818,
                26097
            ],
            [
                26097,
                26597
            ],
            [
                26597,
                26743
            ],
            [
                26743,
                26870
            ],
            [
                26870,
                26971
            ],
            [
                26971,
                27035
            ],
            [
                27035,
                27114
            ],
            [
                27114,
                27194
            ],
            [
                27194,
                27533
            ],
            [
                27533,
                27864
            ],
            [
                27864,
                27883
            ],
            [
                27883,
                28059
            ],
            [
                28059,
                28145
            ],
            [
                28145,
                28337
            ],
            [
                28337,
                28556
            ],
            [
                28556,
                28560
            ],
            [
                28560,
                28688
            ],
            [
                28688,
                29022
            ],
            [
                29022,
                29038
            ],
            [
                29038,
                29047
            ],
            [
                29047,
                29079
            ],
            [
                29079,
                29171
            ],
            [
                29171,
                29403
            ],
            [
                29403,
                29546
            ],
            [
                29546,
                29651
            ],
            [
                29651,
                29689
            ],
            [
                29689,
                29802
            ],
            [
                29802,
                29881
            ],
            [
                29881,
                30068
            ],
            [
                30068,
                30316
            ],
            [
                30316,
                30407
            ],
            [
                30407,
                30582
            ],
            [
                30582,
                30993
            ],
            [
                30993,
                31047
            ],
            [
                31047,
                31233
            ],
            [
                31233,
                31488
            ],
            [
                31488,
                31612
            ],
            [
                31612,
                31801
            ]
        ],
        "overlap_chars": [
            [
                35,
                38
            ],
            [
                39,
                79
            ],
            [
                89,
                111
            ],
            [
                116,
                120
            ],
            [
                144,
                146
            ],
            [
                307,
                313
            ],
            [
                203,
                210
            ],
            [
                146,
                176
            ],
            [
                210,
                215
            ],
            [
                245,
                272
            ],
            [
                285,
                295
            ],
            [
                347,
                349
            ],
            [
                349,
                388
            ],
            [
                414,
                440
            ],
            [
                453,
                457
            ],
            [
                458,
                463
            ],
            [
                478,
                484
            ],
            [
                494,
                529
            ],
            [
                548,
                608
            ],
            [
                636,
                643
            ],
            [
                625,
                632
            ],
            [
                650,
                652
            ],
            [
                819,
                830
            ],
            [
                858,
                860
            ],
            [
                860,
                872
            ],
            [
                936,
                966
            ],
            [
                977,
                1015
            ],
            [
                1021,
                1027
            ],
            [
                1216,
                1218
            ],
            [
                1348,
                1351
            ],
            [
                1293,
                1294
            ],
            [
                1220,
                1247
            ],
            [
                1260,
                1263
            ],
            [
                1303,
                1347
            ],
            [
                1357,
                1380
            ],
            [
                1396,
                1397
            ],
            [
                1380,
                1392
            ],
            [
                1402,
                1467
            ],
            [
                1467,
                1499
            ],
            [
                1520,
                1540
            ],
            [
                1672,
                1681
            ],
            [
                1682,
                1726
            ],
            [
                1727,
                1730
            ],
            [
                1742,
                1752
            ],
            [
                1776,
                1784
            ],
            [
                1888,
                1889
            ],
            [
                1833,
                1836
            ],
            [
                1816,
                1831
            ],
            [
                1794,
                1797
            ],
            [
                1890,
                1957
            ],
            [
                2009,
                2016
            ],
            [
                2023,
                2086
            ],
            [
                2121,
                2137
            ],
            [
                2088,
                2097
            ],
            [
                2200,
                2206
            ],
            [
                2219,
                2228
            ],
            [
                2228,
                2232
            ],
            [
                2245,
                2251
            ],
            [
                2271,
                2281
            ],
            [
                2281,
                2282
            ],
            [
                2329,
                2336
            ],
            [
                2336,
                2374
            ],
            [
                2374,
                2404
            ],
            [
                2435,
                2443
            ],
            [
                2448,
                2459
            ],
            [
                2474,
                2494
            ],
            [
                2522,
                2526
            ],
            [
                2537,
                2546
            ],
            [
                2546,
                2550
            ],
            [
                2601,
                2610
            ],
            [
                2617,
                2629
            ],
            [
                2645,
                2693
            ],
            [
                2697,
                2702
            ],
            [
                2702,
                2727
            ],
            [
                2745,
                2749
            ],
            [
                2730,
                2737
            ],
            [
                2749,
                2773
            ],
            [
                2773,
                2825
            ],
            [
                2825,
                2867
            ],
            [
                2867,
                2871
            ],
            [
                2881,
                2882
            ],
            [
                2884,
                2923
            ],
            [
                2923,
                3030
            ],
            [
                3058,
                3083
            ],
            [
                3083,
                3179
            ],
            [
                3204,
                3205
            ],
            [
                3213,
                3260
            ],
            [
                3264,
                3268
            ],
            [
                3268,
                3270
            ],
            [
                3270,
                3321
            ],
            [
                3321,
                3368
            ],
            [
                3391,
                3410
            ],
            [
                3410,
                3456
            ],
            [
                3470,
                3521
            ],
            [
                3521,
                3556
            ],
            [
                3573,
                3578
            ],
            [
                3590,
                3594
            ],
            [
                3579,
                3585
            ],
            [
                3597,
                3604
            ],
            [
                3604,
                3642
            ],
            [
                3647,
                3664
            ],
            [
                3664,
                3676
            ],
            [
                3678,
                3696
            ],
            [
                3773,
                3824
            ],
            [
                3826,
                3856
            ],
            [
                3863,
                3885
            ],
            [
                3900,
                4006
            ],
            [
                4006,
                4027
            ],
            [
                4036,
                4050
            ],
            [
                4058,
                4068
            ],
            [
                4087,
                4094
            ],
            [
                4099,
                4110
            ],
            [
                4110,
                4176
            ],
            [
                4430,
                4447
            ],
            [
                4453,
                4461
            ],
            [
                4498,
                4505
            ],
            [
                4512,
                4514
            ],
            [
                4514,
                4530
            ],
            [
                4535,
                4584
            ],
            [
                4817,
                4819
            ],
            [
                4819,
                4949
            ],
            [
                4949,
                4960
            ],
            [
                4960,
                4969
            ],
            [
                4978,
                4985
            ],
            [
                4970,
                4977
            ],
            [
                4986,
                5010
            ],
            [
                5123,
                5147
            ],
            [
                5195,
                5208
            ],
            [
                5258,
                5299
            ],
            [
                5304,
                5312
            ],
            [
                5325,
                5342
            ],
            [
                5344,
                5383
            ],
            [
                5385,
                5404
            ],
            [
                5416,
                5445
            ],
            [
                5445,
                5472
            ],
            [
                5539,
                5541
            ],
            [
                5541,
                5588
            ],
            [
                5607,
                5628
            ],
            [
                5635,
                5636
            ],
            [
                5637,
                5657
            ],
            [
                5657,
                5704
            ],
            [
                5704,
                5734
            ],
            [
                5774,
                5835
            ],
            [
                5846,
                5868
            ],
            [
                6005,
                6009
            ],
            [
                6017,
                6043
            ],
            [
                6050,
                6065
            ],
            [
                6093,
                6149
            ],
            [
                6210,
                6222
            ],
            [
                6236,
                6245
            ],
            [
                6258,
                6259
            ],
            [
                6182,
                6188
            ],
            [
                6263,
                6290
            ],
            [
                6290,
                6336
            ],
            [
                6354,
                6416
            ],
            [
                6416,
                6437
            ],
            [
                6453,
                6467
            ],
            [
                6492,
                6538
            ],
            [
                6538,
                6585
            ],
            [
                6595,
                6633
            ],
            [
                6633,
                6650
            ],
            [
                6656,
                6661
            ],
            [
                6651,
                6655
            ],
            [
                6672,
                6685
            ],
            [
                6685,
                6730
            ],
            [
                6730,
                6762
            ],
            [
                6769,
                6780
            ],
            [
                6780,
                6810
            ],
            [
                6828,
                6842
            ],
            [
                6842,
                6919
            ],
            [
                6952,
                6971
            ],
            [
                6971,
                6997
            ],
            [
                7018,
                7038
            ],
            [
                7039,
                7054
            ],
            [
                7112,
                7137
            ],
            [
                7165,
                7227
            ],
            [
                7227,
                7247
            ],
            [
                7252,
                7297
            ],
            [
                7330,
                7383
            ],
            [
                7385,
                7386
            ],
            [
                7391,
                7394
            ],
            [
                7396,
                7450
            ],
            [
                7450,
                7473
            ],
            [
                7485,
                7494
            ],
            [
                7511,
                7579
            ],
            [
                7579,
                7692
            ],
            [
                7692,
                7755
            ],
            [
                7755,
                7785
            ],
            [
                7785,
                7827
            ],
            [
                7831,
                7849
            ],
            [
                7849,
                7873
            ],
            [
                7873,
                7890
            ],
            [
                7890,
                7928
            ],
            [
                7960,
                7962
            ],
            [
                7942,
                7954
            ],
            [
                8073,
                8075
            ],
            [
                8075,
                8103
            ],
            [
                8106,
                8113
            ],
            [
                8117,
                8123
            ],
            [
                8125,
                8130
            ],
            [
                8130,
                8132
            ],
            [
                8164,
                8219
            ],
            [
                8219,
                8240
            ],
            [
                8249,
                8251
            ],
            [
                8251,
                8267
            ],
            [
                8277,
                8292
            ],
            [
                8292,
                8341
            ],
            [
                8341,
                8344
            ],
            [
                8344,
                8441
            ],
            [
                8463,
                8466
            ],
            [
                8466,
                8510
            ],
            [
                8510,
                8548
            ],
            [
                8556,
                8558
            ],
            [
                8558,
                8614
            ],
            [
                8614,
                8654
            ],
            [
                8654,
                8766
            ],
            [
                8766,
                8823
            ],
            [
                8823,
                8924
            ],
            [
                8954,
                8955
            ],
            [
                8999,
                9040
            ],
            [
                9075,
                9140
            ],
            [
                9140,
                9155
            ],
            [
                9170,
                9187
            ],
            [
                9223,
                9249
            ],
            [
                9249,
                9282
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9385
            ],
            [
                9392,
                9405
            ],
            [
                9405,
                9435
            ],
            [
                9476,
                9514
            ],
            [
                9514,
                9545
            ],
            [
                9546,
                9564
            ],
            [
                9569,
                9574
            ],
            [
                9596,
                9649
            ],
            [
                9679,
                9681
            ],
            [
                9681,
                9811
            ],
            [
                9817,
                9829
            ],
            [
                9843,
                9848
            ],
            [
                9878,
                9908
            ],
            [
                9908,
                9966
            ],
            [
                10001,
                10012
            ],
            [
                9976,
                9979
            ],
            [
                9967,
                9975
            ],
            [
                10012,
                10014
            ],
            [
                10040,
                10049
            ],
            [
                10098,
                10145
            ],
            [
                10080,
                10083
            ],
            [
                10170,
                10180
            ],
            [
                10215,
                10217
            ],
            [
                10217,
                10226
            ],
            [
                10244,
                10272
            ],
            [
                10226,
                10227
            ],
            [
                10345,
                10353
            ],
            [
                10354,
                10359
            ],
            [
                10465,
                10467
            ],
            [
                10467,
                10474
            ],
            [
                10503,
                10509
            ],
            [
                10518,
                10533
            ],
            [
                10556,
                10602
            ],
            [
                10616,
                10634
            ],
            [
                10641,
                10643
            ],
            [
                10643,
                10696
            ],
            [
                10763,
                10772
            ],
            [
                10886,
                10891
            ],
            [
                10758,
                10760
            ],
            [
                10744,
                10747
            ],
            [
                10785,
                10792
            ],
            [
                10892,
                10986
            ],
            [
                10986,
                10994
            ],
            [
                11000,
                11013
            ],
            [
                11018,
                11034
            ],
            [
                11081,
                11097
            ],
            [
                11110,
                11142
            ],
            [
                11142,
                11158
            ],
            [
                11169,
                11189
            ],
            [
                11189,
                11228
            ],
            [
                11244,
                11264
            ],
            [
                11266,
                11323
            ],
            [
                11323,
                11346
            ],
            [
                11355,
                11362
            ],
            [
                11347,
                11354
            ],
            [
                11362,
                11387
            ],
            [
                11425,
                11426
            ],
            [
                11389,
                11392
            ],
            [
                11437,
                11456
            ],
            [
                11456,
                11492
            ],
            [
                11527,
                11530
            ],
            [
                11556,
                11561
            ],
            [
                11513,
                11518
            ],
            [
                11567,
                11606
            ],
            [
                11696,
                11700
            ],
            [
                11625,
                11630
            ],
            [
                11701,
                11705
            ],
            [
                11641,
                11649
            ],
            [
                11710,
                11767
            ],
            [
                11767,
                11858
            ],
            [
                12048,
                12071
            ],
            [
                12101,
                12109
            ],
            [
                12117,
                12197
            ],
            [
                12208,
                12262
            ],
            [
                12032,
                12033
            ],
            [
                12328,
                12350
            ],
            [
                12380,
                12389
            ],
            [
                12077,
                12082
            ],
            [
                12390,
                12461
            ],
            [
                12462,
                12488
            ],
            [
                12510,
                12559
            ],
            [
                12559,
                12563
            ],
            [
                12567,
                12644
            ],
            [
                12900,
                13026
            ],
            [
                13026,
                13087
            ],
            [
                13089,
                13142
            ],
            [
                13155,
                13161
            ],
            [
                13161,
                13168
            ],
            [
                13173,
                13186
            ],
            [
                13200,
                13244
            ],
            [
                13256,
                13326
            ],
            [
                13326,
                13380
            ],
            [
                13427,
                13428
            ],
            [
                13446,
                13492
            ],
            [
                13500,
                13518
            ],
            [
                13380,
                13381
            ],
            [
                13520,
                13581
            ],
            [
                13588,
                13609
            ],
            [
                13624,
                13664
            ],
            [
                13664,
                13695
            ],
            [
                13707,
                13716
            ],
            [
                13718,
                13755
            ],
            [
                13766,
                13793
            ],
            [
                13795,
                13803
            ],
            [
                13809,
                13850
            ],
            [
                14272,
                14305
            ],
            [
                14310,
                14340
            ],
            [
                14347,
                14367
            ],
            [
                14367,
                14418
            ],
            [
                14431,
                14476
            ],
            [
                14484,
                14550
            ],
            [
                14550,
                14578
            ],
            [
                14598,
                14649
            ],
            [
                14662,
                14664
            ],
            [
                14664,
                14671
            ],
            [
                14681,
                14703
            ],
            [
                14738,
                14781
            ],
            [
                14786,
                14803
            ],
            [
                14803,
                14813
            ],
            [
                14832,
                14896
            ],
            [
                14961,
                15012
            ],
            [
                15178,
                15207
            ],
            [
                15219,
                15243
            ],
            [
                15255,
                15283
            ],
            [
                15294,
                15296
            ],
            [
                15296,
                15308
            ],
            [
                15435,
                15443
            ],
            [
                15387,
                15421
            ],
            [
                15371,
                15372
            ],
            [
                15484,
                15561
            ],
            [
                15586,
                15598
            ],
            [
                15598,
                15660
            ],
            [
                15660,
                15715
            ],
            [
                15727,
                15762
            ],
            [
                15804,
                15811
            ],
            [
                15815,
                15825
            ],
            [
                15831,
                15839
            ],
            [
                15861,
                15885
            ],
            [
                15893,
                15935
            ],
            [
                15960,
                15996
            ],
            [
                15998,
                16012
            ],
            [
                16012,
                16034
            ],
            [
                16056,
                16076
            ],
            [
                16130,
                16162
            ],
            [
                16183,
                16203
            ],
            [
                16215,
                16231
            ],
            [
                16077,
                16080
            ],
            [
                16282,
                16343
            ],
            [
                16343,
                16373
            ],
            [
                16406,
                16443
            ],
            [
                16443,
                16501
            ],
            [
                16501,
                16531
            ],
            [
                16531,
                16570
            ],
            [
                16615,
                16635
            ],
            [
                16645,
                16701
            ],
            [
                16783,
                16833
            ],
            [
                17145,
                17171
            ],
            [
                17177,
                17183
            ],
            [
                17192,
                17194
            ],
            [
                17194,
                17209
            ],
            [
                17211,
                17232
            ],
            [
                17232,
                17291
            ],
            [
                17359,
                17379
            ],
            [
                17326,
                17353
            ],
            [
                17394,
                17417
            ],
            [
                17380,
                17392
            ],
            [
                17418,
                17445
            ],
            [
                17463,
                17475
            ],
            [
                17454,
                17459
            ],
            [
                17508,
                17588
            ],
            [
                17593,
                17643
            ],
            [
                17718,
                17720
            ],
            [
                17720,
                17753
            ],
            [
                17756,
                17817
            ],
            [
                17817,
                17848
            ],
            [
                17858,
                17904
            ],
            [
                17915,
                17961
            ],
            [
                17972,
                17985
            ],
            [
                17991,
                17993
            ],
            [
                18156,
                18176
            ],
            [
                18086,
                18089
            ],
            [
                18187,
                18334
            ],
            [
                18334,
                18397
            ],
            [
                18430,
                18431
            ],
            [
                18454,
                18482
            ],
            [
                18492,
                18506
            ],
            [
                18522,
                18562
            ],
            [
                18562,
                18566
            ],
            [
                18587,
                18625
            ],
            [
                18661,
                18727
            ],
            [
                18738,
                18761
            ],
            [
                18761,
                18824
            ],
            [
                18865,
                18867
            ],
            [
                18867,
                18914
            ],
            [
                18921,
                18934
            ],
            [
                19028,
                19029
            ],
            [
                19030,
                19155
            ],
            [
                19164,
                19205
            ],
            [
                19215,
                19234
            ],
            [
                19234,
                19249
            ],
            [
                19271,
                19273
            ],
            [
                19279,
                19293
            ],
            [
                19298,
                19341
            ],
            [
                19350,
                19380
            ],
            [
                19380,
                19547
            ],
            [
                19547,
                19562
            ],
            [
                19567,
                19669
            ],
            [
                19694,
                19695
            ],
            [
                19815,
                19817
            ],
            [
                19829,
                19839
            ],
            [
                19696,
                19710
            ],
            [
                19803,
                19814
            ],
            [
                19793,
                19798
            ],
            [
                19849,
                19859
            ],
            [
                19875,
                19877
            ],
            [
                19885,
                19893
            ],
            [
                19903,
                19910
            ],
            [
                19939,
                19942
            ],
            [
                19926,
                19933
            ],
            [
                19943,
                19961
            ],
            [
                19721,
                19724
            ],
            [
                19962,
                19971
            ],
            [
                20172,
                20186
            ],
            [
                20024,
                20029
            ],
            [
                19989,
                20000
            ],
            [
                20545,
                20547
            ],
            [
                20201,
                20209
            ],
            [
                20080,
                20083
            ],
            [
                20051,
                20052
            ],
            [
                20221,
                20247
            ],
            [
                20296,
                20308
            ],
            [
                20061,
                20062
            ],
            [
                20314,
                20331
            ],
            [
                20364,
                20385
            ],
            [
                20106,
                20111
            ],
            [
                20490,
                20508
            ],
            [
                20530,
                20536
            ],
            [
                20548,
                20556
            ],
            [
                20556,
                20584
            ],
            [
                20595,
                20605
            ],
            [
                20637,
                20670
            ],
            [
                20610,
                20612
            ],
            [
                20779,
                20782
            ],
            [
                20683,
                20738
            ],
            [
                20828,
                20830
            ],
            [
                20830,
                20860
            ],
            [
                20884,
                20945
            ],
            [
                20946,
                21012
            ],
            [
                21124,
                21126
            ],
            [
                21126,
                21171
            ],
            [
                21369,
                21416
            ],
            [
                21416,
                21467
            ],
            [
                21489,
                21494
            ],
            [
                21517,
                21536
            ],
            [
                21544,
                21572
            ],
            [
                21573,
                21618
            ],
            [
                21629,
                21683
            ],
            [
                21732,
                21733
            ],
            [
                21802,
                21824
            ],
            [
                21832,
                21836
            ],
            [
                21867,
                21903
            ],
            [
                21929,
                21932
            ],
            [
                21685,
                21687
            ],
            [
                21911,
                21918
            ],
            [
                21924,
                21928
            ],
            [
                21942,
                21956
            ],
            [
                21956,
                21969
            ],
            [
                21981,
                22010
            ],
            [
                22028,
                22036
            ],
            [
                22014,
                22017
            ],
            [
                22118,
                22150
            ],
            [
                22150,
                22177
            ],
            [
                22213,
                22214
            ],
            [
                22225,
                22226
            ],
            [
                22240,
                22246
            ],
            [
                22263,
                22270
            ],
            [
                22317,
                22325
            ],
            [
                22332,
                22355
            ],
            [
                22355,
                22446
            ],
            [
                22457,
                22513
            ],
            [
                22513,
                22552
            ],
            [
                22573,
                22578
            ],
            [
                22580,
                22628
            ],
            [
                22629,
                22676
            ],
            [
                22735,
                22737
            ],
            [
                22737,
                22761
            ],
            [
                22761,
                22806
            ],
            [
                22864,
                22880
            ],
            [
                22889,
                22903
            ],
            [
                22903,
                22939
            ],
            [
                22953,
                22977
            ],
            [
                23051,
                23053
            ],
            [
                23053,
                23075
            ],
            [
                23084,
                23119
            ],
            [
                23119,
                23126
            ],
            [
                23136,
                23165
            ],
            [
                23245,
                23250
            ],
            [
                23175,
                23190
            ],
            [
                23200,
                23201
            ],
            [
                23262,
                23266
            ],
            [
                23275,
                23285
            ],
            [
                23309,
                23358
            ],
            [
                23358,
                23391
            ],
            [
                23391,
                23415
            ],
            [
                23425,
                23436
            ],
            [
                23436,
                23443
            ],
            [
                23501,
                23510
            ],
            [
                23449,
                23457
            ],
            [
                23482,
                23487
            ],
            [
                23512,
                23521
            ],
            [
                23533,
                23584
            ],
            [
                23584,
                23603
            ],
            [
                23609,
                23611
            ],
            [
                23633,
                23678
            ],
            [
                23763,
                23784
            ],
            [
                23791,
                23838
            ],
            [
                23838,
                23856
            ],
            [
                23862,
                23870
            ],
            [
                23872,
                23880
            ],
            [
                23891,
                23909
            ],
            [
                23925,
                23997
            ],
            [
                24003,
                24006
            ],
            [
                24024,
                24148
            ],
            [
                24156,
                24191
            ],
            [
                24269,
                24271
            ],
            [
                24271,
                24333
            ],
            [
                24333,
                24339
            ],
            [
                24372,
                24375
            ],
            [
                24358,
                24368
            ],
            [
                24386,
                24408
            ],
            [
                24463,
                24467
            ],
            [
                24469,
                24506
            ],
            [
                24623,
                24624
            ],
            [
                24695,
                24697
            ],
            [
                24625,
                24629
            ],
            [
                24826,
                24827
            ],
            [
                24698,
                24701
            ],
            [
                24656,
                24665
            ],
            [
                24675,
                24694
            ],
            [
                24671,
                24674
            ],
            [
                24798,
                24806
            ],
            [
                24860,
                24864
            ],
            [
                24896,
                24929
            ],
            [
                24986,
                24991
            ],
            [
                24666,
                24670
            ],
            [
                25015,
                25030
            ],
            [
                24787,
                24792
            ],
            [
                25066,
                25076
            ],
            [
                24992,
                24997
            ],
            [
                25093,
                25119
            ],
            [
                25188,
                25227
            ],
            [
                25316,
                25348
            ],
            [
                25360,
                25377
            ],
            [
                25390,
                25426
            ],
            [
                25427,
                25450
            ],
            [
                25478,
                25489
            ],
            [
                25494,
                25545
            ],
            [
                25552,
                25560
            ],
            [
                25661,
                25777
            ],
            [
                25802,
                25818
            ],
            [
                26007,
                26009
            ],
            [
                25841,
                25845
            ],
            [
                25886,
                25939
            ],
            [
                26095,
                26097
            ],
            [
                26097,
                26177
            ],
            [
                26185,
                26192
            ],
            [
                26204,
                26226
            ],
            [
                26231,
                26236
            ],
            [
                26243,
                26258
            ],
            [
                26267,
                26281
            ],
            [
                26327,
                26356
            ],
            [
                26363,
                26368
            ],
            [
                26357,
                26363
            ],
            [
                26369,
                26381
            ],
            [
                26388,
                26419
            ],
            [
                26424,
                26439
            ],
            [
                26440,
                26451
            ],
            [
                26468,
                26472
            ],
            [
                26477,
                26488
            ],
            [
                26307,
                26308
            ],
            [
                26516,
                26527
            ],
            [
                26540,
                26551
            ],
            [
                26555,
                26597
            ],
            [
                27194,
                27204
            ],
            [
                27375,
                27377
            ],
            [
                27234,
                27291
            ],
            [
                27297,
                27299
            ],
            [
                27378,
                27412
            ],
            [
                27422,
                27429
            ],
            [
                27461,
                27503
            ],
            [
                27531,
                27533
            ],
            [
                27538,
                27555
            ],
            [
                27560,
                27638
            ],
            [
                27662,
                27669
            ],
            [
                27639,
                27651
            ],
            [
                27717,
                27722
            ],
            [
                27726,
                27743
            ],
            [
                27670,
                27673
            ],
            [
                27864,
                27883
            ],
            [
                27883,
                27938
            ],
            [
                28010,
                28016
            ],
            [
                27949,
                27958
            ],
            [
                27975,
                28005
            ],
            [
                28017,
                28036
            ],
            [
                28044,
                28059
            ],
            [
                28059,
                28104
            ],
            [
                28120,
                28145
            ],
            [
                28145,
                28211
            ],
            [
                28221,
                28229
            ],
            [
                28235,
                28252
            ],
            [
                28258,
                28337
            ],
            [
                28337,
                28389
            ],
            [
                28427,
                28441
            ],
            [
                28446,
                28460
            ],
            [
                28466,
                28489
            ],
            [
                28491,
                28556
            ],
            [
                28556,
                28560
            ],
            [
                28560,
                28632
            ],
            [
                28654,
                28688
            ],
            [
                28688,
                28708
            ],
            [
                28732,
                28822
            ],
            [
                28839,
                28870
            ],
            [
                28889,
                28912
            ],
            [
                28874,
                28883
            ],
            [
                28917,
                28955
            ],
            [
                28969,
                28996
            ],
            [
                29020,
                29022
            ],
            [
                29022,
                29038
            ],
            [
                29038,
                29047
            ],
            [
                29047,
                29079
            ],
            [
                29079,
                29105
            ],
            [
                29112,
                29158
            ],
            [
                29168,
                29171
            ],
            [
                29171,
                29234
            ],
            [
                29269,
                29356
            ],
            [
                29364,
                29403
            ],
            [
                29403,
                29546
            ],
            [
                29546,
                29623
            ],
            [
                29625,
                29651
            ],
            [
                29651,
                29688
            ],
            [
                29802,
                29847
            ],
            [
                29849,
                29863
            ],
            [
                29879,
                29881
            ],
            [
                29881,
                29945
            ],
            [
                29954,
                30031
            ],
            [
                30041,
                30067
            ],
            [
                30068,
                30096
            ],
            [
                30098,
                30136
            ],
            [
                30149,
                30183
            ],
            [
                30231,
                30234
            ],
            [
                30236,
                30272
            ],
            [
                30274,
                30298
            ],
            [
                30314,
                30316
            ],
            [
                30316,
                30319
            ],
            [
                30320,
                30405
            ],
            [
                30422,
                30529
            ],
            [
                30553,
                30571
            ],
            [
                30580,
                30582
            ],
            [
                30582,
                30601
            ],
            [
                30616,
                30628
            ],
            [
                30754,
                30755
            ],
            [
                30629,
                30655
            ],
            [
                30662,
                30664
            ],
            [
                30674,
                30726
            ],
            [
                30742,
                30754
            ],
            [
                30762,
                30787
            ],
            [
                30795,
                30941
            ],
            [
                30956,
                30993
            ],
            [
                30993,
                30996
            ],
            [
                31023,
                31047
            ],
            [
                31047,
                31084
            ],
            [
                31089,
                31122
            ],
            [
                31129,
                31134
            ],
            [
                31143,
                31150
            ],
            [
                31159,
                31192
            ],
            [
                31151,
                31153
            ],
            [
                31197,
                31232
            ],
            [
                31258,
                31370
            ],
            [
                31388,
                31393
            ],
            [
                31395,
                31402
            ],
            [
                31403,
                31408
            ],
            [
                31418,
                31439
            ],
            [
                31450,
                31454
            ],
            [
                31460,
                31488
            ],
            [
                31731,
                31733
            ],
            [
                31612,
                31615
            ],
            [
                31623,
                31654
            ],
            [
                31700,
                31715
            ],
            [
                31734,
                31801
            ]
        ],
        "row_chars": [
            [
                0,
                146
            ],
            [
                146,
                349
            ],
            [
                349,
                652
            ],
            [
                652,
                860
            ],
            [
                860,
                1218
            ],
            [
                1218,
                1380
            ],
            [
                1380,
                1467
            ],
            [
                1467,
                1540
            ],
            [
                1540,
                1594
            ],
            [
                1594,
                1672
            ],
            [
                1672,
                1958
            ],
            [
                1958,
                2009
            ],
            [
                2009,
                2086
            ],
            [
                2086,
                2228
            ],
            [
                2228,
                2283
            ],
            [
                2283,
                2336
            ],
            [
                2336,
                2374
            ],
            [
                2374,
                2546
            ],
            [
                2546,
                2702
            ],
            [
                2702,
                2773
            ],
            [
                2773,
                2825
            ],
            [
                2825,
                2867
            ],
            [
                2867,
                2923
            ],
            [
                2923,
                3083
            ],
            [
                3083,
                3182
            ],
            [
                3182,
                3204
            ],
            [
                3204,
                3270
            ],
            [
                3270,
                3321
            ],
            [
                3321,
                3410
            ],
            [
                3410,
                3521
            ],
            [
                3521,
                3556
            ],
            [
                3556,
                3604
            ],
            [
                3604,
                3664
            ],
            [
                3664,
                3900
            ],
            [
                3900,
                4006
            ],
            [
                4006,
                4110
            ],
            [
                4110,
                4176
            ],
            [
                4176,
                4220
            ],
            [
                4220,
                4267
            ],
            [
                4267,
                4352
            ],
            [
                4352,
                4411
            ],
            [
                4411,
                4514
            ],
            [
                4514,
                4819
            ],
            [
                4819,
                4949
            ],
            [
                4949,
                4960
            ],
            [
                4960,
                5010
            ],
            [
                5010,
                5094
            ],
            [
                5094,
                5123
            ],
            [
                5123,
                5208
            ],
            [
                5208,
                5221
            ],
            [
                5221,
                5234
            ],
            [
                5234,
                5258
            ],
            [
                5258,
                5404
            ],
            [
                5404,
                5416
            ],
            [
                5416,
                5445
            ],
            [
                5445,
                5541
            ],
            [
                5541,
                5588
            ],
            [
                5588,
                5607
            ],
            [
                5607,
                5657
            ],
            [
                5657,
                5704
            ],
            [
                5704,
                5868
            ],
            [
                5868,
                5903
            ],
            [
                5903,
                5928
            ],
            [
                5928,
                5973
            ],
            [
                5973,
                5987
            ],
            [
                5987,
                6005
            ],
            [
                6005,
                6065
            ],
            [
                6065,
                6093
            ],
            [
                6093,
                6149
            ],
            [
                6149,
                6290
            ],
            [
                6290,
                6336
            ],
            [
                6336,
                6354
            ],
            [
                6354,
                6416
            ],
            [
                6416,
                6538
            ],
            [
                6538,
                6633
            ],
            [
                6633,
                6685
            ],
            [
                6685,
                6730
            ],
            [
                6730,
                6780
            ],
            [
                6780,
                6842
            ],
            [
                6842,
                6952
            ],
            [
                6952,
                6971
            ],
            [
                6971,
                6999
            ],
            [
                6999,
                7227
            ],
            [
                7227,
                7299
            ],
            [
                7299,
                7330
            ],
            [
                7330,
                7385
            ],
            [
                7385,
                7450
            ],
            [
                7450,
                7579
            ],
            [
                7579,
                7692
            ],
            [
                7692,
                7755
            ],
            [
                7755,
                7785
            ],
            [
                7785,
                7831
            ],
            [
                7831,
                7849
            ],
            [
                7849,
                7873
            ],
            [
                7873,
                7890
            ],
            [
                7890,
                8075
            ],
            [
                8075,
                8132
            ],
            [
                8132,
                8164
            ],
            [
                8164,
                8219
            ],
            [
                8219,
                8251
            ],
            [
                8251,
                8292
            ],
            [
                8292,
                8344
            ],
            [
                8344,
                8466
            ],
            [
                8466,
                8510
            ],
            [
                8510,
                8558
            ],
            [
                8558,
                8614
            ],
            [
                8614,
                8654
            ],
            [
                8654,
                8766
            ],
            [
                8766,
                8823
            ],
            [
                8823,
                8956
            ],
            [
                8956,
                9140
            ],
            [
                9140,
                9249
            ],
            [
                9249,
                9282
            ],
            [
                9282,
                9338
            ],
            [
                9338,
                9405
            ],
            [
                9405,
                9435
            ],
            [
                9435,
                9476
            ],
            [
                9476,
                9514
            ],
            [
                9514,
                9681
            ],
            [
                9681,
                9908
            ],
            [
                9908,
                10014
            ],
            [
                10014,
                10217
            ],
            [
                10217,
                10467
            ],
            [
                10467,
                10643
            ],
            [
                10643,
                10696
            ],
            [
                10696,
                10986
            ],
            [
                10986,
                11142
            ],
            [
                11142,
                11189
            ],
            [
                11189,
                11323
            ],
            [
                11323,
                11456
            ],
            [
                11456,
                11606
            ],
            [
                11606,
                11767
            ],
            [
                11767,
                11858
            ],
            [
                11858,
                11953
            ],
            [
                11953,
                12462
            ],
            [
                12462,
                12559
            ],
            [
                12559,
                12644
            ],
            [
                12644,
                12900
            ],
            [
                12900,
                13026
            ],
            [
                13026,
                13161
            ],
            [
                13161,
                13326
            ],
            [
                13326,
                13664
            ],
            [
                13664,
                13851
            ],
            [
                13851,
                14109
            ],
            [
                14109,
                14272
            ],
            [
                14272,
                14367
            ],
            [
                14367,
                14550
            ],
            [
                14550,
                14664
            ],
            [
                14664,
                14803
            ],
            [
                14803,
                15013
            ],
            [
                15013,
                15178
            ],
            [
                15178,
                15296
            ],
            [
                15296,
                15598
            ],
            [
                15598,
                15660
            ],
            [
                15660,
                15826
            ],
            [
                15826,
                15885
            ],
            [
                15885,
                16012
            ],
            [
                16012,
                16343
            ],
            [
                16343,
                16443
            ],
            [
                16443,
                16501
            ],
            [
                16501,
                16531
            ],
            [
                16531,
                16570
            ],
            [
                16570,
                16615
            ],
            [
                16615,
                16701
            ],
            [
                16701,
                16740
            ],
            [
                16740,
                16783
            ],
            [
                16783,
                16833
            ],
            [
                16833,
                17145
            ],
            [
                17145,
                17194
            ],
            [
                17194,
                17232
            ],
            [
                17232,
                17292
            ],
            [
                17292,
                17720
            ],
            [
                17720,
                17817
            ],
            [
                17817,
                17993
            ],
            [
                17993,
                18334
            ],
            [
                18334,
                18482
            ],
            [
                18482,
                18562
            ],
            [
                18562,
                18761
            ],
            [
                18761,
                18867
            ],
            [
                18867,
                19030
            ],
            [
                19030,
                19234
            ],
            [
                19234,
                19380
            ],
            [
                19380,
                19547
            ],
            [
                19547,
                19972
            ],
            [
                19972,
                20556
            ],
            [
                20556,
                20605
            ],
            [
                20605,
                20830
            ],
            [
                20830,
                20946
            ],
            [
                20946,
                21126
            ],
            [
                21126,
                21171
            ],
            [
                21171,
                21288
            ],
            [
                21288,
                21416
            ],
            [
                21416,
                21573
            ],
            [
                21573,
                21956
            ],
            [
                21956,
                22150
            ],
            [
                22150,
                22355
            ],
            [
                22355,
                22513
            ],
            [
                22513,
                22629
            ],
            [
                22629,
                22737
            ],
            [
                22737,
                22761
            ],
            [
                22761,
                22903
            ],
            [
                22903,
                23053
            ],
            [
                23053,
                23119
            ],
            [
                23119,
                23358
            ],
            [
                23358,
                23391
            ],
            [
                23391,
                23436
            ],
            [
                23436,
                23584
            ],
            [
                23584,
                23678
            ],
            [
                23678,
                23838
            ],
            [
                23838,
                24271
            ],
            [
                24271,
                24333
            ],
            [
                24333,
                24625
            ],
            [
                24625,
                25119
            ],
            [
                25119,
                25427
            ],
            [
                25427,
                25818
            ],
            [
                25818,
                26097
            ],
            [
                26097,
                26597
            ],
            [
                26597,
                26743
            ],
            [
                26743,
                26870
            ],
            [
                26870,
                26971
            ],
            [
                26971,
                27035
            ],
            [
                27035,
                27114
            ],
            [
                27114,
                27194
            ],
            [
                27194,
                27533
            ],
            [
                27533,
                27883
            ],
            [
                27883,
                28059
            ],
            [
                28059,
                28145
            ],
            [
                28145,
                28337
            ],
            [
                28337,
                28556
            ],
            [
                28556,
                28560
            ],
            [
                28560,
                28688
            ],
            [
                28688,
                29022
            ],
            [
                29022,
                29038
            ],
            [
                29038,
                29047
            ],
            [
                29047,
                29079
            ],
            [
                29079,
                29171
            ],
            [
                29171,
                29403
            ],
            [
                29403,
                29546
            ],
            [
                29546,
                29651
            ],
            [
                29651,
                29689
            ],
            [
                29689,
                29802
            ],
            [
                29802,
                29881
            ],
            [
                29881,
                30068
            ],
            [
                30068,
                30316
            ],
            [
                30316,
                30582
            ],
            [
                30582,
                30993
            ],
            [
                30993,
                31047
            ],
            [
                31047,
                31233
            ],
            [
                31233,
                31488
            ],
            [
                31488,
                31612
            ],
            [
                31612,
                31801
            ]
        ]
    },
    "abridged": {
        "text": "Dobbin now hastened away to the City to perform the more difficult part of his task. He was nervous at the idea of facing old Osborne, and considered leaving the young ladies to tell the secret. But he had promised to report to George on how the elder Osborne bore the news; so, going to the counting-house in Thames Street, he sent a note to Mr. Osborne begging for a half-hour's conversation about his son's affairs. This was accordingly arranged.\nThe Captain, expecting a painful and stormy interview, entered Mr. Osborne's offices with a dismal face. As he passed through the outer room, Mr. Chopper winked and nodded from his desk, saying, \"You'll find the governor all right,\" with provoking good humour.\nInside, Osborne rose, shook him heartily by the hand, and said, \"How do, my dear boy?\" with a cordiality that made poor Dobbin feel doubly guilty. It was he who had brought back George to Amelia: it was he who had encouraged their marriage; and meanwhile George's father was patting him on the shoulder, and calling him \"Dobbin, my dear boy.\"\nOsborne believed that Dobbin had come to announce his son's surrender. He had been talking over the likelihood of this with Mr. Chopper just before Dobbin arrived. Both had been expecting George's submission for some days.\n\"Lord! Chopper, what a marriage we'll have!\" Mr. Osborne said to his clerk, jingling the guineas in his great pockets with triumph.\nWith a knowing air, Osborne regarded Dobbin seated blank and silent opposite him. \"What a bumpkin he is for an army Captain,\" old Osborne thought. \"I wonder George hasn't taught him better manners.\"\nAt last Dobbin summoned courage to begin. \"Sir, I've brought you some very grave news. I have been at the Horse Guards this morning, and there's no doubt that our regiment will be ordered abroad before the week is over. And you know, sir, that we shan't be home again before a tussle which may be fatal to many of us.\n\"The regiment will do its duty, sir, I daresay,\" said Osborne.\n\"The French are very strong, sir,\" Dobbin went on. \"The Russians and Austrians will be a long time bringing their troops down. We shall have the first of the fight, sir; and Boney will take care that it shall be a hard one.\"\n\"What are you driving at, Dobbin?\" Osborne said, with an uneasy scowl. \"I suppose no Briton's afraid of any d___ d Frenchman, hey?\"\n\"I only mean that before we go, if there are any differences between you and George - it would be as well, sir, that you should shake hands. Should anything happen to him, I think you would never forgive yourself if you hadn't parted in charity.\"\nAs he said this, poor Dobbin blushed, and felt himself a traitor. But for him, perhaps, this severance need never have taken place. He had brought about the marriage - and why? Because he loved Amelia so much that he could not bear to see her unhappy.\n\"You are a good fellow, William,\" said Mr. Osborne in a softened voice; \"and me and George shouldn't part in anger, that is true. Look here. I've done as much for him as any father ever did. How I've toiled for him, I won't say. Well, I propose to him such a marriage as a nobleman might be proud of - the only thing in life I ever asked him - and he refuses me. Is the quarrel of my making? What do I seek but his good? Nobody can say there's anything selfish in me. I say, here's my hand, and we'll forget and forgive. As for marrying now, it's out of the question. Let him and Miss S. make it up when he comes back a Colonel; for he shall be a Colonel, by G___, if money can do it. Come and dine in Russell Square today: both of you. You'll find a neck of venison, and no questions asked.\"\nEvery moment Osborne continued, Dobbin felt more and more guilty. \"Sir,\" said he, \"I fear you deceive yourself. George is much too high-minded a man ever to marry for money. A threat on your part to disinherit him would only be followed by resistance on his.\"\n\"Why, hang it, man, you don't call offering him ten thousand a year threatening him?\" Mr. Osborne said, still with good humour. \"'Gad, if Miss S. will have me, I'm her man. I ain't particular about a shade of tawny.\" And the old gentleman gave his coarse laugh.\n\"You forget, sir, previous engagements into which Captain Osborne had entered.\"\n\"What engagements? What the devil do you mean?\" Mr. Osborne continued, with gathering wrath. \"You don't mean that he's still hankering after that swindling old bankrupt's daughter? You've not come here to make me suppose that he wants to marry her. My son and heir marry a beggar's girl out of a gutter! D___ him - if he does, let him buy a broom and sweep a crossing. She was always dangling after him; and I've no doubt she was put on by her old sharper of a father.\"\n\"Mr. Sedley was your very good friend, sir,\" Dobbin interposed, almost pleased at finding himself growing angry. \"Time was you called him better names than rogue and swindler. The match was of your making. George had no right to play fast and loose-\"\n\"Fast and loose!\" howled out old Osborne. \"Fast and loose! Why, hang me, those are the very words he used himself. What, it's you who have been setting him up - is it, Captain? It's you who want to introduce beggars into my family. Thank you for nothing. Marry her indeed - why should he? I warrant you she'd go to him fast enough without marriage.\"\n\"Sir,\" said Dobbin, starting up in undisguised anger; \"no man shall abuse that lady in my hearing.\"\n\"O, you're a-going to call me out, are you? Stop, let me ring the bell for pistols. Mr. George sent you here to insult his father, did he?\" Osborne said, pulling at the bell-cord.\n\"Mr. Osborne,\" said Dobbin, with a faltering voice, \"it's you who are insulting the best creature in the world. You had best spare her, sir, for she's your son's wife.\"\nAnd with this, feeling that he could say no more, Dobbin went away, Osborne sinking back in his chair with a wild look.\nThe Captain was scarcely out of the court when Mr. Chopper the chief clerk came rushing hatless after him.\n\"For God's sake,\" Mr. Chopper said, \"the governor's in a fit. What has Mr. George been doing?\"\n\"He married Miss Sedley five days ago,\" Dobbin replied. \"I was his groomsman, Mr. Chopper, and you must be his friend.\"\nThe old clerk shook his head. \"The governor will never forgive him.\"\nDobbin begged Chopper to report any progress to him at his hotel, and walked off moodily westwards, greatly perturbed.\nWhen the Russell Square family came to dinner that evening, they found the father of the house seated in his usual place, but with an air of gloom which kept the whole circle silent. The ladies, and Mr. Bullock who dined with them, felt that Mr. Osborne had heard the news. Mr. Bullock was unusually bland and attentive to Miss Maria and her sister.\nMiss Wirt was alone on her side of the table, next to George's empty place. Nothing except Mr. Frederick's whispers, and the clinking of plate and china, interrupted the silence of the meal. The servants went about stealthily doing their duty. Mr. Osborne's share of the venison went away almost untasted, though he drank much, and the butler assiduously filled his glass.\nAt last, at the end of dinner, his eyes fixed themselves upon the plate laid for George. He pointed to it with his left hand. His daughters looked at him and did not choose to comprehend the signal; nor did the servants at first understand it.\n\"Take that plate away,\" he said at last, getting up with an oath, and walking into his own room.\nBehind Mr. Osborne's dining-room was his study, which was sacred to the master of the house. Here he would pass a Sunday morning in his crimson leather chair, reading the paper. A couple of glazed book-cases were here, containing standard works in stout gilt bindings. No member of the family dared to touch the books, except upon those rare Sunday evenings when there was no dinner-party. Then the great scarlet Bible and Prayer-book were taken out; and the servants being summoned, Osborne would read the evening service to his family in a loud grating pompous voice.\nNo member of the household ever entered that room without a certain terror. Here Osborne checked the housekeeper's accounts, and overhauled the butler's cellar-book. Four times a year Miss Wirt entered this apartment to get her salary; and his daughters to receive their quarterly allowance. George as a boy had been horsewhipped in this room many times, his mother sitting sick on the stair listening to the whip. The boy scarcely ever cried under the punishment; the poor woman used to kiss him secretly, and give him money to soothe him when he came out.\nThere was a picture of the family over the mantelpiece. George was on a pony, the elder sister holding a bunch of flowers, the younger led by her mother's hand; all with red cheeks and red mouths, simpering in the approved family-portrait manner. The mother lay underground now, forgotten - the sisters and brother had a hundred interests of their own, and though familiar, were utterly estranged from each other.\nTo this study old Osborne retired, greatly to the relief of the party whom he left. When the servants had withdrawn, they began to talk volubly but very low; then they went upstairs, Mr. Bullock accompanying them stealthily on his creaking shoes. He had no heart to sit alone so close to the terrible old gentleman in the study.\nAn hour after dark, the butler ventured to tap at his door and take him in candles and tea. The master sat in his chair, pretending to read the paper, and when the servant left, Mr. Osborne got up and locked the door after him.\nIn the large shining mahogany writing-desk Mr. Osborne had a drawer devoted to his son's affairs. Here he kept George's prize copy-books and drawing-books: his first letters in large round-hand sending his love to papa and mamma, and asking for a cake. His dear godpapa Sedley was more than once mentioned in them. Curses quivered on old Osborne's livid lips, and horrid disappointment writhed in his heart when he came upon that name.\nThe letters were all labelled and tied with red tape. \"From Georgy, requesting 5s., April 23, 18__\"; or \"Georgy about a pony, October 13\" - and so forth. In another packet were \"G.'s tailor's bills,\" his letters from the West Indies, and the newspapers listing his commissions: and a locket containing his hair, which his mother used to wear.\nTurning one over after another, the unhappy man passed many hours. His dearest vanities, ambitious hopes, had all been here. What pride he had in his boy! He was the handsomest child ever seen. A royal princess had noticed him, and kissed him, and asked his name in Kew Gardens. Anything that money could buy had been his son's. Had he ever refused a bill of George's? There they were - paid without a word. Many a general in the army couldn't ride the horses he had!\nHe remembered George on a hundred different days - when he used to come in after dinner as bold as a lord and drink from his father's glass - or on the pony at Brighton, when he cleared the hedge and kept up with the huntsman - the day when he was presented to the Prince Regent. And this, this was the end of all! to marry a bankrupt and fly in the face of duty and fortune! What humiliation and fury: what sickening rage, balked ambition and love; what outraged vanity, tenderness even, had this old man now to suffer!\nGeorge's father took all of the documents out of the drawer in which he had kept them so long, and locked them into a writing-box, which he tied, and sealed with his seal. Then he opened the book-case, and took down the great red Bible, shining all over with gold. It had a frontispiece representing Abraham sacrificing Isaac. Here, Osborne had recorded on the fly-leaf the dates of his marriage and his wife's death, and the births and names of his children. Jane came first, then George Sedley Osborne, then Maria Frances. Taking a pen, he carefully obliterated George's name from the page.\nThen he took a document out of another drawer, where his own private papers were kept; and having read it, crumpled it up and lit it at one of the candles, and saw it burn away in the grate. It was his will. He sat down and wrote a letter, and rang for his servant, whom he ordered to deliver it in the morning. It was morning already: as he went up to bed, the whole house was alight with the sunshine; and the birds were singing among the fresh green leaves in Russell Square.\nAnxious to keep Mr. Osborne's family and dependants in good humour, and to make as many friends as possible for George, on returning to his inn William Dobbin immediately wrote a hospitable invitation to Mr. Chopper, begging him to dine at the Slaughters' the next day.\nThe invitation, and Mr. Chopper's draft of his acceptance, were shown to Mrs. Chopper that evening. They talked about it with great exultation, and discussed the strange events in the Osborne family. Never had the clerk seen his employer so moved. After Captain Dobbin's departure, he had found his chief black in the face, and all but in a fit. Chopper had been instructed to list all sums paid to Captain Osborne within the last three years.\n\"And a precious lot of money he has had too,\" the chief clerk said. The dispute was something about Miss Sedley. Mr. Chopper had no great regard for Miss Sedley. He respected the house of Osborne before all others: and hoped that Captain George would marry a nobleman's daughter.\nThe clerk slept a great deal sounder than his employer that night; and, cuddling his children after breakfast, he set off in his best suit, promising his admiring wife not to drink too much of Captain Dobbin's port that evening.\nMr. Osborne's face, when he arrived in the City, struck his clerks as peculiarly ghastly and worn. At twelve o'clock Mr. Higgs, his solicitor, called and was closeted with him for more than an hour. At about one Mr. Chopper received a note brought by Captain Dobbin's man, and containing an enclosure for Mr. Osborne, which the clerk went in and delivered. A short time afterwards Mr. Chopper and another clerk were summoned, and requested to witness a paper.\n\"I've been making a new will,\" Mr. Osborne said. No conversation passed. Mr. Higgs looked exceedingly grave as he came out; but there were no explanations. It was remarked that Mr. Osborne was surprisingly quiet and gentle all day. He called no man names, and was not heard to swear once. He left work early; and before going away, asked his chief clerk, with some hesitation, if he knew whether Captain Dobbin was in town?\nChopper said he believed he was. Indeed both of them knew it perfectly.\nOsborne gave the clerk a letter, and requested him to deliver it into Dobbin's own hands immediately.\n\"And now, Chopper,\" said he with a strange look, \"my mind will be easy.\" Then Mr. Frederick Bullock came in, and he and Mr. Osborne walked away together.\nThe Colonel of the regiment in which Dobbin and Osborne served was an old General who had made his first campaign under Wolfe at Quebec. He was too old and feeble for command; but he took some interest in the regiment of which he was the nominal head, and made certain young officers welcome at his table. Captain Dobbin was an especial favourite of this old General. Dobbin knew his military literature, and could talk about past wars almost as well as the General himself.\nOn this day, the General summoned Dobbin to breakfast with him, and informed him that a marching order to go to Belgium would come in a day or two, and they would leave before the week was over. The old General hoped that the regiment would prove itself worthy of its reputation on the battle-grounds of the Low Countries.\n\"And so, my good friend,\" said the General, taking a pinch of snuff with his trembling old hand, \"if you have any Phillis to console, or to bid farewell to papa and mamma, or any will to make, I recommend you to do it without delay.\" He gave a good-natured nod of his powdered and pigtailed head.\nThis news made Dobbin grave, and he thought of our friends at Brighton, and then felt ashamed that Amelia was always first in his thoughts before anybody - always at waking and sleeping, and indeed all day long. Returning to his hotel, he sent a brief note to old Mr. Osborne with this information, which might, he hoped, bring about a reconciliation with George.\nDobbin was permitted to repeat the General's information to any officers of the regiment: so he told Ensign Stubble, whom he met at the outfitters', and who went off instantly to purchase a new sword. This young fellow, though only seventeen years of age, and about sixty-five inches high, with a rickety constitution, had undoubted courage; and shouting \"Ha, ha!\" and stamping his little feet with tremendous energy, he thrust the point at Captain Dobbin, who parried it laughingly with his walking-stick.\nMr. Stubble, as may be supposed from his size, was of the Light Bobs. Ensign Spooney, on the contrary, was a tall youth, and belonged to Captain Dobbin's Grenadier Company. He tried on a new bearskin cap, under which he looked savage beyond his years. Then these two lads went off to the Slaughters', and sat down and wrote letters to the anxious parents at home - letters full of love and heartiness, and pluck and bad spelling. Ah! there were many anxious hearts beating through England at that time; and tears flowing in many homesteads.\nSeeing young Stubble writing at one of the coffee-room tables at the Slaughters', and the tears trickling down his nose (for the youngster was thinking that he might never see his mamma again), Dobbin, who was going to write to George Osborne, relented. \"Why should I?\" said he. \"Let her have this night happy. I'll go and see my parents in the morning, and go down to Brighton myself tomorrow.\"\nSo he went up and laid his big hand on young Stubble's shoulder, and told him if he would leave off brandy and water he would be a good soldier, as he was a gentlemanly good-hearted fellow. Young Stubble's eyes brightened up at this, for Dobbin was greatly respected in the regiment, as the best officer and the cleverest man in it.\n\"Thank you, Dobbin,\" he said, rubbing his eyes with his knuckles, \"I was just - just telling her I would. And, O Sir, she's so dam kind to me.\"\nThe two ensigns, the Captain, and Mr. Chopper dined together. Chopper brought the letter from Mr. Osborne, in which the latter presented his compliments to Captain Dobbin, and requested him to forward the enclosed to Captain George Osborne.\nChopper knew nothing further. He described Mr. Osborne's appearance, and his interview with his lawyer, and - especially as the wine circled round - abounded in speculations. But as these grew more vague with every glass, and at length became perfectly unintelligible, Captain Dobbin put his guest into a hackney coach, in a hiccupping state, and swearing that he would be the Captain's friend for ever.\nWhen Captain Dobbin left Miss Osborne, we have said that he asked permission to pay her another visit, and the spinster expected him the next day. Perhaps, had he come, and asked her that question which she was prepared to answer, she would have declared herself as her brother's friend, and a reconciliation might have taken place between George and his angry father. But the Captain never came. He had his own affairs to pursue; his parents to visit and console; and early in the day took his place on the Lightning coach, to go down to his friends at Brighton.\nMeanwhile Miss Osborne heard her father give orders that that meddling scoundrel, Captain Dobbin, should never be admitted again; and any private hopes she may have indulged were abruptly brought to an end. As for her father, although he said his mind would be easy, it did not seem to be so yet, and the events of the past two days had visibly shattered him.",
        "paragraph_chars": [
            [
                0,
                450
            ],
            [
                450,
                711
            ],
            [
                711,
                1054
            ],
            [
                1054,
                1277
            ],
            [
                1277,
                1409
            ],
            [
                1409,
                1608
            ],
            [
                1608,
                1926
            ],
            [
                1926,
                1989
            ],
            [
                1989,
                2214
            ],
            [
                2214,
                2346
            ],
            [
                2346,
                2593
            ],
            [
                2593,
                2845
            ],
            [
                2845,
                3638
            ],
            [
                3638,
                3898
            ],
            [
                3898,
                4160
            ],
            [
                4160,
                4240
            ],
            [
                4240,
                4710
            ],
            [
                4710,
                4961
            ],
            [
                4961,
                5311
            ],
            [
                5311,
                5411
            ],
            [
                5411,
                5591
            ],
            [
                5591,
                5760
            ],
            [
                5760,
                5880
            ],
            [
                5880,
                5987
            ],
            [
                5987,
                6082
            ],
            [
                6082,
                6202
            ],
            [
                6202,
                6271
            ],
            [
                6271,
                6390
            ],
            [
                6390,
                6740
            ],
            [
                6740,
                7113
            ],
            [
                7113,
                7357
            ],
            [
                7357,
                7454
            ],
            [
                7454,
                8024
            ],
            [
                8024,
                8582
            ],
            [
                8582,
                8996
            ],
            [
                8996,
                9325
            ],
            [
                9325,
                9553
            ],
            [
                9553,
                9989
            ],
            [
                9989,
                10332
            ],
            [
                10332,
                10800
            ],
            [
                10800,
                11321
            ],
            [
                11321,
                11914
            ],
            [
                11914,
                12393
            ],
            [
                12393,
                12663
            ],
            [
                12663,
                13107
            ],
            [
                13107,
                13387
            ],
            [
                13387,
                13616
            ],
            [
                13616,
                14076
            ],
            [
                14076,
                14500
            ],
            [
                14500,
                14572
            ],
            [
                14572,
                14674
            ],
            [
                14674,
                14828
            ],
            [
                14828,
                15303
            ],
            [
                15303,
                15626
            ],
            [
                15626,
                15923
            ],
            [
                15923,
                16287
            ],
            [
                16287,
                16794
            ],
            [
                16794,
                17335
            ],
            [
                17335,
                17731
            ],
            [
                17731,
                18064
            ],
            [
                18064,
                18208
            ],
            [
                18208,
                18449
            ],
            [
                18449,
                18853
            ],
            [
                18853,
                19417
            ],
            [
                19417,
                19776
            ]
        ],
        "segment_chars": [
            [
                0,
                85
            ],
            [
                85,
                195
            ],
            [
                195,
                419
            ],
            [
                419,
                450
            ],
            [
                450,
                555
            ],
            [
                555,
                711
            ],
            [
                711,
                798
            ],
            [
                798,
                858
            ],
            [
                858,
                1054
            ],
            [
                1054,
                1125
            ],
            [
                1125,
                1218
            ],
            [
                1218,
                1277
            ],
            [
                1277,
                1284
            ],
            [
                1284,
                1322
            ],
            [
                1322,
                1409
            ],
            [
                1409,
                1491
            ],
            [
                1491,
                1556
            ],
            [
                1556,
                1608
            ],
            [
                1608,
                1650
            ],
            [
                1650,
                1695
            ],
            [
                1695,
                1828
            ],
            [
                1828,
                1926
            ],
            [
                1926,
                1989
            ],
            [
                1989,
                2040
            ],
            [
                2040,
                2116
            ],
            [
                2116,
                2214
            ],
            [
                2214,
                2249
            ],
            [
                2249,
                2285
            ],
            [
                2285,
                2346
            ],
            [
                2346,
                2487
            ],
            [
                2487,
                2593
            ],
            [
                2593,
                2659
            ],
            [
                2659,
                2725
            ],
            [
                2725,
                2770
            ],
            [
                2770,
                2845
            ],
            [
                2845,
                2975
            ],
            [
                2975,
                2986
            ],
            [
                2986,
                3036
            ],
            [
                3036,
                3074
            ],
            [
                3074,
                3208
            ],
            [
                3208,
                3237
            ],
            [
                3237,
                3266
            ],
            [
                3266,
                3313
            ],
            [
                3313,
                3366
            ],
            [
                3366,
                3413
            ],
            [
                3413,
                3530
            ],
            [
                3530,
                3582
            ],
            [
                3582,
                3638
            ],
            [
                3638,
                3704
            ],
            [
                3704,
                3750
            ],
            [
                3750,
                3812
            ],
            [
                3812,
                3898
            ],
            [
                3898,
                3984
            ],
            [
                3984,
                4026
            ],
            [
                4026,
                4071
            ],
            [
                4071,
                4115
            ],
            [
                4115,
                4160
            ],
            [
                4160,
                4240
            ],
            [
                4240,
                4259
            ],
            [
                4259,
                4288
            ],
            [
                4288,
                4333
            ],
            [
                4333,
                4421
            ],
            [
                4421,
                4489
            ],
            [
                4489,
                4544
            ],
            [
                4544,
                4609
            ],
            [
                4609,
                4710
            ],
            [
                4710,
                4823
            ],
            [
                4823,
                4886
            ],
            [
                4886,
                4916
            ],
            [
                4916,
                4961
            ],
            [
                4961,
                4979
            ],
            [
                4979,
                5003
            ],
            [
                5003,
                5020
            ],
            [
                5020,
                5076
            ],
            [
                5076,
                5138
            ],
            [
                5138,
                5193
            ],
            [
                5193,
                5216
            ],
            [
                5216,
                5250
            ],
            [
                5250,
                5311
            ],
            [
                5311,
                5411
            ],
            [
                5411,
                5455
            ],
            [
                5455,
                5495
            ],
            [
                5495,
                5551
            ],
            [
                5551,
                5591
            ],
            [
                5591,
                5703
            ],
            [
                5703,
                5760
            ],
            [
                5760,
                5880
            ],
            [
                5880,
                5987
            ],
            [
                5987,
                6049
            ],
            [
                6049,
                6082
            ],
            [
                6082,
                6138
            ],
            [
                6138,
                6202
            ],
            [
                6202,
                6232
            ],
            [
                6232,
                6271
            ],
            [
                6271,
                6390
            ],
            [
                6390,
                6573
            ],
            [
                6573,
                6664
            ],
            [
                6664,
                6740
            ],
            [
                6740,
                6816
            ],
            [
                6816,
                6931
            ],
            [
                6931,
                6984
            ],
            [
                6984,
                7113
            ],
            [
                7113,
                7202
            ],
            [
                7202,
                7239
            ],
            [
                7239,
                7357
            ],
            [
                7357,
                7454
            ],
            [
                7454,
                7547
            ],
            [
                7547,
                7632
            ],
            [
                7632,
                7723
            ],
            [
                7723,
                7844
            ],
            [
                7844,
                8024
            ],
            [
                8024,
                8100
            ],
            [
                8100,
                8190
            ],
            [
                8190,
                8316
            ],
            [
                8316,
                8439
            ],
            [
                8439,
                8582
            ],
            [
                8582,
                8638
            ],
            [
                8638,
                8829
            ],
            [
                8829,
                8996
            ],
            [
                8996,
                9080
            ],
            [
                9080,
                9243
            ],
            [
                9243,
                9325
            ],
            [
                9325,
                9417
            ],
            [
                9417,
                9553
            ],
            [
                9553,
                9651
            ],
            [
                9651,
                9806
            ],
            [
                9806,
                9868
            ],
            [
                9868,
                9989
            ],
            [
                9989,
                10043
            ],
            [
                10043,
                10143
            ],
            [
                10143,
                10332
            ],
            [
                10332,
                10399
            ],
            [
                10399,
                10457
            ],
            [
                10457,
                10487
            ],
            [
                10487,
                10526
            ],
            [
                10526,
                10611
            ],
            [
                10611,
                10661
            ],
            [
                10661,
                10701
            ],
            [
                10701,
                10740
            ],
            [
                10740,
                10800
            ],
            [
                10800,
                11080
            ],
            [
                11080,
                11115
            ],
            [
                11115,
                11176
            ],
            [
                11176,
                11321
            ],
            [
                11321,
                11493
            ],
            [
                11493,
                11586
            ],
            [
                11586,
                11648
            ],
            [
                11648,
                11781
            ],
            [
                11781,
                11846
            ],
            [
                11846,
                11914
            ],
            [
                11914,
                12105
            ],
            [
                12105,
                12122
            ],
            [
                12122,
                12226
            ],
            [
                12226,
                12393
            ],
            [
                12393,
                12663
            ],
            [
                12663,
                12763
            ],
            [
                12763,
                12863
            ],
            [
                12863,
                12911
            ],
            [
                12911,
                13009
            ],
            [
                13009,
                13107
            ],
            [
                13107,
                13175
            ],
            [
                13175,
                13220
            ],
            [
                13220,
                13269
            ],
            [
                13269,
                13387
            ],
            [
                13387,
                13616
            ],
            [
                13616,
                13715
            ],
            [
                13715,
                13815
            ],
            [
                13815,
                13973
            ],
            [
                13973,
                14076
            ],
            [
                14076,
                14125
            ],
            [
                14125,
                14149
            ],
            [
                14149,
                14232
            ],
            [
                14232,
                14308
            ],
            [
                14308,
                14365
            ],
            [
                14365,
                14500
            ],
            [
                14500,
                14533
            ],
            [
                14533,
                14572
            ],
            [
                14572,
                14674
            ],
            [
                14674,
                14747
            ],
            [
                14747,
                14828
            ],
            [
                14828,
                14965
            ],
            [
                14965,
                15134
            ],
            [
                15134,
                15196
            ],
            [
                15196,
                15303
            ],
            [
                15303,
                15498
            ],
            [
                15498,
                15626
            ],
            [
                15626,
                15860
            ],
            [
                15860,
                15923
            ],
            [
                15923,
                16135
            ],
            [
                16135,
                16287
            ],
            [
                16287,
                16488
            ],
            [
                16488,
                16652
            ],
            [
                16652,
                16794
            ],
            [
                16794,
                16864
            ],
            [
                16864,
                16967
            ],
            [
                16967,
                17046
            ],
            [
                17046,
                17224
            ],
            [
                17224,
                17228
            ],
            [
                17228,
                17335
            ],
            [
                17335,
                17589
            ],
            [
                17589,
                17605
            ],
            [
                17605,
                17614
            ],
            [
                17614,
                17646
            ],
            [
                17646,
                17731
            ],
            [
                17731,
                17921
            ],
            [
                17921,
                18064
            ],
            [
                18064,
                18170
            ],
            [
                18170,
                18208
            ],
            [
                18208,
                18270
            ],
            [
                18270,
                18449
            ],
            [
                18449,
                18479
            ],
            [
                18479,
                18624
            ],
            [
                18624,
                18853
            ],
            [
                18853,
                19000
            ],
            [
                19000,
                19222
            ],
            [
                19222,
                19250
            ],
            [
                19250,
                19417
            ],
            [
                19417,
                19624
            ],
            [
                19624,
                19776
            ]
        ],
        "overlap_chars": [
            [
                3,
                6
            ],
            [
                11,
                51
            ],
            [
                52,
                74
            ],
            [
                79,
                83
            ],
            [
                83,
                85
            ],
            [
                85,
                91
            ],
            [
                92,
                99
            ],
            [
                103,
                133
            ],
            [
                133,
                138
            ],
            [
                150,
                177
            ],
            [
                183,
                193
            ],
            [
                193,
                195
            ],
            [
                195,
                234
            ],
            [
                242,
                268
            ],
            [
                273,
                277
            ],
            [
                279,
                284
            ],
            [
                285,
                291
            ],
            [
                292,
                327
            ],
            [
                333,
                393
            ],
            [
                400,
                407
            ],
            [
                410,
                417
            ],
            [
                417,
                419
            ],
            [
                428,
                439
            ],
            [
                448,
                450
            ],
            [
                450,
                462
            ],
            [
                473,
                503
            ],
            [
                503,
                541
            ],
            [
                542,
                548
            ],
            [
                553,
                555
            ],
            [
                576,
                579
            ],
            [
                590,
                591
            ],
            [
                594,
                621
            ],
            [
                627,
                630
            ],
            [
                643,
                687
            ],
            [
                688,
                711
            ],
            [
                717,
                718
            ],
            [
                719,
                731
            ],
            [
                733,
                798
            ],
            [
                798,
                830
            ],
            [
                838,
                858
            ],
            [
                858,
                867
            ],
            [
                872,
                916
            ],
            [
                921,
                924
            ],
            [
                925,
                935
            ],
            [
                942,
                950
            ],
            [
                950,
                951
            ],
            [
                952,
                955
            ],
            [
                966,
                981
            ],
            [
                982,
                985
            ],
            [
                986,
                1053
            ],
            [
                1054,
                1061
            ],
            [
                1062,
                1125
            ],
            [
                1137,
                1153
            ],
            [
                1180,
                1189
            ],
            [
                1202,
                1208
            ],
            [
                1209,
                1218
            ],
            [
                1218,
                1222
            ],
            [
                1242,
                1248
            ],
            [
                1251,
                1261
            ],
            [
                1275,
                1276
            ],
            [
                1277,
                1284
            ],
            [
                1284,
                1322
            ],
            [
                1322,
                1352
            ],
            [
                1353,
                1361
            ],
            [
                1362,
                1373
            ],
            [
                1374,
                1394
            ],
            [
                1395,
                1399
            ],
            [
                1400,
                1409
            ],
            [
                1409,
                1413
            ],
            [
                1414,
                1423
            ],
            [
                1424,
                1436
            ],
            [
                1437,
                1485
            ],
            [
                1486,
                1491
            ],
            [
                1491,
                1516
            ],
            [
                1520,
                1524
            ],
            [
                1525,
                1532
            ],
            [
                1532,
                1556
            ],
            [
                1556,
                1608
            ],
            [
                1608,
                1650
            ],
            [
                1650,
                1654
            ],
            [
                1654,
                1655
            ],
            [
                1656,
                1695
            ],
            [
                1695,
                1802
            ],
            [
                1803,
                1828
            ],
            [
                1828,
                1924
            ],
            [
                1926,
                1927
            ],
            [
                1927,
                1974
            ],
            [
                1975,
                1979
            ],
            [
                1987,
                1989
            ],
            [
                1989,
                2040
            ],
            [
                2040,
                2087
            ],
            [
                2097,
                2116
            ],
            [
                2116,
                2162
            ],
            [
                2163,
                2214
            ],
            [
                2214,
                2249
            ],
            [
                2257,
                2262
            ],
            [
                2263,
                2267
            ],
            [
                2271,
                2277
            ],
            [
                2278,
                2285
            ],
            [
                2285,
                2323
            ],
            [
                2329,
                2346
            ],
            [
                2346,
                2358
            ],
            [
                2359,
                2377
            ],
            [
                2378,
                2429
            ],
            [
                2432,
                2462
            ],
            [
                2463,
                2485
            ],
            [
                2487,
                2593
            ],
            [
                2593,
                2614
            ],
            [
                2615,
                2629
            ],
            [
                2629,
                2639
            ],
            [
                2640,
                2647
            ],
            [
                2648,
                2659
            ],
            [
                2659,
                2725
            ],
            [
                2728,
                2745
            ],
            [
                2750,
                2758
            ],
            [
                2761,
                2768
            ],
            [
                2768,
                2770
            ],
            [
                2770,
                2786
            ],
            [
                2794,
                2843
            ],
            [
                2843,
                2845
            ],
            [
                2845,
                2975
            ],
            [
                2975,
                2986
            ],
            [
                2986,
                2995
            ],
            [
                2996,
                3003
            ],
            [
                3004,
                3011
            ],
            [
                3012,
                3036
            ],
            [
                3036,
                3060
            ],
            [
                3061,
                3074
            ],
            [
                3074,
                3115
            ],
            [
                3118,
                3126
            ],
            [
                3127,
                3144
            ],
            [
                3147,
                3186
            ],
            [
                3189,
                3208
            ],
            [
                3208,
                3237
            ],
            [
                3237,
                3264
            ],
            [
                3264,
                3266
            ],
            [
                3266,
                3313
            ],
            [
                3313,
                3334
            ],
            [
                3334,
                3335
            ],
            [
                3346,
                3366
            ],
            [
                3366,
                3413
            ],
            [
                3413,
                3443
            ],
            [
                3444,
                3505
            ],
            [
                3508,
                3530
            ],
            [
                3530,
                3534
            ],
            [
                3535,
                3561
            ],
            [
                3567,
                3582
            ],
            [
                3582,
                3638
            ],
            [
                3638,
                3650
            ],
            [
                3659,
                3668
            ],
            [
                3668,
                3669
            ],
            [
                3670,
                3676
            ],
            [
                3677,
                3704
            ],
            [
                3704,
                3750
            ],
            [
                3750,
                3812
            ],
            [
                3812,
                3833
            ],
            [
                3837,
                3851
            ],
            [
                3852,
                3898
            ],
            [
                3898,
                3945
            ],
            [
                3946,
                3984
            ],
            [
                3984,
                4001
            ],
            [
                4002,
                4007
            ],
            [
                4008,
                4012
            ],
            [
                4013,
                4026
            ],
            [
                4026,
                4071
            ],
            [
                4071,
                4103
            ],
            [
                4104,
                4115
            ],
            [
                4115,
                4145
            ],
            [
                4146,
                4160
            ],
            [
                4160,
                4237
            ],
            [
                4240,
                4259
            ],
            [
                4259,
                4285
            ],
            [
                4290,
                4310
            ],
            [
                4316,
                4331
            ],
            [
                4333,
                4358
            ],
            [
                4359,
                4421
            ],
            [
                4421,
                4441
            ],
            [
                4442,
                4487
            ],
            [
                4489,
                4542
            ],
            [
                4544,
                4545
            ],
            [
                4549,
                4552
            ],
            [
                4555,
                4609
            ],
            [
                4609,
                4632
            ],
            [
                4633,
                4642
            ],
            [
                4642,
                4710
            ],
            [
                4710,
                4823
            ],
            [
                4823,
                4886
            ],
            [
                4886,
                4916
            ],
            [
                4916,
                4958
            ],
            [
                4961,
                4979
            ],
            [
                4979,
                5003
            ],
            [
                5003,
                5020
            ],
            [
                5020,
                5058
            ],
            [
                5059,
                5061
            ],
            [
                5062,
                5074
            ],
            [
                5074,
                5076
            ],
            [
                5076,
                5104
            ],
            [
                5105,
                5112
            ],
            [
                5113,
                5119
            ],
            [
                5122,
                5127
            ],
            [
                5136,
                5138
            ],
            [
                5138,
                5193
            ],
            [
                5193,
                5214
            ],
            [
                5214,
                5216
            ],
            [
                5216,
                5232
            ],
            [
                5235,
                5250
            ],
            [
                5250,
                5299
            ],
            [
                5308,
                5311
            ],
            [
                5311,
                5408
            ],
            [
                5408,
                5411
            ],
            [
                5411,
                5455
            ],
            [
                5455,
                5493
            ],
            [
                5493,
                5495
            ],
            [
                5495,
                5551
            ],
            [
                5551,
                5591
            ],
            [
                5591,
                5703
            ],
            [
                5703,
                5760
            ],
            [
                5760,
                5861
            ],
            [
                5878,
                5879
            ],
            [
                5880,
                5921
            ],
            [
                5922,
                5987
            ],
            [
                5987,
                6002
            ],
            [
                6005,
                6022
            ],
            [
                6023,
                6049
            ],
            [
                6049,
                6082
            ],
            [
                6082,
                6138
            ],
            [
                6138,
                6185
            ],
            [
                6189,
                6202
            ],
            [
                6202,
                6232
            ],
            [
                6233,
                6271
            ],
            [
                6271,
                6302
            ],
            [
                6307,
                6325
            ],
            [
                6330,
                6335
            ],
            [
                6335,
                6388
            ],
            [
                6388,
                6390
            ],
            [
                6390,
                6520
            ],
            [
                6524,
                6536
            ],
            [
                6537,
                6542
            ],
            [
                6543,
                6573
            ],
            [
                6573,
                6631
            ],
            [
                6632,
                6643
            ],
            [
                6644,
                6647
            ],
            [
                6654,
                6662
            ],
            [
                6662,
                6664
            ],
            [
                6666,
                6675
            ],
            [
                6676,
                6723
            ],
            [
                6724,
                6727
            ],
            [
                6728,
                6738
            ],
            [
                6738,
                6740
            ],
            [
                6740,
                6749
            ],
            [
                6750,
                6778
            ],
            [
                6784,
                6785
            ],
            [
                6794,
                6802
            ],
            [
                6809,
                6814
            ],
            [
                6814,
                6816
            ],
            [
                6816,
                6823
            ],
            [
                6824,
                6830
            ],
            [
                6831,
                6846
            ],
            [
                6847,
                6893
            ],
            [
                6906,
                6924
            ],
            [
                6929,
                6931
            ],
            [
                6931,
                6984
            ],
            [
                6986,
                6995
            ],
            [
                6998,
                7003
            ],
            [
                7004,
                7006
            ],
            [
                7007,
                7010
            ],
            [
                7011,
                7018
            ],
            [
                7019,
                7113
            ],
            [
                7113,
                7121
            ],
            [
                7122,
                7135
            ],
            [
                7136,
                7152
            ],
            [
                7153,
                7169
            ],
            [
                7170,
                7202
            ],
            [
                7202,
                7218
            ],
            [
                7219,
                7239
            ],
            [
                7239,
                7278
            ],
            [
                7279,
                7299
            ],
            [
                7300,
                7357
            ],
            [
                7357,
                7380
            ],
            [
                7381,
                7388
            ],
            [
                7389,
                7396
            ],
            [
                7396,
                7421
            ],
            [
                7421,
                7422
            ],
            [
                7423,
                7426
            ],
            [
                7435,
                7454
            ],
            [
                7454,
                7490
            ],
            [
                7491,
                7494
            ],
            [
                7495,
                7500
            ],
            [
                7502,
                7507
            ],
            [
                7508,
                7547
            ],
            [
                7547,
                7551
            ],
            [
                7555,
                7560
            ],
            [
                7561,
                7565
            ],
            [
                7566,
                7574
            ],
            [
                7575,
                7632
            ],
            [
                7632,
                7723
            ],
            [
                7723,
                7746
            ],
            [
                7753,
                7761
            ],
            [
                7762,
                7842
            ],
            [
                7849,
                7903
            ],
            [
                7903,
                7904
            ],
            [
                7905,
                7927
            ],
            [
                7936,
                7945
            ],
            [
                7946,
                7951
            ],
            [
                7952,
                8023
            ],
            [
                8024,
                8050
            ],
            [
                8051,
                8100
            ],
            [
                8100,
                8104
            ],
            [
                8113,
                8190
            ],
            [
                8190,
                8316
            ],
            [
                8316,
                8377
            ],
            [
                8379,
                8432
            ],
            [
                8433,
                8439
            ],
            [
                8439,
                8446
            ],
            [
                8447,
                8460
            ],
            [
                8467,
                8511
            ],
            [
                8512,
                8582
            ],
            [
                8582,
                8636
            ],
            [
                8636,
                8637
            ],
            [
                8638,
                8684
            ],
            [
                8685,
                8703
            ],
            [
                8703,
                8704
            ],
            [
                8705,
                8766
            ],
            [
                8767,
                8788
            ],
            [
                8789,
                8829
            ],
            [
                8829,
                8860
            ],
            [
                8861,
                8870
            ],
            [
                8873,
                8910
            ],
            [
                8911,
                8938
            ],
            [
                8946,
                8954
            ],
            [
                8954,
                8995
            ],
            [
                8996,
                9029
            ],
            [
                9029,
                9059
            ],
            [
                9060,
                9080
            ],
            [
                9080,
                9131
            ],
            [
                9132,
                9177
            ],
            [
                9177,
                9243
            ],
            [
                9243,
                9271
            ],
            [
                9272,
                9323
            ],
            [
                9323,
                9325
            ],
            [
                9325,
                9332
            ],
            [
                9333,
                9355
            ],
            [
                9356,
                9399
            ],
            [
                9400,
                9417
            ],
            [
                9417,
                9427
            ],
            [
                9432,
                9496
            ],
            [
                9501,
                9552
            ],
            [
                9553,
                9582
            ],
            [
                9596,
                9620
            ],
            [
                9621,
                9649
            ],
            [
                9649,
                9651
            ],
            [
                9651,
                9663
            ],
            [
                9664,
                9672
            ],
            [
                9673,
                9707
            ],
            [
                9707,
                9708
            ],
            [
                9709,
                9786
            ],
            [
                9794,
                9806
            ],
            [
                9806,
                9868
            ],
            [
                9868,
                9923
            ],
            [
                9924,
                9959
            ],
            [
                9965,
                9972
            ],
            [
                9978,
                9988
            ],
            [
                10001,
                10009
            ],
            [
                10019,
                10043
            ],
            [
                10043,
                10085
            ],
            [
                10090,
                10126
            ],
            [
                10129,
                10143
            ],
            [
                10143,
                10165
            ],
            [
                10166,
                10186
            ],
            [
                10189,
                10221
            ],
            [
                10221,
                10241
            ],
            [
                10250,
                10266
            ],
            [
                10267,
                10270
            ],
            [
                10271,
                10332
            ],
            [
                10332,
                10362
            ],
            [
                10362,
                10399
            ],
            [
                10399,
                10457
            ],
            [
                10457,
                10487
            ],
            [
                10487,
                10526
            ],
            [
                10526,
                10546
            ],
            [
                10555,
                10611
            ],
            [
                10611,
                10661
            ],
            [
                10661,
                10687
            ],
            [
                10691,
                10697
            ],
            [
                10699,
                10701
            ],
            [
                10701,
                10716
            ],
            [
                10719,
                10740
            ],
            [
                10740,
                10799
            ],
            [
                10800,
                10820
            ],
            [
                10821,
                10848
            ],
            [
                10851,
                10874
            ],
            [
                10875,
                10887
            ],
            [
                10888,
                10915
            ],
            [
                10921,
                10933
            ],
            [
                10934,
                10939
            ],
            [
                10945,
                11025
            ],
            [
                11028,
                11078
            ],
            [
                11078,
                11080
            ],
            [
                11080,
                11113
            ],
            [
                11115,
                11176
            ],
            [
                11176,
                11207
            ],
            [
                11208,
                11254
            ],
            [
                11255,
                11301
            ],
            [
                11306,
                11319
            ],
            [
                11319,
                11321
            ],
            [
                11321,
                11341
            ],
            [
                11342,
                11345
            ],
            [
                11346,
                11493
            ],
            [
                11493,
                11556
            ],
            [
                11556,
                11557
            ],
            [
                11558,
                11586
            ],
            [
                11593,
                11607
            ],
            [
                11608,
                11648
            ],
            [
                11648,
                11652
            ],
            [
                11652,
                11690
            ],
            [
                11691,
                11757
            ],
            [
                11758,
                11781
            ],
            [
                11781,
                11844
            ],
            [
                11844,
                11846
            ],
            [
                11846,
                11893
            ],
            [
                11899,
                11912
            ],
            [
                11912,
                11913
            ],
            [
                11914,
                12039
            ],
            [
                12044,
                12085
            ],
            [
                12086,
                12105
            ],
            [
                12105,
                12120
            ],
            [
                12122,
                12124
            ],
            [
                12129,
                12143
            ],
            [
                12144,
                12187
            ],
            [
                12196,
                12226
            ],
            [
                12226,
                12393
            ],
            [
                12393,
                12408
            ],
            [
                12409,
                12511
            ],
            [
                12511,
                12512
            ],
            [
                12513,
                12515
            ],
            [
                12526,
                12536
            ],
            [
                12537,
                12551
            ],
            [
                12552,
                12563
            ],
            [
                12564,
                12569
            ],
            [
                12572,
                12582
            ],
            [
                12594,
                12596
            ],
            [
                12601,
                12609
            ],
            [
                12610,
                12617
            ],
            [
                12618,
                12621
            ],
            [
                12622,
                12629
            ],
            [
                12630,
                12648
            ],
            [
                12649,
                12652
            ],
            [
                12653,
                12662
            ],
            [
                12663,
                12677
            ],
            [
                12677,
                12682
            ],
            [
                12683,
                12694
            ],
            [
                12694,
                12696
            ],
            [
                12697,
                12705
            ],
            [
                12706,
                12709
            ],
            [
                12720,
                12721
            ],
            [
                12722,
                12748
            ],
            [
                12749,
                12761
            ],
            [
                12761,
                12762
            ],
            [
                12763,
                12780
            ],
            [
                12784,
                12805
            ],
            [
                12805,
                12810
            ],
            [
                12821,
                12839
            ],
            [
                12840,
                12846
            ],
            [
                12855,
                12863
            ],
            [
                12863,
                12891
            ],
            [
                12901,
                12911
            ],
            [
                12911,
                12944
            ],
            [
                12945,
                12947
            ],
            [
                12948,
                12951
            ],
            [
                12952,
                13007
            ],
            [
                13007,
                13009
            ],
            [
                13009,
                13039
            ],
            [
                13045,
                13106
            ],
            [
                13107,
                13173
            ],
            [
                13173,
                13175
            ],
            [
                13175,
                13220
            ],
            [
                13222,
                13269
            ],
            [
                13269,
                13320
            ],
            [
                13320,
                13325
            ],
            [
                13332,
                13351
            ],
            [
                13358,
                13386
            ],
            [
                13387,
                13432
            ],
            [
                13442,
                13496
            ],
            [
                13496,
                13497
            ],
            [
                13498,
                13520
            ],
            [
                13521,
                13525
            ],
            [
                13525,
                13561
            ],
            [
                13568,
                13571
            ],
            [
                13577,
                13579
            ],
            [
                13580,
                13587
            ],
            [
                13597,
                13601
            ],
            [
                13602,
                13616
            ],
            [
                13616,
                13629
            ],
            [
                13634,
                13663
            ],
            [
                13663,
                13671
            ],
            [
                13672,
                13675
            ],
            [
                13683,
                13715
            ],
            [
                13715,
                13742
            ],
            [
                13742,
                13743
            ],
            [
                13757,
                13758
            ],
            [
                13759,
                13765
            ],
            [
                13766,
                13773
            ],
            [
                13774,
                13782
            ],
            [
                13792,
                13815
            ],
            [
                13815,
                13906
            ],
            [
                13917,
                13973
            ],
            [
                13973,
                14012
            ],
            [
                14021,
                14026
            ],
            [
                14027,
                14075
            ],
            [
                14076,
                14123
            ],
            [
                14123,
                14125
            ],
            [
                14125,
                14149
            ],
            [
                14149,
                14194
            ],
            [
                14198,
                14214
            ],
            [
                14218,
                14232
            ],
            [
                14232,
                14268
            ],
            [
                14282,
                14306
            ],
            [
                14306,
                14308
            ],
            [
                14308,
                14330
            ],
            [
                14330,
                14365
            ],
            [
                14365,
                14372
            ],
            [
                14378,
                14407
            ],
            [
                14408,
                14413
            ],
            [
                14414,
                14429
            ],
            [
                14429,
                14430
            ],
            [
                14436,
                14440
            ],
            [
                14441,
                14451
            ],
            [
                14451,
                14500
            ],
            [
                14500,
                14533
            ],
            [
                14533,
                14557
            ],
            [
                14561,
                14572
            ],
            [
                14572,
                14579
            ],
            [
                14585,
                14594
            ],
            [
                14595,
                14603
            ],
            [
                14603,
                14608
            ],
            [
                14609,
                14618
            ],
            [
                14623,
                14674
            ],
            [
                14674,
                14693
            ],
            [
                14699,
                14701
            ],
            [
                14702,
                14747
            ],
            [
                14752,
                14773
            ],
            [
                14781,
                14828
            ],
            [
                14828,
                14846
            ],
            [
                14847,
                14855
            ],
            [
                14856,
                14864
            ],
            [
                14865,
                14883
            ],
            [
                14891,
                14963
            ],
            [
                14968,
                14971
            ],
            [
                14972,
                15096
            ],
            [
                15097,
                15132
            ],
            [
                15132,
                15134
            ],
            [
                15134,
                15196
            ],
            [
                15196,
                15202
            ],
            [
                15208,
                15211
            ],
            [
                15221,
                15231
            ],
            [
                15231,
                15253
            ],
            [
                15259,
                15263
            ],
            [
                15264,
                15301
            ],
            [
                15301,
                15302
            ],
            [
                15303,
                15305
            ],
            [
                15306,
                15310
            ],
            [
                15314,
                15315
            ],
            [
                15316,
                15319
            ],
            [
                15337,
                15346
            ],
            [
                15347,
                15366
            ],
            [
                15367,
                15370
            ],
            [
                15371,
                15379
            ],
            [
                15384,
                15388
            ],
            [
                15389,
                15422
            ],
            [
                15423,
                15428
            ],
            [
                15429,
                15433
            ],
            [
                15434,
                15449
            ],
            [
                15449,
                15454
            ],
            [
                15455,
                15465
            ],
            [
                15466,
                15471
            ],
            [
                15472,
                15498
            ],
            [
                15498,
                15537
            ],
            [
                15538,
                15570
            ],
            [
                15571,
                15588
            ],
            [
                15589,
                15625
            ],
            [
                15626,
                15649
            ],
            [
                15649,
                15660
            ],
            [
                15661,
                15712
            ],
            [
                15713,
                15721
            ],
            [
                15721,
                15837
            ],
            [
                15844,
                15860
            ],
            [
                15860,
                15862
            ],
            [
                15863,
                15867
            ],
            [
                15868,
                15921
            ],
            [
                15921,
                15923
            ],
            [
                15923,
                16003
            ],
            [
                16009,
                16016
            ],
            [
                16017,
                16039
            ],
            [
                16040,
                16045
            ],
            [
                16046,
                16061
            ],
            [
                16062,
                16076
            ],
            [
                16079,
                16108
            ],
            [
                16108,
                16113
            ],
            [
                16114,
                16120
            ],
            [
                16121,
                16133
            ],
            [
                16135,
                16166
            ],
            [
                16167,
                16182
            ],
            [
                16187,
                16198
            ],
            [
                16199,
                16203
            ],
            [
                16209,
                16220
            ],
            [
                16220,
                16221
            ],
            [
                16222,
                16233
            ],
            [
                16233,
                16244
            ],
            [
                16245,
                16287
            ],
            [
                16287,
                16297
            ],
            [
                16308,
                16310
            ],
            [
                16318,
                16375
            ],
            [
                16380,
                16382
            ],
            [
                16388,
                16422
            ],
            [
                16436,
                16443
            ],
            [
                16444,
                16486
            ],
            [
                16486,
                16488
            ],
            [
                16488,
                16505
            ],
            [
                16505,
                16583
            ],
            [
                16584,
                16591
            ],
            [
                16592,
                16604
            ],
            [
                16604,
                16609
            ],
            [
                16610,
                16627
            ],
            [
                16629,
                16632
            ],
            [
                16633,
                16652
            ],
            [
                16652,
                16707
            ],
            [
                16708,
                16714
            ],
            [
                16715,
                16724
            ],
            [
                16725,
                16755
            ],
            [
                16759,
                16778
            ],
            [
                16779,
                16794
            ],
            [
                16794,
                16839
            ],
            [
                16839,
                16864
            ],
            [
                16864,
                16930
            ],
            [
                16939,
                16947
            ],
            [
                16948,
                16965
            ],
            [
                16967,
                17046
            ],
            [
                17046,
                17098
            ],
            [
                17103,
                17117
            ],
            [
                17118,
                17132
            ],
            [
                17133,
                17156
            ],
            [
                17159,
                17224
            ],
            [
                17224,
                17228
            ],
            [
                17228,
                17300
            ],
            [
                17301,
                17335
            ],
            [
                17335,
                17355
            ],
            [
                17364,
                17454
            ],
            [
                17455,
                17486
            ],
            [
                17487,
                17510
            ],
            [
                17511,
                17520
            ],
            [
                17521,
                17559
            ],
            [
                17560,
                17587
            ],
            [
                17587,
                17589
            ],
            [
                17589,
                17605
            ],
            [
                17605,
                17614
            ],
            [
                17614,
                17646
            ],
            [
                17646,
                17672
            ],
            [
                17673,
                17719
            ],
            [
                17728,
                17731
            ],
            [
                17731,
                17794
            ],
            [
                17794,
                17881
            ],
            [
                17882,
                17921
            ],
            [
                17921,
                18064
            ],
            [
                18064,
                18141
            ],
            [
                18144,
                18170
            ],
            [
                18170,
                18207
            ],
            [
                18208,
                18253
            ],
            [
                18254,
                18268
            ],
            [
                18268,
                18270
            ],
            [
                18270,
                18334
            ],
            [
                18335,
                18412
            ],
            [
                18422,
                18448
            ],
            [
                18449,
                18477
            ],
            [
                18479,
                18517
            ],
            [
                18518,
                18552
            ],
            [
                18553,
                18556
            ],
            [
                18559,
                18595
            ],
            [
                18598,
                18622
            ],
            [
                18622,
                18624
            ],
            [
                18624,
                18627
            ],
            [
                18631,
                18716
            ],
            [
                18718,
                18825
            ],
            [
                18833,
                18851
            ],
            [
                18851,
                18853
            ],
            [
                18853,
                18872
            ],
            [
                18878,
                18890
            ],
            [
                18890,
                18891
            ],
            [
                18892,
                18918
            ],
            [
                18930,
                18932
            ],
            [
                18933,
                18985
            ],
            [
                18986,
                18998
            ],
            [
                19000,
                19025
            ],
            [
                19026,
                19172
            ],
            [
                19185,
                19222
            ],
            [
                19222,
                19225
            ],
            [
                19226,
                19250
            ],
            [
                19250,
                19287
            ],
            [
                19288,
                19321
            ],
            [
                19322,
                19327
            ],
            [
                19331,
                19338
            ],
            [
                19344,
                19377
            ],
            [
                19378,
                19380
            ],
            [
                19381,
                19416
            ],
            [
                19427,
                19539
            ],
            [
                19540,
                19545
            ],
            [
                19547,
                19554
            ],
            [
                19563,
                19568
            ],
            [
                19569,
                19590
            ],
            [
                19591,
                19595
            ],
            [
                19596,
                19624
            ],
            [
                19624,
                19626
            ],
            [
                19627,
                19630
            ],
            [
                19652,
                19683
            ],
            [
                19687,
                19702
            ],
            [
                19709,
                19776
            ]
        ],
        "row_chars": [
            [
                0,
                85
            ],
            [
                85,
                195
            ],
            [
                195,
                419
            ],
            [
                419,
                450
            ],
            [
                450,
                555
            ],
            [
                555,
                711
            ],
            [
                711,
                798
            ],
            [
                798,
                858
            ],
            [
                858,
                858
            ],
            [
                858,
                858
            ],
            [
                858,
                1054
            ],
            [
                1054,
                1054
            ],
            [
                1054,
                1125
            ],
            [
                1125,
                1218
            ],
            [
                1218,
                1277
            ],
            [
                1277,
                1284
            ],
            [
                1284,
                1322
            ],
            [
                1322,
                1409
            ],
            [
                1409,
                1491
            ],
            [
                1491,
                1556
            ],
            [
                1556,
                1608
            ],
            [
                1608,
                1650
            ],
            [
                1650,
                1695
            ],
            [
                1695,
                1828
            ],
            [
                1828,
                1926
            ],
            [
                1926,
                1926
            ],
            [
                1926,
                1989
            ],
            [
                1989,
                2040
            ],
            [
                2040,
                2116
            ],
            [
                2116,
                2214
            ],
            [
                2214,
                2249
            ],
            [
                2249,
                2285
            ],
            [
                2285,
                2346
            ],
            [
                2346,
                2487
            ],
            [
                2487,
                2593
            ],
            [
                2593,
                2659
            ],
            [
                2659,
                2725
            ],
            [
                2725,
                2725
            ],
            [
                2725,
                2725
            ],
            [
                2725,
                2725
            ],
            [
                2725,
                2725
            ],
            [
                2725,
                2770
            ],
            [
                2770,
                2845
            ],
            [
                2845,
                2975
            ],
            [
                2975,
                2986
            ],
            [
                2986,
                3036
            ],
            [
                3036,
                3036
            ],
            [
                3036,
                3036
            ],
            [
                3036,
                3074
            ],
            [
                3074,
                3074
            ],
            [
                3074,
                3074
            ],
            [
                3074,
                3074
            ],
            [
                3074,
                3208
            ],
            [
                3208,
                3208
            ],
            [
                3208,
                3237
            ],
            [
                3237,
                3266
            ],
            [
                3266,
                3313
            ],
            [
                3313,
                3313
            ],
            [
                3313,
                3366
            ],
            [
                3366,
                3413
            ],
            [
                3413,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3582
            ],
            [
                3582,
                3582
            ],
            [
                3582,
                3638
            ],
            [
                3638,
                3704
            ],
            [
                3704,
                3750
            ],
            [
                3750,
                3750
            ],
            [
                3750,
                3812
            ],
            [
                3812,
                3898
            ],
            [
                3898,
                3984
            ],
            [
                3984,
                4026
            ],
            [
                4026,
                4071
            ],
            [
                4071,
                4115
            ],
            [
                4115,
                4160
            ],
            [
                4160,
                4240
            ],
            [
                4240,
                4259
            ],
            [
                4259,
                4288
            ],
            [
                4288,
                4421
            ],
            [
                4421,
                4489
            ],
            [
                4489,
                4489
            ],
            [
                4489,
                4544
            ],
            [
                4544,
                4609
            ],
            [
                4609,
                4710
            ],
            [
                4710,
                4823
            ],
            [
                4823,
                4886
            ],
            [
                4886,
                4916
            ],
            [
                4916,
                4961
            ],
            [
                4961,
                4979
            ],
            [
                4979,
                5003
            ],
            [
                5003,
                5020
            ],
            [
                5020,
                5076
            ],
            [
                5076,
                5138
            ],
            [
                5138,
                5138
            ],
            [
                5138,
                5193
            ],
            [
                5193,
                5216
            ],
            [
                5216,
                5250
            ],
            [
                5250,
                5311
            ],
            [
                5311,
                5411
            ],
            [
                5411,
                5455
            ],
            [
                5455,
                5495
            ],
            [
                5495,
                5551
            ],
            [
                5551,
                5591
            ],
            [
                5591,
                5703
            ],
            [
                5703,
                5760
            ],
            [
                5760,
                5880
            ],
            [
                5880,
                5987
            ],
            [
                5987,
                6049
            ],
            [
                6049,
                6082
            ],
            [
                6082,
                6138
            ],
            [
                6138,
                6202
            ],
            [
                6202,
                6232
            ],
            [
                6232,
                6232
            ],
            [
                6232,
                6271
            ],
            [
                6271,
                6390
            ],
            [
                6390,
                6573
            ],
            [
                6573,
                6664
            ],
            [
                6664,
                6740
            ],
            [
                6740,
                6816
            ],
            [
                6816,
                6931
            ],
            [
                6931,
                6984
            ],
            [
                6984,
                7113
            ],
            [
                7113,
                7202
            ],
            [
                7202,
                7239
            ],
            [
                7239,
                7357
            ],
            [
                7357,
                7454
            ],
            [
                7454,
                7547
            ],
            [
                7547,
                7632
            ],
            [
                7632,
                7723
            ],
            [
                7723,
                7723
            ],
            [
                7723,
                8024
            ],
            [
                8024,
                8100
            ],
            [
                8100,
                8190
            ],
            [
                8190,
                8190
            ],
            [
                8190,
                8316
            ],
            [
                8316,
                8439
            ],
            [
                8439,
                8582
            ],
            [
                8582,
                8829
            ],
            [
                8829,
                8996
            ],
            [
                8996,
                8996
            ],
            [
                8996,
                8996
            ],
            [
                8996,
                9080
            ],
            [
                9080,
                9243
            ],
            [
                9243,
                9325
            ],
            [
                9325,
                9417
            ],
            [
                9417,
                9553
            ],
            [
                9553,
                9553
            ],
            [
                9553,
                9651
            ],
            [
                9651,
                9806
            ],
            [
                9806,
                9868
            ],
            [
                9868,
                9989
            ],
            [
                9989,
                10043
            ],
            [
                10043,
                10143
            ],
            [
                10143,
                10332
            ],
            [
                10332,
                10399
            ],
            [
                10399,
                10457
            ],
            [
                10457,
                10487
            ],
            [
                10487,
                10526
            ],
            [
                10526,
                10526
            ],
            [
                10526,
                10611
            ],
            [
                10611,
                10611
            ],
            [
                10611,
                10611
            ],
            [
                10611,
                10661
            ],
            [
                10661,
                10661
            ],
            [
                10661,
                10701
            ],
            [
                10701,
                10740
            ],
            [
                10740,
                10800
            ],
            [
                10800,
                11080
            ],
            [
                11080,
                11176
            ],
            [
                11176,
                11321
            ],
            [
                11321,
                11493
            ],
            [
                11493,
                11586
            ],
            [
                11586,
                11648
            ],
            [
                11648,
                11781
            ],
            [
                11781,
                11846
            ],
            [
                11846,
                11914
            ],
            [
                11914,
                12105
            ],
            [
                12105,
                12226
            ],
            [
                12226,
                12393
            ],
            [
                12393,
                12663
            ],
            [
                12663,
                12863
            ],
            [
                12863,
                12911
            ],
            [
                12911,
                13009
            ],
            [
                13009,
                13107
            ],
            [
                13107,
                13175
            ],
            [
                13175,
                13220
            ],
            [
                13220,
                13220
            ],
            [
                13220,
                13269
            ],
            [
                13269,
                13387
            ],
            [
                13387,
                13616
            ],
            [
                13616,
                13715
            ],
            [
                13715,
                13815
            ],
            [
                13815,
                13973
            ],
            [
                13973,
                14076
            ],
            [
                14076,
                14125
            ],
            [
                14125,
                14149
            ],
            [
                14149,
                14232
            ],
            [
                14232,
                14308
            ],
            [
                14308,
                14365
            ],
            [
                14365,
                14500
            ],
            [
                14500,
                14533
            ],
            [
                14533,
                14572
            ],
            [
                14572,
                14674
            ],
            [
                14674,
                14747
            ],
            [
                14747,
                14828
            ],
            [
                14828,
                15134
            ],
            [
                15134,
                15196
            ],
            [
                15196,
                15303
            ],
            [
                15303,
                15498
            ],
            [
                15498,
                15626
            ],
            [
                15626,
                15860
            ],
            [
                15860,
                15923
            ],
            [
                15923,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16287
            ],
            [
                16287,
                16488
            ],
            [
                16488,
                16652
            ],
            [
                16652,
                16794
            ],
            [
                16794,
                16864
            ],
            [
                16864,
                17046
            ],
            [
                17046,
                17224
            ],
            [
                17224,
                17228
            ],
            [
                17228,
                17335
            ],
            [
                17335,
                17589
            ],
            [
                17589,
                17605
            ],
            [
                17605,
                17614
            ],
            [
                17614,
                17646
            ],
            [
                17646,
                17731
            ],
            [
                17731,
                17921
            ],
            [
                17921,
                18064
            ],
            [
                18064,
                18170
            ],
            [
                18170,
                18208
            ],
            [
                18208,
                18208
            ],
            [
                18208,
                18270
            ],
            [
                18270,
                18449
            ],
            [
                18449,
                18624
            ],
            [
                18624,
                18853
            ],
            [
                18853,
                19222
            ],
            [
                19222,
                19250
            ],
            [
                19250,
                19417
            ],
            [
                19417,
                19624
            ],
            [
                19624,
                19624
            ],
            [
                19624,
                19776
            ]
        ]
    }
}