{
    "original": {
        "text": "On quitting Brighton, our friend George, as became a person of rank and fashion travelling in a barouche with four horses, drove in state to a fine hotel in Cavendish Square, where a suite of splendid rooms, and a table magnificently furnished with plate and surrounded by a half-dozen of black and silent waiters, was ready to receive the young gentleman and his bride. George did the honours of the place with a princely air to Jos and Dobbin; and Amelia, for the first time, and with exceeding shyness and timidity, presided at what George called her own table.\nGeorge pooh-poohed the wine and bullied the waiters royally, and Jos gobbled the turtle with immense satisfaction. Dobbin helped him to it; for the lady of the house, before whom the tureen was placed, was so ignorant of the contents, that she was going to help Mr. Sedley without bestowing upon him either calipash or calipee.\nThe splendour of the entertainment, and the apartments in which it was given, alarmed Mr. Dobbin, who remonstrated after dinner, when Jos was asleep in the great chair. But in vain he cried out against the enormity of turtle and champagne that was fit for an archbishop. \"I've always been accustomed to travel like a gentleman,\" George said, \"and, damme, my wife shall travel like a lady. As long as there's a shot in the locker, she shall want for nothing,\" said the generous fellow, quite pleased with himself for his magnificence of spirit. Nor did Dobbin try and convince him that Amelia's happiness was not centred in turtle-soup.\nA while after dinner, Amelia timidly expressed a wish to go and see her mamma, at Fulham: which permission George granted her with some grumbling. And she tripped away to her enormous bedroom, in the centre of which stood the enormous funereal bed, \"that the Emperor Halixander's sister slep in when the allied sufferings was here,\" and put on her little bonnet and shawl with the utmost eagerness and pleasure. George was still drinking claret when she returned to the dining-room, and made no signs of moving. \"Ar'n't you coming with me, dearest?\" she asked him. No; the \"dearest\" had \"business\" that night. His man should get her a coach and go with her. And the coach being at the door of the hotel, Amelia made George a little disappointed curtsey after looking vainly into his face once or twice, and went sadly down the great staircase, Captain Dobbin after, who handed her into the vehicle, and saw it drive away to its destination. The very valet was ashamed of mentioning the address to the hackney-coachman before the hotel waiters, and promised to instruct him when they got further on.\nDobbin walked home to his old quarters and the Slaughters', thinking very likely that it would be delightful to be in that hackney-coach, along with Mrs. Osborne. George was evidently of quite a different taste; for when he had taken wine enough, he went off to half-price at the play, to see Mr. Kean perform in Shylock. Captain Osborne was a great lover of the drama, and had himself performed high-comedy characters with great distinction in several garrison theatrical entertainments. Jos slept on until long after dark, when he woke up with a start at the motions of his servant, who was removing and emptying the decanters on the table; and the hackney-coach stand was again put into requisition for a carriage to convey this stout hero to his lodgings and bed.\nMrs. Sedley, you may be sure, clasped her daughter to her heart with all maternal eagerness and affection, running out of the door as the carriage drew up before the little garden-gate, to welcome the weeping, trembling, young bride. Old Mr. Clapp, who was in his shirt-sleeves, trimming the garden-plot, shrank back alarmed. The Irish servant-lass rushed up from the kitchen and smiled a \"God bless you.\" Amelia could hardly walk along the flags and up the steps into the parlour.\nHow the floodgates were opened, and mother and daughter wept, when they were together embracing each other in this sanctuary, may readily be imagined by every reader who possesses the least sentimental turn. When don't ladies weep? At what occasion of joy, sorrow, or other business of life, and, after such an event as a marriage, mother and daughter were surely at liberty to give way to a sensibility which is as tender as it is refreshing. About a question of marriage I have seen women who hate each other kiss and cry together quite fondly. How much more do they feel when they love! Good mothers are married over again at their daughters' weddings: and as for subsequent events, who does not know how ultra-maternal grandmothers are?--in fact a woman, until she is a grandmother, does not often really know what to be a mother is. Let us respect Amelia and her mamma whispering and whimpering and laughing and crying in the parlour and the twilight. Old Mr. Sedley did. HE had not divined who was in the carriage when it drove up. He had not flown out to meet his daughter, though he kissed her very warmly when she entered the room (where he was occupied, as usual, with his papers and tapes and statements of accounts), and after sitting with the mother and daughter for a short time, he very wisely left the little apartment in their possession.\nGeorge's valet was looking on in a very supercilious manner at Mr. Clapp in his shirt-sleeves, watering his rose-bushes. He took off his hat, however, with much condescension to Mr. Sedley, who asked news about his son-in-law, and about Jos's carriage, and whether his horses had been down to Brighton, and about that infernal traitor Bonaparty, and the war; until the Irish maid-servant came with a plate and a bottle of wine, from which the old gentleman insisted upon helping the valet. He gave him a half-guinea too, which the servant pocketed with a mixture of wonder and contempt. \"To the health of your master and mistress, Trotter,\" Mr. Sedley said, \"and here's something to drink your health when you get home, Trotter.\"\nThere were but nine days past since Amelia had left that little cottage and home--and yet how far off the time seemed since she had bidden it farewell. What a gulf lay between her and that past life. She could look back to it from her present standing-place, and contemplate, almost as another being, the young unmarried girl absorbed in her love, having no eyes but for one special object, receiving parental affection if not ungratefully, at least indifferently, and as if it were her due--her whole heart and thoughts bent on the accomplishment of one desire. The review of those days, so lately gone yet so far away, touched her with shame; and the aspect of the kind parents filled her with tender remorse. Was the prize gained--the heaven of life--and the winner still doubtful and unsatisfied? As his hero and heroine pass the matrimonial barrier, the novelist generally drops the curtain, as if the drama were over then: the doubts and struggles of life ended: as if, once landed in the marriage country, all were green and pleasant there: and wife and husband had nothing to do but to link each other's arms together, and wander gently downwards towards old age in happy and perfect fruition. But our little Amelia was just on the bank of her new country, and was already looking anxiously back towards the sad friendly figures waving farewell to her across the stream, from the other distant shore.\nIn honour of the young bride's arrival, her mother thought it necessary to prepare I don't know what festive entertainment, and after the first ebullition of talk, took leave of Mrs. George Osborne for a while, and dived down to the lower regions of the house to a sort of kitchen-parlour (occupied by Mr. and Mrs. Clapp, and in the evening, when her dishes were washed and her curl-papers removed, by Miss Flannigan, the Irish servant), there to take measures for the preparing of a magnificent ornamented tea. All people have their ways of expressing kindness, and it seemed to Mrs. Sedley that a muffin and a quantity of orange marmalade spread out in a little cut-glass saucer would be peculiarly agreeable refreshments to Amelia in her most interesting situation.\nWhile these delicacies were being transacted below, Amelia, leaving the drawing-room, walked upstairs and found herself, she scarce knew how, in the little room which she had occupied before her marriage, and in that very chair in which she had passed so many bitter hours. She sank back in its arms as if it were an old friend; and fell to thinking over the past week, and the life beyond it. Already to be looking sadly and vaguely back: always to be pining for something which, when obtained, brought doubt and sadness rather than pleasure; here was the lot of our poor little creature and harmless lost wanderer in the great struggling crowds of Vanity Fair.\nHere she sate, and recalled to herself fondly that image of George to which she had knelt before marriage. Did she own to herself how different the real man was from that superb young hero whom she had worshipped? It requires many, many years--and a man must be very bad indeed--before a woman's pride and vanity will let her own to such a confession. Then Rebecca's twinkling green eyes and baleful smile lighted upon her, and filled her with dismay. And so she sate for awhile indulging in her usual mood of selfish brooding, in that very listless melancholy attitude in which the honest maid-servant had found her, on the day when she brought up the letter in which George renewed his offer of marriage.\nShe looked at the little white bed, which had been hers a few days before, and thought she would like to sleep in it that night, and wake, as formerly, with her mother smiling over her in the morning: Then she thought with terror of the great funereal damask pavilion in the vast and dingy state bedroom, which was awaiting her at the grand hotel in Cavendish Square. Dear little white bed! how many a long night had she wept on its pillow! How she had despaired and hoped to die there; and now were not all her wishes accomplished, and the lover of whom she had despaired her own for ever? Kind mother! how patiently and tenderly she had watched round that bed! She went and knelt down by the bedside; and there this wounded and timorous, but gentle and loving soul, sought for consolation, where as yet, it must be owned, our little girl had but seldom looked for it. Love had been her faith hitherto; and the sad, bleeding disappointed heart began to feel the want of another consoler.\nHave we a right to repeat or to overhear her prayers? These, brother, are secrets, and out of the domain of Vanity Fair, in which our story lies.\nBut this may be said, that when the tea was finally announced, our young lady came downstairs a great deal more cheerful; that she did not despond, or deplore her fate, or think about George's coldness, or Rebecca's eyes, as she had been wont to do of late. She went downstairs, and kissed her father and mother, and talked to the old gentleman, and made him more merry than he had been for many a day. She sate down at the piano which Dobbin had bought for her, and sang over all her father's favourite old songs. She pronounced the tea to be excellent, and praised the exquisite taste in which the marmalade was arranged in the saucers. And in determining to make everybody else happy, she found herself so; and was sound asleep in the great funereal pavilion, and only woke up with a smile when George arrived from the theatre.\nFor the next day, George had more important \"business\" to transact than that which took him to see Mr. Kean in Shylock. Immediately on his arrival in London he had written off to his father's solicitors, signifying his royal pleasure that an interview should take place between them on the morrow. His hotel bill, losses at billiards and cards to Captain Crawley had almost drained the young man's purse, which wanted replenishing before he set out on his travels, and he had no resource but to infringe upon the two thousand pounds which the attorneys were commissioned to pay over to him. He had a perfect belief in his own mind that his father would relent before very long. How could any parent be obdurate for a length of time against such a paragon as he was? If his mere past and personal merits did not succeed in mollifying his father, George determined that he would distinguish himself so prodigiously in the ensuing campaign that the old gentleman must give in to him. And if not? Bah! the world was before him. His luck might change at cards, and there was a deal of spending in two thousand pounds.\nSo he sent off Amelia once more in a carriage to her mamma, with strict orders and carte blanche to the two ladies to purchase everything requisite for a lady of Mrs. George Osborne's fashion, who was going on a foreign tour. They had but one day to complete the outfit, and it may be imagined that their business therefore occupied them pretty fully. In a carriage once more, bustling about from milliner to linen-draper, escorted back to the carriage by obsequious shopmen or polite owners, Mrs. Sedley was herself again almost, and sincerely happy for the first time since their misfortunes. Nor was Mrs. Amelia at all above the pleasure of shopping, and bargaining, and seeing and buying pretty things. (Would any man, the most philosophic, give twopence for a woman who was?) She gave herself a little treat, obedient to her husband's orders, and purchased a quantity of lady's gear, showing a great deal of taste and elegant discernment, as all the shopfolks said.\nAnd about the war that was ensuing, Mrs. Osborne was not much alarmed; Bonaparty was to be crushed almost without a struggle. Margate packets were sailing every day, filled with men of fashion and ladies of note, on their way to Brussels and Ghent. People were going not so much to a war as to a fashionable tour. The newspapers laughed the wretched upstart and swindler to scorn. Such a Corsican wretch as that withstand the armies of Europe and the genius of the immortal Wellington! Amelia held him in utter contempt; for it needs not to be said that this soft and gentle creature took her opinions from those people who surrounded her, such fidelity being much too humble-minded to think for itself. Well, in a word, she and her mother performed a great day's shopping, and she acquitted herself with considerable liveliness and credit on this her first appearance in the genteel world of London.\nGeorge meanwhile, with his hat on one side, his elbows squared, and his swaggering martial air, made for Bedford Row, and stalked into the attorney's offices as if he was lord of every pale-faced clerk who was scribbling there. He ordered somebody to inform Mr. Higgs that Captain Osborne was waiting, in a fierce and patronizing way, as if the pekin of an attorney, who had thrice his brains, fifty times his money, and a thousand times his experience, was a wretched underling who should instantly leave all his business in life to attend on the Captain's pleasure. He did not see the sneer of contempt which passed all round the room, from the first clerk to the articled gents, from the articled gents to the ragged writers and white-faced runners, in clothes too tight for them, as he sate there tapping his boot with his cane, and thinking what a parcel of miserable poor devils these were. The miserable poor devils knew all about his affairs. They talked about them over their pints of beer at their public-house clubs to other clerks of a night. Ye gods, what do not attorneys and attorneys' clerks know in London! Nothing is hidden from their inquisition, and their families mutely rule our city.\nPerhaps George expected, when he entered Mr. Higgs's apartment, to find that gentleman commissioned to give him some message of compromise or conciliation from his father; perhaps his haughty and cold demeanour was adopted as a sign of his spirit and resolution: but if so, his fierceness was met by a chilling coolness and indifference on the attorney's part, that rendered swaggering absurd. He pretended to be writing at a paper, when the Captain entered. \"Pray, sit down, sir,\" said he, \"and I will attend to your little affair in a moment. Mr. Poe, get the release papers, if you please\"; and then he fell to writing again.\nPoe having produced those papers, his chief calculated the amount of two thousand pounds stock at the rate of the day; and asked Captain Osborne whether he would take the sum in a cheque upon the bankers, or whether he should direct the latter to purchase stock to that amount. \"One of the late Mrs. Osborne's trustees is out of town,\" he said indifferently, \"but my client wishes to meet your wishes, and have done with the business as quick as possible.\"\n\"Give me a cheque, sir,\" said the Captain very surlily. \"Damn the shillings and halfpence, sir,\" he added, as the lawyer was making out the amount of the draft; and, flattering himself that by this stroke of magnanimity he had put the old quiz to the blush, he stalked out of the office with the paper in his pocket.\n\"That chap will be in gaol in two years,\" Mr. Higgs said to Mr. Poe.\n\"Won't O. come round, sir, don't you think?\"\n\"Won't the monument come round,\" Mr. Higgs replied.\n\"He's going it pretty fast,\" said the clerk. \"He's only married a week, and I saw him and some other military chaps handing Mrs. Highflyer to her carriage after the play.\" And then another case was called, and Mr. George Osborne thenceforth dismissed from these worthy gentlemen's memory.\nThe draft was upon our friends Hulker and Bullock of Lombard Street, to whose house, still thinking he was doing business, George bent his way, and from whom he received his money. Frederick Bullock, Esq., whose yellow face was over a ledger, at which sate a demure clerk, happened to be in the banking-room when George entered. His yellow face turned to a more deadly colour when he saw the Captain, and he slunk back guiltily into the inmost parlour. George was too busy gloating over the money (for he had never had such a sum before), to mark the countenance or flight of the cadaverous suitor of his sister.\nFred Bullock told old Osborne of his son's appearance and conduct. \"He came in as bold as brass,\" said Frederick. \"He has drawn out every shilling. How long will a few hundred pounds last such a chap as that?\" Osborne swore with a great oath that he little cared when or how soon he spent it. Fred dined every day in Russell Square now. But altogether, George was highly pleased with his day's business. All his own baggage and outfit was put into a state of speedy preparation, and he paid Amelia's purchases with cheques on his agents, and with the splendour of a lord.",
        "paragraph_chars": [
            [
                0,
                565
            ],
            [
                565,
                893
            ],
            [
                893,
                1529
            ],
            [
                1529,
                2628
            ],
            [
                2628,
                3396
            ],
            [
                3396,
                3878
            ],
            [
                3878,
                5234
            ],
            [
                5234,
                5964
            ],
            [
                5964,
                7373
            ],
            [
                7373,
                8142
            ],
            [
                8142,
                8805
            ],
            [
                8805,
                9512
            ],
            [
                9512,
                10501
            ],
            [
                10501,
                10647
            ],
            [
                10647,
                11478
            ],
            [
                11478,
                12591
            ],
            [
                12591,
                13562
            ],
            [
                13562,
                14463
            ],
            [
                14463,
                15670
            ],
            [
                15670,
                16299
            ],
            [
                16299,
                16756
            ],
            [
                16756,
                17073
            ],
            [
                17073,
                17142
            ],
            [
                17142,
                17187
            ],
            [
                17187,
                17239
            ],
            [
                17239,
                17528
            ],
            [
                17528,
                18141
            ],
            [
                18141,
                18712
            ]
        ],
        "segment_chars": [
            [
                0,
                371
            ],
            [
                371,
                565
            ],
            [
                565,
                680
            ],
            [
                680,
                893
            ],
            [
                893,
                1062
            ],
            [
                1062,
                1164
            ],
            [
                1164,
                1282
            ],
            [
                1282,
                1437
            ],
            [
                1437,
                1529
            ],
            [
                1529,
                1676
            ],
            [
                1676,
                1941
            ],
            [
                1941,
                2041
            ],
            [
                2041,
                2079
            ],
            [
                2079,
                2094
            ],
            [
                2094,
                2139
            ],
            [
                2139,
                2187
            ],
            [
                2187,
                2470
            ],
            [
                2470,
                2628
            ],
            [
                2628,
                2791
            ],
            [
                2791,
                2950
            ],
            [
                2950,
                3117
            ],
            [
                3117,
                3396
            ],
            [
                3396,
                3630
            ],
            [
                3630,
                3722
            ],
            [
                3722,
                3802
            ],
            [
                3802,
                3878
            ],
            [
                3878,
                4086
            ],
            [
                4086,
                4110
            ],
            [
                4110,
                4322
            ],
            [
                4322,
                4425
            ],
            [
                4425,
                4468
            ],
            [
                4468,
                4716
            ],
            [
                4716,
                4835
            ],
            [
                4835,
                4855
            ],
            [
                4855,
                4916
            ],
            [
                4916,
                5234
            ],
            [
                5234,
                5355
            ],
            [
                5355,
                5724
            ],
            [
                5724,
                5821
            ],
            [
                5821,
                5964
            ],
            [
                5964,
                6116
            ],
            [
                6116,
                6164
            ],
            [
                6164,
                6527
            ],
            [
                6527,
                6676
            ],
            [
                6676,
                6765
            ],
            [
                6765,
                7166
            ],
            [
                7166,
                7373
            ],
            [
                7373,
                7885
            ],
            [
                7885,
                8142
            ],
            [
                8142,
                8416
            ],
            [
                8416,
                8536
            ],
            [
                8536,
                8805
            ],
            [
                8805,
                8912
            ],
            [
                8912,
                9019
            ],
            [
                9019,
                9157
            ],
            [
                9157,
                9257
            ],
            [
                9257,
                9512
            ],
            [
                9512,
                9880
            ],
            [
                9880,
                9903
            ],
            [
                9903,
                9953
            ],
            [
                9953,
                10103
            ],
            [
                10103,
                10116
            ],
            [
                10116,
                10175
            ],
            [
                10175,
                10382
            ],
            [
                10382,
                10501
            ],
            [
                10501,
                10555
            ],
            [
                10555,
                10647
            ],
            [
                10647,
                10905
            ],
            [
                10905,
                11050
            ],
            [
                11050,
                11162
            ],
            [
                11162,
                11286
            ],
            [
                11286,
                11478
            ],
            [
                11478,
                11598
            ],
            [
                11598,
                11776
            ],
            [
                11776,
                12069
            ],
            [
                12069,
                12156
            ],
            [
                12156,
                12244
            ],
            [
                12244,
                12459
            ],
            [
                12459,
                12471
            ],
            [
                12471,
                12476
            ],
            [
                12476,
                12502
            ],
            [
                12502,
                12591
            ],
            [
                12591,
                12817
            ],
            [
                12817,
                12943
            ],
            [
                12943,
                13186
            ],
            [
                13186,
                13298
            ],
            [
                13298,
                13372
            ],
            [
                13372,
                13562
            ],
            [
                13562,
                13688
            ],
            [
                13688,
                13811
            ],
            [
                13811,
                13876
            ],
            [
                13876,
                13943
            ],
            [
                13943,
                14048
            ],
            [
                14048,
                14266
            ],
            [
                14266,
                14463
            ],
            [
                14463,
                14691
            ],
            [
                14691,
                15031
            ],
            [
                15031,
                15360
            ],
            [
                15360,
                15414
            ],
            [
                15414,
                15518
            ],
            [
                15518,
                15587
            ],
            [
                15587,
                15670
            ],
            [
                15670,
                16064
            ],
            [
                16064,
                16129
            ],
            [
                16129,
                16215
            ],
            [
                16215,
                16299
            ],
            [
                16299,
                16577
            ],
            [
                16577,
                16756
            ],
            [
                16756,
                16812
            ],
            [
                16812,
                17073
            ],
            [
                17073,
                17142
            ],
            [
                17142,
                17187
            ],
            [
                17187,
                17239
            ],
            [
                17239,
                17284
            ],
            [
                17284,
                17411
            ],
            [
                17411,
                17528
            ],
            [
                17528,
                17709
            ],
            [
                17709,
                17857
            ],
            [
                17857,
                17981
            ],
            [
                17981,
                18141
            ],
            [
                18141,
                18208
            ],
            [
                18208,
                18255
            ],
            [
                18255,
                18289
            ],
            [
                18289,
                18351
            ],
            [
                18351,
                18434
            ],
            [
                18434,
                18478
            ],
            [
                18478,
                18545
            ],
            [
                18545,
                18712
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                91,
                93
            ],
            [
                20,
                21
            ],
            [
                33,
                39
            ],
            [
                123,
                128
            ],
            [
                138,
                213
            ],
            [
                220,
                243
            ],
            [
                214,
                219
            ],
            [
                259,
                272
            ],
            [
                275,
                280
            ],
            [
                51,
                52
            ],
            [
                280,
                285
            ],
            [
                299,
                314
            ],
            [
                319,
                335
            ],
            [
                369,
                371
            ],
            [
                430,
                444
            ],
            [
                444,
                477
            ],
            [
                497,
                500
            ],
            [
                420,
                422
            ],
            [
                517,
                565
            ],
            [
                565,
                657
            ],
            [
                666,
                680
            ],
            [
                893,
                906
            ],
            [
                929,
                932
            ],
            [
                907,
                913
            ],
            [
                971,
                1020
            ],
            [
                1062,
                1073
            ],
            [
                1060,
                1061
            ],
            [
                1164,
                1169
            ],
            [
                1177,
                1282
            ],
            [
                1323,
                1349
            ],
            [
                1448,
                1451
            ],
            [
                1441,
                1444
            ],
            [
                1452,
                1529
            ],
            [
                1537,
                1606
            ],
            [
                1608,
                1650
            ],
            [
                1655,
                1676
            ],
            [
                1676,
                1721
            ],
            [
                1901,
                1905
            ],
            [
                1764,
                1777
            ],
            [
                1862,
                1876
            ],
            [
                1884,
                1900
            ],
            [
                2010,
                2011
            ],
            [
                1941,
                1947
            ],
            [
                1958,
                1973
            ],
            [
                1722,
                1724
            ],
            [
                1995,
                2010
            ],
            [
                1939,
                1940
            ],
            [
                2041,
                2042
            ],
            [
                2046,
                2079
            ],
            [
                2079,
                2094
            ],
            [
                2094,
                2139
            ],
            [
                2233,
                2281
            ],
            [
                2330,
                2371
            ],
            [
                2468,
                2469
            ],
            [
                2373,
                2387
            ],
            [
                2282,
                2287
            ],
            [
                2231,
                2232
            ],
            [
                2399,
                2418
            ],
            [
                2195,
                2200
            ],
            [
                2426,
                2449
            ],
            [
                2631,
                2646
            ],
            [
                2764,
                2765
            ],
            [
                2688,
                2696
            ],
            [
                2709,
                2764
            ],
            [
                2772,
                2791
            ],
            [
                2791,
                2797
            ],
            [
                2878,
                2889
            ],
            [
                2904,
                2949
            ],
            [
                3396,
                3446
            ],
            [
                3460,
                3464
            ],
            [
                3478,
                3483
            ],
            [
                3492,
                3526
            ],
            [
                3582,
                3604
            ],
            [
                3617,
                3630
            ],
            [
                3722,
                3802
            ],
            [
                3802,
                3826
            ],
            [
                3847,
                3878
            ],
            [
                3878,
                3939
            ],
            [
                3964,
                3984
            ],
            [
                4002,
                4027
            ],
            [
                4084,
                4086
            ],
            [
                4086,
                4110
            ],
            [
                4716,
                4722
            ],
            [
                4731,
                4766
            ],
            [
                4782,
                4816
            ],
            [
                4833,
                4835
            ],
            [
                4835,
                4855
            ],
            [
                4916,
                5008
            ],
            [
                5107,
                5174
            ],
            [
                5180,
                5191
            ],
            [
                5232,
                5234
            ],
            [
                5979,
                5988
            ],
            [
                6092,
                6095
            ],
            [
                5994,
                6035
            ],
            [
                6050,
                6065
            ],
            [
                6070,
                6081
            ],
            [
                6114,
                6116
            ],
            [
                6164,
                6186
            ],
            [
                6221,
                6238
            ],
            [
                6265,
                6268
            ],
            [
                6275,
                6301
            ],
            [
                6306,
                6310
            ],
            [
                6353,
                6383
            ],
            [
                6414,
                6428
            ],
            [
                6433,
                6454
            ],
            [
                6525,
                6526
            ],
            [
                6527,
                6530
            ],
            [
                6585,
                6607
            ],
            [
                6674,
                6676
            ],
            [
                6676,
                6679
            ],
            [
                6684,
                6696
            ],
            [
                6718,
                6765
            ],
            [
                6768,
                6788
            ],
            [
                6817,
                6870
            ],
            [
                6897,
                6938
            ],
            [
                7016,
                7080
            ],
            [
                7091,
                7101
            ],
            [
                7119,
                7134
            ],
            [
                7164,
                7166
            ],
            [
                7166,
                7316
            ],
            [
                7343,
                7373
            ],
            [
                7373,
                7385
            ],
            [
                7720,
                7723
            ],
            [
                7404,
                7423
            ],
            [
                7528,
                7530
            ],
            [
                7474,
                7516
            ],
            [
                7531,
                7536
            ],
            [
                7747,
                7750
            ],
            [
                7571,
                7605
            ],
            [
                7646,
                7714
            ],
            [
                7772,
                7774
            ],
            [
                7791,
                7810
            ],
            [
                7445,
                7455
            ],
            [
                7855,
                7868
            ],
            [
                7880,
                7885
            ],
            [
                7885,
                7939
            ],
            [
                7953,
                7964
            ],
            [
                7965,
                7982
            ],
            [
                7997,
                8013
            ],
            [
                8025,
                8083
            ],
            [
                8097,
                8106
            ],
            [
                8140,
                8142
            ],
            [
                8194,
                8200
            ],
            [
                8228,
                8261
            ],
            [
                8284,
                8286
            ],
            [
                8333,
                8336
            ],
            [
                8345,
                8416
            ],
            [
                8416,
                8505
            ],
            [
                8534,
                8536
            ],
            [
                8536,
                8563
            ],
            [
                8576,
                8601
            ],
            [
                8564,
                8567
            ],
            [
                8646,
                8651
            ],
            [
                8684,
                8685
            ],
            [
                8691,
                8730
            ],
            [
                8758,
                8805
            ],
            [
                8810,
                8813
            ],
            [
                8824,
                8832
            ],
            [
                8856,
                8871
            ],
            [
                8895,
                8912
            ],
            [
                8912,
                8919
            ],
            [
                8924,
                9019
            ],
            [
                9019,
                9047
            ],
            [
                9049,
                9082
            ],
            [
                9084,
                9100
            ],
            [
                9111,
                9122
            ],
            [
                9138,
                9157
            ],
            [
                9157,
                9257
            ],
            [
                9261,
                9267
            ],
            [
                9284,
                9306
            ],
            [
                9315,
                9322
            ],
            [
                9421,
                9422
            ],
            [
                9346,
                9354
            ],
            [
                9323,
                9332
            ],
            [
                9439,
                9442
            ],
            [
                9408,
                9411
            ],
            [
                9474,
                9512
            ],
            [
                9512,
                9547
            ],
            [
                9599,
                9649
            ],
            [
                9664,
                9696
            ],
            [
                9713,
                9763
            ],
            [
                9771,
                9801
            ],
            [
                9808,
                9815
            ],
            [
                9840,
                9842
            ],
            [
                9862,
                9880
            ],
            [
                9880,
                9903
            ],
            [
                9903,
                9913
            ],
            [
                9919,
                9953
            ],
            [
                10007,
                10030
            ],
            [
                10003,
                10006
            ],
            [
                10101,
                10103
            ],
            [
                10103,
                10116
            ],
            [
                10116,
                10129
            ],
            [
                10143,
                10174
            ],
            [
                10188,
                10218
            ],
            [
                10225,
                10229
            ],
            [
                10242,
                10250
            ],
            [
                10252,
                10255
            ],
            [
                10267,
                10278
            ],
            [
                10280,
                10335
            ],
            [
                10175,
                10178
            ],
            [
                10352,
                10355
            ],
            [
                10360,
                10382
            ],
            [
                10382,
                10405
            ],
            [
                10499,
                10501
            ],
            [
                10501,
                10516
            ],
            [
                10530,
                10555
            ],
            [
                10555,
                10560
            ],
            [
                10571,
                10620
            ],
            [
                10645,
                10647
            ],
            [
                10647,
                10678
            ],
            [
                10683,
                10690
            ],
            [
                10699,
                10709
            ],
            [
                10725,
                10768
            ],
            [
                10774,
                10785
            ],
            [
                10819,
                10867
            ],
            [
                10903,
                10905
            ],
            [
                10905,
                10908
            ],
            [
                10930,
                11050
            ],
            [
                11050,
                11053
            ],
            [
                11059,
                11100
            ],
            [
                11108,
                11118
            ],
            [
                11128,
                11150
            ],
            [
                11155,
                11162
            ],
            [
                11162,
                11269
            ],
            [
                11284,
                11286
            ],
            [
                11286,
                11413
            ],
            [
                11419,
                11478
            ],
            [
                11496,
                11506
            ],
            [
                11642,
                11649
            ],
            [
                11654,
                11669
            ],
            [
                11680,
                11716
            ],
            [
                11635,
                11637
            ],
            [
                11730,
                11736
            ],
            [
                11756,
                11760
            ],
            [
                11482,
                11494
            ],
            [
                11774,
                11776
            ],
            [
                11776,
                11790
            ],
            [
                11792,
                11859
            ],
            [
                11930,
                11933
            ],
            [
                11876,
                11881
            ],
            [
                11941,
                11949
            ],
            [
                11970,
                12030
            ],
            [
                12064,
                12068
            ],
            [
                12069,
                12092
            ],
            [
                12109,
                12130
            ],
            [
                12131,
                12137
            ],
            [
                12154,
                12156
            ],
            [
                12156,
                12176
            ],
            [
                12210,
                12244
            ],
            [
                12244,
                12250
            ],
            [
                12265,
                12397
            ],
            [
                12406,
                12450
            ],
            [
                12457,
                12459
            ],
            [
                12459,
                12471
            ],
            [
                12471,
                12476
            ],
            [
                12476,
                12502
            ],
            [
                12502,
                12591
            ],
            [
                12591,
                12655
            ],
            [
                12663,
                12669
            ],
            [
                12688,
                12728
            ],
            [
                12739,
                12752
            ],
            [
                12775,
                12782
            ],
            [
                12784,
                12817
            ],
            [
                12977,
                13013
            ],
            [
                13084,
                13099
            ],
            [
                13136,
                13186
            ],
            [
                13186,
                13193
            ],
            [
                13199,
                13205
            ],
            [
                13213,
                13243
            ],
            [
                13350,
                13353
            ],
            [
                13283,
                13296
            ],
            [
                13245,
                13248
            ],
            [
                13405,
                13438
            ],
            [
                13372,
                13375
            ],
            [
                13443,
                13478
            ],
            [
                13504,
                13513
            ],
            [
                13522,
                13533
            ],
            [
                13560,
                13562
            ],
            [
                13611,
                13631
            ],
            [
                13566,
                13575
            ],
            [
                13576,
                13579
            ],
            [
                13631,
                13638
            ],
            [
                13643,
                13688
            ],
            [
                13717,
                13726
            ],
            [
                13788,
                13809
            ],
            [
                13726,
                13743
            ],
            [
                13755,
                13768
            ],
            [
                13747,
                13754
            ],
            [
                13773,
                13774
            ],
            [
                13850,
                13852
            ],
            [
                13818,
                13828
            ],
            [
                13775,
                13777
            ],
            [
                13844,
                13845
            ],
            [
                13870,
                13876
            ],
            [
                13876,
                13898
            ],
            [
                13899,
                13902
            ],
            [
                13912,
                13919
            ],
            [
                13941,
                13943
            ],
            [
                13943,
                13949
            ],
            [
                13959,
                13965
            ],
            [
                13974,
                14022
            ],
            [
                14036,
                14048
            ],
            [
                14048,
                14086
            ],
            [
                14146,
                14168
            ],
            [
                14175,
                14201
            ],
            [
                14216,
                14221
            ],
            [
                14227,
                14257
            ],
            [
                14264,
                14265
            ],
            [
                14463,
                14485
            ],
            [
                14531,
                14620
            ],
            [
                14634,
                14638
            ],
            [
                14689,
                14691
            ],
            [
                14691,
                14701
            ],
            [
                14711,
                14807
            ],
            [
                14820,
                14968
            ],
            [
                14973,
                14985
            ],
            [
                14994,
                15030
            ],
            [
                15031,
                15080
            ],
            [
                15091,
                15099
            ],
            [
                15247,
                15252
            ],
            [
                15258,
                15313
            ],
            [
                15326,
                15360
            ],
            [
                15360,
                15414
            ],
            [
                15414,
                15464
            ],
            [
                15511,
                15518
            ],
            [
                15527,
                15534
            ],
            [
                15553,
                15570
            ],
            [
                15535,
                15538
            ],
            [
                15571,
                15587
            ],
            [
                15587,
                15609
            ],
            [
                15668,
                15670
            ],
            [
                15670,
                15722
            ],
            [
                15732,
                15756
            ],
            [
                15782,
                15797
            ],
            [
                15812,
                15841
            ],
            [
                15933,
                15936
            ],
            [
                15959,
                16029
            ],
            [
                16062,
                16063
            ],
            [
                16129,
                16156
            ],
            [
                16159,
                16215
            ],
            [
                16215,
                16267
            ],
            [
                16273,
                16275
            ],
            [
                16284,
                16291
            ],
            [
                16297,
                16299
            ],
            [
                16299,
                16318
            ],
            [
                16491,
                16494
            ],
            [
                16325,
                16485
            ],
            [
                16575,
                16576
            ],
            [
                16756,
                16797
            ],
            [
                16803,
                16812
            ],
            [
                16812,
                16887
            ],
            [
                16888,
                16891
            ],
            [
                16915,
                16953
            ],
            [
                16964,
                16968
            ],
            [
                16954,
                16960
            ],
            [
                16976,
                16994
            ],
            [
                17000,
                17073
            ],
            [
                17073,
                17142
            ],
            [
                17239,
                17284
            ],
            [
                17284,
                17411
            ],
            [
                17411,
                17467
            ],
            [
                17480,
                17494
            ],
            [
                17520,
                17528
            ],
            [
                17651,
                17657
            ],
            [
                17528,
                17531
            ],
            [
                17611,
                17612
            ],
            [
                17559,
                17577
            ],
            [
                17595,
                17599
            ],
            [
                17707,
                17709
            ],
            [
                17709,
                17726
            ],
            [
                17801,
                17857
            ],
            [
                17933,
                17935
            ],
            [
                17904,
                17932
            ],
            [
                17936,
                17981
            ],
            [
                17981,
                18064
            ],
            [
                18067,
                18078
            ],
            [
                18094,
                18100
            ],
            [
                18126,
                18139
            ],
            [
                18119,
                18125
            ],
            [
                18139,
                18141
            ],
            [
                18141,
                18153
            ],
            [
                18154,
                18194
            ],
            [
                18206,
                18208
            ],
            [
                18208,
                18236
            ],
            [
                18253,
                18255
            ],
            [
                18256,
                18289
            ],
            [
                18289,
                18302
            ],
            [
                18324,
                18351
            ],
            [
                18351,
                18390
            ],
            [
                18412,
                18434
            ],
            [
                18434,
                18477
            ],
            [
                18478,
                18481
            ],
            [
                18494,
                18545
            ],
            [
                18624,
                18631
            ],
            [
                18632,
                18650
            ],
            [
                18683,
                18712
            ]
        ],
        "row_chars": [
            [
                0,
                371
            ],
            [
                371,
                565
            ],
            [
                565,
                680
            ],
            [
                680,
                893
            ],
            [
                893,
                1164
            ],
            [
                1164,
                1282
            ],
            [
                1282,
                1437
            ],
            [
                1437,
                1529
            ],
            [
                1529,
                1676
            ],
            [
                1676,
                2041
            ],
            [
                2041,
                2079
            ],
            [
                2079,
                2094
            ],
            [
                2094,
                2139
            ],
            [
                2139,
                2187
            ],
            [
                2187,
                2470
            ],
            [
                2470,
                2628
            ],
            [
                2628,
                2791
            ],
            [
                2791,
                2950
            ],
            [
                2950,
                3117
            ],
            [
                3117,
                3396
            ],
            [
                3396,
                3630
            ],
            [
                3630,
                3722
            ],
            [
                3722,
                3802
            ],
            [
                3802,
                3878
            ],
            [
                3878,
                4086
            ],
            [
                4086,
                4110
            ],
            [
                4110,
                4322
            ],
            [
                4322,
                4425
            ],
            [
                4425,
                4468
            ],
            [
                4468,
                4716
            ],
            [
                4716,
                4835
            ],
            [
                4835,
                4855
            ],
            [
                4855,
                4916
            ],
            [
                4916,
                5234
            ],
            [
                5234,
                5355
            ],
            [
                5355,
                5724
            ],
            [
                5724,
                5821
            ],
            [
                5821,
                5964
            ],
            [
                5964,
                6116
            ],
            [
                6116,
                6164
            ],
            [
                6164,
                6527
            ],
            [
                6527,
                6676
            ],
            [
                6676,
                6765
            ],
            [
                6765,
                7166
            ],
            [
                7166,
                7373
            ],
            [
                7373,
                7885
            ],
            [
                7885,
                8142
            ],
            [
                8142,
                8416
            ],
            [
                8416,
                8536
            ],
            [
                8536,
                8805
            ],
            [
                8805,
                8912
            ],
            [
                8912,
                9019
            ],
            [
                9019,
                9157
            ],
            [
                9157,
                9257
            ],
            [
                9257,
                9512
            ],
            [
                9512,
                9880
            ],
            [
                9880,
                9903
            ],
            [
                9903,
                9953
            ],
            [
                9953,
                10103
            ],
            [
                10103,
                10116
            ],
            [
                10116,
                10175
            ],
            [
                10175,
                10382
            ],
            [
                10382,
                10501
            ],
            [
                10501,
                10555
            ],
            [
                10555,
                10647
            ],
            [
                10647,
                10905
            ],
            [
                10905,
                11050
            ],
            [
                11050,
                11162
            ],
            [
                11162,
                11286
            ],
            [
                11286,
                11478
            ],
            [
                11478,
                11776
            ],
            [
                11776,
                12069
            ],
            [
                12069,
                12156
            ],
            [
                12156,
                12244
            ],
            [
                12244,
                12459
            ],
            [
                12459,
                12471
            ],
            [
                12471,
                12476
            ],
            [
                12476,
                12502
            ],
            [
                12502,
                12591
            ],
            [
                12591,
                12817
            ],
            [
                12817,
                12943
            ],
            [
                12943,
                13186
            ],
            [
                13186,
                13562
            ],
            [
                13562,
                13688
            ],
            [
                13688,
                13876
            ],
            [
                13876,
                13943
            ],
            [
                13943,
                14048
            ],
            [
                14048,
                14266
            ],
            [
                14266,
                14463
            ],
            [
                14463,
                14691
            ],
            [
                14691,
                15031
            ],
            [
                15031,
                15360
            ],
            [
                15360,
                15414
            ],
            [
                15414,
                15518
            ],
            [
                15518,
                15587
            ],
            [
                15587,
                15670
            ],
            [
                15670,
                16064
            ],
            [
                16064,
                16129
            ],
            [
                16129,
                16215
            ],
            [
                16215,
                16299
            ],
            [
                16299,
                16577
            ],
            [
                16577,
                16756
            ],
            [
                16756,
                16812
            ],
            [
                16812,
                17073
            ],
            [
                17073,
                17142
            ],
            [
                17142,
                17187
            ],
            [
                17187,
                17239
            ],
            [
                17239,
                17284
            ],
            [
                17284,
                17411
            ],
            [
                17411,
                17528
            ],
            [
                17528,
                17709
            ],
            [
                17709,
                17857
            ],
            [
                17857,
                17981
            ],
            [
                17981,
                18141
            ],
            [
                18141,
                18208
            ],
            [
                18208,
                18255
            ],
            [
                18255,
                18289
            ],
            [
                18289,
                18351
            ],
            [
                18351,
                18434
            ],
            [
                18434,
                18478
            ],
            [
                18478,
                18545
            ],
            [
                18545,
                18712
            ]
        ]
    },
    "abridged": {
        "text": "On arriving in London, George drove to a fine hotel in Cavendish Square, where a suite of splendid rooms, and a magnificently furnished table surrounded by half-a-dozen silent waiters, were ready to receive them. He welcomed Jos and Dobbin in; and Amelia, for the first time, exceedingly shyly, presided at what George called her own table.\nGeorge pooh-poohed the wine and bullied the waiters royally, and Jos gobbled the turtle with satisfaction. The splendour and expense of the rooms alarmed Mr. Dobbin, who remonstrated after dinner; but in vain.\n\"I've been accustomed to travel like a gentleman,\" George said, \"and, damme, my wife shall travel like a lady. She shall want for nothing.\" Dobbin did not try and convince him that Amelia's happiness was not centred in turtle-soup.\nAfter dinner, Amelia timidly expressed a wish to go and see her mamma at Fulham: which permission George granted with some grumbling. And she tripped away to her enormous bedroom, with its funereal bed, and put on her bonnet and shawl, while George stayed drinking claret in the dining-room.\n\"Aren't you coming with me, dearest?\" she asked him. No; the \"dearest\" had \"business\" that night. So Amelia made George a little disappointed curtsey, and went sadly down the great staircase. Captain Dobbin went after her, handed her into the coach, and saw it drive away.\nThen Dobbin walked home, thinking that it would be delightful to be in that hackney-coach with Mrs. Osborne. But George went off to the play, to see Mr. Kean perform in Shylock.\nMrs. Sedley, you may be sure, clasped her daughter with eager affection, running out of the door to welcome the weeping young bride. The Irish servant-lass rushed up from the kitchen and smiled a \"God bless you.\" Amelia could hardly walk up the steps into the parlour.\nHow the floodgates were opened, and mother and daughter wept, embracing each other, may readily be imagined. When don't ladies weep? Let us leave Amelia and her mamma whispering and laughing and crying in the parlour. Old Mr. Sedley did. He had not flown out to meet his daughter, though he kissed her very warmly when she entered; and after sitting with the mother and daughter for a short time, he wisely left them alone.\nOnly nine days had passed since Amelia had left that little cottage - yet how far off that time seemed. She could look back to that past life, and contemplate the unmarried girl absorbed in love, receiving parental affection indifferently, as if it were her due.\nThe thought touched her with shame. Was her prize gained - and the winner still doubtful and unsatisfied? When his hero and heroine marry, the novelist generally drops the curtain, as if the doubts and struggles of life ended: as if wife and husband had nothing to do but to link each other's arms and wander happily down towards old age. But our little Amelia was just on the bank of her new country, and was already looking anxiously back towards the sad friendly figures waving farewell from the other distant shore.\nIn honour of her arrival, her mother had planned all sorts of festive entertainment, and after the first joyful talk, left her daughter for a while, and dived down to the kitchen-parlour (occupied by Mr. and Mrs. Clapp, and in the evening, by the Irish servant), to prepare a magnificent tea. All people have their ways of expressing kindness, and Mrs. Sedley thought that a muffin and orange marmalade in a little cut-glass saucer would be peculiarly agreeable to Amelia.\nMeanwhile Amelia walked upstairs and found herself in her bedroom, and in that very chair in which she had passed so many bitter hours. She sank back in its arms as if it were an old friend; and fell to thinking over the past. Already to be looking sadly back: always to be pining and in doubt; this was the lot of our poor little creature wandering in the great struggling crowds of Vanity Fair.\nShe recalled her image of George before marriage. Did she admit to herself how different the real man was from that superb young hero whom she had worshipped? It requires many, many years - and a man must be very bad indeed - before a woman's vanity will allow such a confession. Then Rebecca's twinkling green eyes and baleful smile lighted upon her, and filled her with dismay. So she sat indulging in her usual selfish, listless brooding, just as she had before George renewed his offer of marriage.\nShe looked at the little white bed, thinking she would like to sleep in it that night, and wake with her mother smiling over her; then she thought with terror of the great funereal pavilion in the vast and dingy bedroom at Cavendish Square. Dear little white bed! how many a night had she wept on its pillow! Were not all her wishes now fulfilled? Kind mother! how patiently she had watched round that bed!\nAmelia knelt down by the bedside; and this timorous but loving soul sought for consolation, where as yet, it must be owned, she had seldom looked for it. Love had been her faith until now.\nHave we a right to overhear her prayers? These are secrets, and out of the domain of Vanity Fair.\nBut this may be said, that when tea was announced, Amelia came downstairs a great deal more cheerful; she did not think about George's coldness, or Rebecca's eyes. She kissed her father and mother, and talked to the old gentleman, and made him more merry than he had been for many a day. She sat down at the piano which Dobbin had bought, and sang her father's favourite songs. She pronounced the tea to be excellent, and praised the exquisite taste in which the marmalade was arranged. And in determining to make everybody else happy, she found herself so; and was sound asleep in the great funereal pavilion, and woke up with a smile when George arrived from the theatre.\nGeorge had written to his father's lawyers, signifying his royal pleasure that he should visit them the next day. His hotel bill and losses at billiards and cards to Captain Crawley had almost drained his purse, and he needed to infringe upon the two thousand pounds which the attorneys held for him.\nHe had a perfect belief that his father would soon relent. How could any parent hold out long against such a paragon as he was? If his personal merits did not succeed in mollifying his father, George determined that he would distinguish himself so prodigiously in the coming campaign that the old gentleman must give in. And if not? Bah! the world was before him. His luck might change at cards, and there was a deal of spending in two thousand pounds.\nSo he sent off Amelia once more in a carriage to her mamma, with orders to the two ladies to purchase everything needful for a lady of fashion who was going on a foreign tour. Bustling about from milliner to linen-draper, Mrs. Sedley was happy for the first time since their misfortunes. Nor was Amelia above the pleasure of shopping for pretty things; and obedient to her husband's orders, she purchased a quantity of lady's gear with taste and discernment.\nShe was not much alarmed about the coming war; Bonaparte was to be crushed almost without a struggle. Boats sailed every day to Brussels and Ghent, filled with men and ladies of fashion, as if they were going on a tour. The newspapers laughed at the Corsican upstart. Such a wretch withstand the armies of Europe and the genius of Wellington! Amelia held him in utter contempt; for she took her opinions from the people who surrounded her, being too humble-minded to think for herself.\nGeorge meanwhile, with his swaggering martial air, made for Bedford Row, and stalked into the attorney's offices like a lord. He ordered a clerk to inform Mr. Higgs that Captain Osborne was waiting, in a fierce and patronizing way, as if the attorney, who had thrice his brains, fifty times his money, and a thousand times his experience, was a wretched underling who should instantly leave his business to attend on the Captain's pleasure.\nHe did not see the sneer of contempt which passed around the room as he sat there tapping his boot with his cane, and thinking what miserable poor devils these were. The miserable poor devils knew all about his affairs. They talked about them over their pints of beer at night. What do attorneys' clerks not know in London! Nothing is hidden from them.\nPerhaps George expected, when he entered Mr. Higgs's office, to find that gentleman bore some message of conciliation from his father; but he was met by a chilling coolness and indifference on the attorney's part.\n\"Pray, sit down, sir,\" said Mr. Higgs, \"and I will attend to your little affair in a moment. Mr. Poe, get the release papers, if you please\"; and he kept writing.\nPoe having produced the papers, his chief calculated the amount of two thousand pounds stock at the rate of the day; and asked Captain Osborne whether he would take the sum in a cheque.\n\"Give me a cheque, sir,\" said the Captain surlily. \"Damn the shillings and halfpence, sir,\" he added, as the lawyer was making it out; and, flattering himself that by this magnanimous stroke he had put the old man to the blush, he stalked out of the office with the paper in his pocket.\n\"That chap will be in gaol in two years,\" Mr. Higgs said to Mr. Poe.\n\"He's going it pretty fast,\" said the clerk. \"He's only married a week, and I saw him and some other military chaps handing Mrs. Highflyer to her carriage after the play.\" And then another case was called, and Mr. George Osborne was dismissed from their memory.\nGeorge went next to the bank, Hulker and Bullock, to draw out the two thousand pounds. Frederick Bullock happened to be in the banking-room when George entered. He went pale when he saw the Captain, and slunk back guiltily into the inmost parlour. George was too busy gloating over the money (for he had never had such a sum before) to mark the flight of his sister's suitor.\nFred Bullock later told old Osborne of his son's appearance. \"He came in as bold as brass. He has drawn out every shilling. How long will it last such a chap as that?\" Old Osborne swore with a great oath that he did not care how soon he spent it. Fred dined every day in Russell Square now.\nBut George was highly pleased with his day's business. He paid for Amelia's purchases with the splendour of a lord.",
        "paragraph_chars": [
            [
                0,
                341
            ],
            [
                341,
                551
            ],
            [
                551,
                783
            ],
            [
                783,
                1075
            ],
            [
                1075,
                1348
            ],
            [
                1348,
                1526
            ],
            [
                1526,
                1795
            ],
            [
                1795,
                2219
            ],
            [
                2219,
                2482
            ],
            [
                2482,
                3002
            ],
            [
                3002,
                3475
            ],
            [
                3475,
                3872
            ],
            [
                3872,
                4375
            ],
            [
                4375,
                4782
            ],
            [
                4782,
                4971
            ],
            [
                4971,
                5069
            ],
            [
                5069,
                5743
            ],
            [
                5743,
                6044
            ],
            [
                6044,
                6497
            ],
            [
                6497,
                6956
            ],
            [
                6956,
                7442
            ],
            [
                7442,
                7883
            ],
            [
                7883,
                8236
            ],
            [
                8236,
                8450
            ],
            [
                8450,
                8613
            ],
            [
                8613,
                8799
            ],
            [
                8799,
                9086
            ],
            [
                9086,
                9155
            ],
            [
                9155,
                9417
            ],
            [
                9417,
                9793
            ],
            [
                9793,
                10084
            ],
            [
                10084,
                10199
            ]
        ],
        "segment_chars": [
            [
                0,
                213
            ],
            [
                213,
                341
            ],
            [
                341,
                448
            ],
            [
                448,
                551
            ],
            [
                551,
                662
            ],
            [
                662,
                691
            ],
            [
                691,
                783
            ],
            [
                783,
                917
            ],
            [
                917,
                1075
            ],
            [
                1075,
                1113
            ],
            [
                1113,
                1128
            ],
            [
                1128,
                1173
            ],
            [
                1173,
                1267
            ],
            [
                1267,
                1348
            ],
            [
                1348,
                1457
            ],
            [
                1457,
                1526
            ],
            [
                1526,
                1659
            ],
            [
                1659,
                1739
            ],
            [
                1739,
                1795
            ],
            [
                1795,
                1904
            ],
            [
                1904,
                1928
            ],
            [
                1928,
                2013
            ],
            [
                2013,
                2033
            ],
            [
                2033,
                2219
            ],
            [
                2219,
                2323
            ],
            [
                2323,
                2482
            ],
            [
                2482,
                2518
            ],
            [
                2518,
                2588
            ],
            [
                2588,
                2821
            ],
            [
                2821,
                3002
            ],
            [
                3002,
                3295
            ],
            [
                3295,
                3475
            ],
            [
                3475,
                3611
            ],
            [
                3611,
                3702
            ],
            [
                3702,
                3872
            ],
            [
                3872,
                3922
            ],
            [
                3922,
                4031
            ],
            [
                4031,
                4152
            ],
            [
                4152,
                4252
            ],
            [
                4252,
                4375
            ],
            [
                4375,
                4616
            ],
            [
                4616,
                4639
            ],
            [
                4639,
                4684
            ],
            [
                4684,
                4723
            ],
            [
                4723,
                4736
            ],
            [
                4736,
                4782
            ],
            [
                4782,
                4936
            ],
            [
                4936,
                4971
            ],
            [
                4971,
                5012
            ],
            [
                5012,
                5069
            ],
            [
                5069,
                5233
            ],
            [
                5233,
                5357
            ],
            [
                5357,
                5447
            ],
            [
                5447,
                5556
            ],
            [
                5556,
                5743
            ],
            [
                5743,
                5857
            ],
            [
                5857,
                6044
            ],
            [
                6044,
                6103
            ],
            [
                6103,
                6172
            ],
            [
                6172,
                6365
            ],
            [
                6365,
                6377
            ],
            [
                6377,
                6382
            ],
            [
                6382,
                6408
            ],
            [
                6408,
                6497
            ],
            [
                6497,
                6673
            ],
            [
                6673,
                6785
            ],
            [
                6785,
                6956
            ],
            [
                6956,
                7058
            ],
            [
                7058,
                7176
            ],
            [
                7176,
                7224
            ],
            [
                7224,
                7299
            ],
            [
                7299,
                7442
            ],
            [
                7442,
                7568
            ],
            [
                7568,
                7883
            ],
            [
                7883,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8161
            ],
            [
                8161,
                8207
            ],
            [
                8207,
                8236
            ],
            [
                8236,
                8450
            ],
            [
                8450,
                8543
            ],
            [
                8543,
                8613
            ],
            [
                8613,
                8799
            ],
            [
                8799,
                8850
            ],
            [
                8850,
                9086
            ],
            [
                9086,
                9155
            ],
            [
                9155,
                9200
            ],
            [
                9200,
                9327
            ],
            [
                9327,
                9417
            ],
            [
                9417,
                9504
            ],
            [
                9504,
                9578
            ],
            [
                9578,
                9665
            ],
            [
                9665,
                9793
            ],
            [
                9793,
                9854
            ],
            [
                9854,
                9884
            ],
            [
                9884,
                9917
            ],
            [
                9917,
                9961
            ],
            [
                9961,
                10040
            ],
            [
                10040,
                10084
            ],
            [
                10084,
                10139
            ],
            [
                10139,
                10199
            ]
        ],
        "overlap_chars": [
            [
                0,
                2
            ],
            [
                12,
                14
            ],
            [
                21,
                22
            ],
            [
                23,
                29
            ],
            [
                30,
                35
            ],
            [
                36,
                111
            ],
            [
                112,
                135
            ],
            [
                136,
                141
            ],
            [
                142,
                155
            ],
            [
                156,
                161
            ],
            [
                161,
                162
            ],
            [
                163,
                168
            ],
            [
                169,
                184
            ],
            [
                190,
                206
            ],
            [
                211,
                213
            ],
            [
                225,
                239
            ],
            [
                242,
                275
            ],
            [
                288,
                291
            ],
            [
                291,
                293
            ],
            [
                293,
                341
            ],
            [
                341,
                433
            ],
            [
                434,
                448
            ],
            [
                448,
                461
            ],
            [
                462,
                465
            ],
            [
                474,
                480
            ],
            [
                487,
                536
            ],
            [
                538,
                549
            ],
            [
                549,
                550
            ],
            [
                551,
                556
            ],
            [
                557,
                662
            ],
            [
                662,
                688
            ],
            [
                694,
                697
            ],
            [
                698,
                701
            ],
            [
                706,
                783
            ],
            [
                783,
                852
            ],
            [
                853,
                895
            ],
            [
                896,
                917
            ],
            [
                917,
                962
            ],
            [
                963,
                967
            ],
            [
                972,
                985
            ],
            [
                986,
                1000
            ],
            [
                1001,
                1017
            ],
            [
                1017,
                1018
            ],
            [
                1025,
                1031
            ],
            [
                1039,
                1054
            ],
            [
                1055,
                1057
            ],
            [
                1058,
                1073
            ],
            [
                1073,
                1074
            ],
            [
                1075,
                1076
            ],
            [
                1080,
                1113
            ],
            [
                1113,
                1128
            ],
            [
                1128,
                1173
            ],
            [
                1176,
                1224
            ],
            [
                1224,
                1265
            ],
            [
                1265,
                1266
            ],
            [
                1267,
                1281
            ],
            [
                1287,
                1292
            ],
            [
                1296,
                1297
            ],
            [
                1298,
                1317
            ],
            [
                1318,
                1323
            ],
            [
                1323,
                1346
            ],
            [
                1356,
                1371
            ],
            [
                1371,
                1372
            ],
            [
                1373,
                1381
            ],
            [
                1382,
                1437
            ],
            [
                1438,
                1457
            ],
            [
                1461,
                1467
            ],
            [
                1468,
                1479
            ],
            [
                1480,
                1525
            ],
            [
                1526,
                1576
            ],
            [
                1577,
                1581
            ],
            [
                1582,
                1587
            ],
            [
                1588,
                1622
            ],
            [
                1623,
                1645
            ],
            [
                1646,
                1659
            ],
            [
                1659,
                1739
            ],
            [
                1739,
                1763
            ],
            [
                1764,
                1795
            ],
            [
                1795,
                1856
            ],
            [
                1857,
                1877
            ],
            [
                1877,
                1902
            ],
            [
                1902,
                1904
            ],
            [
                1904,
                1928
            ],
            [
                1928,
                1934
            ],
            [
                1941,
                1976
            ],
            [
                1977,
                2011
            ],
            [
                2011,
                2013
            ],
            [
                2013,
                2033
            ],
            [
                2033,
                2125
            ],
            [
                2127,
                2194
            ],
            [
                2195,
                2206
            ],
            [
                2217,
                2219
            ],
            [
                2224,
                2233
            ],
            [
                2234,
                2237
            ],
            [
                2245,
                2286
            ],
            [
                2289,
                2304
            ],
            [
                2310,
                2321
            ],
            [
                2321,
                2323
            ],
            [
                2323,
                2345
            ],
            [
                2360,
                2377
            ],
            [
                2378,
                2381
            ],
            [
                2382,
                2408
            ],
            [
                2409,
                2413
            ],
            [
                2413,
                2443
            ],
            [
                2444,
                2458
            ],
            [
                2459,
                2480
            ],
            [
                2480,
                2481
            ],
            [
                2482,
                2485
            ],
            [
                2494,
                2516
            ],
            [
                2516,
                2518
            ],
            [
                2518,
                2521
            ],
            [
                2526,
                2538
            ],
            [
                2541,
                2588
            ],
            [
                2593,
                2613
            ],
            [
                2619,
                2672
            ],
            [
                2673,
                2714
            ],
            [
                2715,
                2779
            ],
            [
                2780,
                2790
            ],
            [
                2804,
                2819
            ],
            [
                2819,
                2821
            ],
            [
                2821,
                2971
            ],
            [
                2972,
                3002
            ],
            [
                3002,
                3014
            ],
            [
                3015,
                3018
            ],
            [
                3019,
                3038
            ],
            [
                3061,
                3063
            ],
            [
                3064,
                3106
            ],
            [
                3114,
                3119
            ],
            [
                3125,
                3128
            ],
            [
                3138,
                3172
            ],
            [
                3173,
                3241
            ],
            [
                3242,
                3244
            ],
            [
                3245,
                3264
            ],
            [
                3265,
                3275
            ],
            [
                3276,
                3289
            ],
            [
                3290,
                3295
            ],
            [
                3295,
                3349
            ],
            [
                3350,
                3361
            ],
            [
                3370,
                3387
            ],
            [
                3388,
                3404
            ],
            [
                3405,
                3463
            ],
            [
                3464,
                3473
            ],
            [
                3473,
                3475
            ],
            [
                3485,
                3491
            ],
            [
                3492,
                3525
            ],
            [
                3526,
                3528
            ],
            [
                3529,
                3532
            ],
            [
                3540,
                3611
            ],
            [
                3611,
                3700
            ],
            [
                3700,
                3702
            ],
            [
                3702,
                3729
            ],
            [
                3730,
                3755
            ],
            [
                3756,
                3759
            ],
            [
                3763,
                3768
            ],
            [
                3768,
                3769
            ],
            [
                3775,
                3814
            ],
            [
                3825,
                3872
            ],
            [
                3872,
                3875
            ],
            [
                3876,
                3884
            ],
            [
                3889,
                3904
            ],
            [
                3905,
                3922
            ],
            [
                3922,
                3929
            ],
            [
                3936,
                4031
            ],
            [
                4031,
                4059
            ],
            [
                4062,
                4095
            ],
            [
                4098,
                4114
            ],
            [
                4115,
                4126
            ],
            [
                4133,
                4152
            ],
            [
                4152,
                4252
            ],
            [
                4252,
                4258
            ],
            [
                4263,
                4285
            ],
            [
                4286,
                4293
            ],
            [
                4293,
                4294
            ],
            [
                4295,
                4303
            ],
            [
                4304,
                4313
            ],
            [
                4322,
                4325
            ],
            [
                4326,
                4329
            ],
            [
                4337,
                4375
            ],
            [
                4375,
                4410
            ],
            [
                4420,
                4470
            ],
            [
                4471,
                4503
            ],
            [
                4505,
                4555
            ],
            [
                4556,
                4586
            ],
            [
                4587,
                4594
            ],
            [
                4595,
                4597
            ],
            [
                4598,
                4616
            ],
            [
                4616,
                4639
            ],
            [
                4639,
                4649
            ],
            [
                4650,
                4684
            ],
            [
                4684,
                4707
            ],
            [
                4708,
                4711
            ],
            [
                4721,
                4723
            ],
            [
                4723,
                4736
            ],
            [
                4736,
                4749
            ],
            [
                4750,
                4781
            ],
            [
                4789,
                4819
            ],
            [
                4820,
                4824
            ],
            [
                4825,
                4833
            ],
            [
                4834,
                4837
            ],
            [
                4838,
                4849
            ],
            [
                4850,
                4905
            ],
            [
                4906,
                4909
            ],
            [
                4910,
                4913
            ],
            [
                4914,
                4936
            ],
            [
                4936,
                4959
            ],
            [
                4969,
                4971
            ],
            [
                4971,
                4986
            ],
            [
                4987,
                5012
            ],
            [
                5012,
                5017
            ],
            [
                5018,
                5067
            ],
            [
                5067,
                5069
            ],
            [
                5069,
                5100
            ],
            [
                5101,
                5108
            ],
            [
                5109,
                5119
            ],
            [
                5127,
                5170
            ],
            [
                5171,
                5182
            ],
            [
                5183,
                5231
            ],
            [
                5231,
                5233
            ],
            [
                5233,
                5236
            ],
            [
                5237,
                5357
            ],
            [
                5357,
                5360
            ],
            [
                5365,
                5406
            ],
            [
                5406,
                5416
            ],
            [
                5417,
                5439
            ],
            [
                5440,
                5447
            ],
            [
                5447,
                5554
            ],
            [
                5554,
                5556
            ],
            [
                5556,
                5683
            ],
            [
                5684,
                5743
            ],
            [
                5743,
                5753
            ],
            [
                5754,
                5761
            ],
            [
                5762,
                5777
            ],
            [
                5785,
                5821
            ],
            [
                5822,
                5824
            ],
            [
                5825,
                5831
            ],
            [
                5838,
                5842
            ],
            [
                5843,
                5855
            ],
            [
                5855,
                5857
            ],
            [
                5857,
                5871
            ],
            [
                5876,
                5943
            ],
            [
                5944,
                5947
            ],
            [
                5948,
                5953
            ],
            [
                5953,
                5961
            ],
            [
                5969,
                6029
            ],
            [
                6039,
                6043
            ],
            [
                6044,
                6067
            ],
            [
                6068,
                6089
            ],
            [
                6095,
                6101
            ],
            [
                6101,
                6103
            ],
            [
                6103,
                6123
            ],
            [
                6138,
                6172
            ],
            [
                6172,
                6178
            ],
            [
                6179,
                6311
            ],
            [
                6319,
                6363
            ],
            [
                6363,
                6365
            ],
            [
                6365,
                6377
            ],
            [
                6377,
                6382
            ],
            [
                6382,
                6408
            ],
            [
                6408,
                6497
            ],
            [
                6497,
                6561
            ],
            [
                6562,
                6568
            ],
            [
                6569,
                6609
            ],
            [
                6618,
                6631
            ],
            [
                6632,
                6639
            ],
            [
                6640,
                6673
            ],
            [
                6682,
                6718
            ],
            [
                6719,
                6734
            ],
            [
                6735,
                6785
            ],
            [
                6785,
                6792
            ],
            [
                6793,
                6799
            ],
            [
                6800,
                6830
            ],
            [
                6831,
                6834
            ],
            [
                6835,
                6848
            ],
            [
                6850,
                6853
            ],
            [
                6854,
                6887
            ],
            [
                6888,
                6891
            ],
            [
                6892,
                6927
            ],
            [
                6933,
                6942
            ],
            [
                6943,
                6954
            ],
            [
                6954,
                6956
            ],
            [
                6960,
                6980
            ],
            [
                6981,
                6990
            ],
            [
                6998,
                7001
            ],
            [
                7001,
                7008
            ],
            [
                7013,
                7058
            ],
            [
                7071,
                7080
            ],
            [
                7081,
                7102
            ],
            [
                7102,
                7119
            ],
            [
                7120,
                7133
            ],
            [
                7134,
                7141
            ],
            [
                7141,
                7142
            ],
            [
                7143,
                7145
            ],
            [
                7154,
                7164
            ],
            [
                7165,
                7167
            ],
            [
                7168,
                7169
            ],
            [
                7170,
                7176
            ],
            [
                7176,
                7198
            ],
            [
                7202,
                7205
            ],
            [
                7215,
                7222
            ],
            [
                7222,
                7224
            ],
            [
                7224,
                7230
            ],
            [
                7231,
                7237
            ],
            [
                7238,
                7286
            ],
            [
                7287,
                7299
            ],
            [
                7299,
                7337
            ],
            [
                7342,
                7364
            ],
            [
                7369,
                7395
            ],
            [
                7396,
                7401
            ],
            [
                7402,
                7432
            ],
            [
                7440,
                7441
            ],
            [
                7442,
                7464
            ],
            [
                7465,
                7554
            ],
            [
                7562,
                7566
            ],
            [
                7566,
                7568
            ],
            [
                7568,
                7578
            ],
            [
                7587,
                7683
            ],
            [
                7684,
                7832
            ],
            [
                7833,
                7845
            ],
            [
                7846,
                7882
            ],
            [
                7883,
                7932
            ],
            [
                7940,
                7948
            ],
            [
                7949,
                7954
            ],
            [
                7959,
                8014
            ],
            [
                8015,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8153
            ],
            [
                8154,
                8161
            ],
            [
                8161,
                8168
            ],
            [
                8169,
                8186
            ],
            [
                8187,
                8190
            ],
            [
                8191,
                8207
            ],
            [
                8207,
                8229
            ],
            [
                8234,
                8236
            ],
            [
                8236,
                8288
            ],
            [
                8295,
                8319
            ],
            [
                8325,
                8340
            ],
            [
                8341,
                8370
            ],
            [
                8371,
                8374
            ],
            [
                8378,
                8448
            ],
            [
                8448,
                8449
            ],
            [
                8450,
                8477
            ],
            [
                8487,
                8543
            ],
            [
                8543,
                8595
            ],
            [
                8596,
                8598
            ],
            [
                8604,
                8611
            ],
            [
                8611,
                8613
            ],
            [
                8613,
                8632
            ],
            [
                8633,
                8636
            ],
            [
                8637,
                8797
            ],
            [
                8797,
                8798
            ],
            [
                8799,
                8840
            ],
            [
                8841,
                8850
            ],
            [
                8850,
                8925
            ],
            [
                8929,
                8932
            ],
            [
                8932,
                8970
            ],
            [
                8971,
                8975
            ],
            [
                8983,
                8989
            ],
            [
                8990,
                9008
            ],
            [
                9013,
                9086
            ],
            [
                9086,
                9155
            ],
            [
                9155,
                9200
            ],
            [
                9200,
                9327
            ],
            [
                9327,
                9383
            ],
            [
                9388,
                9402
            ],
            [
                9409,
                9417
            ],
            [
                9417,
                9423
            ],
            [
                9437,
                9440
            ],
            [
                9445,
                9446
            ],
            [
                9447,
                9465
            ],
            [
                9465,
                9469
            ],
            [
                9502,
                9504
            ],
            [
                9504,
                9521
            ],
            [
                9522,
                9578
            ],
            [
                9578,
                9580
            ],
            [
                9591,
                9619
            ],
            [
                9620,
                9665
            ],
            [
                9665,
                9748
            ],
            [
                9750,
                9761
            ],
            [
                9762,
                9768
            ],
            [
                9769,
                9782
            ],
            [
                9785,
                9791
            ],
            [
                9791,
                9793
            ],
            [
                9793,
                9805
            ],
            [
                9812,
                9852
            ],
            [
                9852,
                9854
            ],
            [
                9854,
                9882
            ],
            [
                9882,
                9884
            ],
            [
                9884,
                9917
            ],
            [
                9917,
                9930
            ],
            [
                9934,
                9961
            ],
            [
                9965,
                10004
            ],
            [
                10018,
                10040
            ],
            [
                10040,
                10083
            ],
            [
                10084,
                10087
            ],
            [
                10088,
                10139
            ],
            [
                10139,
                10146
            ],
            [
                10151,
                10169
            ],
            [
                10170,
                10199
            ]
        ],
        "row_chars": [
            [
                0,
                213
            ],
            [
                213,
                341
            ],
            [
                341,
                448
            ],
            [
                448,
                448
            ],
            [
                448,
                551
            ],
            [
                551,
                662
            ],
            [
                662,
                691
            ],
            [
                691,
                783
            ],
            [
                783,
                917
            ],
            [
                917,
                1075
            ],
            [
                1075,
                1113
            ],
            [
                1113,
                1128
            ],
            [
                1128,
                1173
            ],
            [
                1173,
                1173
            ],
            [
                1173,
                1348
            ],
            [
                1348,
                1348
            ],
            [
                1348,
                1457
            ],
            [
                1457,
                1526
            ],
            [
                1526,
                1526
            ],
            [
                1526,
                1526
            ],
            [
                1526,
                1659
            ],
            [
                1659,
                1659
            ],
            [
                1659,
                1739
            ],
            [
                1739,
                1795
            ],
            [
                1795,
                1904
            ],
            [
                1904,
                1928
            ],
            [
                1928,
                1928
            ],
            [
                1928,
                1928
            ],
            [
                1928,
                1928
            ],
            [
                1928,
                1928
            ],
            [
                1928,
                2013
            ],
            [
                2013,
                2033
            ],
            [
                2033,
                2033
            ],
            [
                2033,
                2219
            ],
            [
                2219,
                2219
            ],
            [
                2219,
                2219
            ],
            [
                2219,
                2219
            ],
            [
                2219,
                2219
            ],
            [
                2219,
                2323
            ],
            [
                2323,
                2323
            ],
            [
                2323,
                2482
            ],
            [
                2482,
                2518
            ],
            [
                2518,
                2588
            ],
            [
                2588,
                2821
            ],
            [
                2821,
                3002
            ],
            [
                3002,
                3295
            ],
            [
                3295,
                3475
            ],
            [
                3475,
                3611
            ],
            [
                3611,
                3702
            ],
            [
                3702,
                3872
            ],
            [
                3872,
                3922
            ],
            [
                3922,
                4031
            ],
            [
                4031,
                4152
            ],
            [
                4152,
                4252
            ],
            [
                4252,
                4375
            ],
            [
                4375,
                4616
            ],
            [
                4616,
                4639
            ],
            [
                4639,
                4684
            ],
            [
                4684,
                4723
            ],
            [
                4723,
                4736
            ],
            [
                4736,
                4782
            ],
            [
                4782,
                4936
            ],
            [
                4936,
                4971
            ],
            [
                4971,
                5012
            ],
            [
                5012,
                5069
            ],
            [
                5069,
                5233
            ],
            [
                5233,
                5357
            ],
            [
                5357,
                5447
            ],
            [
                5447,
                5556
            ],
            [
                5556,
                5743
            ],
            [
                5743,
                5857
            ],
            [
                5857,
                6044
            ],
            [
                6044,
                6103
            ],
            [
                6103,
                6172
            ],
            [
                6172,
                6365
            ],
            [
                6365,
                6377
            ],
            [
                6377,
                6382
            ],
            [
                6382,
                6408
            ],
            [
                6408,
                6497
            ],
            [
                6497,
                6673
            ],
            [
                6673,
                6673
            ],
            [
                6673,
                6785
            ],
            [
                6785,
                6956
            ],
            [
                6956,
                7058
            ],
            [
                7058,
                7176
            ],
            [
                7176,
                7224
            ],
            [
                7224,
                7299
            ],
            [
                7299,
                7442
            ],
            [
                7442,
                7442
            ],
            [
                7442,
                7568
            ],
            [
                7568,
                7883
            ],
            [
                7883,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8161
            ],
            [
                8161,
                8207
            ],
            [
                8207,
                8236
            ],
            [
                8236,
                8450
            ],
            [
                8450,
                8450
            ],
            [
                8450,
                8543
            ],
            [
                8543,
                8613
            ],
            [
                8613,
                8799
            ],
            [
                8799,
                8799
            ],
            [
                8799,
                8850
            ],
            [
                8850,
                9086
            ],
            [
                9086,
                9155
            ],
            [
                9155,
                9155
            ],
            [
                9155,
                9155
            ],
            [
                9155,
                9200
            ],
            [
                9200,
                9327
            ],
            [
                9327,
                9417
            ],
            [
                9417,
                9504
            ],
            [
                9504,
                9578
            ],
            [
                9578,
                9665
            ],
            [
                9665,
                9793
            ],
            [
                9793,
                9854
            ],
            [
                9854,
                9884
            ],
            [
                9884,
                9917
            ],
            [
                9917,
                9961
            ],
            [
                9961,
                10040
            ],
            [
                10040,
                10084
            ],
            [
                10084,
                10139
            ],
            [
                10139,
                10199
            ]
        ]
    }
}