{
    "original": {
        "text": "A VERY stout, puffy man, in buckskins and Hessian boots, with several immense neckcloths that rose almost to his nose, with a red striped waistcoat and an apple green coat with steel buttons almost as large as crown pieces (it was the morning costume of a dandy or blood of those days) was reading the paper by the fire when the two girls entered, and bounced off his arm-chair, and blushed excessively, and hid his entire face almost in his neckcloths at this apparition.\n\"It's only your sister, Joseph,\" said Amelia, laughing and shaking the two fingers which he held out. \"I've come home FOR GOOD, you know; and this is my friend, Miss Sharp, whom you have heard me mention.\"\n\"No, never, upon my word,\" said the head under the neckcloth, shaking very much--\"that is, yes--what abominably cold weather, Miss\"--and herewith he fell to poking the fire with all his might, although it was in the middle of June.\n\"He's very handsome,\" whispered Rebecca to Amelia, rather loud.\n\"Do you think so?\" said the latter. \"I'll tell him.\"\n\"Darling! not for worlds,\" said Miss Sharp, starting back as timid as a fawn. She had previously made a respectful virgin-like curtsey to the gentleman, and her modest eyes gazed so perseveringly on the carpet that it was a wonder how she should have found an opportunity to see him.\n\"Thank you for the beautiful shawls, brother,\" said Amelia to the fire poker. \"Are they not beautiful, Rebecca?\"\n\"O heavenly!\" said Miss Sharp, and her eyes went from the carpet straight to the chandelier.\nJoseph still continued a huge clattering at the poker and tongs, puffing and blowing the while, and turning as red as his yellow face would allow him. \"I can't make you such handsome presents, Joseph,\" continued his sister, \"but while I was at school, I have embroidered for you a very beautiful pair of braces.\"\n\"Good Gad! Amelia,\" cried the brother, in serious alarm, \"what do you mean?\" and plunging with all his might at the bell-rope, that article of furniture came away in his hand, and increased the honest fellow's confusion. \"For heaven's sake see if my buggy's at the door. I CAN'T wait. I must go. D---- that groom of mine. I must go.\"\nAt this minute the father of the family walked in, rattling his seals like a true British merchant. \"What's the matter, Emmy?\" says he.\n\"Joseph wants me to see if his--his buggy is at the door. What is a buggy, Papa?\"\n\"It is a one-horse palanquin,\" said the old gentleman, who was a wag in his way.\nJoseph at this burst out into a wild fit of laughter; in which, encountering the eye of Miss Sharp, he stopped all of a sudden, as if he had been shot.\n\"This young lady is your friend? Miss Sharp, I am very happy to see you. Have you and Emmy been quarrelling already with Joseph, that he wants to be off?\"\n\"I promised Bonamy of our service, sir,\" said Joseph, \"to dine with him.\"\n\"O fie! didn't you tell your mother you would dine here?\"\n\"But in this dress it's impossible.\"\n\"Look at him, isn't he handsome enough to dine anywhere, Miss Sharp?\"\nOn which, of course, Miss Sharp looked at her friend, and they both set off in a fit of laughter, highly agreeable to the old gentleman.\n\"Did you ever see a pair of buckskins like those at Miss Pinkerton's?\" continued he, following up his advantage.\n\"Gracious heavens! Father,\" cried Joseph.\n\"There now, I have hurt his feelings. Mrs. Sedley, my dear, I have hurt your son's feelings. I have alluded to his buckskins. Ask Miss Sharp if I haven't? Come, Joseph, be friends with Miss Sharp, and let us all go to dinner.\"\n\"There's a pillau, Joseph, just as you like it, and Papa has brought home the best turbot in Billingsgate.\"\n\"Come, come, sir, walk downstairs with Miss Sharp, and I will follow with these two young women,\" said the father, and he took an arm of wife and daughter and walked merrily off.\nIf Miss Rebecca Sharp had determined in her heart upon making the conquest of this big beau, I don't think, ladies, we have any right to blame her; for though the task of husband-hunting is generally, and with becoming modesty, entrusted by young persons to their mammas, recollect that Miss Sharp had no kind parent to arrange these delicate matters for her, and that if she did not get a husband for herself, there was no one else in the wide world who would take the trouble off her hands. What causes young people to \"come out,\" but the noble ambition of matrimony? What sends them trooping to watering-places? What keeps them dancing till five o'clock in the morning through a whole mortal season? What causes them to labour at pianoforte sonatas, and to learn four songs from a fashionable master at a guinea a lesson, and to play the harp if they have handsome arms and neat elbows, and to wear Lincoln Green toxophilite hats and feathers, but that they may bring down some \"desirable\" young man with those killing bows and arrows of theirs? What causes respectable parents to take up their carpets, set their houses topsy-turvy, and spend a fifth of their year's income in ball suppers and iced champagne? Is it sheer love of their species, and an unadulterated wish to see young people happy and dancing? Psha! they want to marry their daughters; and, as honest Mrs. Sedley has, in the depths of her kind heart, already arranged a score of little schemes for the settlement of her Amelia, so also had our beloved but unprotected Rebecca determined to do her very best to secure the husband, who was even more necessary for her than for her friend. She had a vivid imagination; she had, besides, read the Arabian Nights and Guthrie's Geography; and it is a fact that while she was dressing for dinner, and after she had asked Amelia whether her brother was very rich, she had built for herself a most magnificent castle in the air, of which she was mistress, with a husband somewhere in the background (she had not seen him as yet, and his figure would not therefore be very distinct); she had arrayed herself in an infinity of shawls, turbans, and diamond necklaces, and had mounted upon an elephant to the sound of the march in Bluebeard, in order to pay a visit of ceremony to the Grand Mogul. Charming Alnaschar visions! it is the happy privilege of youth to construct you, and many a fanciful young creature besides Rebecca Sharp has indulged in these delightful day-dreams ere now!\nJoseph Sedley was twelve years older than his sister Amelia. He was in the East India Company's Civil Service, and his name appeared, at the period of which we write, in the Bengal division of the East India Register, as collector of Boggley Wollah, an honourable and lucrative post, as everybody knows: in order to know to what higher posts Joseph rose in the service, the reader is referred to the same periodical.\nBoggley Wollah is situated in a fine, lonely, marshy, jungly district, famous for snipe-shooting, and where not unfrequently you may flush a tiger. Ramgunge, where there is a magistrate, is only forty miles off, and there is a cavalry station about thirty miles farther; so Joseph wrote home to his parents, when he took possession of his collectorship. He had lived for about eight years of his life, quite alone, at this charming place, scarcely seeing a Christian face except twice a year, when the detachment arrived to carry off the revenues which he had collected, to Calcutta.\nLuckily, at this time he caught a liver complaint, for the cure of which he returned to Europe, and which was the source of great comfort and amusement to him in his native country. He did not live with his family while in London, but had lodgings of his own, like a gay young bachelor. Before he went to India he was too young to partake of the delightful pleasures of a man about town, and plunged into them on his return with considerable assiduity. He drove his horses in the Park; he dined at the fashionable taverns (for the Oriental Club was not as yet invented); he frequented the theatres, as the mode was in those days, or made his appearance at the opera, laboriously attired in tights and a cocked hat.\nOn returning to India, and ever after, he used to talk of the pleasure of this period of his existence with great enthusiasm, and give you to understand that he and Brummel were the leading bucks of the day. But he was as lonely here as in his jungle at Boggley Wollah. He scarcely knew a single soul in the metropolis: and were it not for his doctor, and the society of his blue-pill, and his liver complaint, he must have died of loneliness. He was lazy, peevish, and a bon-vivant; the appearance of a lady frightened him beyond measure; hence it was but seldom that he joined the paternal circle in Russell Square, where there was plenty of gaiety, and where the jokes of his good-natured old father frightened his amour-propre. His bulk caused Joseph much anxious thought and alarm; now and then he would make a desperate attempt to get rid of his superabundant fat; but his indolence and love of good living speedily got the better of these endeavours at reform, and he found himself again at his three meals a day. He never was well dressed; but he took the hugest pains to adorn his big person, and passed many hours daily in that occupation. His valet made a fortune out of his wardrobe: his toilet-table was covered with as many pomatums and essences as ever were employed by an old beauty: he had tried, in order to give himself a waist, every girth, stay, and waistband then invented. Like most fat men, he would have his clothes made too tight, and took care they should be of the most brilliant colours and youthful cut. When dressed at length, in the afternoon, he would issue forth to take a drive with nobody in the Park; and then would come back in order to dress again and go and dine with nobody at the Piazza Coffee-House. He was as vain as a girl; and perhaps his extreme shyness was one of the results of his extreme vanity. If Miss Rebecca can get the better of him, and at her first entrance into life, she is a young person of no ordinary cleverness.\nThe first move showed considerable skill. When she called Sedley a very handsome man, she knew that Amelia would tell her mother, who would probably tell Joseph, or who, at any rate, would be pleased by the compliment paid to her son. All mothers are. If you had told Sycorax that her son Caliban was as handsome as Apollo, she would have been pleased, witch as she was. Perhaps, too, Joseph Sedley would overhear the compliment--Rebecca spoke loud enough--and he did hear, and (thinking in his heart that he was a very fine man) the praise thrilled through every fibre of his big body, and made it tingle with pleasure. Then, however, came a recoil. \"Is the girl making fun of me?\" he thought, and straightway he bounced towards the bell, and was for retreating, as we have seen, when his father's jokes and his mother's entreaties caused him to pause and stay where he was. He conducted the young lady down to dinner in a dubious and agitated frame of mind. \"Does she really think I am handsome?\" thought he, \"or is she only making game of me?\" We have talked of Joseph Sedley being as vain as a girl. Heaven help us! the girls have only to turn the tables, and say of one of their own sex, \"She is as vain as a man,\" and they will have perfect reason. The bearded creatures are quite as eager for praise, quite as finikin over their toilettes, quite as proud of their personal advantages, quite as conscious of their powers of fascination, as any coquette in the world.\nDownstairs, then, they went, Joseph very red and blushing, Rebecca very modest, and holding her green eyes downwards. She was dressed in white, with bare shoulders as white as snow--the picture of youth, unprotected innocence, and humble virgin simplicity. \"I must be very quiet,\" thought Rebecca, \"and very much interested about India.\"\nNow we have heard how Mrs. Sedley had prepared a fine curry for her son, just as he liked it, and in the course of dinner a portion of this dish was offered to Rebecca. \"What is it?\" said she, turning an appealing look to Mr. Joseph.\n\"Capital,\" said he. His mouth was full of it: his face quite red with the delightful exercise of gobbling. \"Mother, it's as good as my own curries in India.\"\n\"Oh, I must try some, if it is an Indian dish,\" said Miss Rebecca. \"I am sure everything must be good that comes from there.\"\n\"Give Miss Sharp some curry, my dear,\" said Mr. Sedley, laughing.\nRebecca had never tasted the dish before.\n\"Do you find it as good as everything else from India?\" said Mr. Sedley.\n\"Oh, excellent!\" said Rebecca, who was suffering tortures with the cayenne pepper.\n\"Try a chili with it, Miss Sharp,\" said Joseph, really interested.\n\"A chili,\" said Rebecca, gasping. \"Oh yes!\" She thought a chili was something cool, as its name imported, and was served with some. \"How fresh and green they look,\" she said, and put one into her mouth. It was hotter than the curry; flesh and blood could bear it no longer. She laid down her fork. \"Water, for Heaven's sake, water!\" she cried. Mr. Sedley burst out laughing (he was a coarse man, from the Stock Exchange, where they love all sorts of practical jokes). \"They are real Indian, I assure you,\" said he. \"Sambo, give Miss Sharp some water.\"\nThe paternal laugh was echoed by Joseph, who thought the joke capital. The ladies only smiled a little. They thought poor Rebecca suffered too much. She would have liked to choke old Sedley, but she swallowed her mortification as well as she had the abominable curry before it, and as soon as she could speak, said, with a comical, good-humoured air, \"I ought to have remembered the pepper which the Princess of Persia puts in the cream-tarts in the Arabian Nights. Do you put cayenne into your cream-tarts in India, sir?\"\nOld Sedley began to laugh, and thought Rebecca was a good-humoured girl. Joseph simply said, \"Cream-tarts, Miss? Our cream is very bad in Bengal. We generally use goats' milk; and, 'gad, do you know, I've got to prefer it!\"\n\"You won't like EVERYTHING from India now, Miss Sharp,\" said the old gentleman; but when the ladies had retired after dinner, the wily old fellow said to his son, \"Have a care, Joe; that girl is setting her cap at you.\"\n\"Pooh! nonsense!\" said Joe, highly flattered. \"I recollect, sir, there was a girl at Dumdum, a daughter of Cutler of the Artillery, and afterwards married to Lance, the surgeon, who made a dead set at me in the year '4--at me and Mulligatawney, whom I mentioned to you before dinner--a devilish good fellow Mulligatawney--he's a magistrate at Budgebudge, and sure to be in council in five years. Well, sir, the Artillery gave a ball, and Quintin, of the King's 14th, said to me, 'Sedley,' said he, 'I bet you thirteen to ten that Sophy Cutler hooks either you or Mulligatawney before the rains.' 'Done,' says I; and egad, sir--this claret's very good. Adamson's or Carbonell's?\"\nA slight snore was the only reply: the honest stockbroker was asleep, and so the rest of Joseph's story was lost for that day. But he was always exceedingly communicative in a man's party, and has told this delightful tale many scores of times to his apothecary, Dr. Gollop, when he came to inquire about the liver and the blue-pill.\nBeing an invalid, Joseph Sedley contented himself with a bottle of claret besides his Madeira at dinner, and he managed a couple of plates full of strawberries and cream, and twenty-four little rout cakes that were lying neglected in a plate near him, and certainly (for novelists have the privilege of knowing everything) he thought a great deal about the girl upstairs. \"A nice, gay, merry young creature,\" thought he to himself. \"How she looked at me when I picked up her handkerchief at dinner! She dropped it twice. Who's that singing in the drawing-room? 'Gad! shall I go up and see?\"\nBut his modesty came rushing upon him with uncontrollable force. His father was asleep: his hat was in the hall: there was a hackney-coach standing hard by in Southampton Row. \"I'll go and see the Forty Thieves,\" said he, \"and Miss Decamp's dance\"; and he slipped away gently on the pointed toes of his boots, and disappeared, without waking his worthy parent.\n\"There goes Joseph,\" said Amelia, who was looking from the open windows of the drawing-room, while Rebecca was singing at the piano.\n\"Miss Sharp has frightened him away,\" said Mrs. Sedley. \"Poor Joe, why WILL he be so shy?\"",
        "paragraph_chars": [
            [
                0,
                473
            ],
            [
                473,
                679
            ],
            [
                679,
                911
            ],
            [
                911,
                975
            ],
            [
                975,
                1028
            ],
            [
                1028,
                1312
            ],
            [
                1312,
                1425
            ],
            [
                1425,
                1518
            ],
            [
                1518,
                1831
            ],
            [
                1831,
                2165
            ],
            [
                2165,
                2301
            ],
            [
                2301,
                2383
            ],
            [
                2383,
                2464
            ],
            [
                2464,
                2616
            ],
            [
                2616,
                2771
            ],
            [
                2771,
                2845
            ],
            [
                2845,
                2903
            ],
            [
                2903,
                2940
            ],
            [
                2940,
                3010
            ],
            [
                3010,
                3147
            ],
            [
                3147,
                3260
            ],
            [
                3260,
                3302
            ],
            [
                3302,
                3529
            ],
            [
                3529,
                3637
            ],
            [
                3637,
                3816
            ],
            [
                3816,
                6312
            ],
            [
                6312,
                6729
            ],
            [
                6729,
                7313
            ],
            [
                7313,
                8028
            ],
            [
                8028,
                10004
            ],
            [
                10004,
                11477
            ],
            [
                11477,
                11815
            ],
            [
                11815,
                12049
            ],
            [
                12049,
                12207
            ],
            [
                12207,
                12333
            ],
            [
                12333,
                12399
            ],
            [
                12399,
                12441
            ],
            [
                12441,
                12514
            ],
            [
                12514,
                12597
            ],
            [
                12597,
                12664
            ],
            [
                12664,
                13216
            ],
            [
                13216,
                13739
            ],
            [
                13739,
                13963
            ],
            [
                13963,
                14183
            ],
            [
                14183,
                14862
            ],
            [
                14862,
                15196
            ],
            [
                15196,
                15787
            ],
            [
                15787,
                16148
            ],
            [
                16148,
                16281
            ],
            [
                16281,
                16371
            ]
        ],
        "segment_chars": [
            [
                0,
                473
            ],
            [
                473,
                575
            ],
            [
                575,
                679
            ],
            [
                679,
                911
            ],
            [
                911,
                975
            ],
            [
                975,
                994
            ],
            [
                994,
                1011
            ],
            [
                1011,
                1028
            ],
            [
                1028,
                1038
            ],
            [
                1038,
                1106
            ],
            [
                1106,
                1312
            ],
            [
                1312,
                1390
            ],
            [
                1390,
                1425
            ],
            [
                1425,
                1439
            ],
            [
                1439,
                1518
            ],
            [
                1518,
                1669
            ],
            [
                1669,
                1831
            ],
            [
                1831,
                1842
            ],
            [
                1842,
                1908
            ],
            [
                1908,
                2052
            ],
            [
                2052,
                2102
            ],
            [
                2102,
                2116
            ],
            [
                2116,
                2127
            ],
            [
                2127,
                2153
            ],
            [
                2153,
                2165
            ],
            [
                2165,
                2265
            ],
            [
                2265,
                2292
            ],
            [
                2292,
                2301
            ],
            [
                2301,
                2359
            ],
            [
                2359,
                2383
            ],
            [
                2383,
                2464
            ],
            [
                2464,
                2616
            ],
            [
                2616,
                2649
            ],
            [
                2649,
                2689
            ],
            [
                2689,
                2771
            ],
            [
                2771,
                2845
            ],
            [
                2845,
                2853
            ],
            [
                2853,
                2903
            ],
            [
                2903,
                2940
            ],
            [
                2940,
                3010
            ],
            [
                3010,
                3147
            ],
            [
                3147,
                3218
            ],
            [
                3218,
                3260
            ],
            [
                3260,
                3279
            ],
            [
                3279,
                3302
            ],
            [
                3302,
                3340
            ],
            [
                3340,
                3395
            ],
            [
                3395,
                3428
            ],
            [
                3428,
                3457
            ],
            [
                3457,
                3529
            ],
            [
                3529,
                3637
            ],
            [
                3637,
                3816
            ],
            [
                3816,
                4309
            ],
            [
                4309,
                4386
            ],
            [
                4386,
                4431
            ],
            [
                4431,
                4519
            ],
            [
                4519,
                4865
            ],
            [
                4865,
                5030
            ],
            [
                5030,
                5130
            ],
            [
                5130,
                5136
            ],
            [
                5136,
                5473
            ],
            [
                5473,
                6121
            ],
            [
                6121,
                6149
            ],
            [
                6149,
                6312
            ],
            [
                6312,
                6373
            ],
            [
                6373,
                6729
            ],
            [
                6729,
                6877
            ],
            [
                6877,
                7083
            ],
            [
                7083,
                7313
            ],
            [
                7313,
                7495
            ],
            [
                7495,
                7600
            ],
            [
                7600,
                7766
            ],
            [
                7766,
                8028
            ],
            [
                8028,
                8236
            ],
            [
                8236,
                8298
            ],
            [
                8298,
                8472
            ],
            [
                8472,
                8760
            ],
            [
                8760,
                9049
            ],
            [
                9049,
                9178
            ],
            [
                9178,
                9424
            ],
            [
                9424,
                9562
            ],
            [
                9562,
                9771
            ],
            [
                9771,
                9875
            ],
            [
                9875,
                10004
            ],
            [
                10004,
                10046
            ],
            [
                10046,
                10239
            ],
            [
                10239,
                10256
            ],
            [
                10256,
                10375
            ],
            [
                10375,
                10625
            ],
            [
                10625,
                10655
            ],
            [
                10655,
                10687
            ],
            [
                10687,
                10880
            ],
            [
                10880,
                10964
            ],
            [
                10964,
                11003
            ],
            [
                11003,
                11051
            ],
            [
                11051,
                11108
            ],
            [
                11108,
                11124
            ],
            [
                11124,
                11259
            ],
            [
                11259,
                11477
            ],
            [
                11477,
                11595
            ],
            [
                11595,
                11734
            ],
            [
                11734,
                11815
            ],
            [
                11815,
                11984
            ],
            [
                11984,
                11998
            ],
            [
                11998,
                12049
            ],
            [
                12049,
                12069
            ],
            [
                12069,
                12156
            ],
            [
                12156,
                12207
            ],
            [
                12207,
                12274
            ],
            [
                12274,
                12333
            ],
            [
                12333,
                12399
            ],
            [
                12399,
                12441
            ],
            [
                12441,
                12497
            ],
            [
                12497,
                12514
            ],
            [
                12514,
                12531
            ],
            [
                12531,
                12597
            ],
            [
                12597,
                12664
            ],
            [
                12664,
                12698
            ],
            [
                12698,
                12708
            ],
            [
                12708,
                12796
            ],
            [
                12796,
                12867
            ],
            [
                12867,
                12938
            ],
            [
                12938,
                12962
            ],
            [
                12962,
                12997
            ],
            [
                12997,
                13008
            ],
            [
                13008,
                13132
            ],
            [
                13132,
                13179
            ],
            [
                13179,
                13216
            ],
            [
                13216,
                13287
            ],
            [
                13287,
                13320
            ],
            [
                13320,
                13365
            ],
            [
                13365,
                13682
            ],
            [
                13682,
                13739
            ],
            [
                13739,
                13812
            ],
            [
                13812,
                13852
            ],
            [
                13852,
                13885
            ],
            [
                13885,
                13963
            ],
            [
                13963,
                14183
            ],
            [
                14183,
                14190
            ],
            [
                14190,
                14201
            ],
            [
                14201,
                14229
            ],
            [
                14229,
                14579
            ],
            [
                14579,
                14779
            ],
            [
                14779,
                14835
            ],
            [
                14835,
                14862
            ],
            [
                14862,
                14989
            ],
            [
                14989,
                15196
            ],
            [
                15196,
                15568
            ],
            [
                15568,
                15628
            ],
            [
                15628,
                15695
            ],
            [
                15695,
                15717
            ],
            [
                15717,
                15757
            ],
            [
                15757,
                15763
            ],
            [
                15763,
                15787
            ],
            [
                15787,
                15852
            ],
            [
                15852,
                15963
            ],
            [
                15963,
                16148
            ],
            [
                16148,
                16281
            ],
            [
                16281,
                16337
            ],
            [
                16337,
                16371
            ]
        ],
        "overlap_chars": [
            [
                0,
                118
            ],
            [
                124,
                176
            ],
            [
                177,
                190
            ],
            [
                223,
                224
            ],
            [
                231,
                261
            ],
            [
                271,
                346
            ],
            [
                352,
                378
            ],
            [
                383,
                385
            ],
            [
                402,
                411
            ],
            [
                191,
                197
            ],
            [
                412,
                427
            ],
            [
                435,
                452
            ],
            [
                471,
                473
            ],
            [
                473,
                575
            ],
            [
                575,
                599
            ],
            [
                609,
                679
            ],
            [
                679,
                748
            ],
            [
                760,
                773
            ],
            [
                775,
                810
            ],
            [
                812,
                815
            ],
            [
                825,
                827
            ],
            [
                836,
                887
            ],
            [
                891,
                911
            ],
            [
                911,
                975
            ],
            [
                975,
                991
            ],
            [
                1012,
                1028
            ],
            [
                1028,
                1038
            ],
            [
                1038,
                1106
            ],
            [
                1106,
                1180
            ],
            [
                1185,
                1200
            ],
            [
                1207,
                1278
            ],
            [
                1307,
                1312
            ],
            [
                1312,
                1370
            ],
            [
                1388,
                1390
            ],
            [
                1390,
                1425
            ],
            [
                1425,
                1439
            ],
            [
                1439,
                1518
            ],
            [
                1518,
                1524
            ],
            [
                1531,
                1540
            ],
            [
                1548,
                1594
            ],
            [
                1618,
                1625
            ],
            [
                1629,
                1632
            ],
            [
                1667,
                1668
            ],
            [
                1669,
                1771
            ],
            [
                1777,
                1798
            ],
            [
                1804,
                1831
            ],
            [
                1831,
                1840
            ],
            [
                1851,
                1856
            ],
            [
                1870,
                1872
            ],
            [
                1881,
                1908
            ],
            [
                1908,
                1911
            ],
            [
                1934,
                1939
            ],
            [
                1940,
                1956
            ],
            [
                1958,
                1962
            ],
            [
                1984,
                2006
            ],
            [
                1930,
                1933
            ],
            [
                2041,
                2052
            ],
            [
                2052,
                2070
            ],
            [
                2071,
                2102
            ],
            [
                2102,
                2116
            ],
            [
                2116,
                2125
            ],
            [
                2165,
                2179
            ],
            [
                2184,
                2190
            ],
            [
                2205,
                2214
            ],
            [
                2263,
                2265
            ],
            [
                2265,
                2292
            ],
            [
                2297,
                2301
            ],
            [
                2301,
                2331
            ],
            [
                2337,
                2359
            ],
            [
                2359,
                2383
            ],
            [
                2383,
                2401
            ],
            [
                2411,
                2436
            ],
            [
                2462,
                2464
            ],
            [
                2464,
                2470
            ],
            [
                2479,
                2517
            ],
            [
                2552,
                2562
            ],
            [
                2545,
                2548
            ],
            [
                2562,
                2574
            ],
            [
                2590,
                2616
            ],
            [
                2616,
                2647
            ],
            [
                2649,
                2689
            ],
            [
                2689,
                2744
            ],
            [
                2745,
                2771
            ],
            [
                2771,
                2782
            ],
            [
                2826,
                2838
            ],
            [
                2783,
                2789
            ],
            [
                2804,
                2823
            ],
            [
                2825,
                2826
            ],
            [
                2842,
                2845
            ],
            [
                2845,
                2852
            ],
            [
                2853,
                2900
            ],
            [
                2957,
                3010
            ],
            [
                3031,
                3147
            ],
            [
                3147,
                3189
            ],
            [
                3196,
                3218
            ],
            [
                3228,
                3230
            ],
            [
                3258,
                3260
            ],
            [
                3260,
                3279
            ],
            [
                3279,
                3302
            ],
            [
                3302,
                3340
            ],
            [
                3457,
                3529
            ],
            [
                3529,
                3539
            ],
            [
                3544,
                3580
            ],
            [
                3603,
                3637
            ],
            [
                3637,
                3638
            ],
            [
                3644,
                3686
            ],
            [
                3732,
                3758
            ],
            [
                3796,
                3816
            ],
            [
                3816,
                3852
            ],
            [
                3866,
                3870
            ],
            [
                3894,
                3922
            ],
            [
                3932,
                3962
            ],
            [
                3964,
                4015
            ],
            [
                4044,
                4062
            ],
            [
                3924,
                3930
            ],
            [
                4071,
                4174
            ],
            [
                4185,
                4226
            ],
            [
                4237,
                4239
            ],
            [
                4240,
                4248
            ],
            [
                4271,
                4293
            ],
            [
                4307,
                4309
            ],
            [
                4865,
                5030
            ],
            [
                5030,
                5035
            ],
            [
                5086,
                5130
            ],
            [
                5130,
                5132
            ],
            [
                5134,
                5136
            ],
            [
                5136,
                5176
            ],
            [
                5177,
                5198
            ],
            [
                5237,
                5253
            ],
            [
                5265,
                5329
            ],
            [
                5342,
                5361
            ],
            [
                5373,
                5414
            ],
            [
                5416,
                5472
            ],
            [
                5473,
                5501
            ],
            [
                5544,
                5547
            ],
            [
                5640,
                5643
            ],
            [
                5520,
                5543
            ],
            [
                5502,
                5509
            ],
            [
                5700,
                5705
            ],
            [
                5710,
                5825
            ],
            [
                5567,
                5568
            ],
            [
                5910,
                5936
            ],
            [
                5952,
                6027
            ],
            [
                6077,
                6088
            ],
            [
                6101,
                6121
            ],
            [
                6121,
                6129
            ],
            [
                6140,
                6149
            ],
            [
                6206,
                6302
            ],
            [
                6307,
                6312
            ],
            [
                6312,
                6373
            ],
            [
                6373,
                6422
            ],
            [
                6479,
                6501
            ],
            [
                6614,
                6615
            ],
            [
                6449,
                6452
            ],
            [
                6533,
                6614
            ],
            [
                6727,
                6729
            ],
            [
                6729,
                6799
            ],
            [
                6831,
                6836
            ],
            [
                6854,
                6867
            ],
            [
                6868,
                6877
            ],
            [
                6877,
                6998
            ],
            [
                7081,
                7083
            ],
            [
                7086,
                7099
            ],
            [
                7106,
                7129
            ],
            [
                7131,
                7142
            ],
            [
                7144,
                7167
            ],
            [
                7177,
                7200
            ],
            [
                7100,
                7105
            ],
            [
                7208,
                7220
            ],
            [
                7311,
                7313
            ],
            [
                7313,
                7321
            ],
            [
                7335,
                7337
            ],
            [
                7338,
                7407
            ],
            [
                7493,
                7495
            ],
            [
                7495,
                7526
            ],
            [
                7533,
                7600
            ],
            [
                7600,
                7700
            ],
            [
                7705,
                7722
            ],
            [
                7723,
                7736
            ],
            [
                7764,
                7766
            ],
            [
                7766,
                7834
            ],
            [
                7884,
                7886
            ],
            [
                7898,
                7911
            ],
            [
                7943,
                7945
            ],
            [
                7969,
                7991
            ],
            [
                8000,
                8028
            ],
            [
                8028,
                8085
            ],
            [
                8102,
                8106
            ],
            [
                8131,
                8192
            ],
            [
                8193,
                8236
            ],
            [
                8236,
                8256
            ],
            [
                8262,
                8298
            ],
            [
                8298,
                8335
            ],
            [
                8346,
                8379
            ],
            [
                8439,
                8472
            ],
            [
                8472,
                8483
            ],
            [
                8494,
                8497
            ],
            [
                8485,
                8492
            ],
            [
                8510,
                8566
            ],
            [
                8758,
                8759
            ],
            [
                8568,
                8573
            ],
            [
                8597,
                8599
            ],
            [
                8585,
                8591
            ],
            [
                8600,
                8606
            ],
            [
                8703,
                8706
            ],
            [
                8627,
                8689
            ],
            [
                8742,
                8745
            ],
            [
                8724,
                8730
            ],
            [
                8694,
                8699
            ],
            [
                8760,
                8813
            ],
            [
                8815,
                8864
            ],
            [
                8897,
                8967
            ],
            [
                9047,
                9049
            ],
            [
                9049,
                9074
            ],
            [
                9128,
                9129
            ],
            [
                9076,
                9087
            ],
            [
                9099,
                9128
            ],
            [
                9176,
                9178
            ],
            [
                9178,
                9227
            ],
            [
                9234,
                9257
            ],
            [
                9266,
                9269
            ],
            [
                9275,
                9287
            ],
            [
                9326,
                9381
            ],
            [
                9399,
                9424
            ],
            [
                9424,
                9445
            ],
            [
                9457,
                9488
            ],
            [
                9514,
                9561
            ],
            [
                9562,
                9577
            ],
            [
                9602,
                9612
            ],
            [
                9625,
                9690
            ],
            [
                9700,
                9771
            ],
            [
                9771,
                9800
            ],
            [
                9821,
                9824
            ],
            [
                9873,
                9875
            ],
            [
                9875,
                9917
            ],
            [
                9922,
                10004
            ],
            [
                10008,
                10046
            ],
            [
                10046,
                10238
            ],
            [
                10375,
                10432
            ],
            [
                10461,
                10476
            ],
            [
                10534,
                10625
            ],
            [
                10625,
                10654
            ],
            [
                10655,
                10687
            ],
            [
                10687,
                10697
            ],
            [
                10699,
                10751
            ],
            [
                10848,
                10850
            ],
            [
                10766,
                10789
            ],
            [
                10872,
                10878
            ],
            [
                10861,
                10865
            ],
            [
                10878,
                10880
            ],
            [
                10880,
                10963
            ],
            [
                10964,
                11003
            ],
            [
                11003,
                11025
            ],
            [
                11031,
                11050
            ],
            [
                11051,
                11108
            ],
            [
                11128,
                11133
            ],
            [
                11168,
                11171
            ],
            [
                11243,
                11257
            ],
            [
                11162,
                11163
            ],
            [
                11172,
                11178
            ],
            [
                11182,
                11221
            ],
            [
                11259,
                11320
            ],
            [
                11360,
                11374
            ],
            [
                11349,
                11350
            ],
            [
                11396,
                11462
            ],
            [
                11475,
                11477
            ],
            [
                11477,
                11512
            ],
            [
                11526,
                11555
            ],
            [
                11593,
                11595
            ],
            [
                11595,
                11640
            ],
            [
                11659,
                11673
            ],
            [
                11681,
                11702
            ],
            [
                11704,
                11734
            ],
            [
                11734,
                11765
            ],
            [
                11773,
                11815
            ],
            [
                11815,
                11818
            ],
            [
                11837,
                11887
            ],
            [
                11909,
                11936
            ],
            [
                11950,
                11983
            ],
            [
                11984,
                11998
            ],
            [
                11998,
                12049
            ],
            [
                12049,
                12069
            ],
            [
                12069,
                12087
            ],
            [
                12093,
                12118
            ],
            [
                12146,
                12156
            ],
            [
                12156,
                12207
            ],
            [
                12207,
                12274
            ],
            [
                12274,
                12332
            ],
            [
                12407,
                12441
            ],
            [
                12333,
                12334
            ],
            [
                12350,
                12354
            ],
            [
                12360,
                12361
            ],
            [
                12339,
                12349
            ],
            [
                12379,
                12380
            ],
            [
                12442,
                12497
            ],
            [
                12497,
                12514
            ],
            [
                12514,
                12531
            ],
            [
                12531,
                12597
            ],
            [
                12597,
                12664
            ],
            [
                12664,
                12698
            ],
            [
                12698,
                12708
            ],
            [
                12708,
                12759
            ],
            [
                12794,
                12796
            ],
            [
                12796,
                12867
            ],
            [
                12867,
                12896
            ],
            [
                12913,
                12938
            ],
            [
                12938,
                12962
            ],
            [
                12962,
                12997
            ],
            [
                12997,
                13007
            ],
            [
                13008,
                13018
            ],
            [
                13019,
                13100
            ],
            [
                13114,
                13132
            ],
            [
                13179,
                13216
            ],
            [
                13229,
                13255
            ],
            [
                13285,
                13287
            ],
            [
                13287,
                13297
            ],
            [
                13303,
                13318
            ],
            [
                13325,
                13365
            ],
            [
                13365,
                13442
            ],
            [
                13492,
                13546
            ],
            [
                13562,
                13682
            ],
            [
                13682,
                13739
            ],
            [
                13739,
                13749
            ],
            [
                13764,
                13811
            ],
            [
                13812,
                13818
            ],
            [
                13826,
                13844
            ],
            [
                13850,
                13852
            ],
            [
                13852,
                13885
            ],
            [
                13885,
                13918
            ],
            [
                13920,
                13963
            ],
            [
                13963,
                14041
            ],
            [
                14047,
                14183
            ],
            [
                14183,
                14190
            ],
            [
                14190,
                14201
            ],
            [
                14201,
                14229
            ],
            [
                14229,
                14230
            ],
            [
                14248,
                14340
            ],
            [
                14348,
                14389
            ],
            [
                14403,
                14426
            ],
            [
                14467,
                14503
            ],
            [
                14579,
                14779
            ],
            [
                14779,
                14808
            ],
            [
                14810,
                14835
            ],
            [
                14835,
                14844
            ],
            [
                14859,
                14862
            ],
            [
                14862,
                14895
            ],
            [
                14897,
                14974
            ],
            [
                14987,
                14989
            ],
            [
                14989,
                15006
            ],
            [
                15033,
                15035
            ],
            [
                15041,
                15043
            ],
            [
                15049,
                15054
            ],
            [
                15059,
                15108
            ],
            [
                15125,
                15135
            ],
            [
                15137,
                15166
            ],
            [
                15109,
                15112
            ],
            [
                15171,
                15176
            ],
            [
                15194,
                15196
            ],
            [
                15196,
                15304
            ],
            [
                15308,
                15334
            ],
            [
                15340,
                15446
            ],
            [
                15448,
                15451
            ],
            [
                15519,
                15567
            ],
            [
                15568,
                15575
            ],
            [
                15580,
                15615
            ],
            [
                15626,
                15628
            ],
            [
                15628,
                15695
            ],
            [
                15695,
                15717
            ],
            [
                15717,
                15757
            ],
            [
                15758,
                15763
            ],
            [
                15763,
                15787
            ],
            [
                15787,
                15824
            ],
            [
                15850,
                15852
            ],
            [
                15852,
                15934
            ],
            [
                15961,
                15963
            ],
            [
                15963,
                15971
            ],
            [
                15980,
                15983
            ],
            [
                15997,
                16008
            ],
            [
                15972,
                15975
            ],
            [
                16043,
                16055
            ],
            [
                16114,
                16132
            ],
            [
                16146,
                16148
            ],
            [
                16148,
                16206
            ],
            [
                16220,
                16281
            ],
            [
                16281,
                16337
            ],
            [
                16337,
                16371
            ]
        ],
        "row_chars": [
            [
                0,
                473
            ],
            [
                473,
                575
            ],
            [
                575,
                679
            ],
            [
                679,
                911
            ],
            [
                911,
                975
            ],
            [
                975,
                994
            ],
            [
                994,
                1011
            ],
            [
                1011,
                1028
            ],
            [
                1028,
                1038
            ],
            [
                1038,
                1106
            ],
            [
                1106,
                1312
            ],
            [
                1312,
                1390
            ],
            [
                1390,
                1425
            ],
            [
                1425,
                1439
            ],
            [
                1439,
                1518
            ],
            [
                1518,
                1669
            ],
            [
                1669,
                1831
            ],
            [
                1831,
                1842
            ],
            [
                1842,
                1908
            ],
            [
                1908,
                2052
            ],
            [
                2052,
                2102
            ],
            [
                2102,
                2116
            ],
            [
                2116,
                2127
            ],
            [
                2127,
                2153
            ],
            [
                2153,
                2165
            ],
            [
                2165,
                2265
            ],
            [
                2265,
                2292
            ],
            [
                2292,
                2301
            ],
            [
                2301,
                2359
            ],
            [
                2359,
                2383
            ],
            [
                2383,
                2464
            ],
            [
                2464,
                2616
            ],
            [
                2616,
                2649
            ],
            [
                2649,
                2689
            ],
            [
                2689,
                2771
            ],
            [
                2771,
                2940
            ],
            [
                2940,
                3010
            ],
            [
                3010,
                3147
            ],
            [
                3147,
                3218
            ],
            [
                3218,
                3260
            ],
            [
                3260,
                3279
            ],
            [
                3279,
                3302
            ],
            [
                3302,
                3340
            ],
            [
                3340,
                3395
            ],
            [
                3395,
                3428
            ],
            [
                3428,
                3457
            ],
            [
                3457,
                3529
            ],
            [
                3529,
                3637
            ],
            [
                3637,
                3816
            ],
            [
                3816,
                4309
            ],
            [
                4309,
                4386
            ],
            [
                4386,
                4431
            ],
            [
                4431,
                4519
            ],
            [
                4519,
                4865
            ],
            [
                4865,
                5030
            ],
            [
                5030,
                5130
            ],
            [
                5130,
                5136
            ],
            [
                5136,
                5473
            ],
            [
                5473,
                6121
            ],
            [
                6121,
                6149
            ],
            [
                6149,
                6312
            ],
            [
                6312,
                6373
            ],
            [
                6373,
                6729
            ],
            [
                6729,
                6877
            ],
            [
                6877,
                7083
            ],
            [
                7083,
                7313
            ],
            [
                7313,
                7495
            ],
            [
                7495,
                7600
            ],
            [
                7600,
                7766
            ],
            [
                7766,
                8028
            ],
            [
                8028,
                8236
            ],
            [
                8236,
                8298
            ],
            [
                8298,
                8472
            ],
            [
                8472,
                8760
            ],
            [
                8760,
                9049
            ],
            [
                9049,
                9178
            ],
            [
                9178,
                9424
            ],
            [
                9424,
                9562
            ],
            [
                9562,
                9771
            ],
            [
                9771,
                9875
            ],
            [
                9875,
                10004
            ],
            [
                10004,
                10046
            ],
            [
                10046,
                10239
            ],
            [
                10239,
                10256
            ],
            [
                10256,
                10375
            ],
            [
                10375,
                10625
            ],
            [
                10625,
                10655
            ],
            [
                10655,
                10687
            ],
            [
                10687,
                10880
            ],
            [
                10880,
                10964
            ],
            [
                10964,
                11003
            ],
            [
                11003,
                11051
            ],
            [
                11051,
                11108
            ],
            [
                11108,
                11124
            ],
            [
                11124,
                11259
            ],
            [
                11259,
                11477
            ],
            [
                11477,
                11595
            ],
            [
                11595,
                11734
            ],
            [
                11734,
                11815
            ],
            [
                11815,
                11984
            ],
            [
                11984,
                11998
            ],
            [
                11998,
                12049
            ],
            [
                12049,
                12069
            ],
            [
                12069,
                12156
            ],
            [
                12156,
                12207
            ],
            [
                12207,
                12274
            ],
            [
                12274,
                12333
            ],
            [
                12333,
                12441
            ],
            [
                12441,
                12497
            ],
            [
                12497,
                12514
            ],
            [
                12514,
                12531
            ],
            [
                12531,
                12597
            ],
            [
                12597,
                12664
            ],
            [
                12664,
                12698
            ],
            [
                12698,
                12708
            ],
            [
                12708,
                12796
            ],
            [
                12796,
                12867
            ],
            [
                12867,
                12938
            ],
            [
                12938,
                12962
            ],
            [
                12962,
                12997
            ],
            [
                12997,
                13008
            ],
            [
                13008,
                13132
            ],
            [
                13132,
                13179
            ],
            [
                13179,
                13216
            ],
            [
                13216,
                13287
            ],
            [
                13287,
                13365
            ],
            [
                13365,
                13682
            ],
            [
                13682,
                13739
            ],
            [
                13739,
                13812
            ],
            [
                13812,
                13852
            ],
            [
                13852,
                13885
            ],
            [
                13885,
                13963
            ],
            [
                13963,
                14183
            ],
            [
                14183,
                14190
            ],
            [
                14190,
                14201
            ],
            [
                14201,
                14229
            ],
            [
                14229,
                14779
            ],
            [
                14779,
                14835
            ],
            [
                14835,
                14862
            ],
            [
                14862,
                14989
            ],
            [
                14989,
                15196
            ],
            [
                15196,
                15568
            ],
            [
                15568,
                15628
            ],
            [
                15628,
                15695
            ],
            [
                15695,
                15717
            ],
            [
                15717,
                15757
            ],
            [
                15757,
                15763
            ],
            [
                15763,
                15787
            ],
            [
                15787,
                15852
            ],
            [
                15852,
                15963
            ],
            [
                15963,
                16148
            ],
            [
                16148,
                16281
            ],
            [
                16281,
                16337
            ],
            [
                16337,
                16371
            ]
        ]
    },
    "abridged": {
        "text": "A very stout, puffy man, in buckskins and Hessian boots, with several immense neckcloths that rose almost to his nose, a red striped waistcoat and an apple green coat with huge steel buttons (the morning costume of a dandy of those days) was reading the paper by the fire when the two girls entered. He bounced off his arm-chair, blushing, and hid almost his entire face in his neckcloths.\n\"It's only your sister, Joseph,\" said Amelia, laughing and shaking the two fingers which he held out. \"I've come home for good; and this is my friend, Miss Sharp, whom you have heard me mention.\"\n\"No, never, upon my word,\" said the head under the neckcloth, shaking, \"that is, yes - what abominably cold weather, Miss\" - and he began poking the fire with all his might, although it was the middle of June.\n\"He's very handsome,\" whispered Rebecca to Amelia, rather loud.\n\"Do you think so? I'll tell him.\"\n\"Darling! not for worlds,\" said Miss Sharp, starting back as timid as a fawn. She had previously made a respectful virgin-like curtsey to the gentleman, her modest eyes gazing so perseveringly on the carpet that it was a wonder how she should have seen him.\n\"Thank you for the beautiful shawls, brother,\" said Amelia. \"Are they not beautiful, Rebecca?\"\n\"O heavenly!\" said Miss Sharp, and her eyes went from the carpet straight to the chandelier.\nJoseph continued clattering at the poker and tongs, puffing and turning red.\n\"I can't make you such handsome presents, Joseph,\" continued his sister, \"but while I was at school, I embroidered for you a beautiful pair of braces.\"\n\"Good Gad, Amelia!\" he cried in alarm, \"what do you mean?\" and he plunged so mightily at the bell-rope that it came away in his hand, increasing his confusion. \"For heaven's sake, see if my buggy's at the door. I can't wait. I must go.\"\nAt this minute their father walked in. \"What's the matter, Emmy?\" said he.\n\"Joseph wants me to see if his buggy is at the door. What is a buggy, Papa?\"\n\"It is a one-horse litter,\" said the old gentleman.\nJoseph burst out into a wild fit of laughter; meeting Miss Sharp's eye, he stopped suddenly, as if he had been shot.\n\"This young lady is your friend?\" asked Mr. Sedley. \"Miss Sharp, I am very happy to see you. Have you and Emmy been quarrelling already with Joseph, so that he wants to be off?\"\n\"I promised to dine with Bonamy, sir,\" said Joseph. \"I'm not dressed for dinner here.\"\n\"O fie! didn't you tell your mother you would dine here? Isn't he handsome enough to dine anywhere, Miss Sharp?\"\nMiss Sharp looked at her friend, and they both set off in a fit of laughter, highly agreeable to the old gentleman.\n\"Did you ever see a pair of buckskins like his at Miss Pinkerton's?\" he continued.\n\"Gracious heavens! Father,\" cried Joseph.\n\"There now, I have hurt his feelings. Come, Joseph, be friends with Miss Sharp, and let us all go to dinner.\"\n\"There's a pilau, Joseph, just as you like it, and the best turbot in Billingsgate.\"\n\"Come, sir, walk downstairs with Miss Sharp,\" said the father, and he walked merrily off.\nIf Miss Rebecca Sharp had determined upon conquering this big beau, I don't think we have any right to blame her. For though the task of husband-hunting is generally entrusted by young ladies to their mammas, recollect that Miss Sharp had no kind parent to arrange these delicate matters for her. If she did not get a husband for herself, no-one else would take the trouble. What causes respectable parents to take up their carpets, set their houses topsy-turvy, and spend a fifth of their year's income in ball suppers and iced champagne? Is it a pure wish to see young people happy and dancing? Pshaw! they want to marry their daughters; and, just as honest Mrs. Sedley had already arranged little schemes for the settlement of her Amelia, so also had our unprotected Rebecca decided to do her very best to secure the husband who was even more necessary for her than for her friend.\nShe had a vivid imagination; and had read the Arabian Nights. She had already built herself a most magnificent castle in the air, of which she was mistress, with a husband somewhere in the background; she had arrayed herself in shawls, turbans, and diamond necklaces, and had mounted upon an elephant to pay a visit to the Grand Mogul. Charming visions! many a fanciful young creature besides Rebecca Sharp has indulged in these delightful day-dreams before now!\nJoseph Sedley was twelve years older than his sister Amelia. He was in the East India Company's Civil Service, in the Bengal division: the tax collector of Boggley Wollah, an honourable and lucrative post, as everybody knows.\nBoggley Wollah is situated in a fine, lonely, marshy, jungly district, where you may flush out a tiger. Ramgunge, where there is a magistrate, is only forty miles off, and there is a cavalry station about thirty miles farther. Joseph had lived for eight years of his life quite alone at this charming place, seeing a Christian face only about twice a year.\nLuckily, he had caught a liver complaint, for the cure of which he returned to Europe. He did not live with his family in London, but had lodgings of his own, like a gay young bachelor. Before he went to India he was too young to partake of the delightful pleasures of a man about town, but he plunged into them eagerly on his return. He drove his horses in the Park; he dined at the fashionable taverns; he went to the theatres, or the opera, laboriously clothed in tights and a cocked hat.\nOn returning to India, and ever after, he used to talk of this pleasant time with great enthusiasm, and give you to understand that he and Beau Brummel were the leading bucks of the day. But he was as lonely in London as in his jungle at Boggley Wollah. He scarcely knew a single soul in the city: and were it not for his doctor, he must have died of loneliness. He was lazy and peevish; the appearance of a lady frightened him beyond measure. Hence he seldom joined his family in Russell Square, where there was plenty of gaiety, and where his father's jokes affronted him.\nHis bulk caused Joseph much anxious thought and alarm. Now and then he would make a desperate attempt to lose weight; but his indolence and love of good living speedily got the better of him. He never was well dressed, but he took huge pains to adorn his big person. His valet made a fortune out of his wardrobe: his dressing-table was covered with pomades and essences: he had tried, in order to give himself a waist, every waistband then invented. Like most fat men, he had his clothes made too tight, and of the most brilliant colours and youthful cut.\nWhen dressed at last, he would go out to take a drive with nobody in the Park; and then would come back to dress again and go and dine with nobody at the Piazza Coffee-House. He was as vain as a girl; and extremely shy. If Miss Rebecca can get the better of him, at her first entrance into life, she is a young person of no ordinary cleverness.\nHer first move showed considerable skill. When she called Sedley a very handsome man, she knew that Amelia would tell her mother, who would probably tell Joseph, or who, at any rate, would be pleased by the compliment paid to her son.\nPerhaps, too, Joseph Sedley would overhear the compliment - and he did hear. The praise thrilled through every fibre of his big body, and made it tingle with pleasure. Then, however, came a recoil.\n\"Is the girl making fun of me?\" he thought; and straightway he bounced towards the bell, and was about to retreat, as we have seen, when he was persuaded to stay. He conducted the young lady down to dinner in a dubious and agitated frame of mind.\n\"Does she really think I am handsome?\" thought he, \"or is she making game of me?\"\nWe have talked of Joseph Sedley being as vain as a girl. Yet girls might say with perfect reason, of one their own sex, \"She is as vain as a man.\" The bearded creatures are quite as eager for praise, quite as fussy and proud of their appearance, and quite as conscious of their powers of fascination, as any coquette.\nDownstairs, then, they went, Joseph blushing, Rebecca very modest. She was dressed in white, with bare shoulders - the picture of unprotected innocence and humble virgin simplicity. \"I must be very quiet,\" thought she, \"and very much interested about India.\"\nNow Mrs. Sedley had prepared a fine curry for her son, and in the course of dinner this dish was offered to Rebecca.\n\"What is it?\" said she, turning an appealing look to Mr. Joseph.\n\"Capital,\" said he. His mouth was full: his face quite red with gobbling. \"Mother, it's as good as my own curries in India.\"\n\"Oh, I must try some, if it is an Indian dish,\" said Miss Rebecca. \"I am sure everything must be good that comes from there.\" She had never tasted the dish before.\n\"Have some, Miss Sharp. Do you find it as good as everything else from India?\" said Mr. Sedley.\n\"Oh, excellent!\" said Rebecca, who was suffering tortures with the cayenne pepper.\n\"Try a chili with it, Miss Sharp,\" said Joseph, really interested.\n\"A chili,\" said Rebecca, gasping. \"Oh yes!\" She thought a chili was something cool, as its name suggested. \"How fresh and green they look,\" she said, and put one into her mouth. It was hotter than the curry; she could bear it no longer. She laid down her fork. \"Water, for Heaven's sake, water!\" she cried.\nMr. Sedley senior burst out laughing (he was a coarse man, from the Stock Exchange, where they love practical jokes). \"Sambo, give Miss Sharp some water.\"\nHis laugh was echoed by Joseph. The ladies smiled a little, but thought poor Rebecca suffered too much. She would have liked to choke old Sedley, but she swallowed her mortification, and as soon as she could speak, said, with a comical air, \"I ought to have remembered the pepper which the Princess of Persia puts in the cream-tarts in the Arabian Nights. Do you put cayenne into your cream-tarts in India, sir?\"\nOld Sedley laughed, and thought Rebecca was a good-humoured girl.\nJoseph said, \"Cream-tarts? Our cream is very bad in Bengal. We generally use goats' milk; and 'gad, do you know, I've got to prefer it!\"\n\"You won't like everything from India now, Miss Sharp,\" said the old gentleman. When the ladies had retired after dinner, the wily old fellow said to his son, \"Have a care, Joe; that girl is setting her cap at you.\"\n\"Pooh! nonsense!\" said Joe, highly flattered. \"There was a girl at Dumdum, a daughter of Cutler of the Artillery, and afterwards married to the surgeon, who made a dead set at me in 1804 - at me and Mulligatawney - a devilish good fellow Mulligatawney - Well, sir, the Artillery gave a ball, and Quintin, of the King's 14th, said to me, 'Sedley,' said he, 'I bet you thirteen to ten that Sophy Cutler hooks either you or Mulligatawney before the rains.' 'Done,' says I; and egad, sir - this claret's very good. Adamson's?\"\nA slight snore was the only reply. The honest stockbroker was asleep, and so the rest of Joseph's story was lost. But he was always talkative in men's company, and had told this delightful tale many scores of times to Dr. Gollop when he came to inquire about his liver.\nBeing an invalid, Joseph Sedley contented himself with a bottle of claret besides his Madeira at dinner, and managed a couple of plates of strawberries and cream, and twenty-four little rout cakes that were lying neglected in a plate near him; and he thought a great deal about the girl upstairs.\n\"A nice, merry young creature,\" thought he. \"How she looked at me when I picked up her handkerchief at dinner! She dropped it twice. Who's that singing in the drawing-room? Gad! shall I go up and see?\"\nBut his modesty came rushing upon him. His father was asleep: his hat was in the hall: there was a hackney-coach standing nearby. \"I'll go to the theatre,\" said he, and slipped away without waking his father.\n\"There goes Joseph,\" said Amelia, who was looking from the window of the drawing-room, while Rebecca was singing at the piano.\n\"Miss Sharp has frightened him away,\" said Mrs. Sedley. \"Poor Joe, why will he be so shy?\"",
        "paragraph_chars": [
            [
                0,
                390
            ],
            [
                390,
                586
            ],
            [
                586,
                796
            ],
            [
                796,
                860
            ],
            [
                860,
                894
            ],
            [
                894,
                1152
            ],
            [
                1152,
                1247
            ],
            [
                1247,
                1340
            ],
            [
                1340,
                1417
            ],
            [
                1417,
                1569
            ],
            [
                1569,
                1806
            ],
            [
                1806,
                1881
            ],
            [
                1881,
                1958
            ],
            [
                1958,
                2010
            ],
            [
                2010,
                2127
            ],
            [
                2127,
                2305
            ],
            [
                2305,
                2392
            ],
            [
                2392,
                2505
            ],
            [
                2505,
                2621
            ],
            [
                2621,
                2704
            ],
            [
                2704,
                2746
            ],
            [
                2746,
                2856
            ],
            [
                2856,
                2941
            ],
            [
                2941,
                3031
            ],
            [
                3031,
                3916
            ],
            [
                3916,
                4379
            ],
            [
                4379,
                4605
            ],
            [
                4605,
                4962
            ],
            [
                4962,
                5454
            ],
            [
                5454,
                6029
            ],
            [
                6029,
                6585
            ],
            [
                6585,
                6930
            ],
            [
                6930,
                7165
            ],
            [
                7165,
                7363
            ],
            [
                7363,
                7610
            ],
            [
                7610,
                7692
            ],
            [
                7692,
                8010
            ],
            [
                8010,
                8269
            ],
            [
                8269,
                8386
            ],
            [
                8386,
                8451
            ],
            [
                8451,
                8576
            ],
            [
                8576,
                8740
            ],
            [
                8740,
                8836
            ],
            [
                8836,
                8919
            ],
            [
                8919,
                8986
            ],
            [
                8986,
                9293
            ],
            [
                9293,
                9448
            ],
            [
                9448,
                9861
            ],
            [
                9861,
                9927
            ],
            [
                9927,
                10064
            ],
            [
                10064,
                10280
            ],
            [
                10280,
                10803
            ],
            [
                10803,
                11073
            ],
            [
                11073,
                11370
            ],
            [
                11370,
                11572
            ],
            [
                11572,
                11781
            ],
            [
                11781,
                11908
            ],
            [
                11908,
                11998
            ]
        ],
        "segment_chars": [
            [
                0,
                300
            ],
            [
                300,
                390
            ],
            [
                390,
                492
            ],
            [
                492,
                586
            ],
            [
                586,
                796
            ],
            [
                796,
                860
            ],
            [
                860,
                878
            ],
            [
                878,
                894
            ],
            [
                894,
                904
            ],
            [
                904,
                972
            ],
            [
                972,
                1152
            ],
            [
                1152,
                1212
            ],
            [
                1212,
                1247
            ],
            [
                1247,
                1261
            ],
            [
                1261,
                1340
            ],
            [
                1340,
                1417
            ],
            [
                1417,
                1569
            ],
            [
                1569,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1729
            ],
            [
                1729,
                1780
            ],
            [
                1780,
                1794
            ],
            [
                1794,
                1806
            ],
            [
                1806,
                1845
            ],
            [
                1845,
                1872
            ],
            [
                1872,
                1881
            ],
            [
                1881,
                1934
            ],
            [
                1934,
                1958
            ],
            [
                1958,
                2010
            ],
            [
                2010,
                2127
            ],
            [
                2127,
                2161
            ],
            [
                2161,
                2179
            ],
            [
                2179,
                2220
            ],
            [
                2220,
                2305
            ],
            [
                2305,
                2357
            ],
            [
                2357,
                2392
            ],
            [
                2392,
                2400
            ],
            [
                2400,
                2449
            ],
            [
                2449,
                2505
            ],
            [
                2505,
                2621
            ],
            [
                2621,
                2690
            ],
            [
                2690,
                2704
            ],
            [
                2704,
                2723
            ],
            [
                2723,
                2746
            ],
            [
                2746,
                2784
            ],
            [
                2784,
                2856
            ],
            [
                2856,
                2941
            ],
            [
                2941,
                3031
            ],
            [
                3031,
                3145
            ],
            [
                3145,
                3328
            ],
            [
                3328,
                3406
            ],
            [
                3406,
                3571
            ],
            [
                3571,
                3628
            ],
            [
                3628,
                3635
            ],
            [
                3635,
                3916
            ],
            [
                3916,
                3978
            ],
            [
                3978,
                4252
            ],
            [
                4252,
                4270
            ],
            [
                4270,
                4379
            ],
            [
                4379,
                4440
            ],
            [
                4440,
                4605
            ],
            [
                4605,
                4709
            ],
            [
                4709,
                4832
            ],
            [
                4832,
                4962
            ],
            [
                4962,
                5049
            ],
            [
                5049,
                5148
            ],
            [
                5148,
                5297
            ],
            [
                5297,
                5454
            ],
            [
                5454,
                5641
            ],
            [
                5641,
                5708
            ],
            [
                5708,
                5817
            ],
            [
                5817,
                5898
            ],
            [
                5898,
                6029
            ],
            [
                6029,
                6084
            ],
            [
                6084,
                6221
            ],
            [
                6221,
                6296
            ],
            [
                6296,
                6479
            ],
            [
                6479,
                6585
            ],
            [
                6585,
                6760
            ],
            [
                6760,
                6805
            ],
            [
                6805,
                6930
            ],
            [
                6930,
                6972
            ],
            [
                6972,
                7165
            ],
            [
                7165,
                7242
            ],
            [
                7242,
                7333
            ],
            [
                7333,
                7363
            ],
            [
                7363,
                7395
            ],
            [
                7395,
                7526
            ],
            [
                7526,
                7610
            ],
            [
                7610,
                7649
            ],
            [
                7649,
                7692
            ],
            [
                7692,
                7749
            ],
            [
                7749,
                7839
            ],
            [
                7839,
                8010
            ],
            [
                8010,
                8077
            ],
            [
                8077,
                8192
            ],
            [
                8192,
                8269
            ],
            [
                8269,
                8386
            ],
            [
                8386,
                8400
            ],
            [
                8400,
                8451
            ],
            [
                8451,
                8471
            ],
            [
                8471,
                8525
            ],
            [
                8525,
                8576
            ],
            [
                8576,
                8643
            ],
            [
                8643,
                8702
            ],
            [
                8702,
                8740
            ],
            [
                8740,
                8764
            ],
            [
                8764,
                8819
            ],
            [
                8819,
                8836
            ],
            [
                8836,
                8853
            ],
            [
                8853,
                8919
            ],
            [
                8919,
                8986
            ],
            [
                8986,
                9020
            ],
            [
                9020,
                9030
            ],
            [
                9030,
                9093
            ],
            [
                9093,
                9164
            ],
            [
                9164,
                9223
            ],
            [
                9223,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9293
            ],
            [
                9293,
                9411
            ],
            [
                9411,
                9448
            ],
            [
                9448,
                9480
            ],
            [
                9480,
                9552
            ],
            [
                9552,
                9804
            ],
            [
                9804,
                9861
            ],
            [
                9861,
                9927
            ],
            [
                9927,
                9954
            ],
            [
                9954,
                9987
            ],
            [
                9987,
                10064
            ],
            [
                10064,
                10144
            ],
            [
                10144,
                10280
            ],
            [
                10280,
                10287
            ],
            [
                10287,
                10298
            ],
            [
                10298,
                10326
            ],
            [
                10326,
                10734
            ],
            [
                10734,
                10791
            ],
            [
                10791,
                10803
            ],
            [
                10803,
                10838
            ],
            [
                10838,
                10917
            ],
            [
                10917,
                11073
            ],
            [
                11073,
                11370
            ],
            [
                11370,
                11414
            ],
            [
                11414,
                11481
            ],
            [
                11481,
                11503
            ],
            [
                11503,
                11543
            ],
            [
                11543,
                11548
            ],
            [
                11548,
                11572
            ],
            [
                11572,
                11611
            ],
            [
                11611,
                11702
            ],
            [
                11702,
                11781
            ],
            [
                11781,
                11908
            ],
            [
                11908,
                11964
            ],
            [
                11964,
                11998
            ]
        ],
        "overlap_chars": [
            [
                0,
                118
            ],
            [
                119,
                171
            ],
            [
                177,
                190
            ],
            [
                191,
                192
            ],
            [
                192,
                222
            ],
            [
                223,
                298
            ],
            [
                303,
                329
            ],
            [
                330,
                332
            ],
            [
                338,
                347
            ],
            [
                348,
                354
            ],
            [
                355,
                370
            ],
            [
                371,
                388
            ],
            [
                388,
                390
            ],
            [
                390,
                492
            ],
            [
                492,
                516
            ],
            [
                516,
                586
            ],
            [
                586,
                655
            ],
            [
                657,
                670
            ],
            [
                673,
                708
            ],
            [
                711,
                714
            ],
            [
                715,
                717
            ],
            [
                724,
                775
            ],
            [
                776,
                796
            ],
            [
                796,
                860
            ],
            [
                860,
                876
            ],
            [
                878,
                894
            ],
            [
                894,
                904
            ],
            [
                904,
                972
            ],
            [
                972,
                1046
            ],
            [
                1047,
                1062
            ],
            [
                1070,
                1141
            ],
            [
                1147,
                1152
            ],
            [
                1152,
                1210
            ],
            [
                1210,
                1212
            ],
            [
                1212,
                1247
            ],
            [
                1247,
                1261
            ],
            [
                1261,
                1340
            ],
            [
                1340,
                1346
            ],
            [
                1347,
                1356
            ],
            [
                1357,
                1403
            ],
            [
                1404,
                1411
            ],
            [
                1412,
                1415
            ],
            [
                1415,
                1416
            ],
            [
                1417,
                1519
            ],
            [
                1520,
                1541
            ],
            [
                1542,
                1569
            ],
            [
                1569,
                1578
            ],
            [
                1592,
                1597
            ],
            [
                1598,
                1600
            ],
            [
                1601,
                1628
            ],
            [
                1628,
                1631
            ],
            [
                1646,
                1651
            ],
            [
                1655,
                1671
            ],
            [
                1672,
                1676
            ],
            [
                1680,
                1702
            ],
            [
                1714,
                1717
            ],
            [
                1718,
                1729
            ],
            [
                1729,
                1747
            ],
            [
                1749,
                1780
            ],
            [
                1780,
                1794
            ],
            [
                1794,
                1803
            ],
            [
                1806,
                1820
            ],
            [
                1827,
                1833
            ],
            [
                1834,
                1843
            ],
            [
                1843,
                1845
            ],
            [
                1845,
                1872
            ],
            [
                1877,
                1881
            ],
            [
                1881,
                1911
            ],
            [
                1912,
                1934
            ],
            [
                1934,
                1958
            ],
            [
                1958,
                1976
            ],
            [
                1983,
                2008
            ],
            [
                2008,
                2010
            ],
            [
                2010,
                2016
            ],
            [
                2017,
                2055
            ],
            [
                2064,
                2074
            ],
            [
                2077,
                2080
            ],
            [
                2080,
                2092
            ],
            [
                2101,
                2127
            ],
            [
                2127,
                2158
            ],
            [
                2180,
                2220
            ],
            [
                2220,
                2275
            ],
            [
                2279,
                2305
            ],
            [
                2305,
                2316
            ],
            [
                2317,
                2329
            ],
            [
                2330,
                2336
            ],
            [
                2336,
                2355
            ],
            [
                2357,
                2358
            ],
            [
                2389,
                2392
            ],
            [
                2392,
                2399
            ],
            [
                2400,
                2447
            ],
            [
                2452,
                2505
            ],
            [
                2505,
                2621
            ],
            [
                2621,
                2663
            ],
            [
                2668,
                2690
            ],
            [
                2690,
                2692
            ],
            [
                2702,
                2704
            ],
            [
                2704,
                2723
            ],
            [
                2723,
                2746
            ],
            [
                2746,
                2784
            ],
            [
                2784,
                2856
            ],
            [
                2856,
                2866
            ],
            [
                2870,
                2906
            ],
            [
                2907,
                2941
            ],
            [
                2941,
                2942
            ],
            [
                2942,
                2984
            ],
            [
                2984,
                3010
            ],
            [
                3011,
                3031
            ],
            [
                3031,
                3067
            ],
            [
                3068,
                3072
            ],
            [
                3084,
                3112
            ],
            [
                3113,
                3143
            ],
            [
                3145,
                3196
            ],
            [
                3197,
                3215
            ],
            [
                3216,
                3222
            ],
            [
                3223,
                3326
            ],
            [
                3328,
                3369
            ],
            [
                3370,
                3372
            ],
            [
                3373,
                3381
            ],
            [
                3382,
                3404
            ],
            [
                3404,
                3406
            ],
            [
                3406,
                3571
            ],
            [
                3571,
                3576
            ],
            [
                3584,
                3628
            ],
            [
                3628,
                3630
            ],
            [
                3633,
                3635
            ],
            [
                3635,
                3675
            ],
            [
                3681,
                3702
            ],
            [
                3707,
                3723
            ],
            [
                3724,
                3788
            ],
            [
                3789,
                3808
            ],
            [
                3817,
                3858
            ],
            [
                3859,
                3915
            ],
            [
                3916,
                3944
            ],
            [
                3945,
                3948
            ],
            [
                3949,
                3952
            ],
            [
                3953,
                3976
            ],
            [
                3978,
                3985
            ],
            [
                3994,
                3999
            ],
            [
                4000,
                4115
            ],
            [
                4115,
                4116
            ],
            [
                4117,
                4143
            ],
            [
                4144,
                4219
            ],
            [
                4220,
                4231
            ],
            [
                4232,
                4252
            ],
            [
                4252,
                4260
            ],
            [
                4261,
                4270
            ],
            [
                4270,
                4366
            ],
            [
                4374,
                4379
            ],
            [
                4379,
                4440
            ],
            [
                4440,
                4489
            ],
            [
                4490,
                4512
            ],
            [
                4512,
                4513
            ],
            [
                4514,
                4517
            ],
            [
                4522,
                4603
            ],
            [
                4603,
                4605
            ],
            [
                4605,
                4675
            ],
            [
                4676,
                4681
            ],
            [
                4682,
                4695
            ],
            [
                4700,
                4709
            ],
            [
                4709,
                4830
            ],
            [
                4830,
                4832
            ],
            [
                4839,
                4852
            ],
            [
                4853,
                4876
            ],
            [
                4877,
                4888
            ],
            [
                4889,
                4912
            ],
            [
                4913,
                4936
            ],
            [
                4942,
                4947
            ],
            [
                4948,
                4960
            ],
            [
                4960,
                4962
            ],
            [
                4962,
                4970
            ],
            [
                4971,
                4973
            ],
            [
                4978,
                5047
            ],
            [
                5047,
                5049
            ],
            [
                5049,
                5080
            ],
            [
                5081,
                5148
            ],
            [
                5148,
                5248
            ],
            [
                5256,
                5273
            ],
            [
                5282,
                5295
            ],
            [
                5295,
                5297
            ],
            [
                5297,
                5365
            ],
            [
                5367,
                5369
            ],
            [
                5378,
                5391
            ],
            [
                5392,
                5394
            ],
            [
                5395,
                5417
            ],
            [
                5426,
                5454
            ],
            [
                5454,
                5511
            ],
            [
                5512,
                5516
            ],
            [
                5531,
                5592
            ],
            [
                5598,
                5641
            ],
            [
                5641,
                5661
            ],
            [
                5672,
                5708
            ],
            [
                5708,
                5745
            ],
            [
                5750,
                5783
            ],
            [
                5784,
                5817
            ],
            [
                5817,
                5828
            ],
            [
                5829,
                5832
            ],
            [
                5833,
                5840
            ],
            [
                5840,
                5896
            ],
            [
                5896,
                5897
            ],
            [
                5898,
                5903
            ],
            [
                5904,
                5906
            ],
            [
                5907,
                5913
            ],
            [
                5914,
                5920
            ],
            [
                5921,
                5924
            ],
            [
                5932,
                5994
            ],
            [
                5995,
                5998
            ],
            [
                5999,
                6005
            ],
            [
                6008,
                6013
            ],
            [
                6029,
                6082
            ],
            [
                6084,
                6133
            ],
            [
                6145,
                6215
            ],
            [
                6219,
                6221
            ],
            [
                6221,
                6246
            ],
            [
                6246,
                6247
            ],
            [
                6248,
                6259
            ],
            [
                6265,
                6294
            ],
            [
                6294,
                6296
            ],
            [
                6296,
                6345
            ],
            [
                6354,
                6377
            ],
            [
                6378,
                6381
            ],
            [
                6386,
                6398
            ],
            [
                6398,
                6453
            ],
            [
                6454,
                6479
            ],
            [
                6479,
                6500
            ],
            [
                6505,
                6536
            ],
            [
                6537,
                6584
            ],
            [
                6585,
                6600
            ],
            [
                6605,
                6615
            ],
            [
                6623,
                6688
            ],
            [
                6689,
                6760
            ],
            [
                6760,
                6789
            ],
            [
                6800,
                6803
            ],
            [
                6803,
                6805
            ],
            [
                6805,
                6847
            ],
            [
                6848,
                6930
            ],
            [
                6934,
                6972
            ],
            [
                6972,
                7164
            ],
            [
                7165,
                7222
            ],
            [
                7225,
                7240
            ],
            [
                7242,
                7333
            ],
            [
                7333,
                7362
            ],
            [
                7363,
                7395
            ],
            [
                7395,
                7405
            ],
            [
                7407,
                7459
            ],
            [
                7466,
                7468
            ],
            [
                7476,
                7499
            ],
            [
                7500,
                7506
            ],
            [
                7520,
                7524
            ],
            [
                7524,
                7526
            ],
            [
                7526,
                7609
            ],
            [
                7610,
                7649
            ],
            [
                7649,
                7671
            ],
            [
                7672,
                7691
            ],
            [
                7692,
                7749
            ],
            [
                7753,
                7758
            ],
            [
                7765,
                7768
            ],
            [
                7774,
                7788
            ],
            [
                7788,
                7789
            ],
            [
                7790,
                7796
            ],
            [
                7797,
                7836
            ],
            [
                7839,
                7900
            ],
            [
                7911,
                7925
            ],
            [
                7936,
                7937
            ],
            [
                7942,
                8008
            ],
            [
                8008,
                8010
            ],
            [
                8010,
                8045
            ],
            [
                8046,
                8075
            ],
            [
                8075,
                8077
            ],
            [
                8077,
                8122
            ],
            [
                8125,
                8139
            ],
            [
                8140,
                8161
            ],
            [
                8162,
                8192
            ],
            [
                8192,
                8223
            ],
            [
                8227,
                8269
            ],
            [
                8269,
                8272
            ],
            [
                8273,
                8323
            ],
            [
                8324,
                8351
            ],
            [
                8352,
                8385
            ],
            [
                8386,
                8400
            ],
            [
                8400,
                8451
            ],
            [
                8451,
                8471
            ],
            [
                8471,
                8489
            ],
            [
                8489,
                8514
            ],
            [
                8515,
                8525
            ],
            [
                8525,
                8576
            ],
            [
                8576,
                8643
            ],
            [
                8643,
                8701
            ],
            [
                8706,
                8740
            ],
            [
                8740,
                8741
            ],
            [
                8746,
                8750
            ],
            [
                8750,
                8751
            ],
            [
                8752,
                8762
            ],
            [
                8762,
                8763
            ],
            [
                8764,
                8819
            ],
            [
                8819,
                8836
            ],
            [
                8836,
                8853
            ],
            [
                8853,
                8919
            ],
            [
                8919,
                8986
            ],
            [
                8986,
                9020
            ],
            [
                9020,
                9030
            ],
            [
                9030,
                9081
            ],
            [
                9091,
                9093
            ],
            [
                9093,
                9164
            ],
            [
                9164,
                9193
            ],
            [
                9198,
                9223
            ],
            [
                9223,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9292
            ],
            [
                9293,
                9303
            ],
            [
                9311,
                9392
            ],
            [
                9393,
                9411
            ],
            [
                9411,
                9448
            ],
            [
                9452,
                9478
            ],
            [
                9478,
                9480
            ],
            [
                9480,
                9490
            ],
            [
                9491,
                9506
            ],
            [
                9512,
                9552
            ],
            [
                9552,
                9629
            ],
            [
                9629,
                9683
            ],
            [
                9684,
                9804
            ],
            [
                9804,
                9861
            ],
            [
                9861,
                9871
            ],
            [
                9879,
                9926
            ],
            [
                9927,
                9933
            ],
            [
                9934,
                9952
            ],
            [
                9952,
                9954
            ],
            [
                9954,
                9987
            ],
            [
                9987,
                10020
            ],
            [
                10021,
                10064
            ],
            [
                10064,
                10142
            ],
            [
                10144,
                10280
            ],
            [
                10280,
                10287
            ],
            [
                10287,
                10298
            ],
            [
                10298,
                10326
            ],
            [
                10326,
                10327
            ],
            [
                10327,
                10419
            ],
            [
                10420,
                10461
            ],
            [
                10469,
                10492
            ],
            [
                10495,
                10531
            ],
            [
                10534,
                10734
            ],
            [
                10734,
                10763
            ],
            [
                10766,
                10791
            ],
            [
                10791,
                10800
            ],
            [
                10800,
                10803
            ],
            [
                10803,
                10836
            ],
            [
                10838,
                10915
            ],
            [
                10915,
                10917
            ],
            [
                10917,
                10934
            ],
            [
                10945,
                10947
            ],
            [
                10951,
                10953
            ],
            [
                10961,
                10966
            ],
            [
                10971,
                11020
            ],
            [
                11021,
                11031
            ],
            [
                11032,
                11061
            ],
            [
                11062,
                11065
            ],
            [
                11066,
                11071
            ],
            [
                11071,
                11073
            ],
            [
                11073,
                11181
            ],
            [
                11182,
                11208
            ],
            [
                11209,
                11315
            ],
            [
                11317,
                11320
            ],
            [
                11321,
                11369
            ],
            [
                11370,
                11377
            ],
            [
                11377,
                11412
            ],
            [
                11412,
                11414
            ],
            [
                11414,
                11481
            ],
            [
                11481,
                11503
            ],
            [
                11503,
                11543
            ],
            [
                11543,
                11548
            ],
            [
                11548,
                11572
            ],
            [
                11572,
                11609
            ],
            [
                11609,
                11611
            ],
            [
                11611,
                11693
            ],
            [
                11700,
                11702
            ],
            [
                11702,
                11710
            ],
            [
                11714,
                11717
            ],
            [
                11725,
                11736
            ],
            [
                11737,
                11740
            ],
            [
                11741,
                11753
            ],
            [
                11754,
                11772
            ],
            [
                11779,
                11781
            ],
            [
                11781,
                11839
            ],
            [
                11847,
                11908
            ],
            [
                11908,
                11964
            ],
            [
                11964,
                11998
            ]
        ],
        "row_chars": [
            [
                0,
                390
            ],
            [
                390,
                492
            ],
            [
                492,
                586
            ],
            [
                586,
                796
            ],
            [
                796,
                860
            ],
            [
                860,
                878
            ],
            [
                878,
                878
            ],
            [
                878,
                894
            ],
            [
                894,
                904
            ],
            [
                904,
                972
            ],
            [
                972,
                1152
            ],
            [
                1152,
                1212
            ],
            [
                1212,
                1247
            ],
            [
                1247,
                1261
            ],
            [
                1261,
                1340
            ],
            [
                1340,
                1417
            ],
            [
                1417,
                1569
            ],
            [
                1569,
                1589
            ],
            [
                1589,
                1628
            ],
            [
                1628,
                1729
            ],
            [
                1729,
                1780
            ],
            [
                1780,
                1794
            ],
            [
                1794,
                1806
            ],
            [
                1806,
                1806
            ],
            [
                1806,
                1806
            ],
            [
                1806,
                1845
            ],
            [
                1845,
                1872
            ],
            [
                1872,
                1881
            ],
            [
                1881,
                1934
            ],
            [
                1934,
                1958
            ],
            [
                1958,
                2010
            ],
            [
                2010,
                2127
            ],
            [
                2127,
                2179
            ],
            [
                2179,
                2220
            ],
            [
                2220,
                2305
            ],
            [
                2305,
                2449
            ],
            [
                2449,
                2505
            ],
            [
                2505,
                2621
            ],
            [
                2621,
                2690
            ],
            [
                2690,
                2704
            ],
            [
                2704,
                2723
            ],
            [
                2723,
                2746
            ],
            [
                2746,
                2784
            ],
            [
                2784,
                2784
            ],
            [
                2784,
                2784
            ],
            [
                2784,
                2784
            ],
            [
                2784,
                2856
            ],
            [
                2856,
                2941
            ],
            [
                2941,
                3031
            ],
            [
                3031,
                3406
            ],
            [
                3406,
                3406
            ],
            [
                3406,
                3406
            ],
            [
                3406,
                3406
            ],
            [
                3406,
                3406
            ],
            [
                3406,
                3571
            ],
            [
                3571,
                3628
            ],
            [
                3628,
                3635
            ],
            [
                3635,
                3916
            ],
            [
                3916,
                4252
            ],
            [
                4252,
                4270
            ],
            [
                4270,
                4379
            ],
            [
                4379,
                4440
            ],
            [
                4440,
                4605
            ],
            [
                4605,
                4709
            ],
            [
                4709,
                4832
            ],
            [
                4832,
                4962
            ],
            [
                4962,
                5049
            ],
            [
                5049,
                5148
            ],
            [
                5148,
                5297
            ],
            [
                5297,
                5454
            ],
            [
                5454,
                5641
            ],
            [
                5641,
                5708
            ],
            [
                5708,
                5817
            ],
            [
                5817,
                6029
            ],
            [
                6029,
                6221
            ],
            [
                6221,
                6296
            ],
            [
                6296,
                6479
            ],
            [
                6479,
                6585
            ],
            [
                6585,
                6760
            ],
            [
                6760,
                6805
            ],
            [
                6805,
                6930
            ],
            [
                6930,
                6972
            ],
            [
                6972,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7165
            ],
            [
                7165,
                7333
            ],
            [
                7333,
                7363
            ],
            [
                7363,
                7395
            ],
            [
                7395,
                7526
            ],
            [
                7526,
                7610
            ],
            [
                7610,
                7649
            ],
            [
                7649,
                7692
            ],
            [
                7692,
                7749
            ],
            [
                7749,
                7749
            ],
            [
                7749,
                7839
            ],
            [
                7839,
                8010
            ],
            [
                8010,
                8077
            ],
            [
                8077,
                8192
            ],
            [
                8192,
                8269
            ],
            [
                8269,
                8386
            ],
            [
                8386,
                8400
            ],
            [
                8400,
                8451
            ],
            [
                8451,
                8471
            ],
            [
                8471,
                8525
            ],
            [
                8525,
                8576
            ],
            [
                8576,
                8643
            ],
            [
                8643,
                8702
            ],
            [
                8702,
                8764
            ],
            [
                8764,
                8819
            ],
            [
                8819,
                8836
            ],
            [
                8836,
                8853
            ],
            [
                8853,
                8919
            ],
            [
                8919,
                8986
            ],
            [
                8986,
                9020
            ],
            [
                9020,
                9030
            ],
            [
                9030,
                9093
            ],
            [
                9093,
                9164
            ],
            [
                9164,
                9223
            ],
            [
                9223,
                9247
            ],
            [
                9247,
                9282
            ],
            [
                9282,
                9293
            ],
            [
                9293,
                9411
            ],
            [
                9411,
                9411
            ],
            [
                9411,
                9448
            ],
            [
                9448,
                9480
            ],
            [
                9480,
                9552
            ],
            [
                9552,
                9804
            ],
            [
                9804,
                9861
            ],
            [
                9861,
                9927
            ],
            [
                9927,
                9954
            ],
            [
                9954,
                9987
            ],
            [
                9987,
                10064
            ],
            [
                10064,
                10280
            ],
            [
                10280,
                10287
            ],
            [
                10287,
                10298
            ],
            [
                10298,
                10326
            ],
            [
                10326,
                10734
            ],
            [
                10734,
                10791
            ],
            [
                10791,
                10803
            ],
            [
                10803,
                10917
            ],
            [
                10917,
                11073
            ],
            [
                11073,
                11370
            ],
            [
                11370,
                11414
            ],
            [
                11414,
                11481
            ],
            [
                11481,
                11503
            ],
            [
                11503,
                11543
            ],
            [
                11543,
                11548
            ],
            [
                11548,
                11572
            ],
            [
                11572,
                11611
            ],
            [
                11611,
                11702
            ],
            [
                11702,
                11781
            ],
            [
                11781,
                11908
            ],
            [
                11908,
                11964
            ],
            [
                11964,
                11998
            ]
        ]
    }
}