{
    "original": {
        "text": "The kind reader must please to remember--while the army is marching from Flanders, and, after its heroic actions there, is advancing to take the fortifications on the frontiers of France, previous to an occupation of that country--that there are a number of persons living peaceably in England who have to do with the history at present in hand, and must come in for their share of the chronicle. During the time of these battles and dangers, old Miss Crawley was living at Brighton, very moderately moved by the great events that were going on. The great events rendered the newspapers rather interesting, to be sure, and Briggs read out the Gazette, in which Rawdon Crawley's gallantry was mentioned with honour, and his promotion was presently recorded.\n\"What a pity that young man has taken such an irretrievable step in the world!\" his aunt said; \"with his rank and distinction he might have married a brewer's daughter with a quarter of a million--like Miss Grains; or have looked to ally himself with the best families in England. He would have had my money some day or other; or his children would--for I'm not in a hurry to go, Miss Briggs, although you may be in a hurry to be rid of me; and instead of that, he is a doomed pauper, with a dancing-girl for a wife.\"\n\"Will my dear Miss Crawley not cast an eye of compassion upon the heroic soldier, whose name is inscribed in the annals of his country's glory?\" said Miss Briggs, who was greatly excited by the Waterloo proceedings, and loved speaking romantically when there was an occasion. \"Has not the Captain--or the Colonel as I may now style him--done deeds which make the name of Crawley illustrious?\"\n\"Briggs, you are a fool,\" said Miss Crawley: \"Colonel Crawley has dragged the name of Crawley through the mud, Miss Briggs. Marry a drawing-master's daughter, indeed!--marry a dame de compagnie--for she was no better, Briggs; no, she was just what you are--only younger, and a great deal prettier and cleverer. Were you an accomplice of that abandoned wretch, I wonder, of whose vile arts he became a victim, and of whom you used to be such an admirer? Yes, I daresay you were an accomplice. But you will find yourself disappointed in my will, I can tell you: and you will have the goodness to write to Mr. Waxy, and say that I desire to see him immediately.\" Miss Crawley was now in the habit of writing to Mr. Waxy her solicitor almost every day in the week, for her arrangements respecting her property were all revoked, and her perplexity was great as to the future disposition of her money.\nThe spinster had, however, rallied considerably; as was proved by the increased vigour and frequency of her sarcasms upon Miss Briggs, all which attacks the poor companion bore with meekness, with cowardice, with a resignation that was half generous and half hypocritical--with the slavish submission, in a word, that women of her disposition and station are compelled to show. Who has not seen how women bully women? What tortures have men to endure, comparable to those daily repeated shafts of scorn and cruelty with which poor women are riddled by the tyrants of their sex? Poor victims! But we are starting from our proposition, which is, that Miss Crawley was always particularly annoying and savage when she was rallying from illness--as they say wounds tingle most when they are about to heal.\nWhile thus approaching, as all hoped, to convalescence, Miss Briggs was the only victim admitted into the presence of the invalid; yet Miss Crawley's relatives afar off did not forget their beloved kinswoman, and by a number of tokens, presents, and kind affectionate messages, strove to keep themselves alive in her recollection.\nIn the first place, let us mention her nephew, Rawdon Crawley. A few weeks after the famous fight of Waterloo, and after the Gazette had made known to her the promotion and gallantry of that distinguished officer, the Dieppe packet brought over to Miss Crawley at Brighton, a box containing presents, and a dutiful letter, from the Colonel her nephew. In the box were a pair of French epaulets, a Cross of the Legion of Honour, and the hilt of a sword--relics from the field of battle: and the letter described with a good deal of humour how the latter belonged to a commanding officer of the Guard, who having sworn that \"the Guard died, but never surrendered,\" was taken prisoner the next minute by a private soldier, who broke the Frenchman's sword with the butt of his musket, when Rawdon made himself master of the shattered weapon. As for the cross and epaulets, they came from a Colonel of French cavalry, who had fallen under the aide-de-camp's arm in the battle: and Rawdon Crawley did not know what better to do with the spoils than to send them to his kindest and most affectionate old friend. Should he continue to write to her from Paris, whither the army was marching? He might be able to give her interesting news from that capital, and of some of Miss Crawley's old friends of the emigration, to whom she had shown so much kindness during their distress.\nThe spinster caused Briggs to write back to the Colonel a gracious and complimentary letter, encouraging him to continue his correspondence. His first letter was so excessively lively and amusing that she should look with pleasure for its successors.--\"Of course, I know,\" she explained to Miss Briggs, \"that Rawdon could not write such a good letter any more than you could, my poor Briggs, and that it is that clever little wretch of a Rebecca, who dictates every word to him; but that is no reason why my nephew should not amuse me; and so I wish to let him understand that I am in high good humour.\"\nI wonder whether she knew that it was not only Becky who wrote the letters, but that Mrs. Rawdon actually took and sent home the trophies which she bought for a few francs, from one of the innumerable pedlars who immediately began to deal in relics of the war. The novelist, who knows everything, knows this also. Be this, however, as it may, Miss Crawley's gracious reply greatly encouraged our young friends, Rawdon and his lady, who hoped for the best from their aunt's evidently pacified humour: and they took care to entertain her with many delightful letters from Paris, whither, as Rawdon said, they had the good luck to go in the track of the conquering army.\nTo the rector's lady, who went off to tend her husband's broken collar-bone at the Rectory at Queen's Crawley, the spinster's communications were by no means so gracious. Mrs. Bute, that brisk, managing, lively, imperious woman, had committed the most fatal of all errors with regard to her sister-in-law. She had not merely oppressed her and her household--she had bored Miss Crawley; and if poor Miss Briggs had been a woman of any spirit, she might have been made happy by the commission which her principal gave her to write a letter to Mrs. Bute Crawley, saying that Miss Crawley's health was greatly improved since Mrs. Bute had left her, and begging the latter on no account to put herself to trouble, or quit her family for Miss Crawley's sake. This triumph over a lady who had been very haughty and cruel in her behaviour to Miss Briggs, would have rejoiced most women; but the truth is, Briggs was a woman of no spirit at all, and the moment her enemy was discomfited, she began to feel compassion in her favour.\n\"How silly I was,\" Mrs. Bute thought, and with reason, \"ever to hint that I was coming, as I did, in that foolish letter when we sent Miss Crawley the guinea-fowls. I ought to have gone without a word to the poor dear doting old creature, and taken her out of the hands of that ninny Briggs, and that harpy of a femme de chambre. Oh! Bute, Bute, why did you break your collar-bone?\"\nWhy, indeed? We have seen how Mrs. Bute, having the game in her hands, had really played her cards too well. She had ruled over Miss Crawley's household utterly and completely, to be utterly and completely routed when a favourable opportunity for rebellion came. She and her household, however, considered that she had been the victim of horrible selfishness and treason, and that her sacrifices in Miss Crawley's behalf had met with the most savage ingratitude. Rawdon's promotion, and the honourable mention made of his name in the Gazette, filled this good Christian lady also with alarm. Would his aunt relent towards him now that he was a Lieutenant-Colonel and a C.B.? and would that odious Rebecca once more get into favour? The Rector's wife wrote a sermon for her husband about the vanity of military glory and the prosperity of the wicked, which the worthy parson read in his best voice and without understanding one syllable of it. He had Pitt Crawley for one of his auditors--Pitt, who had come with his two half-sisters to church, which the old Baronet could now by no means be brought to frequent.\nSince the departure of Becky Sharp, that old wretch had given himself up entirely to his bad courses, to the great scandal of the county and the mute horror of his son. The ribbons in Miss Horrocks's cap became more splendid than ever. The polite families fled the hall and its owner in terror. Sir Pitt went about tippling at his tenants' houses; and drank rum-and-water with the farmers at Mudbury and the neighbouring places on market-days. He drove the family coach-and-four to Southampton with Miss Horrocks inside: and the county people expected, every week, as his son did in speechless agony, that his marriage with her would be announced in the provincial paper. It was indeed a rude burthen for Mr. Crawley to bear. His eloquence was palsied at the missionary meetings, and other religious assemblies in the neighbourhood, where he had been in the habit of presiding, and of speaking for hours; for he felt, when he rose, that the audience said, \"That is the son of the old reprobate Sir Pitt, who is very likely drinking at the public house at this very moment.\" And once when he was speaking of the benighted condition of the king of Timbuctoo, and the number of his wives who were likewise in darkness, some gipsy miscreant from the crowd asked, \"How many is there at Queen's Crawley, Young Squaretoes?\" to the surprise of the platform, and the ruin of Mr. Pitt's speech. And the two daughters of the house of Queen's Crawley would have been allowed to run utterly wild (for Sir Pitt swore that no governess should ever enter into his doors again), had not Mr. Crawley, by threatening the old gentleman, forced the latter to send them to school.\nMeanwhile, as we have said, whatever individual differences there might be between them all, Miss Crawley's dear nephews and nieces were unanimous in loving her and sending her tokens of affection. Thus Mrs. Bute sent guinea-fowls, and some remarkably fine cauliflowers, and a pretty purse or pincushion worked by her darling girls, who begged to keep a LITTLE place in the recollection of their dear aunt, while Mr. Pitt sent peaches and grapes and venison from the Hall. The Southampton coach used to carry these tokens of affection to Miss Crawley at Brighton: it used sometimes to convey Mr. Pitt thither too: for his differences with Sir Pitt caused Mr. Crawley to absent himself a good deal from home now: and besides, he had an attraction at Brighton in the person of the Lady Jane Sheepshanks, whose engagement to Mr. Crawley has been formerly mentioned in this history. Her Ladyship and her sisters lived at Brighton with their mamma, the Countess Southdown, that strong-minded woman so favourably known in the serious world.\nA few words ought to be said regarding her Ladyship and her noble family, who are bound by ties of present and future relationship to the house of Crawley. Respecting the chief of the Southdown family, Clement William, fourth Earl of Southdown, little need be told, except that his Lordship came into Parliament (as Lord Wolsey) under the auspices of Mr. Wilberforce, and for a time was a credit to his political sponsor, and decidedly a serious young man. But words cannot describe the feelings of his admirable mother, when she learned, very shortly after her noble husband's demise, that her son was a member of several worldly clubs, had lost largely at play at Wattier's and the Cocoa Tree; that he had raised money on post-obits, and encumbered the family estate; that he drove four-in-hand, and patronised the ring; and that he actually had an opera-box, where he entertained the most dangerous bachelor company. His name was only mentioned with groans in the dowager's circle.\nThe Lady Emily was her brother's senior by many years; and took considerable rank in the serious world as author of some of the delightful tracts before mentioned, and of many hymns and spiritual pieces. A mature spinster, and having but faint ideas of marriage, her love for the blacks occupied almost all her feelings. It is to her, I believe, we owe that beautiful poem.\nLead us to some sunny isle, Yonder in the western deep; Where the skies for ever smile, And the blacks for ever weep, &c.\nShe had correspondences with clerical gentlemen in most of our East and West India possessions; and was secretly attached to the Reverend Silas Hornblower, who was tattooed in the South Sea Islands.\nAs for the Lady Jane, on whom, as it has been said, Mr. Pitt Crawley's affection had been placed, she was gentle, blushing, silent, and timid. In spite of his falling away, she wept for her brother, and was quite ashamed of loving him still. Even yet she used to send him little hurried smuggled notes, and pop them into the post in private. The one dreadful secret which weighed upon her life was, that she and the old housekeeper had been to pay Southdown a furtive visit at his chambers in the Albany; and found him--O the naughty dear abandoned wretch!--smoking a cigar with a bottle of Curacao before him. She admired her sister, she adored her mother, she thought Mr. Crawley the most delightful and accomplished of men, after Southdown, that fallen angel: and her mamma and sister, who were ladies of the most superior sort, managed everything for her, and regarded her with that amiable pity, of which your really superior woman always has such a share to give away. Her mamma ordered her dresses, her books, her bonnets, and her ideas for her. She was made to take pony-riding, or piano-exercise, or any other sort of bodily medicament, according as my Lady Southdown saw meet; and her ladyship would have kept her daughter in pinafores up to her present age of six-and-twenty, but that they were thrown off when Lady Jane was presented to Queen Charlotte.\nWhen these ladies first came to their house at Brighton, it was to them alone that Mr. Crawley paid his personal visits, contenting himself by leaving a card at his aunt's house, and making a modest inquiry of Mr. Bowls or his assistant footman, with respect to the health of the invalid. When he met Miss Briggs coming home from the library with a cargo of novels under her arm, Mr. Crawley blushed in a manner quite unusual to him, as he stepped forward and shook Miss Crawley's companion by the hand. He introduced Miss Briggs to the lady with whom he happened to be walking, the Lady Jane Sheepshanks, saying, \"Lady Jane, permit me to introduce to you my aunt's kindest friend and most affectionate companion, Miss Briggs, whom you know under another title, as authoress of the delightful 'Lyrics of the Heart,' of which you are so fond.\" Lady Jane blushed too as she held out a kind little hand to Miss Briggs, and said something very civil and incoherent about mamma, and proposing to call on Miss Crawley, and being glad to be made known to the friends and relatives of Mr. Crawley; and with soft dove-like eyes saluted Miss Briggs as they separated, while Pitt Crawley treated her to a profound courtly bow, such as he had used to H.H. the Duchess of Pumpernickel, when he was attache at that court.\nThe artful diplomatist and disciple of the Machiavellian Binkie! It was he who had given Lady Jane that copy of poor Briggs's early poems, which he remembered to have seen at Queen's Crawley, with a dedication from the poetess to his father's late wife; and he brought the volume with him to Brighton, reading it in the Southampton coach and marking it with his own pencil, before he presented it to the gentle Lady Jane.\nIt was he, too, who laid before Lady Southdown the great advantages which might occur from an intimacy between her family and Miss Crawley--advantages both worldly and spiritual, he said: for Miss Crawley was now quite alone; the monstrous dissipation and alliance of his brother Rawdon had estranged her affections from that reprobate young man; the greedy tyranny and avarice of Mrs. Bute Crawley had caused the old lady to revolt against the exorbitant pretensions of that part of the family; and though he himself had held off all his life from cultivating Miss Crawley's friendship, with perhaps an improper pride, he thought now that every becoming means should be taken, both to save her soul from perdition, and to secure her fortune to himself as the head of the house of Crawley.\nThe strong-minded Lady Southdown quite agreed in both proposals of her son-in-law, and was for converting Miss Crawley off-hand. At her own home, both at Southdown and at Trottermore Castle, this tall and awful missionary of the truth rode about the country in her barouche with outriders, launched packets of tracts among the cottagers and tenants, and would order Gaffer Jones to be converted, as she would order Goody Hicks to take a James's powder, without appeal, resistance, or benefit of clergy. My Lord Southdown, her late husband, an epileptic and simple-minded nobleman, was in the habit of approving of everything which his Matilda did and thought. So that whatever changes her own belief might undergo (and it accommodated itself to a prodigious variety of opinion, taken from all sorts of doctors among the Dissenters) she had not the least scruple in ordering all her tenants and inferiors to follow and believe after her. Thus whether she received the Reverend Saunders McNitre, the Scotch divine; or the Reverend Luke Waters, the mild Wesleyan; or the Reverend Giles Jowls, the illuminated Cobbler, who dubbed himself Reverend as Napoleon crowned himself Emperor--the household, children, tenantry of my Lady Southdown were expected to go down on their knees with her Ladyship, and say Amen to the prayers of either Doctor. During these exercises old Southdown, on account of his invalid condition, was allowed to sit in his own room, and have negus and the paper read to him. Lady Jane was the old Earl's favourite daughter, and tended him and loved him sincerely: as for Lady Emily, the authoress of the \"Washerwoman of Finchley Common,\" her denunciations of future punishment (at this period, for her opinions modified afterwards) were so awful that they used to frighten the timid old gentleman her father, and the physicians declared his fits always occurred after one of her Ladyship's sermons.\n\"I will certainly call,\" said Lady Southdown then, in reply to the exhortation of her daughter's pretendu, Mr. Pitt Crawley--\"Who is Miss Crawley's medical man?\"\nMr. Crawley mentioned the name of Mr. Creamer.\n\"A most dangerous and ignorant practitioner, my dear Pitt. I have providentially been the means of removing him from several houses: though in one or two instances I did not arrive in time. I could not save poor dear General Glanders, who was dying under the hands of that ignorant man--dying. He rallied a little under the Podgers' pills which I administered to him; but alas! it was too late. His death was delightful, however; and his change was only for the better; Creamer, my dear Pitt, must leave your aunt.\"\nPitt expressed his perfect acquiescence. He, too, had been carried along by the energy of his noble kinswoman, and future mother-in-law. He had been made to accept Saunders McNitre, Luke Waters, Giles Jowls, Podgers' Pills, Rodgers' Pills, Pokey's Elixir, every one of her Ladyship's remedies spiritual or temporal. He never left her house without carrying respectfully away with him piles of her quack theology and medicine. O, my dear brethren and fellow-sojourners in Vanity Fair, which among you does not know and suffer under such benevolent despots? It is in vain you say to them, \"Dear Madam, I took Podgers' specific at your orders last year, and believe in it. Why, why am I to recant and accept the Rodgers' articles now?\" There is no help for it; the faithful proselytizer, if she cannot convince by argument, bursts into tears, and the refusant finds himself, at the end of the contest, taking down the bolus, and saying, \"Well, well, Rodgers' be it.\"\n\"And as for her spiritual state,\" continued the Lady, \"that of course must be looked to immediately: with Creamer about her, she may go off any day: and in what a condition, my dear Pitt, in what a dreadful condition! I will send the Reverend Mr. Irons to her instantly. Jane, write a line to the Reverend Bartholomew Irons, in the third person, and say that I desire the pleasure of his company this evening at tea at half-past six. He is an awakening man; he ought to see Miss Crawley before she rests this night. And Emily, my love, get ready a packet of books for Miss Crawley. Put up 'A Voice from the Flames,' 'A Trumpet-warning to Jericho,' and the 'Fleshpots Broken; or, the Converted Cannibal.'\"\n\"And the 'Washerwoman of Finchley Common,' Mamma,\" said Lady Emily. \"It is as well to begin soothingly at first.\"\n\"Stop, my dear ladies,\" said Pitt, the diplomatist. \"With every deference to the opinion of my beloved and respected Lady Southdown, I think it would be quite unadvisable to commence so early upon serious topics with Miss Crawley. Remember her delicate condition, and how little, how very little accustomed she has hitherto been to considerations connected with her immortal welfare.\"\n\"Can we then begin too early, Pitt?\" said Lady Emily, rising with six little books already in her hand.\n\"If you begin abruptly, you will frighten her altogether. I know my aunt's worldly nature so well as to be sure that any abrupt attempt at conversion will be the very worst means that can be employed for the welfare of that unfortunate lady. You will only frighten and annoy her. She will very likely fling the books away, and refuse all acquaintance with the givers.\"\n\"You are as worldly as Miss Crawley, Pitt,\" said Lady Emily, tossing out of the room, her books in her hand.\n\"And I need not tell you, my dear Lady Southdown,\" Pitt continued, in a low voice, and without heeding the interruption, \"how fatal a little want of gentleness and caution may be to any hopes which we may entertain with regard to the worldly possessions of my aunt. Remember she has seventy thousand pounds; think of her age, and her highly nervous and delicate condition; I know that she has destroyed the will which was made in my brother's (Colonel Crawley's) favour: it is by soothing that wounded spirit that we must lead it into the right path, and not by frightening it; and so I think you will agree with me that--that--'\n\"Of course, of course,\" Lady Southdown remarked. \"Jane, my love, you need not send that note to Mr. Irons. If her health is such that discussions fatigue her, we will wait her amendment. I will call upon Miss Crawley tomorrow.\"\n\"And if I might suggest, my sweet lady,\" Pitt said in a bland tone, \"it would be as well not to take our precious Emily, who is too enthusiastic; but rather that you should be accompanied by our sweet and dear Lady Jane.\"\n\"Most certainly, Emily would ruin everything,\" Lady Southdown said; and this time agreed to forego her usual practice, which was, as we have said, before she bore down personally upon any individual whom she proposed to subjugate, to fire in a quantity of tracts upon the menaced party (as a charge of the French was always preceded by a furious cannonade). Lady Southdown, we say, for the sake of the invalid's health, or for the sake of her soul's ultimate welfare, or for the sake of her money, agreed to temporise.\nThe next day, the great Southdown female family carriage, with the Earl's coronet and the lozenge (upon which the three lambs trottant argent upon the field vert of the Southdowns, were quartered with sable on a bend or, three snuff-mulls gules, the cognizance of the house of Binkie), drove up in state to Miss Crawley's door, and the tall serious footman handed in to Mr. Bowls her Ladyship's cards for Miss Crawley, and one likewise for Miss Briggs. By way of compromise, Lady Emily sent in a packet in the evening for the latter lady, containing copies of the \"Washerwoman,\" and other mild and favourite tracts for Miss B.'s own perusal; and a few for the servants' hall, viz.: \"Crumbs from the Pantry,\" \"The Frying Pan and the Fire,\" and \"The Livery of Sin,\" of a much stronger kind.",
        "paragraph_chars": [
            [
                0,
                757
            ],
            [
                757,
                1275
            ],
            [
                1275,
                1668
            ],
            [
                1668,
                2564
            ],
            [
                2564,
                3366
            ],
            [
                3366,
                3697
            ],
            [
                3697,
                5068
            ],
            [
                5068,
                5672
            ],
            [
                5672,
                6340
            ],
            [
                6340,
                7363
            ],
            [
                7363,
                7746
            ],
            [
                7746,
                8858
            ],
            [
                8858,
                10517
            ],
            [
                10517,
                11552
            ],
            [
                11552,
                12537
            ],
            [
                12537,
                12911
            ],
            [
                12911,
                13033
            ],
            [
                13033,
                13232
            ],
            [
                13232,
                14598
            ],
            [
                14598,
                15906
            ],
            [
                15906,
                16328
            ],
            [
                16328,
                17118
            ],
            [
                17118,
                19035
            ],
            [
                19035,
                19197
            ],
            [
                19197,
                19244
            ],
            [
                19244,
                19760
            ],
            [
                19760,
                20724
            ],
            [
                20724,
                21429
            ],
            [
                21429,
                21543
            ],
            [
                21543,
                21928
            ],
            [
                21928,
                22032
            ],
            [
                22032,
                22401
            ],
            [
                22401,
                22510
            ],
            [
                22510,
                23140
            ],
            [
                23140,
                23368
            ],
            [
                23368,
                23590
            ],
            [
                23590,
                24109
            ],
            [
                24109,
                24897
            ]
        ],
        "segment_chars": [
            [
                0,
                397
            ],
            [
                397,
                546
            ],
            [
                546,
                757
            ],
            [
                757,
                837
            ],
            [
                837,
                1038
            ],
            [
                1038,
                1275
            ],
            [
                1275,
                1420
            ],
            [
                1420,
                1551
            ],
            [
                1551,
                1668
            ],
            [
                1668,
                1792
            ],
            [
                1792,
                1979
            ],
            [
                1979,
                2121
            ],
            [
                2121,
                2160
            ],
            [
                2160,
                2328
            ],
            [
                2328,
                2564
            ],
            [
                2564,
                2942
            ],
            [
                2942,
                2982
            ],
            [
                2982,
                3142
            ],
            [
                3142,
                3156
            ],
            [
                3156,
                3366
            ],
            [
                3366,
                3697
            ],
            [
                3697,
                3760
            ],
            [
                3760,
                4049
            ],
            [
                4049,
                4535
            ],
            [
                4535,
                4802
            ],
            [
                4802,
                4880
            ],
            [
                4880,
                5068
            ],
            [
                5068,
                5209
            ],
            [
                5209,
                5672
            ],
            [
                5672,
                5933
            ],
            [
                5933,
                5986
            ],
            [
                5986,
                6340
            ],
            [
                6340,
                6511
            ],
            [
                6511,
                6646
            ],
            [
                6646,
                7093
            ],
            [
                7093,
                7363
            ],
            [
                7363,
                7528
            ],
            [
                7528,
                7693
            ],
            [
                7693,
                7697
            ],
            [
                7697,
                7746
            ],
            [
                7746,
                7759
            ],
            [
                7759,
                7855
            ],
            [
                7855,
                8009
            ],
            [
                8009,
                8209
            ],
            [
                8209,
                8338
            ],
            [
                8338,
                8421
            ],
            [
                8421,
                8478
            ],
            [
                8478,
                8689
            ],
            [
                8689,
                8858
            ],
            [
                8858,
                9027
            ],
            [
                9027,
                9094
            ],
            [
                9094,
                9153
            ],
            [
                9153,
                9302
            ],
            [
                9302,
                9530
            ],
            [
                9530,
                9584
            ],
            [
                9584,
                9932
            ],
            [
                9932,
                10175
            ],
            [
                10175,
                10243
            ],
            [
                10243,
                10517
            ],
            [
                10517,
                10715
            ],
            [
                10715,
                10990
            ],
            [
                10990,
                11396
            ],
            [
                11396,
                11552
            ],
            [
                11552,
                11708
            ],
            [
                11708,
                12009
            ],
            [
                12009,
                12472
            ],
            [
                12472,
                12537
            ],
            [
                12537,
                12741
            ],
            [
                12741,
                12858
            ],
            [
                12858,
                12911
            ],
            [
                12911,
                13033
            ],
            [
                13033,
                13232
            ],
            [
                13232,
                13375
            ],
            [
                13375,
                13474
            ],
            [
                13474,
                13574
            ],
            [
                13574,
                13843
            ],
            [
                13843,
                14207
            ],
            [
                14207,
                14285
            ],
            [
                14285,
                14598
            ],
            [
                14598,
                14887
            ],
            [
                14887,
                15102
            ],
            [
                15102,
                15441
            ],
            [
                15441,
                15842
            ],
            [
                15842,
                15906
            ],
            [
                15906,
                15971
            ],
            [
                15971,
                16328
            ],
            [
                16328,
                17118
            ],
            [
                17118,
                17247
            ],
            [
                17247,
                17621
            ],
            [
                17621,
                17778
            ],
            [
                17778,
                18055
            ],
            [
                18055,
                18458
            ],
            [
                18458,
                18611
            ],
            [
                18611,
                19035
            ],
            [
                19035,
                19197
            ],
            [
                19197,
                19244
            ],
            [
                19244,
                19303
            ],
            [
                19303,
                19434
            ],
            [
                19434,
                19538
            ],
            [
                19538,
                19622
            ],
            [
                19622,
                19639
            ],
            [
                19639,
                19760
            ],
            [
                19760,
                19801
            ],
            [
                19801,
                19897
            ],
            [
                19897,
                20076
            ],
            [
                20076,
                20186
            ],
            [
                20186,
                20316
            ],
            [
                20316,
                20430
            ],
            [
                20430,
                20493
            ],
            [
                20493,
                20724
            ],
            [
                20724,
                20942
            ],
            [
                20942,
                20995
            ],
            [
                20995,
                21158
            ],
            [
                21158,
                21240
            ],
            [
                21240,
                21306
            ],
            [
                21306,
                21429
            ],
            [
                21429,
                21497
            ],
            [
                21497,
                21543
            ],
            [
                21543,
                21595
            ],
            [
                21595,
                21774
            ],
            [
                21774,
                21928
            ],
            [
                21928,
                21965
            ],
            [
                21965,
                22032
            ],
            [
                22032,
                22090
            ],
            [
                22090,
                22274
            ],
            [
                22274,
                22312
            ],
            [
                22312,
                22401
            ],
            [
                22401,
                22510
            ],
            [
                22510,
                22776
            ],
            [
                22776,
                23140
            ],
            [
                23140,
                23189
            ],
            [
                23189,
                23247
            ],
            [
                23247,
                23327
            ],
            [
                23327,
                23368
            ],
            [
                23368,
                23590
            ],
            [
                23590,
                23948
            ],
            [
                23948,
                24109
            ],
            [
                24109,
                24562
            ],
            [
                24562,
                24735
            ],
            [
                24735,
                24897
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                41,
                81
            ],
            [
                231,
                297
            ],
            [
                350,
                381
            ],
            [
                395,
                397
            ],
            [
                397,
                415
            ],
            [
                441,
                525
            ],
            [
                623,
                736
            ],
            [
                747,
                757
            ],
            [
                757,
                821
            ],
            [
                834,
                837
            ],
            [
                837,
                850
            ],
            [
                852,
                853
            ],
            [
                883,
                952
            ],
            [
                972,
                979
            ],
            [
                1036,
                1038
            ],
            [
                1038,
                1105
            ],
            [
                1107,
                1148
            ],
            [
                1196,
                1209
            ],
            [
                1217,
                1275
            ],
            [
                1275,
                1310
            ],
            [
                1314,
                1317
            ],
            [
                1332,
                1397
            ],
            [
                1412,
                1420
            ],
            [
                1420,
                1468
            ],
            [
                1469,
                1477
            ],
            [
                1549,
                1551
            ],
            [
                1551,
                1571
            ],
            [
                1573,
                1600
            ],
            [
                1607,
                1610
            ],
            [
                1612,
                1668
            ],
            [
                1668,
                1711
            ],
            [
                1713,
                1714
            ],
            [
                1730,
                1777
            ],
            [
                1790,
                1792
            ],
            [
                1792,
                1833
            ],
            [
                1867,
                1884
            ],
            [
                1916,
                1923
            ],
            [
                1884,
                1893
            ],
            [
                1925,
                1979
            ],
            [
                2126,
                2144
            ],
            [
                2148,
                2160
            ],
            [
                2160,
                2226
            ],
            [
                2262,
                2328
            ],
            [
                2328,
                2384
            ],
            [
                2490,
                2491
            ],
            [
                2385,
                2398
            ],
            [
                2399,
                2415
            ],
            [
                2427,
                2432
            ],
            [
                2511,
                2514
            ],
            [
                2500,
                2507
            ],
            [
                2524,
                2526
            ],
            [
                2553,
                2564
            ],
            [
                2577,
                2650
            ],
            [
                2665,
                2685
            ],
            [
                2721,
                2725
            ],
            [
                2686,
                2698
            ],
            [
                2736,
                2740
            ],
            [
                2891,
                2894
            ],
            [
                2709,
                2716
            ],
            [
                2741,
                2745
            ],
            [
                2846,
                2864
            ],
            [
                2940,
                2942
            ],
            [
                2942,
                2982
            ],
            [
                3079,
                3083
            ],
            [
                2982,
                2986
            ],
            [
                3051,
                3078
            ],
            [
                3090,
                3140
            ],
            [
                3213,
                3249
            ],
            [
                3263,
                3304
            ],
            [
                3306,
                3366
            ],
            [
                3422,
                3471
            ],
            [
                3488,
                3495
            ],
            [
                3472,
                3480
            ],
            [
                3495,
                3525
            ],
            [
                3535,
                3581
            ],
            [
                3602,
                3610
            ],
            [
                3612,
                3615
            ],
            [
                3621,
                3642
            ],
            [
                3644,
                3682
            ],
            [
                3695,
                3697
            ],
            [
                3744,
                3758
            ],
            [
                3715,
                3716
            ],
            [
                3760,
                3777
            ],
            [
                3798,
                3806
            ],
            [
                3808,
                3811
            ],
            [
                4466,
                4469
            ],
            [
                3856,
                3865
            ],
            [
                3742,
                3743
            ],
            [
                3945,
                3957
            ],
            [
                4002,
                4019
            ],
            [
                3866,
                3869
            ],
            [
                3988,
                3996
            ],
            [
                4181,
                4182
            ],
            [
                4065,
                4128
            ],
            [
                4141,
                4148
            ],
            [
                4133,
                4137
            ],
            [
                4020,
                4028
            ],
            [
                3758,
                3759
            ],
            [
                4187,
                4212
            ],
            [
                4228,
                4242
            ],
            [
                4443,
                4448
            ],
            [
                3830,
                3833
            ],
            [
                4250,
                4263
            ],
            [
                4431,
                4437
            ],
            [
                3902,
                3909
            ],
            [
                4297,
                4300
            ],
            [
                4308,
                4313
            ],
            [
                4340,
                4345
            ],
            [
                3845,
                3847
            ],
            [
                3806,
                3807
            ],
            [
                3942,
                3944
            ],
            [
                4364,
                4394
            ],
            [
                4533,
                4535
            ],
            [
                4542,
                4564
            ],
            [
                4571,
                4630
            ],
            [
                4647,
                4679
            ],
            [
                4724,
                4734
            ],
            [
                4753,
                4767
            ],
            [
                4790,
                4802
            ],
            [
                4802,
                4848
            ],
            [
                4857,
                4880
            ],
            [
                4880,
                4943
            ],
            [
                5066,
                5068
            ],
            [
                5088,
                5094
            ],
            [
                5098,
                5108
            ],
            [
                5124,
                5134
            ],
            [
                5153,
                5188
            ],
            [
                5207,
                5209
            ],
            [
                5209,
                5232
            ],
            [
                5245,
                5272
            ],
            [
                5285,
                5298
            ],
            [
                5539,
                5541
            ],
            [
                5423,
                5427
            ],
            [
                5320,
                5418
            ],
            [
                5458,
                5513
            ],
            [
                5515,
                5538
            ],
            [
                5545,
                5572
            ],
            [
                5583,
                5602
            ],
            [
                5669,
                5672
            ],
            [
                5710,
                5718
            ],
            [
                5729,
                5751
            ],
            [
                5820,
                5826
            ],
            [
                5797,
                5809
            ],
            [
                5827,
                5843
            ],
            [
                5845,
                5849
            ],
            [
                5857,
                5860
            ],
            [
                5873,
                5884
            ],
            [
                5897,
                5933
            ],
            [
                6015,
                6063
            ],
            [
                6083,
                6102
            ],
            [
                6170,
                6247
            ],
            [
                6338,
                6340
            ],
            [
                6340,
                6418
            ],
            [
                6434,
                6465
            ],
            [
                6481,
                6485
            ],
            [
                6498,
                6511
            ],
            [
                6511,
                6533
            ],
            [
                6552,
                6582
            ],
            [
                6592,
                6597
            ],
            [
                6644,
                6646
            ],
            [
                6646,
                6674
            ],
            [
                6712,
                6724
            ],
            [
                6698,
                6711
            ],
            [
                6675,
                6678
            ],
            [
                6724,
                6729
            ],
            [
                6738,
                6749
            ],
            [
                6860,
                6868
            ],
            [
                6878,
                6890
            ],
            [
                6898,
                6954
            ],
            [
                6983,
                6996
            ],
            [
                6961,
                6970
            ],
            [
                7008,
                7024
            ],
            [
                7052,
                7092
            ],
            [
                7363,
                7400
            ],
            [
                7418,
                7419
            ],
            [
                7424,
                7450
            ],
            [
                7461,
                7468
            ],
            [
                7469,
                7483
            ],
            [
                7526,
                7528
            ],
            [
                7528,
                7575
            ],
            [
                7588,
                7674
            ],
            [
                7691,
                7693
            ],
            [
                7693,
                7697
            ],
            [
                7697,
                7701
            ],
            [
                7707,
                7746
            ],
            [
                7746,
                7759
            ],
            [
                7776,
                7785
            ],
            [
                7817,
                7820
            ],
            [
                7828,
                7855
            ],
            [
                7855,
                7921
            ],
            [
                7923,
                7963
            ],
            [
                7977,
                8009
            ],
            [
                8009,
                8012
            ],
            [
                8041,
                8092
            ],
            [
                8109,
                8116
            ],
            [
                8013,
                8016
            ],
            [
                8189,
                8208
            ],
            [
                8209,
                8227
            ],
            [
                8289,
                8320
            ],
            [
                8326,
                8338
            ],
            [
                8338,
                8408
            ],
            [
                8425,
                8478
            ],
            [
                8478,
                8561
            ],
            [
                8594,
                8689
            ],
            [
                8689,
                8695
            ],
            [
                8696,
                8708
            ],
            [
                8738,
                8739
            ],
            [
                8796,
                8811
            ],
            [
                8748,
                8752
            ],
            [
                8779,
                8788
            ],
            [
                8856,
                8858
            ],
            [
                8858,
                8909
            ],
            [
                8910,
                8942
            ],
            [
                8947,
                9027
            ],
            [
                9027,
                9094
            ],
            [
                9105,
                9127
            ],
            [
                9142,
                9153
            ],
            [
                9153,
                9161
            ],
            [
                9210,
                9257
            ],
            [
                9286,
                9302
            ],
            [
                9302,
                9327
            ],
            [
                9337,
                9491
            ],
            [
                9492,
                9504
            ],
            [
                9528,
                9529
            ],
            [
                9530,
                9545
            ],
            [
                9559,
                9584
            ],
            [
                9776,
                9788
            ],
            [
                9610,
                9612
            ],
            [
                9648,
                9668
            ],
            [
                9636,
                9637
            ],
            [
                9767,
                9774
            ],
            [
                9790,
                9931
            ],
            [
                10517,
                10526
            ],
            [
                10610,
                10715
            ],
            [
                10720,
                10757
            ],
            [
                10769,
                10849
            ],
            [
                10924,
                10990
            ],
            [
                10990,
                11079
            ],
            [
                11174,
                11175
            ],
            [
                11081,
                11101
            ],
            [
                11109,
                11117
            ],
            [
                11126,
                11129
            ],
            [
                11240,
                11241
            ],
            [
                11131,
                11134
            ],
            [
                11242,
                11291
            ],
            [
                11296,
                11317
            ],
            [
                11394,
                11396
            ],
            [
                11396,
                11484
            ],
            [
                11490,
                11509
            ],
            [
                11550,
                11552
            ],
            [
                11552,
                11580
            ],
            [
                11612,
                11624
            ],
            [
                11706,
                11708
            ],
            [
                11723,
                11728
            ],
            [
                11752,
                11761
            ],
            [
                11769,
                11796
            ],
            [
                11924,
                11938
            ],
            [
                11988,
                12009
            ],
            [
                12009,
                12012
            ],
            [
                12051,
                12071
            ],
            [
                12082,
                12129
            ],
            [
                12136,
                12174
            ],
            [
                12183,
                12198
            ],
            [
                12207,
                12246
            ],
            [
                12286,
                12291
            ],
            [
                12256,
                12259
            ],
            [
                12292,
                12368
            ],
            [
                12373,
                12378
            ],
            [
                12396,
                12472
            ],
            [
                12472,
                12484
            ],
            [
                12485,
                12537
            ],
            [
                12537,
                12590
            ],
            [
                12622,
                12625
            ],
            [
                12643,
                12657
            ],
            [
                12665,
                12675
            ],
            [
                12723,
                12732
            ],
            [
                12676,
                12682
            ],
            [
                12592,
                12595
            ],
            [
                12713,
                12718
            ],
            [
                12699,
                12704
            ],
            [
                12739,
                12741
            ],
            [
                12764,
                12770
            ],
            [
                12781,
                12816
            ],
            [
                12824,
                12858
            ],
            [
                12858,
                12870
            ],
            [
                12883,
                12909
            ],
            [
                12911,
                12938
            ],
            [
                12946,
                12966
            ],
            [
                12967,
                12998
            ],
            [
                12999,
                13028
            ],
            [
                13031,
                13033
            ],
            [
                13232,
                13261
            ],
            [
                13284,
                13375
            ],
            [
                13405,
                13421
            ],
            [
                13422,
                13474
            ],
            [
                13483,
                13510
            ],
            [
                13519,
                13533
            ],
            [
                13562,
                13574
            ],
            [
                13574,
                13577
            ],
            [
                13582,
                13629
            ],
            [
                13631,
                13721
            ],
            [
                13735,
                13750
            ],
            [
                13752,
                13787
            ],
            [
                13790,
                13843
            ],
            [
                13843,
                13866
            ],
            [
                13871,
                13889
            ],
            [
                13995,
                13998
            ],
            [
                13894,
                13957
            ],
            [
                14205,
                14206
            ],
            [
                13999,
                14019
            ],
            [
                14064,
                14113
            ],
            [
                14040,
                14043
            ],
            [
                14119,
                14131
            ],
            [
                14037,
                14039
            ],
            [
                14049,
                14057
            ],
            [
                14655,
                14664
            ],
            [
                14603,
                14615
            ],
            [
                14676,
                14701
            ],
            [
                14711,
                14717
            ],
            [
                14645,
                14654
            ],
            [
                14627,
                14629
            ],
            [
                14759,
                14767
            ],
            [
                14885,
                14887
            ],
            [
                14887,
                14939
            ],
            [
                14976,
                14997
            ],
            [
                15032,
                15063
            ],
            [
                14969,
                14972
            ],
            [
                15089,
                15102
            ],
            [
                15102,
                15152
            ],
            [
                15168,
                15282
            ],
            [
                15288,
                15338
            ],
            [
                15360,
                15440
            ],
            [
                15441,
                15564
            ],
            [
                15576,
                15601
            ],
            [
                15679,
                15736
            ],
            [
                15754,
                15774
            ],
            [
                15783,
                15786
            ],
            [
                15790,
                15812
            ],
            [
                15677,
                15678
            ],
            [
                15906,
                15928
            ],
            [
                15969,
                15971
            ],
            [
                15971,
                16031
            ],
            [
                16038,
                16043
            ],
            [
                16326,
                16327
            ],
            [
                16328,
                16347
            ],
            [
                16751,
                16753
            ],
            [
                16360,
                16395
            ],
            [
                16593,
                16595
            ],
            [
                16431,
                16466
            ],
            [
                16479,
                16514
            ],
            [
                16946,
                16947
            ],
            [
                16516,
                16552
            ],
            [
                16608,
                16643
            ],
            [
                16673,
                16693
            ],
            [
                16706,
                16730
            ],
            [
                16738,
                16750
            ],
            [
                16754,
                16760
            ],
            [
                16822,
                16858
            ],
            [
                16872,
                16915
            ],
            [
                16948,
                16973
            ],
            [
                16983,
                17004
            ],
            [
                17011,
                17018
            ],
            [
                17006,
                17010
            ],
            [
                17019,
                17027
            ],
            [
                16580,
                16583
            ],
            [
                17058,
                17069
            ],
            [
                17116,
                17118
            ],
            [
                17118,
                17163
            ],
            [
                17199,
                17236
            ],
            [
                17245,
                17247
            ],
            [
                17309,
                17339
            ],
            [
                17353,
                17391
            ],
            [
                17428,
                17454
            ],
            [
                17619,
                17621
            ],
            [
                17624,
                17657
            ],
            [
                17703,
                17778
            ],
            [
                17786,
                17836
            ],
            [
                17863,
                17886
            ],
            [
                17894,
                17919
            ],
            [
                17938,
                18007
            ],
            [
                18022,
                18055
            ],
            [
                18302,
                18311
            ],
            [
                18412,
                18415
            ],
            [
                18313,
                18321
            ],
            [
                18353,
                18411
            ],
            [
                18481,
                18495
            ],
            [
                18261,
                18263
            ],
            [
                18175,
                18177
            ],
            [
                18514,
                18521
            ],
            [
                18531,
                18577
            ],
            [
                18588,
                18610
            ],
            [
                18611,
                18663
            ],
            [
                18679,
                18698
            ],
            [
                18700,
                18739
            ],
            [
                18741,
                18771
            ],
            [
                18774,
                18812
            ],
            [
                18868,
                18932
            ],
            [
                19033,
                19035
            ],
            [
                19035,
                19079
            ],
            [
                19086,
                19097
            ],
            [
                19142,
                19158
            ],
            [
                19160,
                19197
            ],
            [
                19209,
                19218
            ],
            [
                19231,
                19244
            ],
            [
                19244,
                19303
            ],
            [
                19303,
                19309
            ],
            [
                19325,
                19434
            ],
            [
                19434,
                19498
            ],
            [
                19503,
                19508
            ],
            [
                19536,
                19538
            ],
            [
                19538,
                19590
            ],
            [
                19607,
                19622
            ],
            [
                19629,
                19639
            ],
            [
                19639,
                19672
            ],
            [
                19714,
                19721
            ],
            [
                19737,
                19760
            ],
            [
                19760,
                19764
            ],
            [
                19799,
                19801
            ],
            [
                19801,
                19803
            ],
            [
                19819,
                19853
            ],
            [
                19875,
                19897
            ],
            [
                19897,
                19903
            ],
            [
                19968,
                19982
            ],
            [
                20016,
                20021
            ],
            [
                20026,
                20052
            ],
            [
                19940,
                19941
            ],
            [
                20063,
                20065
            ],
            [
                20053,
                20062
            ],
            [
                20074,
                20076
            ],
            [
                20076,
                20134
            ],
            [
                20144,
                20185
            ],
            [
                20724,
                20725
            ],
            [
                20729,
                20783
            ],
            [
                20794,
                20823
            ],
            [
                20940,
                20942
            ],
            [
                20942,
                20983
            ],
            [
                20993,
                20995
            ],
            [
                20995,
                21006
            ],
            [
                21007,
                21013
            ],
            [
                21068,
                21158
            ],
            [
                21182,
                21240
            ],
            [
                21240,
                21306
            ],
            [
                21313,
                21429
            ],
            [
                21429,
                21496
            ],
            [
                21543,
                21576
            ],
            [
                21593,
                21595
            ],
            [
                21595,
                21600
            ],
            [
                21674,
                21713
            ],
            [
                21772,
                21774
            ],
            [
                21774,
                21782
            ],
            [
                21787,
                21821
            ],
            [
                21850,
                21857
            ],
            [
                21867,
                21871
            ],
            [
                21839,
                21849
            ],
            [
                21872,
                21874
            ],
            [
                21905,
                21925
            ],
            [
                22033,
                22045
            ],
            [
                22054,
                22090
            ],
            [
                22090,
                22104
            ],
            [
                22149,
                22186
            ],
            [
                22283,
                22287
            ],
            [
                22301,
                22312
            ],
            [
                22312,
                22401
            ],
            [
                22401,
                22510
            ],
            [
                22510,
                22511
            ],
            [
                22515,
                22576
            ],
            [
                22631,
                22658
            ],
            [
                22674,
                22691
            ],
            [
                22696,
                22701
            ],
            [
                22774,
                22776
            ],
            [
                22776,
                22784
            ],
            [
                22789,
                22952
            ],
            [
                22973,
                22979
            ],
            [
                22981,
                23117
            ],
            [
                23126,
                23130
            ],
            [
                23140,
                23141
            ],
            [
                23152,
                23189
            ],
            [
                23189,
                23232
            ],
            [
                23245,
                23247
            ],
            [
                23327,
                23368
            ],
            [
                23368,
                23418
            ],
            [
                23424,
                23429
            ],
            [
                23434,
                23524
            ],
            [
                23559,
                23568
            ],
            [
                23573,
                23590
            ],
            [
                23590,
                23605
            ],
            [
                23607,
                23656
            ],
            [
                24109,
                24142
            ],
            [
                24150,
                24165
            ],
            [
                24395,
                24444
            ],
            [
                24458,
                24531
            ],
            [
                24545,
                24562
            ],
            [
                24562,
                24594
            ],
            [
                24595,
                24599
            ],
            [
                24603,
                24611
            ],
            [
                24646,
                24697
            ],
            [
                24707,
                24735
            ],
            [
                24735,
                24754
            ],
            [
                24761,
                24783
            ],
            [
                24791,
                24870
            ]
        ],
        "row_chars": [
            [
                0,
                397
            ],
            [
                397,
                757
            ],
            [
                757,
                837
            ],
            [
                837,
                1038
            ],
            [
                1038,
                1275
            ],
            [
                1275,
                1420
            ],
            [
                1420,
                1551
            ],
            [
                1551,
                1668
            ],
            [
                1668,
                1792
            ],
            [
                1792,
                1979
            ],
            [
                1979,
                2121
            ],
            [
                2121,
                2160
            ],
            [
                2160,
                2328
            ],
            [
                2328,
                2564
            ],
            [
                2564,
                2942
            ],
            [
                2942,
                2982
            ],
            [
                2982,
                3142
            ],
            [
                3142,
                3156
            ],
            [
                3156,
                3366
            ],
            [
                3366,
                3697
            ],
            [
                3697,
                4535
            ],
            [
                4535,
                4802
            ],
            [
                4802,
                4880
            ],
            [
                4880,
                5068
            ],
            [
                5068,
                5209
            ],
            [
                5209,
                5672
            ],
            [
                5672,
                5933
            ],
            [
                5933,
                5986
            ],
            [
                5986,
                6340
            ],
            [
                6340,
                6511
            ],
            [
                6511,
                6646
            ],
            [
                6646,
                7093
            ],
            [
                7093,
                7363
            ],
            [
                7363,
                7528
            ],
            [
                7528,
                7693
            ],
            [
                7693,
                7697
            ],
            [
                7697,
                7746
            ],
            [
                7746,
                7759
            ],
            [
                7759,
                7855
            ],
            [
                7855,
                8009
            ],
            [
                8009,
                8209
            ],
            [
                8209,
                8338
            ],
            [
                8338,
                8421
            ],
            [
                8421,
                8478
            ],
            [
                8478,
                8689
            ],
            [
                8689,
                8858
            ],
            [
                8858,
                9027
            ],
            [
                9027,
                9094
            ],
            [
                9094,
                9153
            ],
            [
                9153,
                9302
            ],
            [
                9302,
                9530
            ],
            [
                9530,
                9584
            ],
            [
                9584,
                9932
            ],
            [
                9932,
                10175
            ],
            [
                10175,
                10243
            ],
            [
                10243,
                10517
            ],
            [
                10517,
                10715
            ],
            [
                10715,
                10990
            ],
            [
                10990,
                11396
            ],
            [
                11396,
                11552
            ],
            [
                11552,
                11708
            ],
            [
                11708,
                12009
            ],
            [
                12009,
                12472
            ],
            [
                12472,
                12537
            ],
            [
                12537,
                12741
            ],
            [
                12741,
                12858
            ],
            [
                12858,
                12911
            ],
            [
                12911,
                13033
            ],
            [
                13033,
                13232
            ],
            [
                13232,
                13375
            ],
            [
                13375,
                13474
            ],
            [
                13474,
                13574
            ],
            [
                13574,
                13843
            ],
            [
                13843,
                14207
            ],
            [
                14207,
                14285
            ],
            [
                14285,
                14598
            ],
            [
                14598,
                14887
            ],
            [
                14887,
                15102
            ],
            [
                15102,
                15441
            ],
            [
                15441,
                15842
            ],
            [
                15842,
                15906
            ],
            [
                15906,
                15971
            ],
            [
                15971,
                16328
            ],
            [
                16328,
                17118
            ],
            [
                17118,
                17247
            ],
            [
                17247,
                17621
            ],
            [
                17621,
                17778
            ],
            [
                17778,
                18055
            ],
            [
                18055,
                18611
            ],
            [
                18611,
                19035
            ],
            [
                19035,
                19197
            ],
            [
                19197,
                19244
            ],
            [
                19244,
                19303
            ],
            [
                19303,
                19434
            ],
            [
                19434,
                19538
            ],
            [
                19538,
                19622
            ],
            [
                19622,
                19639
            ],
            [
                19639,
                19760
            ],
            [
                19760,
                19801
            ],
            [
                19801,
                19897
            ],
            [
                19897,
                20076
            ],
            [
                20076,
                20186
            ],
            [
                20186,
                20316
            ],
            [
                20316,
                20430
            ],
            [
                20430,
                20493
            ],
            [
                20493,
                20724
            ],
            [
                20724,
                20942
            ],
            [
                20942,
                20995
            ],
            [
                20995,
                21158
            ],
            [
                21158,
                21240
            ],
            [
                21240,
                21306
            ],
            [
                21306,
                21429
            ],
            [
                21429,
                21497
            ],
            [
                21497,
                21543
            ],
            [
                21543,
                21595
            ],
            [
                21595,
                21774
            ],
            [
                21774,
                21928
            ],
            [
                21928,
                21965
            ],
            [
                21965,
                22032
            ],
            [
                22032,
                22090
            ],
            [
                22090,
                22312
            ],
            [
                22312,
                22401
            ],
            [
                22401,
                22510
            ],
            [
                22510,
                22776
            ],
            [
                22776,
                23140
            ],
            [
                23140,
                23189
            ],
            [
                23189,
                23247
            ],
            [
                23247,
                23327
            ],
            [
                23327,
                23368
            ],
            [
                23368,
                23590
            ],
            [
                23590,
                23948
            ],
            [
                23948,
                24109
            ],
            [
                24109,
                24562
            ],
            [
                24562,
                24735
            ],
            [
                24735,
                24897
            ]
        ]
    },
    "abridged": {
        "text": "The kind reader must please to remember - while the army is marching from Flanders - that there are a number of persons living peaceably in England who must come in for their share of this story. During the time of battle, old Miss Crawley was living at Brighton, very moderately moved by the great events; although Briggs read out the Gazette, in which Rawdon Crawley's gallantry was mentioned with honour, and his promotion was recorded.\n\"What a pity that young man has taken such an irretrievable step!\" his aunt said. \"He might have married a brewer's daughter with a quarter of a million, or have married a lady. He would have had my money some day or other; or his children would - for I'm not in a hurry to go, Miss Briggs; and instead, he is a doomed pauper, with a dancing-girl for a wife.\"\n\"Will my dear Miss Crawley not cast a compassionate eye upon the heroic soldier, whose name is inscribed in the annals of glory?\" said Miss Briggs, who was greatly excited by the events of Waterloo. \"Has not the Captain - or the Colonel as I may now call him - done deeds which make the name of Crawley illustrious?\"\n\"Briggs, you are a fool,\" said Miss Crawley. \"He has dragged the name of Crawley through the mud. Marry a drawing-master's daughter, indeed! She was no better than you are, Briggs; only younger, and a great deal prettier and cleverer. I daresay you were her accomplice. But you will find yourself disappointed in my will, I can tell you. Write to Mr. Waxy, and say that I desire to see him immediately.\" Miss Crawley was now in the habit of writing to Mr. Waxy, her solicitor, almost every day, for she was greatly perplexed about how to leave her money.\nShe had, however, rallied considerably; as was proved by the increased vigour of her sarcasms upon poor Miss Briggs, who bore her attacks with slavish submission. Who has not seen how women bully women? With what shafts of scorn and cruelty poor women are riddled by the tyrants of their sex! Miss Crawley was always particularly savage when she was rallying from illness - as they say wounds tingle most when they are about to heal.\nMiss Briggs was the only victim admitted into the invalid's presence; yet Miss Crawley's relatives did not forget their beloved kinswoman, and by presents and affectionate messages strove to keep themselves alive in her memory.\nRawdon Crawley, a few weeks after Waterloo and his promotion, sent Miss Crawley a dutiful letter, and several presents: a pair of French epaulets, a Cross of the Legion of Honour, and a sword hilt - relics from the battlefield. The letter described with humour how the sword had belonged to a French officer who had sworn never to surrender, only to be taken prisoner the next minute. The cross and epaulets came from a Colonel of French cavalry, who had fallen under Rawdon's arm in the battle: and Rawdon thus sent the spoils to his kindest old friend. Should he continue to write to her from Paris, where the army was marching? He might be able to give her interesting news from that capital.\nMiss Crawley made Briggs write back a gracious letter, encouraging him to continue writing. His first letter was so lively and amusing that she looked forward with pleasure to more.\n\"Of course, I know,\" she explained to Miss Briggs, \"that Rawdon could not write such a good letter, and that it is that clever little wretch of a Rebecca who dictates every word; but that is no reason why he should not amuse me.\"\nBecky not only wrote the letters, but also bought the trophies for a few francs from the pedlars who began to deal in relics of the war. Miss Crawley's gracious reply greatly encouraged Rawdon and his lady: and they took care to entertain her with many delightful letters from Paris.\nTo the rector's lady, who went off to tend her husband's broken collar-bone at Queen's Crawley, the spinster's letters were not so gracious. Mrs. Bute, that brisk, imperious woman, had committed a fatal error. She had not merely oppressed Miss Crawley - she had bored her; and Miss Briggs was ordered to write to Mrs. Bute, saying that Miss Crawley's health was greatly improved, and begging Mrs. Bute on no account to quit her family for Miss Crawley's sake.\n\"How silly I was,\" Mrs. Bute thought, \"to hint that I was coming, in that last foolish letter. I ought to have gone without a word to the poor old creature, and taken her out of the hands of that ninny Briggs, and that harpy of a maid. Oh! Bute, why did you break your collar-bone?\"\nWhy, indeed? Mrs. Bute had played her cards too well. She had ruled over Miss Crawley's household utterly and completely - to be utterly and completely routed when an opportunity for rebellion came. She considered that she had been the victim of horrible treason and savage ingratitude.\nRawdon's promotion filled this good Christian lady with alarm. Would his aunt relent towards him now that he was a Lieutenant-Colonel? Would that odious Rebecca once more get into favour? The Rector's wife wrote a sermon for her husband about the vanity of military glory, which the worthy parson read in his best voice and without understanding one syllable of it. He had Mr. Pitt Crawley in the congregation, but the old Baronet would not come to church.\nSince the departure of Becky Sharp, that old wretch Sir Pitt had given himself up entirely to bad courses, to the great scandal of the county and the mute horror of his son. The ribbons in Miss Horrocks's cap became more splendid than ever. Polite families fled the hall in terror. Sir Pitt drank rum-and-water with the farmers at Mudbury on market-days. He drove the family coach to Southampton with Miss Horrocks inside: and the county people expected, every week, as his son did in speechless agony, that his marriage with her would soon be announced.\nIt was indeed a hard burden for Mr. Crawley to bear. When he rose to speak at religious assemblies, he felt that the audience said, \"That is the son of the old reprobate Sir Pitt, who is very likely drinking at the public house at this very moment.\"\nMeanwhile Miss Crawley's dear nephews and nieces were unanimous in loving her and sending her tokens of affection. Mrs. Bute sent guinea-fowls, and some fine cauliflowers, and a pretty purse or pincushion worked by her darling girls, while Mr. Pitt sent peaches and grapes and venison from the Hall. The Southampton coach used to carry these tokens of affection to Miss Crawley at Brighton. It used sometimes to carry Mr. Pitt there too, for he had an attraction at Brighton in the person of Lady Jane Sheepshanks. Her Ladyship and her sisters lived at Brighton with their mamma, the Countess Southdown, a strong-minded woman.\nA few words ought to be said about this noble family. Their chief, Clement, fourth Earl of Southdown, was for a time was a serious young man. But his admirable mother learned, very shortly after her noble husband's death, that her son was a member of several clubs, had lost greatly at play at Wattier's and the Cocoa Tree, and had encumbered the family estate; that he drove four-in-hand, and patronised the boxing; and had an opera-box, where he entertained the most dangerous bachelor company. His name was now only mentioned with groans in the dowager's circle.\nThe Lady Emily was her brother's senior by many years: the author of some delightful spiritual tracts and hymns, and a mature spinster. Having few ideas of marriage, her love for the anti-slavery cause occupied almost all her feelings. It is to her that we owe that beautiful poem:\nLead us to some sunny isle,\nYonder in the western deep;\nWhere the skies for ever smile,\nAnd the blacks for ever weep, etc.\nAs for the Lady Jane, on whom Mr. Pitt Crawley's affection had been placed, she was gentle, blushing, silent, and timid. She wept for her profligate brother, and was quite ashamed of loving him still. She used to send him little smuggled notes in private. The dreadful secret which weighed upon her life was that she and the old housekeeper had been to pay Southdown a furtive visit at his chambers; and found him - O the naughty dear abandoned wretch! - smoking a cigar with a bottle of Curacao before him. She admired her sister, adored her mother, and thought Mr. Crawley the most delightful and accomplished of men. Her mamma and sister managed everything for her, and regarded her with the amiable pity of superior women.\nIt was to these ladies that Mr. Crawley paid his visits in Brighton, rather than to his aunt. When he met Miss Briggs coming home from the library, Mr. Crawley blushed as he stepped forward and shook her by the hand. He introduced Miss Briggs to the lady with whom he was walking, the Lady Jane Sheepshanks, saying, \"Lady Jane, permit me to introduce to you my aunt's kindest friend and affectionate companion, Miss Briggs, whom you know as authoress of the delightful 'Lyrics of the Heart,' of which you are so fond.\"\nLady Jane blushed too as she held out a kind little hand to Miss Briggs, and said something very civil and incoherent about proposing to call on Miss Crawley; and with soft dove-like eyes saluted Miss Briggs, while Pitt Crawley gave her a profound courtly bow.\nThe artful diplomatist! It was he who had given Lady Jane that copy of poor Briggs's poems. It was he, too, who suggested to Lady Southdown the great advantages of a friendship between her family and Miss Crawley - advantages both worldly and spiritual, he said, for Miss Crawley was now quite alone. Rawdon had estranged her affections; the greedy tyranny of Mrs. Bute Crawley had made the old lady revolt; and though he himself had held off from cultivating Miss Crawley's friendship, he thought now that every means should be taken to save both her soul and her fortune.\nThe strong-minded Lady Southdown quite agreed, and was for converting Miss Crawley. This tall and awful missionary rode about the country in her barouche launching tracts among the cottagers. Lord Southdown, her late husband, had been in the habit of approving of everything which his Matilda did and thought. Whatever changes her own belief might undergo (and she held a prodigious variety of opinions, taken from all sorts of Dissenters) she had not the least scruple in ordering all her tenants to follow and believe after her. Her household and children were expected to go down on their knees with her Ladyship, while old Southdown, as an invalid, was allowed to sit in his own room, and have the paper read to him.\nLady Jane was the old Earl's favourite daughter, and loved him sincerely. As for Lady Emily, the authoress of the 'Washerwoman of Finchley Common,' her denunciations of future punishment were so awful that they used to frighten the timid old gentleman.\n\"I will certainly call,\" said Lady Southdown in reply to Mr. Pitt Crawley. \"Who is Miss Crawley's medical man?\"\nHe mentioned Mr. Creamer.\n\"A most dangerous and ignorant practitioner, my dear Pitt. I have been the means of removing him from several houses: though in one or two instances I did not arrive in time. I could not save poor dear General Glanders, who was dying under his hands. He rallied a little under the Podgers' pills which I gave him; but alas! too late. His death was delightful, however. Creamer must leave your aunt.\"\nPitt agreed. He was carried along by the energy of his future mother-in-law. He had accepted Podgers' Pills and every other of her Ladyship's remedies, bodily or spiritual. He never left her house without carrying respectfully away piles of her quack theology and medicine.\n\"As for her spiritual state,\" continued the Lady, \"that must be looked to immediately! I will send the Reverend Mr. Irons to her. Jane, write him a line, and say that I desire the pleasure of his company this evening at tea at half-past six. He ought to see Miss Crawley before she rests this night. And Emily, my love, get ready a packet of books for Miss Crawley. 'A Voice from the Flames,' 'A Trumpet-warning to Jericho,' and the 'Fleshpots Broken; or, the Converted Cannibal.'\"\n\"And the 'Washerwoman of Finchley Common,' Mamma,\" said Lady Emily.\n\"Stop, my dear ladies,\" said Pitt. \"With respect, I think it would be quite unadvisable. Remember Miss Crawley's delicate condition, and how little she has been accustomed to consider her immortal welfare. If you begin so soon, you will frighten her altogether. I know my aunt: any abrupt attempt at conversion will only annoy her. She will very likely fling the books away, and refuse all acquaintance with the givers.\"\n\"You are as worldly as Miss Crawley, Pitt,\" said Lady Emily, tossing out of the room, her books in her hand.\n\"I need not tell you, my dear Lady Southdown,\" Pitt continued, \"how fatal a little want of caution may be to our hopes. Remember my aunt has seventy thousand pounds; think of her age, and her highly nervous and delicate condition; I know that she has destroyed the will which was made in my brother's favour. It is by soothing that wounded spirit that we must lead it into the right path, and not by frightening it; and so I think you will agree that-'\n\"Of course,\" Lady Southdown remarked. \"Jane, my love, you need not send that note. I will call upon Miss Crawley tomorrow.\"\n\"And if I might suggest, my sweet lady,\" Pitt said blandly, \"it would be as well not to take our precious Emily, who is too enthusiastic; but rather, our sweet dear Lady Jane.\"\n\"Most certainly. Emily would ruin everything,\" Lady Southdown said.\nThe next day, the great Southdown family carriage drove up in state to Miss Crawley's door, and the footman handed in to Mr. Bowls her Ladyship's cards for Miss Crawley, and for Miss Briggs. By way of compromise, Lady Emily also sent Miss Briggs a packet, containing copies of the \"Washerwoman,\" and other favourite tracts for Miss B.'s own perusal; and for the servants' hall she sent \"Crumbs from the Pantry,\" \"The Frying Pan and the Fire,\" and \"The Livery of Sin.\"",
        "paragraph_chars": [
            [
                0,
                440
            ],
            [
                440,
                800
            ],
            [
                800,
                1117
            ],
            [
                1117,
                1672
            ],
            [
                1672,
                2106
            ],
            [
                2106,
                2334
            ],
            [
                2334,
                3030
            ],
            [
                3030,
                3212
            ],
            [
                3212,
                3442
            ],
            [
                3442,
                3726
            ],
            [
                3726,
                4186
            ],
            [
                4186,
                4469
            ],
            [
                4469,
                4756
            ],
            [
                4756,
                5213
            ],
            [
                5213,
                5768
            ],
            [
                5768,
                6018
            ],
            [
                6018,
                6645
            ],
            [
                6645,
                7211
            ],
            [
                7211,
                7493
            ],
            [
                7493,
                7521
            ],
            [
                7521,
                7549
            ],
            [
                7549,
                7581
            ],
            [
                7581,
                7616
            ],
            [
                7616,
                8343
            ],
            [
                8343,
                8862
            ],
            [
                8862,
                9123
            ],
            [
                9123,
                9697
            ],
            [
                9697,
                10418
            ],
            [
                10418,
                10671
            ],
            [
                10671,
                10783
            ],
            [
                10783,
                10809
            ],
            [
                10809,
                11209
            ],
            [
                11209,
                11483
            ],
            [
                11483,
                11965
            ],
            [
                11965,
                12033
            ],
            [
                12033,
                12454
            ],
            [
                12454,
                12563
            ],
            [
                12563,
                13016
            ],
            [
                13016,
                13140
            ],
            [
                13140,
                13317
            ],
            [
                13317,
                13385
            ],
            [
                13385,
                13852
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                440
            ],
            [
                440,
                507
            ],
            [
                507,
                522
            ],
            [
                522,
                618
            ],
            [
                618,
                800
            ],
            [
                800,
                930
            ],
            [
                930,
                999
            ],
            [
                999,
                1117
            ],
            [
                1117,
                1162
            ],
            [
                1162,
                1215
            ],
            [
                1215,
                1258
            ],
            [
                1258,
                1352
            ],
            [
                1352,
                1387
            ],
            [
                1387,
                1455
            ],
            [
                1455,
                1521
            ],
            [
                1521,
                1672
            ],
            [
                1672,
                1835
            ],
            [
                1835,
                1875
            ],
            [
                1875,
                1965
            ],
            [
                1965,
                2106
            ],
            [
                2106,
                2334
            ],
            [
                2334,
                2562
            ],
            [
                2562,
                2719
            ],
            [
                2719,
                2889
            ],
            [
                2889,
                2965
            ],
            [
                2965,
                3030
            ],
            [
                3030,
                3122
            ],
            [
                3122,
                3212
            ],
            [
                3212,
                3442
            ],
            [
                3442,
                3579
            ],
            [
                3579,
                3726
            ],
            [
                3726,
                3867
            ],
            [
                3867,
                3936
            ],
            [
                3936,
                4186
            ],
            [
                4186,
                4281
            ],
            [
                4281,
                4422
            ],
            [
                4422,
                4426
            ],
            [
                4426,
                4469
            ],
            [
                4469,
                4482
            ],
            [
                4482,
                4523
            ],
            [
                4523,
                4668
            ],
            [
                4668,
                4756
            ],
            [
                4756,
                4819
            ],
            [
                4819,
                4891
            ],
            [
                4891,
                4944
            ],
            [
                4944,
                5122
            ],
            [
                5122,
                5213
            ],
            [
                5213,
                5387
            ],
            [
                5387,
                5454
            ],
            [
                5454,
                5495
            ],
            [
                5495,
                5568
            ],
            [
                5568,
                5768
            ],
            [
                5768,
                5821
            ],
            [
                5821,
                6018
            ],
            [
                6018,
                6133
            ],
            [
                6133,
                6318
            ],
            [
                6318,
                6409
            ],
            [
                6409,
                6533
            ],
            [
                6533,
                6645
            ],
            [
                6645,
                6699
            ],
            [
                6699,
                6787
            ],
            [
                6787,
                7142
            ],
            [
                7142,
                7211
            ],
            [
                7211,
                7347
            ],
            [
                7347,
                7447
            ],
            [
                7447,
                7493
            ],
            [
                7493,
                7521
            ],
            [
                7521,
                7549
            ],
            [
                7549,
                7581
            ],
            [
                7581,
                7616
            ],
            [
                7616,
                7737
            ],
            [
                7737,
                7817
            ],
            [
                7817,
                7872
            ],
            [
                7872,
                8069
            ],
            [
                8069,
                8124
            ],
            [
                8124,
                8236
            ],
            [
                8236,
                8343
            ],
            [
                8343,
                8437
            ],
            [
                8437,
                8560
            ],
            [
                8560,
                8862
            ],
            [
                8862,
                9123
            ],
            [
                9123,
                9147
            ],
            [
                9147,
                9215
            ],
            [
                9215,
                9424
            ],
            [
                9424,
                9697
            ],
            [
                9697,
                9781
            ],
            [
                9781,
                9889
            ],
            [
                9889,
                10007
            ],
            [
                10007,
                10228
            ],
            [
                10228,
                10418
            ],
            [
                10418,
                10492
            ],
            [
                10492,
                10671
            ],
            [
                10671,
                10746
            ],
            [
                10746,
                10783
            ],
            [
                10783,
                10809
            ],
            [
                10809,
                10868
            ],
            [
                10868,
                10984
            ],
            [
                10984,
                11060
            ],
            [
                11060,
                11133
            ],
            [
                11133,
                11143
            ],
            [
                11143,
                11178
            ],
            [
                11178,
                11209
            ],
            [
                11209,
                11222
            ],
            [
                11222,
                11286
            ],
            [
                11286,
                11382
            ],
            [
                11382,
                11483
            ],
            [
                11483,
                11570
            ],
            [
                11570,
                11613
            ],
            [
                11613,
                11725
            ],
            [
                11725,
                11783
            ],
            [
                11783,
                11849
            ],
            [
                11849,
                11965
            ],
            [
                11965,
                12033
            ],
            [
                12033,
                12068
            ],
            [
                12068,
                12122
            ],
            [
                12122,
                12239
            ],
            [
                12239,
                12295
            ],
            [
                12295,
                12365
            ],
            [
                12365,
                12454
            ],
            [
                12454,
                12563
            ],
            [
                12563,
                12683
            ],
            [
                12683,
                12872
            ],
            [
                12872,
                13016
            ],
            [
                13016,
                13054
            ],
            [
                13054,
                13099
            ],
            [
                13099,
                13140
            ],
            [
                13140,
                13317
            ],
            [
                13317,
                13334
            ],
            [
                13334,
                13385
            ],
            [
                13385,
                13576
            ],
            [
                13576,
                13719
            ],
            [
                13719,
                13852
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                42,
                82
            ],
            [
                85,
                151
            ],
            [
                152,
                183
            ],
            [
                194,
                196
            ],
            [
                196,
                214
            ],
            [
                221,
                305
            ],
            [
                316,
                429
            ],
            [
                430,
                440
            ],
            [
                440,
                504
            ],
            [
                504,
                507
            ],
            [
                507,
                520
            ],
            [
                522,
                523
            ],
            [
                523,
                592
            ],
            [
                594,
                601
            ],
            [
                616,
                618
            ],
            [
                618,
                685
            ],
            [
                688,
                729
            ],
            [
                729,
                742
            ],
            [
                742,
                800
            ],
            [
                800,
                835
            ],
            [
                852,
                855
            ],
            [
                856,
                921
            ],
            [
                922,
                930
            ],
            [
                930,
                978
            ],
            [
                989,
                997
            ],
            [
                997,
                999
            ],
            [
                999,
                1019
            ],
            [
                1022,
                1049
            ],
            [
                1055,
                1058
            ],
            [
                1061,
                1117
            ],
            [
                1117,
                1160
            ],
            [
                1162,
                1163
            ],
            [
                1166,
                1213
            ],
            [
                1213,
                1215
            ],
            [
                1215,
                1256
            ],
            [
                1258,
                1275
            ],
            [
                1281,
                1288
            ],
            [
                1288,
                1297
            ],
            [
                1298,
                1352
            ],
            [
                1352,
                1370
            ],
            [
                1375,
                1387
            ],
            [
                1387,
                1453
            ],
            [
                1455,
                1521
            ],
            [
                1521,
                1577
            ],
            [
                1577,
                1578
            ],
            [
                1579,
                1592
            ],
            [
                1594,
                1610
            ],
            [
                1610,
                1615
            ],
            [
                1620,
                1623
            ],
            [
                1632,
                1639
            ],
            [
                1652,
                1654
            ],
            [
                1661,
                1672
            ],
            [
                1676,
                1749
            ],
            [
                1750,
                1770
            ],
            [
                1771,
                1775
            ],
            [
                1776,
                1788
            ],
            [
                1793,
                1797
            ],
            [
                1798,
                1801
            ],
            [
                1802,
                1809
            ],
            [
                1810,
                1814
            ],
            [
                1815,
                1833
            ],
            [
                1833,
                1835
            ],
            [
                1835,
                1875
            ],
            [
                1875,
                1879
            ],
            [
                1880,
                1884
            ],
            [
                1885,
                1912
            ],
            [
                1913,
                1963
            ],
            [
                1965,
                2001
            ],
            [
                2002,
                2043
            ],
            [
                2046,
                2106
            ],
            [
                2106,
                2155
            ],
            [
                2156,
                2163
            ],
            [
                2166,
                2174
            ],
            [
                2174,
                2204
            ],
            [
                2205,
                2251
            ],
            [
                2252,
                2260
            ],
            [
                2261,
                2264
            ],
            [
                2265,
                2286
            ],
            [
                2287,
                2325
            ],
            [
                2332,
                2334
            ],
            [
                2334,
                2348
            ],
            [
                2348,
                2349
            ],
            [
                2350,
                2367
            ],
            [
                2368,
                2376
            ],
            [
                2377,
                2380
            ],
            [
                2381,
                2384
            ],
            [
                2385,
                2394
            ],
            [
                2394,
                2395
            ],
            [
                2401,
                2413
            ],
            [
                2414,
                2431
            ],
            [
                2432,
                2435
            ],
            [
                2444,
                2452
            ],
            [
                2452,
                2453
            ],
            [
                2454,
                2517
            ],
            [
                2518,
                2525
            ],
            [
                2526,
                2530
            ],
            [
                2540,
                2548
            ],
            [
                2560,
                2561
            ],
            [
                2562,
                2587
            ],
            [
                2588,
                2602
            ],
            [
                2603,
                2608
            ],
            [
                2609,
                2612
            ],
            [
                2613,
                2626
            ],
            [
                2627,
                2633
            ],
            [
                2634,
                2641
            ],
            [
                2642,
                2645
            ],
            [
                2650,
                2655
            ],
            [
                2656,
                2661
            ],
            [
                2662,
                2664
            ],
            [
                2674,
                2675
            ],
            [
                2681,
                2683
            ],
            [
                2687,
                2717
            ],
            [
                2717,
                2719
            ],
            [
                2719,
                2741
            ],
            [
                2742,
                2801
            ],
            [
                2808,
                2840
            ],
            [
                2851,
                2861
            ],
            [
                2862,
                2876
            ],
            [
                2877,
                2889
            ],
            [
                2889,
                2935
            ],
            [
                2942,
                2965
            ],
            [
                2965,
                3028
            ],
            [
                3028,
                3030
            ],
            [
                3048,
                3054
            ],
            [
                3055,
                3065
            ],
            [
                3066,
                3076
            ],
            [
                3077,
                3112
            ],
            [
                3120,
                3122
            ],
            [
                3122,
                3145
            ],
            [
                3146,
                3173
            ],
            [
                3189,
                3202
            ],
            [
                3203,
                3205
            ],
            [
                3206,
                3210
            ],
            [
                3212,
                3310
            ],
            [
                3310,
                3365
            ],
            [
                3366,
                3389
            ],
            [
                3389,
                3416
            ],
            [
                3420,
                3439
            ],
            [
                3439,
                3442
            ],
            [
                3448,
                3456
            ],
            [
                3457,
                3479
            ],
            [
                3485,
                3491
            ],
            [
                3492,
                3504
            ],
            [
                3505,
                3521
            ],
            [
                3522,
                3526
            ],
            [
                3527,
                3530
            ],
            [
                3531,
                3542
            ],
            [
                3543,
                3579
            ],
            [
                3579,
                3627
            ],
            [
                3628,
                3647
            ],
            [
                3647,
                3724
            ],
            [
                3724,
                3726
            ],
            [
                3726,
                3804
            ],
            [
                3805,
                3836
            ],
            [
                3845,
                3849
            ],
            [
                3854,
                3867
            ],
            [
                3867,
                3889
            ],
            [
                3890,
                3920
            ],
            [
                3923,
                3928
            ],
            [
                3934,
                3936
            ],
            [
                3936,
                3964
            ],
            [
                3965,
                3977
            ],
            [
                3980,
                3993
            ],
            [
                3994,
                3997
            ],
            [
                3997,
                4002
            ],
            [
                4003,
                4014
            ],
            [
                4027,
                4035
            ],
            [
                4036,
                4048
            ],
            [
                4048,
                4104
            ],
            [
                4104,
                4117
            ],
            [
                4118,
                4127
            ],
            [
                4128,
                4144
            ],
            [
                4145,
                4185
            ],
            [
                4186,
                4223
            ],
            [
                4224,
                4225
            ],
            [
                4225,
                4251
            ],
            [
                4252,
                4259
            ],
            [
                4265,
                4279
            ],
            [
                4279,
                4281
            ],
            [
                4281,
                4328
            ],
            [
                4329,
                4415
            ],
            [
                4420,
                4422
            ],
            [
                4422,
                4426
            ],
            [
                4426,
                4430
            ],
            [
                4430,
                4469
            ],
            [
                4469,
                4482
            ],
            [
                4482,
                4491
            ],
            [
                4492,
                4495
            ],
            [
                4496,
                4523
            ],
            [
                4523,
                4589
            ],
            [
                4592,
                4632
            ],
            [
                4636,
                4668
            ],
            [
                4668,
                4671
            ],
            [
                4672,
                4723
            ],
            [
                4724,
                4731
            ],
            [
                4732,
                4735
            ],
            [
                4736,
                4755
            ],
            [
                4756,
                4774
            ],
            [
                4775,
                4806
            ],
            [
                4807,
                4819
            ],
            [
                4819,
                4889
            ],
            [
                4891,
                4944
            ],
            [
                4944,
                5027
            ],
            [
                5027,
                5122
            ],
            [
                5122,
                5128
            ],
            [
                5133,
                5145
            ],
            [
                5165,
                5166
            ],
            [
                5171,
                5186
            ],
            [
                5197,
                5201
            ],
            [
                5202,
                5211
            ],
            [
                5211,
                5213
            ],
            [
                5213,
                5264
            ],
            [
                5274,
                5306
            ],
            [
                5307,
                5387
            ],
            [
                5387,
                5454
            ],
            [
                5461,
                5483
            ],
            [
                5484,
                5495
            ],
            [
                5495,
                5503
            ],
            [
                5504,
                5551
            ],
            [
                5552,
                5568
            ],
            [
                5568,
                5593
            ],
            [
                5594,
                5748
            ],
            [
                5754,
                5766
            ],
            [
                5766,
                5767
            ],
            [
                5768,
                5783
            ],
            [
                5796,
                5821
            ],
            [
                5821,
                5833
            ],
            [
                5843,
                5845
            ],
            [
                5846,
                5866
            ],
            [
                5866,
                5867
            ],
            [
                5868,
                5875
            ],
            [
                5876,
                6017
            ],
            [
                6018,
                6027
            ],
            [
                6028,
                6133
            ],
            [
                6133,
                6170
            ],
            [
                6171,
                6251
            ],
            [
                6252,
                6318
            ],
            [
                6318,
                6407
            ],
            [
                6407,
                6408
            ],
            [
                6409,
                6429
            ],
            [
                6436,
                6444
            ],
            [
                6451,
                6454
            ],
            [
                6454,
                6455
            ],
            [
                6456,
                6459
            ],
            [
                6460,
                6509
            ],
            [
                6510,
                6531
            ],
            [
                6531,
                6533
            ],
            [
                6533,
                6621
            ],
            [
                6624,
                6643
            ],
            [
                6643,
                6645
            ],
            [
                6645,
                6673
            ],
            [
                6685,
                6697
            ],
            [
                6697,
                6699
            ],
            [
                6705,
                6710
            ],
            [
                6710,
                6719
            ],
            [
                6719,
                6746
            ],
            [
                6751,
                6765
            ],
            [
                6766,
                6787
            ],
            [
                6787,
                6790
            ],
            [
                6791,
                6811
            ],
            [
                6812,
                6859
            ],
            [
                6865,
                6903
            ],
            [
                6904,
                6919
            ],
            [
                6928,
                6967
            ],
            [
                6967,
                6972
            ],
            [
                6973,
                6976
            ],
            [
                6977,
                7053
            ],
            [
                7060,
                7065
            ],
            [
                7066,
                7142
            ],
            [
                7142,
                7154
            ],
            [
                7159,
                7211
            ],
            [
                7211,
                7264
            ],
            [
                7266,
                7269
            ],
            [
                7270,
                7284
            ],
            [
                7285,
                7295
            ],
            [
                7296,
                7305
            ],
            [
                7306,
                7312
            ],
            [
                7313,
                7316
            ],
            [
                7317,
                7322
            ],
            [
                7322,
                7327
            ],
            [
                7345,
                7347
            ],
            [
                7347,
                7353
            ],
            [
                7358,
                7393
            ],
            [
                7413,
                7447
            ],
            [
                7447,
                7459
            ],
            [
                7465,
                7491
            ],
            [
                7493,
                7520
            ],
            [
                7528,
                7548
            ],
            [
                7549,
                7580
            ],
            [
                7581,
                7610
            ],
            [
                7614,
                7616
            ],
            [
                7616,
                7645
            ],
            [
                7646,
                7737
            ],
            [
                7737,
                7753
            ],
            [
                7765,
                7817
            ],
            [
                7817,
                7844
            ],
            [
                7845,
                7859
            ],
            [
                7860,
                7872
            ],
            [
                7872,
                7875
            ],
            [
                7876,
                7923
            ],
            [
                7924,
                8014
            ],
            [
                8014,
                8029
            ],
            [
                8032,
                8067
            ],
            [
                8071,
                8124
            ],
            [
                8124,
                8147
            ],
            [
                8148,
                8166
            ],
            [
                8167,
                8170
            ],
            [
                8171,
                8234
            ],
            [
                8234,
                8235
            ],
            [
                8236,
                8256
            ],
            [
                8257,
                8306
            ],
            [
                8307,
                8310
            ],
            [
                8311,
                8323
            ],
            [
                8324,
                8326
            ],
            [
                8327,
                8335
            ],
            [
                8343,
                8352
            ],
            [
                8353,
                8365
            ],
            [
                8366,
                8391
            ],
            [
                8392,
                8398
            ],
            [
                8402,
                8411
            ],
            [
                8424,
                8426
            ],
            [
                8427,
                8435
            ],
            [
                8435,
                8437
            ],
            [
                8437,
                8489
            ],
            [
                8489,
                8510
            ],
            [
                8511,
                8542
            ],
            [
                8543,
                8546
            ],
            [
                8547,
                8560
            ],
            [
                8560,
                8610
            ],
            [
                8615,
                8729
            ],
            [
                8730,
                8780
            ],
            [
                8781,
                8861
            ],
            [
                8862,
                8985
            ],
            [
                8986,
                9011
            ],
            [
                9012,
                9069
            ],
            [
                9069,
                9089
            ],
            [
                9095,
                9098
            ],
            [
                9099,
                9121
            ],
            [
                9121,
                9122
            ],
            [
                9123,
                9145
            ],
            [
                9145,
                9147
            ],
            [
                9147,
                9207
            ],
            [
                9208,
                9213
            ],
            [
                9213,
                9214
            ],
            [
                9215,
                9234
            ],
            [
                9245,
                9247
            ],
            [
                9248,
                9283
            ],
            [
                9284,
                9286
            ],
            [
                9300,
                9335
            ],
            [
                9349,
                9384
            ],
            [
                9384,
                9385
            ],
            [
                9386,
                9422
            ],
            [
                9424,
                9459
            ],
            [
                9459,
                9479
            ],
            [
                9480,
                9504
            ],
            [
                9510,
                9522
            ],
            [
                9523,
                9529
            ],
            [
                9529,
                9565
            ],
            [
                9566,
                9609
            ],
            [
                9610,
                9635
            ],
            [
                9636,
                9657
            ],
            [
                9658,
                9665
            ],
            [
                9666,
                9670
            ],
            [
                9671,
                9679
            ],
            [
                9680,
                9683
            ],
            [
                9684,
                9695
            ],
            [
                9695,
                9697
            ],
            [
                9697,
                9742
            ],
            [
                9742,
                9779
            ],
            [
                9779,
                9781
            ],
            [
                9781,
                9811
            ],
            [
                9812,
                9850
            ],
            [
                9861,
                9887
            ],
            [
                9887,
                9889
            ],
            [
                9889,
                9922
            ],
            [
                9932,
                10007
            ],
            [
                10007,
                10057
            ],
            [
                10067,
                10090
            ],
            [
                10099,
                10124
            ],
            [
                10125,
                10194
            ],
            [
                10195,
                10228
            ],
            [
                10232,
                10241
            ],
            [
                10242,
                10245
            ],
            [
                10246,
                10254
            ],
            [
                10255,
                10313
            ],
            [
                10320,
                10334
            ],
            [
                10335,
                10337
            ],
            [
                10338,
                10340
            ],
            [
                10341,
                10348
            ],
            [
                10348,
                10394
            ],
            [
                10395,
                10417
            ],
            [
                10418,
                10470
            ],
            [
                10471,
                10490
            ],
            [
                10492,
                10531
            ],
            [
                10533,
                10563
            ],
            [
                10566,
                10604
            ],
            [
                10605,
                10669
            ],
            [
                10669,
                10671
            ],
            [
                10671,
                10715
            ],
            [
                10716,
                10727
            ],
            [
                10728,
                10744
            ],
            [
                10746,
                10783
            ],
            [
                10786,
                10795
            ],
            [
                10796,
                10809
            ],
            [
                10809,
                10868
            ],
            [
                10868,
                10874
            ],
            [
                10875,
                10984
            ],
            [
                10984,
                11048
            ],
            [
                11053,
                11058
            ],
            [
                11058,
                11060
            ],
            [
                11060,
                11112
            ],
            [
                11118,
                11133
            ],
            [
                11133,
                11143
            ],
            [
                11143,
                11176
            ],
            [
                11178,
                11185
            ],
            [
                11186,
                11209
            ],
            [
                11209,
                11213
            ],
            [
                11220,
                11222
            ],
            [
                11222,
                11224
            ],
            [
                11229,
                11263
            ],
            [
                11264,
                11286
            ],
            [
                11286,
                11292
            ],
            [
                11302,
                11316
            ],
            [
                11321,
                11326
            ],
            [
                11333,
                11359
            ],
            [
                11359,
                11360
            ],
            [
                11368,
                11370
            ],
            [
                11371,
                11380
            ],
            [
                11380,
                11382
            ],
            [
                11382,
                11440
            ],
            [
                11441,
                11482
            ],
            [
                11483,
                11484
            ],
            [
                11484,
                11538
            ],
            [
                11539,
                11568
            ],
            [
                11568,
                11570
            ],
            [
                11570,
                11611
            ],
            [
                11611,
                11613
            ],
            [
                11613,
                11624
            ],
            [
                11629,
                11635
            ],
            [
                11635,
                11725
            ],
            [
                11725,
                11783
            ],
            [
                11783,
                11849
            ],
            [
                11849,
                11965
            ],
            [
                11965,
                12032
            ],
            [
                12033,
                12066
            ],
            [
                12066,
                12068
            ],
            [
                12068,
                12073
            ],
            [
                12081,
                12120
            ],
            [
                12120,
                12122
            ],
            [
                12122,
                12130
            ],
            [
                12146,
                12180
            ],
            [
                12181,
                12188
            ],
            [
                12189,
                12193
            ],
            [
                12194,
                12204
            ],
            [
                12205,
                12207
            ],
            [
                12217,
                12237
            ],
            [
                12239,
                12251
            ],
            [
                12259,
                12295
            ],
            [
                12295,
                12309
            ],
            [
                12311,
                12348
            ],
            [
                12349,
                12353
            ],
            [
                12354,
                12365
            ],
            [
                12365,
                12454
            ],
            [
                12454,
                12563
            ],
            [
                12563,
                12564
            ],
            [
                12564,
                12625
            ],
            [
                12626,
                12653
            ],
            [
                12654,
                12671
            ],
            [
                12676,
                12681
            ],
            [
                12681,
                12683
            ],
            [
                12683,
                12691
            ],
            [
                12700,
                12863
            ],
            [
                12864,
                12870
            ],
            [
                12872,
                13008
            ],
            [
                13009,
                13013
            ],
            [
                13016,
                13017
            ],
            [
                13017,
                13054
            ],
            [
                13054,
                13097
            ],
            [
                13097,
                13099
            ],
            [
                13099,
                13140
            ],
            [
                13140,
                13190
            ],
            [
                13191,
                13196
            ],
            [
                13198,
                13288
            ],
            [
                13290,
                13299
            ],
            [
                13300,
                13317
            ],
            [
                13317,
                13332
            ],
            [
                13334,
                13383
            ],
            [
                13385,
                13418
            ],
            [
                13419,
                13434
            ],
            [
                13435,
                13484
            ],
            [
                13485,
                13558
            ],
            [
                13559,
                13576
            ],
            [
                13576,
                13608
            ],
            [
                13614,
                13618
            ],
            [
                13631,
                13639
            ],
            [
                13639,
                13690
            ],
            [
                13691,
                13719
            ],
            [
                13719,
                13738
            ],
            [
                13739,
                13761
            ],
            [
                13771,
                13850
            ]
        ],
        "row_chars": [
            [
                0,
                196
            ],
            [
                196,
                440
            ],
            [
                440,
                507
            ],
            [
                507,
                618
            ],
            [
                618,
                800
            ],
            [
                800,
                930
            ],
            [
                930,
                999
            ],
            [
                999,
                1117
            ],
            [
                1117,
                1215
            ],
            [
                1215,
                1352
            ],
            [
                1352,
                1352
            ],
            [
                1352,
                1387
            ],
            [
                1387,
                1521
            ],
            [
                1521,
                1672
            ],
            [
                1672,
                1835
            ],
            [
                1835,
                1875
            ],
            [
                1875,
                1965
            ],
            [
                1965,
                1965
            ],
            [
                1965,
                2106
            ],
            [
                2106,
                2334
            ],
            [
                2334,
                2719
            ],
            [
                2719,
                2889
            ],
            [
                2889,
                2965
            ],
            [
                2965,
                3030
            ],
            [
                3030,
                3122
            ],
            [
                3122,
                3442
            ],
            [
                3442,
                3579
            ],
            [
                3579,
                3579
            ],
            [
                3579,
                3726
            ],
            [
                3726,
                3867
            ],
            [
                3867,
                3936
            ],
            [
                3936,
                4186
            ],
            [
                4186,
                4186
            ],
            [
                4186,
                4281
            ],
            [
                4281,
                4422
            ],
            [
                4422,
                4426
            ],
            [
                4426,
                4469
            ],
            [
                4469,
                4482
            ],
            [
                4482,
                4523
            ],
            [
                4523,
                4668
            ],
            [
                4668,
                4756
            ],
            [
                4756,
                4819
            ],
            [
                4819,
                4891
            ],
            [
                4891,
                4944
            ],
            [
                4944,
                5122
            ],
            [
                5122,
                5213
            ],
            [
                5213,
                5387
            ],
            [
                5387,
                5454
            ],
            [
                5454,
                5495
            ],
            [
                5495,
                5568
            ],
            [
                5568,
                5768
            ],
            [
                5768,
                5821
            ],
            [
                5821,
                6018
            ],
            [
                6018,
                6018
            ],
            [
                6018,
                6018
            ],
            [
                6018,
                6018
            ],
            [
                6018,
                6133
            ],
            [
                6133,
                6318
            ],
            [
                6318,
                6533
            ],
            [
                6533,
                6645
            ],
            [
                6645,
                6699
            ],
            [
                6699,
                6787
            ],
            [
                6787,
                7142
            ],
            [
                7142,
                7211
            ],
            [
                7211,
                7347
            ],
            [
                7347,
                7447
            ],
            [
                7447,
                7493
            ],
            [
                7493,
                7616
            ],
            [
                7616,
                7616
            ],
            [
                7616,
                7737
            ],
            [
                7737,
                7817
            ],
            [
                7817,
                7872
            ],
            [
                7872,
                8124
            ],
            [
                8124,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8343
            ],
            [
                8343,
                8437
            ],
            [
                8437,
                8560
            ],
            [
                8560,
                8862
            ],
            [
                8862,
                9123
            ],
            [
                9123,
                9123
            ],
            [
                9123,
                9147
            ],
            [
                9147,
                9215
            ],
            [
                9215,
                9697
            ],
            [
                9697,
                9781
            ],
            [
                9781,
                9889
            ],
            [
                9889,
                10007
            ],
            [
                10007,
                10228
            ],
            [
                10228,
                10418
            ],
            [
                10418,
                10671
            ],
            [
                10671,
                10783
            ],
            [
                10783,
                10809
            ],
            [
                10809,
                10868
            ],
            [
                10868,
                10984
            ],
            [
                10984,
                11060
            ],
            [
                11060,
                11133
            ],
            [
                11133,
                11143
            ],
            [
                11143,
                11209
            ],
            [
                11209,
                11222
            ],
            [
                11222,
                11286
            ],
            [
                11286,
                11382
            ],
            [
                11382,
                11483
            ],
            [
                11483,
                11483
            ],
            [
                11483,
                11483
            ],
            [
                11483,
                11483
            ],
            [
                11483,
                11483
            ],
            [
                11483,
                11570
            ],
            [
                11570,
                11613
            ],
            [
                11613,
                11725
            ],
            [
                11725,
                11783
            ],
            [
                11783,
                11849
            ],
            [
                11849,
                11965
            ],
            [
                11965,
                12033
            ],
            [
                12033,
                12033
            ],
            [
                12033,
                12068
            ],
            [
                12068,
                12122
            ],
            [
                12122,
                12239
            ],
            [
                12239,
                12239
            ],
            [
                12239,
                12239
            ],
            [
                12239,
                12295
            ],
            [
                12295,
                12365
            ],
            [
                12365,
                12454
            ],
            [
                12454,
                12563
            ],
            [
                12563,
                12683
            ],
            [
                12683,
                13016
            ],
            [
                13016,
                13054
            ],
            [
                13054,
                13099
            ],
            [
                13099,
                13099
            ],
            [
                13099,
                13140
            ],
            [
                13140,
                13317
            ],
            [
                13317,
                13385
            ],
            [
                13385,
                13385
            ],
            [
                13385,
                13576
            ],
            [
                13576,
                13719
            ],
            [
                13719,
                13852
            ]
        ]
    }
}