{
    "original": {
        "text": "The amiable behaviour of Mr. Crawley, and Lady Jane's kind reception of her, highly flattered Miss Briggs, who was enabled to speak a good word for the latter, after the cards of the Southdown family had been presented to Miss Crawley. A Countess's card left personally too for her, Briggs, was not a little pleasing to the poor friendless companion. \"What could Lady Southdown mean by leaving a card upon you, I wonder, Miss Briggs?\" said the republican Miss Crawley; upon which the companion meekly said \"that she hoped there could be no harm in a lady of rank taking notice of a poor gentlewoman,\" and she put away this card in her work-box amongst her most cherished personal treasures. Furthermore, Miss Briggs explained how she had met Mr. Crawley walking with his cousin and long affianced bride the day before: and she told how kind and gentle-looking the lady was, and what a plain, not to say common, dress she had, all the articles of which, from the bonnet down to the boots, she described and estimated with female accuracy.\nMiss Crawley allowed Briggs to prattle on without interrupting her too much. As she got well, she was pining for society. Mr. Creamer, her medical man, would not hear of her returning to her old haunts and dissipation in London. The old spinster was too glad to find any companionship at Brighton, and not only were the cards acknowledged the very next day, but Pitt Crawley was graciously invited to come and see his aunt. He came, bringing with him Lady Southdown and her daughter. The dowager did not say a word about the state of Miss Crawley's soul; but talked with much discretion about the weather: about the war and the downfall of the monster Bonaparte: and above all, about doctors, quacks, and the particular merits of Dr. Podgers, whom she then patronised.\nDuring their interview Pitt Crawley made a great stroke, and one which showed that, had his diplomatic career not been blighted by early neglect, he might have risen to a high rank in his profession. When the Countess Dowager of Southdown fell foul of the Corsican upstart, as the fashion was in those days, and showed that he was a monster stained with every conceivable crime, a coward and a tyrant not fit to live, one whose fall was predicted, &c., Pitt Crawley suddenly took up the cudgels in favour of the man of Destiny. He described the First Consul as he saw him at Paris at the peace of Amiens; when he, Pitt Crawley, had the gratification of making the acquaintance of the great and good Mr. Fox, a statesman whom, however much he might differ with him, it was impossible not to admire fervently--a statesman who had always had the highest opinion of the Emperor Napoleon. And he spoke in terms of the strongest indignation of the faithless conduct of the allies towards this dethroned monarch, who, after giving himself generously up to their mercy, was consigned to an ignoble and cruel banishment, while a bigoted Popish rabble was tyrannising over France in his stead.\nThis orthodox horror of Romish superstition saved Pitt Crawley in Lady Southdown's opinion, whilst his admiration for Fox and Napoleon raised him immeasurably in Miss Crawley's eyes. Her friendship with that defunct British statesman was mentioned when we first introduced her in this history. A true Whig, Miss Crawley had been in opposition all through the war, and though, to be sure, the downfall of the Emperor did not very much agitate the old lady, or his ill-treatment tend to shorten her life or natural rest, yet Pitt spoke to her heart when he lauded both her idols; and by that single speech made immense progress in her favour.\n\"And what do you think, my dear?\" Miss Crawley said to the young lady, for whom she had taken a liking at first sight, as she always did for pretty and modest young people; though it must be owned her affections cooled as rapidly as they rose.\nLady Jane blushed very much, and said \"that she did not understand politics, which she left to wiser heads than hers; but though Mamma was, no doubt, correct, Mr. Crawley had spoken beautifully.\" And when the ladies were retiring at the conclusion of their visit, Miss Crawley hoped \"Lady Southdown would be so kind as to send her Lady Jane sometimes, if she could be spared to come down and console a poor sick lonely old woman.\" This promise was graciously accorded, and they separated upon great terms of amity.\n\"Don't let Lady Southdown come again, Pitt,\" said the old lady. \"She is stupid and pompous, like all your mother's family, whom I never could endure. But bring that nice good-natured little Jane as often as ever you please.\" Pitt promised that he would do so. He did not tell the Countess of Southdown what opinion his aunt had formed of her Ladyship, who, on the contrary, thought that she had made a most delightful and majestic impression on Miss Crawley.\nAnd so, nothing loth to comfort a sick lady, and perhaps not sorry in her heart to be freed now and again from the dreary spouting of the Reverend Bartholomew Irons, and the serious toadies who gathered round the footstool of the pompous Countess, her mamma, Lady Jane became a pretty constant visitor to Miss Crawley, accompanied her in her drives, and solaced many of her evenings. She was so naturally good and soft, that even Firkin was not jealous of her; and the gentle Briggs thought her friend was less cruel to her when kind Lady Jane was by. Towards her Ladyship Miss Crawley's manners were charming. The old spinster told her a thousand anecdotes about her youth, talking to her in a very different strain from that in which she had been accustomed to converse with the godless little Rebecca; for there was that in Lady Jane's innocence which rendered light talking impertinence before her, and Miss Crawley was too much of a gentlewoman to offend such purity. The young lady herself had never received kindness except from this old spinster, and her brother and father: and she repaid Miss Crawley's engoument by artless sweetness and friendship.\nIn the autumn evenings (when Rebecca was flaunting at Paris, the gayest among the gay conquerors there, and our Amelia, our dear wounded Amelia, ah! where was she?) Lady Jane would be sitting in Miss Crawley's drawing-room singing sweetly to her, in the twilight, her little simple songs and hymns, while the sun was setting and the sea was roaring on the beach. The old spinster used to wake up when these ditties ceased, and ask for more. As for Briggs, and the quantity of tears of happiness which she now shed as she pretended to knit, and looked out at the splendid ocean darkling before the windows, and the lamps of heaven beginning more brightly to shine--who, I say can measure the happiness and sensibility of Briggs?\nPitt meanwhile in the dining-room, with a pamphlet on the Corn Laws or a Missionary Register by his side, took that kind of recreation which suits romantic and unromantic men after dinner. He sipped Madeira: built castles in the air: thought himself a fine fellow: felt himself much more in love with Jane than he had been any time these seven years, during which their liaison had lasted without the slightest impatience on Pitt's part--and slept a good deal. When the time for coffee came, Mr. Bowls used to enter in a noisy manner, and summon Squire Pitt, who would be found in the dark very busy with his pamphlet.\n\"I wish, my love, I could get somebody to play piquet with me,\" Miss Crawley said one night when this functionary made his appearance with the candles and the coffee. \"Poor Briggs can no more play than an owl, she is so stupid\" (the spinster always took an opportunity of abusing Briggs before the servants); \"and I think I should sleep better if I had my game.\"\nAt this Lady Jane blushed to the tips of her little ears, and down to the ends of her pretty fingers; and when Mr. Bowls had quitted the room, and the door was quite shut, she said:\n\"Miss Crawley, I can play a little. I used to--to play a little with poor dear papa.\"\n\"Come and kiss me. Come and kiss me this instant, you dear good little soul,\" cried Miss Crawley in an ecstasy: and in this picturesque and friendly occupation Mr. Pitt found the old lady and the young one, when he came upstairs with him pamphlet in his hand. How she did blush all the evening, that poor Lady Jane!\nIt must not be imagined that Mr. Pitt Crawley's artifices escaped the attention of his dear relations at the Rectory at Queen's Crawley. Hampshire and Sussex lie very close together, and Mrs. Bute had friends in the latter county who took care to inform her of all, and a great deal more than all, that passed at Miss Crawley's house at Brighton. Pitt was there more and more. He did not come for months together to the Hall, where his abominable old father abandoned himself completely to rum-and-water, and the odious society of the Horrocks family. Pitt's success rendered the Rector's family furious, and Mrs. Bute regretted more (though she confessed less) than ever her monstrous fault in so insulting Miss Briggs, and in being so haughty and parsimonious to Bowls and Firkin, that she had not a single person left in Miss Crawley's household to give her information of what took place there. \"It was all Bute's collar-bone,\" she persisted in saying; \"if that had not broke, I never would have left her. I am a martyr to duty and to your odious unclerical habit of hunting, Bute.\"\n\"Hunting; nonsense! It was you that frightened her, Barbara,\" the divine interposed. \"You're a clever woman, but you've got a devil of a temper; and you're a screw with your money, Barbara.\"\n\"You'd have been screwed in gaol, Bute, if I had not kept your money.\"\n\"I know I would, my dear,\" said the Rector, good-naturedly. \"You ARE a clever woman, but you manage too well, you know\": and the pious man consoled himself with a big glass of port.\n\"What the deuce can she find in that spooney of a Pitt Crawley?\" he continued. \"The fellow has not pluck enough to say Bo to a goose. I remember when Rawdon, who is a man, and be hanged to him, used to flog him round the stables as if he was a whipping-top: and Pitt would go howling home to his ma--ha, ha! Why, either of my boys would whop him with one hand. Jim says he's remembered at Oxford as Miss Crawley still--the spooney.\n\"I say, Barbara,\" his reverence continued, after a pause.\n\"What?\" said Barbara, who was biting her nails, and drumming the table.\n\"I say, why not send Jim over to Brighton to see if he can do anything with the old lady. He's very near getting his degree, you know. He's only been plucked twice--so was I--but he's had the advantages of Oxford and a university education. He knows some of the best chaps there. He pulls stroke in the Boniface boat. He's a handsome feller. D---- it, ma'am, let's put him on the old woman, hey, and tell him to thrash Pitt if he says anything. Ha, ha, ha!\n\"Jim might go down and see her, certainly,\" the housewife said; adding with a sigh, \"If we could but get one of the girls into the house; but she could never endure them, because they are not pretty!\" Those unfortunate and well-educated women made themselves heard from the neighbouring drawing-room, where they were thrumming away, with hard fingers, an elaborate music-piece on the piano-forte, as their mother spoke; and indeed, they were at music, or at backboard, or at geography, or at history, the whole day long. But what avail all these accomplishments, in Vanity Fair, to girls who are short, poor, plain, and have a bad complexion? Mrs. Bute could think of nobody but the Curate to take one of them off her hands; and Jim coming in from the stable at this minute, through the parlour window, with a short pipe stuck in his oilskin cap, he and his father fell to talking about odds on the St. Leger, and the colloquy between the Rector and his wife ended.\nMrs. Bute did not augur much good to the cause from the sending of her son James as an ambassador, and saw him depart in rather a despairing mood. Nor did the young fellow himself, when told what his mission was to be, expect much pleasure or benefit from it; but he was consoled by the thought that possibly the old lady would give him some handsome remembrance of her, which would pay a few of his most pressing bills at the commencement of the ensuing Oxford term, and so took his place by the coach from Southampton, and was safely landed at Brighton on the same evening with his portmanteau, his favourite bull-dog Towzer, and an immense basket of farm and garden produce, from the dear Rectory folks to the dear Miss Crawley. Considering it was too late to disturb the invalid lady on the first night of his arrival, he put up at an inn, and did not wait upon Miss Crawley until a late hour in the noon of next day.\nJames Crawley, when his aunt had last beheld him, was a gawky lad, at that uncomfortable age when the voice varies between an unearthly treble and a preternatural bass; when the face not uncommonly blooms out with appearances for which Rowland's Kalydor is said to act as a cure; when boys are seen to shave furtively with their sister's scissors, and the sight of other young women produces intolerable sensations of terror in them; when the great hands and ankles protrude a long way from garments which have grown too tight for them; when their presence after dinner is at once frightful to the ladies, who are whispering in the twilight in the drawing-room, and inexpressibly odious to the gentlemen over the mahogany, who are restrained from freedom of intercourse and delightful interchange of wit by the presence of that gawky innocence; when, at the conclusion of the second glass, papa says, \"Jack, my boy, go out and see if the evening holds up,\" and the youth, willing to be free, yet hurt at not being yet a man, quits the incomplete banquet. James, then a hobbadehoy, was now become a young man, having had the benefits of a university education, and acquired the inestimable polish which is gained by living in a fast set at a small college, and contracting debts, and being rusticated, and being plucked.\nHe was a handsome lad, however, when he came to present himself to his aunt at Brighton, and good looks were always a title to the fickle old lady's favour. Nor did his blushes and awkwardness take away from it: she was pleased with these healthy tokens of the young gentleman's ingenuousness.\nHe said \"he had come down for a couple of days to see a man of his college, and--and to pay my respects to you, Ma'am, and my father's and mother's, who hope you are well.\"\nPitt was in the room with Miss Crawley when the lad was announced, and looked very blank when his name was mentioned. The old lady had plenty of humour, and enjoyed her correct nephew's perplexity. She asked after all the people at the Rectory with great interest; and said she was thinking of paying them a visit. She praised the lad to his face, and said he was well-grown and very much improved, and that it was a pity his sisters had not some of his good looks; and finding, on inquiry, that he had taken up his quarters at an hotel, would not hear of his stopping there, but bade Mr. Bowls send for Mr. James Crawley's things instantly; \"and hark ye, Bowls,\" she added, with great graciousness, \"you will have the goodness to pay Mr. James's bill.\"\nShe flung Pitt a look of arch triumph, which caused that diplomatist almost to choke with envy. Much as he had ingratiated himself with his aunt, she had never yet invited him to stay under her roof, and here was a young whipper-snapper, who at first sight was made welcome there.\n\"I beg your pardon, sir,\" says Bowls, advancing with a profound bow; \"what 'otel, sir, shall Thomas fetch the luggage from?\"\n\"O, dam,\" said young James, starting up, as if in some alarm, \"I'll go.\"\n\"What!\" said Miss Crawley.\n\"The Tom Cribb's Arms,\" said James, blushing deeply.\nMiss Crawley burst out laughing at this title. Mr. Bowls gave one abrupt guffaw, as a confidential servant of the family, but choked the rest of the volley; the diplomatist only smiled.\n\"I--I didn't know any better,\" said James, looking down. \"I've never been here before; it was the coachman told me.\" The young story-teller! The fact is, that on the Southampton coach, the day previous, James Crawley had met the Tutbury Pet, who was coming to Brighton to make a match with the Rottingdean Fibber; and enchanted by the Pet's conversation, had passed the evening in company with that scientific man and his friends, at the inn in question.\n\"I--I'd best go and settle the score,\" James continued. \"Couldn't think of asking you, Ma'am,\" he added, generously.\nThis delicacy made his aunt laugh the more.\n\"Go and settle the bill, Bowls,\" she said, with a wave of her hand, \"and bring it to me.\"\nPoor lady, she did not know what she had done! \"There--there's a little dawg,\" said James, looking frightfully guilty. \"I'd best go for him. He bites footmen's calves.\"\nAll the party cried out with laughing at this description; even Briggs and Lady Jane, who was sitting mute during the interview between Miss Crawley and her nephew: and Bowls, without a word, quitted the room.\nStill, by way of punishing her elder nephew, Miss Crawley persisted in being gracious to the young Oxonian. There were no limits to her kindness or her compliments when they once began. She told Pitt he might come to dinner, and insisted that James should accompany her in her drive, and paraded him solemnly up and down the cliff, on the back seat of the barouche. During all this excursion, she condescended to say civil things to him: she quoted Italian and French poetry to the poor bewildered lad, and persisted that he was a fine scholar, and was perfectly sure he would gain a gold medal, and be a Senior Wrangler.\n\"Haw, haw,\" laughed James, encouraged by these compliments; \"Senior Wrangler, indeed; that's at the other shop.\"\n\"What is the other shop, my dear child?\" said the lady.\n\"Senior Wranglers at Cambridge, not Oxford,\" said the scholar, with a knowing air; and would probably have been more confidential, but that suddenly there appeared on the cliff in a tax-cart, drawn by a bang-up pony, dressed in white flannel coats, with mother-of-pearl buttons, his friends the Tutbury Pet and the Rottingdean Fibber, with three other gentlemen of their acquaintance, who all saluted poor James there in the carriage as he sate. This incident damped the ingenuous youth's spirits, and no word of yea or nay could he be induced to utter during the rest of the drive.\nOn his return he found his room prepared, and his portmanteau ready, and might have remarked that Mr. Bowls's countenance, when the latter conducted him to his apartments, wore a look of gravity, wonder, and compassion. But the thought of Mr. Bowls did not enter his head. He was deploring the dreadful predicament in which he found himself, in a house full of old women, jabbering French and Italian, and talking poetry to him. \"Reglarly up a tree, by jingo!\" exclaimed the modest boy, who could not face the gentlest of her sex--not even Briggs--when she began to talk to him; whereas, put him at Iffley Lock, and he could out-slang the boldest bargeman.\nAt dinner, James appeared choking in a white neckcloth, and had the honour of handing my Lady Jane downstairs, while Briggs and Mr. Crawley followed afterwards, conducting the old lady, with her apparatus of bundles, and shawls, and cushions. Half of Briggs's time at dinner was spent in superintending the invalid's comfort, and in cutting up chicken for her fat spaniel. James did not talk much, but he made a point of asking all the ladies to drink wine, and accepted Mr. Crawley's challenge, and consumed the greater part of a bottle of champagne which Mr. Bowls was ordered to produce in his honour. The ladies having withdrawn, and the two cousins being left together, Pitt, the ex-diplomatist, he came very communicative and friendly. He asked after James's career at college--what his prospects in life were--hoped heartily he would get on; and, in a word, was frank and amiable. James's tongue unloosed with the port, and he told his cousin his life, his prospects, his debts, his troubles at the little-go, and his rows with the proctors, filling rapidly from the bottles before him, and flying from Port to Madeira with joyous activity.\n\"The chief pleasure which my aunt has,\" said Mr. Crawley, filling his glass, \"is that people should do as they like in her house. This is Liberty Hall, James, and you can't do Miss Crawley a greater kindness than to do as you please, and ask for what you will. I know you have all sneered at me in the country for being a Tory. Miss Crawley is liberal enough to suit any fancy. She is a Republican in principle, and despises everything like rank or title.\"\n\"Why are you going to marry an Earl's daughter?\" said James.\n\"My dear friend, remember it is not poor Lady Jane's fault that she is well born,\" Pitt replied, with a courtly air. \"She cannot help being a lady. Besides, I am a Tory, you know.\"\n\"Oh, as for that,\" said Jim, \"there's nothing like old blood; no, dammy, nothing like it. I'm none of your radicals. I know what it is to be a gentleman, dammy. See the chaps in a boat-race; look at the fellers in a fight; aye, look at a dawg killing rats--which is it wins? the good-blooded ones. Get some more port, Bowls, old boy, whilst I buzz this bottle here. What was I asaying?\"\n\"I think you were speaking of dogs killing rats,\" Pitt remarked mildly, handing his cousin the decanter to \"buzz.\"\n\"Killing rats was I? Well, Pitt, are you a sporting man? Do you want to see a dawg as CAN kill a rat? If you do, come down with me to Tom Corduroy's, in Castle Street Mews, and I'll show you such a bull-terrier as--Pooh! gammon,\" cried James, bursting out laughing at his own absurdity--\"YOU don't care about a dawg or rat; it's all nonsense. I'm blest if I think you know the difference between a dog and a duck.\"\n\"No; by the way,\" Pitt continued with increased blandness, \"it was about blood you were talking, and the personal advantages which people derive from patrician birth. Here's the fresh bottle.\"\n\"Blood's the word,\" said James, gulping the ruby fluid down. \"Nothing like blood, sir, in hosses, dawgs, AND men. Why, only last term, just before I was rusticated, that is, I mean just before I had the measles, ha, ha--there was me and Ringwood of Christchurch, Bob Ringwood, Lord Cinqbars' son, having our beer at the Bell at Blenheim, when the Banbury bargeman offered to fight either of us for a bowl of punch. I couldn't. My arm was in a sling; couldn't even take the drag down--a brute of a mare of mine had fell with me only two days before, out with the Abingdon, and I thought my arm was broke. Well, sir, I couldn't finish him, but Bob had his coat off at once--he stood up to the Banbury man for three minutes, and polished him off in four rounds easy. Gad, how he did drop, sir, and what was it? Blood, sir, all blood.\"\n\"You don't drink, James,\" the ex-attache continued. \"In my time at Oxford, the men passed round the bottle a little quicker than you young fellows seem to do.\"\n\"Come, come,\" said James, putting his hand to his nose and winking at his cousin with a pair of vinous eyes, \"no jokes, old boy; no trying it on on me. You want to trot me out, but it's no go. In vino veritas, old boy. Mars, Bacchus, Apollo virorum, hey? I wish my aunt would send down some of this to the governor; it's a precious good tap.\"\n\"You had better ask her,\" Machiavel continued, \"or make the best of your time now. What says the bard? 'Nunc vino pellite curas, Cras ingens iterabimus aequor,'\" and the Bacchanalian, quoting the above with a House of Commons air, tossed off nearly a thimbleful of wine with an immense flourish of his glass.\nAt the Rectory, when the bottle of port wine was opened after dinner, the young ladies had each a glass from a bottle of currant wine. Mrs. Bute took one glass of port, honest James had a couple commonly, but as his father grew very sulky if he made further inroads on the bottle, the good lad generally refrained from trying for more, and subsided either into the currant wine, or to some private gin-and-water in the stables, which he enjoyed in the company of the coachman and his pipe. At Oxford, the quantity of wine was unlimited, but the quality was inferior: but when quantity and quality united as at his aunt's house, James showed that he could appreciate them indeed; and hardly needed any of his cousin's encouragement in draining off the second bottle supplied by Mr. Bowls.\nWhen the time for coffee came, however, and for a return to the ladies, of whom he stood in awe, the young gentleman's agreeable frankness left him, and he relapsed into his usual surly timidity; contenting himself by saying yes and no, by scowling at Lady Jane, and by upsetting one cup of coffee during the evening.\nIf he did not speak he yawned in a pitiable manner, and his presence threw a damp upon the modest proceedings of the evening, for Miss Crawley and Lady Jane at their piquet, and Miss Briggs at her work, felt that his eyes were wildly fixed on them, and were uneasy under that maudlin look.\n\"He seems a very silent, awkward, bashful lad,\" said Miss Crawley to Mr. Pitt.\n\"He is more communicative in men's society than with ladies,\" Machiavel dryly replied: perhaps rather disappointed that the port wine had not made Jim speak more.\nHe had spent the early part of the next morning in writing home to his mother a most flourishing account of his reception by Miss Crawley. But ah! he little knew what evils the day was bringing for him, and how short his reign of favour was destined to be. A circumstance which Jim had forgotten--a trivial but fatal circumstance--had taken place at the Cribb's Arms on the night before he had come to his aunt's house. It was no other than this--Jim, who was always of a generous disposition, and when in his cups especially hospitable, had in the course of the night treated the Tutbury champion and the Rottingdean man, and their friends, twice or thrice to the refreshment of gin-and-water--so that no less than eighteen glasses of that fluid at eightpence per glass were charged in Mr. James Crawley's bill. It was not the amount of eightpences, but the quantity of gin which told fatally against poor James's character, when his aunt's butler, Mr. Bowls, went down at his mistress's request to pay the young gentleman's bill. The landlord, fearing lest the account should be refused altogether, swore solemnly that the young gent had consumed personally every farthing's worth of the liquor: and Bowls paid the bill finally, and showed it on his return home to Mrs. Firkin, who was shocked at the frightful prodigality of gin; and took the bill to Miss Briggs as accountant-general; who thought it her duty to mention the circumstance to her principal, Miss Crawley.\nHad he drunk a dozen bottles of claret, the old spinster could have pardoned him. Mr. Fox and Mr. Sheridan drank claret. Gentlemen drank claret. But eighteen glasses of gin consumed among boxers in an ignoble pot-house--it was an odious crime and not to be pardoned readily. Everything went against the lad: he came home perfumed from the stables, whither he had been to pay his dog Towzer a visit--and whence he was going to take his friend out for an airing, when he met Miss Crawley and her wheezy Blenheim spaniel, which Towzer would have eaten up had not the Blenheim fled squealing to the protection of Miss Briggs, while the atrocious master of the bull-dog stood laughing at the horrible persecution.\nThis day too the unlucky boy's modesty had likewise forsaken him. He was lively and facetious at dinner. During the repast he levelled one or two jokes against Pitt Crawley: he drank as much wine as upon the previous day; and going quite unsuspiciously to the drawing-room, began to entertain the ladies there with some choice Oxford stories. He described the different pugilistic qualities of Molyneux and Dutch Sam, offered playfully to give Lady Jane the odds upon the Tutbury Pet against the Rottingdean man, or take them, as her Ladyship chose: and crowned the pleasantry by proposing to back himself against his cousin Pitt Crawley, either with or without the gloves. \"And that's a fair offer, my buck,\" he said, with a loud laugh, slapping Pitt on the shoulder, \"and my father told me to make it too, and he'll go halves in the bet, ha, ha!\" So saying, the engaging youth nodded knowingly at poor Miss Briggs, and pointed his thumb over his shoulder at Pitt Crawley in a jocular and exulting manner.\nPitt was not pleased altogether perhaps, but still not unhappy in the main. Poor Jim had his laugh out: and staggered across the room with his aunt's candle, when the old lady moved to retire, and offered to salute her with the blandest tipsy smile: and he took his own leave and went upstairs to his bedroom perfectly satisfied with himself, and with a pleased notion that his aunt's money would be left to him in preference to his father and all the rest of the family.\nOnce up in the bedroom, one would have thought he could not make matters worse; and yet this unlucky boy did. The moon was shining very pleasantly out on the sea, and Jim, attracted to the window by the romantic appearance of the ocean and the heavens, thought he would further enjoy them while smoking. Nobody would smell the tobacco, he thought, if he cunningly opened the window and kept his head and pipe in the fresh air. This he did: but being in an excited state, poor Jim had forgotten that his door was open all this time, so that the breeze blowing inwards and a fine thorough draught being established, the clouds of tobacco were carried downstairs, and arrived with quite undiminished fragrance to Miss Crawley and Miss Briggs.\nThe pipe of tobacco finished the business: and the Bute-Crawleys never knew how many thousand pounds it cost them. Firkin rushed downstairs to Bowls who was reading out the \"Fire and the Frying Pan\" to his aide-de-camp in a loud and ghostly voice. The dreadful secret was told to him by Firkin with so frightened a look, that for the first moment Mr. Bowls and his young man thought that robbers were in the house, the legs of whom had probably been discovered by the woman under Miss Crawley's bed. When made aware of the fact, however--to rush upstairs at three steps at a time to enter the unconscious James's apartment, calling out, \"Mr. James,\" in a voice stifled with alarm, and to cry, \"For Gawd's sake, sir, stop that 'ere pipe,\" was the work of a minute with Mr. Bowls. \"O, Mr. James, what 'AVE you done!\" he said in a voice of the deepest pathos, as he threw the implement out of the window. \"What 'ave you done, sir! Missis can't abide 'em.\"\n\"Missis needn't smoke,\" said James with a frantic misplaced laugh, and thought the whole matter an excellent joke. But his feelings were very different in the morning, when Mr. Bowls's young man, who operated upon Mr. James's boots, and brought him his hot water to shave that beard which he was so anxiously expecting, handed a note in to Mr. James in bed, in the handwriting of Miss Briggs.\n\"Dear sir,\" it said, \"Miss Crawley has passed an exceedingly disturbed night, owing to the shocking manner in which the house has been polluted by tobacco; Miss Crawley bids me say she regrets that she is too unwell to see you before you go--and above all that she ever induced you to remove from the ale-house, where she is sure you will be much more comfortable during the rest of your stay at Brighton.\"\nAnd herewith honest James's career as a candidate for his aunt's favour ended. He had in fact, and without knowing it, done what he menaced to do. He had fought his cousin Pitt with the gloves.\nWhere meanwhile was he who had been once first favourite for this race for money? Becky and Rawdon, as we have seen, were come together after Waterloo, and were passing the winter of 1815 at Paris in great splendour and gaiety. Rebecca was a good economist, and the price poor Jos Sedley had paid for her two horses was in itself sufficient to keep their little establishment afloat for a year, at the least; there was no occasion to turn into money \"my pistols, the same which I shot Captain Marker,\" or the gold dressing-case, or the cloak lined with sable. Becky had it made into a pelisse for herself, in which she rode in the Bois de Boulogne to the admiration of all: and you should have seen the scene between her and her delighted husband, whom she rejoined after the army had entered Cambray, and when she unsewed herself, and let out of her dress all those watches, knick-knacks, bank-notes, cheques, and valuables, which she had secreted in the wadding, previous to her meditated flight from Brussels! Tufto was charmed, and Rawdon roared with delighted laughter, and swore that she was better than any play he ever saw, by Jove. And the way in which she jockeyed Jos, and which she described with infinite fun, carried up his delight to a pitch of quite insane enthusiasm. He believed in his wife as much as the French soldiers in Napoleon.\nHer success in Paris was remarkable. All the French ladies voted her charming. She spoke their language admirably. She adopted at once their grace, their liveliness, their manner. Her husband was stupid certainly--all English are stupid--and, besides, a dull husband at Paris is always a point in a lady's favour. He was the heir of the rich and spirituelle Miss Crawley, whose house had been open to so many of the French noblesse during the emigration. They received the colonel's wife in their own hotels--\"Why,\" wrote a great lady to Miss Crawley, who had bought her lace and trinkets at the Duchess's own price, and given her many a dinner during the pinching times after the Revolution--\"Why does not our dear Miss come to her nephew and niece, and her attached friends in Paris? All the world raffoles of the charming Mistress and her espiegle beauty. Yes, we see in her the grace, the charm, the wit of our dear friend Miss Crawley! The King took notice of her yesterday at the Tuileries, and we are all jealous of the attention which Monsieur pays her. If you could have seen the spite of a certain stupid Miladi Bareacres (whose eagle-beak and toque and feathers may be seen peering over the heads of all assemblies) when Madame, the Duchess of Angouleme, the august daughter and companion of kings, desired especially to be presented to Mrs. Crawley, as your dear daughter and protegee, and thanked her in the name of France, for all your benevolence towards our unfortunates during their exile! She is of all the societies, of all the balls--of the balls--yes--of the dances, no; and yet how interesting and pretty this fair creature looks surrounded by the homage of the men, and so soon to be a mother! To hear her speak of you, her protectress, her mother, would bring tears to the eyes of ogres. How she loves you! how we all love our admirable, our respectable Miss Crawley!\"\nIt is to be feared that this letter of the Parisian great lady did not by any means advance Mrs. Becky's interest with her admirable, her respectable, relative. On the contrary, the fury of the old spinster was beyond bounds, when she found what was Rebecca's situation, and how audaciously she had made use of Miss Crawley's name, to get an entree into Parisian society. Too much shaken in mind and body to compose a letter in the French language in reply to that of her correspondent, she dictated to Briggs a furious answer in her own native tongue, repudiating Mrs. Rawdon Crawley altogether, and warning the public to beware of her as a most artful and dangerous person. But as Madame the Duchess of X--had only been twenty years in England, she did not understand a single word of the language, and contented herself by informing Mrs. Rawdon Crawley at their next meeting, that she had received a charming letter from that chere Mees, and that it was full of benevolent things for Mrs. Crawley, who began seriously to have hopes that the spinster would relent.\nMeanwhile, she was the gayest and most admired of Englishwomen: and had a little European congress on her reception-night. Prussians and Cossacks, Spanish and English--all the world was at Paris during this famous winter: to have seen the stars and cordons in Rebecca's humble saloon would have made all Baker Street pale with envy. Famous warriors rode by her carriage in the Bois, or crowded her modest little box at the Opera. Rawdon was in the highest spirits. There were no duns in Paris as yet: there were parties every day at Very's or Beauvilliers'; play was plentiful and his luck good. Tufto perhaps was sulky. Mrs. Tufto had come over to Paris at her own invitation, and besides this contretemps, there were a score of generals now round Becky's chair, and she might take her choice of a dozen bouquets when she went to the play. Lady Bareacres and the chiefs of the English society, stupid and irreproachable females, writhed with anguish at the success of the little upstart Becky, whose poisoned jokes quivered and rankled in their chaste breasts. But she had all the men on her side. She fought the women with indomitable courage, and they could not talk scandal in any tongue but their own.\nSo in fetes, pleasures, and prosperity, the winter of 1815-16 passed away with Mrs. Rawdon Crawley, who accommodated herself to polite life as if her ancestors had been people of fashion for centuries past--and who from her wit, talent, and energy, indeed merited a place of honour in Vanity Fair. In the early spring of 1816, Galignani's Journal contained the following announcement in an interesting corner of the paper: \"On the 26th of March--the Lady of Lieutenant-Colonel Crawley, of the Life Guards Green--of a son and heir.\"\nThis event was copied into the London papers, out of which Miss Briggs read the statement to Miss Crawley, at breakfast, at Brighton. The intelligence, expected as it might have been, caused a crisis in the affairs of the Crawley family. The spinster's rage rose to its height, and sending instantly for Pitt, her nephew, and for the Lady Southdown, from Brunswick Square, she requested an immediate celebration of the marriage which had been so long pending between the two families. And she announced that it was her intention to allow the young couple a thousand a year during her lifetime, at the expiration of which the bulk of her property would be settled upon her nephew and her dear niece, Lady Jane Crawley. Waxy came down to ratify the deeds--Lord Southdown gave away his sister--she was married by a Bishop, and not by the Rev. Bartholomew Irons--to the disappointment of the irregular prelate.\nWhen they were married, Pitt would have liked to take a hymeneal tour with his bride, as became people of their condition. But the affection of the old lady towards Lady Jane had grown so strong, that she fairly owned she could not part with her favourite. Pitt and his wife came therefore and lived with Miss Crawley: and (greatly to the annoyance of poor Pitt, who conceived himself a most injured character--being subject to the humours of his aunt on one side, and of his mother-in-law on the other). Lady Southdown, from her neighbouring house, reigned over the whole family--Pitt, Lady Jane, Miss Crawley, Briggs, Bowls, Firkin, and all. She pitilessly dosed them with her tracts and her medicine, she dismissed Creamer, she installed Rodgers, and soon stripped Miss Crawley of even the semblance of authority. The poor soul grew so timid that she actually left off bullying Briggs any more, and clung to her niece, more fond and terrified every day. Peace to thee, kind and selfish, vain and generous old heathen!--We shall see thee no more. Let us hope that Lady Jane supported her kindly, and led her with gentle hand out of the busy struggle of Vanity Fair.",
        "paragraph_chars": [
            [
                0,
                1038
            ],
            [
                1038,
                1807
            ],
            [
                1807,
                2991
            ],
            [
                2991,
                3632
            ],
            [
                3632,
                3876
            ],
            [
                3876,
                4391
            ],
            [
                4391,
                4850
            ],
            [
                4850,
                6010
            ],
            [
                6010,
                6738
            ],
            [
                6738,
                7357
            ],
            [
                7357,
                7720
            ],
            [
                7720,
                7902
            ],
            [
                7902,
                7988
            ],
            [
                7988,
                8304
            ],
            [
                8304,
                9391
            ],
            [
                9391,
                9582
            ],
            [
                9582,
                9653
            ],
            [
                9653,
                9835
            ],
            [
                9835,
                10267
            ],
            [
                10267,
                10325
            ],
            [
                10325,
                10397
            ],
            [
                10397,
                10854
            ],
            [
                10854,
                11820
            ],
            [
                11820,
                12742
            ],
            [
                12742,
                14062
            ],
            [
                14062,
                14356
            ],
            [
                14356,
                14529
            ],
            [
                14529,
                15283
            ],
            [
                15283,
                15564
            ],
            [
                15564,
                15689
            ],
            [
                15689,
                15762
            ],
            [
                15762,
                15789
            ],
            [
                15789,
                15842
            ],
            [
                15842,
                16028
            ],
            [
                16028,
                16483
            ],
            [
                16483,
                16600
            ],
            [
                16600,
                16644
            ],
            [
                16644,
                16734
            ],
            [
                16734,
                16903
            ],
            [
                16903,
                17113
            ],
            [
                17113,
                17735
            ],
            [
                17735,
                17848
            ],
            [
                17848,
                17904
            ],
            [
                17904,
                18487
            ],
            [
                18487,
                19144
            ],
            [
                19144,
                20292
            ],
            [
                20292,
                20749
            ],
            [
                20749,
                20810
            ],
            [
                20810,
                20991
            ],
            [
                20991,
                21378
            ],
            [
                21378,
                21493
            ],
            [
                21493,
                21908
            ],
            [
                21908,
                22101
            ],
            [
                22101,
                22933
            ],
            [
                22933,
                23093
            ],
            [
                23093,
                23436
            ],
            [
                23436,
                23745
            ],
            [
                23745,
                24533
            ],
            [
                24533,
                24851
            ],
            [
                24851,
                25141
            ],
            [
                25141,
                25220
            ],
            [
                25220,
                25383
            ],
            [
                25383,
                26856
            ],
            [
                26856,
                27565
            ],
            [
                27565,
                28572
            ],
            [
                28572,
                29044
            ],
            [
                29044,
                29784
            ],
            [
                29784,
                30737
            ],
            [
                30737,
                31130
            ],
            [
                31130,
                31537
            ],
            [
                31537,
                31731
            ],
            [
                31731,
                33084
            ],
            [
                33084,
                34977
            ],
            [
                34977,
                36044
            ],
            [
                36044,
                37251
            ],
            [
                37251,
                37783
            ],
            [
                37783,
                38690
            ],
            [
                38690,
                39857
            ]
        ],
        "segment_chars": [
            [
                0,
                236
            ],
            [
                236,
                351
            ],
            [
                351,
                435
            ],
            [
                435,
                691
            ],
            [
                691,
                1038
            ],
            [
                1038,
                1115
            ],
            [
                1115,
                1160
            ],
            [
                1160,
                1267
            ],
            [
                1267,
                1462
            ],
            [
                1462,
                1522
            ],
            [
                1522,
                1807
            ],
            [
                1807,
                2007
            ],
            [
                2007,
                2335
            ],
            [
                2335,
                2691
            ],
            [
                2691,
                2991
            ],
            [
                2991,
                3174
            ],
            [
                3174,
                3285
            ],
            [
                3285,
                3632
            ],
            [
                3632,
                3666
            ],
            [
                3666,
                3876
            ],
            [
                3876,
                4072
            ],
            [
                4072,
                4307
            ],
            [
                4307,
                4391
            ],
            [
                4391,
                4455
            ],
            [
                4455,
                4541
            ],
            [
                4541,
                4616
            ],
            [
                4616,
                4651
            ],
            [
                4651,
                4850
            ],
            [
                4850,
                5234
            ],
            [
                5234,
                5402
            ],
            [
                5402,
                5461
            ],
            [
                5461,
                5823
            ],
            [
                5823,
                6010
            ],
            [
                6010,
                6159
            ],
            [
                6159,
                6175
            ],
            [
                6175,
                6373
            ],
            [
                6373,
                6451
            ],
            [
                6451,
                6738
            ],
            [
                6738,
                6927
            ],
            [
                6927,
                7199
            ],
            [
                7199,
                7357
            ],
            [
                7357,
                7524
            ],
            [
                7524,
                7720
            ],
            [
                7720,
                7902
            ],
            [
                7902,
                7938
            ],
            [
                7938,
                7988
            ],
            [
                7988,
                8007
            ],
            [
                8007,
                8248
            ],
            [
                8248,
                8304
            ],
            [
                8304,
                8441
            ],
            [
                8441,
                8651
            ],
            [
                8651,
                8681
            ],
            [
                8681,
                8856
            ],
            [
                8856,
                9203
            ],
            [
                9203,
                9314
            ],
            [
                9314,
                9391
            ],
            [
                9391,
                9411
            ],
            [
                9411,
                9476
            ],
            [
                9476,
                9582
            ],
            [
                9582,
                9653
            ],
            [
                9653,
                9713
            ],
            [
                9713,
                9835
            ],
            [
                9835,
                9900
            ],
            [
                9900,
                9914
            ],
            [
                9914,
                9969
            ],
            [
                9969,
                10143
            ],
            [
                10143,
                10196
            ],
            [
                10196,
                10267
            ],
            [
                10267,
                10325
            ],
            [
                10325,
                10333
            ],
            [
                10333,
                10397
            ],
            [
                10397,
                10487
            ],
            [
                10487,
                10532
            ],
            [
                10532,
                10638
            ],
            [
                10638,
                10677
            ],
            [
                10677,
                10715
            ],
            [
                10715,
                10739
            ],
            [
                10739,
                10842
            ],
            [
                10842,
                10854
            ],
            [
                10854,
                11055
            ],
            [
                11055,
                11375
            ],
            [
                11375,
                11497
            ],
            [
                11497,
                11820
            ],
            [
                11820,
                11967
            ],
            [
                11967,
                12552
            ],
            [
                12552,
                12742
            ],
            [
                12742,
                13797
            ],
            [
                13797,
                14062
            ],
            [
                14062,
                14219
            ],
            [
                14219,
                14356
            ],
            [
                14356,
                14529
            ],
            [
                14529,
                14647
            ],
            [
                14647,
                14727
            ],
            [
                14727,
                14844
            ],
            [
                14844,
                15283
            ],
            [
                15283,
                15379
            ],
            [
                15379,
                15564
            ],
            [
                15564,
                15689
            ],
            [
                15689,
                15762
            ],
            [
                15762,
                15770
            ],
            [
                15770,
                15789
            ],
            [
                15789,
                15842
            ],
            [
                15842,
                15889
            ],
            [
                15889,
                16028
            ],
            [
                16028,
                16085
            ],
            [
                16085,
                16145
            ],
            [
                16145,
                16169
            ],
            [
                16169,
                16483
            ],
            [
                16483,
                16539
            ],
            [
                16539,
                16600
            ],
            [
                16600,
                16644
            ],
            [
                16644,
                16734
            ],
            [
                16734,
                16781
            ],
            [
                16781,
                16853
            ],
            [
                16853,
                16875
            ],
            [
                16875,
                16903
            ],
            [
                16903,
                17113
            ],
            [
                17113,
                17221
            ],
            [
                17221,
                17299
            ],
            [
                17299,
                17479
            ],
            [
                17479,
                17735
            ],
            [
                17735,
                17848
            ],
            [
                17848,
                17889
            ],
            [
                17889,
                17904
            ],
            [
                17904,
                18350
            ],
            [
                18350,
                18487
            ],
            [
                18487,
                18707
            ],
            [
                18707,
                18760
            ],
            [
                18760,
                18916
            ],
            [
                18916,
                18948
            ],
            [
                18948,
                19144
            ],
            [
                19144,
                19387
            ],
            [
                19387,
                19517
            ],
            [
                19517,
                19749
            ],
            [
                19749,
                19886
            ],
            [
                19886,
                20032
            ],
            [
                20032,
                20292
            ],
            [
                20292,
                20422
            ],
            [
                20422,
                20553
            ],
            [
                20553,
                20620
            ],
            [
                20620,
                20670
            ],
            [
                20670,
                20749
            ],
            [
                20749,
                20798
            ],
            [
                20798,
                20810
            ],
            [
                20810,
                20927
            ],
            [
                20927,
                20958
            ],
            [
                20958,
                20991
            ],
            [
                20991,
                21081
            ],
            [
                21081,
                21108
            ],
            [
                21108,
                21152
            ],
            [
                21152,
                21266
            ],
            [
                21266,
                21289
            ],
            [
                21289,
                21357
            ],
            [
                21357,
                21378
            ],
            [
                21378,
                21493
            ],
            [
                21493,
                21514
            ],
            [
                21514,
                21550
            ],
            [
                21550,
                21595
            ],
            [
                21595,
                21714
            ],
            [
                21714,
                21836
            ],
            [
                21836,
                21908
            ],
            [
                21908,
                22075
            ],
            [
                22075,
                22101
            ],
            [
                22101,
                22162
            ],
            [
                22162,
                22215
            ],
            [
                22215,
                22516
            ],
            [
                22516,
                22528
            ],
            [
                22528,
                22705
            ],
            [
                22705,
                22865
            ],
            [
                22865,
                22909
            ],
            [
                22909,
                22933
            ],
            [
                22933,
                22985
            ],
            [
                22985,
                23093
            ],
            [
                23093,
                23245
            ],
            [
                23245,
                23286
            ],
            [
                23286,
                23312
            ],
            [
                23312,
                23348
            ],
            [
                23348,
                23436
            ],
            [
                23436,
                23519
            ],
            [
                23519,
                23539
            ],
            [
                23539,
                23745
            ],
            [
                23745,
                23880
            ],
            [
                23880,
                24235
            ],
            [
                24235,
                24533
            ],
            [
                24533,
                24851
            ],
            [
                24851,
                25141
            ],
            [
                25141,
                25220
            ],
            [
                25220,
                25383
            ],
            [
                25383,
                25522
            ],
            [
                25522,
                25530
            ],
            [
                25530,
                25640
            ],
            [
                25640,
                25803
            ],
            [
                25803,
                26196
            ],
            [
                26196,
                26415
            ],
            [
                26415,
                26856
            ],
            [
                26856,
                26938
            ],
            [
                26938,
                26977
            ],
            [
                26977,
                27001
            ],
            [
                27001,
                27131
            ],
            [
                27131,
                27565
            ],
            [
                27565,
                27631
            ],
            [
                27631,
                27670
            ],
            [
                27670,
                27908
            ],
            [
                27908,
                28239
            ],
            [
                28239,
                28414
            ],
            [
                28414,
                28572
            ],
            [
                28572,
                28648
            ],
            [
                28648,
                29044
            ],
            [
                29044,
                29154
            ],
            [
                29154,
                29348
            ],
            [
                29348,
                29471
            ],
            [
                29471,
                29784
            ],
            [
                29784,
                29899
            ],
            [
                29899,
                30032
            ],
            [
                30032,
                30284
            ],
            [
                30284,
                30563
            ],
            [
                30563,
                30599
            ],
            [
                30599,
                30686
            ],
            [
                30686,
                30712
            ],
            [
                30712,
                30737
            ],
            [
                30737,
                30852
            ],
            [
                30852,
                31130
            ],
            [
                31130,
                31537
            ],
            [
                31537,
                31616
            ],
            [
                31616,
                31684
            ],
            [
                31684,
                31731
            ],
            [
                31731,
                31813
            ],
            [
                31813,
                31959
            ],
            [
                31959,
                32291
            ],
            [
                32291,
                32744
            ],
            [
                32744,
                32872
            ],
            [
                32872,
                33016
            ],
            [
                33016,
                33084
            ],
            [
                33084,
                33121
            ],
            [
                33121,
                33163
            ],
            [
                33163,
                33199
            ],
            [
                33199,
                33264
            ],
            [
                33264,
                33398
            ],
            [
                33398,
                33539
            ],
            [
                33539,
                33870
            ],
            [
                33870,
                33943
            ],
            [
                33943,
                34025
            ],
            [
                34025,
                34146
            ],
            [
                34146,
                34591
            ],
            [
                34591,
                34801
            ],
            [
                34801,
                34896
            ],
            [
                34896,
                34915
            ],
            [
                34915,
                34977
            ],
            [
                34977,
                35138
            ],
            [
                35138,
                35349
            ],
            [
                35349,
                35653
            ],
            [
                35653,
                36044
            ],
            [
                36044,
                36167
            ],
            [
                36167,
                36377
            ],
            [
                36377,
                36474
            ],
            [
                36474,
                36509
            ],
            [
                36509,
                36640
            ],
            [
                36640,
                36665
            ],
            [
                36665,
                36885
            ],
            [
                36885,
                37106
            ],
            [
                37106,
                37143
            ],
            [
                37143,
                37251
            ],
            [
                37251,
                37549
            ],
            [
                37549,
                37783
            ],
            [
                37783,
                37917
            ],
            [
                37917,
                38021
            ],
            [
                38021,
                38268
            ],
            [
                38268,
                38501
            ],
            [
                38501,
                38690
            ],
            [
                38690,
                38813
            ],
            [
                38813,
                38947
            ],
            [
                38947,
                39195
            ],
            [
                39195,
                39334
            ],
            [
                39334,
                39507
            ],
            [
                39507,
                39647
            ],
            [
                39647,
                39739
            ],
            [
                39739,
                39857
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                38,
                51
            ],
            [
                77,
                106
            ],
            [
                236,
                269
            ],
            [
                274,
                281
            ],
            [
                349,
                350
            ],
            [
                605,
                612
            ],
            [
                613,
                617
            ],
            [
                628,
                670
            ],
            [
                680,
                690
            ],
            [
                351,
                393
            ],
            [
                406,
                409
            ],
            [
                394,
                400
            ],
            [
                409,
                434
            ],
            [
                435,
                439
            ],
            [
                222,
                235
            ],
            [
                930,
                933
            ],
            [
                716,
                770
            ],
            [
                803,
                817
            ],
            [
                823,
                890
            ],
            [
                911,
                925
            ],
            [
                778,
                781
            ],
            [
                992,
                1001
            ],
            [
                953,
                986
            ],
            [
                1016,
                1038
            ],
            [
                1038,
                1050
            ],
            [
                1136,
                1158
            ],
            [
                1400,
                1462
            ],
            [
                1462,
                1469
            ],
            [
                1471,
                1479
            ],
            [
                1489,
                1522
            ],
            [
                1522,
                1603
            ],
            [
                1625,
                1642
            ],
            [
                1658,
                1665
            ],
            [
                1654,
                1657
            ],
            [
                1779,
                1780
            ],
            [
                1701,
                1779
            ],
            [
                1805,
                1807
            ],
            [
                1807,
                1855
            ],
            [
                1899,
                1909
            ],
            [
                1856,
                1862
            ],
            [
                2005,
                2007
            ],
            [
                2007,
                2011
            ],
            [
                2036,
                2045
            ],
            [
                2096,
                2099
            ],
            [
                2138,
                2147
            ],
            [
                2184,
                2224
            ],
            [
                2260,
                2281
            ],
            [
                2072,
                2074
            ],
            [
                2100,
                2102
            ],
            [
                2305,
                2311
            ],
            [
                2333,
                2335
            ],
            [
                2335,
                2347
            ],
            [
                2681,
                2689
            ],
            [
                2379,
                2459
            ],
            [
                2487,
                2496
            ],
            [
                2506,
                2514
            ],
            [
                2617,
                2680
            ],
            [
                2689,
                2691
            ],
            [
                2691,
                2703
            ],
            [
                2742,
                2788
            ],
            [
                2811,
                2872
            ],
            [
                2883,
                2885
            ],
            [
                2901,
                2948
            ],
            [
                2953,
                2959
            ],
            [
                2965,
                2991
            ],
            [
                2991,
                3174
            ],
            [
                3285,
                3382
            ],
            [
                3399,
                3406
            ],
            [
                3383,
                3391
            ],
            [
                3407,
                3414
            ],
            [
                3420,
                3446
            ],
            [
                3510,
                3513
            ],
            [
                3538,
                3542
            ],
            [
                3514,
                3518
            ],
            [
                3558,
                3567
            ],
            [
                3543,
                3545
            ],
            [
                3519,
                3537
            ],
            [
                3508,
                3509
            ],
            [
                3569,
                3572
            ],
            [
                3617,
                3632
            ],
            [
                3632,
                3666
            ],
            [
                3666,
                3686
            ],
            [
                3697,
                3701
            ],
            [
                3701,
                3876
            ],
            [
                3876,
                3893
            ],
            [
                3903,
                3982
            ],
            [
                3992,
                4071
            ],
            [
                4072,
                4096
            ],
            [
                4138,
                4258
            ],
            [
                4264,
                4307
            ],
            [
                4307,
                4323
            ],
            [
                4343,
                4363
            ],
            [
                4389,
                4391
            ],
            [
                4391,
                4455
            ],
            [
                4455,
                4481
            ],
            [
                4539,
                4541
            ],
            [
                4541,
                4597
            ],
            [
                4603,
                4615
            ],
            [
                4616,
                4629
            ],
            [
                4644,
                4651
            ],
            [
                4651,
                4692
            ],
            [
                4726,
                4728
            ],
            [
                4706,
                4714
            ],
            [
                4698,
                4705
            ],
            [
                4729,
                4741
            ],
            [
                4765,
                4850
            ],
            [
                4850,
                4856
            ],
            [
                5109,
                5234
            ],
            [
                5234,
                5268
            ],
            [
                5270,
                5340
            ],
            [
                5352,
                5401
            ],
            [
                5757,
                5773
            ],
            [
                5451,
                5459
            ],
            [
                5610,
                5612
            ],
            [
                5677,
                5686
            ],
            [
                5751,
                5752
            ],
            [
                5483,
                5524
            ],
            [
                5753,
                5756
            ],
            [
                5525,
                5559
            ],
            [
                5800,
                5802
            ],
            [
                5572,
                5593
            ],
            [
                5646,
                5653
            ],
            [
                5821,
                5823
            ],
            [
                5941,
                5960
            ],
            [
                5976,
                6010
            ],
            [
                6010,
                6023
            ],
            [
                6175,
                6190
            ],
            [
                6202,
                6240
            ],
            [
                6278,
                6284
            ],
            [
                6292,
                6373
            ],
            [
                6373,
                6451
            ],
            [
                6451,
                6465
            ],
            [
                6511,
                6514
            ],
            [
                6519,
                6523
            ],
            [
                6486,
                6504
            ],
            [
                6524,
                6548
            ],
            [
                6738,
                6742
            ],
            [
                6771,
                6772
            ],
            [
                6743,
                6752
            ],
            [
                6842,
                6843
            ],
            [
                6753,
                6771
            ],
            [
                6773,
                6805
            ],
            [
                7087,
                7088
            ],
            [
                6930,
                7002
            ],
            [
                6894,
                6897
            ],
            [
                7003,
                7015
            ],
            [
                7021,
                7087
            ],
            [
                6925,
                6926
            ],
            [
                7357,
                7448
            ],
            [
                7522,
                7524
            ],
            [
                7524,
                7583
            ],
            [
                7667,
                7720
            ],
            [
                7720,
                7764
            ],
            [
                7772,
                7781
            ],
            [
                7896,
                7902
            ],
            [
                7902,
                7938
            ],
            [
                7938,
                7947
            ],
            [
                7952,
                7956
            ],
            [
                7966,
                7988
            ],
            [
                8007,
                8023
            ],
            [
                8036,
                8111
            ],
            [
                8137,
                8162
            ],
            [
                8195,
                8221
            ],
            [
                8238,
                8241
            ],
            [
                8226,
                8234
            ],
            [
                8246,
                8247
            ],
            [
                8312,
                8315
            ],
            [
                8370,
                8386
            ],
            [
                8342,
                8346
            ],
            [
                8406,
                8420
            ],
            [
                8439,
                8441
            ],
            [
                8491,
                8515
            ],
            [
                8641,
                8649
            ],
            [
                8534,
                8537
            ],
            [
                8558,
                8568
            ],
            [
                8602,
                8637
            ],
            [
                8649,
                8651
            ],
            [
                8651,
                8681
            ],
            [
                8681,
                8696
            ],
            [
                8717,
                8728
            ],
            [
                8697,
                8707
            ],
            [
                8728,
                8729
            ],
            [
                8736,
                8779
            ],
            [
                8791,
                8856
            ],
            [
                8856,
                8870
            ],
            [
                8880,
                8932
            ],
            [
                8999,
                9023
            ],
            [
                9075,
                9085
            ],
            [
                9087,
                9112
            ],
            [
                9125,
                9152
            ],
            [
                9201,
                9202
            ],
            [
                9203,
                9239
            ],
            [
                9259,
                9312
            ],
            [
                9411,
                9441
            ],
            [
                9450,
                9452
            ],
            [
                9464,
                9476
            ],
            [
                9476,
                9582
            ],
            [
                9582,
                9598
            ],
            [
                9607,
                9653
            ],
            [
                9653,
                9660
            ],
            [
                9668,
                9713
            ],
            [
                9713,
                9771
            ],
            [
                9833,
                9834
            ],
            [
                9836,
                9866
            ],
            [
                9885,
                9897
            ],
            [
                9926,
                9953
            ],
            [
                9957,
                9969
            ],
            [
                9969,
                9991
            ],
            [
                10029,
                10063
            ],
            [
                9991,
                9992
            ],
            [
                10093,
                10133
            ],
            [
                10087,
                10088
            ],
            [
                10135,
                10143
            ],
            [
                10143,
                10196
            ],
            [
                10196,
                10252
            ],
            [
                10268,
                10282
            ],
            [
                10325,
                10332
            ],
            [
                10397,
                10485
            ],
            [
                10487,
                10532
            ],
            [
                10532,
                10536
            ],
            [
                10542,
                10546
            ],
            [
                10555,
                10560
            ],
            [
                10562,
                10570
            ],
            [
                10572,
                10584
            ],
            [
                10603,
                10609
            ],
            [
                10627,
                10638
            ],
            [
                10715,
                10739
            ],
            [
                10756,
                10791
            ],
            [
                10854,
                10897
            ],
            [
                10907,
                10950
            ],
            [
                10955,
                11054
            ],
            [
                11055,
                11096
            ],
            [
                11124,
                11127
            ],
            [
                11141,
                11218
            ],
            [
                11225,
                11243
            ],
            [
                11272,
                11273
            ],
            [
                11278,
                11308
            ],
            [
                11355,
                11358
            ],
            [
                11312,
                11316
            ],
            [
                11224,
                11225
            ],
            [
                11316,
                11325
            ],
            [
                11329,
                11342
            ],
            [
                11346,
                11354
            ],
            [
                11365,
                11375
            ],
            [
                11375,
                11383
            ],
            [
                11390,
                11497
            ],
            [
                11497,
                11577
            ],
            [
                11818,
                11820
            ],
            [
                11820,
                11837
            ],
            [
                11844,
                11853
            ],
            [
                11867,
                11917
            ],
            [
                11965,
                11967
            ],
            [
                11967,
                11999
            ],
            [
                12039,
                12059
            ],
            [
                12071,
                12075
            ],
            [
                12016,
                12027
            ],
            [
                12078,
                12170
            ],
            [
                12375,
                12377
            ],
            [
                12189,
                12212
            ],
            [
                12234,
                12246
            ],
            [
                12260,
                12266
            ],
            [
                12275,
                12286
            ],
            [
                12292,
                12294
            ],
            [
                12310,
                12339
            ],
            [
                12032,
                12034
            ],
            [
                12366,
                12374
            ],
            [
                12395,
                12472
            ],
            [
                12482,
                12496
            ],
            [
                12498,
                12528
            ],
            [
                12533,
                12552
            ],
            [
                12564,
                12675
            ],
            [
                12686,
                12704
            ],
            [
                12707,
                12711
            ],
            [
                12732,
                12742
            ],
            [
                12742,
                12779
            ],
            [
                12787,
                12890
            ],
            [
                12905,
                12909
            ],
            [
                13020,
                13133
            ],
            [
                13160,
                13268
            ],
            [
                13795,
                13797
            ],
            [
                13797,
                13850
            ],
            [
                13902,
                13905
            ],
            [
                13858,
                13861
            ],
            [
                13906,
                13918
            ],
            [
                13931,
                14030
            ],
            [
                14043,
                14046
            ],
            [
                14031,
                14041
            ],
            [
                14060,
                14062
            ],
            [
                14062,
                14101
            ],
            [
                14118,
                14137
            ],
            [
                14149,
                14165
            ],
            [
                14171,
                14177
            ],
            [
                14189,
                14219
            ],
            [
                14219,
                14230
            ],
            [
                14243,
                14356
            ],
            [
                14356,
                14415
            ],
            [
                14419,
                14435
            ],
            [
                14437,
                14488
            ],
            [
                14491,
                14501
            ],
            [
                14509,
                14529
            ],
            [
                14529,
                14617
            ],
            [
                14645,
                14647
            ],
            [
                14647,
                14727
            ],
            [
                14727,
                14777
            ],
            [
                14784,
                14844
            ],
            [
                14844,
                14847
            ],
            [
                14856,
                14863
            ],
            [
                14886,
                14892
            ],
            [
                14908,
                15006
            ],
            [
                15020,
                15037
            ],
            [
                15054,
                15088
            ],
            [
                15098,
                15175
            ],
            [
                15185,
                15283
            ],
            [
                15283,
                15327
            ],
            [
                15352,
                15358
            ],
            [
                15362,
                15379
            ],
            [
                15429,
                15519
            ],
            [
                15521,
                15556
            ],
            [
                15562,
                15564
            ],
            [
                15564,
                15600
            ],
            [
                15612,
                15618
            ],
            [
                15628,
                15644
            ],
            [
                15644,
                15649
            ],
            [
                15686,
                15689
            ],
            [
                15689,
                15716
            ],
            [
                15736,
                15762
            ],
            [
                15762,
                15770
            ],
            [
                15770,
                15789
            ],
            [
                15789,
                15842
            ],
            [
                15842,
                15873
            ],
            [
                15887,
                15889
            ],
            [
                15889,
                15921
            ],
            [
                15997,
                15998
            ],
            [
                16015,
                16028
            ],
            [
                16028,
                16029
            ],
            [
                16032,
                16085
            ],
            [
                16085,
                16145
            ],
            [
                16169,
                16212
            ],
            [
                16231,
                16252
            ],
            [
                16229,
                16230
            ],
            [
                16253,
                16382
            ],
            [
                16383,
                16405
            ],
            [
                16417,
                16421
            ],
            [
                16442,
                16457
            ],
            [
                16459,
                16483
            ],
            [
                16644,
                16676
            ],
            [
                16681,
                16685
            ],
            [
                16685,
                16734
            ],
            [
                16781,
                16787
            ],
            [
                16789,
                16853
            ],
            [
                16853,
                16875
            ],
            [
                16875,
                16903
            ],
            [
                16903,
                16916
            ],
            [
                16960,
                17009
            ],
            [
                17111,
                17113
            ],
            [
                17140,
                17211
            ],
            [
                17219,
                17221
            ],
            [
                17221,
                17257
            ],
            [
                17297,
                17299
            ],
            [
                17299,
                17302
            ],
            [
                17342,
                17443
            ],
            [
                17469,
                17479
            ],
            [
                17479,
                17485
            ],
            [
                17551,
                17619
            ],
            [
                17506,
                17509
            ],
            [
                17638,
                17641
            ],
            [
                17676,
                17735
            ],
            [
                17735,
                17848
            ],
            [
                17848,
                17889
            ],
            [
                17889,
                17904
            ],
            [
                17904,
                17905
            ],
            [
                17925,
                17985
            ],
            [
                18053,
                18080
            ],
            [
                18033,
                18034
            ],
            [
                18081,
                18094
            ],
            [
                18096,
                18119
            ],
            [
                18181,
                18265
            ],
            [
                18287,
                18292
            ],
            [
                18297,
                18315
            ],
            [
                18338,
                18343
            ],
            [
                18322,
                18337
            ],
            [
                18348,
                18350
            ],
            [
                18350,
                18370
            ],
            [
                18393,
                18405
            ],
            [
                18434,
                18436
            ],
            [
                18451,
                18456
            ],
            [
                18409,
                18413
            ],
            [
                18457,
                18467
            ],
            [
                18485,
                18487
            ],
            [
                18487,
                18536
            ],
            [
                18554,
                18570
            ],
            [
                18580,
                18594
            ],
            [
                18705,
                18707
            ],
            [
                18707,
                18760
            ],
            [
                18760,
                18776
            ],
            [
                18781,
                18801
            ],
            [
                18827,
                18828
            ],
            [
                18829,
                18857
            ],
            [
                18859,
                18915
            ],
            [
                19144,
                19253
            ],
            [
                19385,
                19387
            ],
            [
                19523,
                19540
            ],
            [
                19540,
                19628
            ],
            [
                19682,
                19694
            ],
            [
                19638,
                19639
            ],
            [
                19670,
                19672
            ],
            [
                19653,
                19656
            ],
            [
                19675,
                19681
            ],
            [
                19695,
                19748
            ],
            [
                19749,
                19759
            ],
            [
                19767,
                19797
            ],
            [
                19804,
                19823
            ],
            [
                19853,
                19857
            ],
            [
                19876,
                19886
            ],
            [
                19886,
                19915
            ],
            [
                19937,
                19946
            ],
            [
                19967,
                19996
            ],
            [
                20009,
                20032
            ],
            [
                20032,
                20093
            ],
            [
                20094,
                20102
            ],
            [
                20117,
                20142
            ],
            [
                20161,
                20200
            ],
            [
                20104,
                20107
            ],
            [
                20209,
                20292
            ],
            [
                20292,
                20293
            ],
            [
                20318,
                20325
            ],
            [
                20370,
                20372
            ],
            [
                20378,
                20384
            ],
            [
                20392,
                20420
            ],
            [
                20329,
                20348
            ],
            [
                20420,
                20422
            ],
            [
                20422,
                20553
            ],
            [
                20620,
                20643
            ],
            [
                20668,
                20670
            ],
            [
                20670,
                20716
            ],
            [
                20733,
                20749
            ],
            [
                20749,
                20798
            ],
            [
                20798,
                20810
            ],
            [
                20810,
                20826
            ],
            [
                20836,
                20927
            ],
            [
                20927,
                20956
            ],
            [
                20991,
                21051
            ],
            [
                21055,
                21062
            ],
            [
                21079,
                21081
            ],
            [
                21081,
                21108
            ],
            [
                21108,
                21152
            ],
            [
                21152,
                21246
            ],
            [
                21248,
                21266
            ],
            [
                21266,
                21289
            ],
            [
                21289,
                21323
            ],
            [
                21355,
                21357
            ],
            [
                21357,
                21367
            ],
            [
                21375,
                21378
            ],
            [
                21378,
                21481
            ],
            [
                21493,
                21514
            ],
            [
                21514,
                21550
            ],
            [
                21550,
                21595
            ],
            [
                21606,
                21626
            ],
            [
                21646,
                21703
            ],
            [
                21708,
                21712
            ],
            [
                21729,
                21735
            ],
            [
                21749,
                21778
            ],
            [
                21780,
                21795
            ],
            [
                21834,
                21836
            ],
            [
                21836,
                21848
            ],
            [
                21857,
                21890
            ],
            [
                21895,
                21908
            ],
            [
                21908,
                21911
            ],
            [
                21987,
                22003
            ],
            [
                21975,
                21986
            ],
            [
                21923,
                21965
            ],
            [
                22073,
                22075
            ],
            [
                22075,
                22101
            ],
            [
                22101,
                22144
            ],
            [
                22156,
                22162
            ],
            [
                22162,
                22215
            ],
            [
                22215,
                22265
            ],
            [
                22275,
                22319
            ],
            [
                22321,
                22337
            ],
            [
                22364,
                22404
            ],
            [
                22409,
                22516
            ],
            [
                22516,
                22528
            ],
            [
                22528,
                22550
            ],
            [
                22585,
                22602
            ],
            [
                22611,
                22627
            ],
            [
                22659,
                22671
            ],
            [
                22703,
                22705
            ],
            [
                22739,
                22771
            ],
            [
                22773,
                22865
            ],
            [
                22909,
                22933
            ],
            [
                22933,
                22937
            ],
            [
                22949,
                22958
            ],
            [
                22983,
                22985
            ],
            [
                22985,
                23093
            ],
            [
                23093,
                23118
            ],
            [
                23152,
                23173
            ],
            [
                23200,
                23237
            ],
            [
                23174,
                23178
            ],
            [
                23241,
                23245
            ],
            [
                23245,
                23286
            ],
            [
                23286,
                23312
            ],
            [
                23348,
                23436
            ],
            [
                23436,
                23503
            ],
            [
                23514,
                23517
            ],
            [
                23598,
                23601
            ],
            [
                23667,
                23673
            ],
            [
                23678,
                23745
            ],
            [
                23745,
                23784
            ],
            [
                23790,
                23814
            ],
            [
                23914,
                23926
            ],
            [
                23940,
                23948
            ],
            [
                23927,
                23939
            ],
            [
                23863,
                23865
            ],
            [
                23948,
                23989
            ],
            [
                23832,
                23835
            ],
            [
                24075,
                24079
            ],
            [
                24024,
                24058
            ],
            [
                24079,
                24109
            ],
            [
                23825,
                23831
            ],
            [
                24110,
                24171
            ],
            [
                24208,
                24220
            ],
            [
                24233,
                24235
            ],
            [
                24235,
                24422
            ],
            [
                24524,
                24525
            ],
            [
                24428,
                24441
            ],
            [
                24449,
                24475
            ],
            [
                24492,
                24509
            ],
            [
                24531,
                24533
            ],
            [
                24533,
                24546
            ],
            [
                24558,
                24562
            ],
            [
                24547,
                24557
            ],
            [
                24562,
                24604
            ],
            [
                24630,
                24649
            ],
            [
                24689,
                24702
            ],
            [
                24713,
                24728
            ],
            [
                24751,
                24757
            ],
            [
                24758,
                24769
            ],
            [
                24773,
                24799
            ],
            [
                24803,
                24812
            ],
            [
                24703,
                24706
            ],
            [
                24817,
                24820
            ],
            [
                24849,
                24851
            ],
            [
                24871,
                24927
            ],
            [
                24933,
                24960
            ],
            [
                24977,
                25141
            ],
            [
                25141,
                25218
            ],
            [
                25218,
                25220
            ],
            [
                25220,
                25281
            ],
            [
                25292,
                25343
            ],
            [
                25349,
                25370
            ],
            [
                25377,
                25383
            ],
            [
                25390,
                25395
            ],
            [
                25406,
                25522
            ],
            [
                25522,
                25530
            ],
            [
                25530,
                25563
            ],
            [
                25584,
                25623
            ],
            [
                25633,
                25639
            ],
            [
                25661,
                25678
            ],
            [
                25714,
                25749
            ],
            [
                25753,
                25803
            ],
            [
                25921,
                25924
            ],
            [
                25952,
                26024
            ],
            [
                26041,
                26076
            ],
            [
                26078,
                26115
            ],
            [
                26130,
                26195
            ],
            [
                26196,
                26210
            ],
            [
                26232,
                26313
            ],
            [
                26387,
                26390
            ],
            [
                26325,
                26353
            ],
            [
                26380,
                26386
            ],
            [
                26314,
                26317
            ],
            [
                26409,
                26415
            ],
            [
                26415,
                26471
            ],
            [
                26482,
                26548
            ],
            [
                26566,
                26579
            ],
            [
                26653,
                26654
            ],
            [
                26585,
                26604
            ],
            [
                26612,
                26641
            ],
            [
                26647,
                26649
            ],
            [
                26655,
                26695
            ],
            [
                26708,
                26714
            ],
            [
                26720,
                26748
            ],
            [
                26840,
                26841
            ],
            [
                26772,
                26806
            ],
            [
                26824,
                26826
            ],
            [
                26842,
                26856
            ],
            [
                26856,
                26938
            ],
            [
                26938,
                26945
            ],
            [
                26963,
                26977
            ],
            [
                26977,
                27001
            ],
            [
                27001,
                27053
            ],
            [
                27065,
                27074
            ],
            [
                27076,
                27098
            ],
            [
                27129,
                27130
            ],
            [
                27131,
                27203
            ],
            [
                27212,
                27253
            ],
            [
                27516,
                27517
            ],
            [
                27255,
                27258
            ],
            [
                27317,
                27321
            ],
            [
                27266,
                27268
            ],
            [
                27298,
                27316
            ],
            [
                27322,
                27483
            ],
            [
                27521,
                27535
            ],
            [
                27563,
                27565
            ],
            [
                27565,
                27607
            ],
            [
                27617,
                27631
            ],
            [
                27631,
                27670
            ],
            [
                27688,
                27790
            ],
            [
                27821,
                27868
            ],
            [
                27875,
                27908
            ],
            [
                27908,
                27958
            ],
            [
                28019,
                28022
            ],
            [
                27959,
                28018
            ],
            [
                28023,
                28076
            ],
            [
                28113,
                28118
            ],
            [
                28155,
                28226
            ],
            [
                28231,
                28238
            ],
            [
                28239,
                28348
            ],
            [
                28383,
                28414
            ],
            [
                28425,
                28460
            ],
            [
                28480,
                28503
            ],
            [
                28522,
                28572
            ],
            [
                28572,
                28584
            ],
            [
                28593,
                28603
            ],
            [
                28585,
                28592
            ],
            [
                28604,
                28616
            ],
            [
                28623,
                28634
            ],
            [
                28646,
                28648
            ],
            [
                28648,
                28670
            ],
            [
                28674,
                28779
            ],
            [
                28787,
                28820
            ],
            [
                28826,
                28828
            ],
            [
                28852,
                28872
            ],
            [
                28838,
                28841
            ],
            [
                28873,
                29000
            ],
            [
                29016,
                29044
            ],
            [
                29044,
                29067
            ],
            [
                29091,
                29093
            ],
            [
                29163,
                29166
            ],
            [
                29216,
                29255
            ],
            [
                29267,
                29273
            ],
            [
                29158,
                29162
            ],
            [
                29195,
                29210
            ],
            [
                29297,
                29313
            ],
            [
                29322,
                29327
            ],
            [
                29333,
                29348
            ],
            [
                29348,
                29378
            ],
            [
                29392,
                29397
            ],
            [
                29408,
                29470
            ],
            [
                29471,
                29487
            ],
            [
                29515,
                29560
            ],
            [
                29574,
                29605
            ],
            [
                29615,
                29621
            ],
            [
                29631,
                29638
            ],
            [
                29658,
                29721
            ],
            [
                29728,
                29784
            ],
            [
                29784,
                29839
            ],
            [
                29844,
                29899
            ],
            [
                29899,
                29989
            ],
            [
                30003,
                30032
            ],
            [
                30032,
                30060
            ],
            [
                30068,
                30140
            ],
            [
                30159,
                30197
            ],
            [
                30282,
                30283
            ],
            [
                30284,
                30306
            ],
            [
                30311,
                30320
            ],
            [
                30419,
                30420
            ],
            [
                30552,
                30561
            ],
            [
                30330,
                30338
            ],
            [
                30342,
                30372
            ],
            [
                30389,
                30415
            ],
            [
                30434,
                30464
            ],
            [
                30421,
                30431
            ],
            [
                30478,
                30509
            ],
            [
                30515,
                30519
            ],
            [
                30561,
                30563
            ],
            [
                30564,
                30596
            ],
            [
                30712,
                30736
            ],
            [
                30639,
                30640
            ],
            [
                30647,
                30656
            ],
            [
                30667,
                30685
            ],
            [
                30737,
                30778
            ],
            [
                30797,
                30852
            ],
            [
                30852,
                30936
            ],
            [
                30974,
                31063
            ],
            [
                31064,
                31070
            ],
            [
                31095,
                31130
            ],
            [
                31130,
                31284
            ],
            [
                31286,
                31298
            ],
            [
                31315,
                31370
            ],
            [
                31372,
                31537
            ],
            [
                31537,
                31545
            ],
            [
                31550,
                31616
            ],
            [
                31616,
                31668
            ],
            [
                31677,
                31684
            ],
            [
                31684,
                31731
            ],
            [
                31731,
                31761
            ],
            [
                31767,
                31771
            ],
            [
                31762,
                31766
            ],
            [
                31772,
                31801
            ],
            [
                31811,
                31813
            ],
            [
                31823,
                31829
            ],
            [
                31819,
                31822
            ],
            [
                31848,
                31852
            ],
            [
                31867,
                31958
            ],
            [
                31959,
                32050
            ],
            [
                32072,
                32124
            ],
            [
                32138,
                32152
            ],
            [
                32162,
                32164
            ],
            [
                32129,
                32132
            ],
            [
                32185,
                32193
            ],
            [
                32233,
                32291
            ],
            [
                32291,
                32323
            ],
            [
                32335,
                32403
            ],
            [
                32409,
                32429
            ],
            [
                32448,
                32451
            ],
            [
                32537,
                32606
            ],
            [
                32621,
                32631
            ],
            [
                32642,
                32655
            ],
            [
                32657,
                32694
            ],
            [
                32742,
                32744
            ],
            [
                32744,
                32773
            ],
            [
                32861,
                32862
            ],
            [
                32786,
                32795
            ],
            [
                32774,
                32785
            ],
            [
                32796,
                32849
            ],
            [
                32870,
                32872
            ],
            [
                32872,
                32875
            ],
            [
                32921,
                32934
            ],
            [
                32893,
                32896
            ],
            [
                32906,
                32910
            ],
            [
                32965,
                32976
            ],
            [
                32980,
                33016
            ],
            [
                33016,
                33084
            ],
            [
                33084,
                33121
            ],
            [
                33121,
                33163
            ],
            [
                33163,
                33199
            ],
            [
                33199,
                33210
            ],
            [
                33219,
                33264
            ],
            [
                33264,
                33296
            ],
            [
                33298,
                33320
            ],
            [
                33325,
                33326
            ],
            [
                33322,
                33325
            ],
            [
                33398,
                33425
            ],
            [
                33442,
                33454
            ],
            [
                33396,
                33397
            ],
            [
                33593,
                33635
            ],
            [
                33572,
                33574
            ],
            [
                33699,
                33700
            ],
            [
                33777,
                33833
            ],
            [
                33860,
                33870
            ],
            [
                33870,
                33883
            ],
            [
                33893,
                33925
            ],
            [
                33935,
                33943
            ],
            [
                33943,
                34025
            ],
            [
                34025,
                34079
            ],
            [
                34144,
                34146
            ],
            [
                34684,
                34801
            ],
            [
                34801,
                34825
            ],
            [
                34856,
                34896
            ],
            [
                34896,
                34915
            ],
            [
                34915,
                34944
            ],
            [
                34962,
                34977
            ],
            [
                35109,
                35110
            ],
            [
                35001,
                35012
            ],
            [
                35040,
                35047
            ],
            [
                35061,
                35099
            ],
            [
                35128,
                35138
            ],
            [
                35138,
                35158
            ],
            [
                35171,
                35187
            ],
            [
                35203,
                35217
            ],
            [
                35227,
                35234
            ],
            [
                35272,
                35275
            ],
            [
                35303,
                35307
            ],
            [
                35309,
                35349
            ],
            [
                35464,
                35486
            ],
            [
                35497,
                35506
            ],
            [
                35578,
                35609
            ],
            [
                35542,
                35561
            ],
            [
                35614,
                35653
            ],
            [
                35653,
                35666
            ],
            [
                35728,
                35746
            ],
            [
                35722,
                35727
            ],
            [
                35813,
                35824
            ],
            [
                35856,
                35895
            ],
            [
                35934,
                35959
            ],
            [
                35778,
                35781
            ],
            [
                35909,
                35911
            ],
            [
                35982,
                35987
            ],
            [
                35998,
                36000
            ],
            [
                35901,
                35905
            ],
            [
                35825,
                35832
            ],
            [
                36030,
                36044
            ],
            [
                36044,
                36106
            ],
            [
                36165,
                36167
            ],
            [
                36212,
                36264
            ],
            [
                36375,
                36377
            ],
            [
                36377,
                36413
            ],
            [
                36425,
                36474
            ],
            [
                36474,
                36509
            ],
            [
                36509,
                36522
            ],
            [
                36528,
                36573
            ],
            [
                36602,
                36640
            ],
            [
                36640,
                36665
            ],
            [
                36665,
                36684
            ],
            [
                36690,
                36698
            ],
            [
                36720,
                36733
            ],
            [
                36750,
                36806
            ],
            [
                36883,
                36885
            ],
            [
                36885,
                36903
            ],
            [
                36939,
                36945
            ],
            [
                36922,
                36929
            ],
            [
                36965,
                36972
            ],
            [
                36974,
                37037
            ],
            [
                37104,
                37106
            ],
            [
                37106,
                37142
            ],
            [
                37251,
                37263
            ],
            [
                37273,
                37319
            ],
            [
                37547,
                37549
            ],
            [
                37549,
                37577
            ],
            [
                37663,
                37666
            ],
            [
                37590,
                37634
            ],
            [
                37672,
                37695
            ],
            [
                37697,
                37735
            ],
            [
                37737,
                37761
            ],
            [
                37766,
                37783
            ],
            [
                37783,
                37828
            ],
            [
                37836,
                37888
            ],
            [
                37904,
                37917
            ],
            [
                37917,
                37920
            ],
            [
                37933,
                37934
            ],
            [
                37965,
                38021
            ],
            [
                38021,
                38059
            ],
            [
                38065,
                38112
            ],
            [
                38117,
                38131
            ],
            [
                38154,
                38268
            ],
            [
                38268,
                38290
            ],
            [
                38321,
                38383
            ],
            [
                38395,
                38500
            ],
            [
                38695,
                38712
            ],
            [
                38811,
                38812
            ],
            [
                38714,
                38745
            ],
            [
                38755,
                38774
            ],
            [
                38813,
                38816
            ],
            [
                38834,
                38846
            ],
            [
                38855,
                38864
            ],
            [
                38875,
                38884
            ],
            [
                38886,
                38890
            ],
            [
                38908,
                38947
            ],
            [
                38947,
                39051
            ],
            [
                39195,
                39269
            ],
            [
                39172,
                39173
            ],
            [
                39288,
                39308
            ],
            [
                39325,
                39334
            ],
            [
                39334,
                39416
            ],
            [
                39440,
                39507
            ],
            [
                39507,
                39543
            ],
            [
                39562,
                39577
            ],
            [
                39586,
                39610
            ],
            [
                39645,
                39646
            ],
            [
                39647,
                39709
            ],
            [
                39712,
                39739
            ],
            [
                39739,
                39804
            ],
            [
                39805,
                39857
            ]
        ],
        "row_chars": [
            [
                0,
                691
            ],
            [
                691,
                1038
            ],
            [
                1038,
                1462
            ],
            [
                1462,
                1522
            ],
            [
                1522,
                1807
            ],
            [
                1807,
                2007
            ],
            [
                2007,
                2335
            ],
            [
                2335,
                2691
            ],
            [
                2691,
                2991
            ],
            [
                2991,
                3174
            ],
            [
                3174,
                3285
            ],
            [
                3285,
                3632
            ],
            [
                3632,
                3666
            ],
            [
                3666,
                3876
            ],
            [
                3876,
                4072
            ],
            [
                4072,
                4307
            ],
            [
                4307,
                4391
            ],
            [
                4391,
                4455
            ],
            [
                4455,
                4541
            ],
            [
                4541,
                4616
            ],
            [
                4616,
                4651
            ],
            [
                4651,
                4850
            ],
            [
                4850,
                5234
            ],
            [
                5234,
                5402
            ],
            [
                5402,
                5823
            ],
            [
                5823,
                6010
            ],
            [
                6010,
                6373
            ],
            [
                6373,
                6451
            ],
            [
                6451,
                6738
            ],
            [
                6738,
                7199
            ],
            [
                7199,
                7357
            ],
            [
                7357,
                7524
            ],
            [
                7524,
                7720
            ],
            [
                7720,
                7902
            ],
            [
                7902,
                7938
            ],
            [
                7938,
                7988
            ],
            [
                7988,
                8007
            ],
            [
                8007,
                8248
            ],
            [
                8248,
                8304
            ],
            [
                8304,
                8441
            ],
            [
                8441,
                8651
            ],
            [
                8651,
                8681
            ],
            [
                8681,
                8856
            ],
            [
                8856,
                9203
            ],
            [
                9203,
                9314
            ],
            [
                9314,
                9391
            ],
            [
                9391,
                9411
            ],
            [
                9411,
                9476
            ],
            [
                9476,
                9582
            ],
            [
                9582,
                9653
            ],
            [
                9653,
                9713
            ],
            [
                9713,
                9835
            ],
            [
                9835,
                9900
            ],
            [
                9900,
                9914
            ],
            [
                9914,
                9969
            ],
            [
                9969,
                10143
            ],
            [
                10143,
                10196
            ],
            [
                10196,
                10325
            ],
            [
                10325,
                10333
            ],
            [
                10333,
                10397
            ],
            [
                10397,
                10487
            ],
            [
                10487,
                10532
            ],
            [
                10532,
                10638
            ],
            [
                10638,
                10677
            ],
            [
                10677,
                10715
            ],
            [
                10715,
                10739
            ],
            [
                10739,
                10842
            ],
            [
                10842,
                10854
            ],
            [
                10854,
                11055
            ],
            [
                11055,
                11375
            ],
            [
                11375,
                11497
            ],
            [
                11497,
                11820
            ],
            [
                11820,
                11967
            ],
            [
                11967,
                12552
            ],
            [
                12552,
                12742
            ],
            [
                12742,
                13797
            ],
            [
                13797,
                14062
            ],
            [
                14062,
                14219
            ],
            [
                14219,
                14356
            ],
            [
                14356,
                14529
            ],
            [
                14529,
                14647
            ],
            [
                14647,
                14727
            ],
            [
                14727,
                14844
            ],
            [
                14844,
                15283
            ],
            [
                15283,
                15379
            ],
            [
                15379,
                15564
            ],
            [
                15564,
                15689
            ],
            [
                15689,
                15762
            ],
            [
                15762,
                15770
            ],
            [
                15770,
                15789
            ],
            [
                15789,
                15842
            ],
            [
                15842,
                15889
            ],
            [
                15889,
                16028
            ],
            [
                16028,
                16085
            ],
            [
                16085,
                16145
            ],
            [
                16145,
                16169
            ],
            [
                16169,
                16483
            ],
            [
                16483,
                16539
            ],
            [
                16539,
                16600
            ],
            [
                16600,
                16644
            ],
            [
                16644,
                16734
            ],
            [
                16734,
                16781
            ],
            [
                16781,
                16853
            ],
            [
                16853,
                16875
            ],
            [
                16875,
                16903
            ],
            [
                16903,
                17113
            ],
            [
                17113,
                17221
            ],
            [
                17221,
                17299
            ],
            [
                17299,
                17479
            ],
            [
                17479,
                17735
            ],
            [
                17735,
                17848
            ],
            [
                17848,
                17889
            ],
            [
                17889,
                17904
            ],
            [
                17904,
                18350
            ],
            [
                18350,
                18487
            ],
            [
                18487,
                18707
            ],
            [
                18707,
                18760
            ],
            [
                18760,
                18916
            ],
            [
                18916,
                18948
            ],
            [
                18948,
                19144
            ],
            [
                19144,
                19387
            ],
            [
                19387,
                19517
            ],
            [
                19517,
                19749
            ],
            [
                19749,
                19886
            ],
            [
                19886,
                20032
            ],
            [
                20032,
                20292
            ],
            [
                20292,
                20422
            ],
            [
                20422,
                20553
            ],
            [
                20553,
                20620
            ],
            [
                20620,
                20670
            ],
            [
                20670,
                20749
            ],
            [
                20749,
                20798
            ],
            [
                20798,
                20810
            ],
            [
                20810,
                20927
            ],
            [
                20927,
                20958
            ],
            [
                20958,
                20991
            ],
            [
                20991,
                21081
            ],
            [
                21081,
                21108
            ],
            [
                21108,
                21152
            ],
            [
                21152,
                21266
            ],
            [
                21266,
                21289
            ],
            [
                21289,
                21357
            ],
            [
                21357,
                21378
            ],
            [
                21378,
                21493
            ],
            [
                21493,
                21514
            ],
            [
                21514,
                21550
            ],
            [
                21550,
                21595
            ],
            [
                21595,
                21714
            ],
            [
                21714,
                21836
            ],
            [
                21836,
                21908
            ],
            [
                21908,
                22075
            ],
            [
                22075,
                22101
            ],
            [
                22101,
                22162
            ],
            [
                22162,
                22215
            ],
            [
                22215,
                22516
            ],
            [
                22516,
                22528
            ],
            [
                22528,
                22705
            ],
            [
                22705,
                22865
            ],
            [
                22865,
                22909
            ],
            [
                22909,
                22933
            ],
            [
                22933,
                22985
            ],
            [
                22985,
                23093
            ],
            [
                23093,
                23245
            ],
            [
                23245,
                23286
            ],
            [
                23286,
                23312
            ],
            [
                23312,
                23348
            ],
            [
                23348,
                23436
            ],
            [
                23436,
                23745
            ],
            [
                23745,
                24235
            ],
            [
                24235,
                24533
            ],
            [
                24533,
                24851
            ],
            [
                24851,
                25141
            ],
            [
                25141,
                25220
            ],
            [
                25220,
                25383
            ],
            [
                25383,
                25522
            ],
            [
                25522,
                25530
            ],
            [
                25530,
                25640
            ],
            [
                25640,
                25803
            ],
            [
                25803,
                26196
            ],
            [
                26196,
                26415
            ],
            [
                26415,
                26856
            ],
            [
                26856,
                26938
            ],
            [
                26938,
                26977
            ],
            [
                26977,
                27001
            ],
            [
                27001,
                27131
            ],
            [
                27131,
                27565
            ],
            [
                27565,
                27631
            ],
            [
                27631,
                27670
            ],
            [
                27670,
                27908
            ],
            [
                27908,
                28239
            ],
            [
                28239,
                28414
            ],
            [
                28414,
                28572
            ],
            [
                28572,
                28648
            ],
            [
                28648,
                29044
            ],
            [
                29044,
                29348
            ],
            [
                29348,
                29471
            ],
            [
                29471,
                29784
            ],
            [
                29784,
                29899
            ],
            [
                29899,
                30032
            ],
            [
                30032,
                30284
            ],
            [
                30284,
                30563
            ],
            [
                30563,
                30599
            ],
            [
                30599,
                30737
            ],
            [
                30737,
                30852
            ],
            [
                30852,
                31130
            ],
            [
                31130,
                31537
            ],
            [
                31537,
                31616
            ],
            [
                31616,
                31684
            ],
            [
                31684,
                31731
            ],
            [
                31731,
                31813
            ],
            [
                31813,
                31959
            ],
            [
                31959,
                32291
            ],
            [
                32291,
                32744
            ],
            [
                32744,
                32872
            ],
            [
                32872,
                33016
            ],
            [
                33016,
                33084
            ],
            [
                33084,
                33121
            ],
            [
                33121,
                33163
            ],
            [
                33163,
                33199
            ],
            [
                33199,
                33264
            ],
            [
                33264,
                33539
            ],
            [
                33539,
                33870
            ],
            [
                33870,
                33943
            ],
            [
                33943,
                34025
            ],
            [
                34025,
                34146
            ],
            [
                34146,
                34591
            ],
            [
                34591,
                34801
            ],
            [
                34801,
                34896
            ],
            [
                34896,
                34915
            ],
            [
                34915,
                34977
            ],
            [
                34977,
                35138
            ],
            [
                35138,
                35349
            ],
            [
                35349,
                35653
            ],
            [
                35653,
                36044
            ],
            [
                36044,
                36167
            ],
            [
                36167,
                36377
            ],
            [
                36377,
                36474
            ],
            [
                36474,
                36509
            ],
            [
                36509,
                36640
            ],
            [
                36640,
                36665
            ],
            [
                36665,
                36885
            ],
            [
                36885,
                37106
            ],
            [
                37106,
                37143
            ],
            [
                37143,
                37251
            ],
            [
                37251,
                37549
            ],
            [
                37549,
                37783
            ],
            [
                37783,
                37917
            ],
            [
                37917,
                38021
            ],
            [
                38021,
                38268
            ],
            [
                38268,
                38501
            ],
            [
                38501,
                38690
            ],
            [
                38690,
                38947
            ],
            [
                38947,
                39334
            ],
            [
                39334,
                39507
            ],
            [
                39507,
                39647
            ],
            [
                39647,
                39739
            ],
            [
                39739,
                39857
            ]
        ]
    },
    "abridged": {
        "text": "The amiable behaviour of Mr. Crawley and Lady Jane highly flattered Miss Briggs, as did a Countess's card left personally for her. She put it away in her work-box amongst her most cherished treasures.\n\"What could Lady Southdown mean by leaving you a card, I wonder, Miss Briggs?\" said Miss Crawley. The companion explained how she had met Mr. Crawley walking with his fiance the day before. She told how kind and gentle-looking the lady was, and what a plain dress she had, and described her from the bonnet down to the boots with female accuracy.\nMiss Crawley was pining for society; so Pitt Crawley was graciously invited to come and see his aunt. He came bringing Lady Southdown and her daughter. The dowager did not say a word about the state of Miss Crawley's soul; but talked discreetly about the weather and the war, and above all, about doctors, quacks, and the particular merits of Dr. Podgers.\nDuring their interview Pitt Crawley made a great diplomatic stroke. When Lady Southdown was calling Napoleon a monster, a coward and a tyrant not fit to live, Pitt Crawley suddenly spoke up in his favour. He described Napoleon at Paris at the peace of Amiens; when he, Pitt Crawley, had the gratification of meeting the great Mr. Fox, an admirable statesman who had always had the highest opinion of the Emperor. And he spoke indignantly of the faithless conduct of the allies towards Bonaparte, who, after giving himself generously up to their mercy, was sent to a cruel banishment, while a bigoted Popish rabble tyrannised over France in his stead.\nThis orthodox horror of Romish superstition saved Pitt Crawley in Lady Southdown's opinion, whilst his admiration for Fox and Napoleon raised him immeasurably in Miss Crawley's eyes. A true Whig, Miss Crawley had been in opposition all through the war, and though, to be sure, the Emperor's downfall did not much agitate the old lady, yet when Pitt praised her idols he spoke to her heart, and advanced in her favour.\n\"And what do you think, my dear?\" Miss Crawley said to Lady Jane, for whom she had taken a liking at first sight, as she always did for pretty and modest young people; though it must be owned her affections cooled as rapidly as they rose.\nLady Jane blushed, and said \"that she did not understand politics, which she left to wiser heads; but though Mamma was, no doubt, correct, Mr. Crawley had spoken beautifully.\"\nAnd when the ladies were leaving, Miss Crawley hoped \"Lady Southdown would be so kind as to send her Lady Jane sometimes, if she could be spared to come and console a poor sick lonely old woman.\" This promise was granted, and they separated in friendship.\n\"Don't let Lady Southdown come again, Pitt,\" said the old lady. \"She is stupid and pompous. But bring that nice good-natured little Jane as often as you please.\"\nPitt promised to do so. He did not tell the Countess of Southdown of his aunt's opinion; her Ladyship thought that she had made a most delightful and majestic impression on Miss Crawley.\nAnd so Lady Jane became a pretty constant visitor to Miss Crawley, accompanied her in her drives, and solaced many of her evenings. She was so naturally good and soft that even Firkin was not jealous of her; and the gentle Briggs thought Miss Crawley was less cruel to her when kind Lady Jane was by.\nMiss Crawley was charming to Lady Jane, telling her a thousand anecdotes about her youth, and talking to her in a very different way to that in which she had talked to Rebecca. Lady Jane repaid Miss Crawley with artless sweetness and friendship.\nIn the autumn Lady Jane would sit in Miss Crawley's drawing-room singing little songs and hymns, while the sun was setting and the sea was roaring on the beach. The old spinster used to wake up when these ditties ceased, and ask for more. As for Briggs, she shed tears of happiness as she pretended to knit.\nPitt, meanwhile, in the dining-room with a pamphlet on the Corn Laws, sipped Madeira: built castles in the air: thought himself a fine fellow: and felt himself more in love with Jane than he had been any time these seven years.\n\"I wish, my love, I could get somebody to play piquet with me,\" Miss Crawley said one night. \"Poor Briggs can no more play than an owl, she is so stupid; and I think I should sleep better if I had my game.\"\nAt this Lady Jane blushed to the tips of her ears, and said:\n\"Miss Crawley, I can play a little. I used to play with poor dear papa.\"\n\"Come and kiss me, you dear good little soul,\" cried Miss Crawley in an ecstasy: and in this occupation Mr. Pitt found them when he came upstairs with his pamphlet.\nThis did not escape the attention of the Crawleys at the Rectory. Mrs. Bute had friends in Brighton who informed her of all that passed at Miss Crawley's house. Pitt was there more and more. He did not come to the Hall for months, while his abominable old father abandoned himself to rum-and-water, and the odious society of the Horrocks family. Pitt's success made the Rector's family furious, and Mrs. Bute regretted so insulting Miss Briggs and Firkin that she had not a single informant in Miss Crawley's household.\n\"It was all Bute's collar-bone,\" she said; \"if that had not broke, I never would have left her.\"\n\"It was you that frightened her,\" Bute interposed. \"You're a clever woman, but you've got a devil of a temper; and you're a screw with your money, Barbara.\"\n\"You'd have been in gaol, Bute, if I had not kept your money.\"\n\"I know, my dear,\" said the Rector, good-naturedly. \"You ARE a clever woman, but you manage too well, you know. What the deuce can she find in Pitt Crawley? He has not pluck enough to say Boo to a goose. I remember when Rawdon used to flog him round the stables, and Pitt would go howling home to his ma - ha, ha! Why, either of my boys would whop him with one hand. Jim says he's remembered at Oxford as Miss Crawley still I say, Barbara.\"\n\"What?\"\n\"I say, why not send Jim over to Brighton to see if he can do anything with the old lady? He's very near getting his degree, you know. He's been failed twice - so was I - but he's had an Oxford education. He's a handsome feller. Let's put him on the old woman, hey.\"\n\"Jim might go down and see her, certainly,\" his wife said; adding with a sigh, \"If we could only get one of the girls into the house; but she could never endure them, because they are not pretty!\"\nThose unfortunate and well-educated women were in the drawing-room, where they were thrumming away, with hard fingers, an elaborate piece on the piano; indeed, they were at music, or the back-board, or geography, or history, all day long. But what use are all these accomplishments, in Vanity Fair, to girls who are short, poor, plain, and have a bad complexion? Mrs. Bute could think of nobody but the Curate to take one of them off her hands.\nMrs. Bute did not predict much good from the sending of her son James as an ambassador. Nor did the young fellow himself expect much pleasure from his mission; but he was consoled by the thought that possibly the old lady would give him some handsome sum on leaving, which would pay a few bills at the start of the next Oxford term.\nSo he travelled by the coach from Southampton to Brighton with his portmanteau, his favourite bull-dog Towzer, and an immense basket of garden produce from the dear Rectory folks to dear Miss Crawley. Thinking it was too late to disturb the invalid lady on the first night of his arrival, he put up at an inn, and did not visit Miss Crawley until late afternoon next day.\nJames Crawley, when his aunt had last seen him, was a gawky lad, at that uncomfortable age when the voice varies between an unearthly treble and a bass; when boys are seen to shave furtively with their sister's scissors, and the sight of other young women produces terror in them; when the great hands and ankles protrude a long way from garments which have grown too tight. James, then a hobbadehoy, was now become a young man, and had acquired the polish which is gained by living in a fast set at a small college, and contracting debts, and being failed and rusticated.\nHe was a handsome lad, however, when he presented himself to his aunt, and good looks always earned the fickle old lady's favour. Nor did his awkwardness take away from it: she was pleased with these healthy tokens of the young gentleman's ingenuousness.\nHe said \"he had come down for a couple of days to see a man from his college, and - and to pay my respects to you, Ma'am, and my father and mother hope you are well.\"\nPitt was in the room with Miss Crawley when the lad was announced, and looked very blank. The old lady had plenty of humour, and enjoyed her correct nephew's perplexity. She asked after all the people at the Rectory with interest; and said she was thinking of paying them a visit. She told the lad he was very much improved, and that it was a pity his sisters had not some of his good looks; and finding that he had taken a room at an hotel, would not hear of his staying there, but bade Mr. Bowls send for Mr. James Crawley's things instantly; \"and Bowls,\" she added, with great graciousness, \"you will have the goodness to pay Mr. James's bill.\"\nShe flung Pitt a look of arch triumph, which made him almost choke with envy. She had never yet invited him to stay under her roof, and here was a young whipper-snapper who at first sight was made welcome.\n\"I beg your pardon, sir,\" says Bowls with a bow; \"what 'otel is it, sir?\"\n\"O, dam,\" said young James, in some alarm, \"I'll go.\"\n\"What!\" said Miss Crawley.\n\"The Tom Cribb's Arms,\" said James, blushing deeply.\nMiss Crawley burst out laughing. Mr. Bowls gave one abrupt guffaw; Pitt only smiled.\n\"I didn't know any better,\" said James, looking down. \"I've never been here before; it was the coachman told me.\" The fact is, that on the Southampton coach, James Crawley had met a boxer, the Tutbury Pet, who was coming to Brighton to make a match with the Rottingdean Fibber; and enchanted by the Pet's conversation, he had passed the evening with him and his friends at the inn in question.\n\"Go and settle the bill, Bowls,\" said Miss Crawley, with a wave of her hand, \"and bring it to me.\"\n\"There - there's a little dawg,\" said James, looking frightfully guilty. \"I'd best go for him. He bites footmen's calves.\"\nAll the party laughed; even Briggs and Lady Jane, who was sitting mute.\nTo punish her elder nephew, Miss Crawley persisted in being gracious to the young student. There were no limits to her kindness. She insisted that James should accompany her in her drive, and paraded him solemnly up and down the cliff in her barouche. During the drive she quoted Italian and French poetry to the poor bewildered lad, and said she was sure he would gain a gold medal, and be a Senior Wrangler.\n\"Haw, haw,\" laughed James, encouraged by these compliments; \"Senior Wrangler, indeed; that's at the other shop.\"\n\"What is the other shop, my dear child?\" said the lady.\n\"Cambridge, not Oxford,\" said the scholar, with a knowing air. Just then there appeared on the cliff, in a tax-cart drawn by a bang-up pony, his friends the Tutbury Pet and the Rottingdean Fibber, with three other gentlemen, who saluted poor James as he sat in the carriage. This incident damped his spirits, and he did not utter another word during the journey.\nOn his return he found his room prepared, and his bag there, and might have noticed that Mr. Bowls looked grave. But the thought of Mr. Bowls did not enter his head. He was deploring his dreadful predicament, staying in a house full of old women jabbering French and Italian, and talking poetry to him.\nAt dinner, James appeared choking in a white neckcloth, and had the honour of handing my Lady Jane downstairs. He did not talk much over dinner, but he made a point of asking all the ladies to drink wine, and accepted Mr. Crawley's offer of champagne, consuming most of the bottle which Mr. Bowls was ordered to produce in his honour.\nAfter the ladies had withdrawn, and the two cousins were left together, Pitt became very friendly. He asked after James's career and prospects - hoped heartily he would get on; and was frank and amiable. James's tongue unloosed with the port, and he told his cousin about his life, his debts, his troubles and his rows with the proctors, filling his glass from the bottles before him, and flying from Port to Madeira with joyous activity.\n\"My aunt is pleased when people do as they like in her house,\" said Mr. Crawley. \"This is Liberty Hall, James, and you can't do Miss Crawley a greater kindness than to do as you please, and ask for what you will. Miss Crawley is liberal. She is a Republican in principle, and despises rank or title.\"\n\"Why are you going to marry an Earl's daughter?\" said James.\n\"My dear friend, it is not poor Lady Jane's fault that she is well born,\" Pitt replied, with a courtly air. \"She cannot help being a lady.\"\n\"Oh, as for that,\" said Jim, \"there's nothing like old blood, dammy. I'm none of your radicals. I know what it is to be a gentleman, dammy. See the chaps in a boat-race; look at the fellers in a fight; aye, look at a dawg killing rats - which is it wins? the good-blooded ones. Get some more port, Bowls, old boy. What was I saying?\"\n\"I think you were speaking of dogs killing rats,\" Pitt remarked mildly, handing his cousin the decanter.\n\"Killing rats was I? Well, Pitt, are you a sporting man? Do you want to see a dawg as can kill a rat? Then come down with me to Castle Street Mews, and I'll show you such a bull-terrier - Pooh!\" cried James, laughing at his own absurdity. \"You don't care. I'm blest if you know the difference between a dawg and a duck.\"\n\"No. You were talking about blood,\" Pitt continued with increased blandness. \"Here's the fresh bottle.\"\n\"Blood's the word,\" said James, gulping the port down. \"Nothing like blood, sir, in hosses, dawgs, and men. Why, only last term, just before I was rusticated, I mean just before I had the measles, ha, ha - there was me and Bob Ringwood, Lord Cinqbars' son, having a beer at the Bell at Blenheim, when the Banbury bargeman offered to fight either of us for a bowl of punch. I couldn't. My arm was in a sling; a brute of a mare had fell with me at the Abingdon hunt. But Bob had his coat off at once - he stood up to the Banbury man for three minutes, and polished him off in four rounds easy. Blood, sir, all blood.\"\n\"You're not drinking, James,\" Pitt said. \"In my time at Oxford, the men passed round the bottle a little quicker than you young fellows seem to do.\"\n\"Come, come,\" said James, winking at his cousin, \"no jokes, old boy; no trying it on with me. You want to trot me out, but it's no go. In vino veritas, old boy. I wish my aunt would send down some of this to the governor; it's a precious good tap.\"\n\"You had better ask her,\" Machiavel continued, \"or make the best of it now,\" and he tossed back nearly a thimbleful of wine with an immense flourish of his glass.\nAt the Rectory, when the bottle of port was opened after dinner, honest James commonly had a couple of glasses, but as his father grew very sulky if he had more, the good lad generally refrained, and subsided either into the ladies' currant wine, or to some private gin-and-water in the stables with the coachman. At Oxford, the quantity of wine was unlimited, but the quality was inferior: but when quantity and quality united as at his aunt's house, James showed that he could appreciate them indeed. He hardly needed his cousin's encouragement to drain the second bottle.\nWhen the time came for coffee, however, and for a return to the ladies, the young gentleman relapsed into surly timidity; saying no more than yes and no, scowling at Lady Jane, and upsetting his cup.\nHe yawned in a pitiable manner, and his presence threw a damper upon the modest proceedings; for Miss Crawley and Lady Jane at their piquet, and Miss Briggs at her work, felt that his eyes were wildly fixed on them, and were uneasy under that maudlin look.\n\"He seems a very silent, awkward, bashful lad,\" said Miss Crawley to Mr. Pitt later.\n\"He is more communicative in men's society than with ladies,\" he dryly replied: perhaps rather disappointed that the wine had not made Jim talk more.\nJames spent part of the next morning in writing home to his mother a most flourishing account of his reception by Miss Crawley. But ah! he little knew what evils the day would bring, and how short his reign of favour was to be.\nJim had forgotten about something that had taken place at the Cribb's Arms, the night before he had come to his aunt's house. He had treated the Tutbury champion and the Rottingdean man, and their friends, to the refreshment of gin-and-water - so that no less than eighteen glasses at eightpence per glass were charged in Mr. James Crawley's bill.\nIt was not the money, but the quantity of gin which told fatally against poor James's character, when the butler, Mr. Bowls, went down to pay his bill. The landlord, fearing lest the account should be refused, swore solemnly that the young gent had consumed personally every drop of the liquor. Bowls paid the bill, and showed it on his return to Firkin, who was shocked at the frightful amount of gin. She took the bill to Miss Briggs, who thought it her duty to mention it to Miss Crawley.\nHad he drunk a dozen bottles of claret, the old spinster could have pardoned him. Mr. Fox drank claret. Gentlemen drank claret. But eighteen glasses of gin consumed among boxers in a pot-house - it was an odious crime.\nEverything went against the lad: he came home perfumed from the stables, where he had been to pay his dog Towzer a visit - and when he took Towzer out for an airing, he met Miss Crawley and her wheezy Blenheim spaniel, which Towzer would have eaten up had not the Blenheim fled squealing to the protection of Miss Briggs, while James stood laughing.\nThis day too the unlucky boy's modesty had forsaken him. He was lively and facetious at dinner. He levelled one or two jokes against Pitt Crawley: he drank as much wine as upon the previous day; and in the drawing-room, began to entertain the ladies with some choice Oxford stories. He described the different pugilistic qualities of the boxers Molyneux and Dutch Sam, offered playfully to give Lady Jane odds upon the Tutbury Pet against the Rottingdean man: and then proposed to back himself against his cousin Pitt Crawley, either with or without boxing gloves.\n\"And that's a fair offer, my buck,\" he said, with a loud laugh, slapping Pitt on the shoulder, \"and my father will go halves in the bet, ha, ha!\" The engaging youth nodded knowingly, and pointed his thumb at Pitt Crawley in a jocular and exulting manner.\nPitt was not altogether pleased, perhaps, but not unhappy. Poor Jim had his laugh: and staggered across the room with his aunt's candle, when the old lady moved to retire, and offered to kiss her with the blandest tipsy smile. Then he went upstairs to his own bedroom perfectly satisfied with himself, and with a pleased notion that his aunt's money would be left to him in preference to all the rest of the family.\nOnce up in the bedroom, he was attracted to the window by the romantic scene of the moonlight on the sea, and thought he would enjoy it while smoking. Nobody would smell the tobacco if he opened the window and kept his head and pipe in the fresh air.\nThis he did: but poor Jim had forgotten that his door was open, so that the breeze blowing in made a fine draught. The clouds of tobacco were carried downstairs, and arrived with undiminished fragrance to Miss Crawley and Miss Briggs.\nThe pipe of tobacco finished the business: and the Bute Crawleys never knew how many thousand pounds it cost them. Firkin rushed downstairs to Bowls who was reading out the \"Fire and the Frying Pan\" to his assistant in a loud and ghostly voice. The dreadful secret was told by Firkin with so frightened a look, that for the first moment Mr. Bowls thought that robbers were in the house.\nWhen made aware of the facts, however, Mr. Bowls rushed upstairs three steps at a time to enter James's apartment, calling in a voice stifled with alarm, \"Mr. James! For Gawd's sake, sir, stop that pipe. O, Mr. James, what 'ave you done! Missis can't abide 'em.\" With that, Bowls threw the pipe out of the window.\n\"Missis needn't smoke,\" said James with a laugh, and thought the whole matter an excellent joke. But his feelings were very different in the morning, when Mr. Bowls's young man, who brought him his hot water to shave that beard which he was so anxiously expecting, handed over a note in the handwriting of Miss Briggs.\n\"Dear sir,\" it said, \"Miss Crawley has passed an exceedingly disturbed night, owing to the shocking manner in which the house has been polluted by tobacco. Miss Crawley regrets that she is too unwell to see you before you go - and above all that she ever induced you to remove from the ale-house, where she is sure you will be much more comfortable during the rest of your stay at Brighton.\"\nAnd here honest James's career as a candidate for his aunt's favour ended. He had in fact, and without knowing it, done what he threatened to do. He had fought his cousin Pitt with the gloves.\nWhere meanwhile was he who had once been first favourite for this race? Rawdon and Becky were reunited after Waterloo, and were passing the winter of 1815 at Paris in great splendour and gaiety.\nRebecca was a good economist, and the price poor Jos Sedley had paid for her two horses was enough to keep their little establishment afloat for a year; there was no need to sell the pistols, or the gold dressing-case, or the cloak lined with sable. Becky had it made into a pelisse, in which she rode in the Bois de Boulogne to the admiration of all. You should have seen her when she unsewed herself, and let out of her dress all those watches, bank-notes and valuables which she had secreted in the wadding! Tufto was charmed, and Rawdon, delighted, roared with laughter, and swore that she was better than any play. And when she described how she had outwitted Jos, his delight reached a pitch of quite insane enthusiasm. He believed in his wife as much as the French soldiers in Napoleon.\nHer success in Paris was remarkable. All the French ladies voted her charming. She spoke their language admirably. She adopted their grace, their liveliness, their manner. Her husband was stupid certainly - but all English are stupid, and he was the heir of the rich Miss Crawley.\n\"Why,\" wrote a great lady to Miss Crawley, in French, \"Why does not our dear Miss come to her nephew and niece in Paris? All the world talks of the charming Mistress and her beauty. Yes, we see in her the grace, the charm, the wit of our dear friend Miss Crawley! The King took notice of her yesterday at the Tuileries. How interesting and pretty this fair creature looks surrounded by the homage of the men, and so soon to be a mother! To hear her speak of you would bring tears to the eyes of ogres. How she loves you! how we all love our admirable Miss Crawley!\"\nSadly, this letter did not advance Mrs. Becky's interest with her relative. On the contrary, the old spinster was furious when she found Rebecca had used her name to get an entree into Parisian society. She dictated to Briggs an angry answer in English warning the public to beware of Mrs. Rawdon Crawley as a most artful and dangerous person. But as Madame her correspondent did not understand English, she merely told Mrs. Rawdon that she had received a charming letter full of benevolent things; and Rebecca began to hope that Miss Crawley would relent.\nMeanwhile, she was the gayest and most admired of Englishwomen. All the world was at Paris during this famous winter. Famous warriors rode by her carriage, or crowded her modest little box at the Opera. Rawdon was in the highest spirits. There were no debt-collectors in Paris as yet: there were parties every day; play was plentiful and his luck good. Tufto perhaps was sulky. Mrs. Tufto had come to Paris, and besides, there were a score of generals now round Becky's chair. Lady Bareacres and stupid English females writhed with anguish at the success of the little upstart Becky. But she had all the men on her side.\nSo in fetes, pleasure, and prosperity, the winter of 1815-16 passed. In the early spring of 1816, the Journal contained the following announcement: \"On the 26th of March - to the Lady of Lieutenant-Colonel Crawley of the Life Guards Green - a son and heir.\"\nThis event was copied into the London papers, from which Miss Briggs read the statement to Miss Crawley at Brighton. The news, though no surprise, caused a crisis in the affairs of the Crawley family. The spinster's rage rose to its height. Sending instantly for Pitt, her nephew, and for Lady Southdown, she requested an immediate celebration of the marriage which had been so long pending between the two families. And she announced that she would give the young couple a thousand a year during her lifetime, at the end of which the bulk of her property would be settled upon her nephew and her dear niece, Lady Jane Crawley.\nSo they were married. Pitt would have liked to take a honeymoon tour with his bride; but the old lady's attachment to Lady Jane was so strong that she could not part with her favourite. Pitt and his wife came therefore and lived with Miss Crawley: and (greatly to the annoyance of poor Pitt) Lady Southdown, from her neighbouring house, reigned over the whole family - Miss Crawley, Briggs and all. She pitilessly dosed them with her tracts and her medicine, she dismissed Creamer, and soon stripped Miss Crawley of even the semblance of authority. The poor soul grew so timid that she stopped bullying Briggs, and clung to her niece.\nPeace to thee, kind and selfish, vain and generous old heathen! We shall see thee no more. Let us hope that Lady Jane supported her kindly, and led her with a gentle hand out of the busy struggle of Vanity Fair.",
        "paragraph_chars": [
            [
                0,
                201
            ],
            [
                201,
                548
            ],
            [
                548,
                904
            ],
            [
                904,
                1555
            ],
            [
                1555,
                1973
            ],
            [
                1973,
                2212
            ],
            [
                2212,
                2388
            ],
            [
                2388,
                2644
            ],
            [
                2644,
                2806
            ],
            [
                2806,
                2993
            ],
            [
                2993,
                3294
            ],
            [
                3294,
                3540
            ],
            [
                3540,
                3848
            ],
            [
                3848,
                4076
            ],
            [
                4076,
                4283
            ],
            [
                4283,
                4344
            ],
            [
                4344,
                4417
            ],
            [
                4417,
                4582
            ],
            [
                4582,
                5102
            ],
            [
                5102,
                5199
            ],
            [
                5199,
                5356
            ],
            [
                5356,
                5419
            ],
            [
                5419,
                5860
            ],
            [
                5860,
                5868
            ],
            [
                5868,
                6135
            ],
            [
                6135,
                6332
            ],
            [
                6332,
                6777
            ],
            [
                6777,
                7110
            ],
            [
                7110,
                7482
            ],
            [
                7482,
                8055
            ],
            [
                8055,
                8310
            ],
            [
                8310,
                8477
            ],
            [
                8477,
                9125
            ],
            [
                9125,
                9331
            ],
            [
                9331,
                9405
            ],
            [
                9405,
                9459
            ],
            [
                9459,
                9486
            ],
            [
                9486,
                9539
            ],
            [
                9539,
                9624
            ],
            [
                9624,
                10018
            ],
            [
                10018,
                10117
            ],
            [
                10117,
                10240
            ],
            [
                10240,
                10312
            ],
            [
                10312,
                10722
            ],
            [
                10722,
                10835
            ],
            [
                10835,
                10891
            ],
            [
                10891,
                11254
            ],
            [
                11254,
                11557
            ],
            [
                11557,
                11892
            ],
            [
                11892,
                12331
            ],
            [
                12331,
                12632
            ],
            [
                12632,
                12693
            ],
            [
                12693,
                12833
            ],
            [
                12833,
                13167
            ],
            [
                13167,
                13272
            ],
            [
                13272,
                13593
            ],
            [
                13593,
                13697
            ],
            [
                13697,
                14313
            ],
            [
                14313,
                14462
            ],
            [
                14462,
                14711
            ],
            [
                14711,
                14874
            ],
            [
                14874,
                15449
            ],
            [
                15449,
                15649
            ],
            [
                15649,
                15906
            ],
            [
                15906,
                15991
            ],
            [
                15991,
                16141
            ],
            [
                16141,
                16369
            ],
            [
                16369,
                16717
            ],
            [
                16717,
                17209
            ],
            [
                17209,
                17428
            ],
            [
                17428,
                17778
            ],
            [
                17778,
                18343
            ],
            [
                18343,
                18598
            ],
            [
                18598,
                19014
            ],
            [
                19014,
                19265
            ],
            [
                19265,
                19500
            ],
            [
                19500,
                19887
            ],
            [
                19887,
                20201
            ],
            [
                20201,
                20520
            ],
            [
                20520,
                20912
            ],
            [
                20912,
                21105
            ],
            [
                21105,
                21300
            ],
            [
                21300,
                22094
            ],
            [
                22094,
                22375
            ],
            [
                22375,
                22941
            ],
            [
                22941,
                23498
            ],
            [
                23498,
                24119
            ],
            [
                24119,
                24377
            ],
            [
                24377,
                25005
            ],
            [
                25005,
                25640
            ],
            [
                25640,
                25851
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                201
            ],
            [
                201,
                280
            ],
            [
                280,
                299
            ],
            [
                299,
                391
            ],
            [
                391,
                548
            ],
            [
                548,
                650
            ],
            [
                650,
                700
            ],
            [
                700,
                904
            ],
            [
                904,
                972
            ],
            [
                972,
                1109
            ],
            [
                1109,
                1317
            ],
            [
                1317,
                1555
            ],
            [
                1555,
                1738
            ],
            [
                1738,
                1973
            ],
            [
                1973,
                2007
            ],
            [
                2007,
                2212
            ],
            [
                2212,
                2388
            ],
            [
                2388,
                2584
            ],
            [
                2584,
                2644
            ],
            [
                2644,
                2708
            ],
            [
                2708,
                2736
            ],
            [
                2736,
                2806
            ],
            [
                2806,
                2830
            ],
            [
                2830,
                2993
            ],
            [
                2993,
                3125
            ],
            [
                3125,
                3294
            ],
            [
                3294,
                3471
            ],
            [
                3471,
                3540
            ],
            [
                3540,
                3701
            ],
            [
                3701,
                3779
            ],
            [
                3779,
                3848
            ],
            [
                3848,
                4076
            ],
            [
                4076,
                4169
            ],
            [
                4169,
                4283
            ],
            [
                4283,
                4344
            ],
            [
                4344,
                4380
            ],
            [
                4380,
                4417
            ],
            [
                4417,
                4582
            ],
            [
                4582,
                4648
            ],
            [
                4648,
                4743
            ],
            [
                4743,
                4773
            ],
            [
                4773,
                4928
            ],
            [
                4928,
                5102
            ],
            [
                5102,
                5199
            ],
            [
                5199,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5356,
                5419
            ],
            [
                5419,
                5471
            ],
            [
                5471,
                5531
            ],
            [
                5531,
                5576
            ],
            [
                5576,
                5623
            ],
            [
                5623,
                5733
            ],
            [
                5733,
                5786
            ],
            [
                5786,
                5860
            ],
            [
                5860,
                5868
            ],
            [
                5868,
                5958
            ],
            [
                5958,
                6003
            ],
            [
                6003,
                6073
            ],
            [
                6073,
                6097
            ],
            [
                6097,
                6135
            ],
            [
                6135,
                6332
            ],
            [
                6332,
                6571
            ],
            [
                6571,
                6695
            ],
            [
                6695,
                6777
            ],
            [
                6777,
                6865
            ],
            [
                6865,
                7110
            ],
            [
                7110,
                7311
            ],
            [
                7311,
                7482
            ],
            [
                7482,
                7857
            ],
            [
                7857,
                8055
            ],
            [
                8055,
                8185
            ],
            [
                8185,
                8310
            ],
            [
                8310,
                8477
            ],
            [
                8477,
                8567
            ],
            [
                8567,
                8647
            ],
            [
                8647,
                8758
            ],
            [
                8758,
                9125
            ],
            [
                9125,
                9203
            ],
            [
                9203,
                9331
            ],
            [
                9331,
                9405
            ],
            [
                9405,
                9459
            ],
            [
                9459,
                9467
            ],
            [
                9467,
                9486
            ],
            [
                9486,
                9539
            ],
            [
                9539,
                9572
            ],
            [
                9572,
                9624
            ],
            [
                9624,
                9678
            ],
            [
                9678,
                9738
            ],
            [
                9738,
                10018
            ],
            [
                10018,
                10117
            ],
            [
                10117,
                10190
            ],
            [
                10190,
                10212
            ],
            [
                10212,
                10240
            ],
            [
                10240,
                10312
            ],
            [
                10312,
                10403
            ],
            [
                10403,
                10441
            ],
            [
                10441,
                10564
            ],
            [
                10564,
                10722
            ],
            [
                10722,
                10835
            ],
            [
                10835,
                10876
            ],
            [
                10876,
                10891
            ],
            [
                10891,
                10954
            ],
            [
                10954,
                11166
            ],
            [
                11166,
                11254
            ],
            [
                11254,
                11367
            ],
            [
                11367,
                11420
            ],
            [
                11420,
                11557
            ],
            [
                11557,
                11668
            ],
            [
                11668,
                11892
            ],
            [
                11892,
                11991
            ],
            [
                11991,
                12096
            ],
            [
                12096,
                12331
            ],
            [
                12331,
                12412
            ],
            [
                12412,
                12544
            ],
            [
                12544,
                12569
            ],
            [
                12569,
                12632
            ],
            [
                12632,
                12681
            ],
            [
                12681,
                12693
            ],
            [
                12693,
                12801
            ],
            [
                12801,
                12833
            ],
            [
                12833,
                12902
            ],
            [
                12902,
                12929
            ],
            [
                12929,
                12973
            ],
            [
                12973,
                13088
            ],
            [
                13088,
                13111
            ],
            [
                13111,
                13147
            ],
            [
                13147,
                13167
            ],
            [
                13167,
                13272
            ],
            [
                13272,
                13293
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13374
            ],
            [
                13374,
                13467
            ],
            [
                13467,
                13511
            ],
            [
                13511,
                13528
            ],
            [
                13528,
                13593
            ],
            [
                13593,
                13598
            ],
            [
                13598,
                13670
            ],
            [
                13670,
                13697
            ],
            [
                13697,
                13752
            ],
            [
                13752,
                13805
            ],
            [
                13805,
                14070
            ],
            [
                14070,
                14082
            ],
            [
                14082,
                14162
            ],
            [
                14162,
                14289
            ],
            [
                14289,
                14313
            ],
            [
                14313,
                14354
            ],
            [
                14354,
                14462
            ],
            [
                14462,
                14556
            ],
            [
                14556,
                14597
            ],
            [
                14597,
                14623
            ],
            [
                14623,
                14711
            ],
            [
                14711,
                14874
            ],
            [
                14874,
                15188
            ],
            [
                15188,
                15377
            ],
            [
                15377,
                15449
            ],
            [
                15449,
                15649
            ],
            [
                15649,
                15906
            ],
            [
                15906,
                15991
            ],
            [
                15991,
                16141
            ],
            [
                16141,
                16269
            ],
            [
                16269,
                16277
            ],
            [
                16277,
                16369
            ],
            [
                16369,
                16495
            ],
            [
                16495,
                16717
            ],
            [
                16717,
                16869
            ],
            [
                16869,
                17012
            ],
            [
                17012,
                17120
            ],
            [
                17120,
                17209
            ],
            [
                17209,
                17291
            ],
            [
                17291,
                17313
            ],
            [
                17313,
                17337
            ],
            [
                17337,
                17428
            ],
            [
                17428,
                17778
            ],
            [
                17778,
                17835
            ],
            [
                17835,
                17874
            ],
            [
                17874,
                18061
            ],
            [
                18061,
                18343
            ],
            [
                18343,
                18489
            ],
            [
                18489,
                18598
            ],
            [
                18598,
                18657
            ],
            [
                18657,
                18825
            ],
            [
                18825,
                19014
            ],
            [
                19014,
                19165
            ],
            [
                19165,
                19265
            ],
            [
                19265,
                19380
            ],
            [
                19380,
                19500
            ],
            [
                19500,
                19615
            ],
            [
                19615,
                19745
            ],
            [
                19745,
                19887
            ],
            [
                19887,
                20053
            ],
            [
                20053,
                20091
            ],
            [
                20091,
                20125
            ],
            [
                20125,
                20150
            ],
            [
                20150,
                20201
            ],
            [
                20201,
                20298
            ],
            [
                20298,
                20520
            ],
            [
                20520,
                20676
            ],
            [
                20676,
                20912
            ],
            [
                20912,
                20987
            ],
            [
                20987,
                21058
            ],
            [
                21058,
                21105
            ],
            [
                21105,
                21177
            ],
            [
                21177,
                21300
            ],
            [
                21300,
                21550
            ],
            [
                21550,
                21652
            ],
            [
                21652,
                21811
            ],
            [
                21811,
                21920
            ],
            [
                21920,
                22026
            ],
            [
                22026,
                22094
            ],
            [
                22094,
                22131
            ],
            [
                22131,
                22173
            ],
            [
                22173,
                22209
            ],
            [
                22209,
                22266
            ],
            [
                22266,
                22375
            ],
            [
                22375,
                22496
            ],
            [
                22496,
                22557
            ],
            [
                22557,
                22639
            ],
            [
                22639,
                22695
            ],
            [
                22695,
                22812
            ],
            [
                22812,
                22877
            ],
            [
                22877,
                22896
            ],
            [
                22896,
                22941
            ],
            [
                22941,
                23017
            ],
            [
                23017,
                23144
            ],
            [
                23144,
                23285
            ],
            [
                23285,
                23498
            ],
            [
                23498,
                23562
            ],
            [
                23562,
                23616
            ],
            [
                23616,
                23701
            ],
            [
                23701,
                23736
            ],
            [
                23736,
                23851
            ],
            [
                23851,
                23876
            ],
            [
                23876,
                23975
            ],
            [
                23975,
                24082
            ],
            [
                24082,
                24119
            ],
            [
                24119,
                24188
            ],
            [
                24188,
                24377
            ],
            [
                24377,
                24494
            ],
            [
                24494,
                24578
            ],
            [
                24578,
                24618
            ],
            [
                24618,
                24794
            ],
            [
                24794,
                25005
            ],
            [
                25005,
                25027
            ],
            [
                25027,
                25191
            ],
            [
                25191,
                25404
            ],
            [
                25404,
                25554
            ],
            [
                25554,
                25640
            ],
            [
                25640,
                25704
            ],
            [
                25704,
                25731
            ],
            [
                25731,
                25851
            ]
        ],
        "overlap_chars": [
            [
                0,
                36
            ],
            [
                37,
                50
            ],
            [
                51,
                80
            ],
            [
                88,
                121
            ],
            [
                122,
                129
            ],
            [
                129,
                130
            ],
            [
                131,
                138
            ],
            [
                142,
                146
            ],
            [
                147,
                189
            ],
            [
                190,
                200
            ],
            [
                201,
                243
            ],
            [
                244,
                247
            ],
            [
                248,
                254
            ],
            [
                254,
                279
            ],
            [
                280,
                284
            ],
            [
                285,
                298
            ],
            [
                299,
                302
            ],
            [
                313,
                367
            ],
            [
                375,
                389
            ],
            [
                391,
                458
            ],
            [
                459,
                473
            ],
            [
                474,
                477
            ],
            [
                478,
                487
            ],
            [
                492,
                525
            ],
            [
                526,
                548
            ],
            [
                548,
                560
            ],
            [
                561,
                583
            ],
            [
                588,
                650
            ],
            [
                650,
                657
            ],
            [
                658,
                666
            ],
            [
                667,
                700
            ],
            [
                700,
                781
            ],
            [
                793,
                810
            ],
            [
                811,
                818
            ],
            [
                819,
                822
            ],
            [
                822,
                823
            ],
            [
                824,
                902
            ],
            [
                902,
                904
            ],
            [
                904,
                952
            ],
            [
                953,
                963
            ],
            [
                964,
                970
            ],
            [
                970,
                972
            ],
            [
                972,
                976
            ],
            [
                982,
                991
            ],
            [
                992,
                995
            ],
            [
                1013,
                1022
            ],
            [
                1022,
                1062
            ],
            [
                1063,
                1084
            ],
            [
                1091,
                1093
            ],
            [
                1094,
                1096
            ],
            [
                1101,
                1107
            ],
            [
                1107,
                1109
            ],
            [
                1109,
                1121
            ],
            [
                1122,
                1130
            ],
            [
                1131,
                1211
            ],
            [
                1220,
                1229
            ],
            [
                1230,
                1238
            ],
            [
                1252,
                1315
            ],
            [
                1315,
                1317
            ],
            [
                1317,
                1329
            ],
            [
                1342,
                1388
            ],
            [
                1398,
                1459
            ],
            [
                1465,
                1467
            ],
            [
                1470,
                1517
            ],
            [
                1518,
                1524
            ],
            [
                1529,
                1555
            ],
            [
                1555,
                1738
            ],
            [
                1738,
                1835
            ],
            [
                1836,
                1843
            ],
            [
                1846,
                1854
            ],
            [
                1855,
                1862
            ],
            [
                1863,
                1889
            ],
            [
                1890,
                1893
            ],
            [
                1894,
                1898
            ],
            [
                1899,
                1903
            ],
            [
                1912,
                1921
            ],
            [
                1922,
                1924
            ],
            [
                1925,
                1943
            ],
            [
                1943,
                1944
            ],
            [
                1945,
                1948
            ],
            [
                1958,
                1973
            ],
            [
                1973,
                2007
            ],
            [
                2007,
                2027
            ],
            [
                2028,
                2032
            ],
            [
                2037,
                2212
            ],
            [
                2212,
                2229
            ],
            [
                2229,
                2308
            ],
            [
                2308,
                2387
            ],
            [
                2388,
                2412
            ],
            [
                2420,
                2540
            ],
            [
                2541,
                2584
            ],
            [
                2584,
                2600
            ],
            [
                2608,
                2628
            ],
            [
                2642,
                2644
            ],
            [
                2644,
                2708
            ],
            [
                2708,
                2734
            ],
            [
                2734,
                2736
            ],
            [
                2736,
                2792
            ],
            [
                2793,
                2805
            ],
            [
                2806,
                2819
            ],
            [
                2823,
                2830
            ],
            [
                2830,
                2871
            ],
            [
                2872,
                2874
            ],
            [
                2875,
                2883
            ],
            [
                2886,
                2893
            ],
            [
                2895,
                2907
            ],
            [
                2908,
                2993
            ],
            [
                2993,
                2999
            ],
            [
                3000,
                3125
            ],
            [
                3125,
                3159
            ],
            [
                3160,
                3230
            ],
            [
                3244,
                3293
            ],
            [
                3294,
                3310
            ],
            [
                3311,
                3319
            ],
            [
                3320,
                3322
            ],
            [
                3323,
                3332
            ],
            [
                3332,
                3333
            ],
            [
                3342,
                3383
            ],
            [
                3384,
                3387
            ],
            [
                3388,
                3422
            ],
            [
                3427,
                3429
            ],
            [
                3430,
                3451
            ],
            [
                3462,
                3469
            ],
            [
                3469,
                3471
            ],
            [
                3481,
                3500
            ],
            [
                3506,
                3540
            ],
            [
                3540,
                3553
            ],
            [
                3554,
                3569
            ],
            [
                3574,
                3612
            ],
            [
                3613,
                3619
            ],
            [
                3620,
                3701
            ],
            [
                3701,
                3779
            ],
            [
                3779,
                3793
            ],
            [
                3794,
                3797
            ],
            [
                3798,
                3802
            ],
            [
                3803,
                3821
            ],
            [
                3822,
                3846
            ],
            [
                3848,
                3852
            ],
            [
                3852,
                3853
            ],
            [
                3854,
                3863
            ],
            [
                3863,
                3864
            ],
            [
                3865,
                3883
            ],
            [
                3884,
                3916
            ],
            [
                3916,
                3917
            ],
            [
                3918,
                3990
            ],
            [
                3991,
                3994
            ],
            [
                3995,
                4007
            ],
            [
                4008,
                4074
            ],
            [
                4074,
                4075
            ],
            [
                4076,
                4167
            ],
            [
                4167,
                4169
            ],
            [
                4169,
                4228
            ],
            [
                4230,
                4283
            ],
            [
                4283,
                4327
            ],
            [
                4328,
                4337
            ],
            [
                4338,
                4344
            ],
            [
                4344,
                4380
            ],
            [
                4380,
                4389
            ],
            [
                4390,
                4394
            ],
            [
                4395,
                4417
            ],
            [
                4418,
                4434
            ],
            [
                4434,
                4509
            ],
            [
                4510,
                4535
            ],
            [
                4541,
                4567
            ],
            [
                4568,
                4571
            ],
            [
                4572,
                4580
            ],
            [
                4580,
                4581
            ],
            [
                4591,
                4594
            ],
            [
                4602,
                4618
            ],
            [
                4623,
                4627
            ],
            [
                4632,
                4646
            ],
            [
                4646,
                4648
            ],
            [
                4648,
                4672
            ],
            [
                4673,
                4681
            ],
            [
                4682,
                4685
            ],
            [
                4695,
                4705
            ],
            [
                4706,
                4741
            ],
            [
                4741,
                4743
            ],
            [
                4743,
                4773
            ],
            [
                4773,
                4788
            ],
            [
                4789,
                4800
            ],
            [
                4801,
                4811
            ],
            [
                4811,
                4812
            ],
            [
                4819,
                4862
            ],
            [
                4863,
                4928
            ],
            [
                4928,
                4942
            ],
            [
                4948,
                5000
            ],
            [
                5001,
                5025
            ],
            [
                5026,
                5036
            ],
            [
                5037,
                5062
            ],
            [
                5073,
                5100
            ],
            [
                5100,
                5101
            ],
            [
                5102,
                5138
            ],
            [
                5143,
                5196
            ],
            [
                5200,
                5230
            ],
            [
                5230,
                5232
            ],
            [
                5238,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5356,
                5372
            ],
            [
                5373,
                5419
            ],
            [
                5419,
                5426
            ],
            [
                5426,
                5471
            ],
            [
                5471,
                5529
            ],
            [
                5529,
                5530
            ],
            [
                5531,
                5561
            ],
            [
                5562,
                5574
            ],
            [
                5579,
                5606
            ],
            [
                5611,
                5623
            ],
            [
                5623,
                5645
            ],
            [
                5646,
                5680
            ],
            [
                5680,
                5681
            ],
            [
                5682,
                5722
            ],
            [
                5723,
                5724
            ],
            [
                5725,
                5733
            ],
            [
                5733,
                5786
            ],
            [
                5786,
                5842
            ],
            [
                5843,
                5857
            ],
            [
                5860,
                5867
            ],
            [
                5868,
                5956
            ],
            [
                5958,
                6003
            ],
            [
                6003,
                6007
            ],
            [
                6008,
                6012
            ],
            [
                6020,
                6025
            ],
            [
                6028,
                6036
            ],
            [
                6039,
                6051
            ],
            [
                6055,
                6061
            ],
            [
                6062,
                6073
            ],
            [
                6073,
                6097
            ],
            [
                6097,
                6132
            ],
            [
                6135,
                6178
            ],
            [
                6183,
                6226
            ],
            [
                6232,
                6331
            ],
            [
                6332,
                6373
            ],
            [
                6382,
                6385
            ],
            [
                6386,
                6463
            ],
            [
                6464,
                6482
            ],
            [
                6482,
                6483
            ],
            [
                6484,
                6514
            ],
            [
                6515,
                6518
            ],
            [
                6519,
                6523
            ],
            [
                6523,
                6524
            ],
            [
                6524,
                6533
            ],
            [
                6534,
                6547
            ],
            [
                6548,
                6556
            ],
            [
                6561,
                6571
            ],
            [
                6571,
                6579
            ],
            [
                6588,
                6695
            ],
            [
                6695,
                6775
            ],
            [
                6775,
                6777
            ],
            [
                6777,
                6794
            ],
            [
                6803,
                6812
            ],
            [
                6813,
                6863
            ],
            [
                6863,
                6865
            ],
            [
                6865,
                6897
            ],
            [
                6898,
                6918
            ],
            [
                6919,
                6923
            ],
            [
                6924,
                6935
            ],
            [
                6935,
                7027
            ],
            [
                7032,
                7034
            ],
            [
                7042,
                7065
            ],
            [
                7066,
                7078
            ],
            [
                7085,
                7091
            ],
            [
                7097,
                7108
            ],
            [
                7110,
                7112
            ],
            [
                7126,
                7155
            ],
            [
                7156,
                7158
            ],
            [
                7159,
                7167
            ],
            [
                7168,
                7245
            ],
            [
                7246,
                7260
            ],
            [
                7261,
                7291
            ],
            [
                7292,
                7311
            ],
            [
                7320,
                7431
            ],
            [
                7438,
                7456
            ],
            [
                7457,
                7461
            ],
            [
                7472,
                7482
            ],
            [
                7482,
                7519
            ],
            [
                7525,
                7628
            ],
            [
                7629,
                7633
            ],
            [
                7633,
                7746
            ],
            [
                7747,
                7855
            ],
            [
                7855,
                7857
            ],
            [
                7857,
                7910
            ],
            [
                7911,
                7914
            ],
            [
                7915,
                7918
            ],
            [
                7919,
                7931
            ],
            [
                7932,
                8031
            ],
            [
                8039,
                8042
            ],
            [
                8043,
                8053
            ],
            [
                8053,
                8055
            ],
            [
                8055,
                8094
            ],
            [
                8105,
                8124
            ],
            [
                8124,
                8140
            ],
            [
                8141,
                8147
            ],
            [
                8155,
                8185
            ],
            [
                8185,
                8196
            ],
            [
                8197,
                8310
            ],
            [
                8310,
                8369
            ],
            [
                8375,
                8391
            ],
            [
                8394,
                8445
            ],
            [
                8446,
                8456
            ],
            [
                8457,
                8477
            ],
            [
                8477,
                8565
            ],
            [
                8565,
                8567
            ],
            [
                8567,
                8647
            ],
            [
                8647,
                8697
            ],
            [
                8698,
                8758
            ],
            [
                8758,
                8761
            ],
            [
                8767,
                8774
            ],
            [
                8775,
                8781
            ],
            [
                8782,
                8880
            ],
            [
                8881,
                8898
            ],
            [
                8906,
                8940
            ],
            [
                8949,
                9026
            ],
            [
                9027,
                9125
            ],
            [
                9125,
                9169
            ],
            [
                9179,
                9185
            ],
            [
                9186,
                9203
            ],
            [
                9203,
                9293
            ],
            [
                9294,
                9329
            ],
            [
                9329,
                9331
            ],
            [
                9331,
                9367
            ],
            [
                9368,
                9374
            ],
            [
                9375,
                9391
            ],
            [
                9397,
                9402
            ],
            [
                9402,
                9405
            ],
            [
                9405,
                9432
            ],
            [
                9433,
                9459
            ],
            [
                9459,
                9467
            ],
            [
                9467,
                9486
            ],
            [
                9486,
                9539
            ],
            [
                9539,
                9570
            ],
            [
                9570,
                9572
            ],
            [
                9572,
                9604
            ],
            [
                9604,
                9605
            ],
            [
                9611,
                9624
            ],
            [
                9624,
                9625
            ],
            [
                9625,
                9678
            ],
            [
                9678,
                9738
            ],
            [
                9738,
                9781
            ],
            [
                9782,
                9803
            ],
            [
                9811,
                9812
            ],
            [
                9813,
                9942
            ],
            [
                9946,
                9968
            ],
            [
                9969,
                9973
            ],
            [
                9978,
                9993
            ],
            [
                9994,
                10018
            ],
            [
                10018,
                10050
            ],
            [
                10051,
                10055
            ],
            [
                10068,
                10117
            ],
            [
                10117,
                10123
            ],
            [
                10126,
                10190
            ],
            [
                10190,
                10212
            ],
            [
                10212,
                10240
            ],
            [
                10240,
                10253
            ],
            [
                10261,
                10310
            ],
            [
                10310,
                10312
            ],
            [
                10322,
                10393
            ],
            [
                10401,
                10403
            ],
            [
                10403,
                10439
            ],
            [
                10439,
                10441
            ],
            [
                10441,
                10444
            ],
            [
                10445,
                10546
            ],
            [
                10554,
                10564
            ],
            [
                10564,
                10570
            ],
            [
                10581,
                10649
            ],
            [
                10655,
                10658
            ],
            [
                10659,
                10662
            ],
            [
                10663,
                10722
            ],
            [
                10722,
                10835
            ],
            [
                10835,
                10876
            ],
            [
                10876,
                10891
            ],
            [
                10891,
                10892
            ],
            [
                10892,
                10952
            ],
            [
                10964,
                10991
            ],
            [
                10991,
                10992
            ],
            [
                10993,
                11006
            ],
            [
                11007,
                11030
            ],
            [
                11030,
                11114
            ],
            [
                11114,
                11119
            ],
            [
                11120,
                11138
            ],
            [
                11139,
                11144
            ],
            [
                11149,
                11164
            ],
            [
                11164,
                11166
            ],
            [
                11166,
                11186
            ],
            [
                11191,
                11203
            ],
            [
                11204,
                11206
            ],
            [
                11215,
                11220
            ],
            [
                11229,
                11233
            ],
            [
                11234,
                11244
            ],
            [
                11252,
                11254
            ],
            [
                11254,
                11303
            ],
            [
                11313,
                11329
            ],
            [
                11338,
                11352
            ],
            [
                11365,
                11367
            ],
            [
                11367,
                11420
            ],
            [
                11420,
                11436
            ],
            [
                11441,
                11461
            ],
            [
                11461,
                11462
            ],
            [
                11471,
                11499
            ],
            [
                11500,
                11556
            ],
            [
                11557,
                11666
            ],
            [
                11666,
                11668
            ],
            [
                11671,
                11688
            ],
            [
                11700,
                11788
            ],
            [
                11795,
                11807
            ],
            [
                11807,
                11808
            ],
            [
                11824,
                11826
            ],
            [
                11827,
                11830
            ],
            [
                11831,
                11837
            ],
            [
                11838,
                11891
            ],
            [
                11898,
                11908
            ],
            [
                11913,
                11943
            ],
            [
                11949,
                11968
            ],
            [
                11976,
                11980
            ],
            [
                11981,
                11991
            ],
            [
                11991,
                12020
            ],
            [
                12025,
                12034
            ],
            [
                12043,
                12072
            ],
            [
                12073,
                12096
            ],
            [
                12096,
                12157
            ],
            [
                12164,
                12172
            ],
            [
                12172,
                12197
            ],
            [
                12198,
                12237
            ],
            [
                12238,
                12241
            ],
            [
                12248,
                12331
            ],
            [
                12331,
                12332
            ],
            [
                12332,
                12339
            ],
            [
                12340,
                12342
            ],
            [
                12356,
                12362
            ],
            [
                12363,
                12391
            ],
            [
                12391,
                12410
            ],
            [
                12410,
                12412
            ],
            [
                12413,
                12544
            ],
            [
                12544,
                12567
            ],
            [
                12567,
                12569
            ],
            [
                12569,
                12615
            ],
            [
                12616,
                12632
            ],
            [
                12632,
                12681
            ],
            [
                12681,
                12693
            ],
            [
                12693,
                12709
            ],
            [
                12710,
                12801
            ],
            [
                12801,
                12830
            ],
            [
                12833,
                12893
            ],
            [
                12893,
                12900
            ],
            [
                12900,
                12902
            ],
            [
                12902,
                12929
            ],
            [
                12929,
                12973
            ],
            [
                12973,
                13067
            ],
            [
                13070,
                13088
            ],
            [
                13088,
                13111
            ],
            [
                13111,
                13145
            ],
            [
                13145,
                13147
            ],
            [
                13147,
                13157
            ],
            [
                13164,
                13167
            ],
            [
                13167,
                13270
            ],
            [
                13272,
                13293
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13374
            ],
            [
                13379,
                13399
            ],
            [
                13400,
                13457
            ],
            [
                13460,
                13464
            ],
            [
                13473,
                13479
            ],
            [
                13480,
                13509
            ],
            [
                13511,
                13526
            ],
            [
                13526,
                13528
            ],
            [
                13528,
                13540
            ],
            [
                13541,
                13574
            ],
            [
                13580,
                13593
            ],
            [
                13593,
                13596
            ],
            [
                13598,
                13614
            ],
            [
                13615,
                13626
            ],
            [
                13626,
                13668
            ],
            [
                13668,
                13670
            ],
            [
                13671,
                13697
            ],
            [
                13697,
                13740
            ],
            [
                13746,
                13752
            ],
            [
                13752,
                13805
            ],
            [
                13805,
                13855
            ],
            [
                13856,
                13900
            ],
            [
                13903,
                13919
            ],
            [
                13920,
                13960
            ],
            [
                13963,
                14070
            ],
            [
                14070,
                14082
            ],
            [
                14082,
                14104
            ],
            [
                14105,
                14122
            ],
            [
                14123,
                14139
            ],
            [
                14143,
                14155
            ],
            [
                14160,
                14162
            ],
            [
                14162,
                14194
            ],
            [
                14197,
                14289
            ],
            [
                14289,
                14313
            ],
            [
                14313,
                14317
            ],
            [
                14333,
                14342
            ],
            [
                14352,
                14354
            ],
            [
                14354,
                14462
            ],
            [
                14462,
                14487
            ],
            [
                14488,
                14509
            ],
            [
                14509,
                14546
            ],
            [
                14547,
                14551
            ],
            [
                14552,
                14556
            ],
            [
                14556,
                14597
            ],
            [
                14597,
                14623
            ],
            [
                14623,
                14711
            ],
            [
                14711,
                14778
            ],
            [
                14782,
                14785
            ],
            [
                14788,
                14791
            ],
            [
                14795,
                14801
            ],
            [
                14807,
                14874
            ],
            [
                14874,
                14913
            ],
            [
                14914,
                14938
            ],
            [
                14939,
                14951
            ],
            [
                14952,
                14960
            ],
            [
                14961,
                14973
            ],
            [
                14974,
                14976
            ],
            [
                14984,
                15025
            ],
            [
                15026,
                15029
            ],
            [
                15030,
                15034
            ],
            [
                15034,
                15068
            ],
            [
                15068,
                15098
            ],
            [
                15099,
                15105
            ],
            [
                15107,
                15168
            ],
            [
                15174,
                15186
            ],
            [
                15186,
                15188
            ],
            [
                15188,
                15375
            ],
            [
                15375,
                15376
            ],
            [
                15380,
                15393
            ],
            [
                15394,
                15420
            ],
            [
                15430,
                15447
            ],
            [
                15447,
                15449
            ],
            [
                15449,
                15462
            ],
            [
                15463,
                15467
            ],
            [
                15468,
                15478
            ],
            [
                15478,
                15520
            ],
            [
                15521,
                15540
            ],
            [
                15541,
                15554
            ],
            [
                15555,
                15570
            ],
            [
                15571,
                15577
            ],
            [
                15591,
                15602
            ],
            [
                15603,
                15629
            ],
            [
                15630,
                15639
            ],
            [
                15640,
                15643
            ],
            [
                15644,
                15647
            ],
            [
                15647,
                15649
            ],
            [
                15649,
                15705
            ],
            [
                15713,
                15740
            ],
            [
                15742,
                15906
            ],
            [
                15906,
                15983
            ],
            [
                15989,
                15991
            ],
            [
                15991,
                16052
            ],
            [
                16056,
                16107
            ],
            [
                16108,
                16129
            ],
            [
                16135,
                16141
            ],
            [
                16147,
                16152
            ],
            [
                16153,
                16269
            ],
            [
                16269,
                16277
            ],
            [
                16277,
                16310
            ],
            [
                16322,
                16361
            ],
            [
                16362,
                16368
            ],
            [
                16369,
                16386
            ],
            [
                16408,
                16443
            ],
            [
                16445,
                16495
            ],
            [
                16498,
                16501
            ],
            [
                16502,
                16574
            ],
            [
                16575,
                16610
            ],
            [
                16613,
                16650
            ],
            [
                16651,
                16716
            ],
            [
                16717,
                16731
            ],
            [
                16737,
                16818
            ],
            [
                16819,
                16822
            ],
            [
                16823,
                16851
            ],
            [
                16852,
                16858
            ],
            [
                16859,
                16862
            ],
            [
                16863,
                16869
            ],
            [
                16869,
                16925
            ],
            [
                16925,
                16991
            ],
            [
                16997,
                17010
            ],
            [
                17010,
                17011
            ],
            [
                17012,
                17031
            ],
            [
                17031,
                17060
            ],
            [
                17061,
                17063
            ],
            [
                17064,
                17104
            ],
            [
                17112,
                17118
            ],
            [
                17124,
                17152
            ],
            [
                17152,
                17153
            ],
            [
                17154,
                17188
            ],
            [
                17192,
                17194
            ],
            [
                17195,
                17209
            ],
            [
                17209,
                17291
            ],
            [
                17291,
                17298
            ],
            [
                17299,
                17313
            ],
            [
                17313,
                17337
            ],
            [
                17337,
                17389
            ],
            [
                17392,
                17401
            ],
            [
                17404,
                17426
            ],
            [
                17426,
                17427
            ],
            [
                17428,
                17500
            ],
            [
                17507,
                17548
            ],
            [
                17549,
                17550
            ],
            [
                17551,
                17554
            ],
            [
                17555,
                17559
            ],
            [
                17560,
                17562
            ],
            [
                17575,
                17593
            ],
            [
                17594,
                17755
            ],
            [
                17762,
                17776
            ],
            [
                17776,
                17778
            ],
            [
                17778,
                17820
            ],
            [
                17821,
                17835
            ],
            [
                17835,
                17874
            ],
            [
                17874,
                17976
            ],
            [
                17980,
                18027
            ],
            [
                18028,
                18061
            ],
            [
                18061,
                18111
            ],
            [
                18112,
                18115
            ],
            [
                18123,
                18182
            ],
            [
                18183,
                18236
            ],
            [
                18236,
                18241
            ],
            [
                18256,
                18327
            ],
            [
                18335,
                18342
            ],
            [
                18343,
                18452
            ],
            [
                18458,
                18489
            ],
            [
                18489,
                18524
            ],
            [
                18524,
                18547
            ],
            [
                18548,
                18598
            ],
            [
                18598,
                18610
            ],
            [
                18611,
                18621
            ],
            [
                18622,
                18629
            ],
            [
                18631,
                18643
            ],
            [
                18644,
                18655
            ],
            [
                18655,
                18657
            ],
            [
                18657,
                18679
            ],
            [
                18679,
                18784
            ],
            [
                18790,
                18823
            ],
            [
                18830,
                18832
            ],
            [
                18833,
                18853
            ],
            [
                18854,
                18857
            ],
            [
                18858,
                18985
            ],
            [
                18986,
                19014
            ],
            [
                19014,
                19037
            ],
            [
                19038,
                19040
            ],
            [
                19041,
                19044
            ],
            [
                19045,
                19084
            ],
            [
                19091,
                19097
            ],
            [
                19098,
                19102
            ],
            [
                19108,
                19123
            ],
            [
                19124,
                19140
            ],
            [
                19141,
                19146
            ],
            [
                19150,
                19165
            ],
            [
                19165,
                19195
            ],
            [
                19196,
                19201
            ],
            [
                19202,
                19264
            ],
            [
                19265,
                19281
            ],
            [
                19282,
                19327
            ],
            [
                19327,
                19358
            ],
            [
                19364,
                19370
            ],
            [
                19371,
                19378
            ],
            [
                19380,
                19443
            ],
            [
                19444,
                19500
            ],
            [
                19500,
                19555
            ],
            [
                19560,
                19615
            ],
            [
                19615,
                19705
            ],
            [
                19716,
                19745
            ],
            [
                19745,
                19773
            ],
            [
                19774,
                19846
            ],
            [
                19847,
                19885
            ],
            [
                19885,
                19886
            ],
            [
                19887,
                19909
            ],
            [
                19915,
                19924
            ],
            [
                19924,
                19925
            ],
            [
                19926,
                19935
            ],
            [
                19943,
                19951
            ],
            [
                19952,
                19982
            ],
            [
                19983,
                20009
            ],
            [
                20010,
                20040
            ],
            [
                20041,
                20051
            ],
            [
                20053,
                20084
            ],
            [
                20085,
                20089
            ],
            [
                20089,
                20091
            ],
            [
                20091,
                20123
            ],
            [
                20125,
                20149
            ],
            [
                20159,
                20160
            ],
            [
                20167,
                20176
            ],
            [
                20182,
                20200
            ],
            [
                20201,
                20242
            ],
            [
                20243,
                20298
            ],
            [
                20298,
                20382
            ],
            [
                20383,
                20472
            ],
            [
                20478,
                20484
            ],
            [
                20485,
                20520
            ],
            [
                20520,
                20674
            ],
            [
                20676,
                20688
            ],
            [
                20689,
                20744
            ],
            [
                20747,
                20912
            ],
            [
                20912,
                20920
            ],
            [
                20921,
                20987
            ],
            [
                20987,
                21039
            ],
            [
                21051,
                21058
            ],
            [
                21058,
                21105
            ],
            [
                21105,
                21135
            ],
            [
                21136,
                21140
            ],
            [
                21141,
                21145
            ],
            [
                21146,
                21175
            ],
            [
                21175,
                21177
            ],
            [
                21177,
                21183
            ],
            [
                21184,
                21187
            ],
            [
                21194,
                21198
            ],
            [
                21208,
                21299
            ],
            [
                21300,
                21391
            ],
            [
                21399,
                21451
            ],
            [
                21451,
                21465
            ],
            [
                21471,
                21473
            ],
            [
                21479,
                21482
            ],
            [
                21483,
                21491
            ],
            [
                21492,
                21550
            ],
            [
                21550,
                21582
            ],
            [
                21582,
                21650
            ],
            [
                21652,
                21672
            ],
            [
                21673,
                21676
            ],
            [
                21677,
                21746
            ],
            [
                21747,
                21757
            ],
            [
                21758,
                21771
            ],
            [
                21772,
                21809
            ],
            [
                21809,
                21811
            ],
            [
                21811,
                21840
            ],
            [
                21840,
                21841
            ],
            [
                21842,
                21851
            ],
            [
                21853,
                21864
            ],
            [
                21865,
                21918
            ],
            [
                21918,
                21920
            ],
            [
                21920,
                21923
            ],
            [
                21929,
                21942
            ],
            [
                21947,
                21950
            ],
            [
                21965,
                21969
            ],
            [
                21970,
                21981
            ],
            [
                21990,
                22026
            ],
            [
                22026,
                22094
            ],
            [
                22094,
                22131
            ],
            [
                22131,
                22173
            ],
            [
                22173,
                22209
            ],
            [
                22209,
                22220
            ],
            [
                22221,
                22266
            ],
            [
                22266,
                22298
            ],
            [
                22305,
                22327
            ],
            [
                22327,
                22328
            ],
            [
                22329,
                22332
            ],
            [
                22333,
                22360
            ],
            [
                22361,
                22373
            ],
            [
                22373,
                22374
            ],
            [
                22375,
                22417
            ],
            [
                22418,
                22420
            ],
            [
                22427,
                22428
            ],
            [
                22429,
                22485
            ],
            [
                22486,
                22496
            ],
            [
                22496,
                22509
            ],
            [
                22516,
                22548
            ],
            [
                22549,
                22557
            ],
            [
                22557,
                22639
            ],
            [
                22639,
                22693
            ],
            [
                22693,
                22695
            ],
            [
                22695,
                22812
            ],
            [
                22812,
                22836
            ],
            [
                22837,
                22877
            ],
            [
                22877,
                22896
            ],
            [
                22896,
                22925
            ],
            [
                22926,
                22941
            ],
            [
                22946,
                22947
            ],
            [
                22948,
                22959
            ],
            [
                22960,
                22967
            ],
            [
                22968,
                23006
            ],
            [
                23007,
                23017
            ],
            [
                23017,
                23037
            ],
            [
                23038,
                23054
            ],
            [
                23063,
                23077
            ],
            [
                23078,
                23085
            ],
            [
                23086,
                23089
            ],
            [
                23099,
                23103
            ],
            [
                23104,
                23144
            ],
            [
                23144,
                23166
            ],
            [
                23176,
                23185
            ],
            [
                23194,
                23225
            ],
            [
                23226,
                23245
            ],
            [
                23246,
                23285
            ],
            [
                23285,
                23298
            ],
            [
                23317,
                23335
            ],
            [
                23343,
                23348
            ],
            [
                23361,
                23372
            ],
            [
                23373,
                23412
            ],
            [
                23413,
                23438
            ],
            [
                23440,
                23443
            ],
            [
                23444,
                23446
            ],
            [
                23452,
                23457
            ],
            [
                23458,
                23460
            ],
            [
                23466,
                23470
            ],
            [
                23476,
                23483
            ],
            [
                23484,
                23498
            ],
            [
                23498,
                23560
            ],
            [
                23560,
                23562
            ],
            [
                23562,
                23614
            ],
            [
                23614,
                23616
            ],
            [
                23616,
                23652
            ],
            [
                23652,
                23701
            ],
            [
                23701,
                23736
            ],
            [
                23736,
                23749
            ],
            [
                23766,
                23811
            ],
            [
                23813,
                23851
            ],
            [
                23851,
                23876
            ],
            [
                23876,
                23895
            ],
            [
                23896,
                23904
            ],
            [
                23904,
                23917
            ],
            [
                23917,
                23973
            ],
            [
                23973,
                23975
            ],
            [
                23975,
                23993
            ],
            [
                23994,
                24000
            ],
            [
                24001,
                24008
            ],
            [
                24009,
                24016
            ],
            [
                24017,
                24080
            ],
            [
                24080,
                24082
            ],
            [
                24082,
                24118
            ],
            [
                24119,
                24131
            ],
            [
                24140,
                24186
            ],
            [
                24186,
                24188
            ],
            [
                24188,
                24216
            ],
            [
                24217,
                24220
            ],
            [
                24221,
                24265
            ],
            [
                24265,
                24288
            ],
            [
                24294,
                24332
            ],
            [
                24333,
                24357
            ],
            [
                24360,
                24377
            ],
            [
                24377,
                24422
            ],
            [
                24428,
                24480
            ],
            [
                24481,
                24494
            ],
            [
                24494,
                24497
            ],
            [
                24502,
                24503
            ],
            [
                24522,
                24578
            ],
            [
                24578,
                24616
            ],
            [
                24618,
                24665
            ],
            [
                24666,
                24680
            ],
            [
                24680,
                24794
            ],
            [
                24794,
                24816
            ],
            [
                24832,
                24894
            ],
            [
                24899,
                25004
            ],
            [
                25008,
                25025
            ],
            [
                25025,
                25026
            ],
            [
                25027,
                25058
            ],
            [
                25069,
                25088
            ],
            [
                25090,
                25093
            ],
            [
                25094,
                25106
            ],
            [
                25123,
                25132
            ],
            [
                25137,
                25146
            ],
            [
                25147,
                25151
            ],
            [
                25152,
                25191
            ],
            [
                25191,
                25295
            ],
            [
                25297,
                25371
            ],
            [
                25372,
                25373
            ],
            [
                25374,
                25394
            ],
            [
                25395,
                25404
            ],
            [
                25404,
                25486
            ],
            [
                25487,
                25554
            ],
            [
                25554,
                25590
            ],
            [
                25599,
                25614
            ],
            [
                25614,
                25638
            ],
            [
                25638,
                25639
            ],
            [
                25640,
                25702
            ],
            [
                25704,
                25731
            ],
            [
                25731,
                25796
            ],
            [
                25799,
                25851
            ]
        ],
        "row_chars": [
            [
                0,
                299
            ],
            [
                299,
                548
            ],
            [
                548,
                650
            ],
            [
                650,
                700
            ],
            [
                700,
                904
            ],
            [
                904,
                972
            ],
            [
                972,
                1109
            ],
            [
                1109,
                1317
            ],
            [
                1317,
                1555
            ],
            [
                1555,
                1738
            ],
            [
                1738,
                1738
            ],
            [
                1738,
                1973
            ],
            [
                1973,
                2007
            ],
            [
                2007,
                2212
            ],
            [
                2212,
                2388
            ],
            [
                2388,
                2584
            ],
            [
                2584,
                2644
            ],
            [
                2644,
                2708
            ],
            [
                2708,
                2736
            ],
            [
                2736,
                2806
            ],
            [
                2806,
                2830
            ],
            [
                2830,
                2993
            ],
            [
                2993,
                3125
            ],
            [
                3125,
                3294
            ],
            [
                3294,
                3471
            ],
            [
                3471,
                3540
            ],
            [
                3540,
                3701
            ],
            [
                3701,
                3779
            ],
            [
                3779,
                3848
            ],
            [
                3848,
                4076
            ],
            [
                4076,
                4076
            ],
            [
                4076,
                4169
            ],
            [
                4169,
                4283
            ],
            [
                4283,
                4344
            ],
            [
                4344,
                4380
            ],
            [
                4380,
                4417
            ],
            [
                4417,
                4417
            ],
            [
                4417,
                4582
            ],
            [
                4582,
                4582
            ],
            [
                4582,
                4648
            ],
            [
                4648,
                4743
            ],
            [
                4743,
                4773
            ],
            [
                4773,
                4928
            ],
            [
                4928,
                5102
            ],
            [
                5102,
                5199
            ],
            [
                5199,
                5199
            ],
            [
                5199,
                5199
            ],
            [
                5199,
                5250
            ],
            [
                5250,
                5356
            ],
            [
                5356,
                5419
            ],
            [
                5419,
                5471
            ],
            [
                5471,
                5531
            ],
            [
                5531,
                5576
            ],
            [
                5576,
                5576
            ],
            [
                5576,
                5623
            ],
            [
                5623,
                5733
            ],
            [
                5733,
                5786
            ],
            [
                5786,
                5860
            ],
            [
                5860,
                5868
            ],
            [
                5868,
                5868
            ],
            [
                5868,
                5958
            ],
            [
                5958,
                6003
            ],
            [
                6003,
                6073
            ],
            [
                6073,
                6073
            ],
            [
                6073,
                6073
            ],
            [
                6073,
                6097
            ],
            [
                6097,
                6135
            ],
            [
                6135,
                6135
            ],
            [
                6135,
                6332
            ],
            [
                6332,
                6571
            ],
            [
                6571,
                6695
            ],
            [
                6695,
                6777
            ],
            [
                6777,
                6865
            ],
            [
                6865,
                7311
            ],
            [
                7311,
                7482
            ],
            [
                7482,
                7857
            ],
            [
                7857,
                8055
            ],
            [
                8055,
                8185
            ],
            [
                8185,
                8310
            ],
            [
                8310,
                8477
            ],
            [
                8477,
                8567
            ],
            [
                8567,
                8647
            ],
            [
                8647,
                8758
            ],
            [
                8758,
                9125
            ],
            [
                9125,
                9203
            ],
            [
                9203,
                9331
            ],
            [
                9331,
                9405
            ],
            [
                9405,
                9459
            ],
            [
                9459,
                9467
            ],
            [
                9467,
                9486
            ],
            [
                9486,
                9539
            ],
            [
                9539,
                9572
            ],
            [
                9572,
                9624
            ],
            [
                9624,
                9678
            ],
            [
                9678,
                9738
            ],
            [
                9738,
                9738
            ],
            [
                9738,
                10018
            ],
            [
                10018,
                10018
            ],
            [
                10018,
                10018
            ],
            [
                10018,
                10018
            ],
            [
                10018,
                10117
            ],
            [
                10117,
                10117
            ],
            [
                10117,
                10190
            ],
            [
                10190,
                10212
            ],
            [
                10212,
                10240
            ],
            [
                10240,
                10312
            ],
            [
                10312,
                10403
            ],
            [
                10403,
                10441
            ],
            [
                10441,
                10564
            ],
            [
                10564,
                10722
            ],
            [
                10722,
                10835
            ],
            [
                10835,
                10876
            ],
            [
                10876,
                10891
            ],
            [
                10891,
                11166
            ],
            [
                11166,
                11254
            ],
            [
                11254,
                11367
            ],
            [
                11367,
                11420
            ],
            [
                11420,
                11557
            ],
            [
                11557,
                11557
            ],
            [
                11557,
                11557
            ],
            [
                11557,
                11668
            ],
            [
                11668,
                11668
            ],
            [
                11668,
                11892
            ],
            [
                11892,
                11991
            ],
            [
                11991,
                12096
            ],
            [
                12096,
                12331
            ],
            [
                12331,
                12412
            ],
            [
                12412,
                12544
            ],
            [
                12544,
                12544
            ],
            [
                12544,
                12569
            ],
            [
                12569,
                12632
            ],
            [
                12632,
                12681
            ],
            [
                12681,
                12693
            ],
            [
                12693,
                12801
            ],
            [
                12801,
                12833
            ],
            [
                12833,
                12833
            ],
            [
                12833,
                12902
            ],
            [
                12902,
                12929
            ],
            [
                12929,
                12973
            ],
            [
                12973,
                13088
            ],
            [
                13088,
                13111
            ],
            [
                13111,
                13147
            ],
            [
                13147,
                13167
            ],
            [
                13167,
                13272
            ],
            [
                13272,
                13293
            ],
            [
                13293,
                13329
            ],
            [
                13329,
                13374
            ],
            [
                13374,
                13467
            ],
            [
                13467,
                13528
            ],
            [
                13528,
                13593
            ],
            [
                13593,
                13670
            ],
            [
                13670,
                13697
            ],
            [
                13697,
                13752
            ],
            [
                13752,
                13805
            ],
            [
                13805,
                14070
            ],
            [
                14070,
                14082
            ],
            [
                14082,
                14162
            ],
            [
                14162,
                14289
            ],
            [
                14289,
                14289
            ],
            [
                14289,
                14313
            ],
            [
                14313,
                14354
            ],
            [
                14354,
                14462
            ],
            [
                14462,
                14556
            ],
            [
                14556,
                14597
            ],
            [
                14597,
                14623
            ],
            [
                14623,
                14623
            ],
            [
                14623,
                14711
            ],
            [
                14711,
                14874
            ],
            [
                14874,
                15188
            ],
            [
                15188,
                15449
            ],
            [
                15449,
                15649
            ],
            [
                15649,
                15906
            ],
            [
                15906,
                15991
            ],
            [
                15991,
                16141
            ],
            [
                16141,
                16269
            ],
            [
                16269,
                16277
            ],
            [
                16277,
                16369
            ],
            [
                16369,
                16495
            ],
            [
                16495,
                16717
            ],
            [
                16717,
                16869
            ],
            [
                16869,
                17209
            ],
            [
                17209,
                17291
            ],
            [
                17291,
                17313
            ],
            [
                17313,
                17337
            ],
            [
                17337,
                17428
            ],
            [
                17428,
                17778
            ],
            [
                17778,
                17835
            ],
            [
                17835,
                17874
            ],
            [
                17874,
                18061
            ],
            [
                18061,
                18343
            ],
            [
                18343,
                18489
            ],
            [
                18489,
                18598
            ],
            [
                18598,
                18657
            ],
            [
                18657,
                19014
            ],
            [
                19014,
                19165
            ],
            [
                19165,
                19265
            ],
            [
                19265,
                19500
            ],
            [
                19500,
                19615
            ],
            [
                19615,
                19745
            ],
            [
                19745,
                19887
            ],
            [
                19887,
                20091
            ],
            [
                20091,
                20125
            ],
            [
                20125,
                20201
            ],
            [
                20201,
                20298
            ],
            [
                20298,
                20520
            ],
            [
                20520,
                20912
            ],
            [
                20912,
                20987
            ],
            [
                20987,
                21058
            ],
            [
                21058,
                21105
            ],
            [
                21105,
                21177
            ],
            [
                21177,
                21300
            ],
            [
                21300,
                21550
            ],
            [
                21550,
                21811
            ],
            [
                21811,
                21920
            ],
            [
                21920,
                22026
            ],
            [
                22026,
                22094
            ],
            [
                22094,
                22131
            ],
            [
                22131,
                22173
            ],
            [
                22173,
                22209
            ],
            [
                22209,
                22266
            ],
            [
                22266,
                22375
            ],
            [
                22375,
                22496
            ],
            [
                22496,
                22557
            ],
            [
                22557,
                22639
            ],
            [
                22639,
                22695
            ],
            [
                22695,
                22695
            ],
            [
                22695,
                22812
            ],
            [
                22812,
                22877
            ],
            [
                22877,
                22896
            ],
            [
                22896,
                22941
            ],
            [
                22941,
                23017
            ],
            [
                23017,
                23144
            ],
            [
                23144,
                23285
            ],
            [
                23285,
                23498
            ],
            [
                23498,
                23562
            ],
            [
                23562,
                23616
            ],
            [
                23616,
                23701
            ],
            [
                23701,
                23736
            ],
            [
                23736,
                23851
            ],
            [
                23851,
                23876
            ],
            [
                23876,
                23975
            ],
            [
                23975,
                24082
            ],
            [
                24082,
                24119
            ],
            [
                24119,
                24119
            ],
            [
                24119,
                24188
            ],
            [
                24188,
                24377
            ],
            [
                24377,
                24494
            ],
            [
                24494,
                24578
            ],
            [
                24578,
                24794
            ],
            [
                24794,
                25005
            ],
            [
                25005,
                25005
            ],
            [
                25005,
                25191
            ],
            [
                25191,
                25404
            ],
            [
                25404,
                25554
            ],
            [
                25554,
                25640
            ],
            [
                25640,
                25731
            ],
            [
                25731,
                25851
            ]
        ]
    }
}