{
    "original": {
        "text": "The news of the great fights of Quatre Bras and Waterloo reached England at the same time. The Gazette first published the result of the two battles; at which glorious intelligence all England thrilled with triumph and fear. Particulars then followed; and after the announcement of the victories came the list of the wounded and the slain. Who can tell the dread with which that catalogue was opened and read! Fancy, at every village and homestead almost through the three kingdoms, the great news coming of the battles in Flanders, and the feelings of exultation and gratitude, bereavement and sickening dismay, when the lists of the regimental losses were gone through, and it became known whether the dear friend and relative had escaped or fallen. Anybody who will take the trouble of looking back to a file of the newspapers of the time, must, even now, feel at second-hand this breathless pause of expectation. The lists of casualties are carried on from day to day: you stop in the midst as in a story which is to be continued in our next. Think what the feelings must have been as those papers followed each other fresh from the press; and if such an interest could be felt in our country, and about a battle where but twenty thousand of our people were engaged, think of the condition of Europe for twenty years before, where people were fighting, not by thousands, but by millions; each one of whom as he struck his enemy wounded horribly some other innocent heart far away.\nThe news which that famous Gazette brought to the Osbornes gave a dreadful shock to the family and its chief. The girls indulged unrestrained in their grief. The gloom-stricken old father was still more borne down by his fate and sorrow. He strove to think that a judgment was on the boy for his disobedience. He dared not own that the severity of the sentence frightened him, and that its fulfilment had come too soon upon his curses. Sometimes a shuddering terror struck him, as if he had been the author of the doom which he had called down on his son. There was a chance before of reconciliation. The boy's wife might have died; or he might have come back and said, Father I have sinned. But there was no hope now. He stood on the other side of the gulf impassable, haunting his parent with sad eyes. He remembered them once before so in a fever, when every one thought the lad was dying, and he lay on his bed speechless, and gazing with a dreadful gloom. Good God! how the father clung to the doctor then, and with what a sickening anxiety he followed him: what a weight of grief was off his mind when, after the crisis of the fever, the lad recovered, and looked at his father once more with eyes that recognised him. But now there was no help or cure, or chance of reconcilement: above all, there were no humble words to soothe vanity outraged and furious, or bring to its natural flow the poisoned, angry blood. And it is hard to say which pang it was that tore the proud father's heart most keenly--that his son should have gone out of the reach of his forgiveness, or that the apology which his own pride expected should have escaped him.\nWhatever his sensations might have been, however, the stern old man would have no confidant. He never mentioned his son's name to his daughters; but ordered the elder to place all the females of the establishment in mourning; and desired that the male servants should be similarly attired in deep black. All parties and entertainments, of course, were to be put off. No communications were made to his future son-in-law, whose marriage-day had been fixed: but there was enough in Mr. Osborne's appearance to prevent Mr. Bullock from making any inquiries, or in any way pressing forward that ceremony. He and the ladies whispered about it under their voices in the drawing-room sometimes, whither the father never came. He remained constantly in his own study; the whole front part of the house being closed until some time after the completion of the general mourning.\nAbout three weeks after the 18th of June, Mr. Osborne's acquaintance, Sir William Dobbin, called at Mr. Osborne's house in Russell Square, with a very pale and agitated face, and insisted upon seeing that gentleman. Ushered into his room, and after a few words, which neither the speaker nor the host understood, the former produced from an inclosure a letter sealed with a large red seal. \"My son, Major Dobbin,\" the Alderman said, with some hesitation, \"despatched me a letter by an officer of the --th, who arrived in town to-day. My son's letter contains one for you, Osborne.\" The Alderman placed the letter on the table, and Osborne stared at him for a moment or two in silence. His looks frightened the ambassador, who after looking guiltily for a little time at the grief-stricken man, hurried away without another word.\nThe letter was in George's well-known bold handwriting. It was that one which he had written before daybreak on the 16th of June, and just before he took leave of Amelia. The great red seal was emblazoned with the sham coat of arms which Osborne had assumed from the Peerage, with \"Pax in bello\" for a motto; that of the ducal house with which the vain old man tried to fancy himself connected. The hand that signed it would never hold pen or sword more. The very seal that sealed it had been robbed from George's dead body as it lay on the field of battle. The father knew nothing of this, but sat and looked at the letter in terrified vacancy. He almost fell when he went to open it.\nHave you ever had a difference with a dear friend? How his letters, written in the period of love and confidence, sicken and rebuke you! What a dreary mourning it is to dwell upon those vehement protests of dead affection! What lying epitaphs they make over the corpse of love! What dark, cruel comments upon Life and Vanities! Most of us have got or written drawers full of them. They are closet-skeletons which we keep and shun. Osborne trembled long before the letter from his dead son.\nThe poor boy's letter did not say much. He had been too proud to acknowledge the tenderness which his heart felt. He only said, that on the eve of a great battle, he wished to bid his father farewell, and solemnly to implore his good offices for the wife--it might be for the child--whom he left behind him. He owned with contrition that his irregularities and his extravagance had already wasted a large part of his mother's little fortune. He thanked his father for his former generous conduct; and he promised him that if he fell on the field or survived it, he would act in a manner worthy of the name of George Osborne.\nHis English habit, pride, awkwardness perhaps, had prevented him from saying more. His father could not see the kiss George had placed on the superscription of his letter. Mr. Osborne dropped it with the bitterest, deadliest pang of balked affection and revenge. His son was still beloved and unforgiven.\nAbout two months afterwards, however, as the young ladies of the family went to church with their father, they remarked how he took a different seat from that which he usually occupied when he chose to attend divine worship; and that from his cushion opposite, he looked up at the wall over their heads. This caused the young women likewise to gaze in the direction towards which their father's gloomy eyes pointed: and they saw an elaborate monument upon the wall, where Britannia was represented weeping over an urn, and a broken sword and a couchant lion indicated that the piece of sculpture had been erected in honour of a deceased warrior. The sculptors of those days had stocks of such funereal emblems in hand; as you may see still on the walls of St. Paul's, which are covered with hundreds of these braggart heathen allegories. There was a constant demand for them during the first fifteen years of the present century.\nUnder the memorial in question were emblazoned the well-known and pompous Osborne arms; and the inscription said, that the monument was \"Sacred to the memory of George Osborne, Junior, Esq., late a Captain in his Majesty's --th regiment of foot, who fell on the 18th of June, 1815, aged 28 years, while fighting for his king and country in the glorious victory of Waterloo. Dulce et decorum est pro patria mori.\"\nThe sight of that stone agitated the nerves of the sisters so much, that Miss Maria was compelled to leave the church. The congregation made way respectfully for those sobbing girls clothed in deep black, and pitied the stern old father seated opposite the memorial of the dead soldier. \"Will he forgive Mrs. George?\" the girls said to themselves as soon as their ebullition of grief was over. Much conversation passed too among the acquaintances of the Osborne family, who knew of the rupture between the son and father caused by the former's marriage, as to the chance of a reconciliation with the young widow. There were bets among the gentlemen both about Russell Square and in the City.\nIf the sisters had any anxiety regarding the possible recognition of Amelia as a daughter of the family, it was increased presently, and towards the end of the autumn, by their father's announcement that he was going abroad. He did not say whither, but they knew at once that his steps would be turned towards Belgium, and were aware that George's widow was still in Brussels. They had pretty accurate news indeed of poor Amelia from Lady Dobbin and her daughters. Our honest Captain had been promoted in consequence of the death of the second Major of the regiment on the field; and the brave O'Dowd, who had distinguished himself greatly here as upon all occasions where he had a chance to show his coolness and valour, was a Colonel and Companion of the Bath.\nVery many of the brave --th, who had suffered severely upon both days of action, were still at Brussels in the autumn, recovering of their wounds. The city was a vast military hospital for months after the great battles; and as men and officers began to rally from their hurts, the gardens and places of public resort swarmed with maimed warriors, old and young, who, just rescued out of death, fell to gambling, and gaiety, and love-making, as people of Vanity Fair will do. Mr. Osborne found out some of the --th easily. He knew their uniform quite well, and had been used to follow all the promotions and exchanges in the regiment, and loved to talk about it and its officers as if he had been one of the number. On the day after his arrival at Brussels, and as he issued from his hotel, which faced the park, he saw a soldier in the well-known facings, reposing on a stone bench in the garden, and went and sate down trembling by the wounded convalescent man.\n\"Were you in Captain Osborne's company?\" he said, and added, after a pause, \"he was my son, sir.\"\nThe man was not of the Captain's company, but he lifted up his unwounded arm and touched his cap sadly and respectfully to the haggard broken-spirited gentleman who questioned him. \"The whole army didn't contain a finer or a better officer,\" the soldier said. \"The Sergeant of the Captain's company (Captain Raymond had it now), was in town, though, and was just well of a shot in the shoulder. His honour might see him if he liked, who could tell him anything he wanted to know about--about the --th's actions. But his honour had seen Major Dobbin, no doubt, the brave Captain's great friend; and Mrs. Osborne, who was here too, and had been very bad, he heard everybody say. They say she was out of her mind like for six weeks or more. But your honour knows all about that--and asking your pardon\"--the man added.\nOsborne put a guinea into the soldier's hand, and told him he should have another if he would bring the Sergeant to the Hotel du Parc; a promise which very soon brought the desired officer to Mr. Osborne's presence. And the first soldier went away; and after telling a comrade or two how Captain Osborne's father was arrived, and what a free-handed generous gentleman he was, they went and made good cheer with drink and feasting, as long as the guineas lasted which had come from the proud purse of the mourning old father.\nIn the Sergeant's company, who was also just convalescent, Osborne made the journey of Waterloo and Quatre Bras, a journey which thousands of his countrymen were then taking. He took the Sergeant with him in his carriage, and went through both fields under his guidance. He saw the point of the road where the regiment marched into action on the 16th, and the slope down which they drove the French cavalry who were pressing on the retreating Belgians. There was the spot where the noble Captain cut down the French officer who was grappling with the young Ensign for the colours, the Colour-Sergeants having been shot down. Along this road they retreated on the next day, and here was the bank at which the regiment bivouacked under the rain of the night of the seventeenth. Further on was the position which they took and held during the day, forming time after time to receive the charge of the enemy's horsemen and lying down under the shelter of the bank from the furious French cannonade. And it was at this declivity when at evening the whole English line received the order to advance, as the enemy fell back after his last charge, that the Captain, hurraying and rushing down the hill waving his sword, received a shot and fell dead. \"It was Major Dobbin who took back the Captain's body to Brussels,\" the Sergeant said, in a low voice, \"and had him buried, as your honour knows.\" The peasants and relic-hunters about the place were screaming round the pair, as the soldier told his story, offering for sale all sorts of mementoes of the fight, crosses, and epaulets, and shattered cuirasses, and eagles.\nOsborne gave a sumptuous reward to the Sergeant when he parted with him, after having visited the scenes of his son's last exploits. His burial-place he had already seen. Indeed, he had driven thither immediately after his arrival at Brussels. George's body lay in the pretty burial-ground of Laeken, near the city; in which place, having once visited it on a party of pleasure, he had lightly expressed a wish to have his grave made. And there the young officer was laid by his friend, in the unconsecrated corner of the garden, separated by a little hedge from the temples and towers and plantations of flowers and shrubs, under which the Roman Catholic dead repose. It seemed a humiliation to old Osborne to think that his son, an English gentleman, a captain in the famous British army, should not be found worthy to lie in ground where mere foreigners were buried. Which of us is there can tell how much vanity lurks in our warmest regard for others, and how selfish our love is? Old Osborne did not speculate much upon the mingled nature of his feelings, and how his instinct and selfishness were combating together. He firmly believed that everything he did was right, that he ought on all occasions to have his own way--and like the sting of a wasp or serpent his hatred rushed out armed and poisonous against anything like opposition. He was proud of his hatred as of everything else. Always to be right, always to trample forward, and never to doubt, are not these the great qualities with which dullness takes the lead in the world?\nAs after the drive to Waterloo, Mr. Osborne's carriage was nearing the gates of the city at sunset, they met another open barouche, in which were a couple of ladies and a gentleman, and by the side of which an officer was riding. Osborne gave a start back, and the Sergeant, seated with him, cast a look of surprise at his neighbour, as he touched his cap to the officer, who mechanically returned his salute. It was Amelia, with the lame young Ensign by her side, and opposite to her her faithful friend Mrs. O'Dowd. It was Amelia, but how changed from the fresh and comely girl Osborne knew. Her face was white and thin. Her pretty brown hair was parted under a widow's cap--the poor child. Her eyes were fixed, and looking nowhere. They stared blank in the face of Osborne, as the carriages crossed each other, but she did not know him; nor did he recognise her, until looking up, he saw Dobbin riding by her: and then he knew who it was. He hated her. He did not know how much until he saw her there. When her carriage had passed on, he turned and stared at the Sergeant, with a curse and defiance in his eye cast at his companion, who could not help looking at him--as much as to say \"How dare you look at me? Damn you! I do hate her. It is she who has tumbled my hopes and all my pride down.\" \"Tell the scoundrel to drive on quick,\" he shouted with an oath, to the lackey on the box. A minute afterwards, a horse came clattering over the pavement behind Osborne's carriage, and Dobbin rode up. His thoughts had been elsewhere as the carriages passed each other, and it was not until he had ridden some paces forward, that he remembered it was Osborne who had just passed him. Then he turned to examine if the sight of her father-in-law had made any impression on Amelia, but the poor girl did not know who had passed. Then William, who daily used to accompany her in his drives, taking out his watch, made some excuse about an engagement which he suddenly recollected, and so rode off. She did not remark that either: but sate looking before her, over the homely landscape towards the woods in the distance, by which George marched away.\n\"Mr. Osborne, Mr. Osborne!\" cried Dobbin, as he rode up and held out his hand. Osborne made no motion to take it, but shouted out once more and with another curse to his servant to drive on.\nDobbin laid his hand on the carriage side. \"I will see you, sir,\" he said. \"I have a message for you.\"\n\"From that woman?\" said Osborne, fiercely.\n\"No,\" replied the other, \"from your son\"; at which Osborne fell back into the corner of his carriage, and Dobbin allowing it to pass on, rode close behind it, and so through the town until they reached Mr. Osborne's hotel, and without a word. There he followed Osborne up to his apartments. George had often been in the rooms; they were the lodgings which the Crawleys had occupied during their stay in Brussels.\n\"Pray, have you any commands for me, Captain Dobbin, or, I beg your pardon, I should say MAJOR Dobbin, since better men than you are dead, and you step into their SHOES?\" said Mr. Osborne, in that sarcastic tone which he sometimes was pleased to assume.\n\"Better men ARE dead,\" Dobbin replied. \"I want to speak to you about one.\"\n\"Make it short, sir,\" said the other with an oath, scowling at his visitor.\n\"I am here as his closest friend,\" the Major resumed, \"and the executor of his will. He made it before he went into action. Are you aware how small his means are, and of the straitened circumstances of his widow?\"\n\"I don't know his widow, sir,\" Osborne said. \"Let her go back to her father.\" But the gentleman whom he addressed was determined to remain in good temper, and went on without heeding the interruption.\n\"Do you know, sir, Mrs. Osborne's condition? Her life and her reason almost have been shaken by the blow which has fallen on her. It is very doubtful whether she will rally. There is a chance left for her, however, and it is about this I came to speak to you. She will be a mother soon. Will you visit the parent's offence upon the child's head? or will you forgive the child for poor George's sake?\"\nOsborne broke out into a rhapsody of self-praise and imprecations;--by the first, excusing himself to his own conscience for his conduct; by the second, exaggerating the undutifulness of George. No father in all England could have behaved more generously to a son, who had rebelled against him wickedly. He had died without even so much as confessing he was wrong. Let him take the consequences of his undutifulness and folly. As for himself, Mr. Osborne, he was a man of his word. He had sworn never to speak to that woman, or to recognize her as his son's wife. \"And that's what you may tell her,\" he concluded with an oath; \"and that's what I will stick to to the last day of my life.\"\nThere was no hope from that quarter then. The widow must live on her slender pittance, or on such aid as Jos could give her. \"I might tell her, and she would not heed it,\" thought Dobbin, sadly: for the poor girl's thoughts were not here at all since her catastrophe, and, stupefied under the pressure of her sorrow, good and evil were alike indifferent to her.\nSo, indeed, were even friendship and kindness. She received them both uncomplainingly, and having accepted them, relapsed into her grief.\nSuppose some twelve months after the above conversation took place to have passed in the life of our poor Amelia. She has spent the first portion of that time in a sorrow so profound and pitiable, that we who have been watching and describing some of the emotions of that weak and tender heart, must draw back in the presence of the cruel grief under which it is bleeding. Tread silently round the hapless couch of the poor prostrate soul. Shut gently the door of the dark chamber wherein she suffers, as those kind people did who nursed her through the first months of her pain, and never left her until heaven had sent her consolation. A day came--of almost terrified delight and wonder--when the poor widowed girl pressed a child upon her breast--a child, with the eyes of George who was gone--a little boy, as beautiful as a cherub. What a miracle it was to hear its first cry! How she laughed and wept over it--how love, and hope, and prayer woke again in her bosom as the baby nestled there. She was safe. The doctors who attended her, and had feared for her life or for her brain, had waited anxiously for this crisis before they could pronounce that either was secure. It was worth the long months of doubt and dread which the persons who had constantly been with her had passed, to see her eyes once more beaming tenderly upon them.\nOur friend Dobbin was one of them. It was he who brought her back to England and to her mother's house; when Mrs. O'Dowd, receiving a peremptory summons from her Colonel, had been forced to quit her patient. To see Dobbin holding the infant, and to hear Amelia's laugh of triumph as she watched him, would have done any man good who had a sense of humour. William was the godfather of the child, and exerted his ingenuity in the purchase of cups, spoons, pap-boats, and corals for this little Christian.\nHow his mother nursed him, and dressed him, and lived upon him; how she drove away all nurses, and would scarce allow any hand but her own to touch him; how she considered that the greatest favour she could confer upon his godfather, Major Dobbin, was to allow the Major occasionally to dandle him, need not be told here. This child was her being. Her existence was a maternal caress. She enveloped the feeble and unconscious creature with love and worship. It was her life which the baby drank in from her bosom. Of nights, and when alone, she had stealthy and intense raptures of motherly love, such as God's marvellous care has awarded to the female instinct--joys how far higher and lower than reason--blind beautiful devotions which only women's hearts know. It was William Dobbin's task to muse upon these movements of Amelia's, and to watch her heart; and if his love made him divine almost all the feelings which agitated it, alas! he could see with a fatal perspicuity that there was no place there for him. And so, gently, he bore his fate, knowing it, and content to bear it.\nI suppose Amelia's father and mother saw through the intentions of the Major, and were not ill-disposed to encourage him; for Dobbin visited their house daily, and stayed for hours with them, or with Amelia, or with the honest landlord, Mr. Clapp, and his family. He brought, on one pretext or another, presents to everybody, and almost every day; and went, with the landlord's little girl, who was rather a favourite with Amelia, by the name of Major Sugarplums. It was this little child who commonly acted as mistress of the ceremonies to introduce him to Mrs. Osborne. She laughed one day when Major Sugarplums' cab drove up to Fulham, and he descended from it, bringing out a wooden horse, a drum, a trumpet, and other warlike toys, for little Georgy, who was scarcely six months old, and for whom the articles in question were entirely premature.\nThe child was asleep. \"Hush,\" said Amelia, annoyed, perhaps, at the creaking of the Major's boots; and she held out her hand; smiling because William could not take it until he had rid himself of his cargo of toys. \"Go downstairs, little Mary,\" said he presently to the child, \"I want to speak to Mrs. Osborne.\" She looked up rather astonished, and laid down the infant on its bed.\n\"I am come to say good-bye, Amelia,\" said he, taking her slender little white hand gently.\n\"Good-bye? and where are you going?\" she said, with a smile.\n\"Send the letters to the agents,\" he said; \"they will forward them; for you will write to me, won't you? I shall be away a long time.\"\n\"I'll write to you about Georgy,\" she said. \"Dear William, how good you have been to him and to me. Look at him. Isn't he like an angel?\"\nThe little pink hands of the child closed mechanically round the honest soldier's finger, and Amelia looked up in his face with bright maternal pleasure. The cruellest looks could not have wounded him more than that glance of hopeless kindness. He bent over the child and mother. He could not speak for a moment. And it was only with all his strength that he could force himself to say a God bless you. \"God bless you,\" said Amelia, and held up her face and kissed him.\n\"Hush! Don't wake Georgy!\" she added, as William Dobbin went to the door with heavy steps. She did not hear the noise of his cab-wheels as he drove away: she was looking at the child, who was laughing in his sleep.",
        "paragraph_chars": [
            [
                0,
                1485
            ],
            [
                1485,
                3135
            ],
            [
                3135,
                4004
            ],
            [
                4004,
                4833
            ],
            [
                4833,
                5519
            ],
            [
                5519,
                6009
            ],
            [
                6009,
                6634
            ],
            [
                6634,
                6939
            ],
            [
                6939,
                7869
            ],
            [
                7869,
                8282
            ],
            [
                8282,
                8974
            ],
            [
                8974,
                9737
            ],
            [
                9737,
                10701
            ],
            [
                10701,
                10799
            ],
            [
                10799,
                11615
            ],
            [
                11615,
                12140
            ],
            [
                12140,
                13754
            ],
            [
                13754,
                15298
            ],
            [
                15298,
                17442
            ],
            [
                17442,
                17633
            ],
            [
                17633,
                17736
            ],
            [
                17736,
                17779
            ],
            [
                17779,
                18192
            ],
            [
                18192,
                18446
            ],
            [
                18446,
                18521
            ],
            [
                18521,
                18597
            ],
            [
                18597,
                18811
            ],
            [
                18811,
                19012
            ],
            [
                19012,
                19413
            ],
            [
                19413,
                20102
            ],
            [
                20102,
                20464
            ],
            [
                20464,
                20602
            ],
            [
                20602,
                21944
            ],
            [
                21944,
                22448
            ],
            [
                22448,
                23535
            ],
            [
                23535,
                24387
            ],
            [
                24387,
                24769
            ],
            [
                24769,
                24860
            ],
            [
                24860,
                24921
            ],
            [
                24921,
                25056
            ],
            [
                25056,
                25194
            ],
            [
                25194,
                25664
            ],
            [
                25664,
                25878
            ]
        ],
        "segment_chars": [
            [
                0,
                91
            ],
            [
                91,
                225
            ],
            [
                225,
                340
            ],
            [
                340,
                410
            ],
            [
                410,
                752
            ],
            [
                752,
                917
            ],
            [
                917,
                1047
            ],
            [
                1047,
                1485
            ],
            [
                1485,
                1595
            ],
            [
                1595,
                1643
            ],
            [
                1643,
                1723
            ],
            [
                1723,
                1795
            ],
            [
                1795,
                1921
            ],
            [
                1921,
                2041
            ],
            [
                2041,
                2086
            ],
            [
                2086,
                2177
            ],
            [
                2177,
                2204
            ],
            [
                2204,
                2290
            ],
            [
                2290,
                2446
            ],
            [
                2446,
                2456
            ],
            [
                2456,
                2710
            ],
            [
                2710,
                2906
            ],
            [
                2906,
                3135
            ],
            [
                3135,
                3228
            ],
            [
                3228,
                3439
            ],
            [
                3439,
                3502
            ],
            [
                3502,
                3736
            ],
            [
                3736,
                3854
            ],
            [
                3854,
                4004
            ],
            [
                4004,
                4220
            ],
            [
                4220,
                4394
            ],
            [
                4394,
                4538
            ],
            [
                4538,
                4586
            ],
            [
                4586,
                4689
            ],
            [
                4689,
                4833
            ],
            [
                4833,
                4889
            ],
            [
                4889,
                5004
            ],
            [
                5004,
                5228
            ],
            [
                5228,
                5288
            ],
            [
                5288,
                5391
            ],
            [
                5391,
                5479
            ],
            [
                5479,
                5519
            ],
            [
                5519,
                5570
            ],
            [
                5570,
                5656
            ],
            [
                5656,
                5742
            ],
            [
                5742,
                5797
            ],
            [
                5797,
                5847
            ],
            [
                5847,
                5900
            ],
            [
                5900,
                5950
            ],
            [
                5950,
                6009
            ],
            [
                6009,
                6049
            ],
            [
                6049,
                6123
            ],
            [
                6123,
                6317
            ],
            [
                6317,
                6451
            ],
            [
                6451,
                6634
            ],
            [
                6634,
                6717
            ],
            [
                6717,
                6806
            ],
            [
                6806,
                6897
            ],
            [
                6897,
                6939
            ],
            [
                6939,
                7243
            ],
            [
                7243,
                7585
            ],
            [
                7585,
                7777
            ],
            [
                7777,
                7869
            ],
            [
                7869,
                8243
            ],
            [
                8243,
                8282
            ],
            [
                8282,
                8401
            ],
            [
                8401,
                8569
            ],
            [
                8569,
                8600
            ],
            [
                8600,
                8676
            ],
            [
                8676,
                8895
            ],
            [
                8895,
                8974
            ],
            [
                8974,
                9199
            ],
            [
                9199,
                9351
            ],
            [
                9351,
                9439
            ],
            [
                9439,
                9737
            ],
            [
                9737,
                9884
            ],
            [
                9884,
                10213
            ],
            [
                10213,
                10260
            ],
            [
                10260,
                10453
            ],
            [
                10453,
                10701
            ],
            [
                10701,
                10742
            ],
            [
                10742,
                10799
            ],
            [
                10799,
                10980
            ],
            [
                10980,
                11059
            ],
            [
                11059,
                11194
            ],
            [
                11194,
                11311
            ],
            [
                11311,
                11476
            ],
            [
                11476,
                11537
            ],
            [
                11537,
                11615
            ],
            [
                11615,
                11831
            ],
            [
                11831,
                12140
            ],
            [
                12140,
                12315
            ],
            [
                12315,
                12411
            ],
            [
                12411,
                12593
            ],
            [
                12593,
                12765
            ],
            [
                12765,
                12916
            ],
            [
                12916,
                13135
            ],
            [
                13135,
                13383
            ],
            [
                13383,
                13530
            ],
            [
                13530,
                13754
            ],
            [
                13754,
                13887
            ],
            [
                13887,
                13925
            ],
            [
                13925,
                13998
            ],
            [
                13998,
                14189
            ],
            [
                14189,
                14423
            ],
            [
                14423,
                14624
            ],
            [
                14624,
                14739
            ],
            [
                14739,
                14877
            ],
            [
                14877,
                15098
            ],
            [
                15098,
                15148
            ],
            [
                15148,
                15298
            ],
            [
                15298,
                15528
            ],
            [
                15528,
                15708
            ],
            [
                15708,
                15816
            ],
            [
                15816,
                15892
            ],
            [
                15892,
                15921
            ],
            [
                15921,
                15991
            ],
            [
                15991,
                16033
            ],
            [
                16033,
                16240
            ],
            [
                16240,
                16254
            ],
            [
                16254,
                16303
            ],
            [
                16303,
                16513
            ],
            [
                16513,
                16523
            ],
            [
                16523,
                16538
            ],
            [
                16538,
                16597
            ],
            [
                16597,
                16688
            ],
            [
                16688,
                16798
            ],
            [
                16798,
                16980
            ],
            [
                16980,
                17122
            ],
            [
                17122,
                17290
            ],
            [
                17290,
                17442
            ],
            [
                17442,
                17470
            ],
            [
                17470,
                17521
            ],
            [
                17521,
                17633
            ],
            [
                17633,
                17676
            ],
            [
                17676,
                17708
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17755
            ],
            [
                17755,
                17779
            ],
            [
                17779,
                18022
            ],
            [
                18022,
                18070
            ],
            [
                18070,
                18192
            ],
            [
                18192,
                18363
            ],
            [
                18363,
                18446
            ],
            [
                18446,
                18485
            ],
            [
                18485,
                18521
            ],
            [
                18521,
                18597
            ],
            [
                18597,
                18682
            ],
            [
                18682,
                18721
            ],
            [
                18721,
                18811
            ],
            [
                18811,
                18856
            ],
            [
                18856,
                18889
            ],
            [
                18889,
                19012
            ],
            [
                19012,
                19057
            ],
            [
                19057,
                19142
            ],
            [
                19142,
                19186
            ],
            [
                19186,
                19272
            ],
            [
                19272,
                19299
            ],
            [
                19299,
                19358
            ],
            [
                19358,
                19413
            ],
            [
                19413,
                19608
            ],
            [
                19608,
                19717
            ],
            [
                19717,
                19778
            ],
            [
                19778,
                19840
            ],
            [
                19840,
                19895
            ],
            [
                19895,
                19977
            ],
            [
                19977,
                20102
            ],
            [
                20102,
                20144
            ],
            [
                20144,
                20227
            ],
            [
                20227,
                20464
            ],
            [
                20464,
                20511
            ],
            [
                20511,
                20602
            ],
            [
                20602,
                20716
            ],
            [
                20716,
                20975
            ],
            [
                20975,
                21042
            ],
            [
                21042,
                21240
            ],
            [
                21240,
                21439
            ],
            [
                21439,
                21484
            ],
            [
                21484,
                21600
            ],
            [
                21600,
                21614
            ],
            [
                21614,
                21779
            ],
            [
                21779,
                21944
            ],
            [
                21944,
                21979
            ],
            [
                21979,
                22152
            ],
            [
                22152,
                22300
            ],
            [
                22300,
                22448
            ],
            [
                22448,
                22770
            ],
            [
                22770,
                22796
            ],
            [
                22796,
                22833
            ],
            [
                22833,
                22906
            ],
            [
                22906,
                22962
            ],
            [
                22962,
                23212
            ],
            [
                23212,
                23388
            ],
            [
                23388,
                23465
            ],
            [
                23465,
                23535
            ],
            [
                23535,
                23799
            ],
            [
                23799,
                23999
            ],
            [
                23999,
                24107
            ],
            [
                24107,
                24387
            ],
            [
                24387,
                24409
            ],
            [
                24409,
                24602
            ],
            [
                24602,
                24699
            ],
            [
                24699,
                24769
            ],
            [
                24769,
                24860
            ],
            [
                24860,
                24871
            ],
            [
                24871,
                24897
            ],
            [
                24897,
                24921
            ],
            [
                24921,
                25026
            ],
            [
                25026,
                25056
            ],
            [
                25056,
                25100
            ],
            [
                25100,
                25156
            ],
            [
                25156,
                25169
            ],
            [
                25169,
                25194
            ],
            [
                25194,
                25348
            ],
            [
                25348,
                25439
            ],
            [
                25439,
                25474
            ],
            [
                25474,
                25507
            ],
            [
                25507,
                25597
            ],
            [
                25597,
                25664
            ],
            [
                25664,
                25671
            ],
            [
                25671,
                25691
            ],
            [
                25691,
                25755
            ],
            [
                25755,
                25878
            ]
        ],
        "overlap_chars": [
            [
                73,
                79
            ],
            [
                159,
                167
            ],
            [
                4,
                11
            ],
            [
                48,
                56
            ],
            [
                181,
                223
            ],
            [
                148,
                149
            ],
            [
                237,
                241
            ],
            [
                296,
                340
            ],
            [
                340,
                392
            ],
            [
                404,
                410
            ],
            [
                553,
                577
            ],
            [
                653,
                657
            ],
            [
                595,
                611
            ],
            [
                750,
                752
            ],
            [
                752,
                763
            ],
            [
                797,
                801
            ],
            [
                864,
                866
            ],
            [
                815,
                841
            ],
            [
                843,
                863
            ],
            [
                879,
                916
            ],
            [
                1485,
                1499
            ],
            [
                1569,
                1572
            ],
            [
                1512,
                1548
            ],
            [
                1549,
                1565
            ],
            [
                1593,
                1595
            ],
            [
                1595,
                1613
            ],
            [
                1627,
                1629
            ],
            [
                1614,
                1626
            ],
            [
                1636,
                1643
            ],
            [
                1643,
                1687
            ],
            [
                1694,
                1701
            ],
            [
                1715,
                1723
            ],
            [
                1723,
                1795
            ],
            [
                1795,
                1903
            ],
            [
                1909,
                1921
            ],
            [
                1921,
                1994
            ],
            [
                2032,
                2039
            ],
            [
                1999,
                2003
            ],
            [
                2039,
                2041
            ],
            [
                2181,
                2198
            ],
            [
                2067,
                2084
            ],
            [
                2199,
                2204
            ],
            [
                2207,
                2289
            ],
            [
                2290,
                2303
            ],
            [
                2309,
                2313
            ],
            [
                2324,
                2340
            ],
            [
                2351,
                2410
            ],
            [
                2444,
                2446
            ],
            [
                2446,
                2456
            ],
            [
                2456,
                2490
            ],
            [
                2501,
                2505
            ],
            [
                2513,
                2530
            ],
            [
                2546,
                2592
            ],
            [
                2625,
                2642
            ],
            [
                2708,
                2710
            ],
            [
                2710,
                2743
            ],
            [
                2773,
                2820
            ],
            [
                2828,
                2836
            ],
            [
                2821,
                2827
            ],
            [
                2837,
                2840
            ],
            [
                2883,
                2906
            ],
            [
                2910,
                2938
            ],
            [
                2951,
                2992
            ],
            [
                2994,
                3068
            ],
            [
                3073,
                3080
            ],
            [
                3133,
                3135
            ],
            [
                3185,
                3202
            ],
            [
                3231,
                3304
            ],
            [
                3351,
                3359
            ],
            [
                3437,
                3439
            ],
            [
                3439,
                3442
            ],
            [
                3455,
                3469
            ],
            [
                3482,
                3486
            ],
            [
                3493,
                3502
            ],
            [
                3502,
                3594
            ],
            [
                3615,
                3639
            ],
            [
                3651,
                3667
            ],
            [
                3734,
                3736
            ],
            [
                3857,
                3865
            ],
            [
                3877,
                3883
            ],
            [
                3888,
                3893
            ],
            [
                4002,
                4004
            ],
            [
                4022,
                4027
            ],
            [
                4004,
                4021
            ],
            [
                4072,
                4092
            ],
            [
                4094,
                4123
            ],
            [
                4143,
                4203
            ],
            [
                4218,
                4220
            ],
            [
                4220,
                4242
            ],
            [
                4328,
                4336
            ],
            [
                4355,
                4363
            ],
            [
                4371,
                4393
            ],
            [
                4394,
                4435
            ],
            [
                4437,
                4460
            ],
            [
                4471,
                4482
            ],
            [
                4514,
                4521
            ],
            [
                4536,
                4538
            ],
            [
                4538,
                4585
            ],
            [
                4586,
                4669
            ],
            [
                4677,
                4689
            ],
            [
                4689,
                4713
            ],
            [
                4724,
                4729
            ],
            [
                4798,
                4833
            ],
            [
                4833,
                4889
            ],
            [
                4889,
                4895
            ],
            [
                4901,
                4961
            ],
            [
                5002,
                5004
            ],
            [
                5004,
                5082
            ],
            [
                5091,
                5107
            ],
            [
                5140,
                5141
            ],
            [
                5288,
                5306
            ],
            [
                5314,
                5373
            ],
            [
                5389,
                5391
            ],
            [
                5391,
                5479
            ],
            [
                5479,
                5519
            ],
            [
                6009,
                6049
            ],
            [
                6049,
                6100
            ],
            [
                6117,
                6123
            ],
            [
                6123,
                6263
            ],
            [
                6281,
                6290
            ],
            [
                6297,
                6311
            ],
            [
                6315,
                6317
            ],
            [
                6317,
                6319
            ],
            [
                6342,
                6346
            ],
            [
                6370,
                6451
            ],
            [
                6451,
                6530
            ],
            [
                6534,
                6634
            ],
            [
                6634,
                6717
            ],
            [
                6717,
                6775
            ],
            [
                6791,
                6806
            ],
            [
                6806,
                6847
            ],
            [
                6859,
                6897
            ],
            [
                6897,
                6939
            ],
            [
                6939,
                7092
            ],
            [
                7162,
                7172
            ],
            [
                7200,
                7243
            ],
            [
                7255,
                7270
            ],
            [
                7288,
                7290
            ],
            [
                7295,
                7304
            ],
            [
                7355,
                7358
            ],
            [
                7364,
                7404
            ],
            [
                7411,
                7420
            ],
            [
                7437,
                7496
            ],
            [
                7353,
                7354
            ],
            [
                7507,
                7515
            ],
            [
                7525,
                7534
            ],
            [
                7421,
                7424
            ],
            [
                7552,
                7566
            ],
            [
                7576,
                7584
            ],
            [
                7869,
                7887
            ],
            [
                7900,
                7919
            ],
            [
                7935,
                7955
            ],
            [
                7981,
                7982
            ],
            [
                7957,
                7976
            ],
            [
                8005,
                8045
            ],
            [
                8060,
                8091
            ],
            [
                7924,
                7925
            ],
            [
                8094,
                8243
            ],
            [
                8243,
                8282
            ],
            [
                8282,
                8318
            ],
            [
                8333,
                8348
            ],
            [
                8350,
                8365
            ],
            [
                8380,
                8401
            ],
            [
                8401,
                8443
            ],
            [
                8535,
                8538
            ],
            [
                8450,
                8463
            ],
            [
                8485,
                8518
            ],
            [
                8567,
                8568
            ],
            [
                8569,
                8600
            ],
            [
                8600,
                8609
            ],
            [
                8674,
                8676
            ],
            [
                8997,
                9004
            ],
            [
                9043,
                9049
            ],
            [
                9050,
                9052
            ],
            [
                9064,
                9077
            ],
            [
                9082,
                9095
            ],
            [
                9111,
                9199
            ],
            [
                9199,
                9213
            ],
            [
                9221,
                9249
            ],
            [
                9260,
                9265
            ],
            [
                9284,
                9291
            ],
            [
                9293,
                9296
            ],
            [
                9328,
                9351
            ],
            [
                9351,
                9359
            ],
            [
                9376,
                9380
            ],
            [
                9388,
                9390
            ],
            [
                9424,
                9427
            ],
            [
                9403,
                9419
            ],
            [
                9437,
                9439
            ],
            [
                9439,
                9457
            ],
            [
                9458,
                9475
            ],
            [
                9663,
                9665
            ],
            [
                9518,
                9523
            ],
            [
                9494,
                9497
            ],
            [
                9552,
                9613
            ],
            [
                9694,
                9737
            ],
            [
                9737,
                9759
            ],
            [
                9818,
                9866
            ],
            [
                9870,
                9884
            ],
            [
                9884,
                9990
            ],
            [
                10013,
                10030
            ],
            [
                10041,
                10047
            ],
            [
                10031,
                10037
            ],
            [
                10055,
                10103
            ],
            [
                10132,
                10212
            ],
            [
                10213,
                10224
            ],
            [
                10252,
                10258
            ],
            [
                10225,
                10230
            ],
            [
                10235,
                10246
            ],
            [
                10249,
                10251
            ],
            [
                10362,
                10370
            ],
            [
                10258,
                10259
            ],
            [
                10260,
                10281
            ],
            [
                10294,
                10297
            ],
            [
                10456,
                10494
            ],
            [
                10499,
                10504
            ],
            [
                10231,
                10234
            ],
            [
                10512,
                10526
            ],
            [
                10540,
                10584
            ],
            [
                10592,
                10619
            ],
            [
                10633,
                10647
            ],
            [
                10653,
                10657
            ],
            [
                10668,
                10670
            ],
            [
                10292,
                10293
            ],
            [
                10658,
                10667
            ],
            [
                10699,
                10701
            ],
            [
                10701,
                10742
            ],
            [
                10742,
                10799
            ],
            [
                10799,
                10847
            ],
            [
                10880,
                10933
            ],
            [
                10950,
                10959
            ],
            [
                10978,
                10979
            ],
            [
                10980,
                11018
            ],
            [
                11031,
                11044
            ],
            [
                11053,
                11059
            ],
            [
                11059,
                11097
            ],
            [
                11236,
                11246
            ],
            [
                11194,
                11204
            ],
            [
                11251,
                11283
            ],
            [
                11180,
                11183
            ],
            [
                11299,
                11311
            ],
            [
                11311,
                11450
            ],
            [
                11474,
                11476
            ],
            [
                11476,
                11508
            ],
            [
                11514,
                11537
            ],
            [
                11537,
                11573
            ],
            [
                11615,
                11787
            ],
            [
                11796,
                11803
            ],
            [
                11809,
                11810
            ],
            [
                12140,
                12166
            ],
            [
                12199,
                12206
            ],
            [
                12227,
                12315
            ],
            [
                12315,
                12335
            ],
            [
                12345,
                12411
            ],
            [
                12411,
                12417
            ],
            [
                12431,
                12546
            ],
            [
                12591,
                12593
            ],
            [
                12593,
                12719
            ],
            [
                12763,
                12765
            ],
            [
                12765,
                12882
            ],
            [
                12886,
                12902
            ],
            [
                12914,
                12915
            ],
            [
                12916,
                12954
            ],
            [
                12964,
                12984
            ],
            [
                13080,
                13087
            ],
            [
                13070,
                13075
            ],
            [
                13091,
                13135
            ],
            [
                13135,
                13138
            ],
            [
                13164,
                13168
            ],
            [
                13180,
                13183
            ],
            [
                13190,
                13233
            ],
            [
                13139,
                13145
            ],
            [
                13280,
                13297
            ],
            [
                13308,
                13382
            ],
            [
                13383,
                13384
            ],
            [
                13391,
                13403
            ],
            [
                13408,
                13530
            ],
            [
                13552,
                13560
            ],
            [
                13577,
                13606
            ],
            [
                13608,
                13647
            ],
            [
                13670,
                13692
            ],
            [
                13648,
                13656
            ],
            [
                13752,
                13754
            ],
            [
                13754,
                13761
            ],
            [
                13907,
                13923
            ],
            [
                13862,
                13871
            ],
            [
                13891,
                13903
            ],
            [
                13923,
                13925
            ],
            [
                13925,
                13946
            ],
            [
                13955,
                13998
            ],
            [
                13998,
                14053
            ],
            [
                14239,
                14332
            ],
            [
                14359,
                14366
            ],
            [
                14379,
                14418
            ],
            [
                14421,
                14423
            ],
            [
                14423,
                14505
            ],
            [
                14509,
                14516
            ],
            [
                14543,
                14623
            ],
            [
                14739,
                14778
            ],
            [
                14801,
                14804
            ],
            [
                14783,
                14790
            ],
            [
                14840,
                14847
            ],
            [
                14805,
                14813
            ],
            [
                14875,
                14877
            ],
            [
                14877,
                14929
            ],
            [
                14982,
                14985
            ],
            [
                14930,
                14943
            ],
            [
                14961,
                14980
            ],
            [
                15022,
                15071
            ],
            [
                15086,
                15098
            ],
            [
                15098,
                15124
            ],
            [
                15146,
                15148
            ],
            [
                15148,
                15213
            ],
            [
                15215,
                15298
            ],
            [
                15301,
                15329
            ],
            [
                15298,
                15300
            ],
            [
                15330,
                15414
            ],
            [
                15420,
                15479
            ],
            [
                15505,
                15515
            ],
            [
                15520,
                15526
            ],
            [
                15526,
                15528
            ],
            [
                15528,
                15548
            ],
            [
                15706,
                15708
            ],
            [
                15708,
                15749
            ],
            [
                15763,
                15766
            ],
            [
                15783,
                15815
            ],
            [
                15816,
                15892
            ],
            [
                15892,
                15921
            ],
            [
                15991,
                16033
            ],
            [
                16033,
                16091
            ],
            [
                16100,
                16240
            ],
            [
                16240,
                16254
            ],
            [
                16254,
                16302
            ],
            [
                16597,
                16660
            ],
            [
                16662,
                16687
            ],
            [
                16688,
                16732
            ],
            [
                16794,
                16796
            ],
            [
                16751,
                16776
            ],
            [
                16782,
                16788
            ],
            [
                16796,
                16798
            ],
            [
                16811,
                16814
            ],
            [
                16877,
                16880
            ],
            [
                16975,
                16978
            ],
            [
                17285,
                17290
            ],
            [
                17290,
                17293
            ],
            [
                17331,
                17338
            ],
            [
                17398,
                17411
            ],
            [
                17385,
                17394
            ],
            [
                17421,
                17427
            ],
            [
                17428,
                17442
            ],
            [
                17442,
                17470
            ],
            [
                17470,
                17482
            ],
            [
                17498,
                17501
            ],
            [
                17487,
                17489
            ],
            [
                17502,
                17521
            ],
            [
                17521,
                17536
            ],
            [
                17544,
                17571
            ],
            [
                17586,
                17633
            ],
            [
                17633,
                17676
            ],
            [
                17676,
                17708
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17755
            ],
            [
                17755,
                17779
            ],
            [
                17779,
                17782
            ],
            [
                17802,
                17803
            ],
            [
                17805,
                17818
            ],
            [
                17821,
                17823
            ],
            [
                17830,
                17891
            ],
            [
                17916,
                17936
            ],
            [
                17945,
                18000
            ],
            [
                18020,
                18022
            ],
            [
                18022,
                18069
            ],
            [
                18192,
                18267
            ],
            [
                18281,
                18363
            ],
            [
                18363,
                18383
            ],
            [
                18389,
                18403
            ],
            [
                18444,
                18446
            ],
            [
                18446,
                18485
            ],
            [
                18485,
                18521
            ],
            [
                18521,
                18580
            ],
            [
                18595,
                18597
            ],
            [
                18597,
                18629
            ],
            [
                18649,
                18650
            ],
            [
                18652,
                18682
            ],
            [
                18721,
                18811
            ],
            [
                18811,
                18856
            ],
            [
                18856,
                18889
            ],
            [
                18889,
                18892
            ],
            [
                18925,
                18977
            ],
            [
                19010,
                19012
            ],
            [
                19012,
                19057
            ],
            [
                19057,
                19069
            ],
            [
                19081,
                19087
            ],
            [
                19070,
                19080
            ],
            [
                19088,
                19142
            ],
            [
                19142,
                19186
            ],
            [
                19186,
                19272
            ],
            [
                19272,
                19299
            ],
            [
                19299,
                19358
            ],
            [
                19358,
                19413
            ],
            [
                19413,
                19461
            ],
            [
                19534,
                19541
            ],
            [
                19519,
                19522
            ],
            [
                19542,
                19549
            ],
            [
                19462,
                19478
            ],
            [
                19579,
                19608
            ],
            [
                19682,
                19717
            ],
            [
                19717,
                19736
            ],
            [
                19753,
                19778
            ],
            [
                19778,
                19814
            ],
            [
                19833,
                19840
            ],
            [
                19840,
                19867
            ],
            [
                19872,
                19895
            ],
            [
                19895,
                19977
            ],
            [
                20013,
                20072
            ],
            [
                20076,
                20102
            ],
            [
                20102,
                20144
            ],
            [
                20144,
                20191
            ],
            [
                20195,
                20226
            ],
            [
                20227,
                20288
            ],
            [
                20290,
                20314
            ],
            [
                20375,
                20384
            ],
            [
                20411,
                20417
            ],
            [
                20419,
                20463
            ],
            [
                20464,
                20480
            ],
            [
                20486,
                20511
            ],
            [
                20511,
                20554
            ],
            [
                20577,
                20602
            ],
            [
                20602,
                20657
            ],
            [
                20669,
                20716
            ],
            [
                20716,
                20806
            ],
            [
                20897,
                20911
            ],
            [
                20973,
                20975
            ],
            [
                21042,
                21180
            ],
            [
                21238,
                21239
            ],
            [
                21240,
                21250
            ],
            [
                21252,
                21290
            ],
            [
                21292,
                21350
            ],
            [
                21352,
                21359
            ],
            [
                21361,
                21365
            ],
            [
                21378,
                21384
            ],
            [
                21370,
                21374
            ],
            [
                21399,
                21439
            ],
            [
                21439,
                21460
            ],
            [
                21482,
                21484
            ],
            [
                21484,
                21516
            ],
            [
                21518,
                21600
            ],
            [
                21600,
                21614
            ],
            [
                21614,
                21629
            ],
            [
                21648,
                21674
            ],
            [
                21739,
                21744
            ],
            [
                21745,
                21759
            ],
            [
                21771,
                21779
            ],
            [
                21779,
                21826
            ],
            [
                21874,
                21877
            ],
            [
                21890,
                21944
            ],
            [
                21958,
                21979
            ],
            [
                21979,
                22020
            ],
            [
                22064,
                22065
            ],
            [
                22025,
                22046
            ],
            [
                22113,
                22114
            ],
            [
                22048,
                22064
            ],
            [
                22124,
                22133
            ],
            [
                22021,
                22024
            ],
            [
                22102,
                22113
            ],
            [
                22150,
                22152
            ],
            [
                22152,
                22300
            ],
            [
                22300,
                22315
            ],
            [
                22333,
                22338
            ],
            [
                22316,
                22325
            ],
            [
                22338,
                22398
            ],
            [
                22410,
                22413
            ],
            [
                22446,
                22448
            ],
            [
                22448,
                22469
            ],
            [
                22709,
                22712
            ],
            [
                22490,
                22519
            ],
            [
                22547,
                22666
            ],
            [
                22682,
                22708
            ],
            [
                22470,
                22473
            ],
            [
                22732,
                22741
            ],
            [
                22745,
                22770
            ],
            [
                22770,
                22796
            ],
            [
                22796,
                22831
            ],
            [
                22833,
                22846
            ],
            [
                22883,
                22906
            ],
            [
                22906,
                22962
            ],
            [
                22962,
                23043
            ],
            [
                23111,
                23115
            ],
            [
                23120,
                23152
            ],
            [
                23154,
                23211
            ],
            [
                23219,
                23233
            ],
            [
                23249,
                23253
            ],
            [
                23281,
                23286
            ],
            [
                23296,
                23331
            ],
            [
                23339,
                23362
            ],
            [
                23378,
                23388
            ],
            [
                23388,
                23400
            ],
            [
                23426,
                23465
            ],
            [
                23465,
                23535
            ],
            [
                23535,
                23587
            ],
            [
                23606,
                23611
            ],
            [
                23588,
                23598
            ],
            [
                23611,
                23621
            ],
            [
                23639,
                23734
            ],
            [
                23751,
                23799
            ],
            [
                23799,
                23809
            ],
            [
                23838,
                23860
            ],
            [
                23865,
                23882
            ],
            [
                23898,
                23924
            ],
            [
                23981,
                23998
            ],
            [
                24107,
                24148
            ],
            [
                24181,
                24195
            ],
            [
                24213,
                24257
            ],
            [
                24266,
                24270
            ],
            [
                24272,
                24336
            ],
            [
                24341,
                24349
            ],
            [
                24362,
                24387
            ],
            [
                24387,
                24409
            ],
            [
                24409,
                24447
            ],
            [
                24513,
                24520
            ],
            [
                24448,
                24454
            ],
            [
                24471,
                24476
            ],
            [
                24486,
                24489
            ],
            [
                24583,
                24601
            ],
            [
                24602,
                24616
            ],
            [
                24629,
                24639
            ],
            [
                24650,
                24656
            ],
            [
                24618,
                24624
            ],
            [
                24662,
                24699
            ],
            [
                24703,
                24769
            ],
            [
                24769,
                24825
            ],
            [
                24847,
                24860
            ],
            [
                24860,
                24871
            ],
            [
                24871,
                24897
            ],
            [
                24897,
                24906
            ],
            [
                24919,
                24921
            ],
            [
                24921,
                25026
            ],
            [
                25026,
                25056
            ],
            [
                25056,
                25100
            ],
            [
                25100,
                25156
            ],
            [
                25156,
                25169
            ],
            [
                25169,
                25194
            ],
            [
                25194,
                25204
            ],
            [
                25210,
                25222
            ],
            [
                25223,
                25258
            ],
            [
                25266,
                25348
            ],
            [
                25348,
                25419
            ],
            [
                25429,
                25439
            ],
            [
                25439,
                25474
            ],
            [
                25474,
                25507
            ],
            [
                25507,
                25596
            ],
            [
                25597,
                25664
            ],
            [
                25664,
                25671
            ],
            [
                25671,
                25691
            ],
            [
                25691,
                25712
            ],
            [
                25720,
                25755
            ],
            [
                25755,
                25775
            ],
            [
                25789,
                25878
            ]
        ],
        "row_chars": [
            [
                0,
                340
            ],
            [
                340,
                410
            ],
            [
                410,
                752
            ],
            [
                752,
                917
            ],
            [
                917,
                1047
            ],
            [
                1047,
                1485
            ],
            [
                1485,
                1595
            ],
            [
                1595,
                1643
            ],
            [
                1643,
                1723
            ],
            [
                1723,
                1795
            ],
            [
                1795,
                1921
            ],
            [
                1921,
                2041
            ],
            [
                2041,
                2204
            ],
            [
                2204,
                2290
            ],
            [
                2290,
                2446
            ],
            [
                2446,
                2456
            ],
            [
                2456,
                2710
            ],
            [
                2710,
                2906
            ],
            [
                2906,
                3135
            ],
            [
                3135,
                3439
            ],
            [
                3439,
                3502
            ],
            [
                3502,
                3736
            ],
            [
                3736,
                3854
            ],
            [
                3854,
                4004
            ],
            [
                4004,
                4220
            ],
            [
                4220,
                4394
            ],
            [
                4394,
                4538
            ],
            [
                4538,
                4586
            ],
            [
                4586,
                4689
            ],
            [
                4689,
                4833
            ],
            [
                4833,
                4889
            ],
            [
                4889,
                5004
            ],
            [
                5004,
                5391
            ],
            [
                5391,
                5479
            ],
            [
                5479,
                5519
            ],
            [
                5519,
                5570
            ],
            [
                5570,
                5656
            ],
            [
                5656,
                5742
            ],
            [
                5742,
                5797
            ],
            [
                5797,
                5847
            ],
            [
                5847,
                5900
            ],
            [
                5900,
                5950
            ],
            [
                5950,
                6009
            ],
            [
                6009,
                6049
            ],
            [
                6049,
                6123
            ],
            [
                6123,
                6317
            ],
            [
                6317,
                6451
            ],
            [
                6451,
                6634
            ],
            [
                6634,
                6717
            ],
            [
                6717,
                6806
            ],
            [
                6806,
                6897
            ],
            [
                6897,
                6939
            ],
            [
                6939,
                7243
            ],
            [
                7243,
                7585
            ],
            [
                7585,
                7777
            ],
            [
                7777,
                7869
            ],
            [
                7869,
                8243
            ],
            [
                8243,
                8282
            ],
            [
                8282,
                8401
            ],
            [
                8401,
                8569
            ],
            [
                8569,
                8600
            ],
            [
                8600,
                8676
            ],
            [
                8676,
                8895
            ],
            [
                8895,
                8974
            ],
            [
                8974,
                9199
            ],
            [
                9199,
                9351
            ],
            [
                9351,
                9439
            ],
            [
                9439,
                9737
            ],
            [
                9737,
                9884
            ],
            [
                9884,
                10213
            ],
            [
                10213,
                10701
            ],
            [
                10701,
                10742
            ],
            [
                10742,
                10799
            ],
            [
                10799,
                10980
            ],
            [
                10980,
                11059
            ],
            [
                11059,
                11311
            ],
            [
                11311,
                11476
            ],
            [
                11476,
                11537
            ],
            [
                11537,
                11615
            ],
            [
                11615,
                11831
            ],
            [
                11831,
                12140
            ],
            [
                12140,
                12315
            ],
            [
                12315,
                12411
            ],
            [
                12411,
                12593
            ],
            [
                12593,
                12765
            ],
            [
                12765,
                12916
            ],
            [
                12916,
                13135
            ],
            [
                13135,
                13383
            ],
            [
                13383,
                13530
            ],
            [
                13530,
                13754
            ],
            [
                13754,
                13925
            ],
            [
                13925,
                13998
            ],
            [
                13998,
                14423
            ],
            [
                14423,
                14624
            ],
            [
                14624,
                14739
            ],
            [
                14739,
                14877
            ],
            [
                14877,
                15098
            ],
            [
                15098,
                15148
            ],
            [
                15148,
                15298
            ],
            [
                15298,
                15528
            ],
            [
                15528,
                15708
            ],
            [
                15708,
                15816
            ],
            [
                15816,
                15892
            ],
            [
                15892,
                15921
            ],
            [
                15921,
                15991
            ],
            [
                15991,
                16033
            ],
            [
                16033,
                16240
            ],
            [
                16240,
                16254
            ],
            [
                16254,
                16303
            ],
            [
                16303,
                16513
            ],
            [
                16513,
                16523
            ],
            [
                16523,
                16538
            ],
            [
                16538,
                16597
            ],
            [
                16597,
                16688
            ],
            [
                16688,
                16798
            ],
            [
                16798,
                17290
            ],
            [
                17290,
                17442
            ],
            [
                17442,
                17470
            ],
            [
                17470,
                17521
            ],
            [
                17521,
                17633
            ],
            [
                17633,
                17676
            ],
            [
                17676,
                17708
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17755
            ],
            [
                17755,
                17779
            ],
            [
                17779,
                18022
            ],
            [
                18022,
                18070
            ],
            [
                18070,
                18192
            ],
            [
                18192,
                18363
            ],
            [
                18363,
                18446
            ],
            [
                18446,
                18485
            ],
            [
                18485,
                18521
            ],
            [
                18521,
                18597
            ],
            [
                18597,
                18682
            ],
            [
                18682,
                18721
            ],
            [
                18721,
                18811
            ],
            [
                18811,
                18856
            ],
            [
                18856,
                18889
            ],
            [
                18889,
                19012
            ],
            [
                19012,
                19057
            ],
            [
                19057,
                19142
            ],
            [
                19142,
                19186
            ],
            [
                19186,
                19272
            ],
            [
                19272,
                19299
            ],
            [
                19299,
                19358
            ],
            [
                19358,
                19413
            ],
            [
                19413,
                19608
            ],
            [
                19608,
                19717
            ],
            [
                19717,
                19778
            ],
            [
                19778,
                19840
            ],
            [
                19840,
                19895
            ],
            [
                19895,
                19977
            ],
            [
                19977,
                20102
            ],
            [
                20102,
                20144
            ],
            [
                20144,
                20227
            ],
            [
                20227,
                20464
            ],
            [
                20464,
                20511
            ],
            [
                20511,
                20602
            ],
            [
                20602,
                20716
            ],
            [
                20716,
                20975
            ],
            [
                20975,
                21042
            ],
            [
                21042,
                21240
            ],
            [
                21240,
                21439
            ],
            [
                21439,
                21484
            ],
            [
                21484,
                21600
            ],
            [
                21600,
                21614
            ],
            [
                21614,
                21779
            ],
            [
                21779,
                21944
            ],
            [
                21944,
                21979
            ],
            [
                21979,
                22152
            ],
            [
                22152,
                22300
            ],
            [
                22300,
                22448
            ],
            [
                22448,
                22770
            ],
            [
                22770,
                22796
            ],
            [
                22796,
                22906
            ],
            [
                22906,
                22962
            ],
            [
                22962,
                23212
            ],
            [
                23212,
                23388
            ],
            [
                23388,
                23465
            ],
            [
                23465,
                23535
            ],
            [
                23535,
                23799
            ],
            [
                23799,
                23999
            ],
            [
                23999,
                24107
            ],
            [
                24107,
                24387
            ],
            [
                24387,
                24409
            ],
            [
                24409,
                24602
            ],
            [
                24602,
                24699
            ],
            [
                24699,
                24769
            ],
            [
                24769,
                24860
            ],
            [
                24860,
                24871
            ],
            [
                24871,
                24897
            ],
            [
                24897,
                24921
            ],
            [
                24921,
                25026
            ],
            [
                25026,
                25056
            ],
            [
                25056,
                25100
            ],
            [
                25100,
                25156
            ],
            [
                25156,
                25169
            ],
            [
                25169,
                25194
            ],
            [
                25194,
                25348
            ],
            [
                25348,
                25439
            ],
            [
                25439,
                25474
            ],
            [
                25474,
                25507
            ],
            [
                25507,
                25597
            ],
            [
                25597,
                25664
            ],
            [
                25664,
                25671
            ],
            [
                25671,
                25691
            ],
            [
                25691,
                25755
            ],
            [
                25755,
                25878
            ]
        ]
    },
    "abridged": {
        "text": "At the glorious news of Waterloo, all England thrilled with triumph and fear; for then came the list of the wounded and the slain. Who can tell the dread with which that catalogue was read! Exultation and gratitude were followed by sickening dismay. Anybody who looks back at the newspapers of the time must, even now, feel this breathless pause of expectation.\nThe news which the Gazette brought to the Osbornes gave them a dreadful shock. The girls indulged in unrestrained grief. The gloom-stricken old father was still more weighed down by sorrow. He strove to think that a judgment was on the boy for his disobedience. He dared not own that the severity of the sentence frightened him, and that its fulfilment had come too soon after his curses. Sometimes a shuddering terror struck him, as if he had been the author of his son's doom. There was no hope of reconciliation now. George stood on the other side of the gulf impassable, haunting his parent with sad eyes.\nHe remembered him once in a fever, when everyone thought the lad was dying, and he lay on his bed speechless. Good God! how the father clung to the doctor with sickening anxiety: what a weight of grief was off his mind when the lad recovered. But now there was no help or cure; above all, there were no humble words to soothe outraged vanity and poisoned, angry blood. It is hard to say which pang tore the proud father's heart most keenly - that his son should have gone out of the reach of his forgiveness, or that he could never receive any apology.\nThe stern old man never mentioned his son's name to his daughters; but ordered the elder to go into mourning. All entertainments were put off. No communications were made to his future son-in-law, whose marriage-day had been fixed: but Mr. Osborne's appearance prevented Mr. Bullock from asking about the wedding. Mr. Osborne remained shut in his study.\nAfter about three weeks, Sir William Dobbin called at Mr. Osborne's house with a very pale and agitated face, and insisted upon seeing him. Ushered into his room, Sir William produced a letter with a large red seal.\n\"My son, Major Dobbin,\" the Alderman said with some hesitation, \"sent me a letter which arrived today. My son's letter contains one for you, Osborne.\"\nThe Alderman placed the letter on the table, and Osborne stared at him for a moment in silence. His looks frightened the messenger, who hurried away without another word.\nThe letter was in George's well-known bold handwriting. It was the one which he had written before daybreak on the 16th of June. The great red seal was emblazoned with the sham coat of arms which Osborne had taken from the Peerage; the very seal that had impressed it had been robbed from George's dead body as it lay on the battlefield. The father knew nothing of this, but sat and looked at the letter in terrified vacancy. He almost fell when he went to open it.\nThe poor boy's letter did not say much. He had been too proud to acknowledge the tenderness he felt. He only said, that on the eve of a great battle, he wished to bid his father farewell, and solemnly to implore his good offices for the wife - and perhaps the child - whom he left behind. He confessed that his extravagance had already wasted a large part of his mother's little fortune. He thanked his father for his former generous conduct; and he promised him that whether he fell on the field or survived it, he would act in a manner worthy of the name of George Osborne.\nHis English habit, pride, awkwardness perhaps, had prevented him from saying more. His father could not see the kiss George had placed on the address of his letter. Mr. Osborne dropped it with the bitterest pang of balked affection and revenge. His son was still beloved and unforgiven.\nAbout two months afterwards, however, as the young ladies of the family went to church with their father, they remarked how he took a different seat from usual; and that he looked up at the wall over their heads. The young women gazed in that direction, and saw an elaborate monument upon the wall, with Britannia weeping over an urn, and a broken sword and a couchant lion: signs that the sculpture was in honour of a dead warrior.\nUnder the memorial were emblazoned the pompous Osborne arms, and the inscription: \"Sacred to the memory of George Osborne, late a Captain in his Majesty's -th regiment of foot, who fell on the 18th of June, 1815, aged 28 years, while fighting for his king and country in the glorious victory of Waterloo. Dulce et decorum est pro patria mori.\"\nThe sight of that stone agitated the sisters so much that Miss Maria had to leave the church. The congregation made way respectfully for the sobbing girls, and pitied the stern old father.\n\"Will he forgive Mrs. George?\" the girls wondered. Their anxiety that Amelia might be recognised as one of the family was increased towards the end of the autumn, by their father's announcement that he was going abroad. He did not say where, but they knew at once that he would go to Belgium; and Amelia was still in Brussels. They had news of her from Lady Dobbin. Our honest Captain Dobbin had been promoted to Major after the battle; and the brave O'Dowd, who had distinguished himself greatly, was a Colonel and Companion of the Bath.\nVery many of the brave regiment were still at Brussels in the autumn, recovering from their wounds. The city was a vast military hospital for months after the great battles; and as men and officers began to recover, the gardens and public places swarmed with maimed warriors, old and young, who fell to gambling, and gaiety, and love-making, as people of Vanity Fair will do.\nMr. Osborne easily found some of the -th regiment. He knew their uniform; and the day after his arrival at Brussels, as he came out from his hotel facing the park, he saw a soldier in the well-known outfit, reposing on a stone bench, and went and sat down by him, trembling.\n\"Were you in Captain Osborne's company?\" he said, and added, after a pause, \"he was my son, sir.\"\nThe man was not of the Captain's company, but he touched his cap sadly and respectfully to the haggard gentleman.\n\"The whole army didn't contain a finer officer,\" the man said. \"The Sergeant of the Captain's company could tell his honour anything he wanted to know about the regiment's actions. But his honour had seen Major Dobbin, no doubt, the brave Captain's great friend; and Mrs. Osborne, who was here too, and had been very bad. They say she was out of her mind for six weeks or more. But your honour knows all about that.\"\nOsborne put a guinea into the soldier's hand, and told him he should have another if he would bring the Sergeant to the Hotel du Parc; a promise which very soon brought the officer.\nIn the Sergeant's company, Osborne travelled to Waterloo and Quatre Bras, a journey which thousands of his countrymen were then taking. He took the Sergeant in his carriage, and went through both fields under his guidance. He saw the road where the regiment marched into action on the 16th, and the slope down which they drove the French cavalry. There was the spot where the noble Captain cut down the French officer who was grappling with the young Ensign for the colours. Along this road they retreated on the next day, and here was the bank at which the regiment bivouacked under the rain on the night of the 17th.\nFurther on was the position which they held during the day, sheltering under the bank from the furious French cannonade. And when the English line received the order to advance, it was here that the Captain, cheering and rushing down the hill waving his sword, received a shot and fell dead.\n\"Major Dobbin took back the Captain's body to Brussels,\" the Sergeant said, in a low voice, \"and had him buried, as your honour knows.\" Relic-hunters were screaming round the pair as the soldier told his story, offering mementoes of the fight for sale.\nOsborne had already seen his son's burial-place. Indeed, he had driven there immediately after his arrival at Brussels. George's body lay in the pretty burial-ground of Laeken, in the unconsecrated corner of the garden, separated by a little hedge from the temples and flowers under which the Roman Catholic dead reposed. It seemed a humiliation to old Osborne to think that his son, an English gentleman and captain, should not be found worthy to lie in ground where mere foreigners were buried.\nOld Osborne did not speculate much upon his own mingled selfish feelings. He firmly believed that everything he did was right, and that he ought to have his own way - and his hatred rushed out armed and poisonous against any opposition. He was proud of his hatred. Always to be right, always to trample forward, and never to doubt; are not these the great qualities with which dullness takes the lead in the world?\nAfter the drive to Waterloo, as Mr. Osborne's carriage was nearing the gates of the city at sunset, they met another barouche, in which were a couple of ladies and a gentleman, with an officer riding alongside. Osborne gave a start. It was Amelia, with the lame young Ensign and her faithful friend Mrs. O'Dowd.\nIt was Amelia, but how changed from the fresh and comely girl Osborne knew. Her face was white and thin. Her eyes were fixed, and looking nowhere. They stared blank in the face of Osborne, as the carriages passed each other, but she did not know him; nor did he recognise her, until looking up, he saw Dobbin riding by her: and then he knew who it was. He hated her. He did not know how much until he saw her there.\n\"Tell the scoundrel to drive on quick,\" he shouted with an oath to the lackey on the box.\nA minute afterwards, a horse came clattering up behind Osborne's carriage; it was Dobbin. Amelia had not even noticed him ride off. She was looking into the distance, to the woods where George had marched away.\n\"Mr. Osborne, Mr. Osborne!\" cried Dobbin; and he held out his hand. Osborne made no move to take it, but shouted out with another curse to his servant to drive on.\nDobbin laid his hand on the carriage side. \"I will see you, sir,\" he said. \"I have a message for you.\"\n\"From that woman?\" said Osborne, fiercely.\n\"No, from your son.\" At this Osborne fell back into the corner of his carriage, and Dobbin rode close behind it through the town until they reached Mr. Osborne's hotel. There he followed Osborne up to his apartments.\n\"Pray, have you any commands for me, Captain Dobbin, or, I beg your pardon, MAJOR Dobbin, since better men than you are dead, and you step into their shoes?\" said Mr. Osborne, in a sarcastic tone.\n\"Better men are dead,\" Dobbin replied. \"I want to speak to you about one.\"\n\"Make it short, sir,\" said the other with an oath, scowling.\n\"I am here as his closest friend, and the executor of his will. Are you aware how small his means are, and of the straitened circumstances of his widow?\"\n\"I don't know his widow, sir,\" Osborne said. \"Let her go back to her father.\" But Dobbin was determined to remain in good temper, and went on.\n\"Do you know, sir, Mrs. Osborne's condition? Her life and almost her reason have been shaken by the blow which has fallen on her. It is very doubtful whether she will rally. There is a chance left for her, however, and it is about this I came to speak to you. She will be a mother soon. Will you visit the parent's offence upon the child's head? or will you forgive the child for poor George's sake?\"\nOsborne broke out into a rhapsody of self-praise for his own conduct and imprecations against the undutifulness of George. George had rebelled against him wickedly. He had died without confessing he was wrong. Let him take the consequences of his folly. As for himself, Mr. Osborne was a man of his word. He had sworn never to speak to that woman, or to recognize her as his son's wife. He concluded with an oath; \"And that's what I will stick to till the last day of my life.\"\nThere was no hope from that quarter then. The widow must live on her slender pittance, or such aid as Jos could give her.\n\"I might tell her, and she would not heed it,\" thought Dobbin sadly: for the poor girl was stupefied by sorrow; good and evil were alike indifferent to her. So, indeed, were friendship and kindness. She received them both uncomplainingly, and relapsed into her grief.\n*\nSuppose some twelve months after the above conversation to have passed in the life of our poor Amelia. She has spent the first portion of that time in a sorrow so profound and pitiable, that we must draw back. Shut gently the door of the dark chamber wherein she suffers, as those kind people did who nursed her through the first months of her pain.\nThen a day came - of almost terrified delight and wonder - when the poor widowed girl pressed a child upon her breast - a child with George's eyes - a little boy, as beautiful as a cherub. What a miracle it was! How she laughed and wept over it - how love, and hope, and prayer woke again in her bosom as the baby nestled there. She was safe. The doctors who had feared for her life or sanity could at last pronounce that both were secure. It was worth the long months of doubt and dread for her friends to see her eyes once more beaming tenderly upon them.\nDobbin was one of them. It was he who brought her back to England, to her mother's house, when Mrs. O'Dowd was forced to leave and go with her Colonel. To see Dobbin holding the infant, and to hear Amelia's laugh of triumph as she watched him, would have done any man good who had a sense of humour. William was the child's godfather, and exerted his ingenuity in the purchase of cups, spoons, and coral rattles and teething toys.\nHow his mother nursed the babe, and lived upon him; how she would scarce allow any hand but her own to touch him; how she considered that the greatest favour she could confer upon Major Dobbin, was to allow him to dandle the baby, need not be told here. This child was her being. Her existence was a maternal caress: she enveloped him with love and worship. It was her life which the baby drank in from her bosom. Of nights, and when alone, she had stealthy and intense raptures of motherly love - joys far higher and lower than reason - blind beautiful devotions which only women's hearts know.\nWilliam Dobbin mused upon this, and watched her heart; and if his love made him understand almost all the feelings in it, alas! he could see that there was no place there for him. And so, gently, he bore his fate, knowing it, and content to bear it.\nI suppose Amelia's father and mother saw through the Major's intentions, and were inclined to encourage him; for Dobbin visited their house daily, and stayed for hours with them, or with the honest landlord, Mr. Clapp, and his family. He brought presents to everybody, almost every day; the landlord's little girl called him Major Sugarplums.\nShe laughed one day when Major Sugarplums descended from his carriage with a wooden horse, a drum, a trumpet, and other toys for little Georgy, who was scarcely six months old, and for whom these articles were entirely premature.\nThe child was asleep. \"Hush,\" said Amelia, annoyed, perhaps, but smiling at the Major and his cargo of toys.\n\"Go downstairs,\" said he to the little girl, \"I want to speak to Mrs. Osborne.\" Amelia looked up rather astonished, and laid down the infant on its bed.\n\"I am come to say good-bye, Amelia,\" said he, taking her hand gently.\n\"Good-bye? and where are you going?\" she said, smiling.\n\"Send the letters to the agents,\" he said; \"they will forward them; for you will write to me, won't you? I shall be away a long time.\"\n\"I'll write to you about Georgy,\" she said. \"Dear William, how good you have been to him and to me. Look at him. Isn't he like an angel?\"\nThe little hands of the sleeping child closed mechanically round the soldier's finger, and Amelia looked up in his face with bright maternal pleasure. The cruellest looks could not have wounded him more than that glance of kindness. He bent over the child and mother. He could not speak for a moment. And it was only with all his strength that he could force himself to say a God bless you.\n\"God bless you,\" said Amelia, and held up her face and kissed him.\n\"Hush! Don't wake Georgy!\" she added, as William went to the door with heavy steps. She did not hear the cab-wheels as he drove away: she was looking at the child, who was laughing in his sleep.",
        "paragraph_chars": [
            [
                0,
                362
            ],
            [
                362,
                972
            ],
            [
                972,
                1525
            ],
            [
                1525,
                1879
            ],
            [
                1879,
                2095
            ],
            [
                2095,
                2246
            ],
            [
                2246,
                2417
            ],
            [
                2417,
                2883
            ],
            [
                2883,
                3459
            ],
            [
                3459,
                3746
            ],
            [
                3746,
                4179
            ],
            [
                4179,
                4523
            ],
            [
                4523,
                4712
            ],
            [
                4712,
                5251
            ],
            [
                5251,
                5627
            ],
            [
                5627,
                5902
            ],
            [
                5902,
                6000
            ],
            [
                6000,
                6114
            ],
            [
                6114,
                6531
            ],
            [
                6531,
                6713
            ],
            [
                6713,
                7332
            ],
            [
                7332,
                7624
            ],
            [
                7624,
                7877
            ],
            [
                7877,
                8374
            ],
            [
                8374,
                8789
            ],
            [
                8789,
                9101
            ],
            [
                9101,
                9517
            ],
            [
                9517,
                9607
            ],
            [
                9607,
                9818
            ],
            [
                9818,
                9982
            ],
            [
                9982,
                10085
            ],
            [
                10085,
                10128
            ],
            [
                10128,
                10345
            ],
            [
                10345,
                10542
            ],
            [
                10542,
                10617
            ],
            [
                10617,
                10678
            ],
            [
                10678,
                10832
            ],
            [
                10832,
                10975
            ],
            [
                10975,
                11376
            ],
            [
                11376,
                11854
            ],
            [
                11854,
                11976
            ],
            [
                11976,
                12244
            ],
            [
                12244,
                12246
            ],
            [
                12246,
                12596
            ],
            [
                12596,
                13154
            ],
            [
                13154,
                13585
            ],
            [
                13585,
                14181
            ],
            [
                14181,
                14431
            ],
            [
                14431,
                14774
            ],
            [
                14774,
                15004
            ],
            [
                15004,
                15113
            ],
            [
                15113,
                15266
            ],
            [
                15266,
                15336
            ],
            [
                15336,
                15392
            ],
            [
                15392,
                15527
            ],
            [
                15527,
                15665
            ],
            [
                15665,
                16056
            ],
            [
                16056,
                16123
            ],
            [
                16123,
                16317
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                190
            ],
            [
                190,
                250
            ],
            [
                250,
                362
            ],
            [
                362,
                441
            ],
            [
                441,
                483
            ],
            [
                483,
                552
            ],
            [
                552,
                624
            ],
            [
                624,
                751
            ],
            [
                751,
                841
            ],
            [
                841,
                882
            ],
            [
                882,
                972
            ],
            [
                972,
                1082
            ],
            [
                1082,
                1092
            ],
            [
                1092,
                1215
            ],
            [
                1215,
                1341
            ],
            [
                1341,
                1525
            ],
            [
                1525,
                1635
            ],
            [
                1635,
                1668
            ],
            [
                1668,
                1839
            ],
            [
                1839,
                1879
            ],
            [
                1879,
                2019
            ],
            [
                2019,
                2095
            ],
            [
                2095,
                2198
            ],
            [
                2198,
                2246
            ],
            [
                2246,
                2342
            ],
            [
                2342,
                2417
            ],
            [
                2417,
                2473
            ],
            [
                2473,
                2546
            ],
            [
                2546,
                2755
            ],
            [
                2755,
                2843
            ],
            [
                2843,
                2883
            ],
            [
                2883,
                2923
            ],
            [
                2923,
                2984
            ],
            [
                2984,
                3172
            ],
            [
                3172,
                3271
            ],
            [
                3271,
                3459
            ],
            [
                3459,
                3542
            ],
            [
                3542,
                3624
            ],
            [
                3624,
                3704
            ],
            [
                3704,
                3746
            ],
            [
                3746,
                3959
            ],
            [
                3959,
                4179
            ],
            [
                4179,
                4484
            ],
            [
                4484,
                4523
            ],
            [
                4523,
                4617
            ],
            [
                4617,
                4712
            ],
            [
                4712,
                4743
            ],
            [
                4743,
                4763
            ],
            [
                4763,
                4932
            ],
            [
                4932,
                5039
            ],
            [
                5039,
                5078
            ],
            [
                5078,
                5251
            ],
            [
                5251,
                5351
            ],
            [
                5351,
                5627
            ],
            [
                5627,
                5678
            ],
            [
                5678,
                5902
            ],
            [
                5902,
                5943
            ],
            [
                5943,
                6000
            ],
            [
                6000,
                6114
            ],
            [
                6114,
                6177
            ],
            [
                6177,
                6295
            ],
            [
                6295,
                6436
            ],
            [
                6436,
                6492
            ],
            [
                6492,
                6531
            ],
            [
                6531,
                6713
            ],
            [
                6713,
                6849
            ],
            [
                6849,
                6936
            ],
            [
                6936,
                7060
            ],
            [
                7060,
                7188
            ],
            [
                7188,
                7332
            ],
            [
                7332,
                7453
            ],
            [
                7453,
                7624
            ],
            [
                7624,
                7760
            ],
            [
                7760,
                7877
            ],
            [
                7877,
                7926
            ],
            [
                7926,
                7997
            ],
            [
                7997,
                8199
            ],
            [
                8199,
                8374
            ],
            [
                8374,
                8448
            ],
            [
                8448,
                8611
            ],
            [
                8611,
                8639
            ],
            [
                8639,
                8789
            ],
            [
                8789,
                9000
            ],
            [
                9000,
                9022
            ],
            [
                9022,
                9101
            ],
            [
                9101,
                9177
            ],
            [
                9177,
                9206
            ],
            [
                9206,
                9248
            ],
            [
                9248,
                9454
            ],
            [
                9454,
                9468
            ],
            [
                9468,
                9517
            ],
            [
                9517,
                9607
            ],
            [
                9607,
                9697
            ],
            [
                9697,
                9739
            ],
            [
                9739,
                9818
            ],
            [
                9818,
                9846
            ],
            [
                9846,
                9886
            ],
            [
                9886,
                9982
            ],
            [
                9982,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10085
            ],
            [
                10085,
                10104
            ],
            [
                10104,
                10128
            ],
            [
                10128,
                10149
            ],
            [
                10149,
                10297
            ],
            [
                10297,
                10345
            ],
            [
                10345,
                10503
            ],
            [
                10503,
                10542
            ],
            [
                10542,
                10581
            ],
            [
                10581,
                10617
            ],
            [
                10617,
                10678
            ],
            [
                10678,
                10742
            ],
            [
                10742,
                10832
            ],
            [
                10832,
                10877
            ],
            [
                10877,
                10910
            ],
            [
                10910,
                10975
            ],
            [
                10975,
                11020
            ],
            [
                11020,
                11105
            ],
            [
                11105,
                11149
            ],
            [
                11149,
                11235
            ],
            [
                11235,
                11262
            ],
            [
                11262,
                11321
            ],
            [
                11321,
                11376
            ],
            [
                11376,
                11499
            ],
            [
                11499,
                11541
            ],
            [
                11541,
                11586
            ],
            [
                11586,
                11630
            ],
            [
                11630,
                11681
            ],
            [
                11681,
                11763
            ],
            [
                11763,
                11854
            ],
            [
                11854,
                11896
            ],
            [
                11896,
                11976
            ],
            [
                11976,
                12133
            ],
            [
                12133,
                12175
            ],
            [
                12175,
                12244
            ],
            [
                12244,
                12246
            ],
            [
                12246,
                12349
            ],
            [
                12349,
                12456
            ],
            [
                12456,
                12596
            ],
            [
                12596,
                12785
            ],
            [
                12785,
                12808
            ],
            [
                12808,
                12925
            ],
            [
                12925,
                12939
            ],
            [
                12939,
                13036
            ],
            [
                13036,
                13154
            ],
            [
                13154,
                13178
            ],
            [
                13178,
                13306
            ],
            [
                13306,
                13454
            ],
            [
                13454,
                13585
            ],
            [
                13585,
                13839
            ],
            [
                13839,
                13865
            ],
            [
                13865,
                13943
            ],
            [
                13943,
                13999
            ],
            [
                13999,
                14181
            ],
            [
                14181,
                14309
            ],
            [
                14309,
                14361
            ],
            [
                14361,
                14431
            ],
            [
                14431,
                14666
            ],
            [
                14666,
                14774
            ],
            [
                14774,
                15004
            ],
            [
                15004,
                15026
            ],
            [
                15026,
                15113
            ],
            [
                15113,
                15193
            ],
            [
                15193,
                15266
            ],
            [
                15266,
                15336
            ],
            [
                15336,
                15347
            ],
            [
                15347,
                15373
            ],
            [
                15373,
                15392
            ],
            [
                15392,
                15497
            ],
            [
                15497,
                15527
            ],
            [
                15527,
                15571
            ],
            [
                15571,
                15627
            ],
            [
                15627,
                15640
            ],
            [
                15640,
                15665
            ],
            [
                15665,
                15816
            ],
            [
                15816,
                15898
            ],
            [
                15898,
                15933
            ],
            [
                15933,
                15966
            ],
            [
                15966,
                16056
            ],
            [
                16056,
                16123
            ],
            [
                16123,
                16130
            ],
            [
                16130,
                16150
            ],
            [
                16150,
                16207
            ],
            [
                16207,
                16317
            ]
        ],
        "overlap_chars": [
            [
                0,
                6
            ],
            [
                7,
                15
            ],
            [
                16,
                23
            ],
            [
                24,
                32
            ],
            [
                34,
                76
            ],
            [
                76,
                77
            ],
            [
                82,
                86
            ],
            [
                87,
                131
            ],
            [
                131,
                183
            ],
            [
                184,
                190
            ],
            [
                190,
                214
            ],
            [
                215,
                219
            ],
            [
                232,
                248
            ],
            [
                248,
                250
            ],
            [
                250,
                261
            ],
            [
                268,
                272
            ],
            [
                273,
                275
            ],
            [
                276,
                302
            ],
            [
                303,
                323
            ],
            [
                324,
                361
            ],
            [
                362,
                376
            ],
            [
                377,
                380
            ],
            [
                381,
                417
            ],
            [
                423,
                439
            ],
            [
                439,
                441
            ],
            [
                441,
                459
            ],
            [
                460,
                462
            ],
            [
                463,
                475
            ],
            [
                476,
                483
            ],
            [
                483,
                527
            ],
            [
                536,
                543
            ],
            [
                544,
                552
            ],
            [
                552,
                624
            ],
            [
                624,
                732
            ],
            [
                739,
                751
            ],
            [
                751,
                824
            ],
            [
                825,
                832
            ],
            [
                835,
                839
            ],
            [
                839,
                841
            ],
            [
                841,
                858
            ],
            [
                859,
                876
            ],
            [
                877,
                882
            ],
            [
                889,
                971
            ],
            [
                972,
                985
            ],
            [
                990,
                994
            ],
            [
                995,
                1011
            ],
            [
                1021,
                1080
            ],
            [
                1080,
                1082
            ],
            [
                1082,
                1092
            ],
            [
                1092,
                1126
            ],
            [
                1127,
                1131
            ],
            [
                1132,
                1149
            ],
            [
                1149,
                1195
            ],
            [
                1196,
                1213
            ],
            [
                1213,
                1215
            ],
            [
                1215,
                1248
            ],
            [
                1250,
                1297
            ],
            [
                1298,
                1306
            ],
            [
                1307,
                1313
            ],
            [
                1314,
                1317
            ],
            [
                1318,
                1341
            ],
            [
                1341,
                1369
            ],
            [
                1370,
                1411
            ],
            [
                1414,
                1488
            ],
            [
                1516,
                1523
            ],
            [
                1523,
                1525
            ],
            [
                1525,
                1542
            ],
            [
                1543,
                1616
            ],
            [
                1625,
                1633
            ],
            [
                1633,
                1635
            ],
            [
                1635,
                1638
            ],
            [
                1639,
                1653
            ],
            [
                1654,
                1658
            ],
            [
                1659,
                1668
            ],
            [
                1668,
                1760
            ],
            [
                1761,
                1785
            ],
            [
                1796,
                1812
            ],
            [
                1837,
                1839
            ],
            [
                1851,
                1859
            ],
            [
                1865,
                1871
            ],
            [
                1872,
                1877
            ],
            [
                1877,
                1879
            ],
            [
                1879,
                1884
            ],
            [
                1885,
                1902
            ],
            [
                1902,
                1922
            ],
            [
                1923,
                1952
            ],
            [
                1953,
                2013
            ],
            [
                2017,
                2019
            ],
            [
                2019,
                2041
            ],
            [
                2054,
                2062
            ],
            [
                2063,
                2071
            ],
            [
                2072,
                2094
            ],
            [
                2095,
                2136
            ],
            [
                2137,
                2160
            ],
            [
                2165,
                2176
            ],
            [
                2183,
                2190
            ],
            [
                2196,
                2198
            ],
            [
                2198,
                2245
            ],
            [
                2246,
                2329
            ],
            [
                2330,
                2342
            ],
            [
                2342,
                2366
            ],
            [
                2376,
                2381
            ],
            [
                2382,
                2417
            ],
            [
                2417,
                2473
            ],
            [
                2473,
                2479
            ],
            [
                2484,
                2544
            ],
            [
                2544,
                2546
            ],
            [
                2546,
                2624
            ],
            [
                2631,
                2647
            ],
            [
                2647,
                2648
            ],
            [
                2649,
                2667
            ],
            [
                2682,
                2741
            ],
            [
                2753,
                2755
            ],
            [
                2755,
                2843
            ],
            [
                2843,
                2883
            ],
            [
                2883,
                2923
            ],
            [
                2923,
                2974
            ],
            [
                2978,
                2984
            ],
            [
                2984,
                3124
            ],
            [
                3139,
                3148
            ],
            [
                3156,
                3170
            ],
            [
                3170,
                3172
            ],
            [
                3172,
                3174
            ],
            [
                3185,
                3189
            ],
            [
                3190,
                3271
            ],
            [
                3271,
                3350
            ],
            [
                3359,
                3459
            ],
            [
                3459,
                3542
            ],
            [
                3542,
                3600
            ],
            [
                3609,
                3624
            ],
            [
                3624,
                3665
            ],
            [
                3666,
                3704
            ],
            [
                3704,
                3746
            ],
            [
                3746,
                3899
            ],
            [
                3905,
                3915
            ],
            [
                3916,
                3959
            ],
            [
                3959,
                3974
            ],
            [
                3981,
                3983
            ],
            [
                3989,
                3998
            ],
            [
                4000,
                4003
            ],
            [
                4004,
                4044
            ],
            [
                4050,
                4059
            ],
            [
                4060,
                4119
            ],
            [
                4119,
                4120
            ],
            [
                4127,
                4135
            ],
            [
                4136,
                4145
            ],
            [
                4146,
                4149
            ],
            [
                4150,
                4164
            ],
            [
                4170,
                4178
            ],
            [
                4179,
                4197
            ],
            [
                4198,
                4217
            ],
            [
                4218,
                4238
            ],
            [
                4238,
                4239
            ],
            [
                4240,
                4259
            ],
            [
                4261,
                4301
            ],
            [
                4302,
                4333
            ],
            [
                4334,
                4335
            ],
            [
                4335,
                4484
            ],
            [
                4484,
                4523
            ],
            [
                4523,
                4559
            ],
            [
                4560,
                4575
            ],
            [
                4576,
                4591
            ],
            [
                4596,
                4617
            ],
            [
                4617,
                4659
            ],
            [
                4660,
                4663
            ],
            [
                4664,
                4677
            ],
            [
                4677,
                4710
            ],
            [
                4710,
                4711
            ],
            [
                4712,
                4743
            ],
            [
                4743,
                4752
            ],
            [
                4761,
                4763
            ],
            [
                4769,
                4776
            ],
            [
                4782,
                4788
            ],
            [
                4809,
                4811
            ],
            [
                4816,
                4829
            ],
            [
                4830,
                4843
            ],
            [
                4844,
                4932
            ],
            [
                4932,
                4946
            ],
            [
                4952,
                4980
            ],
            [
                4984,
                4989
            ],
            [
                4996,
                5003
            ],
            [
                5005,
                5008
            ],
            [
                5016,
                5039
            ],
            [
                5039,
                5047
            ],
            [
                5048,
                5052
            ],
            [
                5053,
                5055
            ],
            [
                5056,
                5059
            ],
            [
                5060,
                5076
            ],
            [
                5076,
                5078
            ],
            [
                5078,
                5096
            ],
            [
                5104,
                5121
            ],
            [
                5122,
                5124
            ],
            [
                5125,
                5130
            ],
            [
                5137,
                5140
            ],
            [
                5147,
                5208
            ],
            [
                5208,
                5251
            ],
            [
                5251,
                5273
            ],
            [
                5283,
                5331
            ],
            [
                5337,
                5351
            ],
            [
                5351,
                5457
            ],
            [
                5465,
                5482
            ],
            [
                5483,
                5489
            ],
            [
                5490,
                5496
            ],
            [
                5497,
                5545
            ],
            [
                5546,
                5626
            ],
            [
                5627,
                5638
            ],
            [
                5639,
                5645
            ],
            [
                5646,
                5651
            ],
            [
                5652,
                5663
            ],
            [
                5665,
                5667
            ],
            [
                5668,
                5676
            ],
            [
                5676,
                5677
            ],
            [
                5678,
                5699
            ],
            [
                5701,
                5704
            ],
            [
                5705,
                5743
            ],
            [
                5744,
                5749
            ],
            [
                5755,
                5758
            ],
            [
                5759,
                5773
            ],
            [
                5781,
                5825
            ],
            [
                5832,
                5859
            ],
            [
                5859,
                5873
            ],
            [
                5878,
                5882
            ],
            [
                5883,
                5885
            ],
            [
                5889,
                5890
            ],
            [
                5891,
                5900
            ],
            [
                5900,
                5902
            ],
            [
                5902,
                5943
            ],
            [
                5943,
                6000
            ],
            [
                6000,
                6048
            ],
            [
                6049,
                6102
            ],
            [
                6103,
                6112
            ],
            [
                6112,
                6113
            ],
            [
                6114,
                6152
            ],
            [
                6153,
                6166
            ],
            [
                6171,
                6177
            ],
            [
                6177,
                6215
            ],
            [
                6216,
                6226
            ],
            [
                6227,
                6237
            ],
            [
                6238,
                6270
            ],
            [
                6271,
                6274
            ],
            [
                6283,
                6295
            ],
            [
                6295,
                6434
            ],
            [
                6434,
                6436
            ],
            [
                6436,
                6468
            ],
            [
                6469,
                6492
            ],
            [
                6492,
                6528
            ],
            [
                6531,
                6703
            ],
            [
                6704,
                6711
            ],
            [
                6711,
                6712
            ],
            [
                6713,
                6739
            ],
            [
                6740,
                6747
            ],
            [
                6761,
                6849
            ],
            [
                6849,
                6869
            ],
            [
                6870,
                6936
            ],
            [
                6936,
                6942
            ],
            [
                6943,
                7058
            ],
            [
                7058,
                7060
            ],
            [
                7060,
                7186
            ],
            [
                7186,
                7188
            ],
            [
                7188,
                7305
            ],
            [
                7309,
                7325
            ],
            [
                7330,
                7331
            ],
            [
                7332,
                7370
            ],
            [
                7371,
                7391
            ],
            [
                7392,
                7399
            ],
            [
                7403,
                7408
            ],
            [
                7409,
                7453
            ],
            [
                7453,
                7456
            ],
            [
                7457,
                7461
            ],
            [
                7462,
                7465
            ],
            [
                7466,
                7509
            ],
            [
                7510,
                7516
            ],
            [
                7522,
                7539
            ],
            [
                7549,
                7623
            ],
            [
                7624,
                7625
            ],
            [
                7625,
                7637
            ],
            [
                7638,
                7760
            ],
            [
                7765,
                7773
            ],
            [
                7774,
                7803
            ],
            [
                7804,
                7843
            ],
            [
                7844,
                7866
            ],
            [
                7867,
                7875
            ],
            [
                7875,
                7877
            ],
            [
                7877,
                7884
            ],
            [
                7885,
                7901
            ],
            [
                7902,
                7911
            ],
            [
                7912,
                7924
            ],
            [
                7924,
                7926
            ],
            [
                7926,
                7947
            ],
            [
                7954,
                7997
            ],
            [
                7997,
                8052
            ],
            [
                8052,
                8145
            ],
            [
                8146,
                8153
            ],
            [
                8154,
                8193
            ],
            [
                8197,
                8199
            ],
            [
                8199,
                8281
            ],
            [
                8286,
                8293
            ],
            [
                8293,
                8373
            ],
            [
                8374,
                8413
            ],
            [
                8414,
                8417
            ],
            [
                8422,
                8429
            ],
            [
                8430,
                8437
            ],
            [
                8438,
                8446
            ],
            [
                8446,
                8448
            ],
            [
                8448,
                8500
            ],
            [
                8501,
                8504
            ],
            [
                8505,
                8518
            ],
            [
                8519,
                8538
            ],
            [
                8545,
                8594
            ],
            [
                8599,
                8611
            ],
            [
                8611,
                8637
            ],
            [
                8637,
                8639
            ],
            [
                8639,
                8704
            ],
            [
                8706,
                8789
            ],
            [
                8789,
                8817
            ],
            [
                8818,
                8820
            ],
            [
                8821,
                8905
            ],
            [
                8906,
                8965
            ],
            [
                8971,
                8981
            ],
            [
                8982,
                8988
            ],
            [
                8998,
                9000
            ],
            [
                9000,
                9020
            ],
            [
                9020,
                9022
            ],
            [
                9022,
                9063
            ],
            [
                9064,
                9067
            ],
            [
                9068,
                9100
            ],
            [
                9101,
                9177
            ],
            [
                9177,
                9206
            ],
            [
                9206,
                9248
            ],
            [
                9248,
                9306
            ],
            [
                9314,
                9454
            ],
            [
                9454,
                9468
            ],
            [
                9468,
                9516
            ],
            [
                9517,
                9580
            ],
            [
                9581,
                9606
            ],
            [
                9607,
                9651
            ],
            [
                9652,
                9654
            ],
            [
                9655,
                9680
            ],
            [
                9689,
                9695
            ],
            [
                9695,
                9697
            ],
            [
                9704,
                9707
            ],
            [
                9708,
                9711
            ],
            [
                9725,
                9728
            ],
            [
                9734,
                9739
            ],
            [
                9739,
                9742
            ],
            [
                9747,
                9754
            ],
            [
                9760,
                9773
            ],
            [
                9777,
                9786
            ],
            [
                9793,
                9799
            ],
            [
                9804,
                9818
            ],
            [
                9818,
                9846
            ],
            [
                9846,
                9858
            ],
            [
                9860,
                9863
            ],
            [
                9864,
                9866
            ],
            [
                9867,
                9886
            ],
            [
                9886,
                9901
            ],
            [
                9907,
                9934
            ],
            [
                9935,
                9982
            ],
            [
                9982,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10085
            ],
            [
                10085,
                10104
            ],
            [
                10104,
                10128
            ],
            [
                10128,
                10131
            ],
            [
                10131,
                10132
            ],
            [
                10133,
                10146
            ],
            [
                10149,
                10151
            ],
            [
                10157,
                10218
            ],
            [
                10219,
                10239
            ],
            [
                10240,
                10295
            ],
            [
                10295,
                10297
            ],
            [
                10297,
                10344
            ],
            [
                10345,
                10420
            ],
            [
                10421,
                10503
            ],
            [
                10503,
                10523
            ],
            [
                10526,
                10540
            ],
            [
                10540,
                10542
            ],
            [
                10542,
                10581
            ],
            [
                10581,
                10617
            ],
            [
                10617,
                10676
            ],
            [
                10676,
                10678
            ],
            [
                10678,
                10710
            ],
            [
                10710,
                10711
            ],
            [
                10712,
                10742
            ],
            [
                10742,
                10832
            ],
            [
                10832,
                10877
            ],
            [
                10877,
                10910
            ],
            [
                10910,
                10913
            ],
            [
                10921,
                10973
            ],
            [
                10973,
                10975
            ],
            [
                10975,
                11020
            ],
            [
                11020,
                11032
            ],
            [
                11033,
                11039
            ],
            [
                11040,
                11050
            ],
            [
                11051,
                11105
            ],
            [
                11105,
                11149
            ],
            [
                11149,
                11235
            ],
            [
                11235,
                11262
            ],
            [
                11262,
                11321
            ],
            [
                11321,
                11376
            ],
            [
                11376,
                11424
            ],
            [
                11425,
                11432
            ],
            [
                11433,
                11436
            ],
            [
                11437,
                11444
            ],
            [
                11445,
                11461
            ],
            [
                11470,
                11499
            ],
            [
                11506,
                11541
            ],
            [
                11541,
                11560
            ],
            [
                11561,
                11586
            ],
            [
                11586,
                11622
            ],
            [
                11623,
                11630
            ],
            [
                11630,
                11657
            ],
            [
                11658,
                11681
            ],
            [
                11681,
                11763
            ],
            [
                11763,
                11822
            ],
            [
                11828,
                11854
            ],
            [
                11854,
                11896
            ],
            [
                11896,
                11943
            ],
            [
                11944,
                11975
            ],
            [
                11976,
                12037
            ],
            [
                12038,
                12062
            ],
            [
                12067,
                12076
            ],
            [
                12080,
                12086
            ],
            [
                12088,
                12132
            ],
            [
                12133,
                12149
            ],
            [
                12150,
                12175
            ],
            [
                12175,
                12218
            ],
            [
                12219,
                12244
            ],
            [
                12246,
                12301
            ],
            [
                12302,
                12349
            ],
            [
                12349,
                12439
            ],
            [
                12440,
                12454
            ],
            [
                12454,
                12456
            ],
            [
                12456,
                12594
            ],
            [
                12594,
                12595
            ],
            [
                12601,
                12611
            ],
            [
                12614,
                12652
            ],
            [
                12655,
                12713
            ],
            [
                12716,
                12723
            ],
            [
                12724,
                12728
            ],
            [
                12729,
                12735
            ],
            [
                12738,
                12742
            ],
            [
                12745,
                12785
            ],
            [
                12785,
                12806
            ],
            [
                12806,
                12808
            ],
            [
                12808,
                12840
            ],
            [
                12843,
                12925
            ],
            [
                12925,
                12939
            ],
            [
                12939,
                12954
            ],
            [
                12955,
                12981
            ],
            [
                12989,
                12994
            ],
            [
                13003,
                13017
            ],
            [
                13028,
                13036
            ],
            [
                13036,
                13083
            ],
            [
                13088,
                13091
            ],
            [
                13100,
                13154
            ],
            [
                13157,
                13178
            ],
            [
                13178,
                13219
            ],
            [
                13219,
                13220
            ],
            [
                13221,
                13242
            ],
            [
                13242,
                13243
            ],
            [
                13244,
                13260
            ],
            [
                13265,
                13274
            ],
            [
                13281,
                13284
            ],
            [
                13293,
                13304
            ],
            [
                13304,
                13306
            ],
            [
                13306,
                13454
            ],
            [
                13454,
                13469
            ],
            [
                13470,
                13475
            ],
            [
                13478,
                13487
            ],
            [
                13487,
                13547
            ],
            [
                13548,
                13551
            ],
            [
                13583,
                13585
            ],
            [
                13585,
                13606
            ],
            [
                13607,
                13610
            ],
            [
                13615,
                13644
            ],
            [
                13645,
                13764
            ],
            [
                13765,
                13791
            ],
            [
                13792,
                13795
            ],
            [
                13796,
                13805
            ],
            [
                13814,
                13839
            ],
            [
                13839,
                13865
            ],
            [
                13865,
                13900
            ],
            [
                13902,
                13915
            ],
            [
                13920,
                13943
            ],
            [
                13943,
                13999
            ],
            [
                13999,
                14080
            ],
            [
                14083,
                14087
            ],
            [
                14088,
                14120
            ],
            [
                14123,
                14180
            ],
            [
                14181,
                14195
            ],
            [
                14202,
                14206
            ],
            [
                14211,
                14216
            ],
            [
                14225,
                14260
            ],
            [
                14272,
                14295
            ],
            [
                14299,
                14309
            ],
            [
                14309,
                14321
            ],
            [
                14322,
                14361
            ],
            [
                14361,
                14431
            ],
            [
                14431,
                14483
            ],
            [
                14484,
                14489
            ],
            [
                14492,
                14502
            ],
            [
                14502,
                14512
            ],
            [
                14522,
                14617
            ],
            [
                14618,
                14666
            ],
            [
                14666,
                14676
            ],
            [
                14677,
                14699
            ],
            [
                14700,
                14717
            ],
            [
                14718,
                14744
            ],
            [
                14756,
                14773
            ],
            [
                14774,
                14815
            ],
            [
                14816,
                14830
            ],
            [
                14849,
                14893
            ],
            [
                14894,
                14898
            ],
            [
                14899,
                14963
            ],
            [
                14970,
                14978
            ],
            [
                14979,
                15004
            ],
            [
                15004,
                15026
            ],
            [
                15026,
                15064
            ],
            [
                15069,
                15076
            ],
            [
                15077,
                15083
            ],
            [
                15084,
                15089
            ],
            [
                15090,
                15093
            ],
            [
                15094,
                15112
            ],
            [
                15113,
                15127
            ],
            [
                15127,
                15137
            ],
            [
                15138,
                15144
            ],
            [
                15145,
                15151
            ],
            [
                15156,
                15193
            ],
            [
                15200,
                15266
            ],
            [
                15266,
                15322
            ],
            [
                15323,
                15336
            ],
            [
                15336,
                15347
            ],
            [
                15347,
                15373
            ],
            [
                15373,
                15382
            ],
            [
                15390,
                15392
            ],
            [
                15392,
                15497
            ],
            [
                15497,
                15527
            ],
            [
                15527,
                15571
            ],
            [
                15571,
                15627
            ],
            [
                15627,
                15640
            ],
            [
                15640,
                15665
            ],
            [
                15665,
                15675
            ],
            [
                15676,
                15688
            ],
            [
                15698,
                15733
            ],
            [
                15734,
                15816
            ],
            [
                15816,
                15887
            ],
            [
                15888,
                15898
            ],
            [
                15898,
                15933
            ],
            [
                15933,
                15966
            ],
            [
                15966,
                16055
            ],
            [
                16056,
                16123
            ],
            [
                16123,
                16130
            ],
            [
                16130,
                16150
            ],
            [
                16150,
                16171
            ],
            [
                16172,
                16207
            ],
            [
                16207,
                16227
            ],
            [
                16228,
                16317
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                190
            ],
            [
                190,
                250
            ],
            [
                250,
                362
            ],
            [
                362,
                362
            ],
            [
                362,
                362
            ],
            [
                362,
                441
            ],
            [
                441,
                483
            ],
            [
                483,
                552
            ],
            [
                552,
                624
            ],
            [
                624,
                751
            ],
            [
                751,
                841
            ],
            [
                841,
                882
            ],
            [
                882,
                972
            ],
            [
                972,
                1082
            ],
            [
                1082,
                1092
            ],
            [
                1092,
                1215
            ],
            [
                1215,
                1341
            ],
            [
                1341,
                1525
            ],
            [
                1525,
                1635
            ],
            [
                1635,
                1668
            ],
            [
                1668,
                1839
            ],
            [
                1839,
                1839
            ],
            [
                1839,
                1879
            ],
            [
                1879,
                2019
            ],
            [
                2019,
                2095
            ],
            [
                2095,
                2198
            ],
            [
                2198,
                2246
            ],
            [
                2246,
                2342
            ],
            [
                2342,
                2417
            ],
            [
                2417,
                2473
            ],
            [
                2473,
                2546
            ],
            [
                2546,
                2755
            ],
            [
                2755,
                2843
            ],
            [
                2843,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2883
            ],
            [
                2883,
                2923
            ],
            [
                2923,
                2984
            ],
            [
                2984,
                3172
            ],
            [
                3172,
                3271
            ],
            [
                3271,
                3459
            ],
            [
                3459,
                3542
            ],
            [
                3542,
                3624
            ],
            [
                3624,
                3704
            ],
            [
                3704,
                3746
            ],
            [
                3746,
                3959
            ],
            [
                3959,
                4179
            ],
            [
                4179,
                4179
            ],
            [
                4179,
                4179
            ],
            [
                4179,
                4484
            ],
            [
                4484,
                4523
            ],
            [
                4523,
                4617
            ],
            [
                4617,
                4712
            ],
            [
                4712,
                4743
            ],
            [
                4743,
                4763
            ],
            [
                4763,
                4763
            ],
            [
                4763,
                4763
            ],
            [
                4763,
                4932
            ],
            [
                4932,
                5039
            ],
            [
                5039,
                5078
            ],
            [
                5078,
                5251
            ],
            [
                5251,
                5351
            ],
            [
                5351,
                5627
            ],
            [
                5627,
                5902
            ],
            [
                5902,
                5943
            ],
            [
                5943,
                6000
            ],
            [
                6000,
                6114
            ],
            [
                6114,
                6177
            ],
            [
                6177,
                6295
            ],
            [
                6295,
                6436
            ],
            [
                6436,
                6492
            ],
            [
                6492,
                6531
            ],
            [
                6531,
                6713
            ],
            [
                6713,
                6713
            ],
            [
                6713,
                6849
            ],
            [
                6849,
                6936
            ],
            [
                6936,
                7060
            ],
            [
                7060,
                7188
            ],
            [
                7188,
                7332
            ],
            [
                7332,
                7453
            ],
            [
                7453,
                7624
            ],
            [
                7624,
                7760
            ],
            [
                7760,
                7877
            ],
            [
                7877,
                7926
            ],
            [
                7926,
                7997
            ],
            [
                7997,
                8199
            ],
            [
                8199,
                8374
            ],
            [
                8374,
                8374
            ],
            [
                8374,
                8448
            ],
            [
                8448,
                8611
            ],
            [
                8611,
                8639
            ],
            [
                8639,
                8789
            ],
            [
                8789,
                9000
            ],
            [
                9000,
                9022
            ],
            [
                9022,
                9101
            ],
            [
                9101,
                9177
            ],
            [
                9177,
                9206
            ],
            [
                9206,
                9206
            ],
            [
                9206,
                9248
            ],
            [
                9248,
                9454
            ],
            [
                9454,
                9468
            ],
            [
                9468,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9517
            ],
            [
                9517,
                9607
            ],
            [
                9607,
                9697
            ],
            [
                9697,
                9739
            ],
            [
                9739,
                9818
            ],
            [
                9818,
                9846
            ],
            [
                9846,
                9886
            ],
            [
                9886,
                9982
            ],
            [
                9982,
                10025
            ],
            [
                10025,
                10057
            ],
            [
                10057,
                10085
            ],
            [
                10085,
                10104
            ],
            [
                10104,
                10128
            ],
            [
                10128,
                10297
            ],
            [
                10297,
                10345
            ],
            [
                10345,
                10345
            ],
            [
                10345,
                10503
            ],
            [
                10503,
                10542
            ],
            [
                10542,
                10581
            ],
            [
                10581,
                10617
            ],
            [
                10617,
                10678
            ],
            [
                10678,
                10742
            ],
            [
                10742,
                10742
            ],
            [
                10742,
                10832
            ],
            [
                10832,
                10877
            ],
            [
                10877,
                10910
            ],
            [
                10910,
                10975
            ],
            [
                10975,
                11020
            ],
            [
                11020,
                11105
            ],
            [
                11105,
                11149
            ],
            [
                11149,
                11235
            ],
            [
                11235,
                11262
            ],
            [
                11262,
                11321
            ],
            [
                11321,
                11376
            ],
            [
                11376,
                11499
            ],
            [
                11499,
                11541
            ],
            [
                11541,
                11586
            ],
            [
                11586,
                11630
            ],
            [
                11630,
                11681
            ],
            [
                11681,
                11763
            ],
            [
                11763,
                11854
            ],
            [
                11854,
                11896
            ],
            [
                11896,
                11976
            ],
            [
                11976,
                12133
            ],
            [
                12133,
                12175
            ],
            [
                12175,
                12246
            ],
            [
                12246,
                12349
            ],
            [
                12349,
                12456
            ],
            [
                12456,
                12456
            ],
            [
                12456,
                12596
            ],
            [
                12596,
                12785
            ],
            [
                12785,
                12808
            ],
            [
                12808,
                12925
            ],
            [
                12925,
                12939
            ],
            [
                12939,
                13036
            ],
            [
                13036,
                13154
            ],
            [
                13154,
                13178
            ],
            [
                13178,
                13306
            ],
            [
                13306,
                13454
            ],
            [
                13454,
                13585
            ],
            [
                13585,
                13839
            ],
            [
                13839,
                13865
            ],
            [
                13865,
                13943
            ],
            [
                13943,
                13999
            ],
            [
                13999,
                14181
            ],
            [
                14181,
                14309
            ],
            [
                14309,
                14361
            ],
            [
                14361,
                14431
            ],
            [
                14431,
                14666
            ],
            [
                14666,
                14774
            ],
            [
                14774,
                14774
            ],
            [
                14774,
                15004
            ],
            [
                15004,
                15026
            ],
            [
                15026,
                15113
            ],
            [
                15113,
                15193
            ],
            [
                15193,
                15266
            ],
            [
                15266,
                15336
            ],
            [
                15336,
                15347
            ],
            [
                15347,
                15373
            ],
            [
                15373,
                15392
            ],
            [
                15392,
                15497
            ],
            [
                15497,
                15527
            ],
            [
                15527,
                15571
            ],
            [
                15571,
                15627
            ],
            [
                15627,
                15640
            ],
            [
                15640,
                15665
            ],
            [
                15665,
                15816
            ],
            [
                15816,
                15898
            ],
            [
                15898,
                15933
            ],
            [
                15933,
                15966
            ],
            [
                15966,
                16056
            ],
            [
                16056,
                16123
            ],
            [
                16123,
                16130
            ],
            [
                16130,
                16150
            ],
            [
                16150,
                16207
            ],
            [
                16207,
                16317
            ]
        ]
    }
}