{
    "original": {
        "text": "I suppose there is no man in this Vanity Fair of ours so little observant as not to think sometimes about the worldly affairs of his acquaintances, or so extremely charitable as not to wonder how his neighbour Jones, or his neighbour Smith, can make both ends meet at the end of the year. With the utmost regard for the family, for instance (for I dine with them twice or thrice in the season), I cannot but own that the appearance of the Jenkinses in the park, in the large barouche with the grenadier-footmen, will surprise and mystify me to my dying day: for though I know the equipage is only jobbed, and all the Jenkins people are on board wages, yet those three men and the carriage must represent an expense of six hundred a year at the very least--and then there are the splendid dinners, the two boys at Eton, the prize governess and masters for the girls, the trip abroad, or to Eastbourne or Worthing, in the autumn, the annual ball with a supper from Gunter's (who, by the way, supplies most of the first-rate dinners which J. gives, as I know very well, having been invited to one of them to fill a vacant place, when I saw at once that these repasts are very superior to the common run of entertainments for which the humbler sort of J.'s acquaintances get cards)--who, I say, with the most good-natured feelings in the world, can help wondering how the Jenkinses make out matters? What is Jenkins? We all know--Commissioner of the Tape and Sealing Wax Office, with 1200 pounds a year for a salary. Had his wife a private fortune? Pooh!--Miss Flint--one of eleven children of a small squire in Buckinghamshire. All she ever gets from her family is a turkey at Christmas, in exchange for which she has to board two or three of her sisters in the off season, and lodge and feed her brothers when they come to town. How does Jenkins balance his income? I say, as every friend of his must say, How is it that he has not been outlawed long since, and that he ever came back (as he did to the surprise of everybody) last year from Boulogne?\n\"I\" is here introduced to personify the world in general--the Mrs. Grundy of each respected reader's private circle--every one of whom can point to some families of his acquaintance who live nobody knows how. Many a glass of wine have we all of us drunk, I have very little doubt, hob-and-nobbing with the hospitable giver and wondering how the deuce he paid for it.\nSome three or four years after his stay in Paris, when Rawdon Crawley and his wife were established in a very small comfortable house in Curzon Street, May Fair, there was scarcely one of the numerous friends whom they entertained at dinner that did not ask the above question regarding them. The novelist, it has been said before, knows everything, and as I am in a situation to be able to tell the public how Crawley and his wife lived without any income, may I entreat the public newspapers which are in the habit of extracting portions of the various periodical works now published not to reprint the following exact narrative and calculations--of which I ought, as the discoverer (and at some expense, too), to have the benefit? My son, I would say, were I blessed with a child--you may by deep inquiry and constant intercourse with him learn how a man lives comfortably on nothing a year. But it is best not to be intimate with gentlemen of this profession and to take the calculations at second hand, as you do logarithms, for to work them yourself, depend upon it, will cost you something considerable.\nOn nothing per annum then, and during a course of some two or three years, of which we can afford to give but a very brief history, Crawley and his wife lived very happily and comfortably at Paris. It was in this period that he quitted the Guards and sold out of the army. When we find him again, his mustachios and the title of Colonel on his card are the only relics of his military profession.\nIt has been mentioned that Rebecca, soon after her arrival in Paris, took a very smart and leading position in the society of that capital, and was welcomed at some of the most distinguished houses of the restored French nobility. The English men of fashion in Paris courted her, too, to the disgust of the ladies their wives, who could not bear the parvenue. For some months the salons of the Faubourg St. Germain, in which her place was secured, and the splendours of the new Court, where she was received with much distinction, delighted and perhaps a little intoxicated Mrs. Crawley, who may have been disposed during this period of elation to slight the people--honest young military men mostly--who formed her husband's chief society.\nBut the Colonel yawned sadly among the Duchesses and great ladies of the Court. The old women who played ecarte made such a noise about a five-franc piece that it was not worth Colonel Crawley's while to sit down at a card-table. The wit of their conversation he could not appreciate, being ignorant of their language. And what good could his wife get, he urged, by making curtsies every night to a whole circle of Princesses? He left Rebecca presently to frequent these parties alone, resuming his own simple pursuits and amusements amongst the amiable friends of his own choice.\nThe truth is, when we say of a gentleman that he lives elegantly on nothing a year, we use the word \"nothing\" to signify something unknown; meaning, simply, that we don't know how the gentleman in question defrays the expenses of his establishment. Now, our friend the Colonel had a great aptitude for all games of chance: and exercising himself, as he continually did, with the cards, the dice-box, or the cue, it is natural to suppose that he attained a much greater skill in the use of these articles than men can possess who only occasionally handle them. To use a cue at billiards well is like using a pencil, or a German flute, or a small-sword--you cannot master any one of these implements at first, and it is only by repeated study and perseverance, joined to a natural taste, that a man can excel in the handling of either. Now Crawley, from being only a brilliant amateur, had grown to be a consummate master of billiards. Like a great General, his genius used to rise with the danger, and when the luck had been unfavourable to him for a whole game, and the bets were consequently against him, he would, with consummate skill and boldness, make some prodigious hits which would restore the battle, and come in a victor at the end, to the astonishment of everybody--of everybody, that is, who was a stranger to his play. Those who were accustomed to see it were cautious how they staked their money against a man of such sudden resources and brilliant and overpowering skill.\nAt games of cards he was equally skilful; for though he would constantly lose money at the commencement of an evening, playing so carelessly and making such blunders, that newcomers were often inclined to think meanly of his talent; yet when roused to action and awakened to caution by repeated small losses, it was remarked that Crawley's play became quite different, and that he was pretty sure of beating his enemy thoroughly before the night was over. Indeed, very few men could say that they ever had the better of him. His successes were so repeated that no wonder the envious and the vanquished spoke sometimes with bitterness regarding them. And as the French say of the Duke of Wellington, who never suffered a defeat, that only an astonishing series of lucky accidents enabled him to be an invariable winner; yet even they allow that he cheated at Waterloo, and was enabled to win the last great trick: so it was hinted at headquarters in England that some foul play must have taken place in order to account for the continuous successes of Colonel Crawley.\nThough Frascati's and the Salon were open at that time in Paris, the mania for play was so widely spread that the public gambling-rooms did not suffice for the general ardour, and gambling went on in private houses as much as if there had been no public means for gratifying the passion. At Crawley's charming little reunions of an evening this fatal amusement commonly was practised--much to good-natured little Mrs. Crawley's annoyance. She spoke about her husband's passion for dice with the deepest grief; she bewailed it to everybody who came to her house. She besought the young fellows never, never to touch a box; and when young Green, of the Rifles, lost a very considerable sum of money, Rebecca passed a whole night in tears, as the servant told the unfortunate young gentleman, and actually went on her knees to her husband to beseech him to remit the debt, and burn the acknowledgement. How could he? He had lost just as much himself to Blackstone of the Hussars, and Count Punter of the Hanoverian Cavalry. Green might have any decent time; but pay?--of course he must pay; to talk of burning IOU's was child's play.\nOther officers, chiefly young--for the young fellows gathered round Mrs. Crawley--came from her parties with long faces, having dropped more or less money at her fatal card-tables. Her house began to have an unfortunate reputation. The old hands warned the less experienced of their danger. Colonel O'Dowd, of the --th regiment, one of those occupying in Paris, warned Lieutenant Spooney of that corps. A loud and violent fracas took place between the infantry Colonel and his lady, who were dining at the Cafe de Paris, and Colonel and Mrs. Crawley; who were also taking their meal there. The ladies engaged on both sides. Mrs. O'Dowd snapped her fingers in Mrs. Crawley's face and called her husband \"no betther than a black-leg.\" Colonel Crawley challenged Colonel O'Dowd, C.B. The Commander-in-Chief hearing of the dispute sent for Colonel Crawley, who was getting ready the same pistols \"which he shot Captain Marker,\" and had such a conversation with him that no duel took place. If Rebecca had not gone on her knees to General Tufto, Crawley would have been sent back to England; and he did not play, except with civilians, for some weeks after.\nBut, in spite of Rawdon's undoubted skill and constant successes, it became evident to Rebecca, considering these things, that their position was but a precarious one, and that, even although they paid scarcely anybody, their little capital would end one day by dwindling into zero. \"Gambling,\" she would say, \"dear, is good to help your income, but not as an income itself. Some day people may be tired of play, and then where are we?\" Rawdon acquiesced in the justice of her opinion; and in truth he had remarked that after a few nights of his little suppers, &c., gentlemen were tired of play with him, and, in spite of Rebecca's charms, did not present themselves very eagerly.\nEasy and pleasant as their life at Paris was, it was after all only an idle dalliance and amiable trifling; and Rebecca saw that she must push Rawdon's fortune in their own country. She must get him a place or appointment at home or in the colonies, and she determined to make a move upon England as soon as the way could be cleared for her. As a first step she had made Crawley sell out of the Guards and go on half-pay. His function as aide-de-camp to General Tufto had ceased previously. Rebecca laughed in all companies at that officer, at his toupee (which he mounted on coming to Paris), at his waistband, at his false teeth, at his pretensions to be a lady-killer above all, and his absurd vanity in fancying every woman whom he came near was in love with him. It was to Mrs. Brent, the beetle-browed wife of Mr. Commissary Brent, to whom the general transferred his attentions now--his bouquets, his dinners at the restaurateurs', his opera-boxes, and his knick-knacks. Poor Mrs. Tufto was no more happy than before, and had still to pass long evenings alone with her daughters, knowing that her General was gone off scented and curled to stand behind Mrs. Brent's chair at the play. Becky had a dozen admirers in his place, to be sure, and could cut her rival to pieces with her wit. But, as we have said, she was growing tired of this idle social life: opera-boxes and restaurateur dinners palled upon her: nosegays could not be laid by as a provision for future years: and she could not live upon knick-knacks, laced handkerchiefs, and kid gloves. She felt the frivolity of pleasure and longed for more substantial benefits.\nAt this juncture news arrived which was spread among the many creditors of the Colonel at Paris, and which caused them great satisfaction. Miss Crawley, the rich aunt from whom he expected his immense inheritance, was dying; the Colonel must haste to her bedside. Mrs. Crawley and her child would remain behind until he came to reclaim them. He departed for Calais, and having reached that place in safety, it might have been supposed that he went to Dover; but instead he took the diligence to Dunkirk, and thence travelled to Brussels, for which place he had a former predilection. The fact is, he owed more money at London than at Paris; and he preferred the quiet little Belgian city to either of the more noisy capitals.\nHer aunt was dead. Mrs. Crawley ordered the most intense mourning for herself and little Rawdon. The Colonel was busy arranging the affairs of the inheritance. They could take the premier now, instead of the little entresol of the hotel which they occupied. Mrs. Crawley and the landlord had a consultation about the new hangings, an amicable wrangle about the carpets, and a final adjustment of everything except the bill. She went off in one of his carriages; her French bonne with her; the child by her side; the admirable landlord and landlady smiling farewell to her from the gate. General Tufto was furious when he heard she was gone, and Mrs. Brent furious with him for being furious; Lieutenant Spooney was cut to the heart; and the landlord got ready his best apartments previous to the return of the fascinating little woman and her husband. He _serred_ the trunks which she left in his charge with the greatest care. They had been especially recommended to him by Madame Crawley. They were not, however, found to be particularly valuable when opened some time after.\nBut before she went to join her husband in the Belgic capital, Mrs. Crawley made an expedition into England, leaving behind her her little son upon the continent, under the care of her French maid.\nThe parting between Rebecca and the little Rawdon did not cause either party much pain. She had not, to say truth, seen much of the young gentleman since his birth. After the amiable fashion of French mothers, she had placed him out at nurse in a village in the neighbourhood of Paris, where little Rawdon passed the first months of his life, not unhappily, with a numerous family of foster-brothers in wooden shoes. His father would ride over many a time to see him here, and the elder Rawdon's paternal heart glowed to see him rosy and dirty, shouting lustily, and happy in the making of mud-pies under the superintendence of the gardener's wife, his nurse.\nRebecca did not care much to go and see the son and heir. Once he spoiled a new dove-coloured pelisse of hers. He preferred his nurse's caresses to his mamma's, and when finally he quitted that jolly nurse and almost parent, he cried loudly for hours. He was only consoled by his mother's promise that he should return to his nurse the next day; indeed the nurse herself, who probably would have been pained at the parting too, was told that the child would immediately be restored to her, and for some time awaited quite anxiously his return.\nIn fact, our friends may be said to have been among the first of that brood of hardy English adventurers who have subsequently invaded the Continent and swindled in all the capitals of Europe. The respect in those happy days of 1817-18 was very great for the wealth and honour of Britons. They had not then learned, as I am told, to haggle for bargains with the pertinacity which now distinguishes them. The great cities of Europe had not been as yet open to the enterprise of our rascals. And whereas there is now hardly a town of France or Italy in which you shall not see some noble countryman of our own, with that happy swagger and insolence of demeanour which we carry everywhere, swindling inn-landlords, passing fictitious cheques upon credulous bankers, robbing coach-makers of their carriages, goldsmiths of their trinkets, easy travellers of their money at cards, even public libraries of their books--thirty years ago you needed but to be a Milor Anglais, travelling in a private carriage, and credit was at your hand wherever you chose to seek it, and gentlemen, instead of cheating, were cheated. It was not for some weeks after the Crawleys' departure that the landlord of the hotel which they occupied during their residence at Paris found out the losses which he had sustained: not until Madame Marabou, the milliner, made repeated visits with her little bill for articles supplied to Madame Crawley; not until Monsieur Didelot from Boule d'Or in the Palais Royal had asked half a dozen times whether cette charmante Miladi who had bought watches and bracelets of him was de retour. It is a fact that even the poor gardener's wife, who had nursed madame's child, was never paid after the first six months for that supply of the milk of human kindness with which she had furnished the lusty and healthy little Rawdon. No, not even the nurse was paid--the Crawleys were in too great a hurry to remember their trifling debt to her. As for the landlord of the hotel, his curses against the English nation were violent for the rest of his natural life. He asked all travellers whether they knew a certain Colonel Lor Crawley--avec sa femme une petite dame, tres spirituelle. \"Ah, Monsieur!\" he would add--\"ils m'ont affreusement vole.\" It was melancholy to hear his accents as he spoke of that catastrophe.\nRebecca's object in her journey to London was to effect a kind of compromise with her husband's numerous creditors, and by offering them a dividend of ninepence or a shilling in the pound, to secure a return for him into his own country. It does not become us to trace the steps which she took in the conduct of this most difficult negotiation; but, having shown them to their satisfaction that the sum which she was empowered to offer was all her husband's available capital, and having convinced them that Colonel Crawley would prefer a perpetual retirement on the Continent to a residence in this country with his debts unsettled; having proved to them that there was no possibility of money accruing to him from other quarters, and no earthly chance of their getting a larger dividend than that which she was empowered to offer, she brought the Colonel's creditors unanimously to accept her proposals, and purchased with fifteen hundred pounds of ready money more than ten times that amount of debts.\nMrs. Crawley employed no lawyer in the transaction. The matter was so simple, to have or to leave, as she justly observed, that she made the lawyers of the creditors themselves do the business. And Mr. Lewis representing Mr. Davids, of Red Lion Square, and Mr. Moss acting for Mr. Manasseh of Cursitor Street (chief creditors of the Colonel's), complimented his lady upon the brilliant way in which she did business, and declared that there was no professional man who could beat her.\nRebecca received their congratulations with perfect modesty; ordered a bottle of sherry and a bread cake to the little dingy lodgings where she dwelt, while conducting the business, to treat the enemy's lawyers: shook hands with them at parting, in excellent good humour, and returned straightway to the Continent, to rejoin her husband and son and acquaint the former with the glad news of his entire liberation. As for the latter, he had been considerably neglected during his mother's absence by Mademoiselle Genevieve, her French maid; for that young woman, contracting an attachment for a soldier in the garrison of Calais, forgot her charge in the society of this militaire, and little Rawdon very narrowly escaped drowning on Calais sands at this period, where the absent Genevieve had left and lost him.\nAnd so, Colonel and Mrs. Crawley came to London: and it is at their house in Curzon Street, May Fair, that they really showed the skill which must be possessed by those who would live on the resources above named.",
        "paragraph_chars": [
            [
                0,
                2049
            ],
            [
                2049,
                2416
            ],
            [
                2416,
                3527
            ],
            [
                3527,
                3924
            ],
            [
                3924,
                4665
            ],
            [
                4665,
                5246
            ],
            [
                5246,
                6733
            ],
            [
                6733,
                7801
            ],
            [
                7801,
                8932
            ],
            [
                8932,
                10085
            ],
            [
                10085,
                10767
            ],
            [
                10767,
                12403
            ],
            [
                12403,
                13129
            ],
            [
                13129,
                14207
            ],
            [
                14207,
                14405
            ],
            [
                14405,
                15065
            ],
            [
                15065,
                15609
            ],
            [
                15609,
                17928
            ],
            [
                17928,
                18933
            ],
            [
                18933,
                19418
            ],
            [
                19418,
                20230
            ],
            [
                20230,
                20443
            ]
        ],
        "segment_chars": [
            [
                0,
                289
            ],
            [
                289,
                1250
            ],
            [
                1250,
                1396
            ],
            [
                1396,
                1413
            ],
            [
                1413,
                1513
            ],
            [
                1513,
                1545
            ],
            [
                1545,
                1625
            ],
            [
                1625,
                1827
            ],
            [
                1827,
                1864
            ],
            [
                1864,
                2049
            ],
            [
                2049,
                2258
            ],
            [
                2258,
                2416
            ],
            [
                2416,
                2709
            ],
            [
                2709,
                3150
            ],
            [
                3150,
                3311
            ],
            [
                3311,
                3527
            ],
            [
                3527,
                3725
            ],
            [
                3725,
                3800
            ],
            [
                3800,
                3924
            ],
            [
                3924,
                4155
            ],
            [
                4155,
                4284
            ],
            [
                4284,
                4665
            ],
            [
                4665,
                4745
            ],
            [
                4745,
                4895
            ],
            [
                4895,
                4984
            ],
            [
                4984,
                5092
            ],
            [
                5092,
                5246
            ],
            [
                5246,
                5495
            ],
            [
                5495,
                5806
            ],
            [
                5806,
                6080
            ],
            [
                6080,
                6180
            ],
            [
                6180,
                6578
            ],
            [
                6578,
                6733
            ],
            [
                6733,
                7189
            ],
            [
                7189,
                7258
            ],
            [
                7258,
                7383
            ],
            [
                7383,
                7801
            ],
            [
                7801,
                8089
            ],
            [
                8089,
                8240
            ],
            [
                8240,
                8363
            ],
            [
                8363,
                8701
            ],
            [
                8701,
                8715
            ],
            [
                8715,
                8822
            ],
            [
                8822,
                8932
            ],
            [
                8932,
                9113
            ],
            [
                9113,
                9164
            ],
            [
                9164,
                9223
            ],
            [
                9223,
                9335
            ],
            [
                9335,
                9522
            ],
            [
                9522,
                9556
            ],
            [
                9556,
                9665
            ],
            [
                9665,
                9713
            ],
            [
                9713,
                9918
            ],
            [
                9918,
                10085
            ],
            [
                10085,
                10368
            ],
            [
                10368,
                10460
            ],
            [
                10460,
                10522
            ],
            [
                10522,
                10767
            ],
            [
                10767,
                10949
            ],
            [
                10949,
                11109
            ],
            [
                11109,
                11189
            ],
            [
                11189,
                11258
            ],
            [
                11258,
                11535
            ],
            [
                11535,
                11745
            ],
            [
                11745,
                11959
            ],
            [
                11959,
                12060
            ],
            [
                12060,
                12326
            ],
            [
                12326,
                12403
            ],
            [
                12403,
                12542
            ],
            [
                12542,
                12667
            ],
            [
                12667,
                12745
            ],
            [
                12745,
                12987
            ],
            [
                12987,
                13129
            ],
            [
                13129,
                13148
            ],
            [
                13148,
                13226
            ],
            [
                13226,
                13289
            ],
            [
                13289,
                13387
            ],
            [
                13387,
                13553
            ],
            [
                13553,
                13716
            ],
            [
                13716,
                13981
            ],
            [
                13981,
                14057
            ],
            [
                14057,
                14120
            ],
            [
                14120,
                14207
            ],
            [
                14207,
                14405
            ],
            [
                14405,
                14493
            ],
            [
                14493,
                14570
            ],
            [
                14570,
                14822
            ],
            [
                14822,
                15065
            ],
            [
                15065,
                15123
            ],
            [
                15123,
                15176
            ],
            [
                15176,
                15317
            ],
            [
                15317,
                15609
            ],
            [
                15609,
                15802
            ],
            [
                15802,
                15898
            ],
            [
                15898,
                16013
            ],
            [
                16013,
                16099
            ],
            [
                16099,
                16720
            ],
            [
                16720,
                17209
            ],
            [
                17209,
                17443
            ],
            [
                17443,
                17555
            ],
            [
                17555,
                17674
            ],
            [
                17674,
                17796
            ],
            [
                17796,
                17812
            ],
            [
                17812,
                17857
            ],
            [
                17857,
                17928
            ],
            [
                17928,
                18166
            ],
            [
                18166,
                18933
            ],
            [
                18933,
                18985
            ],
            [
                18985,
                19127
            ],
            [
                19127,
                19418
            ],
            [
                19418,
                19832
            ],
            [
                19832,
                20230
            ],
            [
                20230,
                20443
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                34,
                45
            ],
            [
                77,
                80
            ],
            [
                90,
                99
            ],
            [
                185,
                199
            ],
            [
                245,
                249
            ],
            [
                255,
                264
            ],
            [
                287,
                289
            ],
            [
                289,
                319
            ],
            [
                439,
                446
            ],
            [
                320,
                340
            ],
            [
                460,
                461
            ],
            [
                346,
                347
            ],
            [
                412,
                434
            ],
            [
                469,
                510
            ],
            [
                530,
                534
            ],
            [
                538,
                540
            ],
            [
                556,
                561
            ],
            [
                656,
                661
            ],
            [
                668,
                693
            ],
            [
                718,
                754
            ],
            [
                1016,
                1017
            ],
            [
                756,
                838
            ],
            [
                851,
                869
            ],
            [
                875,
                882
            ],
            [
                526,
                529
            ],
            [
                928,
                943
            ],
            [
                1037,
                1038
            ],
            [
                1360,
                1363
            ],
            [
                1364,
                1377
            ],
            [
                1394,
                1396
            ],
            [
                1396,
                1413
            ],
            [
                1426,
                1498
            ],
            [
                1511,
                1513
            ],
            [
                1513,
                1545
            ],
            [
                1545,
                1549
            ],
            [
                1564,
                1604
            ],
            [
                1623,
                1625
            ],
            [
                1625,
                1683
            ],
            [
                1825,
                1827
            ],
            [
                1827,
                1863
            ],
            [
                2166,
                2178
            ],
            [
                2184,
                2210
            ],
            [
                2231,
                2258
            ],
            [
                2258,
                2290
            ],
            [
                2297,
                2303
            ],
            [
                2330,
                2333
            ],
            [
                2337,
                2354
            ],
            [
                2366,
                2416
            ],
            [
                2416,
                2577
            ],
            [
                2617,
                2624
            ],
            [
                2684,
                2692
            ],
            [
                2707,
                2709
            ],
            [
                2770,
                2777
            ],
            [
                2799,
                2909
            ],
            [
                3002,
                3030
            ],
            [
                3037,
                3046
            ],
            [
                3065,
                3073
            ],
            [
                3081,
                3126
            ],
            [
                3074,
                3081
            ],
            [
                3129,
                3150
            ],
            [
                3200,
                3223
            ],
            [
                3258,
                3309
            ],
            [
                3311,
                3378
            ],
            [
                3444,
                3449
            ],
            [
                3485,
                3487
            ],
            [
                3489,
                3527
            ],
            [
                3527,
                3552
            ],
            [
                3657,
                3725
            ],
            [
                3752,
                3754
            ],
            [
                3755,
                3800
            ],
            [
                3800,
                3924
            ],
            [
                3924,
                3999
            ],
            [
                4015,
                4034
            ],
            [
                4039,
                4046
            ],
            [
                4062,
                4083
            ],
            [
                4115,
                4121
            ],
            [
                4153,
                4155
            ],
            [
                4155,
                4181
            ],
            [
                4191,
                4202
            ],
            [
                4207,
                4226
            ],
            [
                4238,
                4273
            ],
            [
                4282,
                4284
            ],
            [
                4284,
                4303
            ],
            [
                4304,
                4310
            ],
            [
                4370,
                4397
            ],
            [
                4402,
                4407
            ],
            [
                4453,
                4510
            ],
            [
                4663,
                4665
            ],
            [
                4665,
                4730
            ],
            [
                4743,
                4745
            ],
            [
                5092,
                5107
            ],
            [
                5118,
                5120
            ],
            [
                5130,
                5174
            ],
            [
                5188,
                5206
            ],
            [
                5230,
                5233
            ],
            [
                5219,
                5226
            ],
            [
                5244,
                5246
            ],
            [
                5495,
                5499
            ],
            [
                5511,
                5572
            ],
            [
                5621,
                5631
            ],
            [
                5636,
                5640
            ],
            [
                5632,
                5635
            ],
            [
                5653,
                5656
            ],
            [
                5691,
                5699
            ],
            [
                5702,
                5706
            ],
            [
                5715,
                5723
            ],
            [
                5728,
                5731
            ],
            [
                5804,
                5806
            ],
            [
                6093,
                6129
            ],
            [
                6130,
                6180
            ],
            [
                6202,
                6241
            ],
            [
                6247,
                6251
            ],
            [
                6256,
                6325
            ],
            [
                6339,
                6360
            ],
            [
                6398,
                6418
            ],
            [
                6243,
                6246
            ],
            [
                6487,
                6491
            ],
            [
                6512,
                6521
            ],
            [
                6496,
                6508
            ],
            [
                6576,
                6577
            ],
            [
                6733,
                6735
            ],
            [
                6745,
                6773
            ],
            [
                6786,
                6823
            ],
            [
                6837,
                6851
            ],
            [
                6878,
                6889
            ],
            [
                6890,
                6898
            ],
            [
                6900,
                6919
            ],
            [
                6926,
                6964
            ],
            [
                6966,
                6991
            ],
            [
                6898,
                6899
            ],
            [
                7073,
                7101
            ],
            [
                6860,
                6862
            ],
            [
                7106,
                7189
            ],
            [
                7304,
                7366
            ],
            [
                7258,
                7271
            ],
            [
                7430,
                7431
            ],
            [
                7289,
                7293
            ],
            [
                7561,
                7565
            ],
            [
                7272,
                7276
            ],
            [
                7524,
                7526
            ],
            [
                7700,
                7709
            ],
            [
                7799,
                7801
            ],
            [
                7856,
                7864
            ],
            [
                7843,
                7855
            ],
            [
                7864,
                7865
            ],
            [
                7981,
                7997
            ],
            [
                7941,
                7944
            ],
            [
                7915,
                7921
            ],
            [
                7931,
                7936
            ],
            [
                7998,
                8015
            ],
            [
                8087,
                8089
            ],
            [
                8089,
                8117
            ],
            [
                8133,
                8140
            ],
            [
                8171,
                8174
            ],
            [
                8162,
                8170
            ],
            [
                8175,
                8184
            ],
            [
                8186,
                8206
            ],
            [
                8214,
                8240
            ],
            [
                8240,
                8249
            ],
            [
                8287,
                8291
            ],
            [
                8304,
                8309
            ],
            [
                8250,
                8286
            ],
            [
                8309,
                8363
            ],
            [
                8363,
                8399
            ],
            [
                8407,
                8415
            ],
            [
                8448,
                8451
            ],
            [
                8421,
                8443
            ],
            [
                8460,
                8466
            ],
            [
                8472,
                8536
            ],
            [
                8538,
                8540
            ],
            [
                8545,
                8589
            ],
            [
                8591,
                8669
            ],
            [
                8699,
                8701
            ],
            [
                8701,
                8715
            ],
            [
                8715,
                8747
            ],
            [
                8820,
                8822
            ],
            [
                8822,
                8838
            ],
            [
                8850,
                8859
            ],
            [
                8866,
                8887
            ],
            [
                8930,
                8932
            ],
            [
                9113,
                9164
            ],
            [
                9164,
                9221
            ],
            [
                9223,
                9237
            ],
            [
                9294,
                9319
            ],
            [
                9333,
                9335
            ],
            [
                9335,
                9371
            ],
            [
                9431,
                9437
            ],
            [
                9443,
                9451
            ],
            [
                9372,
                9379
            ],
            [
                9393,
                9400
            ],
            [
                9401,
                9413
            ],
            [
                9451,
                9481
            ],
            [
                9520,
                9522
            ],
            [
                9556,
                9665
            ],
            [
                9665,
                9706
            ],
            [
                9713,
                9735
            ],
            [
                9744,
                9746
            ],
            [
                9856,
                9859
            ],
            [
                9893,
                9918
            ],
            [
                9918,
                10085
            ],
            [
                10090,
                10126
            ],
            [
                10149,
                10160
            ],
            [
                10169,
                10179
            ],
            [
                10207,
                10230
            ],
            [
                10237,
                10247
            ],
            [
                10366,
                10367
            ],
            [
                10368,
                10396
            ],
            [
                10402,
                10434
            ],
            [
                10435,
                10438
            ],
            [
                10442,
                10460
            ],
            [
                10469,
                10479
            ],
            [
                10483,
                10522
            ],
            [
                10522,
                10528
            ],
            [
                10543,
                10546
            ],
            [
                10578,
                10583
            ],
            [
                10555,
                10557
            ],
            [
                10569,
                10570
            ],
            [
                10584,
                10590
            ],
            [
                10600,
                10646
            ],
            [
                10652,
                10661
            ],
            [
                10726,
                10767
            ],
            [
                10879,
                10904
            ],
            [
                10958,
                10961
            ],
            [
                10910,
                10916
            ],
            [
                10966,
                10973
            ],
            [
                10989,
                11015
            ],
            [
                11107,
                11109
            ],
            [
                11109,
                11137
            ],
            [
                11146,
                11189
            ],
            [
                11205,
                11234
            ],
            [
                11256,
                11258
            ],
            [
                11258,
                11273
            ],
            [
                11291,
                11321
            ],
            [
                11377,
                11378
            ],
            [
                11382,
                11398
            ],
            [
                11449,
                11452
            ],
            [
                11402,
                11437
            ],
            [
                11533,
                11535
            ],
            [
                11613,
                11624
            ],
            [
                11625,
                11651
            ],
            [
                11542,
                11556
            ],
            [
                11657,
                11682
            ],
            [
                11603,
                11604
            ],
            [
                11706,
                11744
            ],
            [
                11959,
                12060
            ],
            [
                12060,
                12063
            ],
            [
                12130,
                12145
            ],
            [
                12159,
                12192
            ],
            [
                12199,
                12202
            ],
            [
                12217,
                12287
            ],
            [
                12324,
                12326
            ],
            [
                12326,
                12329
            ],
            [
                12365,
                12403
            ],
            [
                12420,
                12432
            ],
            [
                12542,
                12554
            ],
            [
                12617,
                12667
            ],
            [
                12667,
                12727
            ],
            [
                12739,
                12745
            ],
            [
                12748,
                12768
            ],
            [
                12861,
                12872
            ],
            [
                13101,
                13103
            ],
            [
                12851,
                12859
            ],
            [
                12998,
                13002
            ],
            [
                12941,
                12944
            ],
            [
                12931,
                12940
            ],
            [
                12788,
                12792
            ],
            [
                13065,
                13077
            ],
            [
                13086,
                13090
            ],
            [
                12957,
                12963
            ],
            [
                13029,
                13033
            ],
            [
                12799,
                12801
            ],
            [
                13127,
                13129
            ],
            [
                13148,
                13226
            ],
            [
                13226,
                13241
            ],
            [
                13320,
                13321
            ],
            [
                13305,
                13316
            ],
            [
                13356,
                13365
            ],
            [
                13289,
                13293
            ],
            [
                13322,
                13336
            ],
            [
                13385,
                13387
            ],
            [
                13417,
                13420
            ],
            [
                13460,
                13479
            ],
            [
                13404,
                13416
            ],
            [
                13436,
                13441
            ],
            [
                13490,
                13497
            ],
            [
                13400,
                13403
            ],
            [
                13446,
                13458
            ],
            [
                13497,
                13553
            ],
            [
                13553,
                13589
            ],
            [
                13608,
                13616
            ],
            [
                13595,
                13601
            ],
            [
                13591,
                13594
            ],
            [
                13622,
                13627
            ],
            [
                13616,
                13621
            ],
            [
                13655,
                13715
            ],
            [
                13716,
                13784
            ],
            [
                13785,
                13882
            ],
            [
                13889,
                13897
            ],
            [
                13883,
                13888
            ],
            [
                13968,
                13971
            ],
            [
                13925,
                13931
            ],
            [
                13979,
                13981
            ],
            [
                13981,
                13983
            ],
            [
                13993,
                14057
            ],
            [
                14120,
                14207
            ],
            [
                14211,
                14249
            ],
            [
                14268,
                14323
            ],
            [
                14335,
                14349
            ],
            [
                14324,
                14330
            ],
            [
                14370,
                14405
            ],
            [
                14405,
                14475
            ],
            [
                14482,
                14493
            ],
            [
                14493,
                14504
            ],
            [
                14520,
                14532
            ],
            [
                14553,
                14570
            ],
            [
                14570,
                14659
            ],
            [
                14689,
                14822
            ],
            [
                14822,
                14848
            ],
            [
                14861,
                14863
            ],
            [
                14868,
                14871
            ],
            [
                14876,
                14900
            ],
            [
                14910,
                15003
            ],
            [
                15063,
                15065
            ],
            [
                15065,
                15104
            ],
            [
                15109,
                15112
            ],
            [
                15121,
                15123
            ],
            [
                15123,
                15176
            ],
            [
                15176,
                15270
            ],
            [
                15288,
                15317
            ],
            [
                15317,
                15383
            ],
            [
                15397,
                15427
            ],
            [
                15488,
                15491
            ],
            [
                15493,
                15522
            ],
            [
                15535,
                15572
            ],
            [
                15587,
                15596
            ],
            [
                15573,
                15580
            ],
            [
                15597,
                15609
            ],
            [
                16522,
                16538
            ],
            [
                16111,
                16116
            ],
            [
                15845,
                15848
            ],
            [
                15854,
                15859
            ],
            [
                15806,
                15816
            ],
            [
                16033,
                16039
            ],
            [
                15860,
                15867
            ],
            [
                15879,
                15885
            ],
            [
                15875,
                15878
            ],
            [
                15868,
                15874
            ],
            [
                15886,
                15897
            ],
            [
                16539,
                16549
            ],
            [
                16554,
                16625
            ],
            [
                16639,
                16657
            ],
            [
                16718,
                16720
            ],
            [
                16720,
                16796
            ],
            [
                16834,
                16839
            ],
            [
                16853,
                16858
            ],
            [
                16801,
                16806
            ],
            [
                16859,
                16913
            ],
            [
                16930,
                16942
            ],
            [
                17173,
                17176
            ],
            [
                16797,
                16800
            ],
            [
                16944,
                16969
            ],
            [
                16986,
                16989
            ],
            [
                17011,
                17025
            ],
            [
                17207,
                17209
            ],
            [
                17227,
                17240
            ],
            [
                17289,
                17339
            ],
            [
                17354,
                17395
            ],
            [
                17350,
                17353
            ],
            [
                17420,
                17442
            ],
            [
                17928,
                17976
            ],
            [
                18005,
                18023
            ],
            [
                18033,
                18064
            ],
            [
                18092,
                18126
            ],
            [
                18149,
                18152
            ],
            [
                18129,
                18135
            ],
            [
                18164,
                18166
            ],
            [
                18213,
                18216
            ],
            [
                18188,
                18190
            ],
            [
                18426,
                18435
            ],
            [
                18337,
                18344
            ],
            [
                18291,
                18295
            ],
            [
                18368,
                18385
            ],
            [
                18403,
                18408
            ],
            [
                18318,
                18322
            ],
            [
                18452,
                18457
            ],
            [
                18488,
                18504
            ],
            [
                18660,
                18663
            ],
            [
                18599,
                18601
            ],
            [
                18617,
                18622
            ],
            [
                18733,
                18736
            ],
            [
                18838,
                18925
            ],
            [
                18931,
                18933
            ],
            [
                18933,
                18964
            ],
            [
                18983,
                18985
            ],
            [
                19061,
                19127
            ],
            [
                19127,
                19130
            ],
            [
                19278,
                19290
            ],
            [
                19300,
                19335
            ],
            [
                19348,
                19367
            ],
            [
                19378,
                19397
            ],
            [
                19402,
                19418
            ],
            [
                19418,
                19505
            ],
            [
                19523,
                19525
            ],
            [
                19537,
                19551
            ],
            [
                19600,
                19758
            ],
            [
                19526,
                19529
            ],
            [
                19801,
                19805
            ],
            [
                19830,
                19832
            ],
            [
                19854,
                19862
            ],
            [
                19876,
                19913
            ],
            [
                19956,
                19961
            ],
            [
                19941,
                19956
            ],
            [
                19849,
                19850
            ],
            [
                19992,
                20019
            ],
            [
                20045,
                20064
            ],
            [
                20097,
                20163
            ],
            [
                20178,
                20185
            ],
            [
                20207,
                20230
            ],
            [
                20230,
                20236
            ],
            [
                20238,
                20282
            ],
            [
                20289,
                20331
            ],
            [
                20337,
                20341
            ],
            [
                20349,
                20416
            ],
            [
                20442,
                20443
            ]
        ],
        "row_chars": [
            [
                0,
                289
            ],
            [
                289,
                1250
            ],
            [
                1250,
                1396
            ],
            [
                1396,
                1413
            ],
            [
                1413,
                1513
            ],
            [
                1513,
                1545
            ],
            [
                1545,
                1625
            ],
            [
                1625,
                1827
            ],
            [
                1827,
                1864
            ],
            [
                1864,
                2049
            ],
            [
                2049,
                2258
            ],
            [
                2258,
                2416
            ],
            [
                2416,
                2709
            ],
            [
                2709,
                3150
            ],
            [
                3150,
                3527
            ],
            [
                3527,
                3725
            ],
            [
                3725,
                3800
            ],
            [
                3800,
                3924
            ],
            [
                3924,
                4155
            ],
            [
                4155,
                4284
            ],
            [
                4284,
                4665
            ],
            [
                4665,
                4745
            ],
            [
                4745,
                4895
            ],
            [
                4895,
                4984
            ],
            [
                4984,
                5092
            ],
            [
                5092,
                5246
            ],
            [
                5246,
                5495
            ],
            [
                5495,
                5806
            ],
            [
                5806,
                6080
            ],
            [
                6080,
                6180
            ],
            [
                6180,
                6578
            ],
            [
                6578,
                6733
            ],
            [
                6733,
                7189
            ],
            [
                7189,
                7258
            ],
            [
                7258,
                7801
            ],
            [
                7801,
                8089
            ],
            [
                8089,
                8240
            ],
            [
                8240,
                8363
            ],
            [
                8363,
                8701
            ],
            [
                8701,
                8715
            ],
            [
                8715,
                8822
            ],
            [
                8822,
                8932
            ],
            [
                8932,
                9113
            ],
            [
                9113,
                9164
            ],
            [
                9164,
                9335
            ],
            [
                9335,
                9522
            ],
            [
                9522,
                9556
            ],
            [
                9556,
                9665
            ],
            [
                9665,
                9918
            ],
            [
                9918,
                10085
            ],
            [
                10085,
                10368
            ],
            [
                10368,
                10460
            ],
            [
                10460,
                10522
            ],
            [
                10522,
                10767
            ],
            [
                10767,
                11109
            ],
            [
                11109,
                11189
            ],
            [
                11189,
                11258
            ],
            [
                11258,
                11535
            ],
            [
                11535,
                11745
            ],
            [
                11745,
                11959
            ],
            [
                11959,
                12060
            ],
            [
                12060,
                12326
            ],
            [
                12326,
                12403
            ],
            [
                12403,
                12667
            ],
            [
                12667,
                12745
            ],
            [
                12745,
                13129
            ],
            [
                13129,
                13148
            ],
            [
                13148,
                13226
            ],
            [
                13226,
                13387
            ],
            [
                13387,
                13553
            ],
            [
                13553,
                13716
            ],
            [
                13716,
                13981
            ],
            [
                13981,
                14057
            ],
            [
                14057,
                14120
            ],
            [
                14120,
                14207
            ],
            [
                14207,
                14405
            ],
            [
                14405,
                14493
            ],
            [
                14493,
                14570
            ],
            [
                14570,
                14822
            ],
            [
                14822,
                15065
            ],
            [
                15065,
                15123
            ],
            [
                15123,
                15176
            ],
            [
                15176,
                15317
            ],
            [
                15317,
                15609
            ],
            [
                15609,
                15802
            ],
            [
                15802,
                16720
            ],
            [
                16720,
                17209
            ],
            [
                17209,
                17443
            ],
            [
                17443,
                17555
            ],
            [
                17555,
                17674
            ],
            [
                17674,
                17796
            ],
            [
                17796,
                17812
            ],
            [
                17812,
                17857
            ],
            [
                17857,
                17928
            ],
            [
                17928,
                18166
            ],
            [
                18166,
                18933
            ],
            [
                18933,
                18985
            ],
            [
                18985,
                19127
            ],
            [
                19127,
                19418
            ],
            [
                19418,
                19832
            ],
            [
                19832,
                20230
            ],
            [
                20230,
                20443
            ]
        ]
    },
    "abridged": {
        "text": "I suppose there is no man in Vanity Fair who does not sometimes wonder how his neighbours make ends meet. With the utmost regard for the Jenkins family, for instance, I confess that the appearance of their large barouche with the grenadier-footmen mystifies me: for those men and the carriage must cost six hundred a year at the very least - and then there are the splendid dinners, the two boys at Eton, the prize governess for the girls, the trips abroad, and the annual ball. How do the Jenkinses manage? What is Jenkins? Commissioner of the Tape and Sealing Wax Office, with 1200 pounds a year. Had his wife a private fortune? Pooh! - she was one of eleven children of a small squire. All she ever gets from her family is a turkey at Christmas. How does Jenkins balance his income?\nEvery one of us can point to some families who live nobody knows how. Many a glass of wine have we all drunk, hob-nobbing with the giver and wondering how the deuce he paid for it.\nSome three or four years after his stay in Paris, when Rawdon Crawley and his wife were established in a very small comfortable house in Curzon Street, May Fair, all their friends asked this question. As I am able to tell the public how Crawley and his wife lived without any income, may I entreat the public newspapers not to reprint the following narrative - of which, as the discoverer (and at some expense, too) I ought to have the benefit? You may by deep inquiry learn how a man lives comfortably on nothing a year: but it is best not to be intimate with gentlemen of this profession, for it will cost you something considerable.\nOn nothing per annum then, Crawley and his wife lived very happily and comfortably at Paris. He had quitted the Guards and sold out of the army. When we find him again, his mustachios and the title of Colonel on his card are the only relics of his military profession.\nIt has been mentioned that Rebecca, soon after her arrival in Paris, took a leading position in society, and was welcomed at noble houses. The English men of fashion courted her, to the disgust of their wives, who could not bear the upstart. For some months the fashionable salons, and the splendours of the Court, delighted and perhaps a little intoxicated Mrs. Crawley.\nBut the Colonel yawned sadly among the Duchesses and great ladies. He left Rebecca to attend these parties alone, resuming his own simple amusements amongst his friends.\nNow, the Colonel had a great aptitude for all games of chance: and by continual exercise at the cards, dice and the billiard cue had attained much skill in their use. From being only a brilliant amateur, he had grown to be a consummate master of billiards. His genius used to rise with the danger; when luck had been unfavourable to him for a whole game, and the bets were against him, he would boldly make some prodigious shots and win, to everybody's astonishment.\nAt cards he was equally skilful. He would constantly lose money at the start of an evening, making such careless blunders that newcomers were inclined to think meanly of his talent. Yet when roused to action, his play became quite different, so that he was pretty sure of beating his enemy thoroughly before the night was over. The envious and the vanquished spoke sometimes with bitterness about his successes, hinting that they were due to foul play.\nIn Paris at that time, gambling went on not just in public gaming rooms but in private houses. At Crawley's charming little evening gatherings it was commonly practised - much to good-natured Mrs. Crawley's annoyance. She spoke with grief about her husband's passion for dice; she bewailed it to everybody who came to her house. She besought the young fellows never to touch the dice; and when young Green lost a considerable sum of money, Rebecca passed a whole night in tears (as her servant told the unfortunate young gentleman) and actually went on her knees to her husband to beseech him to remit the debt. Yet how could he? He had lost just as much himself. Green might have time; but of course he must pay.\nHer house began to have an unfortunate reputation. The old hands warned the less experienced of their danger; Colonel O'Dowd warned Lieutenant Spooney. A loud and violent fracas took place at the Caf de Paris between Colonel O'Dowd and his lady, and Colonel and Mrs. Crawley. Mrs. O'Dowd snapped her fingers in Mrs. Crawley's face and called her husband \"no betther than a black-leg.\" Colonel Crawley challenged Colonel O'Dowd; but the Commander-in-Chief heard of it and ensured that no duel took place. If Rebecca had not gone on her knees to General Tufto, Crawley would have been sent back to England; and he did not play, except with civilians, for some weeks after.\nIn spite of Rawdon's undoubted skill, it became clear to Rebecca that their position was precarious.\n\"Gambling,\" she would say, \"is good to help your income, but is not an income itself. People may get tired of play, and then where are we?\" Rawdon saw the truth of this; he had noticed that after a few nights of his little suppers, gentlemen did not present themselves very eagerly.\nRebecca saw that she must get Rawdon a place at home or in the colonies. As a first step she had made him sell out of the Guards and go on half-pay. He was no longer aide-de-camp to General Tufto. Rebecca laughed at that officer, at his toupee, his false teeth, and his pretensions to be a lady-killer. The general had transferred his attentions to Mrs. Brent, along with his bouquets, his dinners, his opera-boxes, and his knick-knacks.\nBecky had a dozen admirers in his place, to be sure, and could cut her rival to pieces with her wit. But opera-boxes and dinners palled upon her: nosegays were not a provision for future years: and she could not live upon knick-knacks. She longed for more substantial benefits.\nJust then news arrived that Miss Crawley was dying; the Colonel must haste to her bedside. Mrs. Crawley and her child would remain behind until he came for them. Rawdon departed for Calais, but instead of sailing to Dover, he then made for Brussels, preferring that quiet little city where he had fewer debts than in England.\nMrs. Crawley ordered the most intense mourning for herself and little Rawdon. Everyone knew that the Colonel was to inherit, and she booked the premier suite at the hotel where they were staying instead of the small apartment. She had an amicable wrangle with the landlord about carpets and new hangings, and a final adjustment of everything except the bill. She went off in one of his carriages, with her French maid and her child; the landlord and landlady smiling farewell to her from the gate.\nGeneral Tufto was furious when he heard she was gone, and Mrs. Brent was furious with him for being furious; Lieutenant Spooney was cut to the heart; and the landlord got his best suite ready for her return. He kept the trunks which she left in his charge with the greatest care. They were not, however, found to be particularly valuable when opened some time after.\nBefore she went to join her husband in Brussels, Mrs. Crawley made an expedition into England, leaving her little son behind under the care of her French maid.\nThe parting between Rebecca and the little Rawdon did not cause either much pain. She had not seen much of him since his birth. After the amiable fashion of French mothers, she had placed him out at nurse in a village, where little Rawdon passed the first months of his life, not unhappily, with a numerous family of foster-brothers in wooden shoes. His father would ride over often to visit him, and the elder Rawdon's heart glowed to see him rosy and dirty, shouting lustily, and happy in the making of mud-pies.\nRebecca did not care much to go and see her son. Once he spoiled a new dove-coloured pelisse of hers. He preferred his nurse's caresses to his mamma's, and when finally he quitted that jolly nurse, he cried loudly for hours. He was only consoled by his mother's promise that he should return the next day; indeed the nurse too was told that the child would be restored to her, and for some time anxiously awaited his return.\nThirty years ago there was great respect in Europe for the honour and wealth of Britons. You needed only to be a Milor Anglais, travelling in a private carriage, and credit was yours wherever you chose. It was not for some weeks after the Crawleys' departure that the landlord of their Paris hotel found out the losses which he had sustained: not until the milliner and the jeweller made repeated visits with their bills for Madame Crawley. Even the poor nurse was never paid after the first six months for that milk of human kindness with which she had nurtured the healthy little Rawdon.\nRebecca's object in her journey to London was to reach an agreement with her husband's creditors, and by offering them a shilling in the pound, to secure his return to England. She managed to convince them that she was offering them all her husband's wealth, and that otherwise he would stay on the continent and they would get no money at all. Thus she purchased with fifteen hundred pounds of ready money more than ten times that amount of debt.\nMrs. Crawley employed no lawyer. She made the lawyers of the creditors themselves do the business. And they complimented her upon the brilliant way in which she dealt with them, and declared that no professional man could beat her.\nRebecca received their congratulations with perfect modesty; ordered a bottle of sherry to her dingy lodgings to treat the enemy's lawyers: shook hands with them at parting, in excellent good humour, and returned straightway to the Continent, to rejoin her husband and tell him the good news. Her son had been neglected during his mother's absence; for her French maid, forming an attachment for a soldier, forgot her charge, and little Rawdon very narrowly escaped drowning on Calais sands, where she had left and lost him.\nAnd so Colonel and Mrs. Crawley came to London: and at their house in Curzon Street, May Fair, they showed the skill which must be possessed by those who would live on non-existent income.",
        "paragraph_chars": [
            [
                0,
                786
            ],
            [
                786,
                967
            ],
            [
                967,
                1603
            ],
            [
                1603,
                1872
            ],
            [
                1872,
                2244
            ],
            [
                2244,
                2414
            ],
            [
                2414,
                2881
            ],
            [
                2881,
                3334
            ],
            [
                3334,
                4048
            ],
            [
                4048,
                4719
            ],
            [
                4719,
                4820
            ],
            [
                4820,
                5103
            ],
            [
                5103,
                5541
            ],
            [
                5541,
                5819
            ],
            [
                5819,
                6145
            ],
            [
                6145,
                6643
            ],
            [
                6643,
                7010
            ],
            [
                7010,
                7170
            ],
            [
                7170,
                7685
            ],
            [
                7685,
                8110
            ],
            [
                8110,
                8700
            ],
            [
                8700,
                9148
            ],
            [
                9148,
                9380
            ],
            [
                9380,
                9905
            ],
            [
                9905,
                10093
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                479
            ],
            [
                479,
                508
            ],
            [
                508,
                525
            ],
            [
                525,
                599
            ],
            [
                599,
                631
            ],
            [
                631,
                637
            ],
            [
                637,
                689
            ],
            [
                689,
                749
            ],
            [
                749,
                786
            ],
            [
                786,
                856
            ],
            [
                856,
                967
            ],
            [
                967,
                1168
            ],
            [
                1168,
                1412
            ],
            [
                1412,
                1603
            ],
            [
                1603,
                1696
            ],
            [
                1696,
                1748
            ],
            [
                1748,
                1872
            ],
            [
                1872,
                2011
            ],
            [
                2011,
                2114
            ],
            [
                2114,
                2244
            ],
            [
                2244,
                2311
            ],
            [
                2311,
                2414
            ],
            [
                2414,
                2581
            ],
            [
                2581,
                2671
            ],
            [
                2671,
                2881
            ],
            [
                2881,
                2914
            ],
            [
                2914,
                3063
            ],
            [
                3063,
                3209
            ],
            [
                3209,
                3334
            ],
            [
                3334,
                3429
            ],
            [
                3429,
                3552
            ],
            [
                3552,
                3663
            ],
            [
                3663,
                3946
            ],
            [
                3946,
                3964
            ],
            [
                3964,
                3998
            ],
            [
                3998,
                4048
            ],
            [
                4048,
                4099
            ],
            [
                4099,
                4200
            ],
            [
                4200,
                4324
            ],
            [
                4324,
                4433
            ],
            [
                4433,
                4552
            ],
            [
                4552,
                4719
            ],
            [
                4719,
                4820
            ],
            [
                4820,
                4906
            ],
            [
                4906,
                4960
            ],
            [
                4960,
                5103
            ],
            [
                5103,
                5176
            ],
            [
                5176,
                5252
            ],
            [
                5252,
                5300
            ],
            [
                5300,
                5406
            ],
            [
                5406,
                5541
            ],
            [
                5541,
                5642
            ],
            [
                5642,
                5777
            ],
            [
                5777,
                5819
            ],
            [
                5819,
                5910
            ],
            [
                5910,
                5981
            ],
            [
                5981,
                6145
            ],
            [
                6145,
                6223
            ],
            [
                6223,
                6372
            ],
            [
                6372,
                6504
            ],
            [
                6504,
                6643
            ],
            [
                6643,
                6851
            ],
            [
                6851,
                6923
            ],
            [
                6923,
                7010
            ],
            [
                7010,
                7170
            ],
            [
                7170,
                7252
            ],
            [
                7252,
                7298
            ],
            [
                7298,
                7520
            ],
            [
                7520,
                7685
            ],
            [
                7685,
                7734
            ],
            [
                7734,
                7787
            ],
            [
                7787,
                7910
            ],
            [
                7910,
                8110
            ],
            [
                8110,
                8199
            ],
            [
                8199,
                8313
            ],
            [
                8313,
                8551
            ],
            [
                8551,
                8700
            ],
            [
                8700,
                8877
            ],
            [
                8877,
                9045
            ],
            [
                9045,
                9148
            ],
            [
                9148,
                9181
            ],
            [
                9181,
                9247
            ],
            [
                9247,
                9380
            ],
            [
                9380,
                9673
            ],
            [
                9673,
                9905
            ],
            [
                9905,
                10093
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                29,
                40
            ],
            [
                50,
                53
            ],
            [
                54,
                63
            ],
            [
                64,
                78
            ],
            [
                90,
                94
            ],
            [
                95,
                104
            ],
            [
                104,
                106
            ],
            [
                106,
                136
            ],
            [
                137,
                144
            ],
            [
                145,
                165
            ],
            [
                165,
                166
            ],
            [
                167,
                168
            ],
            [
                177,
                199
            ],
            [
                206,
                247
            ],
            [
                248,
                252
            ],
            [
                258,
                260
            ],
            [
                260,
                265
            ],
            [
                266,
                271
            ],
            [
                272,
                297
            ],
            [
                303,
                339
            ],
            [
                340,
                341
            ],
            [
                342,
                424
            ],
            [
                425,
                443
            ],
            [
                450,
                457
            ],
            [
                458,
                461
            ],
            [
                462,
                477
            ],
            [
                477,
                478
            ],
            [
                479,
                482
            ],
            [
                486,
                499
            ],
            [
                506,
                508
            ],
            [
                508,
                525
            ],
            [
                525,
                597
            ],
            [
                597,
                599
            ],
            [
                599,
                631
            ],
            [
                631,
                635
            ],
            [
                647,
                687
            ],
            [
                687,
                689
            ],
            [
                689,
                747
            ],
            [
                747,
                749
            ],
            [
                749,
                785
            ],
            [
                786,
                798
            ],
            [
                802,
                828
            ],
            [
                829,
                856
            ],
            [
                856,
                888
            ],
            [
                889,
                895
            ],
            [
                896,
                899
            ],
            [
                899,
                916
            ],
            [
                917,
                967
            ],
            [
                967,
                1128
            ],
            [
                1139,
                1146
            ],
            [
                1158,
                1166
            ],
            [
                1166,
                1168
            ],
            [
                1168,
                1175
            ],
            [
                1176,
                1286
            ],
            [
                1287,
                1315
            ],
            [
                1316,
                1325
            ],
            [
                1328,
                1336
            ],
            [
                1336,
                1381
            ],
            [
                1383,
                1390
            ],
            [
                1391,
                1412
            ],
            [
                1412,
                1435
            ],
            [
                1436,
                1487
            ],
            [
                1489,
                1556
            ],
            [
                1556,
                1561
            ],
            [
                1562,
                1564
            ],
            [
                1565,
                1603
            ],
            [
                1603,
                1628
            ],
            [
                1628,
                1696
            ],
            [
                1696,
                1698
            ],
            [
                1703,
                1748
            ],
            [
                1748,
                1872
            ],
            [
                1872,
                1947
            ],
            [
                1948,
                1967
            ],
            [
                1968,
                1975
            ],
            [
                1975,
                1996
            ],
            [
                2003,
                2009
            ],
            [
                2009,
                2011
            ],
            [
                2011,
                2037
            ],
            [
                2038,
                2049
            ],
            [
                2049,
                2068
            ],
            [
                2069,
                2104
            ],
            [
                2112,
                2114
            ],
            [
                2114,
                2133
            ],
            [
                2146,
                2152
            ],
            [
                2152,
                2179
            ],
            [
                2180,
                2185
            ],
            [
                2185,
                2242
            ],
            [
                2242,
                2244
            ],
            [
                2244,
                2309
            ],
            [
                2309,
                2311
            ],
            [
                2311,
                2326
            ],
            [
                2327,
                2329
            ],
            [
                2337,
                2381
            ],
            [
                2382,
                2400
            ],
            [
                2401,
                2404
            ],
            [
                2405,
                2412
            ],
            [
                2412,
                2414
            ],
            [
                2414,
                2418
            ],
            [
                2419,
                2480
            ],
            [
                2506,
                2516
            ],
            [
                2517,
                2521
            ],
            [
                2526,
                2529
            ],
            [
                2539,
                2542
            ],
            [
                2547,
                2555
            ],
            [
                2556,
                2560
            ],
            [
                2561,
                2569
            ],
            [
                2576,
                2579
            ],
            [
                2579,
                2581
            ],
            [
                2581,
                2617
            ],
            [
                2621,
                2671
            ],
            [
                2671,
                2710
            ],
            [
                2712,
                2716
            ],
            [
                2717,
                2786
            ],
            [
                2787,
                2808
            ],
            [
                2816,
                2836
            ],
            [
                2843,
                2846
            ],
            [
                2850,
                2854
            ],
            [
                2855,
                2864
            ],
            [
                2867,
                2879
            ],
            [
                2879,
                2880
            ],
            [
                2881,
                2883
            ],
            [
                2884,
                2912
            ],
            [
                2914,
                2951
            ],
            [
                2958,
                2972
            ],
            [
                2973,
                2984
            ],
            [
                2994,
                3002
            ],
            [
                3003,
                3022
            ],
            [
                3023,
                3061
            ],
            [
                3063,
                3088
            ],
            [
                3088,
                3089
            ],
            [
                3094,
                3122
            ],
            [
                3123,
                3125
            ],
            [
                3126,
                3209
            ],
            [
                3209,
                3271
            ],
            [
                3278,
                3291
            ],
            [
                3291,
                3292
            ],
            [
                3301,
                3305
            ],
            [
                3306,
                3310
            ],
            [
                3311,
                3315
            ],
            [
                3320,
                3322
            ],
            [
                3323,
                3332
            ],
            [
                3332,
                3334
            ],
            [
                3334,
                3342
            ],
            [
                3343,
                3355
            ],
            [
                3355,
                3356
            ],
            [
                3357,
                3373
            ],
            [
                3374,
                3377
            ],
            [
                3386,
                3392
            ],
            [
                3400,
                3405
            ],
            [
                3410,
                3427
            ],
            [
                3427,
                3429
            ],
            [
                3429,
                3457
            ],
            [
                3458,
                3465
            ],
            [
                3480,
                3483
            ],
            [
                3484,
                3492
            ],
            [
                3493,
                3502
            ],
            [
                3505,
                3525
            ],
            [
                3526,
                3552
            ],
            [
                3552,
                3561
            ],
            [
                3562,
                3566
            ],
            [
                3567,
                3572
            ],
            [
                3573,
                3609
            ],
            [
                3609,
                3663
            ],
            [
                3663,
                3699
            ],
            [
                3700,
                3708
            ],
            [
                3709,
                3712
            ],
            [
                3717,
                3739
            ],
            [
                3740,
                3746
            ],
            [
                3747,
                3811
            ],
            [
                3813,
                3815
            ],
            [
                3820,
                3864
            ],
            [
                3866,
                3944
            ],
            [
                3944,
                3946
            ],
            [
                3950,
                3964
            ],
            [
                3964,
                3996
            ],
            [
                3996,
                3998
            ],
            [
                3998,
                4014
            ],
            [
                4015,
                4024
            ],
            [
                4025,
                4046
            ],
            [
                4046,
                4048
            ],
            [
                4048,
                4099
            ],
            [
                4099,
                4156
            ],
            [
                4158,
                4172
            ],
            [
                4173,
                4198
            ],
            [
                4198,
                4200
            ],
            [
                4200,
                4236
            ],
            [
                4237,
                4243
            ],
            [
                4248,
                4256
            ],
            [
                4257,
                4264
            ],
            [
                4265,
                4272
            ],
            [
                4280,
                4292
            ],
            [
                4292,
                4322
            ],
            [
                4322,
                4324
            ],
            [
                4324,
                4433
            ],
            [
                4433,
                4474
            ],
            [
                4480,
                4502
            ],
            [
                4509,
                4511
            ],
            [
                4515,
                4518
            ],
            [
                4527,
                4552
            ],
            [
                4552,
                4719
            ],
            [
                4719,
                4755
            ],
            [
                4755,
                4766
            ],
            [
                4773,
                4783
            ],
            [
                4784,
                4807
            ],
            [
                4808,
                4818
            ],
            [
                4818,
                4819
            ],
            [
                4820,
                4848
            ],
            [
                4848,
                4880
            ],
            [
                4884,
                4887
            ],
            [
                4888,
                4906
            ],
            [
                4906,
                4916
            ],
            [
                4921,
                4960
            ],
            [
                4960,
                4966
            ],
            [
                4971,
                4974
            ],
            [
                4975,
                4980
            ],
            [
                4981,
                4983
            ],
            [
                4988,
                4989
            ],
            [
                4990,
                4996
            ],
            [
                5005,
                5051
            ],
            [
                5052,
                5061
            ],
            [
                5062,
                5103
            ],
            [
                5103,
                5128
            ],
            [
                5129,
                5132
            ],
            [
                5133,
                5139
            ],
            [
                5140,
                5147
            ],
            [
                5148,
                5174
            ],
            [
                5174,
                5176
            ],
            [
                5176,
                5204
            ],
            [
                5209,
                5252
            ],
            [
                5269,
                5298
            ],
            [
                5298,
                5300
            ],
            [
                5300,
                5315
            ],
            [
                5316,
                5346
            ],
            [
                5346,
                5347
            ],
            [
                5348,
                5364
            ],
            [
                5365,
                5368
            ],
            [
                5369,
                5404
            ],
            [
                5404,
                5406
            ],
            [
                5406,
                5417
            ],
            [
                5422,
                5448
            ],
            [
                5449,
                5463
            ],
            [
                5475,
                5500
            ],
            [
                5500,
                5501
            ],
            [
                5502,
                5540
            ],
            [
                5541,
                5642
            ],
            [
                5642,
                5645
            ],
            [
                5646,
                5661
            ],
            [
                5662,
                5695
            ],
            [
                5701,
                5704
            ],
            [
                5705,
                5775
            ],
            [
                5775,
                5777
            ],
            [
                5777,
                5780
            ],
            [
                5781,
                5819
            ],
            [
                5829,
                5841
            ],
            [
                5847,
                5859
            ],
            [
                5860,
                5910
            ],
            [
                5910,
                5970
            ],
            [
                5975,
                5981
            ],
            [
                5988,
                6008
            ],
            [
                6009,
                6020
            ],
            [
                6021,
                6023
            ],
            [
                6032,
                6040
            ],
            [
                6040,
                6044
            ],
            [
                6055,
                6058
            ],
            [
                6059,
                6068
            ],
            [
                6080,
                6084
            ],
            [
                6085,
                6097
            ],
            [
                6098,
                6102
            ],
            [
                6109,
                6115
            ],
            [
                6128,
                6132
            ],
            [
                6133,
                6135
            ],
            [
                6143,
                6145
            ],
            [
                6145,
                6223
            ],
            [
                6242,
                6257
            ],
            [
                6268,
                6269
            ],
            [
                6285,
                6296
            ],
            [
                6306,
                6315
            ],
            [
                6322,
                6326
            ],
            [
                6340,
                6354
            ],
            [
                6370,
                6372
            ],
            [
                6376,
                6379
            ],
            [
                6380,
                6399
            ],
            [
                6405,
                6417
            ],
            [
                6418,
                6423
            ],
            [
                6424,
                6431
            ],
            [
                6432,
                6435
            ],
            [
                6436,
                6448
            ],
            [
                6448,
                6504
            ],
            [
                6504,
                6540
            ],
            [
                6542,
                6550
            ],
            [
                6551,
                6557
            ],
            [
                6567,
                6570
            ],
            [
                6571,
                6576
            ],
            [
                6576,
                6581
            ],
            [
                6582,
                6642
            ],
            [
                6643,
                6711
            ],
            [
                6716,
                6813
            ],
            [
                6814,
                6822
            ],
            [
                6829,
                6834
            ],
            [
                6839,
                6842
            ],
            [
                6843,
                6849
            ],
            [
                6849,
                6851
            ],
            [
                6851,
                6853
            ],
            [
                6859,
                6923
            ],
            [
                6923,
                7010
            ],
            [
                7010,
                7048
            ],
            [
                7057,
                7112
            ],
            [
                7113,
                7127
            ],
            [
                7128,
                7134
            ],
            [
                7135,
                7170
            ],
            [
                7170,
                7240
            ],
            [
                7241,
                7252
            ],
            [
                7252,
                7263
            ],
            [
                7264,
                7276
            ],
            [
                7281,
                7298
            ],
            [
                7298,
                7387
            ],
            [
                7387,
                7520
            ],
            [
                7520,
                7546
            ],
            [
                7553,
                7555
            ],
            [
                7562,
                7565
            ],
            [
                7565,
                7589
            ],
            [
                7590,
                7683
            ],
            [
                7683,
                7685
            ],
            [
                7685,
                7724
            ],
            [
                7729,
                7732
            ],
            [
                7732,
                7734
            ],
            [
                7734,
                7787
            ],
            [
                7787,
                7881
            ],
            [
                7881,
                7910
            ],
            [
                7910,
                7976
            ],
            [
                7977,
                8007
            ],
            [
                8008,
                8011
            ],
            [
                8012,
                8041
            ],
            [
                8042,
                8079
            ],
            [
                8080,
                8089
            ],
            [
                8090,
                8097
            ],
            [
                8098,
                8110
            ],
            [
                8110,
                8126
            ],
            [
                8127,
                8132
            ],
            [
                8133,
                8136
            ],
            [
                8137,
                8142
            ],
            [
                8143,
                8153
            ],
            [
                8154,
                8160
            ],
            [
                8161,
                8168
            ],
            [
                8169,
                8175
            ],
            [
                8176,
                8179
            ],
            [
                8180,
                8186
            ],
            [
                8187,
                8198
            ],
            [
                8199,
                8209
            ],
            [
                8215,
                8286
            ],
            [
                8293,
                8311
            ],
            [
                8311,
                8313
            ],
            [
                8313,
                8389
            ],
            [
                8390,
                8395
            ],
            [
                8396,
                8401
            ],
            [
                8402,
                8407
            ],
            [
                8408,
                8462
            ],
            [
                8463,
                8475
            ],
            [
                8476,
                8479
            ],
            [
                8480,
                8483
            ],
            [
                8493,
                8518
            ],
            [
                8531,
                8534
            ],
            [
                8535,
                8549
            ],
            [
                8549,
                8551
            ],
            [
                8551,
                8564
            ],
            [
                8571,
                8621
            ],
            [
                8622,
                8663
            ],
            [
                8673,
                8676
            ],
            [
                8677,
                8699
            ],
            [
                8700,
                8748
            ],
            [
                8768,
                8786
            ],
            [
                8787,
                8818
            ],
            [
                8819,
                8853
            ],
            [
                8854,
                8857
            ],
            [
                8858,
                8864
            ],
            [
                8875,
                8877
            ],
            [
                8877,
                8880
            ],
            [
                8889,
                8891
            ],
            [
                8901,
                8910
            ],
            [
                8911,
                8918
            ],
            [
                8928,
                8932
            ],
            [
                8933,
                8950
            ],
            [
                8957,
                8962
            ],
            [
                8963,
                8967
            ],
            [
                8981,
                8986
            ],
            [
                8992,
                9008
            ],
            [
                9009,
                9012
            ],
            [
                9028,
                9030
            ],
            [
                9031,
                9036
            ],
            [
                9050,
                9053
            ],
            [
                9054,
                9141
            ],
            [
                9146,
                9148
            ],
            [
                9148,
                9179
            ],
            [
                9179,
                9181
            ],
            [
                9181,
                9247
            ],
            [
                9247,
                9250
            ],
            [
                9256,
                9268
            ],
            [
                9273,
                9308
            ],
            [
                9324,
                9343
            ],
            [
                9344,
                9363
            ],
            [
                9364,
                9380
            ],
            [
                9380,
                9467
            ],
            [
                9468,
                9470
            ],
            [
                9475,
                9489
            ],
            [
                9490,
                9648
            ],
            [
                9658,
                9661
            ],
            [
                9667,
                9671
            ],
            [
                9671,
                9673
            ],
            [
                9681,
                9689
            ],
            [
                9690,
                9727
            ],
            [
                9727,
                9732
            ],
            [
                9733,
                9748
            ],
            [
                9748,
                9749
            ],
            [
                9758,
                9785
            ],
            [
                9785,
                9804
            ],
            [
                9804,
                9870
            ],
            [
                9870,
                9877
            ],
            [
                9882,
                9905
            ],
            [
                9905,
                9911
            ],
            [
                9912,
                9956
            ],
            [
                9957,
                9999
            ],
            [
                10000,
                10004
            ],
            [
                10005,
                10072
            ],
            [
                10092,
                10093
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                479
            ],
            [
                479,
                508
            ],
            [
                508,
                525
            ],
            [
                525,
                599
            ],
            [
                599,
                631
            ],
            [
                631,
                689
            ],
            [
                689,
                749
            ],
            [
                749,
                786
            ],
            [
                786,
                786
            ],
            [
                786,
                856
            ],
            [
                856,
                967
            ],
            [
                967,
                1168
            ],
            [
                1168,
                1412
            ],
            [
                1412,
                1603
            ],
            [
                1603,
                1696
            ],
            [
                1696,
                1748
            ],
            [
                1748,
                1872
            ],
            [
                1872,
                2011
            ],
            [
                2011,
                2114
            ],
            [
                2114,
                2244
            ],
            [
                2244,
                2311
            ],
            [
                2311,
                2311
            ],
            [
                2311,
                2311
            ],
            [
                2311,
                2311
            ],
            [
                2311,
                2414
            ],
            [
                2414,
                2414
            ],
            [
                2414,
                2581
            ],
            [
                2581,
                2581
            ],
            [
                2581,
                2671
            ],
            [
                2671,
                2881
            ],
            [
                2881,
                2881
            ],
            [
                2881,
                3209
            ],
            [
                3209,
                3209
            ],
            [
                3209,
                3334
            ],
            [
                3334,
                3429
            ],
            [
                3429,
                3552
            ],
            [
                3552,
                3663
            ],
            [
                3663,
                3946
            ],
            [
                3946,
                3964
            ],
            [
                3964,
                3998
            ],
            [
                3998,
                4048
            ],
            [
                4048,
                4048
            ],
            [
                4048,
                4099
            ],
            [
                4099,
                4200
            ],
            [
                4200,
                4324
            ],
            [
                4324,
                4324
            ],
            [
                4324,
                4433
            ],
            [
                4433,
                4552
            ],
            [
                4552,
                4719
            ],
            [
                4719,
                4820
            ],
            [
                4820,
                4906
            ],
            [
                4906,
                4960
            ],
            [
                4960,
                5103
            ],
            [
                5103,
                5176
            ],
            [
                5176,
                5252
            ],
            [
                5252,
                5300
            ],
            [
                5300,
                5406
            ],
            [
                5406,
                5541
            ],
            [
                5541,
                5541
            ],
            [
                5541,
                5642
            ],
            [
                5642,
                5777
            ],
            [
                5777,
                5819
            ],
            [
                5819,
                5910
            ],
            [
                5910,
                5981
            ],
            [
                5981,
                6145
            ],
            [
                6145,
                6145
            ],
            [
                6145,
                6223
            ],
            [
                6223,
                6372
            ],
            [
                6372,
                6504
            ],
            [
                6504,
                6643
            ],
            [
                6643,
                6851
            ],
            [
                6851,
                6923
            ],
            [
                6923,
                6923
            ],
            [
                6923,
                7010
            ],
            [
                7010,
                7170
            ],
            [
                7170,
                7252
            ],
            [
                7252,
                7298
            ],
            [
                7298,
                7520
            ],
            [
                7520,
                7685
            ],
            [
                7685,
                7734
            ],
            [
                7734,
                7787
            ],
            [
                7787,
                7910
            ],
            [
                7910,
                8110
            ],
            [
                8110,
                8110
            ],
            [
                8110,
                8313
            ],
            [
                8313,
                8551
            ],
            [
                8551,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8700
            ],
            [
                8700,
                8877
            ],
            [
                8877,
                9148
            ],
            [
                9148,
                9181
            ],
            [
                9181,
                9247
            ],
            [
                9247,
                9380
            ],
            [
                9380,
                9673
            ],
            [
                9673,
                9905
            ],
            [
                9905,
                10093
            ]
        ]
    }
}