{
    "original": {
        "text": "In the first place, and as a matter of the greatest necessity, we are bound to describe how a house may be got for nothing a year. These mansions are to be had either unfurnished, where, if you have credit with Messrs. Gillows or Bantings, you can get them splendidly montees and decorated entirely according to your own fancy; or they are to be let furnished, a less troublesome and complicated arrangement to most parties. It was so that Crawley and his wife preferred to hire their house.\nBefore Mr. Bowls came to preside over Miss Crawley's house and cellar in Park Lane, that lady had had for a butler a Mr. Raggles, who was born on the family estate of Queen's Crawley, and indeed was a younger son of a gardener there. By good conduct, a handsome person and calves, and a grave demeanour, Raggles rose from the knife-board to the footboard of the carriage; from the footboard to the butler's pantry. When he had been a certain number of years at the head of Miss Crawley's establishment, where he had had good wages, fat perquisites, and plenty of opportunities of saving, he announced that he was about to contract a matrimonial alliance with a late cook of Miss Crawley's, who had subsisted in an honourable manner by the exercise of a mangle, and the keeping of a small greengrocer's shop in the neighbourhood. The truth is, that the ceremony had been clandestinely performed some years back; although the news of Mr. Raggles' marriage was first brought to Miss Crawley by a little boy and girl of seven and eight years of age, whose continual presence in the kitchen had attracted the attention of Miss Briggs.\nMr. Raggles then retired and personally undertook the superintendence of the small shop and the greens. He added milk and cream, eggs and country-fed pork to his stores, contenting himself whilst other retired butlers were vending spirits in public houses, by dealing in the simplest country produce. And having a good connection amongst the butlers in the neighbourhood, and a snug back parlour where he and Mrs. Raggles received them, his milk, cream, and eggs got to be adopted by many of the fraternity, and his profits increased every year. Year after year he quietly and modestly amassed money, and when at length that snug and complete bachelor's residence at No. 201, Curzon Street, May Fair, lately the residence of the Honourable Frederick Deuceace, gone abroad, with its rich and appropriate furniture by the first makers, was brought to the hammer, who should go in and purchase the lease and furniture of the house but Charles Raggles? A part of the money he borrowed, it is true, and at rather a high interest, from a brother butler, but the chief part he paid down, and it was with no small pride that Mrs. Raggles found herself sleeping in a bed of carved mahogany, with silk curtains, with a prodigious cheval glass opposite to her, and a wardrobe which would contain her, and Raggles, and all the family.\nOf course, they did not intend to occupy permanently an apartment so splendid. It was in order to let the house again that Raggles purchased it. As soon as a tenant was found, he subsided into the greengrocer's shop once more; but a happy thing it was for him to walk out of that tenement and into Curzon Street, and there survey his house--his own house--with geraniums in the window and a carved bronze knocker. The footman occasionally lounging at the area railing, treated him with respect; the cook took her green stuff at his house and called him Mr. Landlord, and there was not one thing the tenants did, or one dish which they had for dinner, that Raggles might not know of, if he liked.\nHe was a good man; good and happy. The house brought him in so handsome a yearly income that he was determined to send his children to good schools, and accordingly, regardless of expense, Charles was sent to boarding at Dr. Swishtail's, Sugar-cane Lodge, and little Matilda to Miss Peckover's, Laurentinum House, Clapham.\nRaggles loved and adored the Crawley family as the author of all his prosperity in life. He had a silhouette of his mistress in his back shop, and a drawing of the Porter's Lodge at Queen's Crawley, done by that spinster herself in India ink--and the only addition he made to the decorations of the Curzon Street House was a print of Queen's Crawley in Hampshire, the seat of Sir Walpole Crawley, Baronet, who was represented in a gilded car drawn by six white horses, and passing by a lake covered with swans, and barges containing ladies in hoops, and musicians with flags and periwigs. Indeed Raggles thought there was no such palace in all the world, and no such august family.\nAs luck would have it, Raggles' house in Curzon Street was to let when Rawdon and his wife returned to London. The Colonel knew it and its owner quite well; the latter's connection with the Crawley family had been kept up constantly, for Raggles helped Mr. Bowls whenever Miss Crawley received friends. And the old man not only let his house to the Colonel but officiated as his butler whenever he had company; Mrs. Raggles operating in the kitchen below and sending up dinners of which old Miss Crawley herself might have approved. This was the way, then, Crawley got his house for nothing; for though Raggles had to pay taxes and rates, and the interest of the mortgage to the brother butler; and the insurance of his life; and the charges for his children at school; and the value of the meat and drink which his own family--and for a time that of Colonel Crawley too--consumed; and though the poor wretch was utterly ruined by the transaction, his children being flung on the streets, and himself driven into the Fleet Prison: yet somebody must pay even for gentlemen who live for nothing a year--and so it was this unlucky Raggles was made the representative of Colonel Crawley's defective capital.\nI wonder how many families are driven to roguery and to ruin by great practitioners in Crawley's way?--how many great noblemen rob their petty tradesmen, condescend to swindle their poor retainers out of wretched little sums and cheat for a few shillings? When we read that a noble nobleman has left for the Continent, or that another noble nobleman has an execution in his house--and that one or other owes six or seven millions, the defeat seems glorious even, and we respect the victim in the vastness of his ruin. But who pities a poor barber who can't get his money for powdering the footmen's heads; or a poor carpenter who has ruined himself by fixing up ornaments and pavilions for my lady's dejeuner; or the poor devil of a tailor whom the steward patronizes, and who has pledged all he is worth, and more, to get the liveries ready, which my lord has done him the honour to bespeak? When the great house tumbles down, these miserable wretches fall under it unnoticed: as they say in the old legends, before a man goes to the devil himself, he sends plenty of other souls thither.\nRawdon and his wife generously gave their patronage to all such of Miss Crawley's tradesmen and purveyors as chose to serve them. Some were willing enough, especially the poor ones. It was wonderful to see the pertinacity with which the washerwoman from Tooting brought the cart every Saturday, and her bills week after week. Mr. Raggles himself had to supply the greengroceries. The bill for servants' porter at the Fortune of War public house is a curiosity in the chronicles of beer. Every servant also was owed the greater part of his wages, and thus kept up perforce an interest in the house. Nobody in fact was paid. Not the blacksmith who opened the lock; nor the glazier who mended the pane; nor the jobber who let the carriage; nor the groom who drove it; nor the butcher who provided the leg of mutton; nor the coals which roasted it; nor the cook who basted it; nor the servants who ate it: and this I am given to understand is not unfrequently the way in which people live elegantly on nothing a year.\nIn a little town such things cannot be done without remark. We know there the quantity of milk our neighbour takes and espy the joint or the fowls which are going in for his dinner. So, probably, 200 and 202 in Curzon Street might know what was going on in the house between them, the servants communicating through the area-railings; but Crawley and his wife and his friends did not know 200 and 202. When you came to 201 there was a hearty welcome, a kind smile, a good dinner, and a jolly shake of the hand from the host and hostess there, just for all the world as if they had been undisputed masters of three or four thousand a year--and so they were, not in money, but in produce and labour--if they did not pay for the mutton, they had it: if they did not give bullion in exchange for their wine, how should we know? Never was better claret at any man's table than at honest Rawdon's; dinners more gay and neatly served. His drawing-rooms were the prettiest, little, modest salons conceivable: they were decorated with the greatest taste, and a thousand knick-knacks from Paris, by Rebecca: and when she sat at her piano trilling songs with a lightsome heart, the stranger voted himself in a little paradise of domestic comfort and agreed that, if the husband was rather stupid, the wife was charming, and the dinners the pleasantest in the world.\nRebecca's wit, cleverness, and flippancy made her speedily the vogue in London among a certain class. You saw demure chariots at her door, out of which stepped very great people. You beheld her carriage in the park, surrounded by dandies of note. The little box in the third tier of the opera was crowded with heads constantly changing; but it must be confessed that the ladies held aloof from her, and that their doors were shut to our little adventurer.\nWith regard to the world of female fashion and its customs, the present writer of course can only speak at second hand. A man can no more penetrate or understand those mysteries than he can know what the ladies talk about when they go upstairs after dinner. It is only by inquiry and perseverance that one sometimes gets hints of those secrets; and by a similar diligence every person who treads the Pall Mall pavement and frequents the clubs of this metropolis knows, either through his own experience or through some acquaintance with whom he plays at billiards or shares the joint, something about the genteel world of London, and how, as there are men (such as Rawdon Crawley, whose position we mentioned before) who cut a good figure to the eyes of the ignorant world and to the apprentices in the park, who behold them consorting with the most notorious dandies there, so there are ladies, who may be called men's women, being welcomed entirely by all the gentlemen and cut or slighted by all their wives. Mrs. Firebrace is of this sort; the lady with the beautiful fair ringlets whom you see every day in Hyde Park, surrounded by the greatest and most famous dandies of this empire. Mrs. Rockwood is another, whose parties are announced laboriously in the fashionable newspapers and with whom you see that all sorts of ambassadors and great noblemen dine; and many more might be mentioned had they to do with the history at present in hand. But while simple folks who are out of the world, or country people with a taste for the genteel, behold these ladies in their seeming glory in public places, or envy them from afar off, persons who are better instructed could inform them that these envied ladies have no more chance of establishing themselves in \"society,\" than the benighted squire's wife in Somersetshire who reads of their doings in the Morning Post. Men living about London are aware of these awful truths. You hear how pitilessly many ladies of seeming rank and wealth are excluded from this \"society.\" The frantic efforts which they make to enter this circle, the meannesses to which they submit, the insults which they undergo, are matters of wonder to those who take human or womankind for a study; and the pursuit of fashion under difficulties would be a fine theme for any very great person who had the wit, the leisure, and the knowledge of the English language necessary for the compiling of such a history.\nNow the few female acquaintances whom Mrs. Crawley had known abroad not only declined to visit her when she came to this side of the Channel, but cut her severely when they met in public places. It was curious to see how the great ladies forgot her, and no doubt not altogether a pleasant study to Rebecca. When Lady Bareacres met her in the waiting-room at the opera, she gathered her daughters about her as if they would be contaminated by a touch of Becky, and retreating a step or two, placed herself in front of them, and stared at her little enemy. To stare Becky out of countenance required a severer glance than even the frigid old Bareacres could shoot out of her dismal eyes. When Lady de la Mole, who had ridden a score of times by Becky's side at Brussels, met Mrs. Crawley's open carriage in Hyde Park, her Ladyship was quite blind, and could not in the least recognize her former friend. Even Mrs. Blenkinsop, the banker's wife, cut her at church. Becky went regularly to church now; it was edifying to see her enter there with Rawdon by her side, carrying a couple of large gilt prayer-books, and afterwards going through the ceremony with the gravest resignation.\nRawdon at first felt very acutely the slights which were passed upon his wife, and was inclined to be gloomy and savage. He talked of calling out the husbands or brothers of every one of the insolent women who did not pay a proper respect to his wife; and it was only by the strongest commands and entreaties on her part that he was brought into keeping a decent behaviour. \"You can't shoot me into society,\" she said good-naturedly. \"Remember, my dear, that I was but a governess, and you, you poor silly old man, have the worst reputation for debt, and dice, and all sorts of wickedness. We shall get quite as many friends as we want by and by, and in the meanwhile you must be a good boy and obey your schoolmistress in everything she tells you to do. When we heard that your aunt had left almost everything to Pitt and his wife, do you remember what a rage you were in? You would have told all Paris, if I had not made you keep your temper, and where would you have been now?--in prison at Ste. Pelagie for debt, and not established in London in a handsome house, with every comfort about you--you were in such a fury you were ready to murder your brother, you wicked Cain you, and what good would have come of remaining angry? All the rage in the world won't get us your aunt's money; and it is much better that we should be friends with your brother's family than enemies, as those foolish Butes are. When your father dies, Queen's Crawley will be a pleasant house for you and me to pass the winter in. If we are ruined, you can carve and take charge of the stable, and I can be a governess to Lady Jane's children. Ruined! fiddlede-dee! I will get you a good place before that; or Pitt and his little boy will die, and we will be Sir Rawdon and my lady. While there is life, there is hope, my dear, and I intend to make a man of you yet. Who sold your horses for you? Who paid your debts for you?\" Rawdon was obliged to confess that he owed all these benefits to his wife, and to trust himself to her guidance for the future.\nIndeed, when Miss Crawley quitted the world, and that money for which all her relatives had been fighting so eagerly was finally left to Pitt, Bute Crawley, who found that only five thousand pounds had been left to him instead of the twenty upon which he calculated, was in such a fury at his disappointment that he vented it in savage abuse upon his nephew; and the quarrel always rankling between them ended in an utter breach of intercourse. Rawdon Crawley's conduct, on the other hand, who got but a hundred pounds, was such as to astonish his brother and delight his sister-in-law, who was disposed to look kindly upon all the members of her husband's family. He wrote to his brother a very frank, manly, good-humoured letter from Paris. He was aware, he said, that by his own marriage he had forfeited his aunt's favour; and though he did not disguise his disappointment that she should have been so entirely relentless towards him, he was glad that the money was still kept in their branch of the family, and heartily congratulated his brother on his good fortune. He sent his affectionate remembrances to his sister, and hoped to have her good-will for Mrs. Rawdon; and the letter concluded with a postscript to Pitt in the latter lady's own handwriting. She, too, begged to join in her husband's congratulations. She should ever remember Mr. Crawley's kindness to her in early days when she was a friendless orphan, the instructress of his little sisters, in whose welfare she still took the tenderest interest. She wished him every happiness in his married life, and, asking his permission to offer her remembrances to Lady Jane (of whose goodness all the world informed her), she hoped that one day she might be allowed to present her little boy to his uncle and aunt, and begged to bespeak for him their good-will and protection.\nPitt Crawley received this communication very graciously--more graciously than Miss Crawley had received some of Rebecca's previous compositions in Rawdon's handwriting; and as for Lady Jane, she was so charmed with the letter that she expected her husband would instantly divide his aunt's legacy into two equal portions and send off one-half to his brother at Paris.\nTo her Ladyship's surprise, however, Pitt declined to accommodate his brother with a cheque for thirty thousand pounds. But he made Rawdon a handsome offer of his hand whenever the latter should come to England and choose to take it; and, thanking Mrs. Crawley for her good opinion of himself and Lady Jane, he graciously pronounced his willingness to take any opportunity to serve her little boy.\nThus an almost reconciliation was brought about between the brothers. When Rebecca came to town Pitt and his wife were not in London. Many a time she drove by the old door in Park Lane to see whether they had taken possession of Miss Crawley's house there. But the new family did not make its appearance; it was only through Raggles that she heard of their movements--how Miss Crawley's domestics had been dismissed with decent gratuities, and how Mr. Pitt had only once made his appearance in London, when he stopped for a few days at the house, did business with his lawyers there, and sold off all Miss Crawley's French novels to a bookseller out of Bond Street. Becky had reasons of her own which caused her to long for the arrival of her new relation. \"When Lady Jane comes,\" thought she, \"she shall be my sponsor in London society; and as for the women! bah! the women will ask me when they find the men want to see me.\"\nAn article as necessary to a lady in this position as her brougham or her bouquet is her companion. I have always admired the way in which the tender creatures, who cannot exist without sympathy, hire an exceedingly plain friend of their own sex from whom they are almost inseparable. The sight of that inevitable woman in her faded gown seated behind her dear friend in the opera-box, or occupying the back seat of the barouche, is always a wholesome and moral one to me, as jolly a reminder as that of the Death's-head which figured in the repasts of Egyptian bon-vivants, a strange sardonic memorial of Vanity Fair. What? even battered, brazen, beautiful, conscienceless, heartless, Mrs. Firebrace, whose father died of her shame: even lovely, daring Mrs. Mantrap, who will ride at any fence which any man in England will take, and who drives her greys in the park, while her mother keeps a huckster's stall in Bath still--even those who are so bold, one might fancy they could face anything, dare not face the world without a female friend. They must have somebody to cling to, the affectionate creatures! And you will hardly see them in any public place without a shabby companion in a dyed silk, sitting somewhere in the shade close behind them.\n\"Rawdon,\" said Becky, very late one night, as a party of gentlemen were seated round her crackling drawing-room fire (for the men came to her house to finish the night; and she had ice and coffee for them, the best in London): \"I must have a sheep-dog.\"\n\"A what?\" said Rawdon, looking up from an ecarte table.\n\"A sheep-dog!\" said young Lord Southdown. \"My dear Mrs. Crawley, what a fancy! Why not have a Danish dog? I know of one as big as a camel-leopard, by Jove. It would almost pull your brougham. Or a Persian greyhound, eh? (I propose, if you please); or a little pug that would go into one of Lord Steyne's snuff-boxes? There's a man at Bayswater got one with such a nose that you might--I mark the king and play--that you might hang your hat on it.\"\n\"I mark the trick,\" Rawdon gravely said. He attended to his game commonly and didn't much meddle with the conversation, except when it was about horses and betting.\n\"What CAN you want with a shepherd's dog?\" the lively little Southdown continued.\n\"I mean a MORAL shepherd's dog,\" said Becky, laughing and looking up at Lord Steyne.\n\"What the devil's that?\" said his Lordship.\n\"A dog to keep the wolves off me,\" Rebecca continued. \"A companion.\"\n\"Dear little innocent lamb, you want one,\" said the marquis; and his jaw thrust out, and he began to grin hideously, his little eyes leering towards Rebecca.\nThe great Lord of Steyne was standing by the fire sipping coffee. The fire crackled and blazed pleasantly. There was a score of candles sparkling round the mantel piece, in all sorts of quaint sconces, of gilt and bronze and porcelain. They lighted up Rebecca's figure to admiration, as she sat on a sofa covered with a pattern of gaudy flowers. She was in a pink dress that looked as fresh as a rose; her dazzling white arms and shoulders were half-covered with a thin hazy scarf through which they sparkled; her hair hung in curls round her neck; one of her little feet peeped out from the fresh crisp folds of the silk: the prettiest little foot in the prettiest little sandal in the finest silk stocking in the world.\nThe candles lighted up Lord Steyne's shining bald head, which was fringed with red hair. He had thick bushy eyebrows, with little twinkling bloodshot eyes, surrounded by a thousand wrinkles. His jaw was underhung, and when he laughed, two white buck-teeth protruded themselves and glistened savagely in the midst of the grin. He had been dining with royal personages, and wore his garter and ribbon. A short man was his Lordship, broad-chested and bow-legged, but proud of the fineness of his foot and ankle, and always caressing his garter-knee.\n\"And so the shepherd is not enough,\" said he, \"to defend his lambkin?\"\n\"The shepherd is too fond of playing at cards and going to his clubs,\" answered Becky, laughing.\n\"'Gad, what a debauched Corydon!\" said my lord--\"what a mouth for a pipe!\"\n\"I take your three to two,\" here said Rawdon, at the card-table.\n\"Hark at Meliboeus,\" snarled the noble marquis; \"he's pastorally occupied too: he's shearing a Southdown. What an innocent mutton, hey? Damme, what a snowy fleece!\"\nRebecca's eyes shot out gleams of scornful humour. \"My lord,\" she said, \"you are a knight of the Order.\" He had the collar round his neck, indeed--a gift of the restored princes of Spain.\nLord Steyne in early life had been notorious for his daring and his success at play. He had sat up two days and two nights with Mr. Fox at hazard. He had won money of the most august personages of the realm: he had won his marquisate, it was said, at the gaming-table; but he did not like an allusion to those bygone fredaines. Rebecca saw the scowl gathering over his heavy brow.\nShe rose up from her sofa and went and took his coffee cup out of his hand with a little curtsey. \"Yes,\" she said, \"I must get a watchdog. But he won't bark at YOU.\" And, going into the other drawing-room, she sat down to the piano and began to sing little French songs in such a charming, thrilling voice that the mollified nobleman speedily followed her into that chamber, and might be seen nodding his head and bowing time over her.\nRawdon and his friend meanwhile played ecarte until they had enough. The Colonel won; but, say that he won ever so much and often, nights like these, which occurred many times in the week--his wife having all the talk and all the admiration, and he sitting silent without the circle, not comprehending a word of the jokes, the allusions, the mystical language within--must have been rather wearisome to the ex-dragoon.\n\"How is Mrs. Crawley's husband?\" Lord Steyne used to say to him by way of a good day when they met; and indeed that was now his avocation in life. He was Colonel Crawley no more. He was Mrs. Crawley's husband.\nAbout the little Rawdon, if nothing has been said all this while, it is because he is hidden upstairs in a garret somewhere, or has crawled below into the kitchen for companionship. His mother scarcely ever took notice of him. He passed the days with his French bonne as long as that domestic remained in Mr. Crawley's family, and when the Frenchwoman went away, the little fellow, howling in the loneliness of the night, had compassion taken on him by a housemaid, who took him out of his solitary nursery into her bed in the garret hard by and comforted him.\nRebecca, my Lord Steyne, and one or two more were in the drawing-room taking tea after the opera, when this shouting was heard overhead. \"It's my cherub crying for his nurse,\" she said. She did not offer to move to go and see the child. \"Don't agitate your feelings by going to look for him,\" said Lord Steyne sardonically. \"Bah!\" replied the other, with a sort of blush, \"he'll cry himself to sleep\"; and they fell to talking about the opera.\nRawdon had stolen off though, to look after his son and heir; and came back to the company when he found that honest Dolly was consoling the child. The Colonel's dressing-room was in those upper regions. He used to see the boy there in private. They had interviews together every morning when he shaved; Rawdon minor sitting on a box by his father's side and watching the operation with never-ceasing pleasure. He and the sire were great friends. The father would bring him sweetmeats from the dessert and hide them in a certain old epaulet box, where the child went to seek them, and laughed with joy on discovering the treasure; laughed, but not too loud: for mamma was below asleep and must not be disturbed. She did not go to rest till very late and seldom rose till after noon.\nRawdon bought the boy plenty of picture-books and crammed his nursery with toys. Its walls were covered with pictures pasted up by the father's own hand and purchased by him for ready money. When he was off duty with Mrs. Rawdon in the park, he would sit up here, passing hours with the boy; who rode on his chest, who pulled his great mustachios as if they were driving-reins, and spent days with him in indefatigable gambols. The room was a low room, and once, when the child was not five years old, his father, who was tossing him wildly up in his arms, hit the poor little chap's skull so violently against the ceiling that he almost dropped the child, so terrified was he at the disaster.\nRawdon minor had made up his face for a tremendous howl--the severity of the blow indeed authorized that indulgence; but just as he was going to begin, the father interposed.\n\"For God's sake, Rawdy, don't wake Mamma,\" he cried. And the child, looking in a very hard and piteous way at his father, bit his lips, clenched his hands, and didn't cry a bit. Rawdon told that story at the clubs, at the mess, to everybody in town. \"By Gad, sir,\" he explained to the public in general, \"what a good plucked one that boy of mine is--what a trump he is! I half-sent his head through the ceiling, by Gad, and he wouldn't cry for fear of disturbing his mother.\"\nSometimes--once or twice in a week--that lady visited the upper regions in which the child lived. She came like a vivified figure out of the Magasin des Modes--blandly smiling in the most beautiful new clothes and little gloves and boots. Wonderful scarfs, laces, and jewels glittered about her. She had always a new bonnet on, and flowers bloomed perpetually in it, or else magnificent curling ostrich feathers, soft and snowy as camellias. She nodded twice or thrice patronizingly to the little boy, who looked up from his dinner or from the pictures of soldiers he was painting. When she left the room, an odour of rose, or some other magical fragrance, lingered about the nursery. She was an unearthly being in his eyes, superior to his father--to all the world: to be worshipped and admired at a distance. To drive with that lady in the carriage was an awful rite: he sat up in the back seat and did not dare to speak: he gazed with all his eyes at the beautifully dressed Princess opposite to him. Gentlemen on splendid prancing horses came up and smiled and talked with her. How her eyes beamed upon all of them! Her hand used to quiver and wave gracefully as they passed. When he went out with her he had his new red dress on. His old brown holland was good enough when he stayed at home. Sometimes, when she was away, and Dolly his maid was making his bed, he came into his mother's room. It was as the abode of a fairy to him--a mystic chamber of splendour and delights. There in the wardrobe hung those wonderful robes--pink and blue and many-tinted. There was the jewel-case, silver-clasped, and the wondrous bronze hand on the dressing-table, glistening all over with a hundred rings. There was the cheval-glass, that miracle of art, in which he could just see his own wondering head and the reflection of Dolly (queerly distorted, and as if up in the ceiling), plumping and patting the pillows of the bed. Oh, thou poor lonely little benighted boy! Mother is the name for God in the lips and hearts of little children; and here was one who was worshipping a stone!\nNow Rawdon Crawley, rascal as the Colonel was, had certain manly tendencies of affection in his heart and could love a child and a woman still. For Rawdon minor he had a great secret tenderness then, which did not escape Rebecca, though she did not talk about it to her husband. It did not annoy her: she was too good-natured. It only increased her scorn for him. He felt somehow ashamed of this paternal softness and hid it from his wife--only indulging in it when alone with the boy.\nHe used to take him out of mornings when they would go to the stables together and to the park. Little Lord Southdown, the best-natured of men, who would make you a present of the hat from his head, and whose main occupation in life was to buy knick-knacks that he might give them away afterwards, bought the little chap a pony not much bigger than a large rat, the donor said, and on this little black Shetland pygmy young Rawdon's great father was pleased to mount the boy, and to walk by his side in the park. It pleased him to see his old quarters, and his old fellow-guardsmen at Knightsbridge: he had begun to think of his bachelorhood with something like regret. The old troopers were glad to recognize their ancient officer and dandle the little colonel. Colonel Crawley found dining at mess and with his brother-officers very pleasant. \"Hang it, I ain't clever enough for her--I know it. She won't miss me,\" he used to say: and he was right, his wife did not miss him.\nRebecca was fond of her husband. She was always perfectly good-humoured and kind to him. She did not even show her scorn much for him; perhaps she liked him the better for being a fool. He was her upper servant and maitre d'hotel. He went on her errands; obeyed her orders without question; drove in the carriage in the ring with her without repining; took her to the opera-box, solaced himself at his club during the performance, and came punctually back to fetch her when due. He would have liked her to be a little fonder of the boy, but even to that he reconciled himself. \"Hang it, you know she's so clever,\" he said, \"and I'm not literary and that, you know.\" For, as we have said before, it requires no great wisdom to be able to win at cards and billiards, and Rawdon made no pretensions to any other sort of skill.\nWhen the companion came, his domestic duties became very light. His wife encouraged him to dine abroad: she would let him off duty at the opera. \"Don't stay and stupefy yourself at home to-night, my dear,\" she would say. \"Some men are coming who will only bore you. I would not ask them, but you know it's for your good, and now I have a sheep-dog, I need not be afraid to be alone.\"\n\"A sheep-dog--a companion! Becky Sharp with a companion! Isn't it good fun?\" thought Mrs. Crawley to herself. The notion tickled hugely her sense of humour.\nOne Sunday morning, as Rawdon Crawley, his little son, and the pony were taking their accustomed walk in the park, they passed by an old acquaintance of the Colonel's, Corporal Clink, of the regiment, who was in conversation with a friend, an old gentleman, who held a boy in his arms about the age of little Rawdon. This other youngster had seized hold of the Waterloo medal which the Corporal wore, and was examining it with delight.\n\"Good morning, your Honour,\" said Clink, in reply to the \"How do, Clink?\" of the Colonel. \"This ere young gentleman is about the little Colonel's age, sir,\" continued the corporal.\n\"His father was a Waterloo man, too,\" said the old gentleman, who carried the boy. \"Wasn't he, Georgy?\"\n\"Yes,\" said Georgy. He and the little chap on the pony were looking at each other with all their might--solemnly scanning each other as children do.\n\"In a line regiment,\" Clink said with a patronizing air.\n\"He was a Captain in the --th regiment,\" said the old gentleman rather pompously. \"Captain George Osborne, sir--perhaps you knew him. He died the death of a hero, sir, fighting against the Corsican tyrant.\" Colonel Crawley blushed quite red. \"I knew him very well, sir,\" he said, \"and his wife, his dear little wife, sir--how is she?\"\n\"She is my daughter, sir,\" said the old gentleman, putting down the boy and taking out a card with great solemnity, which he handed to the Colonel. On it written--\n\"Mr. Sedley, Sole Agent for the Black Diamond and Anti-Cinder Coal Association, Bunker's Wharf, Thames Street, and Anna-Maria Cottages, Fulham Road West.\"\nLittle Georgy went up and looked at the Shetland pony.\n\"Should you like to have a ride?\" said Rawdon minor from the saddle.\n\"Yes,\" said Georgy. The Colonel, who had been looking at him with some interest, took up the child and put him on the pony behind Rawdon minor.\n\"Take hold of him, Georgy,\" he said--\"take my little boy round the waist--his name is Rawdon.\" And both the children began to laugh.\n\"You won't see a prettier pair I think, THIS summer's day, sir,\" said the good-natured Corporal; and the Colonel, the Corporal, and old Mr. Sedley with his umbrella, walked by the side of the children.",
        "paragraph_chars": [
            [
                0,
                492
            ],
            [
                492,
                1622
            ],
            [
                1622,
                2945
            ],
            [
                2945,
                3641
            ],
            [
                3641,
                3964
            ],
            [
                3964,
                4646
            ],
            [
                4646,
                5850
            ],
            [
                5850,
                6940
            ],
            [
                6940,
                7954
            ],
            [
                7954,
                9309
            ],
            [
                9309,
                9765
            ],
            [
                9765,
                12200
            ],
            [
                12200,
                13380
            ],
            [
                13380,
                15413
            ],
            [
                15413,
                17255
            ],
            [
                17255,
                17624
            ],
            [
                17624,
                18022
            ],
            [
                18022,
                18949
            ],
            [
                18949,
                20201
            ],
            [
                20201,
                20455
            ],
            [
                20455,
                20511
            ],
            [
                20511,
                20959
            ],
            [
                20959,
                21124
            ],
            [
                21124,
                21206
            ],
            [
                21206,
                21291
            ],
            [
                21291,
                21335
            ],
            [
                21335,
                21404
            ],
            [
                21404,
                21562
            ],
            [
                21562,
                22284
            ],
            [
                22284,
                22831
            ],
            [
                22831,
                22902
            ],
            [
                22902,
                22999
            ],
            [
                22999,
                23074
            ],
            [
                23074,
                23139
            ],
            [
                23139,
                23304
            ],
            [
                23304,
                23492
            ],
            [
                23492,
                23873
            ],
            [
                23873,
                24309
            ],
            [
                24309,
                24728
            ],
            [
                24728,
                24938
            ],
            [
                24938,
                25499
            ],
            [
                25499,
                25943
            ],
            [
                25943,
                26726
            ],
            [
                26726,
                27420
            ],
            [
                27420,
                27595
            ],
            [
                27595,
                28071
            ],
            [
                28071,
                30150
            ],
            [
                30150,
                30636
            ],
            [
                30636,
                31614
            ],
            [
                31614,
                32438
            ],
            [
                32438,
                32822
            ],
            [
                32822,
                32979
            ],
            [
                32979,
                33415
            ],
            [
                33415,
                33596
            ],
            [
                33596,
                33700
            ],
            [
                33700,
                33849
            ],
            [
                33849,
                33906
            ],
            [
                33906,
                34241
            ],
            [
                34241,
                34405
            ],
            [
                34405,
                34560
            ],
            [
                34560,
                34615
            ],
            [
                34615,
                34684
            ],
            [
                34684,
                34828
            ],
            [
                34828,
                34961
            ],
            [
                34961,
                35162
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                425
            ],
            [
                425,
                492
            ],
            [
                492,
                726
            ],
            [
                726,
                907
            ],
            [
                907,
                1321
            ],
            [
                1321,
                1622
            ],
            [
                1622,
                1726
            ],
            [
                1726,
                1923
            ],
            [
                1923,
                2168
            ],
            [
                2168,
                2293
            ],
            [
                2293,
                2571
            ],
            [
                2571,
                2945
            ],
            [
                2945,
                3024
            ],
            [
                3024,
                3090
            ],
            [
                3090,
                3359
            ],
            [
                3359,
                3641
            ],
            [
                3641,
                3676
            ],
            [
                3676,
                3964
            ],
            [
                3964,
                4053
            ],
            [
                4053,
                4553
            ],
            [
                4553,
                4646
            ],
            [
                4646,
                4757
            ],
            [
                4757,
                4949
            ],
            [
                4949,
                5179
            ],
            [
                5179,
                5850
            ],
            [
                5850,
                6106
            ],
            [
                6106,
                6368
            ],
            [
                6368,
                6743
            ],
            [
                6743,
                6940
            ],
            [
                6940,
                7070
            ],
            [
                7070,
                7122
            ],
            [
                7122,
                7266
            ],
            [
                7266,
                7320
            ],
            [
                7320,
                7427
            ],
            [
                7427,
                7538
            ],
            [
                7538,
                7563
            ],
            [
                7563,
                7954
            ],
            [
                7954,
                8014
            ],
            [
                8014,
                8136
            ],
            [
                8136,
                8356
            ],
            [
                8356,
                8778
            ],
            [
                8778,
                8882
            ],
            [
                8882,
                9309
            ],
            [
                9309,
                9411
            ],
            [
                9411,
                9488
            ],
            [
                9488,
                9556
            ],
            [
                9556,
                9765
            ],
            [
                9765,
                9885
            ],
            [
                9885,
                10023
            ],
            [
                10023,
                10777
            ],
            [
                10777,
                10955
            ],
            [
                10955,
                11213
            ],
            [
                11213,
                11634
            ],
            [
                11634,
                11691
            ],
            [
                11691,
                11788
            ],
            [
                11788,
                12200
            ],
            [
                12200,
                12395
            ],
            [
                12395,
                12507
            ],
            [
                12507,
                12755
            ],
            [
                12755,
                12886
            ],
            [
                12886,
                13102
            ],
            [
                13102,
                13162
            ],
            [
                13162,
                13380
            ],
            [
                13380,
                13501
            ],
            [
                13501,
                13754
            ],
            [
                13754,
                13814
            ],
            [
                13814,
                13970
            ],
            [
                13970,
                14135
            ],
            [
                14135,
                14254
            ],
            [
                14254,
                14379
            ],
            [
                14379,
                14612
            ],
            [
                14612,
                14787
            ],
            [
                14787,
                14889
            ],
            [
                14889,
                15002
            ],
            [
                15002,
                15010
            ],
            [
                15010,
                15024
            ],
            [
                15024,
                15141
            ],
            [
                15141,
                15225
            ],
            [
                15225,
                15255
            ],
            [
                15255,
                15285
            ],
            [
                15285,
                15413
            ],
            [
                15413,
                15858
            ],
            [
                15858,
                16078
            ],
            [
                16078,
                16156
            ],
            [
                16156,
                16485
            ],
            [
                16485,
                16676
            ],
            [
                16676,
                16735
            ],
            [
                16735,
                16934
            ],
            [
                16934,
                17255
            ],
            [
                17255,
                17624
            ],
            [
                17624,
                17744
            ],
            [
                17744,
                18022
            ],
            [
                18022,
                18092
            ],
            [
                18092,
                18156
            ],
            [
                18156,
                18279
            ],
            [
                18279,
                18688
            ],
            [
                18688,
                18779
            ],
            [
                18779,
                18882
            ],
            [
                18882,
                18887
            ],
            [
                18887,
                18949
            ],
            [
                18949,
                19049
            ],
            [
                19049,
                19234
            ],
            [
                19234,
                19568
            ],
            [
                19568,
                19574
            ],
            [
                19574,
                19994
            ],
            [
                19994,
                20059
            ],
            [
                20059,
                20201
            ],
            [
                20201,
                20455
            ],
            [
                20455,
                20465
            ],
            [
                20465,
                20511
            ],
            [
                20511,
                20526
            ],
            [
                20526,
                20553
            ],
            [
                20553,
                20590
            ],
            [
                20590,
                20617
            ],
            [
                20617,
                20667
            ],
            [
                20667,
                20703
            ],
            [
                20703,
                20731
            ],
            [
                20731,
                20828
            ],
            [
                20828,
                20959
            ],
            [
                20959,
                21000
            ],
            [
                21000,
                21124
            ],
            [
                21124,
                21167
            ],
            [
                21167,
                21206
            ],
            [
                21206,
                21291
            ],
            [
                21291,
                21316
            ],
            [
                21316,
                21335
            ],
            [
                21335,
                21389
            ],
            [
                21389,
                21404
            ],
            [
                21404,
                21562
            ],
            [
                21562,
                21628
            ],
            [
                21628,
                21669
            ],
            [
                21669,
                21798
            ],
            [
                21798,
                21908
            ],
            [
                21908,
                22284
            ],
            [
                22284,
                22373
            ],
            [
                22373,
                22475
            ],
            [
                22475,
                22610
            ],
            [
                22610,
                22684
            ],
            [
                22684,
                22831
            ],
            [
                22831,
                22902
            ],
            [
                22902,
                22999
            ],
            [
                22999,
                23033
            ],
            [
                23033,
                23074
            ],
            [
                23074,
                23139
            ],
            [
                23139,
                23245
            ],
            [
                23245,
                23275
            ],
            [
                23275,
                23304
            ],
            [
                23304,
                23355
            ],
            [
                23355,
                23409
            ],
            [
                23409,
                23492
            ],
            [
                23492,
                23577
            ],
            [
                23577,
                23639
            ],
            [
                23639,
                23820
            ],
            [
                23820,
                23873
            ],
            [
                23873,
                23971
            ],
            [
                23971,
                24012
            ],
            [
                24012,
                24039
            ],
            [
                24039,
                24309
            ],
            [
                24309,
                24378
            ],
            [
                24378,
                24728
            ],
            [
                24728,
                24761
            ],
            [
                24761,
                24875
            ],
            [
                24875,
                24907
            ],
            [
                24907,
                24938
            ],
            [
                24938,
                25120
            ],
            [
                25120,
                25165
            ],
            [
                25165,
                25499
            ],
            [
                25499,
                25636
            ],
            [
                25636,
                25685
            ],
            [
                25685,
                25736
            ],
            [
                25736,
                25823
            ],
            [
                25823,
                25830
            ],
            [
                25830,
                25943
            ],
            [
                25943,
                26091
            ],
            [
                26091,
                26147
            ],
            [
                26147,
                26188
            ],
            [
                26188,
                26354
            ],
            [
                26354,
                26390
            ],
            [
                26390,
                26655
            ],
            [
                26655,
                26726
            ],
            [
                26726,
                26807
            ],
            [
                26807,
                26917
            ],
            [
                26917,
                27154
            ],
            [
                27154,
                27420
            ],
            [
                27420,
                27595
            ],
            [
                27595,
                27648
            ],
            [
                27648,
                27773
            ],
            [
                27773,
                27845
            ],
            [
                27845,
                27965
            ],
            [
                27965,
                28071
            ],
            [
                28071,
                28169
            ],
            [
                28169,
                28310
            ],
            [
                28310,
                28367
            ],
            [
                28367,
                28513
            ],
            [
                28513,
                28653
            ],
            [
                28653,
                28756
            ],
            [
                28756,
                28882
            ],
            [
                28882,
                29075
            ],
            [
                29075,
                29153
            ],
            [
                29153,
                29191
            ],
            [
                29191,
                29251
            ],
            [
                29251,
                29306
            ],
            [
                29306,
                29368
            ],
            [
                29368,
                29469
            ],
            [
                29469,
                29552
            ],
            [
                29552,
                29633
            ],
            [
                29633,
                29769
            ],
            [
                29769,
                29991
            ],
            [
                29991,
                30034
            ],
            [
                30034,
                30150
            ],
            [
                30150,
                30294
            ],
            [
                30294,
                30429
            ],
            [
                30429,
                30477
            ],
            [
                30477,
                30514
            ],
            [
                30514,
                30636
            ],
            [
                30636,
                30732
            ],
            [
                30732,
                31149
            ],
            [
                31149,
                31306
            ],
            [
                31306,
                31399
            ],
            [
                31399,
                31481
            ],
            [
                31481,
                31533
            ],
            [
                31533,
                31614
            ],
            [
                31614,
                31647
            ],
            [
                31647,
                31703
            ],
            [
                31703,
                31800
            ],
            [
                31800,
                31845
            ],
            [
                31845,
                32093
            ],
            [
                32093,
                32191
            ],
            [
                32191,
                32280
            ],
            [
                32280,
                32438
            ],
            [
                32438,
                32502
            ],
            [
                32502,
                32583
            ],
            [
                32583,
                32659
            ],
            [
                32659,
                32704
            ],
            [
                32704,
                32822
            ],
            [
                32822,
                32849
            ],
            [
                32849,
                32879
            ],
            [
                32879,
                32899
            ],
            [
                32899,
                32932
            ],
            [
                32932,
                32979
            ],
            [
                32979,
                33296
            ],
            [
                33296,
                33415
            ],
            [
                33415,
                33489
            ],
            [
                33489,
                33505
            ],
            [
                33505,
                33596
            ],
            [
                33596,
                33679
            ],
            [
                33679,
                33700
            ],
            [
                33700,
                33720
            ],
            [
                33720,
                33849
            ],
            [
                33849,
                33906
            ],
            [
                33906,
                33988
            ],
            [
                33988,
                34040
            ],
            [
                34040,
                34113
            ],
            [
                34113,
                34148
            ],
            [
                34148,
                34241
            ],
            [
                34241,
                34389
            ],
            [
                34389,
                34405
            ],
            [
                34405,
                34560
            ],
            [
                34560,
                34615
            ],
            [
                34615,
                34649
            ],
            [
                34649,
                34684
            ],
            [
                34684,
                34704
            ],
            [
                34704,
                34828
            ],
            [
                34828,
                34923
            ],
            [
                34923,
                34961
            ],
            [
                34961,
                35162
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                79,
                131
            ],
            [
                131,
                267
            ],
            [
                280,
                289
            ],
            [
                299,
                316
            ],
            [
                321,
                339
            ],
            [
                346,
                379
            ],
            [
                396,
                407
            ],
            [
                423,
                425
            ],
            [
                425,
                492
            ],
            [
                492,
                516
            ],
            [
                530,
                550
            ],
            [
                562,
                589
            ],
            [
                600,
                629
            ],
            [
                638,
                641
            ],
            [
                693,
                718
            ],
            [
                659,
                674
            ],
            [
                724,
                726
            ],
            [
                726,
                753
            ],
            [
                773,
                836
            ],
            [
                890,
                907
            ],
            [
                944,
                979
            ],
            [
                1078,
                1113
            ],
            [
                924,
                925
            ],
            [
                1158,
                1185
            ],
            [
                1272,
                1298
            ],
            [
                1319,
                1321
            ],
            [
                1563,
                1565
            ],
            [
                1325,
                1330
            ],
            [
                1333,
                1334
            ],
            [
                1321,
                1324
            ],
            [
                1437,
                1445
            ],
            [
                1353,
                1356
            ],
            [
                1386,
                1401
            ],
            [
                1620,
                1622
            ],
            [
                1622,
                1633
            ],
            [
                1639,
                1646
            ],
            [
                1676,
                1687
            ],
            [
                1695,
                1709
            ],
            [
                1724,
                1726
            ],
            [
                1726,
                1739
            ],
            [
                1877,
                1878
            ],
            [
                1744,
                1791
            ],
            [
                2130,
                2168
            ],
            [
                2184,
                2231
            ],
            [
                2247,
                2251
            ],
            [
                2265,
                2275
            ],
            [
                2544,
                2549
            ],
            [
                2232,
                2234
            ],
            [
                2293,
                2312
            ],
            [
                2395,
                2399
            ],
            [
                2404,
                2408
            ],
            [
                2425,
                2434
            ],
            [
                2321,
                2322
            ],
            [
                2471,
                2493
            ],
            [
                2504,
                2522
            ],
            [
                2550,
                2553
            ],
            [
                2562,
                2571
            ],
            [
                2578,
                2615
            ],
            [
                2620,
                2629
            ],
            [
                2632,
                2645
            ],
            [
                2647,
                2701
            ],
            [
                2616,
                2619
            ],
            [
                2739,
                2765
            ],
            [
                2766,
                2822
            ],
            [
                2870,
                2945
            ],
            [
                2945,
                2985
            ],
            [
                3024,
                3026
            ],
            [
                3040,
                3046
            ],
            [
                3086,
                3088
            ],
            [
                3057,
                3062
            ],
            [
                3088,
                3090
            ],
            [
                3090,
                3120
            ],
            [
                3138,
                3160
            ],
            [
                3170,
                3175
            ],
            [
                3190,
                3196
            ],
            [
                3176,
                3189
            ],
            [
                3197,
                3212
            ],
            [
                3243,
                3261
            ],
            [
                3268,
                3284
            ],
            [
                3301,
                3305
            ],
            [
                3336,
                3358
            ],
            [
                3641,
                3676
            ],
            [
                3676,
                3697
            ],
            [
                3701,
                3712
            ],
            [
                3722,
                3849
            ],
            [
                3859,
                3877
            ],
            [
                3895,
                3934
            ],
            [
                3955,
                3964
            ],
            [
                3964,
                3977
            ],
            [
                3989,
                4043
            ],
            [
                4051,
                4053
            ],
            [
                4568,
                4588
            ],
            [
                4638,
                4644
            ],
            [
                4631,
                4637
            ],
            [
                4644,
                4645
            ],
            [
                4646,
                4757
            ],
            [
                4884,
                4891
            ],
            [
                4769,
                4773
            ],
            [
                4757,
                4768
            ],
            [
                4801,
                4802
            ],
            [
                4777,
                4780
            ],
            [
                4965,
                4990
            ],
            [
                4878,
                4879
            ],
            [
                5003,
                5006
            ],
            [
                5018,
                5055
            ],
            [
                4827,
                4831
            ],
            [
                5057,
                5069
            ],
            [
                5080,
                5123
            ],
            [
                4901,
                4902
            ],
            [
                5179,
                5183
            ],
            [
                5192,
                5195
            ],
            [
                5203,
                5344
            ],
            [
                5392,
                5404
            ],
            [
                5828,
                5830
            ],
            [
                5408,
                5414
            ],
            [
                5195,
                5196
            ],
            [
                5372,
                5379
            ],
            [
                5359,
                5361
            ],
            [
                5437,
                5451
            ],
            [
                5388,
                5391
            ],
            [
                5362,
                5365
            ],
            [
                5466,
                5472
            ],
            [
                5201,
                5202
            ],
            [
                5474,
                5481
            ],
            [
                5497,
                5516
            ],
            [
                5526,
                5698
            ],
            [
                5704,
                5745
            ],
            [
                5416,
                5419
            ],
            [
                5761,
                5765
            ],
            [
                5754,
                5760
            ],
            [
                5188,
                5191
            ],
            [
                5766,
                5781
            ],
            [
                5848,
                5850
            ],
            [
                5850,
                5890
            ],
            [
                5906,
                5910
            ],
            [
                5934,
                5936
            ],
            [
                5947,
                5951
            ],
            [
                5953,
                6002
            ],
            [
                5899,
                5902
            ],
            [
                6018,
                6046
            ],
            [
                6104,
                6106
            ],
            [
                6106,
                6131
            ],
            [
                6137,
                6140
            ],
            [
                6253,
                6368
            ],
            [
                6368,
                6382
            ],
            [
                6411,
                6414
            ],
            [
                6385,
                6396
            ],
            [
                6617,
                6618
            ],
            [
                6456,
                6458
            ],
            [
                6466,
                6475
            ],
            [
                6654,
                6655
            ],
            [
                6567,
                6589
            ],
            [
                6741,
                6743
            ],
            [
                6743,
                6826
            ],
            [
                6938,
                6940
            ],
            [
                6940,
                6970
            ],
            [
                7004,
                7031
            ],
            [
                7058,
                7070
            ],
            [
                7070,
                7122
            ],
            [
                7122,
                7149
            ],
            [
                7156,
                7188
            ],
            [
                7202,
                7266
            ],
            [
                7266,
                7320
            ],
            [
                7427,
                7440
            ],
            [
                7446,
                7454
            ],
            [
                7472,
                7502
            ],
            [
                7512,
                7538
            ],
            [
                7538,
                7544
            ],
            [
                7553,
                7563
            ],
            [
                7563,
                7703
            ],
            [
                7846,
                7850
            ],
            [
                7876,
                7878
            ],
            [
                7896,
                7954
            ],
            [
                8373,
                8376
            ],
            [
                8165,
                8178
            ],
            [
                8377,
                8417
            ],
            [
                8154,
                8157
            ],
            [
                8419,
                8432
            ],
            [
                8464,
                8489
            ],
            [
                8495,
                8501
            ],
            [
                8520,
                8534
            ],
            [
                8562,
                8591
            ],
            [
                8354,
                8355
            ],
            [
                8593,
                8604
            ],
            [
                8330,
                8333
            ],
            [
                8609,
                8650
            ],
            [
                8809,
                8812
            ],
            [
                8788,
                8801
            ],
            [
                8821,
                8825
            ],
            [
                8836,
                8842
            ],
            [
                8844,
                8845
            ],
            [
                8882,
                8918
            ],
            [
                8920,
                8926
            ],
            [
                8935,
                8953
            ],
            [
                8918,
                8919
            ],
            [
                8965,
                8974
            ],
            [
                9040,
                9050
            ],
            [
                8975,
                8979
            ],
            [
                9015,
                9038
            ],
            [
                8880,
                8881
            ],
            [
                9056,
                9096
            ],
            [
                9119,
                9133
            ],
            [
                9140,
                9205
            ],
            [
                9209,
                9261
            ],
            [
                9307,
                9309
            ],
            [
                9309,
                9411
            ],
            [
                9488,
                9546
            ],
            [
                9554,
                9556
            ],
            [
                9567,
                9613
            ],
            [
                9644,
                9649
            ],
            [
                9676,
                9711
            ],
            [
                9717,
                9728
            ],
            [
                9739,
                9765
            ],
            [
                10643,
                10659
            ],
            [
                10661,
                10740
            ],
            [
                10748,
                10777
            ],
            [
                10777,
                10807
            ],
            [
                10809,
                10901
            ],
            [
                10924,
                10938
            ],
            [
                10953,
                10955
            ],
            [
                10955,
                11008
            ],
            [
                11021,
                11050
            ],
            [
                11211,
                11213
            ],
            [
                11213,
                11235
            ],
            [
                11374,
                11383
            ],
            [
                11397,
                11421
            ],
            [
                11451,
                11461
            ],
            [
                11469,
                11483
            ],
            [
                11489,
                11536
            ],
            [
                11240,
                11243
            ],
            [
                11704,
                11714
            ],
            [
                11758,
                11766
            ],
            [
                11632,
                11633
            ],
            [
                12200,
                12315
            ],
            [
                12340,
                12386
            ],
            [
                12393,
                12395
            ],
            [
                12507,
                12526
            ],
            [
                12531,
                12541
            ],
            [
                12562,
                12567
            ],
            [
                12549,
                12550
            ],
            [
                12567,
                12663
            ],
            [
                12727,
                12733
            ],
            [
                12734,
                12755
            ],
            [
                13107,
                13160
            ],
            [
                13260,
                13261
            ],
            [
                13162,
                13182
            ],
            [
                13193,
                13196
            ],
            [
                13378,
                13380
            ],
            [
                13380,
                13425
            ],
            [
                13444,
                13466
            ],
            [
                13482,
                13501
            ],
            [
                13501,
                13538
            ],
            [
                13564,
                13597
            ],
            [
                13611,
                13618
            ],
            [
                13622,
                13673
            ],
            [
                13689,
                13712
            ],
            [
                13752,
                13753
            ],
            [
                13754,
                13814
            ],
            [
                13814,
                13844
            ],
            [
                13849,
                13885
            ],
            [
                13890,
                13929
            ],
            [
                13931,
                13934
            ],
            [
                13958,
                13970
            ],
            [
                13970,
                14070
            ],
            [
                14133,
                14135
            ],
            [
                14135,
                14198
            ],
            [
                14211,
                14254
            ],
            [
                14254,
                14328
            ],
            [
                14329,
                14344
            ],
            [
                14355,
                14359
            ],
            [
                14487,
                14489
            ],
            [
                14387,
                14404
            ],
            [
                14427,
                14446
            ],
            [
                14417,
                14426
            ],
            [
                14620,
                14624
            ],
            [
                14638,
                14735
            ],
            [
                14745,
                14757
            ],
            [
                14785,
                14787
            ],
            [
                14787,
                14854
            ],
            [
                14866,
                14889
            ],
            [
                15065,
                15141
            ],
            [
                15141,
                15225
            ],
            [
                15225,
                15255
            ],
            [
                15255,
                15285
            ],
            [
                15285,
                15291
            ],
            [
                15315,
                15358
            ],
            [
                15411,
                15413
            ],
            [
                15413,
                15420
            ],
            [
                15426,
                15438
            ],
            [
                15501,
                15504
            ],
            [
                15542,
                15546
            ],
            [
                15487,
                15490
            ],
            [
                15467,
                15472
            ],
            [
                15534,
                15541
            ],
            [
                15547,
                15554
            ],
            [
                15556,
                15653
            ],
            [
                15659,
                15667
            ],
            [
                15678,
                15698
            ],
            [
                15721,
                15728
            ],
            [
                15742,
                15748
            ],
            [
                15760,
                15770
            ],
            [
                15456,
                15461
            ],
            [
                15826,
                15841
            ],
            [
                15804,
                15816
            ],
            [
                15856,
                15858
            ],
            [
                15858,
                15872
            ],
            [
                15882,
                15910
            ],
            [
                15915,
                15932
            ],
            [
                15957,
                15972
            ],
            [
                15981,
                15999
            ],
            [
                16102,
                16155
            ],
            [
                16156,
                16183
            ],
            [
                16204,
                16289
            ],
            [
                16350,
                16382
            ],
            [
                16389,
                16463
            ],
            [
                16187,
                16190
            ],
            [
                16483,
                16485
            ],
            [
                16701,
                16733
            ],
            [
                16679,
                16680
            ],
            [
                16676,
                16679
            ],
            [
                16751,
                16782
            ],
            [
                16804,
                16836
            ],
            [
                16932,
                16934
            ],
            [
                16934,
                16989
            ],
            [
                17104,
                17191
            ],
            [
                17253,
                17255
            ],
            [
                17255,
                17281
            ],
            [
                17475,
                17481
            ],
            [
                17296,
                17311
            ],
            [
                17423,
                17470
            ],
            [
                17482,
                17511
            ],
            [
                17518,
                17561
            ],
            [
                17577,
                17585
            ],
            [
                17594,
                17613
            ],
            [
                17622,
                17624
            ],
            [
                17624,
                17677
            ],
            [
                17690,
                17701
            ],
            [
                17720,
                17744
            ],
            [
                17744,
                17750
            ],
            [
                17756,
                17762
            ],
            [
                17835,
                17838
            ],
            [
                17872,
                17884
            ],
            [
                17861,
                17862
            ],
            [
                17858,
                17861
            ],
            [
                17935,
                17975
            ],
            [
                18010,
                18022
            ],
            [
                18022,
                18036
            ],
            [
                18052,
                18069
            ],
            [
                18090,
                18092
            ],
            [
                18092,
                18156
            ],
            [
                18360,
                18369
            ],
            [
                18339,
                18359
            ],
            [
                18394,
                18408
            ],
            [
                18419,
                18449
            ],
            [
                18325,
                18326
            ],
            [
                18462,
                18465
            ],
            [
                18470,
                18492
            ],
            [
                18513,
                18531
            ],
            [
                18540,
                18567
            ],
            [
                18606,
                18609
            ],
            [
                18569,
                18598
            ],
            [
                18686,
                18688
            ],
            [
                18688,
                18693
            ],
            [
                18737,
                18741
            ],
            [
                18742,
                18778
            ],
            [
                18779,
                18802
            ],
            [
                18811,
                18814
            ],
            [
                18803,
                18810
            ],
            [
                18814,
                18850
            ],
            [
                18858,
                18863
            ],
            [
                18887,
                18949
            ],
            [
                18976,
                18999
            ],
            [
                19038,
                19049
            ],
            [
                19049,
                19108
            ],
            [
                19145,
                19194
            ],
            [
                19108,
                19109
            ],
            [
                19195,
                19234
            ],
            [
                19574,
                19607
            ],
            [
                19624,
                19633
            ],
            [
                19635,
                19681
            ],
            [
                19683,
                19687
            ],
            [
                20072,
                20078
            ],
            [
                20088,
                20134
            ],
            [
                20151,
                20181
            ],
            [
                20199,
                20201
            ],
            [
                20201,
                20289
            ],
            [
                20300,
                20317
            ],
            [
                20405,
                20406
            ],
            [
                20428,
                20455
            ],
            [
                20455,
                20465
            ],
            [
                20465,
                20493
            ],
            [
                20504,
                20511
            ],
            [
                20511,
                20526
            ],
            [
                20526,
                20553
            ],
            [
                20553,
                20590
            ],
            [
                20590,
                20604
            ],
            [
                20605,
                20606
            ],
            [
                20615,
                20617
            ],
            [
                20617,
                20630
            ],
            [
                20634,
                20637
            ],
            [
                20656,
                20665
            ],
            [
                20667,
                20692
            ],
            [
                20701,
                20703
            ],
            [
                20759,
                20761
            ],
            [
                20746,
                20749
            ],
            [
                20762,
                20826
            ],
            [
                21206,
                21221
            ],
            [
                21233,
                21259
            ],
            [
                21260,
                21271
            ],
            [
                21275,
                21290
            ],
            [
                21335,
                21367
            ],
            [
                21387,
                21389
            ],
            [
                21390,
                21404
            ],
            [
                21404,
                21435
            ],
            [
                21441,
                21463
            ],
            [
                21473,
                21488
            ],
            [
                21493,
                21544
            ],
            [
                21553,
                21562
            ],
            [
                21562,
                21628
            ],
            [
                21679,
                21697
            ],
            [
                21708,
                21731
            ],
            [
                21811,
                21844
            ],
            [
                21846,
                21861
            ],
            [
                21862,
                21866
            ],
            [
                21906,
                21908
            ],
            [
                21908,
                22042
            ],
            [
                22070,
                22121
            ],
            [
                22122,
                22153
            ],
            [
                22160,
                22183
            ],
            [
                22282,
                22284
            ],
            [
                22284,
                22295
            ],
            [
                22304,
                22373
            ],
            [
                22373,
                22413
            ],
            [
                22424,
                22475
            ],
            [
                22502,
                22549
            ],
            [
                22496,
                22497
            ],
            [
                22565,
                22570
            ],
            [
                22575,
                22583
            ],
            [
                22608,
                22610
            ],
            [
                22610,
                22633
            ],
            [
                22650,
                22684
            ],
            [
                22700,
                22712
            ],
            [
                22696,
                22699
            ],
            [
                22684,
                22691
            ],
            [
                22712,
                22713
            ],
            [
                22732,
                22742
            ],
            [
                22692,
                22695
            ],
            [
                22742,
                22743
            ],
            [
                22748,
                22776
            ],
            [
                22786,
                22831
            ],
            [
                22831,
                22902
            ],
            [
                22902,
                22999
            ],
            [
                23001,
                23033
            ],
            [
                23033,
                23045
            ],
            [
                23074,
                23101
            ],
            [
                23107,
                23118
            ],
            [
                23120,
                23139
            ],
            [
                23139,
                23144
            ],
            [
                23157,
                23212
            ],
            [
                23216,
                23245
            ],
            [
                23275,
                23303
            ],
            [
                23492,
                23544
            ],
            [
                23560,
                23576
            ],
            [
                23820,
                23827
            ],
            [
                23877,
                23884
            ],
            [
                23908,
                23931
            ],
            [
                23885,
                23889
            ],
            [
                23939,
                23971
            ],
            [
                23971,
                24012
            ],
            [
                24012,
                24039
            ],
            [
                24039,
                24091
            ],
            [
                24095,
                24122
            ],
            [
                24130,
                24152
            ],
            [
                24163,
                24228
            ],
            [
                24307,
                24309
            ],
            [
                24309,
                24315
            ],
            [
                24331,
                24347
            ],
            [
                24398,
                24399
            ],
            [
                24316,
                24319
            ],
            [
                24390,
                24393
            ],
            [
                24376,
                24377
            ],
            [
                24440,
                24457
            ],
            [
                24465,
                24496
            ],
            [
                24718,
                24719
            ],
            [
                24498,
                24530
            ],
            [
                24539,
                24572
            ],
            [
                24591,
                24630
            ],
            [
                24429,
                24432
            ],
            [
                24636,
                24645
            ],
            [
                24726,
                24728
            ],
            [
                24728,
                24761
            ],
            [
                24761,
                24791
            ],
            [
                24826,
                24855
            ],
            [
                24873,
                24875
            ],
            [
                24875,
                24907
            ],
            [
                24907,
                24938
            ],
            [
                24938,
                25030
            ],
            [
                25040,
                25077
            ],
            [
                25084,
                25120
            ],
            [
                25120,
                25165
            ],
            [
                25165,
                25199
            ],
            [
                25290,
                25299
            ],
            [
                25265,
                25268
            ],
            [
                25301,
                25363
            ],
            [
                25375,
                25457
            ],
            [
                25480,
                25499
            ],
            [
                25499,
                25568
            ],
            [
                25597,
                25635
            ],
            [
                25636,
                25674
            ],
            [
                25679,
                25683
            ],
            [
                25683,
                25685
            ],
            [
                25685,
                25696
            ],
            [
                25706,
                25736
            ],
            [
                25871,
                25898
            ],
            [
                25901,
                25909
            ],
            [
                25918,
                25943
            ],
            [
                25943,
                25964
            ],
            [
                25965,
                25994
            ],
            [
                25995,
                25998
            ],
            [
                26042,
                26047
            ],
            [
                26053,
                26065
            ],
            [
                26070,
                26091
            ],
            [
                26091,
                26147
            ],
            [
                26147,
                26186
            ],
            [
                26217,
                26276
            ],
            [
                26298,
                26354
            ],
            [
                26370,
                26390
            ],
            [
                26390,
                26412
            ],
            [
                26417,
                26427
            ],
            [
                26445,
                26463
            ],
            [
                26484,
                26504
            ],
            [
                26528,
                26614
            ],
            [
                26621,
                26627
            ],
            [
                26615,
                26620
            ],
            [
                26628,
                26655
            ],
            [
                26655,
                26658
            ],
            [
                26697,
                26726
            ],
            [
                26726,
                26807
            ],
            [
                26807,
                26869
            ],
            [
                26874,
                26899
            ],
            [
                26915,
                26917
            ],
            [
                26917,
                26928
            ],
            [
                26938,
                27040
            ],
            [
                27045,
                27055
            ],
            [
                27062,
                27072
            ],
            [
                27089,
                27118
            ],
            [
                27119,
                27127
            ],
            [
                27152,
                27153
            ],
            [
                27337,
                27348
            ],
            [
                27163,
                27166
            ],
            [
                27169,
                27172
            ],
            [
                27177,
                27239
            ],
            [
                27248,
                27315
            ],
            [
                27319,
                27328
            ],
            [
                27418,
                27419
            ],
            [
                27420,
                27432
            ],
            [
                27442,
                27475
            ],
            [
                27537,
                27540
            ],
            [
                27576,
                27595
            ],
            [
                27595,
                27648
            ],
            [
                27648,
                27670
            ],
            [
                27690,
                27694
            ],
            [
                27702,
                27772
            ],
            [
                27773,
                27795
            ],
            [
                27823,
                27835
            ],
            [
                27843,
                27845
            ],
            [
                27845,
                27872
            ],
            [
                27897,
                27906
            ],
            [
                27912,
                27914
            ],
            [
                27929,
                27932
            ],
            [
                27958,
                27963
            ],
            [
                27945,
                27957
            ],
            [
                27963,
                27965
            ],
            [
                27965,
                28071
            ],
            [
                28082,
                28095
            ],
            [
                28099,
                28105
            ],
            [
                28107,
                28142
            ],
            [
                28152,
                28169
            ],
            [
                28169,
                28177
            ],
            [
                28236,
                28249
            ],
            [
                28259,
                28284
            ],
            [
                28292,
                28310
            ],
            [
                28310,
                28367
            ],
            [
                28367,
                28398
            ],
            [
                28403,
                28410
            ],
            [
                28438,
                28440
            ],
            [
                28446,
                28457
            ],
            [
                28466,
                28482
            ],
            [
                28511,
                28513
            ],
            [
                28653,
                28688
            ],
            [
                28728,
                28756
            ],
            [
                28756,
                28785
            ],
            [
                28790,
                28818
            ],
            [
                28820,
                28854
            ],
            [
                28867,
                28882
            ],
            [
                28882,
                28895
            ],
            [
                28906,
                28934
            ],
            [
                28939,
                28993
            ],
            [
                29022,
                29066
            ],
            [
                29073,
                29075
            ],
            [
                29075,
                29124
            ],
            [
                29136,
                29153
            ],
            [
                29153,
                29177
            ],
            [
                29185,
                29190
            ],
            [
                29368,
                29396
            ],
            [
                29435,
                29469
            ],
            [
                29469,
                29475
            ],
            [
                29492,
                29499
            ],
            [
                29483,
                29488
            ],
            [
                29508,
                29527
            ],
            [
                29542,
                29552
            ],
            [
                29558,
                29578
            ],
            [
                29585,
                29600
            ],
            [
                29633,
                29657
            ],
            [
                29673,
                29737
            ],
            [
                29747,
                29769
            ],
            [
                30000,
                30018
            ],
            [
                30029,
                30034
            ],
            [
                30034,
                30067
            ],
            [
                30077,
                30150
            ],
            [
                30150,
                30153
            ],
            [
                30184,
                30191
            ],
            [
                30161,
                30179
            ],
            [
                30192,
                30196
            ],
            [
                30256,
                30274
            ],
            [
                30287,
                30294
            ],
            [
                30294,
                30343
            ],
            [
                30348,
                30378
            ],
            [
                30427,
                30429
            ],
            [
                30429,
                30477
            ],
            [
                30477,
                30514
            ],
            [
                30514,
                30588
            ],
            [
                30590,
                30636
            ],
            [
                30636,
                30659
            ],
            [
                30663,
                30671
            ],
            [
                30691,
                30705
            ],
            [
                30715,
                30718
            ],
            [
                30722,
                30732
            ],
            [
                31054,
                31059
            ],
            [
                30739,
                30779
            ],
            [
                30934,
                30963
            ],
            [
                31012,
                31047
            ],
            [
                31060,
                31068
            ],
            [
                31075,
                31081
            ],
            [
                31094,
                31149
            ],
            [
                31149,
                31187
            ],
            [
                31234,
                31306
            ],
            [
                31306,
                31389
            ],
            [
                31397,
                31399
            ],
            [
                31399,
                31427
            ],
            [
                31440,
                31481
            ],
            [
                31481,
                31520
            ],
            [
                31531,
                31533
            ],
            [
                31533,
                31585
            ],
            [
                31612,
                31614
            ],
            [
                31614,
                31647
            ],
            [
                31647,
                31703
            ],
            [
                31703,
                31714
            ],
            [
                31720,
                31734
            ],
            [
                31740,
                31747
            ],
            [
                31735,
                31739
            ],
            [
                31747,
                31800
            ],
            [
                31845,
                31904
            ],
            [
                31966,
                31992
            ],
            [
                32045,
                32053
            ],
            [
                32065,
                32069
            ],
            [
                32054,
                32064
            ],
            [
                32070,
                32082
            ],
            [
                32091,
                32092
            ],
            [
                32438,
                32456
            ],
            [
                32461,
                32466
            ],
            [
                32476,
                32502
            ],
            [
                32502,
                32533
            ],
            [
                32581,
                32582
            ],
            [
                32583,
                32594
            ],
            [
                32616,
                32659
            ],
            [
                32659,
                32704
            ],
            [
                32763,
                32822
            ],
            [
                32979,
                33016
            ],
            [
                33034,
                33037
            ],
            [
                33018,
                33032
            ],
            [
                33047,
                33064
            ],
            [
                33076,
                33105
            ],
            [
                33109,
                33128
            ],
            [
                33145,
                33162
            ],
            [
                33219,
                33235
            ],
            [
                33237,
                33263
            ],
            [
                33294,
                33296
            ],
            [
                33296,
                33415
            ],
            [
                33415,
                33454
            ],
            [
                33505,
                33510
            ],
            [
                33515,
                33520
            ],
            [
                33531,
                33569
            ],
            [
                33596,
                33656
            ],
            [
                33677,
                33679
            ],
            [
                33679,
                33700
            ],
            [
                33700,
                33720
            ],
            [
                33720,
                33759
            ],
            [
                33810,
                33849
            ],
            [
                33906,
                33923
            ],
            [
                33944,
                33988
            ],
            [
                33988,
                34016
            ],
            [
                34018,
                34040
            ],
            [
                34040,
                34072
            ],
            [
                34110,
                34112
            ],
            [
                34113,
                34148
            ],
            [
                34148,
                34194
            ],
            [
                34205,
                34221
            ],
            [
                34228,
                34241
            ],
            [
                34241,
                34291
            ],
            [
                34328,
                34355
            ],
            [
                34387,
                34389
            ],
            [
                34389,
                34394
            ],
            [
                34395,
                34402
            ],
            [
                34405,
                34436
            ],
            [
                34455,
                34499
            ],
            [
                34514,
                34560
            ],
            [
                34560,
                34615
            ],
            [
                34615,
                34616
            ],
            [
                34623,
                34649
            ],
            [
                34649,
                34666
            ],
            [
                34682,
                34684
            ],
            [
                34684,
                34704
            ],
            [
                34704,
                34715
            ],
            [
                34765,
                34820
            ],
            [
                34826,
                34828
            ],
            [
                34828,
                34845
            ],
            [
                34885,
                34900
            ],
            [
                34845,
                34863
            ],
            [
                34923,
                34961
            ],
            [
                34961,
                34991
            ],
            [
                35018,
                35034
            ],
            [
                35048,
                35065
            ],
            [
                35127,
                35133
            ],
            [
                35149,
                35162
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                425
            ],
            [
                425,
                492
            ],
            [
                492,
                726
            ],
            [
                726,
                907
            ],
            [
                907,
                1321
            ],
            [
                1321,
                1622
            ],
            [
                1622,
                1726
            ],
            [
                1726,
                2168
            ],
            [
                2168,
                2571
            ],
            [
                2571,
                2945
            ],
            [
                2945,
                3090
            ],
            [
                3090,
                3359
            ],
            [
                3359,
                3641
            ],
            [
                3641,
                3676
            ],
            [
                3676,
                3964
            ],
            [
                3964,
                4053
            ],
            [
                4053,
                4553
            ],
            [
                4553,
                4646
            ],
            [
                4646,
                4757
            ],
            [
                4757,
                5179
            ],
            [
                5179,
                5850
            ],
            [
                5850,
                6106
            ],
            [
                6106,
                6368
            ],
            [
                6368,
                6743
            ],
            [
                6743,
                6940
            ],
            [
                6940,
                7070
            ],
            [
                7070,
                7122
            ],
            [
                7122,
                7266
            ],
            [
                7266,
                7320
            ],
            [
                7320,
                7427
            ],
            [
                7427,
                7538
            ],
            [
                7538,
                7563
            ],
            [
                7563,
                7954
            ],
            [
                7954,
                8014
            ],
            [
                8014,
                8136
            ],
            [
                8136,
                8778
            ],
            [
                8778,
                9309
            ],
            [
                9309,
                9411
            ],
            [
                9411,
                9488
            ],
            [
                9488,
                9556
            ],
            [
                9556,
                9765
            ],
            [
                9765,
                9885
            ],
            [
                9885,
                10023
            ],
            [
                10023,
                10777
            ],
            [
                10777,
                10955
            ],
            [
                10955,
                11213
            ],
            [
                11213,
                11788
            ],
            [
                11788,
                12200
            ],
            [
                12200,
                12395
            ],
            [
                12395,
                12507
            ],
            [
                12507,
                12755
            ],
            [
                12755,
                12886
            ],
            [
                12886,
                13102
            ],
            [
                13102,
                13380
            ],
            [
                13380,
                13501
            ],
            [
                13501,
                13754
            ],
            [
                13754,
                13814
            ],
            [
                13814,
                13970
            ],
            [
                13970,
                14135
            ],
            [
                14135,
                14254
            ],
            [
                14254,
                14379
            ],
            [
                14379,
                14612
            ],
            [
                14612,
                14787
            ],
            [
                14787,
                14889
            ],
            [
                14889,
                15002
            ],
            [
                15002,
                15010
            ],
            [
                15010,
                15024
            ],
            [
                15024,
                15141
            ],
            [
                15141,
                15225
            ],
            [
                15225,
                15255
            ],
            [
                15255,
                15285
            ],
            [
                15285,
                15413
            ],
            [
                15413,
                15858
            ],
            [
                15858,
                16156
            ],
            [
                16156,
                16485
            ],
            [
                16485,
                16676
            ],
            [
                16676,
                16934
            ],
            [
                16934,
                17255
            ],
            [
                17255,
                17624
            ],
            [
                17624,
                17744
            ],
            [
                17744,
                18022
            ],
            [
                18022,
                18092
            ],
            [
                18092,
                18156
            ],
            [
                18156,
                18279
            ],
            [
                18279,
                18688
            ],
            [
                18688,
                18779
            ],
            [
                18779,
                18949
            ],
            [
                18949,
                19049
            ],
            [
                19049,
                19234
            ],
            [
                19234,
                19568
            ],
            [
                19568,
                19574
            ],
            [
                19574,
                20201
            ],
            [
                20201,
                20455
            ],
            [
                20455,
                20465
            ],
            [
                20465,
                20511
            ],
            [
                20511,
                20526
            ],
            [
                20526,
                20553
            ],
            [
                20553,
                20590
            ],
            [
                20590,
                20617
            ],
            [
                20617,
                20703
            ],
            [
                20703,
                20731
            ],
            [
                20731,
                20828
            ],
            [
                20828,
                20959
            ],
            [
                20959,
                21000
            ],
            [
                21000,
                21124
            ],
            [
                21124,
                21167
            ],
            [
                21167,
                21206
            ],
            [
                21206,
                21291
            ],
            [
                21291,
                21316
            ],
            [
                21316,
                21335
            ],
            [
                21335,
                21389
            ],
            [
                21389,
                21404
            ],
            [
                21404,
                21562
            ],
            [
                21562,
                21628
            ],
            [
                21628,
                21669
            ],
            [
                21669,
                21908
            ],
            [
                21908,
                22284
            ],
            [
                22284,
                22373
            ],
            [
                22373,
                22475
            ],
            [
                22475,
                22610
            ],
            [
                22610,
                22684
            ],
            [
                22684,
                22831
            ],
            [
                22831,
                22902
            ],
            [
                22902,
                22999
            ],
            [
                22999,
                23033
            ],
            [
                23033,
                23074
            ],
            [
                23074,
                23139
            ],
            [
                23139,
                23245
            ],
            [
                23245,
                23275
            ],
            [
                23275,
                23304
            ],
            [
                23304,
                23355
            ],
            [
                23355,
                23409
            ],
            [
                23409,
                23492
            ],
            [
                23492,
                23577
            ],
            [
                23577,
                23639
            ],
            [
                23639,
                23820
            ],
            [
                23820,
                23971
            ],
            [
                23971,
                24012
            ],
            [
                24012,
                24039
            ],
            [
                24039,
                24309
            ],
            [
                24309,
                24728
            ],
            [
                24728,
                24761
            ],
            [
                24761,
                24875
            ],
            [
                24875,
                24907
            ],
            [
                24907,
                24938
            ],
            [
                24938,
                25120
            ],
            [
                25120,
                25165
            ],
            [
                25165,
                25499
            ],
            [
                25499,
                25636
            ],
            [
                25636,
                25685
            ],
            [
                25685,
                25736
            ],
            [
                25736,
                25823
            ],
            [
                25823,
                25830
            ],
            [
                25830,
                25943
            ],
            [
                25943,
                26091
            ],
            [
                26091,
                26147
            ],
            [
                26147,
                26354
            ],
            [
                26354,
                26390
            ],
            [
                26390,
                26655
            ],
            [
                26655,
                26726
            ],
            [
                26726,
                26807
            ],
            [
                26807,
                26917
            ],
            [
                26917,
                27154
            ],
            [
                27154,
                27420
            ],
            [
                27420,
                27595
            ],
            [
                27595,
                27648
            ],
            [
                27648,
                27773
            ],
            [
                27773,
                27845
            ],
            [
                27845,
                27965
            ],
            [
                27965,
                28071
            ],
            [
                28071,
                28169
            ],
            [
                28169,
                28310
            ],
            [
                28310,
                28367
            ],
            [
                28367,
                28513
            ],
            [
                28513,
                28653
            ],
            [
                28653,
                28756
            ],
            [
                28756,
                28882
            ],
            [
                28882,
                29075
            ],
            [
                29075,
                29153
            ],
            [
                29153,
                29191
            ],
            [
                29191,
                29251
            ],
            [
                29251,
                29306
            ],
            [
                29306,
                29368
            ],
            [
                29368,
                29469
            ],
            [
                29469,
                29552
            ],
            [
                29552,
                29769
            ],
            [
                29769,
                29991
            ],
            [
                29991,
                30034
            ],
            [
                30034,
                30150
            ],
            [
                30150,
                30294
            ],
            [
                30294,
                30429
            ],
            [
                30429,
                30477
            ],
            [
                30477,
                30514
            ],
            [
                30514,
                30636
            ],
            [
                30636,
                30732
            ],
            [
                30732,
                31149
            ],
            [
                31149,
                31306
            ],
            [
                31306,
                31399
            ],
            [
                31399,
                31481
            ],
            [
                31481,
                31533
            ],
            [
                31533,
                31614
            ],
            [
                31614,
                31647
            ],
            [
                31647,
                31703
            ],
            [
                31703,
                31800
            ],
            [
                31800,
                31845
            ],
            [
                31845,
                32093
            ],
            [
                32093,
                32191
            ],
            [
                32191,
                32280
            ],
            [
                32280,
                32438
            ],
            [
                32438,
                32502
            ],
            [
                32502,
                32583
            ],
            [
                32583,
                32659
            ],
            [
                32659,
                32704
            ],
            [
                32704,
                32822
            ],
            [
                32822,
                32849
            ],
            [
                32849,
                32879
            ],
            [
                32879,
                32899
            ],
            [
                32899,
                32932
            ],
            [
                32932,
                32979
            ],
            [
                32979,
                33296
            ],
            [
                33296,
                33415
            ],
            [
                33415,
                33489
            ],
            [
                33489,
                33505
            ],
            [
                33505,
                33596
            ],
            [
                33596,
                33679
            ],
            [
                33679,
                33700
            ],
            [
                33700,
                33720
            ],
            [
                33720,
                33849
            ],
            [
                33849,
                33906
            ],
            [
                33906,
                33988
            ],
            [
                33988,
                34040
            ],
            [
                34040,
                34113
            ],
            [
                34113,
                34148
            ],
            [
                34148,
                34241
            ],
            [
                34241,
                34389
            ],
            [
                34389,
                34405
            ],
            [
                34405,
                34560
            ],
            [
                34560,
                34615
            ],
            [
                34615,
                34649
            ],
            [
                34649,
                34684
            ],
            [
                34684,
                34704
            ],
            [
                34704,
                34828
            ],
            [
                34828,
                34923
            ],
            [
                34923,
                34961
            ],
            [
                34961,
                35162
            ]
        ]
    },
    "abridged": {
        "text": "In the first place, let us describe how a house may be got for nothing a year. These mansions are to be had either unfurnished, where, if you have credit with Messrs. Gillows or Bantings, you can get them splendidly decorated according to your fancy; or they are let furnished, a less troublesome arrangement. It was so that Crawley and his wife preferred to hire their house.\nBefore Mr. Bowls came to Miss Crawley's house in Park Lane, that lady had as her butler a Mr. Raggles, who was the younger son of a gardener at Queen's Crawley. By good conduct, a handsome appearance and a grave demeanour, Raggles rose from the knife-board to the butler's pantry. After many years at the head of Miss Crawley's house, he announced that he was about to marry a former cook of Miss Crawley's, who kept a small greengrocer's shop. In truth, the marriage had secretly happened some years back.\nMr. Raggles retired to superintend the small shop. He added milk, cream, eggs and country-fed pork to his stores, and his profits increased every year. He quietly and modestly amassed money, and when a snug bachelor's house at 201, Curzon Street, with rich furniture, went under the hammer, who should purchase the lease but Raggles? Some of the money he borrowed, it is true, at rather high interest from a brother butler, but the chief part he paid down; and Mrs. Raggles found herself proudly sleeping in a bed of carved mahogany, with silk curtains, and a wardrobe which would contain her, and Raggles, and all the family.\nOf course, they did not intend to occupy it long, but to let it again. As soon as a tenant was found, Raggles returned to the greengrocer's shop; but it was a happy thing for him to walk down Curzon Street, and survey his house with its carved bronze knocker.\nHe was a good man; good and happy. The house brought him so handsome an income that he was determined to send his children to good schools, and accordingly, regardless of expense, Charles was sent to board at Dr. Swishtail's, and little Matilda to Miss Peckover's at Clapham.\nRaggles loved the Crawley family as the author of all his prosperity. He thought there was no family so august. As luck would have it, Raggles' house in Curzon Street was to let when Rawdon and his wife returned to London. Raggles knew the Colonel; and he not only let his house to him, but acted as his butler whenever he had company, with Mrs. Raggles cooking in the kitchen below and sending up dinners.\nIn this way Crawley got his house for nothing; for though Raggles had to pay taxes and rates, and the interest of the mortgage to the brother butler; and his children's school fees, and the cost of meat and drink for his family, and for Colonel Crawley too; and though the poor wretch was utterly ruined by the transaction, his children being flung on the streets, and himself driven into the Fleet Prison: yet somebody must pay for gentlemen who live for nothing a year - and in this case it was the unlucky Raggles.\nI wonder how many families are driven to ruin in this way? - how many great noblemen rob their petty tradesmen and swindle their poor retainers? When we read that a nobleman owes six or seven millions, the defeat seems glorious even, and we respect the victim in the vastness of his ruin. But who pities his poor barber, or carpenter, on his poor devil of a tailor? When the great house tumbles down, these miserable wretches fall under it unnoticed.\nRawdon and his wife generously patronised those of Miss Crawley's tradesmen who would serve them. Some were willing enough, especially the poor ones. It was wonderful to see the tenacity with which the washerwoman brought the cart every Saturday, and her bills week after week. Mr. Raggles himself had to supply the greengroceries. Every servant was owed most of his wages, and thus kept up an interest in the house. Nobody was paid. Not the blacksmith who opened the lock; nor the glazier who mended the pane; nor the jobber who let the carriage; nor the groom who drove it. This is the way in which people live elegantly on nothing a year.\nAt 201 Curzon Street there was a hearty welcome, a kind smile and a good dinner from the host and hostess, just as if they had three or four thousand a year. And so they did, not in money, but in produce and labour. No man had better claret than Rawdon; his drawing-rooms were the prettiest little salons conceivable, decorated by Rebecca with knick-knacks from Paris. When she sat at her piano trilling songs, the stranger thought himself in a little paradise of domestic comfort and agreed that, although the husband was rather stupid, the wife was charming.\nRebecca's wit, cleverness, and flippancy made her speedily the vogue in London among a certain class. You beheld her carriage in the park, surrounded by dandies. Her box in the third tier of the opera was crowded; but the ladies held aloof from her, and closed their doors to our little adventurer.\nThere are ladies who may be called men's women, being welcomed entirely by all the gentlemen and slighted by all their wives. Mrs. Firebrace is of this sort - the lady with the beautiful fair ringlets whom you see every day in Hyde Park, surrounded by famous dandies. Mrs. Rockwood is another, whose parties are announced in the fashionable newspapers. But while simple folks might envy them, persons who are better informed know that these ladies have no chance of establishing themselves in \"society,\" but are pitilessly excluded.\nNow the few female acquaintances whom Mrs. Crawley had known abroad not only declined to visit her when she came to London, but cut her severely when they met in public. When Lady Bareacres saw her in the opera-house, she gathered her daughters about her as if they would be contaminated by a touch of Becky, and stared frigidly at her little enemy. Mrs. Blenkinsop, the banker's wife, cut her at church, where Becky went regularly now.\nRawdon at first felt very acutely the slights upon his wife, and was gloomy and savage. He talked of calling out the husbands of the insolent women who did not respect his wife; and it was only by the strongest commands on her part that he was restrained.\n\"You can't shoot me into society,\" she said good-naturedly. \"Remember, my dear, that I was only a governess, and you, you poor silly man, have the worst reputation for debt and wickedness. We shall get quite as many friends as we want by and by, and in the meanwhile you must be a good boy. When we heard that your aunt had left almost everything to Pitt, do you remember what a rage you were in? You would have told all Paris, if I had not made you keep your temper, and then where would you be now? - in prison for debt, and not in a handsome house in London. Rage won't get us your aunt's money; and it is much better that we should be friends with your brother than enemies. When your father dies, Queen's Crawley will be a pleasant house for us to pass the winter in. Or Pitt and his little boy will die, and we will be Sir Rawdon and my lady. While there is life, there is hope, my dear, and I intend to make a man of you yet. Who sold your horses for you? Who paid your debts for you?\" Rawdon confessed that he owed all these benefits to his wife.\nIndeed, Miss Crawley had left her money finally to Pitt. Bute Crawley, who found that only five thousand pounds had been left to him instead of the twenty which he expected, was in such a fury that he savagely abused his nephew, and caused an utter breach between them. Rawdon Crawley, on the other hand, who got only a hundred pounds, astonished his brother and delighted his sister-in-law, by writing them a very frank, manly, good-humoured letter from Paris.\nHe was aware, he said, that he had forfeited his aunt's favour; and though he did not disguise his disappointment, he was glad that the money was kept in their branch of the family, and heartily congratulated his brother, and sent his affectionate goodwill. Becky joined in her husband's congratulations, writing that she would always remember Mr. Crawley's kindness when she was a friendless orphan. She wished him every happiness in his married life, and hoped that one day she might be allowed to present her little boy to his uncle and aunt.\nPitt Crawley received this letter very graciously; and as for Lady Jane, she was so charmed with it that she expected her husband to instantly divide his aunt's legacy into two and send half to his brother.\nTo her Ladyship's surprise, however, Pitt declined to give his brother thirty thousand pounds. But he thanked Rawdon and Mrs. Crawley, and graciously pronounced his willingness to help their little boy.\nThus an almost-reconciliation was brought about. When Rebecca came to town Pitt and his wife were not in London. She heard through Raggles that Miss Crawley's servants had been dismissed with decent payments; and that Mr. Pitt had only once appeared in London, when he stayed for a few days at the house and did business with his lawyers. Becky longed for the arrival of her new relation.\n\"When Lady Jane comes,\" she thought, \"she shall be my sponsor in London; and the women will ask me when they find the men want to see me.\"\nA lady in this position needs a companion. I have always admired the way in which the tender creatures hire an exceedingly plain friend of their own sex, from whom they are almost inseparable. Even battered, brazen, beautiful, heartless Mrs. Firebrace, whose father died of her shame - even she is hardly seen in any public place without a shabby companion sitting somewhere in the shade.\n\"Rawdon,\" said Becky, very late one night, as a party of gentlemen were seated round her drawing-room fire, \"I must have a sheep-dog.\"\n\"A what?\" said Rawdon, looking up from the card-table.\n\"A sheep-dog!\" said young Lord Southdown. \"My dear Mrs. Crawley, what a fancy! Why not have a Great Dane? I know of one so big, by Jove, it would almost pull your carriage. Or do you want a little pug that would go into one of Lord Steyne's snuff-boxes?\"\n\"I mean a moral sheep-dog,\" said Becky, laughing, and looking at Lord Steyne. \"A dog to keep the wolves off me. A companion.\"\n\"Dear little innocent lamb, you need one,\" said the Marquis of Steyne. With jaw thrust out, he began to grin hideously, his little eyes leering at Rebecca.\nThe great Lord of Steyne was standing by the fire sipping coffee. A score of candles sparkled round the mantelpiece, lighting up Rebecca's figure to admiration as she sat on a flowered sofa. She was in a pink dress that looked as fresh as a rose; her dazzling white arms and shoulders were half-covered with a thin hazy scarf; her hair hung in curls round her neck; one of her pretty little feet peeped out from the crisp folds of the silk.\nThe candles lit up Lord Steyne's shining bald head, which was fringed with red hair. He had thick bushy eyebrows, with little bloodshot eyes, surrounded by a thousand wrinkles. When he laughed, two white buck-teeth protruded, glistening savagely. He had been dining with royalty, and wore his garter and ribbon. Though his Lordship was a short, bow-legged man, he was proud of the fineness of his ankle, and always caressing his garter-knee.\n\"And so the shepherd is not enough,\" said he, \"to defend his lambkin?\"\n\"The shepherd is too fond of playing at cards and going to his clubs,\" answered Becky, laughing.\n\"Gad, what a debauched Corydon!\" said my lord.\n\"I take your three to two,\" said Rawdon at the card-table.\n\"Hark,\" snarled the noble marquis; \"he's pastorally occupied: he's shearing a Southdown. Damme, what a snowy fleece!\" Lord Steyne in early life had been notorious for his success at play.\nRebecca rose up and took his coffee cup from his hand with a little curtsey. \"Yes,\" she said, \"I must get a watchdog. But he won't bark at you.\" And, going into the other drawing-room, she sat down at the piano and began to sing French songs in such a thrilling voice that the mollified nobleman speedily followed her.\nRawdon meanwhile played cart, and won. Nights like these occurred many times in the week - his wife having all the talk and admiration, and he sitting silent, not comprehending a word of the jokes and allusions.\n\"How is Mrs. Crawley's husband?\" Lord Steyne used to say to him; and indeed that was now his role. He was Colonel Crawley no more. He was Mrs. Crawley's husband.\nAbout the little Rawdon, if nothing has been said all this while, it is because he is hidden in a garret somewhere, or has crawled into the kitchen for companionship. His mother scarcely ever took notice of him. He passed the days with his French maid until she went away; and then the little fellow, howling in the loneliness of the night, had pity taken on him by a housemaid, who took him out of his solitary nursery into her bed and comforted him.\nRebecca, my Lord Steyne, and one or two more were in the drawing-room when this shouting was heard overhead.\n\"It's my cherub crying for his nurse,\" said Rebecca. She did not move to go and see the child. \"He'll cry himself to sleep.\" And they began talking about the opera.\nRawdon had stolen off, though, to look after his son, and found honest Dolly consoling the child. The Colonel's dressing-room was in those upper regions. He used to see the boy there in private, every morning when he shaved; Rawdon minor sitting on a box and watching the operation with never-ceasing pleasure. They were great friends. The father would bring sweetmeats and hide them in a box, where the child laughed with joy on discovering the treasure; laughed, but not too loud: for mamma was asleep below and must not be disturbed. She seldom rose till after noon.\nRawdon bought the boy plenty of picture-books and crammed his nursery with toys. Its walls were covered with pictures pasted up by the father's hand and purchased by him with actual cash. When he was not with Mrs. Rawdon in the park, he would sit up here, passing hours with the boy; who rode on his chest, pulled his mustachios like driving-reins, and spent days playing with him.\nThe ceiling was low, and once, when the child was not five years old, his father, tossing him wildly up in his arms, hit the poor little chap's skull violently. Rawdon minor screwed up his face for a tremendous howl - but his father interposed.\n\"For God's sake, Rawdy, don't wake Mamma,\" he cried. And the child, looking piteously at his father, bit his lips, clenched his hands, and didn't cry a bit.\nRawdon told that story to everybody. \"By Gad, sir,\" he explained, \"what a plucky boy he is - what a trump! I half-sent his head through the ceiling, by Gad, and he wouldn't cry for fear of disturbing his mother.\"\nOnce or twice a week that lady visited the upper regions where the child lived. She came blandly smiling in beautiful new clothes and gloves and boots. Wonderful scarfs, laces, and jewels glittered about her. She had always a new bonnet on, with flowers or magnificent ostrich feathers. When she left the room, an odour of roses lingered about the nursery. She was an unearthly being in the child's eyes, superior to his father - to all the world: to be worshipped at a distance. To drive with her in the carriage was an awful ritual: he sat up in the back seat and did not dare to speak, gazing at the beautifully dressed Princess opposite. Gentlemen on splendid prancing horses came up and talked with her. How her eyes beamed upon them!\nSometimes, when she was away, he came into his mother's room. It was like a fairy's abode - a mystic chamber of delights. In the wardrobe hung wonderful robes; there was the jewel-case, and the wondrous bronze hand on the dressing-table, glistening with a hundred rings. Poor lonely little boy! Mother is the name for God in the hearts of little children; and here was one who was worshipping a stone!\nNow Colonel Crawley, rascal as he was, could love a child still. For Rawdon minor he had a great secret tenderness, which did not escape Rebecca. It did not annoy her: she was too good-natured. It only increased her scorn for him. He felt somehow ashamed of this paternal softness and hid it from his wife, only indulging in it when alone with the boy.\nHe used to take him out in the mornings to the stables and the park. Young Lord Southdown, the best-natured of men, bought the little chap a pony, and on this little black Shetland Rawdon's father liked to mount the boy, and to walk by his side in the park. It pleased him to see his old quarters: he had begun to think of his bachelorhood with something like regret. The old troopers were glad to recognize their ancient officer and dandle the little boy. Colonel Crawley found dining with his brother-officers very pleasant. \"Hang it, I ain't clever enough for her. She won't miss me,\" he used to say: and he was right.\nRebecca was fond of her husband. She was always perfectly good-humoured and kind to him. She did not show her scorn for him much; perhaps she liked him the better for being a fool. He went on her errands; obeyed her orders without question; took her to the opera-box, and came back punctually to fetch her.\nWhen the companion arrived, his duties became very light. His wife encouraged him to dine out.\n\"Don't stay at home to-night, my dear,\" she would say. \"Some men are coming who will only bore you. Now I have a sheep-dog, I need not be afraid to be alone.\"\nOne Sunday morning, as Rawdon Crawley and his little son were taking their walk in the park, they passed an old acquaintance, Corporal Clink, talking to an old gentleman who held a boy in his arms. This other youngster had seized hold of the Waterloo medal which the Corporal wore, and was examining it with delight.\n\"Good morning, your Honour,\" said Clink. \"This 'ere young man is about the little Colonel's age, sir.\"\n\"His father was a Waterloo man, too,\" said the old gentleman. \"Wasn't he, Georgy?\"\n\"Yes,\" said Georgy. He and the little chap on the pony were solemnly scanning each other as children do.\n\"He was a Captain,\" said the old gentleman rather pompously. \"Captain George Osborne, sir - perhaps you knew him. He died the death of a hero, sir.\"\nColonel Crawley blushed quite red. \"I knew him very well, sir,\" he said, \"and his dear little wife - how is she?\"\n\"She is my daughter, sir,\" said the old gentleman, handing him a card with great solemnity. On it was written-\n\"Mr. Sedley, Sole Agent for the Anti-Cinder Coal Association, Bunker's Wharf, and Anna-Maria Cottages, Fulham Road West.\"\nLittle Georgy went up and looked at the Shetland pony.\n\"Would you like to have a ride?\" said Rawdon minor.\n\"Yes,\" said Georgy. The Colonel took up the child and put him on the pony behind Rawdon.\n\"Take hold of him round the waist, Georgy,\" he said. And both the children began to laugh.\n\"You won't see a prettier pair, sir,\" said the Corporal; and the three men walked alongside the children.",
        "paragraph_chars": [
            [
                0,
                377
            ],
            [
                377,
                884
            ],
            [
                884,
                1511
            ],
            [
                1511,
                1771
            ],
            [
                1771,
                2047
            ],
            [
                2047,
                2454
            ],
            [
                2454,
                2972
            ],
            [
                2972,
                3423
            ],
            [
                3423,
                4065
            ],
            [
                4065,
                4626
            ],
            [
                4626,
                4925
            ],
            [
                4925,
                5458
            ],
            [
                5458,
                5895
            ],
            [
                5895,
                6151
            ],
            [
                6151,
                7206
            ],
            [
                7206,
                7668
            ],
            [
                7668,
                8214
            ],
            [
                8214,
                8421
            ],
            [
                8421,
                8624
            ],
            [
                8624,
                9013
            ],
            [
                9013,
                9152
            ],
            [
                9152,
                9541
            ],
            [
                9541,
                9676
            ],
            [
                9676,
                9731
            ],
            [
                9731,
                9986
            ],
            [
                9986,
                10112
            ],
            [
                10112,
                10268
            ],
            [
                10268,
                10709
            ],
            [
                10709,
                11151
            ],
            [
                11151,
                11222
            ],
            [
                11222,
                11319
            ],
            [
                11319,
                11366
            ],
            [
                11366,
                11425
            ],
            [
                11425,
                11613
            ],
            [
                11613,
                11932
            ],
            [
                11932,
                12144
            ],
            [
                12144,
                12306
            ],
            [
                12306,
                12758
            ],
            [
                12758,
                12867
            ],
            [
                12867,
                13032
            ],
            [
                13032,
                13602
            ],
            [
                13602,
                13984
            ],
            [
                13984,
                14229
            ],
            [
                14229,
                14386
            ],
            [
                14386,
                14599
            ],
            [
                14599,
                15339
            ],
            [
                15339,
                15741
            ],
            [
                15741,
                16094
            ],
            [
                16094,
                16716
            ],
            [
                16716,
                17023
            ],
            [
                17023,
                17118
            ],
            [
                17118,
                17277
            ],
            [
                17277,
                17594
            ],
            [
                17594,
                17697
            ],
            [
                17697,
                17780
            ],
            [
                17780,
                17885
            ],
            [
                17885,
                18034
            ],
            [
                18034,
                18148
            ],
            [
                18148,
                18259
            ],
            [
                18259,
                18381
            ],
            [
                18381,
                18436
            ],
            [
                18436,
                18488
            ],
            [
                18488,
                18577
            ],
            [
                18577,
                18668
            ],
            [
                18668,
                18773
            ]
        ],
        "segment_chars": [
            [
                0,
                79
            ],
            [
                79,
                310
            ],
            [
                310,
                377
            ],
            [
                377,
                538
            ],
            [
                538,
                658
            ],
            [
                658,
                822
            ],
            [
                822,
                884
            ],
            [
                884,
                935
            ],
            [
                935,
                1036
            ],
            [
                1036,
                1218
            ],
            [
                1218,
                1511
            ],
            [
                1511,
                1582
            ],
            [
                1582,
                1771
            ],
            [
                1771,
                1806
            ],
            [
                1806,
                2047
            ],
            [
                2047,
                2117
            ],
            [
                2117,
                2159
            ],
            [
                2159,
                2270
            ],
            [
                2270,
                2454
            ],
            [
                2454,
                2972
            ],
            [
                2972,
                3031
            ],
            [
                3031,
                3117
            ],
            [
                3117,
                3261
            ],
            [
                3261,
                3338
            ],
            [
                3338,
                3423
            ],
            [
                3423,
                3521
            ],
            [
                3521,
                3573
            ],
            [
                3573,
                3701
            ],
            [
                3701,
                3755
            ],
            [
                3755,
                3840
            ],
            [
                3840,
                3857
            ],
            [
                3857,
                3999
            ],
            [
                3999,
                4065
            ],
            [
                4065,
                4223
            ],
            [
                4223,
                4281
            ],
            [
                4281,
                4434
            ],
            [
                4434,
                4626
            ],
            [
                4626,
                4728
            ],
            [
                4728,
                4788
            ],
            [
                4788,
                4925
            ],
            [
                4925,
                5051
            ],
            [
                5051,
                5193
            ],
            [
                5193,
                5278
            ],
            [
                5278,
                5458
            ],
            [
                5458,
                5628
            ],
            [
                5628,
                5808
            ],
            [
                5808,
                5895
            ],
            [
                5895,
                5983
            ],
            [
                5983,
                6151
            ],
            [
                6151,
                6211
            ],
            [
                6211,
                6340
            ],
            [
                6340,
                6442
            ],
            [
                6442,
                6548
            ],
            [
                6548,
                6652
            ],
            [
                6652,
                6713
            ],
            [
                6713,
                6830
            ],
            [
                6830,
                6924
            ],
            [
                6924,
                7000
            ],
            [
                7000,
                7084
            ],
            [
                7084,
                7114
            ],
            [
                7114,
                7144
            ],
            [
                7144,
                7206
            ],
            [
                7206,
                7263
            ],
            [
                7263,
                7476
            ],
            [
                7476,
                7668
            ],
            [
                7668,
                7926
            ],
            [
                7926,
                8069
            ],
            [
                8069,
                8214
            ],
            [
                8214,
                8421
            ],
            [
                8421,
                8516
            ],
            [
                8516,
                8624
            ],
            [
                8624,
                8673
            ],
            [
                8673,
                8737
            ],
            [
                8737,
                8963
            ],
            [
                8963,
                9013
            ],
            [
                9013,
                9152
            ],
            [
                9152,
                9195
            ],
            [
                9195,
                9345
            ],
            [
                9345,
                9541
            ],
            [
                9541,
                9676
            ],
            [
                9676,
                9686
            ],
            [
                9686,
                9731
            ],
            [
                9731,
                9746
            ],
            [
                9746,
                9773
            ],
            [
                9773,
                9810
            ],
            [
                9810,
                9837
            ],
            [
                9837,
                9904
            ],
            [
                9904,
                9986
            ],
            [
                9986,
                10064
            ],
            [
                10064,
                10098
            ],
            [
                10098,
                10112
            ],
            [
                10112,
                10183
            ],
            [
                10183,
                10268
            ],
            [
                10268,
                10334
            ],
            [
                10334,
                10459
            ],
            [
                10459,
                10709
            ],
            [
                10709,
                10794
            ],
            [
                10794,
                10886
            ],
            [
                10886,
                10956
            ],
            [
                10956,
                11021
            ],
            [
                11021,
                11151
            ],
            [
                11151,
                11222
            ],
            [
                11222,
                11319
            ],
            [
                11319,
                11352
            ],
            [
                11352,
                11366
            ],
            [
                11366,
                11425
            ],
            [
                11425,
                11514
            ],
            [
                11514,
                11543
            ],
            [
                11543,
                11613
            ],
            [
                11613,
                11690
            ],
            [
                11690,
                11731
            ],
            [
                11731,
                11758
            ],
            [
                11758,
                11932
            ],
            [
                11932,
                11971
            ],
            [
                11971,
                12144
            ],
            [
                12144,
                12177
            ],
            [
                12177,
                12243
            ],
            [
                12243,
                12275
            ],
            [
                12275,
                12306
            ],
            [
                12306,
                12473
            ],
            [
                12473,
                12518
            ],
            [
                12518,
                12758
            ],
            [
                12758,
                12867
            ],
            [
                12867,
                12920
            ],
            [
                12920,
                12962
            ],
            [
                12962,
                12992
            ],
            [
                12992,
                13032
            ],
            [
                13032,
                13130
            ],
            [
                13130,
                13186
            ],
            [
                13186,
                13343
            ],
            [
                13343,
                13368
            ],
            [
                13368,
                13569
            ],
            [
                13569,
                13602
            ],
            [
                13602,
                13683
            ],
            [
                13683,
                13790
            ],
            [
                13790,
                13984
            ],
            [
                13984,
                14145
            ],
            [
                14145,
                14229
            ],
            [
                14229,
                14282
            ],
            [
                14282,
                14386
            ],
            [
                14386,
                14423
            ],
            [
                14423,
                14493
            ],
            [
                14493,
                14599
            ],
            [
                14599,
                14679
            ],
            [
                14679,
                14751
            ],
            [
                14751,
                14808
            ],
            [
                14808,
                14886
            ],
            [
                14886,
                14956
            ],
            [
                14956,
                15079
            ],
            [
                15079,
                15241
            ],
            [
                15241,
                15308
            ],
            [
                15308,
                15339
            ],
            [
                15339,
                15401
            ],
            [
                15401,
                15461
            ],
            [
                15461,
                15610
            ],
            [
                15610,
                15634
            ],
            [
                15634,
                15741
            ],
            [
                15741,
                15806
            ],
            [
                15806,
                15887
            ],
            [
                15887,
                15935
            ],
            [
                15935,
                15972
            ],
            [
                15972,
                16094
            ],
            [
                16094,
                16163
            ],
            [
                16163,
                16352
            ],
            [
                16352,
                16462
            ],
            [
                16462,
                16551
            ],
            [
                16551,
                16621
            ],
            [
                16621,
                16662
            ],
            [
                16662,
                16716
            ],
            [
                16716,
                16749
            ],
            [
                16749,
                16805
            ],
            [
                16805,
                16897
            ],
            [
                16897,
                17023
            ],
            [
                17023,
                17081
            ],
            [
                17081,
                17118
            ],
            [
                17118,
                17173
            ],
            [
                17173,
                17218
            ],
            [
                17218,
                17277
            ],
            [
                17277,
                17475
            ],
            [
                17475,
                17594
            ],
            [
                17594,
                17635
            ],
            [
                17635,
                17697
            ],
            [
                17697,
                17759
            ],
            [
                17759,
                17780
            ],
            [
                17780,
                17800
            ],
            [
                17800,
                17885
            ],
            [
                17885,
                17946
            ],
            [
                17946,
                17999
            ],
            [
                17999,
                18034
            ],
            [
                18034,
                18069
            ],
            [
                18069,
                18148
            ],
            [
                18148,
                18240
            ],
            [
                18240,
                18259
            ],
            [
                18259,
                18381
            ],
            [
                18381,
                18436
            ],
            [
                18436,
                18469
            ],
            [
                18469,
                18488
            ],
            [
                18488,
                18508
            ],
            [
                18508,
                18577
            ],
            [
                18577,
                18630
            ],
            [
                18630,
                18668
            ],
            [
                18668,
                18773
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                27,
                79
            ],
            [
                79,
                215
            ],
            [
                216,
                225
            ],
            [
                226,
                243
            ],
            [
                244,
                262
            ],
            [
                263,
                296
            ],
            [
                297,
                308
            ],
            [
                308,
                310
            ],
            [
                310,
                377
            ],
            [
                377,
                401
            ],
            [
                402,
                422
            ],
            [
                423,
                450
            ],
            [
                458,
                487
            ],
            [
                488,
                491
            ],
            [
                492,
                517
            ],
            [
                521,
                536
            ],
            [
                536,
                538
            ],
            [
                538,
                565
            ],
            [
                577,
                640
            ],
            [
                641,
                658
            ],
            [
                669,
                704
            ],
            [
                710,
                745
            ],
            [
                752,
                753
            ],
            [
                761,
                788
            ],
            [
                794,
                820
            ],
            [
                820,
                822
            ],
            [
                822,
                824
            ],
            [
                825,
                830
            ],
            [
                830,
                831
            ],
            [
                832,
                835
            ],
            [
                836,
                844
            ],
            [
                845,
                848
            ],
            [
                867,
                882
            ],
            [
                882,
                884
            ],
            [
                884,
                895
            ],
            [
                896,
                903
            ],
            [
                907,
                918
            ],
            [
                919,
                933
            ],
            [
                933,
                935
            ],
            [
                935,
                948
            ],
            [
                948,
                949
            ],
            [
                950,
                997
            ],
            [
                998,
                1036
            ],
            [
                1036,
                1083
            ],
            [
                1086,
                1090
            ],
            [
                1091,
                1101
            ],
            [
                1102,
                1107
            ],
            [
                1108,
                1110
            ],
            [
                1111,
                1130
            ],
            [
                1131,
                1135
            ],
            [
                1136,
                1140
            ],
            [
                1141,
                1150
            ],
            [
                1150,
                1151
            ],
            [
                1163,
                1185
            ],
            [
                1186,
                1204
            ],
            [
                1205,
                1208
            ],
            [
                1209,
                1218
            ],
            [
                1223,
                1260
            ],
            [
                1261,
                1270
            ],
            [
                1271,
                1284
            ],
            [
                1285,
                1339
            ],
            [
                1341,
                1344
            ],
            [
                1345,
                1371
            ],
            [
                1380,
                1436
            ],
            [
                1436,
                1511
            ],
            [
                1511,
                1551
            ],
            [
                1552,
                1554
            ],
            [
                1565,
                1571
            ],
            [
                1572,
                1574
            ],
            [
                1575,
                1580
            ],
            [
                1580,
                1582
            ],
            [
                1582,
                1612
            ],
            [
                1633,
                1655
            ],
            [
                1655,
                1660
            ],
            [
                1661,
                1667
            ],
            [
                1668,
                1681
            ],
            [
                1682,
                1697
            ],
            [
                1703,
                1721
            ],
            [
                1722,
                1738
            ],
            [
                1739,
                1743
            ],
            [
                1748,
                1770
            ],
            [
                1771,
                1806
            ],
            [
                1806,
                1827
            ],
            [
                1828,
                1839
            ],
            [
                1843,
                1970
            ],
            [
                1977,
                1995
            ],
            [
                1995,
                2034
            ],
            [
                2038,
                2047
            ],
            [
                2047,
                2060
            ],
            [
                2061,
                2115
            ],
            [
                2115,
                2117
            ],
            [
                2120,
                2140
            ],
            [
                2141,
                2147
            ],
            [
                2151,
                2157
            ],
            [
                2157,
                2158
            ],
            [
                2159,
                2270
            ],
            [
                2270,
                2277
            ],
            [
                2278,
                2282
            ],
            [
                2283,
                2294
            ],
            [
                2294,
                2295
            ],
            [
                2296,
                2299
            ],
            [
                2303,
                2328
            ],
            [
                2332,
                2333
            ],
            [
                2334,
                2337
            ],
            [
                2344,
                2381
            ],
            [
                2383,
                2387
            ],
            [
                2388,
                2400
            ],
            [
                2409,
                2452
            ],
            [
                2452,
                2453
            ],
            [
                2457,
                2461
            ],
            [
                2462,
                2465
            ],
            [
                2466,
                2607
            ],
            [
                2608,
                2620
            ],
            [
                2620,
                2622
            ],
            [
                2623,
                2629
            ],
            [
                2634,
                2635
            ],
            [
                2636,
                2643
            ],
            [
                2649,
                2651
            ],
            [
                2652,
                2666
            ],
            [
                2667,
                2670
            ],
            [
                2671,
                2674
            ],
            [
                2675,
                2681
            ],
            [
                2681,
                2682
            ],
            [
                2683,
                2690
            ],
            [
                2691,
                2710
            ],
            [
                2710,
                2882
            ],
            [
                2883,
                2924
            ],
            [
                2927,
                2930
            ],
            [
                2934,
                2938
            ],
            [
                2944,
                2950
            ],
            [
                2951,
                2954
            ],
            [
                2955,
                2970
            ],
            [
                2970,
                2972
            ],
            [
                2972,
                3012
            ],
            [
                3013,
                3017
            ],
            [
                3018,
                3020
            ],
            [
                3026,
                3030
            ],
            [
                3033,
                3082
            ],
            [
                3083,
                3086
            ],
            [
                3087,
                3115
            ],
            [
                3115,
                3117
            ],
            [
                3117,
                3142
            ],
            [
                3142,
                3145
            ],
            [
                3146,
                3261
            ],
            [
                3261,
                3275
            ],
            [
                3276,
                3279
            ],
            [
                3280,
                3291
            ],
            [
                3291,
                3292
            ],
            [
                3293,
                3295
            ],
            [
                3296,
                3305
            ],
            [
                3305,
                3306
            ],
            [
                3314,
                3336
            ],
            [
                3336,
                3338
            ],
            [
                3338,
                3421
            ],
            [
                3421,
                3423
            ],
            [
                3423,
                3453
            ],
            [
                3471,
                3498
            ],
            [
                3509,
                3521
            ],
            [
                3521,
                3573
            ],
            [
                3573,
                3600
            ],
            [
                3604,
                3636
            ],
            [
                3637,
                3701
            ],
            [
                3701,
                3755
            ],
            [
                3755,
                3768
            ],
            [
                3769,
                3777
            ],
            [
                3783,
                3813
            ],
            [
                3814,
                3840
            ],
            [
                3840,
                3846
            ],
            [
                3847,
                3857
            ],
            [
                3857,
                3997
            ],
            [
                3999,
                4003
            ],
            [
                4004,
                4006
            ],
            [
                4007,
                4065
            ],
            [
                4068,
                4071
            ],
            [
                4072,
                4085
            ],
            [
                4086,
                4126
            ],
            [
                4127,
                4130
            ],
            [
                4131,
                4144
            ],
            [
                4145,
                4170
            ],
            [
                4170,
                4176
            ],
            [
                4177,
                4191
            ],
            [
                4192,
                4221
            ],
            [
                4221,
                4222
            ],
            [
                4223,
                4234
            ],
            [
                4235,
                4238
            ],
            [
                4238,
                4279
            ],
            [
                4284,
                4287
            ],
            [
                4292,
                4305
            ],
            [
                4306,
                4310
            ],
            [
                4311,
                4317
            ],
            [
                4317,
                4318
            ],
            [
                4319,
                4355
            ],
            [
                4356,
                4362
            ],
            [
                4363,
                4381
            ],
            [
                4381,
                4382
            ],
            [
                4383,
                4392
            ],
            [
                4393,
                4403
            ],
            [
                4404,
                4408
            ],
            [
                4409,
                4432
            ],
            [
                4432,
                4433
            ],
            [
                4434,
                4474
            ],
            [
                4474,
                4488
            ],
            [
                4497,
                4562
            ],
            [
                4572,
                4624
            ],
            [
                4624,
                4626
            ],
            [
                4626,
                4728
            ],
            [
                4728,
                4786
            ],
            [
                4786,
                4788
            ],
            [
                4792,
                4838
            ],
            [
                4838,
                4843
            ],
            [
                4844,
                4879
            ],
            [
                4887,
                4898
            ],
            [
                4899,
                4925
            ],
            [
                4925,
                4941
            ],
            [
                4942,
                5021
            ],
            [
                5022,
                5051
            ],
            [
                5051,
                5081
            ],
            [
                5084,
                5176
            ],
            [
                5177,
                5191
            ],
            [
                5191,
                5193
            ],
            [
                5193,
                5246
            ],
            [
                5247,
                5276
            ],
            [
                5276,
                5278
            ],
            [
                5278,
                5300
            ],
            [
                5307,
                5316
            ],
            [
                5316,
                5340
            ],
            [
                5355,
                5365
            ],
            [
                5366,
                5380
            ],
            [
                5381,
                5428
            ],
            [
                5433,
                5436
            ],
            [
                5437,
                5447
            ],
            [
                5448,
                5456
            ],
            [
                5456,
                5457
            ],
            [
                5458,
                5573
            ],
            [
                5580,
                5626
            ],
            [
                5626,
                5628
            ],
            [
                5628,
                5647
            ],
            [
                5652,
                5662
            ],
            [
                5663,
                5668
            ],
            [
                5668,
                5669
            ],
            [
                5674,
                5770
            ],
            [
                5771,
                5777
            ],
            [
                5787,
                5808
            ],
            [
                5808,
                5861
            ],
            [
                5861,
                5862
            ],
            [
                5869,
                5889
            ],
            [
                5890,
                5893
            ],
            [
                5893,
                5895
            ],
            [
                5895,
                5940
            ],
            [
                5941,
                5963
            ],
            [
                5964,
                5983
            ],
            [
                5983,
                6020
            ],
            [
                6021,
                6054
            ],
            [
                6055,
                6062
            ],
            [
                6063,
                6114
            ],
            [
                6115,
                6138
            ],
            [
                6149,
                6150
            ],
            [
                6151,
                6211
            ],
            [
                6211,
                6241
            ],
            [
                6247,
                6283
            ],
            [
                6284,
                6323
            ],
            [
                6324,
                6327
            ],
            [
                6328,
                6340
            ],
            [
                6340,
                6440
            ],
            [
                6440,
                6442
            ],
            [
                6442,
                6505
            ],
            [
                6505,
                6548
            ],
            [
                6548,
                6622
            ],
            [
                6628,
                6643
            ],
            [
                6647,
                6651
            ],
            [
                6654,
                6656
            ],
            [
                6664,
                6681
            ],
            [
                6682,
                6701
            ],
            [
                6702,
                6711
            ],
            [
                6713,
                6717
            ],
            [
                6718,
                6815
            ],
            [
                6816,
                6828
            ],
            [
                6828,
                6830
            ],
            [
                6830,
                6897
            ],
            [
                6901,
                6924
            ],
            [
                6924,
                7000
            ],
            [
                7000,
                7084
            ],
            [
                7084,
                7114
            ],
            [
                7114,
                7144
            ],
            [
                7144,
                7150
            ],
            [
                7161,
                7204
            ],
            [
                7204,
                7206
            ],
            [
                7206,
                7213
            ],
            [
                7214,
                7226
            ],
            [
                7227,
                7230
            ],
            [
                7231,
                7235
            ],
            [
                7236,
                7239
            ],
            [
                7240,
                7245
            ],
            [
                7246,
                7253
            ],
            [
                7254,
                7261
            ],
            [
                7263,
                7360
            ],
            [
                7361,
                7369
            ],
            [
                7378,
                7398
            ],
            [
                7399,
                7406
            ],
            [
                7407,
                7413
            ],
            [
                7423,
                7433
            ],
            [
                7433,
                7438
            ],
            [
                7446,
                7461
            ],
            [
                7462,
                7474
            ],
            [
                7474,
                7476
            ],
            [
                7476,
                7490
            ],
            [
                7490,
                7518
            ],
            [
                7524,
                7541
            ],
            [
                7553,
                7568
            ],
            [
                7579,
                7597
            ],
            [
                7614,
                7667
            ],
            [
                7668,
                7695
            ],
            [
                7696,
                7781
            ],
            [
                7781,
                7813
            ],
            [
                7814,
                7888
            ],
            [
                7899,
                7902
            ],
            [
                7924,
                7926
            ],
            [
                7939,
                7971
            ],
            [
                7971,
                7972
            ],
            [
                7986,
                7989
            ],
            [
                8003,
                8034
            ],
            [
                8035,
                8067
            ],
            [
                8067,
                8069
            ],
            [
                8069,
                8124
            ],
            [
                8125,
                8212
            ],
            [
                8212,
                8214
            ],
            [
                8214,
                8240
            ],
            [
                8241,
                8247
            ],
            [
                8248,
                8263
            ],
            [
                8263,
                8310
            ],
            [
                8314,
                8343
            ],
            [
                8347,
                8390
            ],
            [
                8391,
                8399
            ],
            [
                8400,
                8419
            ],
            [
                8419,
                8421
            ],
            [
                8421,
                8474
            ],
            [
                8480,
                8491
            ],
            [
                8492,
                8516
            ],
            [
                8516,
                8522
            ],
            [
                8531,
                8537
            ],
            [
                8538,
                8541
            ],
            [
                8542,
                8554
            ],
            [
                8554,
                8555
            ],
            [
                8556,
                8559
            ],
            [
                8560,
                8600
            ],
            [
                8612,
                8624
            ],
            [
                8624,
                8638
            ],
            [
                8654,
                8671
            ],
            [
                8671,
                8673
            ],
            [
                8673,
                8737
            ],
            [
                8737,
                8746
            ],
            [
                8747,
                8767
            ],
            [
                8768,
                8782
            ],
            [
                8792,
                8822
            ],
            [
                8831,
                8832
            ],
            [
                8833,
                8836
            ],
            [
                8842,
                8864
            ],
            [
                8874,
                8892
            ],
            [
                8900,
                8927
            ],
            [
                8928,
                8931
            ],
            [
                8932,
                8961
            ],
            [
                8961,
                8963
            ],
            [
                8963,
                8968
            ],
            [
                8969,
                8973
            ],
            [
                8976,
                9012
            ],
            [
                9013,
                9036
            ],
            [
                9037,
                9040
            ],
            [
                9041,
                9048
            ],
            [
                9048,
                9084
            ],
            [
                9084,
                9089
            ],
            [
                9090,
                9152
            ],
            [
                9152,
                9175
            ],
            [
                9184,
                9195
            ],
            [
                9195,
                9254
            ],
            [
                9255,
                9304
            ],
            [
                9304,
                9305
            ],
            [
                9306,
                9345
            ],
            [
                9345,
                9378
            ],
            [
                9379,
                9388
            ],
            [
                9389,
                9435
            ],
            [
                9438,
                9442
            ],
            [
                9450,
                9456
            ],
            [
                9462,
                9508
            ],
            [
                9509,
                9539
            ],
            [
                9539,
                9541
            ],
            [
                9541,
                9629
            ],
            [
                9630,
                9647
            ],
            [
                9647,
                9648
            ],
            [
                9649,
                9676
            ],
            [
                9676,
                9686
            ],
            [
                9686,
                9714
            ],
            [
                9724,
                9731
            ],
            [
                9731,
                9746
            ],
            [
                9746,
                9773
            ],
            [
                9773,
                9810
            ],
            [
                9810,
                9824
            ],
            [
                9831,
                9832
            ],
            [
                9835,
                9837
            ],
            [
                9837,
                9850
            ],
            [
                9854,
                9857
            ],
            [
                9857,
                9866
            ],
            [
                9868,
                9893
            ],
            [
                9902,
                9904
            ],
            [
                9904,
                9906
            ],
            [
                9910,
                9913
            ],
            [
                9919,
                9983
            ],
            [
                9986,
                10001
            ],
            [
                10008,
                10034
            ],
            [
                10036,
                10047
            ],
            [
                10048,
                10063
            ],
            [
                10064,
                10096
            ],
            [
                10096,
                10098
            ],
            [
                10098,
                10112
            ],
            [
                10112,
                10143
            ],
            [
                10149,
                10171
            ],
            [
                10188,
                10203
            ],
            [
                10204,
                10255
            ],
            [
                10259,
                10268
            ],
            [
                10268,
                10334
            ],
            [
                10334,
                10352
            ],
            [
                10362,
                10384
            ],
            [
                10394,
                10427
            ],
            [
                10428,
                10443
            ],
            [
                10453,
                10457
            ],
            [
                10457,
                10459
            ],
            [
                10459,
                10593
            ],
            [
                10593,
                10644
            ],
            [
                10652,
                10683
            ],
            [
                10684,
                10707
            ],
            [
                10707,
                10709
            ],
            [
                10709,
                10720
            ],
            [
                10725,
                10794
            ],
            [
                10794,
                10834
            ],
            [
                10835,
                10886
            ],
            [
                10886,
                10933
            ],
            [
                10933,
                10934
            ],
            [
                10935,
                10940
            ],
            [
                10946,
                10954
            ],
            [
                10954,
                10956
            ],
            [
                10956,
                10979
            ],
            [
                10987,
                11021
            ],
            [
                11028,
                11040
            ],
            [
                11041,
                11044
            ],
            [
                11045,
                11052
            ],
            [
                11052,
                11053
            ],
            [
                11054,
                11064
            ],
            [
                11065,
                11068
            ],
            [
                11068,
                11069
            ],
            [
                11077,
                11105
            ],
            [
                11106,
                11151
            ],
            [
                11151,
                11222
            ],
            [
                11222,
                11319
            ],
            [
                11320,
                11352
            ],
            [
                11352,
                11364
            ],
            [
                11366,
                11393
            ],
            [
                11394,
                11405
            ],
            [
                11406,
                11425
            ],
            [
                11425,
                11430
            ],
            [
                11430,
                11485
            ],
            [
                11485,
                11514
            ],
            [
                11514,
                11542
            ],
            [
                11543,
                11595
            ],
            [
                11596,
                11612
            ],
            [
                11613,
                11620
            ],
            [
                11621,
                11628
            ],
            [
                11629,
                11652
            ],
            [
                11653,
                11657
            ],
            [
                11658,
                11690
            ],
            [
                11690,
                11731
            ],
            [
                11731,
                11758
            ],
            [
                11758,
                11810
            ],
            [
                11814,
                11841
            ],
            [
                11842,
                11864
            ],
            [
                11865,
                11930
            ],
            [
                11930,
                11932
            ],
            [
                11932,
                11938
            ],
            [
                11939,
                11955
            ],
            [
                11960,
                11961
            ],
            [
                11962,
                11965
            ],
            [
                11966,
                11969
            ],
            [
                11969,
                11970
            ],
            [
                11971,
                11988
            ],
            [
                11989,
                12020
            ],
            [
                12021,
                12022
            ],
            [
                12023,
                12055
            ],
            [
                12056,
                12089
            ],
            [
                12089,
                12128
            ],
            [
                12129,
                12132
            ],
            [
                12133,
                12142
            ],
            [
                12142,
                12144
            ],
            [
                12144,
                12177
            ],
            [
                12177,
                12207
            ],
            [
                12207,
                12236
            ],
            [
                12241,
                12243
            ],
            [
                12243,
                12275
            ],
            [
                12275,
                12306
            ],
            [
                12306,
                12398
            ],
            [
                12399,
                12436
            ],
            [
                12437,
                12473
            ],
            [
                12473,
                12518
            ],
            [
                12518,
                12552
            ],
            [
                12568,
                12577
            ],
            [
                12579,
                12582
            ],
            [
                12588,
                12650
            ],
            [
                12656,
                12738
            ],
            [
                12739,
                12758
            ],
            [
                12758,
                12827
            ],
            [
                12828,
                12866
            ],
            [
                12867,
                12905
            ],
            [
                12906,
                12910
            ],
            [
                12918,
                12920
            ],
            [
                12920,
                12931
            ],
            [
                12932,
                12962
            ],
            [
                12962,
                12989
            ],
            [
                12992,
                13000
            ],
            [
                13007,
                13032
            ],
            [
                13032,
                13053
            ],
            [
                13055,
                13084
            ],
            [
                13086,
                13089
            ],
            [
                13090,
                13095
            ],
            [
                13096,
                13108
            ],
            [
                13109,
                13130
            ],
            [
                13130,
                13186
            ],
            [
                13186,
                13225
            ],
            [
                13227,
                13286
            ],
            [
                13287,
                13343
            ],
            [
                13348,
                13368
            ],
            [
                13368,
                13390
            ],
            [
                13391,
                13401
            ],
            [
                13402,
                13420
            ],
            [
                13421,
                13441
            ],
            [
                13442,
                13528
            ],
            [
                13529,
                13535
            ],
            [
                13536,
                13541
            ],
            [
                13542,
                13569
            ],
            [
                13569,
                13572
            ],
            [
                13573,
                13602
            ],
            [
                13602,
                13683
            ],
            [
                13683,
                13745
            ],
            [
                13746,
                13771
            ],
            [
                13788,
                13790
            ],
            [
                13790,
                13801
            ],
            [
                13806,
                13908
            ],
            [
                13909,
                13919
            ],
            [
                13920,
                13930
            ],
            [
                13936,
                13965
            ],
            [
                13974,
                13982
            ],
            [
                13982,
                13983
            ],
            [
                13984,
                13995
            ],
            [
                13996,
                13999
            ],
            [
                14000,
                14003
            ],
            [
                14003,
                14065
            ],
            [
                14066,
                14133
            ],
            [
                14134,
                14143
            ],
            [
                14143,
                14144
            ],
            [
                14145,
                14157
            ],
            [
                14166,
                14199
            ],
            [
                14202,
                14205
            ],
            [
                14210,
                14229
            ],
            [
                14229,
                14282
            ],
            [
                14282,
                14304
            ],
            [
                14305,
                14309
            ],
            [
                14315,
                14385
            ],
            [
                14386,
                14408
            ],
            [
                14409,
                14421
            ],
            [
                14421,
                14423
            ],
            [
                14423,
                14450
            ],
            [
                14450,
                14459
            ],
            [
                14460,
                14462
            ],
            [
                14467,
                14470
            ],
            [
                14471,
                14476
            ],
            [
                14479,
                14491
            ],
            [
                14491,
                14493
            ],
            [
                14493,
                14599
            ],
            [
                14599,
                14612
            ],
            [
                14613,
                14619
            ],
            [
                14620,
                14655
            ],
            [
                14662,
                14679
            ],
            [
                14679,
                14687
            ],
            [
                14693,
                14706
            ],
            [
                14707,
                14732
            ],
            [
                14733,
                14751
            ],
            [
                14751,
                14808
            ],
            [
                14808,
                14839
            ],
            [
                14845,
                14852
            ],
            [
                14853,
                14855
            ],
            [
                14856,
                14867
            ],
            [
                14868,
                14884
            ],
            [
                14884,
                14886
            ],
            [
                14886,
                14921
            ],
            [
                14928,
                14956
            ],
            [
                14956,
                14985
            ],
            [
                14998,
                15026
            ],
            [
                15029,
                15063
            ],
            [
                15064,
                15079
            ],
            [
                15079,
                15092
            ],
            [
                15097,
                15125
            ],
            [
                15132,
                15186
            ],
            [
                15195,
                15239
            ],
            [
                15239,
                15241
            ],
            [
                15241,
                15290
            ],
            [
                15291,
                15308
            ],
            [
                15308,
                15332
            ],
            [
                15333,
                15338
            ],
            [
                15339,
                15367
            ],
            [
                15367,
                15401
            ],
            [
                15401,
                15407
            ],
            [
                15413,
                15420
            ],
            [
                15423,
                15428
            ],
            [
                15431,
                15450
            ],
            [
                15451,
                15461
            ],
            [
                15461,
                15481
            ],
            [
                15482,
                15497
            ],
            [
                15499,
                15523
            ],
            [
                15523,
                15587
            ],
            [
                15588,
                15610
            ],
            [
                15610,
                15628
            ],
            [
                15629,
                15634
            ],
            [
                15634,
                15667
            ],
            [
                15668,
                15741
            ],
            [
                15741,
                15744
            ],
            [
                15745,
                15752
            ],
            [
                15753,
                15771
            ],
            [
                15775,
                15779
            ],
            [
                15780,
                15798
            ],
            [
                15799,
                15806
            ],
            [
                15806,
                15855
            ],
            [
                15855,
                15885
            ],
            [
                15885,
                15887
            ],
            [
                15887,
                15935
            ],
            [
                15935,
                15972
            ],
            [
                15972,
                16046
            ],
            [
                16048,
                16094
            ],
            [
                16094,
                16117
            ],
            [
                16125,
                16133
            ],
            [
                16134,
                16148
            ],
            [
                16149,
                16152
            ],
            [
                16153,
                16163
            ],
            [
                16163,
                16168
            ],
            [
                16169,
                16209
            ],
            [
                16210,
                16239
            ],
            [
                16239,
                16274
            ],
            [
                16275,
                16283
            ],
            [
                16284,
                16290
            ],
            [
                16297,
                16352
            ],
            [
                16352,
                16390
            ],
            [
                16390,
                16462
            ],
            [
                16462,
                16545
            ],
            [
                16549,
                16551
            ],
            [
                16551,
                16579
            ],
            [
                16580,
                16621
            ],
            [
                16621,
                16660
            ],
            [
                16660,
                16662
            ],
            [
                16662,
                16714
            ],
            [
                16714,
                16716
            ],
            [
                16716,
                16749
            ],
            [
                16749,
                16805
            ],
            [
                16805,
                16816
            ],
            [
                16817,
                16831
            ],
            [
                16832,
                16839
            ],
            [
                16840,
                16844
            ],
            [
                16844,
                16897
            ],
            [
                16897,
                16956
            ],
            [
                16957,
                16983
            ],
            [
                16984,
                16992
            ],
            [
                16993,
                16997
            ],
            [
                16998,
                17008
            ],
            [
                17009,
                17021
            ],
            [
                17021,
                17022
            ],
            [
                17023,
                17041
            ],
            [
                17049,
                17054
            ],
            [
                17055,
                17081
            ],
            [
                17081,
                17112
            ],
            [
                17116,
                17117
            ],
            [
                17118,
                17129
            ],
            [
                17130,
                17173
            ],
            [
                17173,
                17218
            ],
            [
                17218,
                17277
            ],
            [
                17277,
                17314
            ],
            [
                17315,
                17318
            ],
            [
                17319,
                17333
            ],
            [
                17334,
                17351
            ],
            [
                17352,
                17381
            ],
            [
                17382,
                17401
            ],
            [
                17401,
                17418
            ],
            [
                17430,
                17446
            ],
            [
                17447,
                17473
            ],
            [
                17473,
                17475
            ],
            [
                17475,
                17594
            ],
            [
                17594,
                17633
            ],
            [
                17635,
                17640
            ],
            [
                17646,
                17651
            ],
            [
                17656,
                17694
            ],
            [
                17697,
                17757
            ],
            [
                17757,
                17759
            ],
            [
                17759,
                17780
            ],
            [
                17780,
                17800
            ],
            [
                17800,
                17839
            ],
            [
                17846,
                17885
            ],
            [
                17885,
                17902
            ],
            [
                17902,
                17946
            ],
            [
                17946,
                17974
            ],
            [
                17977,
                17999
            ],
            [
                17999,
                18031
            ],
            [
                18031,
                18033
            ],
            [
                18034,
                18069
            ],
            [
                18069,
                18115
            ],
            [
                18116,
                18132
            ],
            [
                18135,
                18148
            ],
            [
                18148,
                18198
            ],
            [
                18211,
                18238
            ],
            [
                18238,
                18240
            ],
            [
                18240,
                18245
            ],
            [
                18250,
                18257
            ],
            [
                18259,
                18290
            ],
            [
                18291,
                18335
            ],
            [
                18335,
                18381
            ],
            [
                18381,
                18436
            ],
            [
                18436,
                18437
            ],
            [
                18443,
                18469
            ],
            [
                18469,
                18486
            ],
            [
                18486,
                18488
            ],
            [
                18488,
                18508
            ],
            [
                18508,
                18519
            ],
            [
                18520,
                18575
            ],
            [
                18575,
                18577
            ],
            [
                18577,
                18594
            ],
            [
                18595,
                18610
            ],
            [
                18610,
                18628
            ],
            [
                18630,
                18668
            ],
            [
                18668,
                18698
            ],
            [
                18698,
                18714
            ],
            [
                18715,
                18732
            ],
            [
                18743,
                18749
            ],
            [
                18760,
                18773
            ]
        ],
        "row_chars": [
            [
                0,
                79
            ],
            [
                79,
                310
            ],
            [
                310,
                377
            ],
            [
                377,
                538
            ],
            [
                538,
                658
            ],
            [
                658,
                822
            ],
            [
                822,
                884
            ],
            [
                884,
                935
            ],
            [
                935,
                1036
            ],
            [
                1036,
                1218
            ],
            [
                1218,
                1511
            ],
            [
                1511,
                1582
            ],
            [
                1582,
                1771
            ],
            [
                1771,
                1771
            ],
            [
                1771,
                1806
            ],
            [
                1806,
                2047
            ],
            [
                2047,
                2117
            ],
            [
                2117,
                2117
            ],
            [
                2117,
                2159
            ],
            [
                2159,
                2270
            ],
            [
                2270,
                2454
            ],
            [
                2454,
                2972
            ],
            [
                2972,
                3117
            ],
            [
                3117,
                3261
            ],
            [
                3261,
                3338
            ],
            [
                3338,
                3423
            ],
            [
                3423,
                3521
            ],
            [
                3521,
                3573
            ],
            [
                3573,
                3701
            ],
            [
                3701,
                3755
            ],
            [
                3755,
                3755
            ],
            [
                3755,
                3840
            ],
            [
                3840,
                3857
            ],
            [
                3857,
                4065
            ],
            [
                4065,
                4065
            ],
            [
                4065,
                4065
            ],
            [
                4065,
                4281
            ],
            [
                4281,
                4626
            ],
            [
                4626,
                4728
            ],
            [
                4728,
                4728
            ],
            [
                4728,
                4788
            ],
            [
                4788,
                4925
            ],
            [
                4925,
                4925
            ],
            [
                4925,
                4925
            ],
            [
                4925,
                5051
            ],
            [
                5051,
                5193
            ],
            [
                5193,
                5278
            ],
            [
                5278,
                5458
            ],
            [
                5458,
                5458
            ],
            [
                5458,
                5628
            ],
            [
                5628,
                5628
            ],
            [
                5628,
                5808
            ],
            [
                5808,
                5808
            ],
            [
                5808,
                5808
            ],
            [
                5808,
                5895
            ],
            [
                5895,
                5983
            ],
            [
                5983,
                6151
            ],
            [
                6151,
                6211
            ],
            [
                6211,
                6340
            ],
            [
                6340,
                6442
            ],
            [
                6442,
                6548
            ],
            [
                6548,
                6652
            ],
            [
                6652,
                6713
            ],
            [
                6713,
                6830
            ],
            [
                6830,
                6924
            ],
            [
                6924,
                6924
            ],
            [
                6924,
                6924
            ],
            [
                6924,
                6924
            ],
            [
                6924,
                7000
            ],
            [
                7000,
                7084
            ],
            [
                7084,
                7114
            ],
            [
                7114,
                7144
            ],
            [
                7144,
                7206
            ],
            [
                7206,
                7476
            ],
            [
                7476,
                7668
            ],
            [
                7668,
                7926
            ],
            [
                7926,
                7926
            ],
            [
                7926,
                8069
            ],
            [
                8069,
                8214
            ],
            [
                8214,
                8421
            ],
            [
                8421,
                8516
            ],
            [
                8516,
                8624
            ],
            [
                8624,
                8673
            ],
            [
                8673,
                8737
            ],
            [
                8737,
                8737
            ],
            [
                8737,
                8963
            ],
            [
                8963,
                9013
            ],
            [
                9013,
                9152
            ],
            [
                9152,
                9195
            ],
            [
                9195,
                9345
            ],
            [
                9345,
                9345
            ],
            [
                9345,
                9345
            ],
            [
                9345,
                9541
            ],
            [
                9541,
                9676
            ],
            [
                9676,
                9686
            ],
            [
                9686,
                9731
            ],
            [
                9731,
                9746
            ],
            [
                9746,
                9773
            ],
            [
                9773,
                9810
            ],
            [
                9810,
                9837
            ],
            [
                9837,
                9904
            ],
            [
                9904,
                9904
            ],
            [
                9904,
                9986
            ],
            [
                9986,
                9986
            ],
            [
                9986,
                9986
            ],
            [
                9986,
                9986
            ],
            [
                9986,
                9986
            ],
            [
                9986,
                9986
            ],
            [
                9986,
                10064
            ],
            [
                10064,
                10064
            ],
            [
                10064,
                10064
            ],
            [
                10064,
                10098
            ],
            [
                10098,
                10112
            ],
            [
                10112,
                10268
            ],
            [
                10268,
                10334
            ],
            [
                10334,
                10334
            ],
            [
                10334,
                10459
            ],
            [
                10459,
                10709
            ],
            [
                10709,
                10794
            ],
            [
                10794,
                10886
            ],
            [
                10886,
                10956
            ],
            [
                10956,
                11021
            ],
            [
                11021,
                11151
            ],
            [
                11151,
                11222
            ],
            [
                11222,
                11319
            ],
            [
                11319,
                11352
            ],
            [
                11352,
                11366
            ],
            [
                11366,
                11425
            ],
            [
                11425,
                11514
            ],
            [
                11514,
                11514
            ],
            [
                11514,
                11543
            ],
            [
                11543,
                11543
            ],
            [
                11543,
                11543
            ],
            [
                11543,
                11543
            ],
            [
                11543,
                11613
            ],
            [
                11613,
                11613
            ],
            [
                11613,
                11613
            ],
            [
                11613,
                11690
            ],
            [
                11690,
                11731
            ],
            [
                11731,
                11758
            ],
            [
                11758,
                11932
            ],
            [
                11932,
                12144
            ],
            [
                12144,
                12177
            ],
            [
                12177,
                12243
            ],
            [
                12243,
                12275
            ],
            [
                12275,
                12306
            ],
            [
                12306,
                12473
            ],
            [
                12473,
                12518
            ],
            [
                12518,
                12758
            ],
            [
                12758,
                12867
            ],
            [
                12867,
                12920
            ],
            [
                12920,
                12962
            ],
            [
                12962,
                12962
            ],
            [
                12962,
                12962
            ],
            [
                12962,
                13032
            ],
            [
                13032,
                13130
            ],
            [
                13130,
                13186
            ],
            [
                13186,
                13343
            ],
            [
                13343,
                13368
            ],
            [
                13368,
                13569
            ],
            [
                13569,
                13602
            ],
            [
                13602,
                13683
            ],
            [
                13683,
                13790
            ],
            [
                13790,
                13984
            ],
            [
                13984,
                14145
            ],
            [
                14145,
                14229
            ],
            [
                14229,
                14282
            ],
            [
                14282,
                14386
            ],
            [
                14386,
                14423
            ],
            [
                14423,
                14493
            ],
            [
                14493,
                14599
            ],
            [
                14599,
                14679
            ],
            [
                14679,
                14751
            ],
            [
                14751,
                14808
            ],
            [
                14808,
                14886
            ],
            [
                14886,
                14886
            ],
            [
                14886,
                14956
            ],
            [
                14956,
                15079
            ],
            [
                15079,
                15241
            ],
            [
                15241,
                15308
            ],
            [
                15308,
                15339
            ],
            [
                15339,
                15339
            ],
            [
                15339,
                15339
            ],
            [
                15339,
                15339
            ],
            [
                15339,
                15401
            ],
            [
                15401,
                15461
            ],
            [
                15461,
                15610
            ],
            [
                15610,
                15610
            ],
            [
                15610,
                15634
            ],
            [
                15634,
                15741
            ],
            [
                15741,
                15806
            ],
            [
                15806,
                15887
            ],
            [
                15887,
                15935
            ],
            [
                15935,
                15972
            ],
            [
                15972,
                16094
            ],
            [
                16094,
                16163
            ],
            [
                16163,
                16352
            ],
            [
                16352,
                16462
            ],
            [
                16462,
                16551
            ],
            [
                16551,
                16621
            ],
            [
                16621,
                16662
            ],
            [
                16662,
                16716
            ],
            [
                16716,
                16749
            ],
            [
                16749,
                16805
            ],
            [
                16805,
                16897
            ],
            [
                16897,
                16897
            ],
            [
                16897,
                17023
            ],
            [
                17023,
                17023
            ],
            [
                17023,
                17023
            ],
            [
                17023,
                17023
            ],
            [
                17023,
                17081
            ],
            [
                17081,
                17118
            ],
            [
                17118,
                17173
            ],
            [
                17173,
                17218
            ],
            [
                17218,
                17277
            ],
            [
                17277,
                17277
            ],
            [
                17277,
                17277
            ],
            [
                17277,
                17277
            ],
            [
                17277,
                17277
            ],
            [
                17277,
                17277
            ],
            [
                17277,
                17475
            ],
            [
                17475,
                17594
            ],
            [
                17594,
                17635
            ],
            [
                17635,
                17635
            ],
            [
                17635,
                17697
            ],
            [
                17697,
                17759
            ],
            [
                17759,
                17780
            ],
            [
                17780,
                17800
            ],
            [
                17800,
                17885
            ],
            [
                17885,
                17885
            ],
            [
                17885,
                17946
            ],
            [
                17946,
                17999
            ],
            [
                17999,
                18034
            ],
            [
                18034,
                18069
            ],
            [
                18069,
                18148
            ],
            [
                18148,
                18240
            ],
            [
                18240,
                18259
            ],
            [
                18259,
                18381
            ],
            [
                18381,
                18436
            ],
            [
                18436,
                18469
            ],
            [
                18469,
                18488
            ],
            [
                18488,
                18508
            ],
            [
                18508,
                18577
            ],
            [
                18577,
                18630
            ],
            [
                18630,
                18668
            ],
            [
                18668,
                18773
            ]
        ]
    }
}