{
    "original": {
        "text": "We must suppose little George Osborne has ridden from Knightsbridge towards Fulham, and will stop and make inquiries at that village regarding some friends whom we have left there. How is Mrs. Amelia after the storm of Waterloo? Is she living and thriving? What has come of Major Dobbin, whose cab was always hankering about her premises? And is there any news of the Collector of Boggley Wollah? The facts concerning the latter are briefly these:\nOur worthy fat friend Joseph Sedley returned to India not long after his escape from Brussels. Either his furlough was up, or he dreaded to meet any witnesses of his Waterloo flight. However it might be, he went back to his duties in Bengal very soon after Napoleon had taken up his residence at St. Helena, where Jos saw the ex-Emperor. To hear Mr. Sedley talk on board ship you would have supposed that it was not the first time he and the Corsican had met, and that the civilian had bearded the French General at Mount St. John. He had a thousand anecdotes about the famous battles; he knew the position of every regiment and the loss which each had incurred. He did not deny that he had been concerned in those victories--that he had been with the army and carried despatches for the Duke of Wellington. And he described what the Duke did and said on every conceivable moment of the day of Waterloo, with such an accurate knowledge of his Grace's sentiments and proceedings that it was clear he must have been by the conqueror's side throughout the day; though, as a non-combatant, his name was not mentioned in the public documents relative to the battle. Perhaps he actually worked himself up to believe that he had been engaged with the army; certain it is that he made a prodigious sensation for some time at Calcutta, and was called Waterloo Sedley during the whole of his subsequent stay in Bengal.\nThe bills which Jos had given for the purchase of those unlucky horses were paid without question by him and his agents. He never was heard to allude to the bargain, and nobody knows for a certainty what became of the horses, or how he got rid of them, or of Isidor, his Belgian servant, who sold a grey horse, very like the one which Jos rode, at Valenciennes sometime during the autumn of 1815.\nJos's London agents had orders to pay one hundred and twenty pounds yearly to his parents at Fulham. It was the chief support of the old couple; for Mr. Sedley's speculations in life subsequent to his bankruptcy did not by any means retrieve the broken old gentleman's fortune. He tried to be a wine-merchant, a coal-merchant, a commission lottery agent, &c., &c. He sent round prospectuses to his friends whenever he took a new trade, and ordered a new brass plate for the door, and talked pompously about making his fortune still. But Fortune never came back to the feeble and stricken old man. One by one his friends dropped off, and were weary of buying dear coals and bad wine from him; and there was only his wife in all the world who fancied, when he tottered off to the City of a morning, that he was still doing any business there. At evening he crawled slowly back; and he used to go of nights to a little club at a tavern, where he disposed of the finances of the nation. It was wonderful to hear him talk about millions, and agios, and discounts, and what Rothschild was doing, and Baring Brothers. He talked of such vast sums that the gentlemen of the club (the apothecary, the undertaker, the great carpenter and builder, the parish clerk, who was allowed to come stealthily, and Mr. Clapp, our old acquaintance,) respected the old gentleman. \"I was better off once, sir,\" he did not fail to tell everybody who \"used the room.\" \"My son, sir, is at this minute chief magistrate of Ramgunge in the Presidency of Bengal, and touching his four thousand rupees per mensem. My daughter might be a Colonel's lady if she liked. I might draw upon my son, the first magistrate, sir, for two thousand pounds to-morrow, and Alexander would cash my bill, down sir, down on the counter, sir. But the Sedleys were always a proud family.\" You and I, my dear reader, may drop into this condition one day: for have not many of our friends attained it? Our luck may fail: our powers forsake us: our place on the boards be taken by better and younger mimes--the chance of life roll away and leave us shattered and stranded. Then men will walk across the road when they meet you--or, worse still, hold you out a couple of fingers and patronize you in a pitying way--then you will know, as soon as your back is turned, that your friend begins with a \"Poor devil, what imprudences he has committed, what chances that chap has thrown away!\" Well, well--a carriage and three thousand a year is not the summit of the reward nor the end of God's judgment of men. If quacks prosper as often as they go to the wall--if zanies succeed and knaves arrive at fortune, and, vice versa, sharing ill luck and prosperity for all the world like the ablest and most honest amongst us--I say, brother, the gifts and pleasures of Vanity Fair cannot be held of any great account, and that it is probable . . . but we are wandering out of the domain of the story.\nHad Mrs. Sedley been a woman of energy, she would have exerted it after her husband's ruin and, occupying a large house, would have taken in boarders. The broken Sedley would have acted well as the boarding-house landlady's husband; the Munoz of private life; the titular lord and master: the carver, house-steward, and humble husband of the occupier of the dingy throne. I have seen men of good brains and breeding, and of good hopes and vigour once, who feasted squires and kept hunters in their youth, meekly cutting up legs of mutton for rancorous old harridans and pretending to preside over their dreary tables--but Mrs. Sedley, we say, had not spirit enough to bustle about for \"a few select inmates to join a cheerful musical family,\" such as one reads of in the Times. She was content to lie on the shore where fortune had stranded her--and you could see that the career of this old couple was over.\nI don't think they were unhappy. Perhaps they were a little prouder in their downfall than in their prosperity. Mrs. Sedley was always a great person for her landlady, Mrs. Clapp, when she descended and passed many hours with her in the basement or ornamented kitchen. The Irish maid Betty Flanagan's bonnets and ribbons, her sauciness, her idleness, her reckless prodigality of kitchen candles, her consumption of tea and sugar, and so forth occupied and amused the old lady almost as much as the doings of her former household, when she had Sambo and the coachman, and a groom, and a footboy, and a housekeeper with a regiment of female domestics--her former household, about which the good lady talked a hundred times a day. And besides Betty Flanagan, Mrs. Sedley had all the maids-of-all-work in the street to superintend. She knew how each tenant of the cottages paid or owed his little rent. She stepped aside when Mrs. Rougemont the actress passed with her dubious family. She flung up her head when Mrs. Pestler, the apothecary's lady, drove by in her husband's professional one-horse chaise. She had colloquies with the greengrocer about the pennorth of turnips which Mr. Sedley loved; she kept an eye upon the milkman and the baker's boy; and made visitations to the butcher, who sold hundreds of oxen very likely with less ado than was made about Mrs. Sedley's loin of mutton: and she counted the potatoes under the joint on Sundays, on which days, dressed in her best, she went to church twice and read Blair's Sermons in the evening.\nOn that day, for \"business\" prevented him on weekdays from taking such a pleasure, it was old Sedley's delight to take out his little grandson Georgy to the neighbouring parks or Kensington Gardens, to see the soldiers or to feed the ducks. Georgy loved the redcoats, and his grandpapa told him how his father had been a famous soldier, and introduced him to many sergeants and others with Waterloo medals on their breasts, to whom the old grandfather pompously presented the child as the son of Captain Osborne of the --th, who died gloriously on the glorious eighteenth. He has been known to treat some of these non-commissioned gentlemen to a glass of porter, and, indeed, in their first Sunday walks was disposed to spoil little Georgy, sadly gorging the boy with apples and parliament, to the detriment of his health--until Amelia declared that George should never go out with his grandpapa unless the latter promised solemnly, and on his honour, not to give the child any cakes, lollipops, or stall produce whatever.\nBetween Mrs. Sedley and her daughter there was a sort of coolness about this boy, and a secret jealousy--for one evening in George's very early days, Amelia, who had been seated at work in their little parlour scarcely remarking that the old lady had quitted the room, ran upstairs instinctively to the nursery at the cries of the child, who had been asleep until that moment--and there found Mrs. Sedley in the act of surreptitiously administering Daffy's Elixir to the infant. Amelia, the gentlest and sweetest of everyday mortals, when she found this meddling with her maternal authority, thrilled and trembled all over with anger. Her cheeks, ordinarily pale, now flushed up, until they were as red as they used to be when she was a child of twelve years old. She seized the baby out of her mother's arms and then grasped at the bottle, leaving the old lady gaping at her, furious, and holding the guilty tea-spoon.\nAmelia flung the bottle crashing into the fire-place. \"I will NOT have baby poisoned, Mamma,\" cried Emmy, rocking the infant about violently with both her arms round him and turning with flashing eyes at her mother.\n\"Poisoned, Amelia!\" said the old lady; \"this language to me?\"\n\"He shall not have any medicine but that which Mr. Pestler sends for him. He told me that Daffy's Elixir was poison.\"\n\"Very good: you think I'm a murderess then,\" replied Mrs. Sedley. \"This is the language you use to your mother. I have met with misfortunes: I have sunk low in life: I have kept my carriage, and now walk on foot: but I did not know I was a murderess before, and thank you for the NEWS.\"\n\"Mamma,\" said the poor girl, who was always ready for tears--\"you shouldn't be hard upon me. I--I didn't mean--I mean, I did not wish to say you would do any wrong to this dear child, only--\"\n\"Oh, no, my love,--only that I was a murderess; in which case I had better go to the Old Bailey. Though I didn't poison YOU, when you were a child, but gave you the best of education and the most expensive masters money could procure. Yes; I've nursed five children and buried three; and the one I loved the best of all, and tended through croup, and teething, and measles, and hooping-cough, and brought up with foreign masters, regardless of expense, and with accomplishments at Minerva House--which I never had when I was a girl--when I was too glad to honour my father and mother, that I might live long in the land, and to be useful, and not to mope all day in my room and act the fine lady--says I'm a murderess. Ah, Mrs. Osborne! may YOU never nourish a viper in your bosom, that's MY prayer.\"\n\"Mamma, Mamma!\" cried the bewildered girl; and the child in her arms set up a frantic chorus of shouts. \"A murderess, indeed! Go down on your knees and pray to God to cleanse your wicked ungrateful heart, Amelia, and may He forgive you as I do.\" And Mrs. Sedley tossed out of the room, hissing out the word poison once more, and so ending her charitable benediction.\nTill the termination of her natural life, this breach between Mrs. Sedley and her daughter was never thoroughly mended. The quarrel gave the elder lady numberless advantages which she did not fail to turn to account with female ingenuity and perseverance. For instance, she scarcely spoke to Amelia for many weeks afterwards. She warned the domestics not to touch the child, as Mrs. Osborne might be offended. She asked her daughter to see and satisfy herself that there was no poison prepared in the little daily messes that were concocted for Georgy. When neighbours asked after the boy's health, she referred them pointedly to Mrs. Osborne. SHE never ventured to ask whether the baby was well or not. SHE would not touch the child although he was her grandson, and own precious darling, for she was not USED to children, and might kill it. And whenever Mr. Pestler came upon his healing inquisition, she received the doctor with such a sarcastic and scornful demeanour, as made the surgeon declare that not Lady Thistlewood herself, whom he had the honour of attending professionally, could give herself greater airs than old Mrs. Sedley, from whom he never took a fee. And very likely Emmy was jealous too, upon her own part, as what mother is not, of those who would manage her children for her, or become candidates for the first place in their affections. It is certain that when anybody nursed the child, she was uneasy, and that she would no more allow Mrs. Clapp or the domestic to dress or tend him than she would have let them wash her husband's miniature which hung up over her little bed--the same little bed from which the poor girl had gone to his; and to which she retired now for many long, silent, tearful, but happy years.\nIn this room was all Amelia's heart and treasure. Here it was that she tended her boy and watched him through the many ills of childhood, with a constant passion of love. The elder George returned in him somehow, only improved, and as if come back from heaven. In a hundred little tones, looks, and movements, the child was so like his father that the widow's heart thrilled as she held him to it; and he would often ask the cause of her tears. It was because of his likeness to his father, she did not scruple to tell him. She talked constantly to him about this dead father, and spoke of her love for George to the innocent and wondering child; much more than she ever had done to George himself, or to any confidante of her youth. To her parents she never talked about this matter, shrinking from baring her heart to them. Little George very likely could understand no better than they, but into his ears she poured her sentimental secrets unreservedly, and into his only. The very joy of this woman was a sort of grief, or so tender, at least, that its expression was tears. Her sensibilities were so weak and tremulous that perhaps they ought not to be talked about in a book. I was told by Dr. Pestler (now a most flourishing lady's physician, with a sumptuous dark green carriage, a prospect of speedy knighthood, and a house in Manchester Square) that her grief at weaning the child was a sight that would have unmanned a Herod. He was very soft-hearted many years ago, and his wife was mortally jealous of Mrs. Amelia, then and long afterwards.\nPerhaps the doctor's lady had good reason for her jealousy: most women shared it, of those who formed the small circle of Amelia's acquaintance, and were quite angry at the enthusiasm with which the other sex regarded her. For almost all men who came near her loved her; though no doubt they would be at a loss to tell you why. She was not brilliant, nor witty, nor wise over much, nor extraordinarily handsome. But wherever she went she touched and charmed every one of the male sex, as invariably as she awakened the scorn and incredulity of her own sisterhood. I think it was her weakness which was her principal charm--a kind of sweet submission and softness, which seemed to appeal to each man she met for his sympathy and protection. We have seen how in the regiment, though she spoke but to few of George's comrades there, all the swords of the young fellows at the mess-table would have leapt from their scabbards to fight round her; and so it was in the little narrow lodging-house and circle at Fulham, she interested and pleased everybody. If she had been Mrs. Mango herself, of the great house of Mango, Plantain, and Co., Crutched Friars, and the magnificent proprietress of the Pineries, Fulham, who gave summer dejeuners frequented by Dukes and Earls, and drove about the parish with magnificent yellow liveries and bay horses, such as the royal stables at Kensington themselves could not turn out--I say had she been Mrs. Mango herself, or her son's wife, Lady Mary Mango (daughter of the Earl of Castlemouldy, who condescended to marry the head of the firm), the tradesmen of the neighbourhood could not pay her more honour than they invariably showed to the gentle young widow, when she passed by their doors, or made her humble purchases at their shops.\nThus it was not only Mr. Pestler, the medical man, but Mr. Linton the young assistant, who doctored the servant maids and small tradesmen, and might be seen any day reading the Times in the surgery, who openly declared himself the slave of Mrs. Osborne. He was a personable young gentleman, more welcome at Mrs. Sedley's lodgings than his principal; and if anything went wrong with Georgy, he would drop in twice or thrice in the day to see the little chap, and without so much as the thought of a fee. He would abstract lozenges, tamarinds, and other produce from the surgery-drawers for little Georgy's benefit, and compounded draughts and mixtures for him of miraculous sweetness, so that it was quite a pleasure to the child to be ailing. He and Pestler, his chief, sat up two whole nights by the boy in that momentous and awful week when Georgy had the measles; and when you would have thought, from the mother's terror, that there had never been measles in the world before. Would they have done as much for other people? Did they sit up for the folks at the Pineries, when Ralph Plantagenet, and Gwendoline, and Guinever Mango had the same juvenile complaint? Did they sit up for little Mary Clapp, the landlord's daughter, who actually caught the disease of little Georgy? Truth compels one to say, no. They slept quite undisturbed, at least as far as she was concerned--pronounced hers to be a slight case, which would almost cure itself, sent her in a draught or two, and threw in bark when the child rallied, with perfect indifference, and just for form's sake.\nAgain, there was the little French chevalier opposite, who gave lessons in his native tongue at various schools in the neighbourhood, and who might be heard in his apartment of nights playing tremulous old gavottes and minuets on a wheezy old fiddle. Whenever this powdered and courteous old man, who never missed a Sunday at the convent chapel at Hammersmith, and who was in all respects, thoughts, conduct, and bearing utterly unlike the bearded savages of his nation, who curse perfidious Albion, and scowl at you from over their cigars, in the Quadrant arcades at the present day--whenever the old Chevalier de Talonrouge spoke of Mistress Osborne, he would first finish his pinch of snuff, flick away the remaining particles of dust with a graceful wave of his hand, gather up his fingers again into a bunch, and, bringing them up to his mouth, blow them open with a kiss, exclaiming, Ah! la divine creature! He vowed and protested that when Amelia walked in the Brompton Lanes flowers grew in profusion under her feet. He called little Georgy Cupid, and asked him news of Venus, his mamma; and told the astonished Betty Flanagan that she was one of the Graces, and the favourite attendant of the Reine des Amours.\nInstances might be multiplied of this easily gained and unconscious popularity. Did not Mr. Binny, the mild and genteel curate of the district chapel, which the family attended, call assiduously upon the widow, dandle the little boy on his knee, and offer to teach him Latin, to the anger of the elderly virgin, his sister, who kept house for him? \"There is nothing in her, Beilby,\" the latter lady would say. \"When she comes to tea here she does not speak a word during the whole evening. She is but a poor lackadaisical creature, and it is my belief has no heart at all. It is only her pretty face which all you gentlemen admire so. Miss Grits, who has five thousand pounds, and expectations besides, has twice as much character, and is a thousand times more agreeable to my taste; and if she were good-looking I know that you would think her perfection.\"\nVery likely Miss Binny was right to a great extent. It IS the pretty face which creates sympathy in the hearts of men, those wicked rogues. A woman may possess the wisdom and chastity of Minerva, and we give no heed to her, if she has a plain face. What folly will not a pair of bright eyes make pardonable? What dulness may not red lips and sweet accents render pleasant? And so, with their usual sense of justice, ladies argue that because a woman is handsome, therefore she is a fool. O ladies, ladies! there are some of you who are neither handsome nor wise.\nThese are but trivial incidents to recount in the life of our heroine. Her tale does not deal in wonders, as the gentle reader has already no doubt perceived; and if a journal had been kept of her proceedings during the seven years after the birth of her son, there would be found few incidents more remarkable in it than that of the measles, recorded in the foregoing page. Yes, one day, and greatly to her wonder, the Reverend Mr. Binny, just mentioned, asked her to change her name of Osborne for his own; when, with deep blushes and tears in her eyes and voice, she thanked him for his regard for her, expressed gratitude for his attentions to her and to her poor little boy, but said that she never, never could think of any but--but the husband whom she had lost.\nOn the twenty-fifth of April, and the eighteenth of June, the days of marriage and widowhood, she kept her room entirely, consecrating them (and we do not know how many hours of solitary night-thought, her little boy sleeping in his crib by her bedside) to the memory of that departed friend. During the day she was more active. She had to teach George to read and to write and a little to draw. She read books, in order that she might tell him stories from them. As his eyes opened and his mind expanded under the influence of the outward nature round about him, she taught the child, to the best of her humble power, to acknowledge the Maker of all, and every night and every morning he and she--(in that awful and touching communion which I think must bring a thrill to the heart of every man who witnesses or who remembers it)--the mother and the little boy--prayed to Our Father together, the mother pleading with all her gentle heart, the child lisping after her as she spoke. And each time they prayed to God to bless dear Papa, as if he were alive and in the room with them. To wash and dress this young gentleman--to take him for a run of the mornings, before breakfast, and the retreat of grandpapa for \"business\"--to make for him the most wonderful and ingenious dresses, for which end the thrifty widow cut up and altered every available little bit of finery which she possessed out of her wardrobe during her marriage--for Mrs. Osborne herself (greatly to her mother's vexation, who preferred fine clothes, especially since her misfortunes) always wore a black gown and a straw bonnet with a black ribbon--occupied her many hours of the day. Others she had to spare, at the service of her mother and her old father. She had taken the pains to learn, and used to play cribbage with this gentleman on the nights when he did not go to his club. She sang for him when he was so minded, and it was a good sign, for he invariably fell into a comfortable sleep during the music. She wrote out his numerous memorials, letters, prospectuses, and projects. It was in her handwriting that most of the old gentleman's former acquaintances were informed that he had become an agent for the Black Diamond and Anti-Cinder Coal Company and could supply his friends and the public with the best coals at --s. per chaldron. All he did was to sign the circulars with his flourish and signature, and direct them in a shaky, clerklike hand. One of these papers was sent to Major Dobbin,--Regt., care of Messrs. Cox and Greenwood; but the Major being in Madras at the time, had no particular call for coals. He knew, though, the hand which had written the prospectus. Good God! what would he not have given to hold it in his own! A second prospectus came out, informing the Major that J. Sedley and Company, having established agencies at Oporto, Bordeaux, and St. Mary's, were enabled to offer to their friends and the public generally the finest and most celebrated growths of ports, sherries, and claret wines at reasonable prices and under extraordinary advantages. Acting upon this hint, Dobbin furiously canvassed the governor, the commander-in-chief, the judges, the regiments, and everybody whom he knew in the Presidency, and sent home to Sedley and Co. orders for wine which perfectly astonished Mr. Sedley and Mr. Clapp, who was the Co. in the business. But no more orders came after that first burst of good fortune, on which poor old Sedley was about to build a house in the City, a regiment of clerks, a dock to himself, and correspondents all over the world. The old gentleman's former taste in wine had gone: the curses of the mess-room assailed Major Dobbin for the vile drinks he had been the means of introducing there; and he bought back a great quantity of the wine and sold it at public outcry, at an enormous loss to himself. As for Jos, who was by this time promoted to a seat at the Revenue Board at Calcutta, he was wild with rage when the post brought him out a bundle of these Bacchanalian prospectuses, with a private note from his father, telling Jos that his senior counted upon him in this enterprise, and had consigned a quantity of select wines to him, as per invoice, drawing bills upon him for the amount of the same. Jos, who would no more have it supposed that his father, Jos Sedley's father, of the Board of Revenue, was a wine merchant asking for orders, than that he was Jack Ketch, refused the bills with scorn, wrote back contumeliously to the old gentleman, bidding him to mind his own affairs; and the protested paper coming back, Sedley and Co. had to take it up, with the profits which they had made out of the Madras venture, and with a little portion of Emmy's savings.\nBesides her pension of fifty pounds a year, there had been five hundred pounds, as her husband's executor stated, left in the agent's hands at the time of Osborne's demise, which sum, as George's guardian, Dobbin proposed to put out at 8 per cent in an Indian house of agency. Mr. Sedley, who thought the Major had some roguish intentions of his own about the money, was strongly against this plan; and he went to the agents to protest personally against the employment of the money in question, when he learned, to his surprise, that there had been no such sum in their hands, that all the late Captain's assets did not amount to a hundred pounds, and that the five hundred pounds in question must be a separate sum, of which Major Dobbin knew the particulars. More than ever convinced that there was some roguery, old Sedley pursued the Major. As his daughter's nearest friend, he demanded with a high hand a statement of the late Captain's accounts. Dobbin's stammering, blushing, and awkwardness added to the other's convictions that he had a rogue to deal with, and in a majestic tone he told that officer a piece of his mind, as he called it, simply stating his belief that the Major was unlawfully detaining his late son-in-law's money.\nDobbin at this lost all patience, and if his accuser had not been so old and so broken, a quarrel might have ensued between them at the Slaughters' Coffee-house, in a box of which place of entertainment the gentlemen had their colloquy. \"Come upstairs, sir,\" lisped out the Major. \"I insist on your coming up the stairs, and I will show which is the injured party, poor George or I\"; and, dragging the old gentleman up to his bedroom, he produced from his desk Osborne's accounts, and a bundle of IOU's which the latter had given, who, to do him justice, was always ready to give an IOU. \"He paid his bills in England,\" Dobbin added, \"but he had not a hundred pounds in the world when he fell. I and one or two of his brother officers made up the little sum, which was all that we could spare, and you dare tell us that we are trying to cheat the widow and the orphan.\" Sedley was very contrite and humbled, though the fact is that William Dobbin had told a great falsehood to the old gentleman; having himself given every shilling of the money, having buried his friend, and paid all the fees and charges incident upon the calamity and removal of poor Amelia.\nAbout these expenses old Osborne had never given himself any trouble to think, nor any other relative of Amelia, nor Amelia herself, indeed. She trusted to Major Dobbin as an accountant, took his somewhat confused calculations for granted, and never once suspected how much she was in his debt.\nTwice or thrice in the year, according to her promise, she wrote him letters to Madras, letters all about little Georgy. How he treasured these papers! Whenever Amelia wrote he answered, and not until then. But he sent over endless remembrances of himself to his godson and to her. He ordered and sent a box of scarfs and a grand ivory set of chess-men from China. The pawns were little green and white men, with real swords and shields; the knights were on horseback, the castles were on the backs of elephants. \"Mrs. Mango's own set at the Pineries was not so fine,\" Mr. Pestler remarked. These chess-men were the delight of Georgy's life, who printed his first letter in acknowledgement of this gift of his godpapa. He sent over preserves and pickles, which latter the young gentleman tried surreptitiously in the sideboard and half-killed himself with eating. He thought it was a judgement upon him for stealing, they were so hot. Emmy wrote a comical little account of this mishap to the Major: it pleased him to think that her spirits were rallying and that she could be merry sometimes now. He sent over a pair of shawls, a white one for her and a black one with palm-leaves for her mother, and a pair of red scarfs, as winter wrappers, for old Mr. Sedley and George. The shawls were worth fifty guineas apiece at the very least, as Mrs. Sedley knew. She wore hers in state at church at Brompton, and was congratulated by her female friends upon the splendid acquisition. Emmy's, too, became prettily her modest black gown. \"What a pity it is she won't think of him!\" Mrs. Sedley remarked to Mrs. Clapp and to all her friends of Brompton. \"Jos never sent us such presents, I am sure, and grudges us everything. It is evident that the Major is over head and ears in love with her; and yet, whenever I so much as hint it, she turns red and begins to cry and goes and sits upstairs with her miniature. I'm sick of that miniature. I wish we had never seen those odious purse-proud Osbornes.\"\nAmidst such humble scenes and associates George's early youth was passed, and the boy grew up delicate, sensitive, imperious, woman-bred--domineering the gentle mother whom he loved with passionate affection. He ruled all the rest of the little world round about him. As he grew, the elders were amazed at his haughty manner and his constant likeness to his father. He asked questions about everything, as inquiring youth will do. The profundity of his remarks and interrogatories astonished his old grandfather, who perfectly bored the club at the tavern with stories about the little lad's learning and genius. He suffered his grandmother with a good-humoured indifference. The small circle round about him believed that the equal of the boy did not exist upon the earth. Georgy inherited his father's pride, and perhaps thought they were not wrong.\nWhen he grew to be about six years old, Dobbin began to write to him very much. The Major wanted to hear that Georgy was going to a school and hoped he would acquit himself with credit there: or would he have a good tutor at home? It was time that he should begin to learn; and his godfather and guardian hinted that he hoped to be allowed to defray the charges of the boy's education, which would fall heavily upon his mother's straitened income. The Major, in a word, was always thinking about Amelia and her little boy, and by orders to his agents kept the latter provided with picture-books, paint-boxes, desks, and all conceivable implements of amusement and instruction. Three days before George's sixth birthday a gentleman in a gig, accompanied by a servant, drove up to Mr. Sedley's house and asked to see Master George Osborne: it was Mr. Woolsey, military tailor, of Conduit Street, who came at the Major's order to measure the young gentleman for a suit of clothes. He had had the honour of making for the Captain, the young gentleman's father. Sometimes, too, and by the Major's desire no doubt, his sisters, the Misses Dobbin, would call in the family carriage to take Amelia and the little boy to drive if they were so inclined. The patronage and kindness of these ladies was very uncomfortable to Amelia, but she bore it meekly enough, for her nature was to yield; and, besides, the carriage and its splendours gave little Georgy immense pleasure. The ladies begged occasionally that the child might pass a day with them, and he was always glad to go to that fine garden-house at Denmark Hill, where they lived, and where there were such fine grapes in the hot-houses and peaches on the walls.\nOne day they kindly came over to Amelia with news which they were SURE would delight her--something VERY interesting about their dear William.\n\"What was it: was he coming home?\" she asked with pleasure beaming in her eyes.\n\"Oh, no--not the least--but they had very good reason to believe that dear William was about to be married--and to a relation of a very dear friend of Amelia's--to Miss Glorvina O'Dowd, Sir Michael O'Dowd's sister, who had gone out to join Lady O'Dowd at Madras--a very beautiful and accomplished girl, everybody said.\"\nAmelia said \"Oh!\" Amelia was very VERY happy indeed. But she supposed Glorvina could not be like her old acquaintance, who was most kind--but--but she was very happy indeed. And by some impulse of which I cannot explain the meaning, she took George in her arms and kissed him with an extraordinary tenderness. Her eyes were quite moist when she put the child down; and she scarcely spoke a word during the whole of the drive--though she was so very happy indeed.",
        "paragraph_chars": [
            [
                0,
                448
            ],
            [
                448,
                1857
            ],
            [
                1857,
                2254
            ],
            [
                2254,
                5189
            ],
            [
                5189,
                6098
            ],
            [
                6098,
                7646
            ],
            [
                7646,
                8669
            ],
            [
                8669,
                9589
            ],
            [
                9589,
                9805
            ],
            [
                9805,
                9867
            ],
            [
                9867,
                9985
            ],
            [
                9985,
                10272
            ],
            [
                10272,
                10464
            ],
            [
                10464,
                11265
            ],
            [
                11265,
                11632
            ],
            [
                11632,
                13375
            ],
            [
                13375,
                14929
            ],
            [
                14929,
                16702
            ],
            [
                16702,
                18275
            ],
            [
                18275,
                19495
            ],
            [
                19495,
                20353
            ],
            [
                20353,
                20916
            ],
            [
                20916,
                21686
            ],
            [
                21686,
                26397
            ],
            [
                26397,
                27641
            ],
            [
                27641,
                28802
            ],
            [
                28802,
                29097
            ],
            [
                29097,
                31092
            ],
            [
                31092,
                31944
            ],
            [
                31944,
                33654
            ],
            [
                33654,
                33797
            ],
            [
                33797,
                33877
            ],
            [
                33877,
                34197
            ],
            [
                34197,
                34659
            ]
        ],
        "segment_chars": [
            [
                0,
                181
            ],
            [
                181,
                229
            ],
            [
                229,
                257
            ],
            [
                257,
                339
            ],
            [
                339,
                397
            ],
            [
                397,
                448
            ],
            [
                448,
                543
            ],
            [
                543,
                631
            ],
            [
                631,
                786
            ],
            [
                786,
                980
            ],
            [
                980,
                1111
            ],
            [
                1111,
                1256
            ],
            [
                1256,
                1609
            ],
            [
                1609,
                1857
            ],
            [
                1857,
                1978
            ],
            [
                1978,
                2254
            ],
            [
                2254,
                2355
            ],
            [
                2355,
                2532
            ],
            [
                2532,
                2787
            ],
            [
                2787,
                2851
            ],
            [
                2851,
                3095
            ],
            [
                3095,
                3237
            ],
            [
                3237,
                3365
            ],
            [
                3365,
                3611
            ],
            [
                3611,
                3696
            ],
            [
                3696,
                3836
            ],
            [
                3836,
                3888
            ],
            [
                3888,
                4046
            ],
            [
                4046,
                4091
            ],
            [
                4091,
                4202
            ],
            [
                4202,
                4372
            ],
            [
                4372,
                4685
            ],
            [
                4685,
                4804
            ],
            [
                4804,
                5136
            ],
            [
                5136,
                5189
            ],
            [
                5189,
                5340
            ],
            [
                5340,
                5561
            ],
            [
                5561,
                5967
            ],
            [
                5967,
                6098
            ],
            [
                6098,
                6131
            ],
            [
                6131,
                6210
            ],
            [
                6210,
                6367
            ],
            [
                6367,
                6826
            ],
            [
                6826,
                6926
            ],
            [
                6926,
                6997
            ],
            [
                6997,
                7079
            ],
            [
                7079,
                7200
            ],
            [
                7200,
                7646
            ],
            [
                7646,
                7887
            ],
            [
                7887,
                8219
            ],
            [
                8219,
                8669
            ],
            [
                8669,
                9148
            ],
            [
                9148,
                9304
            ],
            [
                9304,
                9433
            ],
            [
                9433,
                9589
            ],
            [
                9589,
                9643
            ],
            [
                9643,
                9805
            ],
            [
                9805,
                9825
            ],
            [
                9825,
                9867
            ],
            [
                9867,
                9941
            ],
            [
                9941,
                9985
            ],
            [
                9985,
                10051
            ],
            [
                10051,
                10097
            ],
            [
                10097,
                10272
            ],
            [
                10272,
                10365
            ],
            [
                10365,
                10464
            ],
            [
                10464,
                10561
            ],
            [
                10561,
                10699
            ],
            [
                10699,
                11183
            ],
            [
                11183,
                11201
            ],
            [
                11201,
                11265
            ],
            [
                11265,
                11281
            ],
            [
                11281,
                11369
            ],
            [
                11369,
                11391
            ],
            [
                11391,
                11511
            ],
            [
                11511,
                11632
            ],
            [
                11632,
                11752
            ],
            [
                11752,
                11888
            ],
            [
                11888,
                11958
            ],
            [
                11958,
                12042
            ],
            [
                12042,
                12185
            ],
            [
                12185,
                12276
            ],
            [
                12276,
                12336
            ],
            [
                12336,
                12475
            ],
            [
                12475,
                12805
            ],
            [
                12805,
                12995
            ],
            [
                12995,
                13375
            ],
            [
                13375,
                13425
            ],
            [
                13425,
                13546
            ],
            [
                13546,
                13636
            ],
            [
                13636,
                13820
            ],
            [
                13820,
                13899
            ],
            [
                13899,
                14109
            ],
            [
                14109,
                14201
            ],
            [
                14201,
                14351
            ],
            [
                14351,
                14454
            ],
            [
                14454,
                14557
            ],
            [
                14557,
                14812
            ],
            [
                14812,
                14929
            ],
            [
                14929,
                15152
            ],
            [
                15152,
                15257
            ],
            [
                15257,
                15341
            ],
            [
                15341,
                15493
            ],
            [
                15493,
                15669
            ],
            [
                15669,
                15980
            ],
            [
                15980,
                16702
            ],
            [
                16702,
                16956
            ],
            [
                16956,
                17205
            ],
            [
                17205,
                17445
            ],
            [
                17445,
                17683
            ],
            [
                17683,
                17730
            ],
            [
                17730,
                17869
            ],
            [
                17869,
                17983
            ],
            [
                17983,
                18013
            ],
            [
                18013,
                18275
            ],
            [
                18275,
                18526
            ],
            [
                18526,
                19169
            ],
            [
                19169,
                19189
            ],
            [
                19189,
                19300
            ],
            [
                19300,
                19495
            ],
            [
                19495,
                19575
            ],
            [
                19575,
                19843
            ],
            [
                19843,
                19905
            ],
            [
                19905,
                19985
            ],
            [
                19985,
                20068
            ],
            [
                20068,
                20130
            ],
            [
                20130,
                20353
            ],
            [
                20353,
                20405
            ],
            [
                20405,
                20493
            ],
            [
                20493,
                20602
            ],
            [
                20602,
                20661
            ],
            [
                20661,
                20726
            ],
            [
                20726,
                20841
            ],
            [
                20841,
                20859
            ],
            [
                20859,
                20916
            ],
            [
                20916,
                20987
            ],
            [
                20987,
                21291
            ],
            [
                21291,
                21686
            ],
            [
                21686,
                21979
            ],
            [
                21979,
                22015
            ],
            [
                22015,
                22082
            ],
            [
                22082,
                22150
            ],
            [
                22150,
                22669
            ],
            [
                22669,
                22769
            ],
            [
                22769,
                23341
            ],
            [
                23341,
                23415
            ],
            [
                23415,
                23541
            ],
            [
                23541,
                23671
            ],
            [
                23671,
                23746
            ],
            [
                23746,
                24005
            ],
            [
                24005,
                24119
            ],
            [
                24119,
                24285
            ],
            [
                24285,
                24345
            ],
            [
                24345,
                24355
            ],
            [
                24355,
                24407
            ],
            [
                24407,
                24747
            ],
            [
                24747,
                25042
            ],
            [
                25042,
                25251
            ],
            [
                25251,
                25526
            ],
            [
                25526,
                25931
            ],
            [
                25931,
                26397
            ],
            [
                26397,
                26674
            ],
            [
                26674,
                27159
            ],
            [
                27159,
                27243
            ],
            [
                27243,
                27350
            ],
            [
                27350,
                27641
            ],
            [
                27641,
                27878
            ],
            [
                27878,
                27922
            ],
            [
                27922,
                28229
            ],
            [
                28229,
                28335
            ],
            [
                28335,
                28511
            ],
            [
                28511,
                28802
            ],
            [
                28802,
                28943
            ],
            [
                28943,
                29097
            ],
            [
                29097,
                29218
            ],
            [
                29218,
                29249
            ],
            [
                29249,
                29304
            ],
            [
                29304,
                29379
            ],
            [
                29379,
                29462
            ],
            [
                29462,
                29610
            ],
            [
                29610,
                29688
            ],
            [
                29688,
                29816
            ],
            [
                29816,
                29961
            ],
            [
                29961,
                30032
            ],
            [
                30032,
                30195
            ],
            [
                30195,
                30372
            ],
            [
                30372,
                30455
            ],
            [
                30455,
                30576
            ],
            [
                30576,
                30628
            ],
            [
                30628,
                30672
            ],
            [
                30672,
                30743
            ],
            [
                30743,
                30815
            ],
            [
                30815,
                31003
            ],
            [
                31003,
                31031
            ],
            [
                31031,
                31092
            ],
            [
                31092,
                31301
            ],
            [
                31301,
                31360
            ],
            [
                31360,
                31458
            ],
            [
                31458,
                31523
            ],
            [
                31523,
                31705
            ],
            [
                31705,
                31768
            ],
            [
                31768,
                31866
            ],
            [
                31866,
                31944
            ],
            [
                31944,
                32024
            ],
            [
                32024,
                32175
            ],
            [
                32175,
                32392
            ],
            [
                32392,
                32621
            ],
            [
                32621,
                32922
            ],
            [
                32922,
                33001
            ],
            [
                33001,
                33188
            ],
            [
                33188,
                33408
            ],
            [
                33408,
                33654
            ],
            [
                33654,
                33797
            ],
            [
                33797,
                33832
            ],
            [
                33832,
                33877
            ],
            [
                33877,
                34197
            ],
            [
                34197,
                34215
            ],
            [
                34215,
                34250
            ],
            [
                34250,
                34371
            ],
            [
                34371,
                34507
            ],
            [
                34507,
                34659
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                102,
                119
            ],
            [
                76,
                82
            ],
            [
                143,
                181
            ],
            [
                181,
                199
            ],
            [
                227,
                229
            ],
            [
                229,
                257
            ],
            [
                257,
                265
            ],
            [
                271,
                286
            ],
            [
                337,
                339
            ],
            [
                339,
                397
            ],
            [
                397,
                406
            ],
            [
                429,
                448
            ],
            [
                448,
                458
            ],
            [
                463,
                541
            ],
            [
                569,
                570
            ],
            [
                694,
                717
            ],
            [
                585,
                587
            ],
            [
                744,
                754
            ],
            [
                784,
                786
            ],
            [
                786,
                823
            ],
            [
                906,
                907
            ],
            [
                824,
                852
            ],
            [
                879,
                881
            ],
            [
                899,
                902
            ],
            [
                942,
                960
            ],
            [
                978,
                980
            ],
            [
                980,
                997
            ],
            [
                1008,
                1072
            ],
            [
                1109,
                1111
            ],
            [
                1111,
                1138
            ],
            [
                1209,
                1256
            ],
            [
                1260,
                1299
            ],
            [
                1342,
                1350
            ],
            [
                1352,
                1361
            ],
            [
                1365,
                1383
            ],
            [
                1426,
                1504
            ],
            [
                1607,
                1609
            ],
            [
                1609,
                1697
            ],
            [
                1717,
                1726
            ],
            [
                1738,
                1812
            ],
            [
                1826,
                1829
            ],
            [
                1841,
                1857
            ],
            [
                2267,
                2355
            ],
            [
                2355,
                2365
            ],
            [
                2391,
                2397
            ],
            [
                2520,
                2522
            ],
            [
                2366,
                2379
            ],
            [
                2397,
                2402
            ],
            [
                2387,
                2390
            ],
            [
                2403,
                2428
            ],
            [
                2466,
                2473
            ],
            [
                2530,
                2532
            ],
            [
                2532,
                2580
            ],
            [
                2581,
                2582
            ],
            [
                2594,
                2607
            ],
            [
                2618,
                2644
            ],
            [
                2688,
                2779
            ],
            [
                2785,
                2787
            ],
            [
                2787,
                2828
            ],
            [
                2842,
                2851
            ],
            [
                2862,
                2886
            ],
            [
                2896,
                2944
            ],
            [
                3093,
                3095
            ],
            [
                3134,
                3196
            ],
            [
                3271,
                3286
            ],
            [
                3317,
                3364
            ],
            [
                3611,
                3643
            ],
            [
                3665,
                3674
            ],
            [
                3696,
                3712
            ],
            [
                3728,
                3759
            ],
            [
                3778,
                3784
            ],
            [
                3834,
                3836
            ],
            [
                3888,
                3913
            ],
            [
                3936,
                3964
            ],
            [
                4044,
                4046
            ],
            [
                4046,
                4090
            ],
            [
                5189,
                5243
            ],
            [
                5321,
                5340
            ],
            [
                5340,
                5382
            ],
            [
                5387,
                5401
            ],
            [
                5482,
                5488
            ],
            [
                5466,
                5469
            ],
            [
                5500,
                5503
            ],
            [
                5559,
                5561
            ],
            [
                5807,
                5822
            ],
            [
                5832,
                5853
            ],
            [
                5727,
                5730
            ],
            [
                5965,
                5967
            ],
            [
                5967,
                6033
            ],
            [
                6035,
                6098
            ],
            [
                6098,
                6131
            ],
            [
                6131,
                6210
            ],
            [
                6210,
                6276
            ],
            [
                6365,
                6367
            ],
            [
                6367,
                6381
            ],
            [
                6396,
                6476
            ],
            [
                6485,
                6493
            ],
            [
                6554,
                6640
            ],
            [
                6716,
                6746
            ],
            [
                6824,
                6826
            ],
            [
                6826,
                6843
            ],
            [
                6852,
                6883
            ],
            [
                6896,
                6925
            ],
            [
                7532,
                7542
            ],
            [
                7727,
                7764
            ],
            [
                7769,
                7887
            ],
            [
                7887,
                8030
            ],
            [
                8036,
                8051
            ],
            [
                8068,
                8157
            ],
            [
                8169,
                8219
            ],
            [
                8219,
                8221
            ],
            [
                8372,
                8408
            ],
            [
                8469,
                8577
            ],
            [
                8598,
                8629
            ],
            [
                8642,
                8644
            ],
            [
                8631,
                8640
            ],
            [
                8667,
                8669
            ],
            [
                8669,
                8717
            ],
            [
                8726,
                8772
            ],
            [
                8774,
                8825
            ],
            [
                8938,
                8950
            ],
            [
                8965,
                9044
            ],
            [
                9046,
                9073
            ],
            [
                9088,
                9103
            ],
            [
                9118,
                9132
            ],
            [
                9146,
                9148
            ],
            [
                9148,
                9168
            ],
            [
                9182,
                9202
            ],
            [
                9274,
                9304
            ],
            [
                9304,
                9307
            ],
            [
                9327,
                9331
            ],
            [
                9308,
                9314
            ],
            [
                9337,
                9347
            ],
            [
                9433,
                9452
            ],
            [
                9460,
                9481
            ],
            [
                9487,
                9494
            ],
            [
                9498,
                9545
            ],
            [
                9555,
                9589
            ],
            [
                9589,
                9643
            ],
            [
                9643,
                9682
            ],
            [
                9683,
                9688
            ],
            [
                9693,
                9694
            ],
            [
                9763,
                9805
            ],
            [
                9805,
                9824
            ],
            [
                9867,
                9931
            ],
            [
                9939,
                9941
            ],
            [
                9941,
                9985
            ],
            [
                9985,
                10022
            ],
            [
                10027,
                10051
            ],
            [
                10051,
                10097
            ],
            [
                10126,
                10149
            ],
            [
                10196,
                10234
            ],
            [
                10241,
                10272
            ],
            [
                10272,
                10331
            ],
            [
                10389,
                10390
            ],
            [
                10333,
                10334
            ],
            [
                10368,
                10381
            ],
            [
                10391,
                10438
            ],
            [
                10444,
                10460
            ],
            [
                10464,
                10481
            ],
            [
                10483,
                10510
            ],
            [
                10559,
                10561
            ],
            [
                10561,
                10633
            ],
            [
                10637,
                10646
            ],
            [
                10678,
                10689
            ],
            [
                10697,
                10699
            ],
            [
                10699,
                10814
            ],
            [
                10829,
                10841
            ],
            [
                10844,
                10916
            ],
            [
                10960,
                10995
            ],
            [
                11166,
                11181
            ],
            [
                11265,
                11281
            ],
            [
                11281,
                11368
            ],
            [
                11422,
                11511
            ],
            [
                11511,
                11549
            ],
            [
                11630,
                11632
            ],
            [
                11632,
                11640
            ],
            [
                11653,
                11659
            ],
            [
                11668,
                11752
            ],
            [
                11769,
                11783
            ],
            [
                11906,
                11945
            ],
            [
                11956,
                11958
            ],
            [
                11958,
                12042
            ],
            [
                12042,
                12067
            ],
            [
                12076,
                12116
            ],
            [
                12126,
                12185
            ],
            [
                12185,
                12276
            ],
            [
                12336,
                12385
            ],
            [
                12400,
                12429
            ],
            [
                12460,
                12470
            ],
            [
                12473,
                12474
            ],
            [
                12475,
                12499
            ],
            [
                12533,
                12580
            ],
            [
                12633,
                12637
            ],
            [
                12673,
                12675
            ],
            [
                12642,
                12658
            ],
            [
                12720,
                12725
            ],
            [
                12638,
                12641
            ],
            [
                12726,
                12805
            ],
            [
                12809,
                12841
            ],
            [
                12860,
                12931
            ],
            [
                12993,
                12995
            ],
            [
                13014,
                13059
            ],
            [
                13295,
                13300
            ],
            [
                13070,
                13104
            ],
            [
                13121,
                13123
            ],
            [
                13133,
                13199
            ],
            [
                13059,
                13060
            ],
            [
                13200,
                13210
            ],
            [
                13108,
                13111
            ],
            [
                13301,
                13334
            ],
            [
                13341,
                13375
            ],
            [
                13375,
                13425
            ],
            [
                13425,
                13429
            ],
            [
                13442,
                13546
            ],
            [
                13546,
                13602
            ],
            [
                13607,
                13636
            ],
            [
                13636,
                13655
            ],
            [
                13685,
                13722
            ],
            [
                13809,
                13812
            ],
            [
                13735,
                13749
            ],
            [
                13818,
                13820
            ],
            [
                13899,
                14020
            ],
            [
                14107,
                14109
            ],
            [
                14109,
                14159
            ],
            [
                14265,
                14273
            ],
            [
                14201,
                14214
            ],
            [
                14278,
                14317
            ],
            [
                14199,
                14200
            ],
            [
                15167,
                15206
            ],
            [
                15216,
                15257
            ],
            [
                15257,
                15294
            ],
            [
                15315,
                15341
            ],
            [
                15341,
                15344
            ],
            [
                15354,
                15357
            ],
            [
                15379,
                15493
            ],
            [
                15493,
                15550
            ],
            [
                15552,
                15578
            ],
            [
                15591,
                15618
            ],
            [
                15636,
                15639
            ],
            [
                15644,
                15669
            ],
            [
                15686,
                15702
            ],
            [
                15777,
                15786
            ],
            [
                15813,
                15829
            ],
            [
                15851,
                15898
            ],
            [
                15924,
                15941
            ],
            [
                15942,
                15979
            ],
            [
                16759,
                16767
            ],
            [
                16734,
                16739
            ],
            [
                16772,
                16788
            ],
            [
                16905,
                16928
            ],
            [
                16933,
                16938
            ],
            [
                16954,
                16956
            ],
            [
                16956,
                16992
            ],
            [
                17052,
                17159
            ],
            [
                17164,
                17171
            ],
            [
                17195,
                17205
            ],
            [
                17205,
                17213
            ],
            [
                17298,
                17304
            ],
            [
                17223,
                17232
            ],
            [
                17244,
                17247
            ],
            [
                17344,
                17360
            ],
            [
                17389,
                17445
            ],
            [
                17445,
                17451
            ],
            [
                17452,
                17459
            ],
            [
                17472,
                17514
            ],
            [
                17529,
                17683
            ],
            [
                17869,
                17895
            ],
            [
                17901,
                17936
            ],
            [
                17946,
                17964
            ],
            [
                17975,
                17983
            ],
            [
                18009,
                18013
            ],
            [
                18013,
                18017
            ],
            [
                18092,
                18096
            ],
            [
                18103,
                18129
            ],
            [
                18137,
                18149
            ],
            [
                18180,
                18183
            ],
            [
                18150,
                18158
            ],
            [
                18162,
                18178
            ],
            [
                18273,
                18275
            ],
            [
                18275,
                18349
            ],
            [
                18368,
                18386
            ],
            [
                18407,
                18408
            ],
            [
                18459,
                18476
            ],
            [
                18481,
                18489
            ],
            [
                18502,
                18526
            ],
            [
                18526,
                18539
            ],
            [
                18553,
                18570
            ],
            [
                18901,
                18936
            ],
            [
                19047,
                19053
            ],
            [
                19057,
                19068
            ],
            [
                19075,
                19092
            ],
            [
                19125,
                19169
            ],
            [
                19169,
                19189
            ],
            [
                19189,
                19197
            ],
            [
                19212,
                19235
            ],
            [
                19258,
                19270
            ],
            [
                19284,
                19300
            ],
            [
                19300,
                19309
            ],
            [
                19317,
                19369
            ],
            [
                19493,
                19495
            ],
            [
                19603,
                19606
            ],
            [
                19575,
                19602
            ],
            [
                19615,
                19628
            ],
            [
                19638,
                19644
            ],
            [
                19671,
                19786
            ],
            [
                19807,
                19842
            ],
            [
                19843,
                19877
            ],
            [
                19894,
                19905
            ],
            [
                19905,
                19927
            ],
            [
                19933,
                19958
            ],
            [
                19983,
                19985
            ],
            [
                19985,
                19991
            ],
            [
                19996,
                20036
            ],
            [
                20074,
                20100
            ],
            [
                20105,
                20128
            ],
            [
                20353,
                20385
            ],
            [
                20403,
                20405
            ],
            [
                20405,
                20470
            ],
            [
                20491,
                20493
            ],
            [
                20493,
                20523
            ],
            [
                20537,
                20583
            ],
            [
                20590,
                20595
            ],
            [
                20600,
                20602
            ],
            [
                20726,
                20841
            ],
            [
                20841,
                20859
            ],
            [
                20859,
                20916
            ],
            [
                20916,
                20947
            ],
            [
                20985,
                20987
            ],
            [
                21125,
                21166
            ],
            [
                21171,
                21175
            ],
            [
                21025,
                21028
            ],
            [
                21238,
                21242
            ],
            [
                20987,
                20990
            ],
            [
                21250,
                21257
            ],
            [
                21289,
                21291
            ],
            [
                21305,
                21308
            ],
            [
                21296,
                21304
            ],
            [
                21309,
                21354
            ],
            [
                21372,
                21384
            ],
            [
                21431,
                21470
            ],
            [
                21480,
                21497
            ],
            [
                21594,
                21619
            ],
            [
                21627,
                21645
            ],
            [
                21651,
                21686
            ],
            [
                21686,
                21755
            ],
            [
                21888,
                21891
            ],
            [
                21756,
                21788
            ],
            [
                21940,
                21942
            ],
            [
                21789,
                21797
            ],
            [
                21977,
                21979
            ],
            [
                21994,
                22013
            ],
            [
                22032,
                22046
            ],
            [
                22054,
                22063
            ],
            [
                22076,
                22082
            ],
            [
                22250,
                22357
            ],
            [
                22364,
                22371
            ],
            [
                22683,
                22694
            ],
            [
                22570,
                22579
            ],
            [
                22698,
                22735
            ],
            [
                22746,
                22757
            ],
            [
                22667,
                22668
            ],
            [
                22769,
                22807
            ],
            [
                22809,
                22830
            ],
            [
                22834,
                22846
            ],
            [
                22911,
                22918
            ],
            [
                22923,
                22935
            ],
            [
                22950,
                22959
            ],
            [
                22967,
                22978
            ],
            [
                22983,
                23007
            ],
            [
                23020,
                23025
            ],
            [
                23043,
                23056
            ],
            [
                23063,
                23076
            ],
            [
                23305,
                23341
            ],
            [
                23341,
                23351
            ],
            [
                23366,
                23387
            ],
            [
                23413,
                23415
            ],
            [
                23415,
                23418
            ],
            [
                23466,
                23479
            ],
            [
                23447,
                23452
            ],
            [
                23545,
                23557
            ],
            [
                23671,
                23688
            ],
            [
                23709,
                23746
            ],
            [
                23746,
                23776
            ],
            [
                23785,
                23804
            ],
            [
                23812,
                23875
            ],
            [
                23894,
                23935
            ],
            [
                23952,
                23982
            ],
            [
                23989,
                23990
            ],
            [
                24119,
                24164
            ],
            [
                24206,
                24221
            ],
            [
                24222,
                24257
            ],
            [
                24269,
                24285
            ],
            [
                24285,
                24345
            ],
            [
                24345,
                24355
            ],
            [
                24355,
                24406
            ],
            [
                24407,
                24426
            ],
            [
                24435,
                24483
            ],
            [
                24572,
                24603
            ],
            [
                24614,
                24624
            ],
            [
                24656,
                24710
            ],
            [
                24745,
                24747
            ],
            [
                24773,
                24838
            ],
            [
                24851,
                24875
            ],
            [
                24881,
                24888
            ],
            [
                24906,
                25042
            ],
            [
                25042,
                25104
            ],
            [
                25249,
                25251
            ],
            [
                25302,
                25378
            ],
            [
                25414,
                25463
            ],
            [
                25492,
                25525
            ],
            [
                25526,
                25541
            ],
            [
                25559,
                25570
            ],
            [
                25581,
                25659
            ],
            [
                25664,
                25681
            ],
            [
                25695,
                25715
            ],
            [
                25724,
                25744
            ],
            [
                25746,
                25762
            ],
            [
                25815,
                25879
            ],
            [
                25903,
                25906
            ],
            [
                25929,
                25931
            ],
            [
                25931,
                25934
            ],
            [
                26102,
                26131
            ],
            [
                26217,
                26220
            ],
            [
                26132,
                26142
            ],
            [
                26180,
                26187
            ],
            [
                26161,
                26178
            ],
            [
                26192,
                26215
            ],
            [
                26254,
                26275
            ],
            [
                26061,
                26064
            ],
            [
                26012,
                26015
            ],
            [
                26288,
                26324
            ],
            [
                26336,
                26342
            ],
            [
                26350,
                26360
            ],
            [
                26378,
                26397
            ],
            [
                26397,
                26476
            ],
            [
                26511,
                26539
            ],
            [
                26552,
                26561
            ],
            [
                26568,
                26575
            ],
            [
                26603,
                26609
            ],
            [
                26579,
                26602
            ],
            [
                26610,
                26621
            ],
            [
                26630,
                26674
            ],
            [
                26674,
                26735
            ],
            [
                26747,
                26763
            ],
            [
                26803,
                26832
            ],
            [
                26794,
                26799
            ],
            [
                26898,
                26931
            ],
            [
                26984,
                27000
            ],
            [
                26938,
                26941
            ],
            [
                27014,
                27017
            ],
            [
                27059,
                27063
            ],
            [
                27030,
                27054
            ],
            [
                27091,
                27145
            ],
            [
                27157,
                27159
            ],
            [
                27213,
                27241
            ],
            [
                27280,
                27288
            ],
            [
                27306,
                27350
            ],
            [
                27350,
                27489
            ],
            [
                27561,
                27601
            ],
            [
                27612,
                27641
            ],
            [
                27641,
                27756
            ],
            [
                27876,
                27877
            ],
            [
                27878,
                27899
            ],
            [
                27911,
                27920
            ],
            [
                27960,
                27961
            ],
            [
                27922,
                27923
            ],
            [
                27962,
                28022
            ],
            [
                28030,
                28066
            ],
            [
                28074,
                28087
            ],
            [
                28102,
                28149
            ],
            [
                28161,
                28170
            ],
            [
                28227,
                28229
            ],
            [
                28229,
                28267
            ],
            [
                28273,
                28335
            ],
            [
                28335,
                28510
            ],
            [
                28511,
                28535
            ],
            [
                28547,
                28555
            ],
            [
                28560,
                28564
            ],
            [
                28573,
                28596
            ],
            [
                28597,
                28614
            ],
            [
                28635,
                28685
            ],
            [
                28800,
                28802
            ],
            [
                28926,
                28933
            ],
            [
                28835,
                28850
            ],
            [
                28859,
                28862
            ],
            [
                28871,
                28873
            ],
            [
                28941,
                28943
            ],
            [
                28943,
                29051
            ],
            [
                29057,
                29097
            ],
            [
                29097,
                29112
            ],
            [
                29120,
                29125
            ],
            [
                29150,
                29173
            ],
            [
                29183,
                29184
            ],
            [
                29193,
                29218
            ],
            [
                29218,
                29234
            ],
            [
                29247,
                29249
            ],
            [
                29249,
                29304
            ],
            [
                29304,
                29328
            ],
            [
                29353,
                29377
            ],
            [
                29399,
                29460
            ],
            [
                29503,
                29533
            ],
            [
                29564,
                29565
            ],
            [
                29390,
                29393
            ],
            [
                29566,
                29577
            ],
            [
                29583,
                29610
            ],
            [
                29688,
                29703
            ],
            [
                29724,
                29730
            ],
            [
                29737,
                29742
            ],
            [
                29751,
                29799
            ],
            [
                29814,
                29816
            ],
            [
                29819,
                29857
            ],
            [
                29885,
                29906
            ],
            [
                29924,
                29959
            ],
            [
                30012,
                30032
            ],
            [
                30032,
                30125
            ],
            [
                30161,
                30195
            ],
            [
                30195,
                30294
            ],
            [
                30388,
                30455
            ],
            [
                30455,
                30477
            ],
            [
                30481,
                30487
            ],
            [
                30499,
                30544
            ],
            [
                30574,
                30575
            ],
            [
                30628,
                30672
            ],
            [
                30672,
                30706
            ],
            [
                30741,
                30743
            ],
            [
                30743,
                30776
            ],
            [
                30788,
                30815
            ],
            [
                30834,
                30846
            ],
            [
                30852,
                30856
            ],
            [
                30847,
                30851
            ],
            [
                30866,
                30903
            ],
            [
                30915,
                30927
            ],
            [
                30942,
                31003
            ],
            [
                31003,
                31031
            ],
            [
                31031,
                31068
            ],
            [
                31081,
                31092
            ],
            [
                31092,
                31117
            ],
            [
                31133,
                31164
            ],
            [
                31299,
                31300
            ],
            [
                31170,
                31228
            ],
            [
                31230,
                31241
            ],
            [
                31246,
                31259
            ],
            [
                31118,
                31121
            ],
            [
                31314,
                31342
            ],
            [
                31355,
                31360
            ],
            [
                31372,
                31424
            ],
            [
                31434,
                31458
            ],
            [
                31458,
                31494
            ],
            [
                31584,
                31603
            ],
            [
                31768,
                31784
            ],
            [
                31661,
                31666
            ],
            [
                31801,
                31818
            ],
            [
                31832,
                31835
            ],
            [
                31819,
                31824
            ],
            [
                31850,
                31866
            ],
            [
                31866,
                31944
            ],
            [
                31944,
                31951
            ],
            [
                31963,
                31972
            ],
            [
                31982,
                32012
            ],
            [
                32022,
                32024
            ],
            [
                32024,
                32073
            ],
            [
                32076,
                32082
            ],
            [
                32134,
                32175
            ],
            [
                32175,
                32221
            ],
            [
                32249,
                32286
            ],
            [
                32309,
                32328
            ],
            [
                32390,
                32391
            ],
            [
                32392,
                32470
            ],
            [
                32484,
                32494
            ],
            [
                32525,
                32551
            ],
            [
                32560,
                32563
            ],
            [
                32553,
                32558
            ],
            [
                32619,
                32621
            ],
            [
                32621,
                32683
            ],
            [
                32711,
                32788
            ],
            [
                32700,
                32701
            ],
            [
                32802,
                32817
            ],
            [
                32836,
                32909
            ],
            [
                32791,
                32792
            ],
            [
                33001,
                33016
            ],
            [
                33021,
                33064
            ],
            [
                33085,
                33152
            ],
            [
                33156,
                33161
            ],
            [
                33186,
                33188
            ],
            [
                33192,
                33201
            ],
            [
                33231,
                33287
            ],
            [
                33294,
                33295
            ],
            [
                33202,
                33205
            ],
            [
                33339,
                33408
            ],
            [
                33408,
                33513
            ],
            [
                33519,
                33523
            ],
            [
                33531,
                33536
            ],
            [
                33552,
                33553
            ],
            [
                33576,
                33592
            ],
            [
                33603,
                33654
            ],
            [
                33654,
                33742
            ],
            [
                33771,
                33797
            ],
            [
                33797,
                33832
            ],
            [
                33832,
                33855
            ],
            [
                33875,
                33877
            ],
            [
                33877,
                33884
            ],
            [
                33901,
                33913
            ],
            [
                33919,
                33983
            ],
            [
                33985,
                34036
            ],
            [
                34038,
                34061
            ],
            [
                34090,
                34128
            ],
            [
                34140,
                34197
            ],
            [
                34197,
                34215
            ],
            [
                34254,
                34257
            ],
            [
                34222,
                34230
            ],
            [
                34236,
                34241
            ],
            [
                34314,
                34315
            ],
            [
                34340,
                34371
            ],
            [
                34430,
                34472
            ],
            [
                34428,
                34429
            ],
            [
                34371,
                34374
            ],
            [
                34507,
                34560
            ],
            [
                34505,
                34506
            ],
            [
                34566,
                34602
            ],
            [
                34616,
                34621
            ],
            [
                34623,
                34659
            ]
        ],
        "row_chars": [
            [
                0,
                181
            ],
            [
                181,
                229
            ],
            [
                229,
                257
            ],
            [
                257,
                339
            ],
            [
                339,
                397
            ],
            [
                397,
                448
            ],
            [
                448,
                786
            ],
            [
                786,
                980
            ],
            [
                980,
                1111
            ],
            [
                1111,
                1256
            ],
            [
                1256,
                1609
            ],
            [
                1609,
                1857
            ],
            [
                1857,
                1978
            ],
            [
                1978,
                2254
            ],
            [
                2254,
                2355
            ],
            [
                2355,
                2532
            ],
            [
                2532,
                2787
            ],
            [
                2787,
                2851
            ],
            [
                2851,
                3095
            ],
            [
                3095,
                3365
            ],
            [
                3365,
                3611
            ],
            [
                3611,
                3696
            ],
            [
                3696,
                3836
            ],
            [
                3836,
                3888
            ],
            [
                3888,
                4046
            ],
            [
                4046,
                4091
            ],
            [
                4091,
                4202
            ],
            [
                4202,
                4372
            ],
            [
                4372,
                4685
            ],
            [
                4685,
                4804
            ],
            [
                4804,
                5136
            ],
            [
                5136,
                5189
            ],
            [
                5189,
                5340
            ],
            [
                5340,
                5561
            ],
            [
                5561,
                5967
            ],
            [
                5967,
                6098
            ],
            [
                6098,
                6131
            ],
            [
                6131,
                6210
            ],
            [
                6210,
                6367
            ],
            [
                6367,
                6826
            ],
            [
                6826,
                6926
            ],
            [
                6926,
                6997
            ],
            [
                6997,
                7079
            ],
            [
                7079,
                7200
            ],
            [
                7200,
                7887
            ],
            [
                7887,
                8219
            ],
            [
                8219,
                8669
            ],
            [
                8669,
                9148
            ],
            [
                9148,
                9304
            ],
            [
                9304,
                9589
            ],
            [
                9589,
                9643
            ],
            [
                9643,
                9805
            ],
            [
                9805,
                9825
            ],
            [
                9825,
                9867
            ],
            [
                9867,
                9941
            ],
            [
                9941,
                9985
            ],
            [
                9985,
                10051
            ],
            [
                10051,
                10097
            ],
            [
                10097,
                10272
            ],
            [
                10272,
                10464
            ],
            [
                10464,
                10561
            ],
            [
                10561,
                10699
            ],
            [
                10699,
                11183
            ],
            [
                11183,
                11201
            ],
            [
                11201,
                11265
            ],
            [
                11265,
                11281
            ],
            [
                11281,
                11369
            ],
            [
                11369,
                11391
            ],
            [
                11391,
                11511
            ],
            [
                11511,
                11632
            ],
            [
                11632,
                11752
            ],
            [
                11752,
                11958
            ],
            [
                11958,
                12042
            ],
            [
                12042,
                12185
            ],
            [
                12185,
                12276
            ],
            [
                12276,
                12336
            ],
            [
                12336,
                12475
            ],
            [
                12475,
                12805
            ],
            [
                12805,
                12995
            ],
            [
                12995,
                13375
            ],
            [
                13375,
                13425
            ],
            [
                13425,
                13546
            ],
            [
                13546,
                13636
            ],
            [
                13636,
                13820
            ],
            [
                13820,
                13899
            ],
            [
                13899,
                14109
            ],
            [
                14109,
                14351
            ],
            [
                14351,
                14454
            ],
            [
                14454,
                14557
            ],
            [
                14557,
                14812
            ],
            [
                14812,
                14929
            ],
            [
                14929,
                15152
            ],
            [
                15152,
                15257
            ],
            [
                15257,
                15341
            ],
            [
                15341,
                15493
            ],
            [
                15493,
                15669
            ],
            [
                15669,
                15980
            ],
            [
                15980,
                16702
            ],
            [
                16702,
                16956
            ],
            [
                16956,
                17205
            ],
            [
                17205,
                17445
            ],
            [
                17445,
                17683
            ],
            [
                17683,
                17730
            ],
            [
                17730,
                17869
            ],
            [
                17869,
                17983
            ],
            [
                17983,
                18013
            ],
            [
                18013,
                18275
            ],
            [
                18275,
                18526
            ],
            [
                18526,
                19169
            ],
            [
                19169,
                19189
            ],
            [
                19189,
                19300
            ],
            [
                19300,
                19495
            ],
            [
                19495,
                19575
            ],
            [
                19575,
                19843
            ],
            [
                19843,
                19905
            ],
            [
                19905,
                19985
            ],
            [
                19985,
                20130
            ],
            [
                20130,
                20353
            ],
            [
                20353,
                20405
            ],
            [
                20405,
                20493
            ],
            [
                20493,
                20602
            ],
            [
                20602,
                20661
            ],
            [
                20661,
                20726
            ],
            [
                20726,
                20841
            ],
            [
                20841,
                20859
            ],
            [
                20859,
                20916
            ],
            [
                20916,
                20987
            ],
            [
                20987,
                21291
            ],
            [
                21291,
                21686
            ],
            [
                21686,
                21979
            ],
            [
                21979,
                22082
            ],
            [
                22082,
                22150
            ],
            [
                22150,
                22769
            ],
            [
                22769,
                23341
            ],
            [
                23341,
                23415
            ],
            [
                23415,
                23746
            ],
            [
                23746,
                24005
            ],
            [
                24005,
                24119
            ],
            [
                24119,
                24285
            ],
            [
                24285,
                24345
            ],
            [
                24345,
                24355
            ],
            [
                24355,
                24407
            ],
            [
                24407,
                24747
            ],
            [
                24747,
                25042
            ],
            [
                25042,
                25251
            ],
            [
                25251,
                25526
            ],
            [
                25526,
                25931
            ],
            [
                25931,
                26397
            ],
            [
                26397,
                26674
            ],
            [
                26674,
                27159
            ],
            [
                27159,
                27350
            ],
            [
                27350,
                27641
            ],
            [
                27641,
                27878
            ],
            [
                27878,
                28229
            ],
            [
                28229,
                28335
            ],
            [
                28335,
                28511
            ],
            [
                28511,
                28802
            ],
            [
                28802,
                28943
            ],
            [
                28943,
                29097
            ],
            [
                29097,
                29218
            ],
            [
                29218,
                29249
            ],
            [
                29249,
                29304
            ],
            [
                29304,
                29610
            ],
            [
                29610,
                29688
            ],
            [
                29688,
                29816
            ],
            [
                29816,
                30032
            ],
            [
                30032,
                30195
            ],
            [
                30195,
                30455
            ],
            [
                30455,
                30576
            ],
            [
                30576,
                30628
            ],
            [
                30628,
                30672
            ],
            [
                30672,
                30743
            ],
            [
                30743,
                30815
            ],
            [
                30815,
                31003
            ],
            [
                31003,
                31031
            ],
            [
                31031,
                31092
            ],
            [
                31092,
                31360
            ],
            [
                31360,
                31458
            ],
            [
                31458,
                31866
            ],
            [
                31866,
                31944
            ],
            [
                31944,
                32024
            ],
            [
                32024,
                32175
            ],
            [
                32175,
                32392
            ],
            [
                32392,
                32621
            ],
            [
                32621,
                32922
            ],
            [
                32922,
                33001
            ],
            [
                33001,
                33188
            ],
            [
                33188,
                33408
            ],
            [
                33408,
                33654
            ],
            [
                33654,
                33797
            ],
            [
                33797,
                33832
            ],
            [
                33832,
                33877
            ],
            [
                33877,
                34197
            ],
            [
                34197,
                34215
            ],
            [
                34215,
                34371
            ],
            [
                34371,
                34659
            ]
        ]
    },
    "abridged": {
        "text": "We must now make inquiries at Fulham about some friends whom we have left there. How is Mrs. Amelia? Is she living and thriving? What has become of Major Dobbin? And is there any news of the Collector of Boggley Wollah? The facts about him are briefly these:\nOur worthy friend Joseph Sedley returned to India not long after his escape from Brussels, soon after Napoleon had been confined to St. Helena. To hear Mr. Sedley talk on board ship, you would have supposed that he had confronted the French General personally. He had a thousand tales about the famous battles; he knew the position of every regiment. He did not deny that he had carried despatches for the Duke of Wellington. He described what the Duke did and said at Waterloo with such accurate knowledge that it was clear he must have been by the conqueror's side throughout the day. Perhaps he actually worked himself up to believe that he had been engaged with the army; certainly he made a sensation for some time at Calcutta, and was called Waterloo Sedley during his stay in Bengal.\nHis agents had orders to pay one hundred and twenty pounds yearly to his parents at Fulham. It was the couple's chief support; for old Mr. Sedley's speculations did not succeed. He tried to be a wine-merchant, a coal-merchant, and a lottery agent; he sent round prospectuses, and ordered a new brass plate for the door, and talked pompously about making his fortune. But Fortune never came back to the feeble old man. His friends dropped off, weary of buying dear coals and bad wine from him. He used to go of nights to a little club at a tavern, where he talked about millions, what Rothschild was doing, and Baring Brothers.\n\"I was better off once, sir,\" he told everybody. \"My son, sir, is chief magistrate of Ramgunge in Bengal. I might draw upon my son, sir, for two thousand pounds tomorrow. But the Sedleys were always a proud family.\"\nHad Mrs. Sedley been a woman of energy, she would have taken in boarders. The broken Sedley would have acted well as a boarding-house carver and steward. But Mrs. Sedley had not spirit enough for that. She was content to lie on the shore where fortune had stranded her; and you could see that the career of this old couple was over.\nI don't think they were unhappy. Perhaps they were a little prouder in their downfall than in their prosperity. Mrs. Sedley was always a great person for her landlady, Mrs. Clapp. The Irish maid's bonnets and ribbons, her sauciness, her idleness, her reckless prodigality of candles, amused the old lady almost as much as the doings of her former household, when she had a regiment of female domestics. And besides Betty, Mrs. Sedley had all the maids in the street to superintend.\nOn Sundays, it was old Sedley's delight to take his little grandson Georgy to the neighbouring parks or Kensington Gardens, to see the soldiers or to feed the ducks. Georgy loved the redcoats, and his grandpapa told him how his father had been a famous soldier, and introduced him to many sergeants and others wearing Waterloo medals, to whom the old grandfather pompously presented the child as the son of Captain Osborne, who died gloriously on the glorious eighteenth. He spoiled little Georgy, sadly gorging the boy until Amelia declared that George should never go out with his grandpapa unless the latter promised solemnly not to give the child any cakes or lollipops.\nBetween Mrs. Sedley and her daughter there was a coolness about this boy, and a secret jealousy. For one evening in George's very early days, Amelia ran upstairs to the nursery at the cries of the child, who had been asleep until that moment - and there found Mrs. Sedley surreptitiously giving him Daffy's Elixir. Amelia, the gentlest of everyday mortals, trembled all over with anger. Her pale cheeks flushed up; she seized the baby from her mother's arms and grasped the bottle, leaving the old lady gaping at her, and holding the guilty tea-spoon.\nAmelia flung the bottle crashing into the fire-place. \"I will not have baby poisoned, Mamma,\" she cried, turning with flashing eyes at her mother.\n\"Poisoned, Amelia!\"\n\"He shall not have any medicine but that which Mr. Pestler sends. He told me that Daffy's Elixir was poison.\"\n\"Very good: you think I'm a murderess,\" replied Mrs. Sedley. \"This is the language you use to your mother. I have sunk low in life: but I did not know I was a murderess, and thank you for the news.\"\n\"Mamma,\" said the poor girl, who was always ready for tears, \"I didn't mean - I did not wish to say you would do any wrong to the dear child, only-\"\n\"Oh, no, my love, only that I was a murderess. Though I didn't poison you, when you were a child, but gave you the best education money could buy. Yes; I've nursed five children and buried three; and the one I loved the best of all, and tended through croup, and measles, and whooping-cough, and brought up with foreign masters, regardless of expense, which I never had when I was a girl - says I'm a murderess.\"\n\"Mamma, Mamma!\" cried the bewildered girl; and the child in her arms set up a frantic chorus of shouts.\n\"Pray to God to cleanse your wicked ungrateful heart, Amelia, and may He forgive you as I do.\" And Mrs. Sedley tossed out of the room.\nTill the end of her life, this breach between Mrs. Sedley and her daughter was never thoroughly mended. The elder lady scarcely spoke to Amelia for many weeks. She warned the domestics not to touch the child, as Mrs. Osborne might be offended. She asked her daughter to satisfy herself that there was no poison in the little daily messes that were concocted for Georgy. When neighbours asked after the boy's health, she referred them pointedly to Mrs. Osborne. She would not touch the child although he was her own precious darling, for she might kill him.\nAnd whenever Mr. Pestler called, she received the doctor with such a sarcastic manner that he declared that even Lady Thistlewood could not give herself greater airs than old Mrs. Sedley, from whom he never took a fee. Very likely Emmy was jealous too, as what mother is not, of those who would manage her children for her. When anybody nursed the child, she was uneasy; and she would no more allow Mrs. Clapp to tend him than she would have let them wash her husband's miniature, which hung in the room to which she retired now for many silent, tearful, but happy years.\nIn this room was all Amelia's heart and treasure. Here she tended her boy and watched him through the many ills of childhood, with a constant passion of love. The elder George returned in him somehow, only improved, as if come back from heaven. In a hundred little ways the child was so like his father that her heart thrilled. She talked constantly to him about this dead father, and spoke of her love for George to the innocent and wondering child. To her parents she never talked about this matter, but into little George's uncomprehending ears she poured her sentimental secrets.\nMost men who came near her loved her; though they would be at a loss to tell you why. She was not brilliant, nor witty, nor extraordinarily handsome. But she charmed every one of the male sex, as invariably as she awakened the scorn and incredulity of her own sisterhood. I think it was her weakness which was her principal charm - a kind of sweet submission, which seemed to appeal to men for sympathy and protection. In the regiment, the young officers would have leapt to fight round her; and so it was in the little circle at Fulham, where she interested and pleased everybody.\nMr. Linton, the doctor's young assistant, openly declared himself her slave. He was a personable young gentleman, and if anything went wrong with Georgy, he would drop in twice or thrice in the day to see the little chap, without thinking of a fee. He would bring Georgy lozenges, and made such sweet mixtures for him that it was quite a pleasure to the child to be ailing. He and Dr. Pestler sat up two whole nights by the boy in that awful week when Georgy had the measles; and when you would have thought, from the mother's terror, that there had never been measles in the world before. Did they sit up for little Polly Clapp, the landlord's daughter, who caught the disease from Georgy? No. They pronounced hers a slight case, which would cure itself, and sent her a draught or two.\nAgain, there was the little French chevalier opposite, who gave lessons in French at various schools, at night playing tremulous gavottes on a wheezy old fiddle. Whenever this courteous old man spoke of Mistress Osborne, he would gather his fingers into a bunch, and blow them open with a kiss, exclaiming, Ah! la divine creature! He vowed that when Amelia walked, flowers grew under her feet. He called Georgy Cupid, and asked him news of Venus, his mamma.\nAnd did not Mr. Binny, the mild curate of the chapel, call assiduously upon the widow, dandle the little boy on his knee, and offer to teach him Latin, to the anger of his sister, who kept house for him?\n\"There is nothing in her, Beilby,\" his sister would say. \"When she comes to tea she does not speak a word. She is a poor lackadaisical creature, and it is only her pretty face which you gentlemen admire so.\"\nVery likely Miss Binny was right. It is the pretty face which creates sympathy in the hearts of men. A woman may possess the wisdom of Minerva, and we give no heed to her, if she is plain. And so, with their usual sense of justice, ladies argue that because a woman is handsome, therefore she is a fool. O ladies, ladies! there are some of you who are neither handsome nor wise.\nThese are but trivial incidents. During the seven years after the birth of Amelia's son, the most notable event that occurred to her was Georgy's measles. And one day, greatly to her wonder, the Reverend Mr. Binny asked her to marry him. With deep blushes and tears in her eyes, she thanked him, but said that she never could think of any but the husband whom she had lost.\nOn the twenty-fifth of April, and the eighteenth of June, the days of her marriage and widowhood, she kept to her room. On other days she was more active, teaching George to read, write and draw. She taught the child, to the best of her humble power, to acknowledge the Maker of all, and every night and morning they prayed together, asking God to bless dear Papa, as if he were in the room.\nTo wash and dress this young gentleman - to take him for a run in the mornings - to make him the most ingenious outfits, for which the thrifty widow cut up every bit of finery she possessed - occupied her many hours of the day. Others she spent at the service of her parents. She played cribbage with her father, and sang for him; she wrote out his letters, prospectuses, and projects. It was in her handwriting that the old gentleman's acquaintances were informed that he had become an agent for the Anti-Cinder Coal Company and could supply the public with the best coals.\nOne of these papers was sent to Major Dobbin, through his agents; but the Major, being in Madras at the time, had no call for coals. He knew, though, the hand which had written the prospectus. Good God! what would he not have given to hold it in his own!\nA second prospectus followed, informing the Major that J. Sedley and Company offered to their friends and the public the finest ports, sherries, and claret wines at reasonable prices. Dobbin furiously canvassed the governor, the commander-in-chief, the regiments, and everybody he knew, and sent home to Sedley and Co. orders for wine which perfectly astonished Mr. Sedley and Mr. Clapp, who was the Co. in the business. But no more orders came after that first burst of good fortune. The curses of the mess-room assailed Major Dobbin for the vile drinks he had introduced; and he bought back a great quantity of the wine, at an enormous loss to himself.\nAs for Jos, who had been promoted to the Revenue Board at Calcutta, he was wild with rage when the post brought him a bundle of these prospectuses, with a note from his father telling Jos that he had consigned a quantity of select wines to him, as per invoice, asking for payment. Jos refused the bills with scorn, and wrote back bidding the old gentleman to mind his own affairs. Sedley and Co. had to pay for the order with the profits which they had made from Madras, and with some of Emmy's savings.\nBesides her pension of fifty pounds a year, there had been five hundred pounds, left in the agent's hands at Osborne's death, which Dobbin, as George's guardian, proposed to invest at 8 per cent in an Indian house of agency. Mr. Sedley, who thought the Major had some roguish intentions about the money, went to the agents to protest; and he learned, to his surprise, that the late Captain had not left anywhere near five hundred pounds, and that it must be a separate sum, of which Major Dobbin knew the details. Old Sedley pursued the Major and demanded a statement of the late Captain's accounts. Dobbin's stammering, blushing, and awkwardness added to the other's convictions that he had a rogue to deal with, and in a majestic tone he stated his belief that the Major was unlawfully keeping his late son-in-law's money.\nDobbin at this lost all patience, and if his accuser had not been so old and so broken, a quarrel might have ensued.\n\"Come upstairs, sir,\" said the Major, \"and I will show which is the injured party, poor George or I.\" Dragging the old gentleman up to his room, he produced Osborne's accounts, and a bundle of IOU's which George had given. \"He paid his bills in England,\" Dobbin said, \"but he had not a hundred pounds in the world when he fell. I and one or two of his brother officers made up the little sum, which was all that we could spare, and you dare tell us that we are trying to cheat the widow and the orphan.\"\nSedley was very contrite, though in fact William Dobbin had told him a great falsehood; having himself given every shilling of the money.\nAmelia herself had never given any thought to all this. She trusted to Major Dobbin as an accountant, took his somewhat confused calculations for granted, and never suspected how much she was in his debt.\nTwice or thrice a year, as promised, she wrote him letters, all about little Georgy. How he treasured them! Whenever Amelia wrote he answered, and not until then. But he sent over endless gifts to his godson and to her: a box of scarfs and a grand ivory set of chess-men from China, with real swords and shields, and the castles on the backs of elephants. These chess-men delighted Georgy, who wrote his first letter in acknowledgement of this gift. Dobbin sent over preserves and pickles, which Georgy tried surreptitiously and half-killed himself with eating, they were so hot. Emmy wrote a comical little account of this mishap to the Major: it pleased him to think that she could be merry sometimes now. He sent over a pair of shawls, a white one for her and a black one with palm-leaves for her mother, worth fifty guineas apiece at the very least, as Mrs. Sedley knew. She wore hers in state to church, and was congratulated by her female friends.\n\"What a pity it is she won't think of him!\" Mrs. Sedley remarked to Mrs. Clapp. \"Jos never sent us such presents, and grudges us everything. The Major is clearly head over heels in love with her; and yet, whenever I hint it, she begins to cry and goes and sits upstairs with her miniature. I'm sick of that miniature. I wish we had never seen those odious Osbornes.\"\nAmidst such humble scenes George's early youth was passed. The boy grew up delicate, sensitive, imperious, woman-bred - domineering his gentle mother and ruling the rest of the little world around him. The elders were amazed at his haughty manner and his likeness to his father. He asked questions about everything, astonishing his old grandfather; the small circle about Georgy believed that the boy had no equal upon the earth. Georgy inherited his father's pride, and perhaps thought they were not wrong.\nWhen he was about six, Dobbin began to write to him. The Major wanted to hear that Georgy was going to school: or would he have a good tutor at home? It was time that he should begin to learn; and Dobbin hinted that he hoped to be allowed to pay for the boy's education.\nThe Major, in a word, was always thinking about Amelia and her little boy, and through his agents sent him picture-books, paint-boxes and desks. Three days before George's sixth birthday a gentleman in a gig drove up to Mr. Sedley's house and asked to see Master George Osborne: it was a military tailor, who came at the Major's order to measure the young gentleman for a suit.\nSometimes, too, by the Major's desire no doubt, his sisters would call in the family carriage to take Amelia and the little boy for a drive. This kind patronage was very uncomfortable to Amelia, but she bore it meekly, and the carriage and its splendours gave little Georgy immense pleasure. The ladies begged occasionally that the child might pass a day with them, and he was always glad to go to their fine house, where there were grapes in the hot-houses and peaches on the walls.\nOne day they kindly came over to Amelia with news which they were sure would delight her, about their dear William.\n\"What was it: was he coming home?\" she asked with pleasure.\n\"Oh, no - but they had good reason to believe that dear William was about to be married - and to a relation of a very dear friend of Amelia's - to Miss Glorvina O'Dowd, who had gone out to join Lady O'Dowd - a very beautiful and accomplished girl, everybody said.\"\nAmelia said \"Oh!\" She was very happy, although - but she was very happy indeed. She took George in her arms and kissed him, and her eyes were quite moist when she put the child down. She scarcely spoke a word during the drive - though she was so very happy indeed.",
        "paragraph_chars": [
            [
                0,
                259
            ],
            [
                259,
                1050
            ],
            [
                1050,
                1677
            ],
            [
                1677,
                1893
            ],
            [
                1893,
                2226
            ],
            [
                2226,
                2708
            ],
            [
                2708,
                3383
            ],
            [
                3383,
                3935
            ],
            [
                3935,
                4082
            ],
            [
                4082,
                4102
            ],
            [
                4102,
                4212
            ],
            [
                4212,
                4411
            ],
            [
                4411,
                4560
            ],
            [
                4560,
                4973
            ],
            [
                4973,
                5077
            ],
            [
                5077,
                5212
            ],
            [
                5212,
                5769
            ],
            [
                5769,
                6341
            ],
            [
                6341,
                6925
            ],
            [
                6925,
                7507
            ],
            [
                7507,
                8294
            ],
            [
                8294,
                8752
            ],
            [
                8752,
                8956
            ],
            [
                8956,
                9164
            ],
            [
                9164,
                9543
            ],
            [
                9543,
                9917
            ],
            [
                9917,
                10309
            ],
            [
                10309,
                10884
            ],
            [
                10884,
                11139
            ],
            [
                11139,
                11794
            ],
            [
                11794,
                12298
            ],
            [
                12298,
                13123
            ],
            [
                13123,
                13240
            ],
            [
                13240,
                13744
            ],
            [
                13744,
                13882
            ],
            [
                13882,
                14087
            ],
            [
                14087,
                15041
            ],
            [
                15041,
                15408
            ],
            [
                15408,
                15916
            ],
            [
                15916,
                16187
            ],
            [
                16187,
                16565
            ],
            [
                16565,
                17049
            ],
            [
                17049,
                17165
            ],
            [
                17165,
                17225
            ],
            [
                17225,
                17490
            ],
            [
                17490,
                17754
            ]
        ],
        "segment_chars": [
            [
                0,
                81
            ],
            [
                81,
                101
            ],
            [
                101,
                129
            ],
            [
                129,
                162
            ],
            [
                162,
                220
            ],
            [
                220,
                259
            ],
            [
                259,
                403
            ],
            [
                403,
                520
            ],
            [
                520,
                610
            ],
            [
                610,
                685
            ],
            [
                685,
                846
            ],
            [
                846,
                1050
            ],
            [
                1050,
                1142
            ],
            [
                1142,
                1228
            ],
            [
                1228,
                1417
            ],
            [
                1417,
                1468
            ],
            [
                1468,
                1543
            ],
            [
                1543,
                1677
            ],
            [
                1677,
                1726
            ],
            [
                1726,
                1783
            ],
            [
                1783,
                1848
            ],
            [
                1848,
                1893
            ],
            [
                1893,
                1967
            ],
            [
                1967,
                2047
            ],
            [
                2047,
                2095
            ],
            [
                2095,
                2226
            ],
            [
                2226,
                2259
            ],
            [
                2259,
                2338
            ],
            [
                2338,
                2406
            ],
            [
                2406,
                2629
            ],
            [
                2629,
                2708
            ],
            [
                2708,
                2874
            ],
            [
                2874,
                3180
            ],
            [
                3180,
                3383
            ],
            [
                3383,
                3480
            ],
            [
                3480,
                3698
            ],
            [
                3698,
                3770
            ],
            [
                3770,
                3935
            ],
            [
                3935,
                3989
            ],
            [
                3989,
                4082
            ],
            [
                4082,
                4102
            ],
            [
                4102,
                4168
            ],
            [
                4168,
                4212
            ],
            [
                4212,
                4273
            ],
            [
                4273,
                4319
            ],
            [
                4319,
                4411
            ],
            [
                4411,
                4560
            ],
            [
                4560,
                4607
            ],
            [
                4607,
                4707
            ],
            [
                4707,
                4973
            ],
            [
                4973,
                4989
            ],
            [
                4989,
                5077
            ],
            [
                5077,
                5172
            ],
            [
                5172,
                5212
            ],
            [
                5212,
                5316
            ],
            [
                5316,
                5372
            ],
            [
                5372,
                5456
            ],
            [
                5456,
                5582
            ],
            [
                5582,
                5673
            ],
            [
                5673,
                5769
            ],
            [
                5769,
                5988
            ],
            [
                5988,
                6093
            ],
            [
                6093,
                6341
            ],
            [
                6341,
                6391
            ],
            [
                6391,
                6500
            ],
            [
                6500,
                6586
            ],
            [
                6586,
                6669
            ],
            [
                6669,
                6792
            ],
            [
                6792,
                6925
            ],
            [
                6925,
                7011
            ],
            [
                7011,
                7075
            ],
            [
                7075,
                7197
            ],
            [
                7197,
                7344
            ],
            [
                7344,
                7507
            ],
            [
                7507,
                7584
            ],
            [
                7584,
                7756
            ],
            [
                7756,
                7881
            ],
            [
                7881,
                8097
            ],
            [
                8097,
                8198
            ],
            [
                8198,
                8202
            ],
            [
                8202,
                8294
            ],
            [
                8294,
                8456
            ],
            [
                8456,
                8605
            ],
            [
                8605,
                8625
            ],
            [
                8625,
                8688
            ],
            [
                8688,
                8752
            ],
            [
                8752,
                8956
            ],
            [
                8956,
                9013
            ],
            [
                9013,
                9063
            ],
            [
                9063,
                9164
            ],
            [
                9164,
                9198
            ],
            [
                9198,
                9265
            ],
            [
                9265,
                9353
            ],
            [
                9353,
                9468
            ],
            [
                9468,
                9486
            ],
            [
                9486,
                9543
            ],
            [
                9543,
                9576
            ],
            [
                9576,
                9698
            ],
            [
                9698,
                9781
            ],
            [
                9781,
                9917
            ],
            [
                9917,
                10037
            ],
            [
                10037,
                10113
            ],
            [
                10113,
                10309
            ],
            [
                10309,
                10537
            ],
            [
                10537,
                10585
            ],
            [
                10585,
                10695
            ],
            [
                10695,
                10884
            ],
            [
                10884,
                11017
            ],
            [
                11017,
                11077
            ],
            [
                11077,
                11087
            ],
            [
                11087,
                11139
            ],
            [
                11139,
                11323
            ],
            [
                11323,
                11560
            ],
            [
                11560,
                11624
            ],
            [
                11624,
                11794
            ],
            [
                11794,
                12075
            ],
            [
                12075,
                12175
            ],
            [
                12175,
                12298
            ],
            [
                12298,
                12523
            ],
            [
                12523,
                12812
            ],
            [
                12812,
                12898
            ],
            [
                12898,
                13123
            ],
            [
                13123,
                13240
            ],
            [
                13240,
                13342
            ],
            [
                13342,
                13463
            ],
            [
                13463,
                13568
            ],
            [
                13568,
                13744
            ],
            [
                13744,
                13882
            ],
            [
                13882,
                13938
            ],
            [
                13938,
                14087
            ],
            [
                14087,
                14172
            ],
            [
                14172,
                14195
            ],
            [
                14195,
                14250
            ],
            [
                14250,
                14443
            ],
            [
                14443,
                14537
            ],
            [
                14537,
                14667
            ],
            [
                14667,
                14795
            ],
            [
                14795,
                14962
            ],
            [
                14962,
                15041
            ],
            [
                15041,
                15085
            ],
            [
                15085,
                15121
            ],
            [
                15121,
                15182
            ],
            [
                15182,
                15331
            ],
            [
                15331,
                15359
            ],
            [
                15359,
                15408
            ],
            [
                15408,
                15467
            ],
            [
                15467,
                15610
            ],
            [
                15610,
                15687
            ],
            [
                15687,
                15838
            ],
            [
                15838,
                15916
            ],
            [
                15916,
                15969
            ],
            [
                15969,
                16066
            ],
            [
                16066,
                16187
            ],
            [
                16187,
                16332
            ],
            [
                16332,
                16565
            ],
            [
                16565,
                16706
            ],
            [
                16706,
                16857
            ],
            [
                16857,
                17049
            ],
            [
                17049,
                17165
            ],
            [
                17165,
                17200
            ],
            [
                17200,
                17225
            ],
            [
                17225,
                17490
            ],
            [
                17490,
                17508
            ],
            [
                17508,
                17570
            ],
            [
                17570,
                17673
            ],
            [
                17673,
                17754
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                12,
                29
            ],
            [
                30,
                36
            ],
            [
                43,
                81
            ],
            [
                81,
                99
            ],
            [
                99,
                101
            ],
            [
                101,
                129
            ],
            [
                129,
                137
            ],
            [
                145,
                160
            ],
            [
                160,
                162
            ],
            [
                162,
                220
            ],
            [
                220,
                229
            ],
            [
                240,
                259
            ],
            [
                259,
                269
            ],
            [
                270,
                348
            ],
            [
                348,
                349
            ],
            [
                350,
                373
            ],
            [
                388,
                390
            ],
            [
                391,
                401
            ],
            [
                401,
                403
            ],
            [
                403,
                440
            ],
            [
                440,
                441
            ],
            [
                442,
                470
            ],
            [
                471,
                473
            ],
            [
                474,
                477
            ],
            [
                489,
                507
            ],
            [
                518,
                520
            ],
            [
                520,
                537
            ],
            [
                544,
                608
            ],
            [
                608,
                610
            ],
            [
                610,
                637
            ],
            [
                638,
                685
            ],
            [
                685,
                724
            ],
            [
                728,
                736
            ],
            [
                737,
                746
            ],
            [
                747,
                765
            ],
            [
                766,
                844
            ],
            [
                844,
                846
            ],
            [
                846,
                934
            ],
            [
                945,
                954
            ],
            [
                955,
                1029
            ],
            [
                1030,
                1033
            ],
            [
                1034,
                1050
            ],
            [
                1054,
                1142
            ],
            [
                1142,
                1152
            ],
            [
                1153,
                1159
            ],
            [
                1159,
                1161
            ],
            [
                1162,
                1175
            ],
            [
                1175,
                1180
            ],
            [
                1181,
                1184
            ],
            [
                1185,
                1210
            ],
            [
                1211,
                1218
            ],
            [
                1226,
                1228
            ],
            [
                1228,
                1276
            ],
            [
                1281,
                1282
            ],
            [
                1283,
                1296
            ],
            [
                1298,
                1324
            ],
            [
                1324,
                1415
            ],
            [
                1415,
                1417
            ],
            [
                1417,
                1458
            ],
            [
                1459,
                1468
            ],
            [
                1468,
                1492
            ],
            [
                1493,
                1541
            ],
            [
                1541,
                1543
            ],
            [
                1543,
                1605
            ],
            [
                1613,
                1628
            ],
            [
                1629,
                1676
            ],
            [
                1677,
                1709
            ],
            [
                1715,
                1724
            ],
            [
                1726,
                1742
            ],
            [
                1743,
                1774
            ],
            [
                1775,
                1781
            ],
            [
                1781,
                1783
            ],
            [
                1783,
                1808
            ],
            [
                1809,
                1837
            ],
            [
                1846,
                1848
            ],
            [
                1848,
                1892
            ],
            [
                1893,
                1947
            ],
            [
                1948,
                1967
            ],
            [
                1967,
                2009
            ],
            [
                2012,
                2026
            ],
            [
                2027,
                2033
            ],
            [
                2034,
                2037
            ],
            [
                2042,
                2045
            ],
            [
                2045,
                2047
            ],
            [
                2047,
                2062
            ],
            [
                2063,
                2084
            ],
            [
                2085,
                2088
            ],
            [
                2093,
                2095
            ],
            [
                2095,
                2161
            ],
            [
                2163,
                2226
            ],
            [
                2226,
                2259
            ],
            [
                2259,
                2338
            ],
            [
                2338,
                2404
            ],
            [
                2404,
                2406
            ],
            [
                2406,
                2420
            ],
            [
                2420,
                2500
            ],
            [
                2501,
                2509
            ],
            [
                2510,
                2596
            ],
            [
                2597,
                2627
            ],
            [
                2627,
                2629
            ],
            [
                2629,
                2646
            ],
            [
                2646,
                2677
            ],
            [
                2678,
                2707
            ],
            [
                2708,
                2718
            ],
            [
                2718,
                2755
            ],
            [
                2756,
                2874
            ],
            [
                2874,
                3017
            ],
            [
                3026,
                3041
            ],
            [
                3041,
                3130
            ],
            [
                3130,
                3180
            ],
            [
                3180,
                3182
            ],
            [
                3191,
                3227
            ],
            [
                3228,
                3336
            ],
            [
                3337,
                3368
            ],
            [
                3369,
                3371
            ],
            [
                3372,
                3381
            ],
            [
                3381,
                3383
            ],
            [
                3383,
                3431
            ],
            [
                3432,
                3478
            ],
            [
                3480,
                3531
            ],
            [
                3532,
                3544
            ],
            [
                3545,
                3624
            ],
            [
                3627,
                3654
            ],
            [
                3655,
                3670
            ],
            [
                3682,
                3696
            ],
            [
                3696,
                3698
            ],
            [
                3698,
                3718
            ],
            [
                3719,
                3739
            ],
            [
                3740,
                3770
            ],
            [
                3770,
                3773
            ],
            [
                3774,
                3778
            ],
            [
                3779,
                3785
            ],
            [
                3786,
                3796
            ],
            [
                3798,
                3817
            ],
            [
                3823,
                3844
            ],
            [
                3845,
                3852
            ],
            [
                3853,
                3900
            ],
            [
                3901,
                3935
            ],
            [
                3935,
                3989
            ],
            [
                3989,
                4028
            ],
            [
                4033,
                4038
            ],
            [
                4038,
                4039
            ],
            [
                4040,
                4082
            ],
            [
                4082,
                4101
            ],
            [
                4102,
                4166
            ],
            [
                4166,
                4168
            ],
            [
                4168,
                4212
            ],
            [
                4212,
                4249
            ],
            [
                4249,
                4273
            ],
            [
                4273,
                4319
            ],
            [
                4319,
                4342
            ],
            [
                4342,
                4380
            ],
            [
                4380,
                4411
            ],
            [
                4411,
                4470
            ],
            [
                4470,
                4471
            ],
            [
                4472,
                4473
            ],
            [
                4473,
                4486
            ],
            [
                4489,
                4536
            ],
            [
                4541,
                4557
            ],
            [
                4560,
                4577
            ],
            [
                4578,
                4605
            ],
            [
                4605,
                4607
            ],
            [
                4607,
                4679
            ],
            [
                4680,
                4689
            ],
            [
                4690,
                4701
            ],
            [
                4705,
                4707
            ],
            [
                4707,
                4822
            ],
            [
                4823,
                4835
            ],
            [
                4839,
                4911
            ],
            [
                4912,
                4947
            ],
            [
                4955,
                4970
            ],
            [
                4973,
                4989
            ],
            [
                4989,
                5076
            ],
            [
                5083,
                5172
            ],
            [
                5172,
                5210
            ],
            [
                5210,
                5212
            ],
            [
                5212,
                5220
            ],
            [
                5225,
                5231
            ],
            [
                5232,
                5316
            ],
            [
                5316,
                5330
            ],
            [
                5331,
                5370
            ],
            [
                5370,
                5372
            ],
            [
                5372,
                5456
            ],
            [
                5456,
                5481
            ],
            [
                5482,
                5522
            ],
            [
                5523,
                5582
            ],
            [
                5582,
                5673
            ],
            [
                5673,
                5722
            ],
            [
                5723,
                5752
            ],
            [
                5753,
                5763
            ],
            [
                5767,
                5768
            ],
            [
                5769,
                5793
            ],
            [
                5800,
                5847
            ],
            [
                5855,
                5859
            ],
            [
                5860,
                5862
            ],
            [
                5882,
                5898
            ],
            [
                5899,
                5904
            ],
            [
                5905,
                5908
            ],
            [
                5909,
                5988
            ],
            [
                5988,
                6020
            ],
            [
                6020,
                6091
            ],
            [
                6091,
                6093
            ],
            [
                6093,
                6138
            ],
            [
                6138,
                6143
            ],
            [
                6144,
                6178
            ],
            [
                6179,
                6181
            ],
            [
                6182,
                6248
            ],
            [
                6248,
                6249
            ],
            [
                6250,
                6260
            ],
            [
                6264,
                6267
            ],
            [
                6273,
                6306
            ],
            [
                6307,
                6341
            ],
            [
                6341,
                6391
            ],
            [
                6391,
                6395
            ],
            [
                6396,
                6500
            ],
            [
                6500,
                6556
            ],
            [
                6557,
                6586
            ],
            [
                6586,
                6605
            ],
            [
                6611,
                6648
            ],
            [
                6649,
                6652
            ],
            [
                6653,
                6667
            ],
            [
                6667,
                6669
            ],
            [
                6669,
                6790
            ],
            [
                6790,
                6792
            ],
            [
                6792,
                6842
            ],
            [
                6843,
                6851
            ],
            [
                6852,
                6865
            ],
            [
                6884,
                6923
            ],
            [
                6923,
                6924
            ],
            [
                6930,
                6969
            ],
            [
                6970,
                7011
            ],
            [
                7011,
                7048
            ],
            [
                7049,
                7075
            ],
            [
                7075,
                7078
            ],
            [
                7079,
                7082
            ],
            [
                7083,
                7197
            ],
            [
                7197,
                7254
            ],
            [
                7257,
                7283
            ],
            [
                7283,
                7310
            ],
            [
                7315,
                7318
            ],
            [
                7319,
                7344
            ],
            [
                7344,
                7360
            ],
            [
                7361,
                7370
            ],
            [
                7380,
                7396
            ],
            [
                7397,
                7444
            ],
            [
                7445,
                7462
            ],
            [
                7469,
                7506
            ],
            [
                7509,
                7517
            ],
            [
                7517,
                7522
            ],
            [
                7532,
                7548
            ],
            [
                7549,
                7572
            ],
            [
                7577,
                7582
            ],
            [
                7582,
                7584
            ],
            [
                7584,
                7620
            ],
            [
                7621,
                7728
            ],
            [
                7729,
                7736
            ],
            [
                7746,
                7756
            ],
            [
                7756,
                7764
            ],
            [
                7771,
                7777
            ],
            [
                7778,
                7787
            ],
            [
                7788,
                7791
            ],
            [
                7808,
                7824
            ],
            [
                7825,
                7881
            ],
            [
                7881,
                7887
            ],
            [
                7892,
                7899
            ],
            [
                7900,
                7942
            ],
            [
                7943,
                8097
            ],
            [
                8097,
                8123
            ],
            [
                8130,
                8165
            ],
            [
                8166,
                8184
            ],
            [
                8190,
                8198
            ],
            [
                8198,
                8202
            ],
            [
                8202,
                8206
            ],
            [
                8218,
                8222
            ],
            [
                8223,
                8249
            ],
            [
                8250,
                8262
            ],
            [
                8263,
                8266
            ],
            [
                8267,
                8275
            ],
            [
                8276,
                8292
            ],
            [
                8292,
                8294
            ],
            [
                8294,
                8368
            ],
            [
                8376,
                8394
            ],
            [
                8394,
                8395
            ],
            [
                8405,
                8422
            ],
            [
                8423,
                8431
            ],
            [
                8432,
                8456
            ],
            [
                8456,
                8469
            ],
            [
                8470,
                8487
            ],
            [
                8488,
                8523
            ],
            [
                8524,
                8530
            ],
            [
                8531,
                8542
            ],
            [
                8543,
                8560
            ],
            [
                8561,
                8605
            ],
            [
                8605,
                8625
            ],
            [
                8625,
                8633
            ],
            [
                8634,
                8657
            ],
            [
                8659,
                8671
            ],
            [
                8672,
                8688
            ],
            [
                8688,
                8697
            ],
            [
                8698,
                8750
            ],
            [
                8750,
                8752
            ],
            [
                8752,
                8755
            ],
            [
                8756,
                8783
            ],
            [
                8784,
                8797
            ],
            [
                8798,
                8804
            ],
            [
                8804,
                8919
            ],
            [
                8920,
                8955
            ],
            [
                8956,
                8990
            ],
            [
                9002,
                9013
            ],
            [
                9013,
                9035
            ],
            [
                9036,
                9061
            ],
            [
                9061,
                9063
            ],
            [
                9063,
                9069
            ],
            [
                9070,
                9110
            ],
            [
                9111,
                9137
            ],
            [
                9138,
                9161
            ],
            [
                9164,
                9196
            ],
            [
                9196,
                9198
            ],
            [
                9198,
                9263
            ],
            [
                9263,
                9265
            ],
            [
                9265,
                9295
            ],
            [
                9296,
                9342
            ],
            [
                9346,
                9351
            ],
            [
                9351,
                9353
            ],
            [
                9353,
                9468
            ],
            [
                9468,
                9486
            ],
            [
                9486,
                9543
            ],
            [
                9543,
                9574
            ],
            [
                9574,
                9576
            ],
            [
                9576,
                9617
            ],
            [
                9627,
                9631
            ],
            [
                9632,
                9635
            ],
            [
                9655,
                9659
            ],
            [
                9672,
                9675
            ],
            [
                9689,
                9696
            ],
            [
                9696,
                9698
            ],
            [
                9698,
                9701
            ],
            [
                9702,
                9710
            ],
            [
                9711,
                9756
            ],
            [
                9757,
                9769
            ],
            [
                9781,
                9820
            ],
            [
                9820,
                9837
            ],
            [
                9837,
                9862
            ],
            [
                9863,
                9881
            ],
            [
                9882,
                9917
            ],
            [
                9917,
                9986
            ],
            [
                9987,
                9990
            ],
            [
                9991,
                10023
            ],
            [
                10024,
                10026
            ],
            [
                10027,
                10035
            ],
            [
                10035,
                10037
            ],
            [
                10051,
                10070
            ],
            [
                10081,
                10095
            ],
            [
                10097,
                10106
            ],
            [
                10107,
                10113
            ],
            [
                10113,
                10220
            ],
            [
                10221,
                10228
            ],
            [
                10229,
                10240
            ],
            [
                10241,
                10250
            ],
            [
                10258,
                10295
            ],
            [
                10296,
                10307
            ],
            [
                10307,
                10308
            ],
            [
                10309,
                10347
            ],
            [
                10350,
                10371
            ],
            [
                10375,
                10387
            ],
            [
                10390,
                10397
            ],
            [
                10398,
                10410
            ],
            [
                10411,
                10420
            ],
            [
                10428,
                10439
            ],
            [
                10440,
                10464
            ],
            [
                10465,
                10470
            ],
            [
                10471,
                10484
            ],
            [
                10485,
                10498
            ],
            [
                10501,
                10537
            ],
            [
                10537,
                10547
            ],
            [
                10554,
                10575
            ],
            [
                10583,
                10585
            ],
            [
                10585,
                10588
            ],
            [
                10596,
                10609
            ],
            [
                10620,
                10625
            ],
            [
                10626,
                10638
            ],
            [
                10640,
                10657
            ],
            [
                10658,
                10695
            ],
            [
                10695,
                10725
            ],
            [
                10726,
                10745
            ],
            [
                10746,
                10809
            ],
            [
                10810,
                10851
            ],
            [
                10852,
                10882
            ],
            [
                10882,
                10883
            ],
            [
                10884,
                10929
            ],
            [
                10948,
                10963
            ],
            [
                10965,
                11000
            ],
            [
                11001,
                11017
            ],
            [
                11017,
                11077
            ],
            [
                11077,
                11087
            ],
            [
                11087,
                11138
            ],
            [
                11139,
                11158
            ],
            [
                11167,
                11215
            ],
            [
                11224,
                11255
            ],
            [
                11256,
                11266
            ],
            [
                11267,
                11321
            ],
            [
                11321,
                11323
            ],
            [
                11326,
                11391
            ],
            [
                11392,
                11416
            ],
            [
                11417,
                11424
            ],
            [
                11424,
                11560
            ],
            [
                11560,
                11622
            ],
            [
                11622,
                11624
            ],
            [
                11624,
                11700
            ],
            [
                11711,
                11760
            ],
            [
                11760,
                11793
            ],
            [
                11794,
                11809
            ],
            [
                11819,
                11830
            ],
            [
                11831,
                11909
            ],
            [
                11910,
                11927
            ],
            [
                11928,
                11948
            ],
            [
                11949,
                11969
            ],
            [
                11970,
                11986
            ],
            [
                11990,
                12054
            ],
            [
                12062,
                12065
            ],
            [
                12073,
                12075
            ],
            [
                12075,
                12078
            ],
            [
                12079,
                12108
            ],
            [
                12109,
                12112
            ],
            [
                12113,
                12123
            ],
            [
                12124,
                12131
            ],
            [
                12132,
                12149
            ],
            [
                12150,
                12173
            ],
            [
                12175,
                12196
            ],
            [
                12201,
                12204
            ],
            [
                12205,
                12208
            ],
            [
                12215,
                12251
            ],
            [
                12257,
                12263
            ],
            [
                12263,
                12273
            ],
            [
                12279,
                12298
            ],
            [
                12298,
                12377
            ],
            [
                12378,
                12406
            ],
            [
                12407,
                12416
            ],
            [
                12422,
                12429
            ],
            [
                12430,
                12436
            ],
            [
                12436,
                12459
            ],
            [
                12460,
                12471
            ],
            [
                12479,
                12523
            ],
            [
                12523,
                12584
            ],
            [
                12585,
                12601
            ],
            [
                12602,
                12631
            ],
            [
                12631,
                12636
            ],
            [
                12637,
                12670
            ],
            [
                12671,
                12687
            ],
            [
                12688,
                12691
            ],
            [
                12692,
                12695
            ],
            [
                12715,
                12719
            ],
            [
                12720,
                12744
            ],
            [
                12748,
                12802
            ],
            [
                12810,
                12812
            ],
            [
                12812,
                12840
            ],
            [
                12845,
                12853
            ],
            [
                12854,
                12898
            ],
            [
                12898,
                13037
            ],
            [
                13045,
                13085
            ],
            [
                13094,
                13123
            ],
            [
                13123,
                13238
            ],
            [
                13238,
                13239
            ],
            [
                13240,
                13261
            ],
            [
                13267,
                13276
            ],
            [
                13276,
                13277
            ],
            [
                13278,
                13279
            ],
            [
                13279,
                13339
            ],
            [
                13342,
                13378
            ],
            [
                13383,
                13396
            ],
            [
                13397,
                13444
            ],
            [
                13452,
                13461
            ],
            [
                13461,
                13463
            ],
            [
                13463,
                13501
            ],
            [
                13506,
                13568
            ],
            [
                13568,
                13743
            ],
            [
                13744,
                13768
            ],
            [
                13768,
                13776
            ],
            [
                13780,
                13784
            ],
            [
                13785,
                13808
            ],
            [
                13813,
                13830
            ],
            [
                13830,
                13880
            ],
            [
                13880,
                13882
            ],
            [
                13889,
                13896
            ],
            [
                13897,
                13912
            ],
            [
                13913,
                13916
            ],
            [
                13925,
                13927
            ],
            [
                13936,
                13938
            ],
            [
                13938,
                14046
            ],
            [
                14047,
                14087
            ],
            [
                14087,
                14102
            ],
            [
                14105,
                14110
            ],
            [
                14122,
                14145
            ],
            [
                14145,
                14146
            ],
            [
                14147,
                14172
            ],
            [
                14172,
                14188
            ],
            [
                14193,
                14195
            ],
            [
                14195,
                14250
            ],
            [
                14250,
                14274
            ],
            [
                14281,
                14305
            ],
            [
                14307,
                14368
            ],
            [
                14368,
                14398
            ],
            [
                14398,
                14399
            ],
            [
                14400,
                14403
            ],
            [
                14404,
                14415
            ],
            [
                14416,
                14443
            ],
            [
                14443,
                14458
            ],
            [
                14469,
                14475
            ],
            [
                14475,
                14480
            ],
            [
                14487,
                14535
            ],
            [
                14535,
                14537
            ],
            [
                14544,
                14582
            ],
            [
                14590,
                14611
            ],
            [
                14612,
                14647
            ],
            [
                14647,
                14667
            ],
            [
                14667,
                14760
            ],
            [
                14761,
                14795
            ],
            [
                14795,
                14894
            ],
            [
                14895,
                14962
            ],
            [
                14962,
                14984
            ],
            [
                14988,
                14994
            ],
            [
                14994,
                15039
            ],
            [
                15039,
                15040
            ],
            [
                15041,
                15085
            ],
            [
                15085,
                15119
            ],
            [
                15119,
                15121
            ],
            [
                15121,
                15154
            ],
            [
                15155,
                15182
            ],
            [
                15182,
                15194
            ],
            [
                15203,
                15207
            ],
            [
                15208,
                15212
            ],
            [
                15219,
                15256
            ],
            [
                15257,
                15269
            ],
            [
                15270,
                15331
            ],
            [
                15331,
                15359
            ],
            [
                15359,
                15396
            ],
            [
                15397,
                15408
            ],
            [
                15408,
                15433
            ],
            [
                15434,
                15465
            ],
            [
                15465,
                15466
            ],
            [
                15467,
                15525
            ],
            [
                15528,
                15539
            ],
            [
                15544,
                15557
            ],
            [
                15558,
                15561
            ],
            [
                15569,
                15597
            ],
            [
                15605,
                15610
            ],
            [
                15610,
                15662
            ],
            [
                15663,
                15687
            ],
            [
                15687,
                15723
            ],
            [
                15736,
                15755
            ],
            [
                15757,
                15773
            ],
            [
                15774,
                15779
            ],
            [
                15787,
                15804
            ],
            [
                15805,
                15808
            ],
            [
                15816,
                15821
            ],
            [
                15822,
                15838
            ],
            [
                15838,
                15916
            ],
            [
                15916,
                15923
            ],
            [
                15928,
                15937
            ],
            [
                15937,
                15967
            ],
            [
                15967,
                15969
            ],
            [
                15969,
                16018
            ],
            [
                16019,
                16025
            ],
            [
                16025,
                16066
            ],
            [
                16066,
                16112
            ],
            [
                16120,
                16157
            ],
            [
                16166,
                16185
            ],
            [
                16185,
                16186
            ],
            [
                16187,
                16265
            ],
            [
                16274,
                16284
            ],
            [
                16294,
                16320
            ],
            [
                16321,
                16324
            ],
            [
                16325,
                16330
            ],
            [
                16330,
                16332
            ],
            [
                16332,
                16394
            ],
            [
                16395,
                16472
            ],
            [
                16473,
                16474
            ],
            [
                16475,
                16490
            ],
            [
                16490,
                16563
            ],
            [
                16563,
                16564
            ],
            [
                16565,
                16580
            ],
            [
                16581,
                16624
            ],
            [
                16625,
                16692
            ],
            [
                16699,
                16704
            ],
            [
                16704,
                16706
            ],
            [
                16716,
                16725
            ],
            [
                16726,
                16782
            ],
            [
                16782,
                16783
            ],
            [
                16784,
                16787
            ],
            [
                16788,
                16857
            ],
            [
                16857,
                16962
            ],
            [
                16969,
                16973
            ],
            [
                16974,
                16979
            ],
            [
                16979,
                16980
            ],
            [
                16981,
                16997
            ],
            [
                16998,
                17049
            ],
            [
                17049,
                17137
            ],
            [
                17139,
                17165
            ],
            [
                17165,
                17200
            ],
            [
                17200,
                17223
            ],
            [
                17223,
                17225
            ],
            [
                17225,
                17232
            ],
            [
                17235,
                17247
            ],
            [
                17248,
                17312
            ],
            [
                17315,
                17366
            ],
            [
                17369,
                17392
            ],
            [
                17392,
                17430
            ],
            [
                17433,
                17490
            ],
            [
                17490,
                17508
            ],
            [
                17508,
                17511
            ],
            [
                17512,
                17520
            ],
            [
                17521,
                17526
            ],
            [
                17526,
                17527
            ],
            [
                17539,
                17570
            ],
            [
                17570,
                17612
            ],
            [
                17612,
                17613
            ],
            [
                17614,
                17617
            ],
            [
                17618,
                17671
            ],
            [
                17671,
                17672
            ],
            [
                17673,
                17709
            ],
            [
                17710,
                17715
            ],
            [
                17718,
                17754
            ]
        ],
        "row_chars": [
            [
                0,
                81
            ],
            [
                81,
                101
            ],
            [
                101,
                129
            ],
            [
                129,
                162
            ],
            [
                162,
                220
            ],
            [
                220,
                259
            ],
            [
                259,
                403
            ],
            [
                403,
                520
            ],
            [
                520,
                610
            ],
            [
                610,
                685
            ],
            [
                685,
                846
            ],
            [
                846,
                1050
            ],
            [
                1050,
                1050
            ],
            [
                1050,
                1050
            ],
            [
                1050,
                1142
            ],
            [
                1142,
                1228
            ],
            [
                1228,
                1417
            ],
            [
                1417,
                1468
            ],
            [
                1468,
                1543
            ],
            [
                1543,
                1677
            ],
            [
                1677,
                1677
            ],
            [
                1677,
                1726
            ],
            [
                1726,
                1783
            ],
            [
                1783,
                1783
            ],
            [
                1783,
                1848
            ],
            [
                1848,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1893
            ],
            [
                1893,
                1967
            ],
            [
                1967,
                2047
            ],
            [
                2047,
                2095
            ],
            [
                2095,
                2226
            ],
            [
                2226,
                2259
            ],
            [
                2259,
                2338
            ],
            [
                2338,
                2406
            ],
            [
                2406,
                2629
            ],
            [
                2629,
                2708
            ],
            [
                2708,
                2708
            ],
            [
                2708,
                2708
            ],
            [
                2708,
                2708
            ],
            [
                2708,
                2874
            ],
            [
                2874,
                3180
            ],
            [
                3180,
                3383
            ],
            [
                3383,
                3698
            ],
            [
                3698,
                3770
            ],
            [
                3770,
                3935
            ],
            [
                3935,
                3989
            ],
            [
                3989,
                4082
            ],
            [
                4082,
                4102
            ],
            [
                4102,
                4102
            ],
            [
                4102,
                4168
            ],
            [
                4168,
                4212
            ],
            [
                4212,
                4273
            ],
            [
                4273,
                4319
            ],
            [
                4319,
                4411
            ],
            [
                4411,
                4560
            ],
            [
                4560,
                4607
            ],
            [
                4607,
                4707
            ],
            [
                4707,
                4973
            ],
            [
                4973,
                4973
            ],
            [
                4973,
                4973
            ],
            [
                4973,
                4989
            ],
            [
                4989,
                5077
            ],
            [
                5077,
                5077
            ],
            [
                5077,
                5172
            ],
            [
                5172,
                5212
            ],
            [
                5212,
                5316
            ],
            [
                5316,
                5372
            ],
            [
                5372,
                5456
            ],
            [
                5456,
                5582
            ],
            [
                5582,
                5673
            ],
            [
                5673,
                5673
            ],
            [
                5673,
                5769
            ],
            [
                5769,
                5988
            ],
            [
                5988,
                6093
            ],
            [
                6093,
                6341
            ],
            [
                6341,
                6391
            ],
            [
                6391,
                6500
            ],
            [
                6500,
                6586
            ],
            [
                6586,
                6669
            ],
            [
                6669,
                6669
            ],
            [
                6669,
                6792
            ],
            [
                6792,
                6925
            ],
            [
                6925,
                6925
            ],
            [
                6925,
                6925
            ],
            [
                6925,
                6925
            ],
            [
                6925,
                6925
            ],
            [
                6925,
                6925
            ],
            [
                6925,
                7011
            ],
            [
                7011,
                7075
            ],
            [
                7075,
                7197
            ],
            [
                7197,
                7344
            ],
            [
                7344,
                7507
            ],
            [
                7507,
                7507
            ],
            [
                7507,
                7584
            ],
            [
                7584,
                7756
            ],
            [
                7756,
                7881
            ],
            [
                7881,
                8097
            ],
            [
                8097,
                8097
            ],
            [
                8097,
                8097
            ],
            [
                8097,
                8198
            ],
            [
                8198,
                8202
            ],
            [
                8202,
                8294
            ],
            [
                8294,
                8456
            ],
            [
                8456,
                8605
            ],
            [
                8605,
                8625
            ],
            [
                8625,
                8688
            ],
            [
                8688,
                8752
            ],
            [
                8752,
                8752
            ],
            [
                8752,
                8956
            ],
            [
                8956,
                9013
            ],
            [
                9013,
                9063
            ],
            [
                9063,
                9164
            ],
            [
                9164,
                9164
            ],
            [
                9164,
                9198
            ],
            [
                9198,
                9265
            ],
            [
                9265,
                9353
            ],
            [
                9353,
                9353
            ],
            [
                9353,
                9353
            ],
            [
                9353,
                9468
            ],
            [
                9468,
                9486
            ],
            [
                9486,
                9543
            ],
            [
                9543,
                9576
            ],
            [
                9576,
                9698
            ],
            [
                9698,
                9917
            ],
            [
                9917,
                10037
            ],
            [
                10037,
                10113
            ],
            [
                10113,
                10113
            ],
            [
                10113,
                10309
            ],
            [
                10309,
                10537
            ],
            [
                10537,
                10585
            ],
            [
                10585,
                10695
            ],
            [
                10695,
                10884
            ],
            [
                10884,
                10884
            ],
            [
                10884,
                11017
            ],
            [
                11017,
                11077
            ],
            [
                11077,
                11087
            ],
            [
                11087,
                11139
            ],
            [
                11139,
                11323
            ],
            [
                11323,
                11560
            ],
            [
                11560,
                11624
            ],
            [
                11624,
                11794
            ],
            [
                11794,
                12075
            ],
            [
                12075,
                12298
            ],
            [
                12298,
                12523
            ],
            [
                12523,
                12812
            ],
            [
                12812,
                12898
            ],
            [
                12898,
                13123
            ],
            [
                13123,
                13240
            ],
            [
                13240,
                13463
            ],
            [
                13463,
                13568
            ],
            [
                13568,
                13744
            ],
            [
                13744,
                13882
            ],
            [
                13882,
                13938
            ],
            [
                13938,
                14087
            ],
            [
                14087,
                14172
            ],
            [
                14172,
                14195
            ],
            [
                14195,
                14250
            ],
            [
                14250,
                14443
            ],
            [
                14443,
                14443
            ],
            [
                14443,
                14537
            ],
            [
                14537,
                14667
            ],
            [
                14667,
                14795
            ],
            [
                14795,
                14962
            ],
            [
                14962,
                15041
            ],
            [
                15041,
                15041
            ],
            [
                15041,
                15085
            ],
            [
                15085,
                15121
            ],
            [
                15121,
                15182
            ],
            [
                15182,
                15331
            ],
            [
                15331,
                15359
            ],
            [
                15359,
                15408
            ],
            [
                15408,
                15610
            ],
            [
                15610,
                15687
            ],
            [
                15687,
                15838
            ],
            [
                15838,
                15916
            ],
            [
                15916,
                15969
            ],
            [
                15969,
                16066
            ],
            [
                16066,
                16187
            ],
            [
                16187,
                16332
            ],
            [
                16332,
                16565
            ],
            [
                16565,
                16565
            ],
            [
                16565,
                16706
            ],
            [
                16706,
                16857
            ],
            [
                16857,
                17049
            ],
            [
                17049,
                17165
            ],
            [
                17165,
                17200
            ],
            [
                17200,
                17225
            ],
            [
                17225,
                17490
            ],
            [
                17490,
                17508
            ],
            [
                17508,
                17570
            ],
            [
                17570,
                17754
            ]
        ]
    }
}