{
    "original": {
        "text": "Our duty now takes us back for a brief space to some old Hampshire acquaintances of ours, whose hopes respecting the disposal of their rich kinswoman's property were so woefully disappointed. After counting upon thirty thousand pounds from his sister, it was a heavy blow to Bute Crawley to receive but five; out of which sum, when he had paid his own debts and those of Jim, his son at college, a very small fragment remained to portion off his four plain daughters. Mrs. Bute never knew, or at least never acknowledged, how far her own tyrannous behaviour had tended to ruin her husband. All that woman could do, she vowed and protested she had done. Was it her fault if she did not possess those sycophantic arts which her hypocritical nephew, Pitt Crawley, practised? She wished him all the happiness which he merited out of his ill-gotten gains. \"At least the money will remain in the family,\" she said charitably. \"Pitt will never spend it, my dear, that is quite certain; for a greater miser does not exist in England, and he is as odious, though in a different way, as his spendthrift brother, the abandoned Rawdon.\"\nSo Mrs. Bute, after the first shock of rage and disappointment, began to accommodate herself as best she could to her altered fortunes and to save and retrench with all her might. She instructed her daughters how to bear poverty cheerfully, and invented a thousand notable methods to conceal or evade it. She took them about to balls and public places in the neighbourhood, with praiseworthy energy; nay, she entertained her friends in a hospitable comfortable manner at the Rectory, and much more frequently than before dear Miss Crawley's legacy had fallen in. From her outward bearing nobody would have supposed that the family had been disappointed in their expectations, or have guessed from her frequent appearance in public how she pinched and starved at home. Her girls had more milliners' furniture than they had ever enjoyed before. They appeared perseveringly at the Winchester and Southampton assemblies; they penetrated to Cowes for the race-balls and regatta-gaieties there; and their carriage, with the horses taken from the plough, was at work perpetually, until it began almost to be believed that the four sisters had had fortunes left them by their aunt, whose name the family never mentioned in public but with the most tender gratitude and regard. I know no sort of lying which is more frequent in Vanity Fair than this, and it may be remarked how people who practise it take credit to themselves for their hypocrisy, and fancy that they are exceedingly virtuous and praiseworthy, because they are able to deceive the world with regard to the extent of their means.\nMrs. Bute certainly thought herself one of the most virtuous women in England, and the sight of her happy family was an edifying one to strangers. They were so cheerful, so loving, so well-educated, so simple! Martha painted flowers exquisitely and furnished half the charity bazaars in the county. Emma was a regular County Bulbul, and her verses in the Hampshire Telegraph were the glory of its Poet's Corner. Fanny and Matilda sang duets together, Mamma playing the piano, and the other two sisters sitting with their arms round each other's waists and listening affectionately. Nobody saw the poor girls drumming at the duets in private. No one saw Mamma drilling them rigidly hour after hour. In a word, Mrs. Bute put a good face against fortune and kept up appearances in the most virtuous manner.\nEverything that a good and respectable mother could do Mrs. Bute did. She got over yachting men from Southampton, parsons from the Cathedral Close at Winchester, and officers from the barracks there. She tried to inveigle the young barristers at assizes and encouraged Jim to bring home friends with whom he went out hunting with the H. H. What will not a mother do for the benefit of her beloved ones?\nBetween such a woman and her brother-in-law, the odious Baronet at the Hall, it is manifest that there could be very little in common. The rupture between Bute and his brother Sir Pitt was complete; indeed, between Sir Pitt and the whole county, to which the old man was a scandal. His dislike for respectable society increased with age, and the lodge-gates had not opened to a gentleman's carriage-wheels since Pitt and Lady Jane came to pay their visit of duty after their marriage.\nThat was an awful and unfortunate visit, never to be thought of by the family without horror. Pitt begged his wife, with a ghastly countenance, never to speak of it, and it was only through Mrs. Bute herself, who still knew everything which took place at the Hall, that the circumstances of Sir Pitt's reception of his son and daughter-in-law were ever known at all.\nAs they drove up the avenue of the park in their neat and well-appointed carriage, Pitt remarked with dismay and wrath great gaps among the trees--his trees--which the old Baronet was felling entirely without license. The park wore an aspect of utter dreariness and ruin. The drives were ill kept, and the neat carriage splashed and floundered in muddy pools along the road. The great sweep in front of the terrace and entrance stair was black and covered with mosses; the once trim flower-beds rank and weedy. Shutters were up along almost the whole line of the house; the great hall-door was unbarred after much ringing of the bell; an individual in ribbons was seen flitting up the black oak stair, as Horrocks at length admitted the heir of Queen's Crawley and his bride into the halls of their fathers. He led the way into Sir Pitt's \"Library,\" as it was called, the fumes of tobacco growing stronger as Pitt and Lady Jane approached that apartment, \"Sir Pitt ain't very well,\" Horrocks remarked apologetically and hinted that his master was afflicted with lumbago.\nThe library looked out on the front walk and park. Sir Pitt had opened one of the windows, and was bawling out thence to the postilion and Pitt's servant, who seemed to be about to take the baggage down.\n\"Don't move none of them trunks,\" he cried, pointing with a pipe which he held in his hand. \"It's only a morning visit, Tucker, you fool. Lor, what cracks that off hoss has in his heels! Ain't there no one at the King's Head to rub 'em a little? How do, Pitt? How do, my dear? Come to see the old man, hay? 'Gad--you've a pretty face, too. You ain't like that old horse-godmother, your mother. Come and give old Pitt a kiss, like a good little gal.\"\nThe embrace disconcerted the daughter-in-law somewhat, as the caresses of the old gentleman, unshorn and perfumed with tobacco, might well do. But she remembered that her brother Southdown had mustachios, and smoked cigars, and submitted to the Baronet with a tolerable grace.\n\"Pitt has got vat,\" said the Baronet, after this mark of affection. \"Does he read ee very long zermons, my dear? Hundredth Psalm, Evening Hymn, hay Pitt? Go and get a glass of Malmsey and a cake for my Lady Jane, Horrocks, you great big booby, and don't stand stearing there like a fat pig. I won't ask you to stop, my dear; you'll find it too stoopid, and so should I too along a Pitt. I'm an old man now, and like my own ways, and my pipe and backgammon of a night.\"\n\"I can play at backgammon, sir,\" said Lady Jane, laughing. \"I used to play with Papa and Miss Crawley, didn't I, Mr. Crawley?\"\n\"Lady Jane can play, sir, at the game to which you state that you are so partial,\" Pitt said haughtily.\n\"But she wawn't stop for all that. Naw, naw, goo back to Mudbury and give Mrs. Rincer a benefit; or drive down to the Rectory and ask Buty for a dinner. He'll be charmed to see you, you know; he's so much obliged to you for gettin' the old woman's money. Ha, ha! Some of it will do to patch up the Hall when I'm gone.\"\n\"I perceive, sir,\" said Pitt with a heightened voice, \"that your people will cut down the timber.\"\n\"Yees, yees, very fine weather, and seasonable for the time of year,\" Sir Pitt answered, who had suddenly grown deaf. \"But I'm gittin' old, Pitt, now. Law bless you, you ain't far from fifty yourself. But he wears well, my pretty Lady Jane, don't he? It's all godliness, sobriety, and a moral life. Look at me, I'm not very fur from fowr-score--he, he\"; and he laughed, and took snuff, and leered at her and pinched her hand.\nPitt once more brought the conversation back to the timber, but the Baronet was deaf again in an instant.\n\"I'm gittin' very old, and have been cruel bad this year with the lumbago. I shan't be here now for long; but I'm glad ee've come, daughter-in-law. I like your face, Lady Jane: it's got none of the damned high-boned Binkie look in it; and I'll give ee something pretty, my dear, to go to Court in.\" And he shuffled across the room to a cupboard, from which he took a little old case containing jewels of some value. \"Take that,\" said he, \"my dear; it belonged to my mother, and afterwards to the first Lady Binkie. Pretty pearls--never gave 'em the ironmonger's daughter. No, no. Take 'em and put 'em up quick,\" said he, thrusting the case into his daughter's hand, and clapping the door of the cabinet to, as Horrocks entered with a salver and refreshments.\n\"What have you a been and given Pitt's wife?\" said the individual in ribbons, when Pitt and Lady Jane had taken leave of the old gentleman. It was Miss Horrocks, the butler's daughter--the cause of the scandal throughout the county--the lady who reigned now almost supreme at Queen's Crawley.\nThe rise and progress of those Ribbons had been marked with dismay by the county and family. The Ribbons opened an account at the Mudbury Branch Savings Bank; the Ribbons drove to church, monopolising the pony-chaise, which was for the use of the servants at the Hall. The domestics were dismissed at her pleasure. The Scotch gardener, who still lingered on the premises, taking a pride in his walls and hot-houses, and indeed making a pretty good livelihood by the garden, which he farmed, and of which he sold the produce at Southampton, found the Ribbons eating peaches on a sunshiny morning at the south-wall, and had his ears boxed when he remonstrated about this attack on his property. He and his Scotch wife and his Scotch children, the only respectable inhabitants of Queen's Crawley, were forced to migrate, with their goods and their chattels, and left the stately comfortable gardens to go to waste, and the flower-beds to run to seed. Poor Lady Crawley's rose-garden became the dreariest wilderness. Only two or three domestics shuddered in the bleak old servants' hall. The stables and offices were vacant, and shut up, and half ruined. Sir Pitt lived in private, and boozed nightly with Horrocks, his butler or house-steward (as he now began to be called), and the abandoned Ribbons. The times were very much changed since the period when she drove to Mudbury in the spring-cart and called the small tradesmen \"Sir.\" It may have been shame, or it may have been dislike of his neighbours, but the old Cynic of Queen's Crawley hardly issued from his park-gates at all now. He quarrelled with his agents and screwed his tenants by letter. His days were passed in conducting his own correspondence; the lawyers and farm-bailiffs who had to do business with him could not reach him but through the Ribbons, who received them at the door of the housekeeper's room, which commanded the back entrance by which they were admitted; and so the Baronet's daily perplexities increased, and his embarrassments multiplied round him.\nThe horror of Pitt Crawley may be imagined, as these reports of his father's dotage reached the most exemplary and correct of gentlemen. He trembled daily lest he should hear that the Ribbons was proclaimed his second legal mother-in-law. After that first and last visit, his father's name was never mentioned in Pitt's polite and genteel establishment. It was the skeleton in his house, and all the family walked by it in terror and silence. The Countess Southdown kept on dropping per coach at the lodge-gate the most exciting tracts, tracts which ought to frighten the hair off your head. Mrs. Bute at the parsonage nightly looked out to see if the sky was red over the elms behind which the Hall stood, and the mansion was on fire. Sir G. Wapshot and Sir H. Fuddlestone, old friends of the house, wouldn't sit on the bench with Sir Pitt at Quarter Sessions, and cut him dead in the High Street of Southampton, where the reprobate stood offering his dirty old hands to them. Nothing had any effect upon him; he put his hands into his pockets, and burst out laughing, as he scrambled into his carriage and four; he used to burst out laughing at Lady Southdown's tracts; and he laughed at his sons, and at the world, and at the Ribbons when she was angry, which was not seldom.\nMiss Horrocks was installed as housekeeper at Queen's Crawley, and ruled all the domestics there with great majesty and rigour. All the servants were instructed to address her as \"Mum,\" or \"Madam\"--and there was one little maid, on her promotion, who persisted in calling her \"My Lady,\" without any rebuke on the part of the housekeeper. \"There has been better ladies, and there has been worser, Hester,\" was Miss Horrocks' reply to this compliment of her inferior; so she ruled, having supreme power over all except her father, whom, however, she treated with considerable haughtiness, warning him not to be too familiar in his behaviour to one \"as was to be a Baronet's lady.\" Indeed, she rehearsed that exalted part in life with great satisfaction to herself, and to the amusement of old Sir Pitt, who chuckled at her airs and graces, and would laugh by the hour together at her assumptions of dignity and imitations of genteel life. He swore it was as good as a play to see her in the character of a fine dame, and he made her put on one of the first Lady Crawley's court-dresses, swearing (entirely to Miss Horrocks' own concurrence) that the dress became her prodigiously, and threatening to drive her off that very instant to Court in a coach-and-four. She had the ransacking of the wardrobes of the two defunct ladies, and cut and hacked their posthumous finery so as to suit her own tastes and figure. And she would have liked to take possession of their jewels and trinkets too; but the old Baronet had locked them away in his private cabinet; nor could she coax or wheedle him out of the keys. And it is a fact, that some time after she left Queen's Crawley a copy-book belonging to this lady was discovered, which showed that she had taken great pains in private to learn the art of writing in general, and especially of writing her own name as Lady Crawley, Lady Betsy Horrocks, Lady Elizabeth Crawley, &c.\nThough the good people of the Parsonage never went to the Hall and shunned the horrid old dotard its owner, yet they kept a strict knowledge of all that happened there, and were looking out every day for the catastrophe for which Miss Horrocks was also eager. But Fate intervened enviously and prevented her from receiving the reward due to such immaculate love and virtue.\nOne day the Baronet surprised \"her ladyship,\" as he jocularly called her, seated at that old and tuneless piano in the drawing-room, which had scarcely been touched since Becky Sharp played quadrilles upon it--seated at the piano with the utmost gravity and squalling to the best of her power in imitation of the music which she had sometimes heard. The little kitchen-maid on her promotion was standing at her mistress's side, quite delighted during the operation, and wagging her head up and down and crying, \"Lor, Mum, 'tis bittiful\"--just like a genteel sycophant in a real drawing-room.\nThis incident made the old Baronet roar with laughter, as usual. He narrated the circumstance a dozen times to Horrocks in the course of the evening, and greatly to the discomfiture of Miss Horrocks. He thrummed on the table as if it had been a musical instrument, and squalled in imitation of her manner of singing. He vowed that such a beautiful voice ought to be cultivated and declared she ought to have singing-masters, in which proposals she saw nothing ridiculous. He was in great spirits that night, and drank with his friend and butler an extraordinary quantity of rum-and-water--at a very late hour the faithful friend and domestic conducted his master to his bedroom.\nHalf an hour afterwards there was a great hurry and bustle in the house. Lights went about from window to window in the lonely desolate old Hall, whereof but two or three rooms were ordinarily occupied by its owner. Presently, a boy on a pony went galloping off to Mudbury, to the Doctor's house there. And in another hour (by which fact we ascertain how carefully the excellent Mrs. Bute Crawley had always kept up an understanding with the great house), that lady in her clogs and calash, the Reverend Bute Crawley, and James Crawley, her son, had walked over from the Rectory through the park, and had entered the mansion by the open hall-door.\nThey passed through the hall and the small oak parlour, on the table of which stood the three tumblers and the empty rum-bottle which had served for Sir Pitt's carouse, and through that apartment into Sir Pitt's study, where they found Miss Horrocks, of the guilty ribbons, with a wild air, trying at the presses and escritoires with a bunch of keys. She dropped them with a scream of terror, as little Mrs. Bute's eyes flashed out at her from under her black calash.\n\"Look at that, James and Mr. Crawley,\" cried Mrs. Bute, pointing at the scared figure of the black-eyed, guilty wench.\n\"He gave 'em me; he gave 'em me!\" she cried.\n\"Gave them you, you abandoned creature!\" screamed Mrs. Bute. \"Bear witness, Mr. Crawley, we found this good-for-nothing woman in the act of stealing your brother's property; and she will be hanged, as I always said she would.\"\nBetsy Horrocks, quite daunted, flung herself down on her knees, bursting into tears. But those who know a really good woman are aware that she is not in a hurry to forgive, and that the humiliation of an enemy is a triumph to her soul.\n\"Ring the bell, James,\" Mrs. Bute said. \"Go on ringing it till the people come.\" The three or four domestics resident in the deserted old house came presently at that jangling and continued summons.\n\"Put that woman in the strong-room,\" she said. \"We caught her in the act of robbing Sir Pitt. Mr. Crawley, you'll make out her committal--and, Beddoes, you'll drive her over in the spring cart, in the morning, to Southampton Gaol.\"\n\"My dear,\" interposed the Magistrate and Rector--\"she's only--\"\n\"Are there no handcuffs?\" Mrs. Bute continued, stamping in her clogs. \"There used to be handcuffs. Where's the creature's abominable father?\"\n\"He DID give 'em me,\" still cried poor Betsy; \"didn't he, Hester? You saw Sir Pitt--you know you did--give 'em me, ever so long ago--the day after Mudbury fair: not that I want 'em. Take 'em if you think they ain't mine.\" And here the unhappy wretch pulled out from her pocket a large pair of paste shoe-buckles which had excited her admiration, and which she had just appropriated out of one of the bookcases in the study, where they had lain.\n\"Law, Betsy, how could you go for to tell such a wicked story!\" said Hester, the little kitchen-maid late on her promotion--\"and to Madame Crawley, so good and kind, and his Rev'rince (with a curtsey), and you may search all MY boxes, Mum, I'm sure, and here's my keys as I'm an honest girl, though of pore parents and workhouse bred--and if you find so much as a beggarly bit of lace or a silk stocking out of all the gownds as YOU'VE had the picking of, may I never go to church agin.\"\n\"Give up your keys, you hardened hussy,\" hissed out the virtuous little lady in the calash.\n\"And here's a candle, Mum, and if you please, Mum, I can show you her room, Mum, and the press in the housekeeper's room, Mum, where she keeps heaps and heaps of things, Mum,\" cried out the eager little Hester with a profusion of curtseys.\n\"Hold your tongue, if you please. I know the room which the creature occupies perfectly well. Mrs. Brown, have the goodness to come with me, and Beddoes don't you lose sight of that woman,\" said Mrs. Bute, seizing the candle. \"Mr. Crawley, you had better go upstairs and see that they are not murdering your unfortunate brother\"--and the calash, escorted by Mrs. Brown, walked away to the apartment which, as she said truly, she knew perfectly well.\nBute went upstairs and found the Doctor from Mudbury, with the frightened Horrocks over his master in a chair. They were trying to bleed Sir Pitt Crawley.\nWith the early morning an express was sent off to Mr. Pitt Crawley by the Rector's lady, who assumed the command of everything, and had watched the old Baronet through the night. He had been brought back to a sort of life; he could not speak, but seemed to recognize people. Mrs. Bute kept resolutely by his bedside. She never seemed to want to sleep, that little woman, and did not close her fiery black eyes once, though the Doctor snored in the arm-chair. Horrocks made some wild efforts to assert his authority and assist his master; but Mrs. Bute called him a tipsy old wretch and bade him never show his face again in that house, or he should be transported like his abominable daughter.\nTerrified by her manner, he slunk down to the oak parlour where Mr. James was, who, having tried the bottle standing there and found no liquor in it, ordered Mr. Horrocks to get another bottle of rum, which he fetched, with clean glasses, and to which the Rector and his son sat down, ordering Horrocks to put down the keys at that instant and never to show his face again.\nCowed by this behaviour, Horrocks gave up the keys, and he and his daughter slunk off silently through the night and gave up possession of the house of Queen's Crawley.",
        "paragraph_chars": [
            [
                0,
                1125
            ],
            [
                1125,
                2712
            ],
            [
                2712,
                3516
            ],
            [
                3516,
                3919
            ],
            [
                3919,
                4404
            ],
            [
                4404,
                4771
            ],
            [
                4771,
                5842
            ],
            [
                5842,
                6046
            ],
            [
                6046,
                6496
            ],
            [
                6496,
                6773
            ],
            [
                6773,
                7242
            ],
            [
                7242,
                7369
            ],
            [
                7369,
                7473
            ],
            [
                7473,
                7792
            ],
            [
                7792,
                7891
            ],
            [
                7891,
                8317
            ],
            [
                8317,
                8423
            ],
            [
                8423,
                9182
            ],
            [
                9182,
                9475
            ],
            [
                9475,
                11508
            ],
            [
                11508,
                12787
            ],
            [
                12787,
                14707
            ],
            [
                14707,
                15081
            ],
            [
                15081,
                15673
            ],
            [
                15673,
                16352
            ],
            [
                16352,
                17000
            ],
            [
                17000,
                17468
            ],
            [
                17468,
                17587
            ],
            [
                17587,
                17632
            ],
            [
                17632,
                17859
            ],
            [
                17859,
                18095
            ],
            [
                18095,
                18294
            ],
            [
                18294,
                18526
            ],
            [
                18526,
                18590
            ],
            [
                18590,
                18732
            ],
            [
                18732,
                19177
            ],
            [
                19177,
                19665
            ],
            [
                19665,
                19757
            ],
            [
                19757,
                19997
            ],
            [
                19997,
                20447
            ],
            [
                20447,
                20602
            ],
            [
                20602,
                21296
            ],
            [
                21296,
                21670
            ],
            [
                21670,
                21838
            ]
        ],
        "segment_chars": [
            [
                0,
                192
            ],
            [
                192,
                468
            ],
            [
                468,
                590
            ],
            [
                590,
                653
            ],
            [
                653,
                772
            ],
            [
                772,
                851
            ],
            [
                851,
                920
            ],
            [
                920,
                1125
            ],
            [
                1125,
                1305
            ],
            [
                1305,
                1430
            ],
            [
                1430,
                1688
            ],
            [
                1688,
                1893
            ],
            [
                1893,
                1968
            ],
            [
                1968,
                2394
            ],
            [
                2394,
                2712
            ],
            [
                2712,
                2859
            ],
            [
                2859,
                2922
            ],
            [
                2922,
                3011
            ],
            [
                3011,
                3124
            ],
            [
                3124,
                3294
            ],
            [
                3294,
                3354
            ],
            [
                3354,
                3410
            ],
            [
                3410,
                3516
            ],
            [
                3516,
                3586
            ],
            [
                3586,
                3716
            ],
            [
                3716,
                3919
            ],
            [
                3919,
                4054
            ],
            [
                4054,
                4201
            ],
            [
                4201,
                4404
            ],
            [
                4404,
                4498
            ],
            [
                4498,
                4771
            ],
            [
                4771,
                4989
            ],
            [
                4989,
                5043
            ],
            [
                5043,
                5146
            ],
            [
                5146,
                5282
            ],
            [
                5282,
                5579
            ],
            [
                5579,
                5842
            ],
            [
                5842,
                5893
            ],
            [
                5893,
                6046
            ],
            [
                6046,
                6138
            ],
            [
                6138,
                6184
            ],
            [
                6184,
                6233
            ],
            [
                6233,
                6292
            ],
            [
                6292,
                6306
            ],
            [
                6306,
                6323
            ],
            [
                6323,
                6353
            ],
            [
                6353,
                6386
            ],
            [
                6386,
                6440
            ],
            [
                6440,
                6496
            ],
            [
                6496,
                6639
            ],
            [
                6639,
                6773
            ],
            [
                6773,
                6841
            ],
            [
                6841,
                6886
            ],
            [
                6886,
                6927
            ],
            [
                6927,
                7064
            ],
            [
                7064,
                7160
            ],
            [
                7160,
                7242
            ],
            [
                7242,
                7301
            ],
            [
                7301,
                7369
            ],
            [
                7369,
                7473
            ],
            [
                7473,
                7508
            ],
            [
                7508,
                7626
            ],
            [
                7626,
                7728
            ],
            [
                7728,
                7736
            ],
            [
                7736,
                7792
            ],
            [
                7792,
                7891
            ],
            [
                7891,
                8009
            ],
            [
                8009,
                8042
            ],
            [
                8042,
                8092
            ],
            [
                8092,
                8142
            ],
            [
                8142,
                8190
            ],
            [
                8190,
                8317
            ],
            [
                8317,
                8423
            ],
            [
                8423,
                8498
            ],
            [
                8498,
                8571
            ],
            [
                8571,
                8722
            ],
            [
                8722,
                8839
            ],
            [
                8839,
                8938
            ],
            [
                8938,
                8995
            ],
            [
                8995,
                9003
            ],
            [
                9003,
                9182
            ],
            [
                9182,
                9228
            ],
            [
                9228,
                9322
            ],
            [
                9322,
                9475
            ],
            [
                9475,
                9568
            ],
            [
                9568,
                9744
            ],
            [
                9744,
                9790
            ],
            [
                9790,
                10168
            ],
            [
                10168,
                10423
            ],
            [
                10423,
                10488
            ],
            [
                10488,
                10559
            ],
            [
                10559,
                10626
            ],
            [
                10626,
                10774
            ],
            [
                10774,
                10907
            ],
            [
                10907,
                11061
            ],
            [
                11061,
                11126
            ],
            [
                11126,
                11508
            ],
            [
                11508,
                11645
            ],
            [
                11645,
                11747
            ],
            [
                11747,
                11862
            ],
            [
                11862,
                11951
            ],
            [
                11951,
                12100
            ],
            [
                12100,
                12244
            ],
            [
                12244,
                12486
            ],
            [
                12486,
                12787
            ],
            [
                12787,
                12915
            ],
            [
                12915,
                13125
            ],
            [
                13125,
                13466
            ],
            [
                13466,
                13724
            ],
            [
                13724,
                14047
            ],
            [
                14047,
                14198
            ],
            [
                14198,
                14392
            ],
            [
                14392,
                14707
            ],
            [
                14707,
                14967
            ],
            [
                14967,
                15081
            ],
            [
                15081,
                15431
            ],
            [
                15431,
                15673
            ],
            [
                15673,
                15738
            ],
            [
                15738,
                15873
            ],
            [
                15873,
                15990
            ],
            [
                15990,
                16145
            ],
            [
                16145,
                16352
            ],
            [
                16352,
                16425
            ],
            [
                16425,
                16568
            ],
            [
                16568,
                16655
            ],
            [
                16655,
                17000
            ],
            [
                17000,
                17351
            ],
            [
                17351,
                17468
            ],
            [
                17468,
                17587
            ],
            [
                17587,
                17621
            ],
            [
                17621,
                17632
            ],
            [
                17632,
                17673
            ],
            [
                17673,
                17693
            ],
            [
                17693,
                17859
            ],
            [
                17859,
                17944
            ],
            [
                17944,
                18095
            ],
            [
                18095,
                18135
            ],
            [
                18135,
                18176
            ],
            [
                18176,
                18294
            ],
            [
                18294,
                18341
            ],
            [
                18341,
                18388
            ],
            [
                18388,
                18526
            ],
            [
                18526,
                18590
            ],
            [
                18590,
                18616
            ],
            [
                18616,
                18660
            ],
            [
                18660,
                18689
            ],
            [
                18689,
                18732
            ],
            [
                18732,
                18798
            ],
            [
                18798,
                18914
            ],
            [
                18914,
                18954
            ],
            [
                18954,
                19177
            ],
            [
                19177,
                19241
            ],
            [
                19241,
                19665
            ],
            [
                19665,
                19757
            ],
            [
                19757,
                19997
            ],
            [
                19997,
                20031
            ],
            [
                20031,
                20091
            ],
            [
                20091,
                20223
            ],
            [
                20223,
                20447
            ],
            [
                20447,
                20558
            ],
            [
                20558,
                20602
            ],
            [
                20602,
                20781
            ],
            [
                20781,
                20877
            ],
            [
                20877,
                20919
            ],
            [
                20919,
                21061
            ],
            [
                21061,
                21296
            ],
            [
                21296,
                21670
            ],
            [
                21670,
                21838
            ]
        ],
        "overlap_chars": [
            [
                9,
                12
            ],
            [
                45,
                80
            ],
            [
                88,
                101
            ],
            [
                81,
                83
            ],
            [
                161,
                192
            ],
            [
                252,
                298
            ],
            [
                303,
                307
            ],
            [
                219,
                239
            ],
            [
                332,
                361
            ],
            [
                371,
                374
            ],
            [
                250,
                251
            ],
            [
                398,
                402
            ],
            [
                418,
                468
            ],
            [
                468,
                561
            ],
            [
                577,
                590
            ],
            [
                615,
                624
            ],
            [
                639,
                651
            ],
            [
                590,
                613
            ],
            [
                651,
                653
            ],
            [
                653,
                676
            ],
            [
                681,
                684
            ],
            [
                726,
                738
            ],
            [
                722,
                725
            ],
            [
                739,
                759
            ],
            [
                770,
                771
            ],
            [
                851,
                907
            ],
            [
                918,
                920
            ],
            [
                920,
                954
            ],
            [
                977,
                1013
            ],
            [
                1122,
                1125
            ],
            [
                1125,
                1160
            ],
            [
                1187,
                1197
            ],
            [
                1236,
                1271
            ],
            [
                1285,
                1305
            ],
            [
                1305,
                1308
            ],
            [
                1370,
                1389
            ],
            [
                1398,
                1416
            ],
            [
                1346,
                1353
            ],
            [
                1428,
                1430
            ],
            [
                1430,
                1438
            ],
            [
                1450,
                1452
            ],
            [
                1463,
                1476
            ],
            [
                1499,
                1524
            ],
            [
                1530,
                1557
            ],
            [
                1563,
                1567
            ],
            [
                1593,
                1607
            ],
            [
                1686,
                1688
            ],
            [
                1720,
                1816
            ],
            [
                1856,
                1893
            ],
            [
                1893,
                1902
            ],
            [
                1973,
                2013
            ],
            [
                2030,
                2046
            ],
            [
                2058,
                2074
            ],
            [
                2080,
                2093
            ],
            [
                2112,
                2298
            ],
            [
                2310,
                2320
            ],
            [
                2351,
                2355
            ],
            [
                2372,
                2381
            ],
            [
                2392,
                2394
            ],
            [
                2394,
                2465
            ],
            [
                2494,
                2516
            ],
            [
                2568,
                2608
            ],
            [
                2625,
                2669
            ],
            [
                2699,
                2712
            ],
            [
                2712,
                2844
            ],
            [
                2857,
                2859
            ],
            [
                2859,
                2922
            ],
            [
                2922,
                3011
            ],
            [
                3011,
                3015
            ],
            [
                3053,
                3124
            ],
            [
                3124,
                3294
            ],
            [
                3294,
                3354
            ],
            [
                3354,
                3409
            ],
            [
                3516,
                3533
            ],
            [
                3543,
                3586
            ],
            [
                3586,
                3708
            ],
            [
                3714,
                3716
            ],
            [
                3716,
                3828
            ],
            [
                3833,
                3840
            ],
            [
                3851,
                3852
            ],
            [
                3919,
                3982
            ],
            [
                3994,
                3995
            ],
            [
                4016,
                4054
            ],
            [
                4054,
                4125
            ],
            [
                4134,
                4142
            ],
            [
                4192,
                4199
            ],
            [
                4147,
                4163
            ],
            [
                4199,
                4201
            ],
            [
                4201,
                4260
            ],
            [
                4297,
                4317
            ],
            [
                4277,
                4280
            ],
            [
                4325,
                4349
            ],
            [
                4295,
                4296
            ],
            [
                4368,
                4373
            ],
            [
                4382,
                4404
            ],
            [
                4404,
                4421
            ],
            [
                4438,
                4444
            ],
            [
                4468,
                4481
            ],
            [
                4490,
                4498
            ],
            [
                4498,
                4518
            ],
            [
                4548,
                4603
            ],
            [
                4611,
                4677
            ],
            [
                4692,
                4746
            ],
            [
                4752,
                4762
            ],
            [
                4769,
                4771
            ],
            [
                4771,
                4810
            ],
            [
                4852,
                4879
            ],
            [
                4890,
                4916
            ],
            [
                4833,
                4834
            ],
            [
                4918,
                4927
            ],
            [
                4929,
                4962
            ],
            [
                4972,
                4979
            ],
            [
                4987,
                4989
            ],
            [
                4989,
                5043
            ],
            [
                5073,
                5090
            ],
            [
                5104,
                5146
            ],
            [
                5146,
                5236
            ],
            [
                5238,
                5243
            ],
            [
                5254,
                5265
            ],
            [
                5266,
                5281
            ],
            [
                5374,
                5404
            ],
            [
                5312,
                5315
            ],
            [
                5356,
                5373
            ],
            [
                5404,
                5455
            ],
            [
                5471,
                5503
            ],
            [
                5532,
                5535
            ],
            [
                5577,
                5579
            ],
            [
                5579,
                5620
            ],
            [
                5639,
                5642
            ],
            [
                5652,
                5659
            ],
            [
                5643,
                5648
            ],
            [
                5840,
                5842
            ],
            [
                5842,
                5877
            ],
            [
                5891,
                5893
            ],
            [
                5893,
                5952
            ],
            [
                5960,
                5962
            ],
            [
                5988,
                5995
            ],
            [
                5997,
                6000
            ],
            [
                6014,
                6044
            ],
            [
                5963,
                5966
            ],
            [
                6044,
                6046
            ],
            [
                6046,
                6057
            ],
            [
                6066,
                6088
            ],
            [
                6136,
                6138
            ],
            [
                6138,
                6184
            ],
            [
                6292,
                6306
            ],
            [
                6306,
                6323
            ],
            [
                6323,
                6353
            ],
            [
                6353,
                6357
            ],
            [
                6359,
                6379
            ],
            [
                6384,
                6386
            ],
            [
                6386,
                6415
            ],
            [
                6425,
                6440
            ],
            [
                6440,
                6496
            ],
            [
                6496,
                6520
            ],
            [
                6525,
                6540
            ],
            [
                6639,
                6646
            ],
            [
                6724,
                6733
            ],
            [
                6771,
                6773
            ],
            [
                6773,
                6786
            ],
            [
                6790,
                6809
            ],
            [
                6839,
                6841
            ],
            [
                6841,
                6886
            ],
            [
                6927,
                7032
            ],
            [
                7042,
                7064
            ],
            [
                7064,
                7082
            ],
            [
                7087,
                7124
            ],
            [
                7158,
                7160
            ],
            [
                7160,
                7242
            ],
            [
                7242,
                7253
            ],
            [
                7257,
                7301
            ],
            [
                7301,
                7326
            ],
            [
                7343,
                7369
            ],
            [
                7369,
                7393
            ],
            [
                7449,
                7473
            ],
            [
                7473,
                7488
            ],
            [
                7494,
                7508
            ],
            [
                7513,
                7520
            ],
            [
                7522,
                7537
            ],
            [
                7568,
                7615
            ],
            [
                7618,
                7626
            ],
            [
                7626,
                7653
            ],
            [
                7663,
                7728
            ],
            [
                7728,
                7734
            ],
            [
                7792,
                7863
            ],
            [
                7873,
                7891
            ],
            [
                7891,
                7892
            ],
            [
                7904,
                7921
            ],
            [
                7938,
                7979
            ],
            [
                7988,
                8009
            ],
            [
                8009,
                8029
            ],
            [
                8037,
                8042
            ],
            [
                8202,
                8223
            ],
            [
                8228,
                8234
            ],
            [
                8236,
                8242
            ],
            [
                8249,
                8260
            ],
            [
                8265,
                8290
            ],
            [
                8315,
                8316
            ],
            [
                8423,
                8425
            ],
            [
                8455,
                8498
            ],
            [
                8498,
                8514
            ],
            [
                8519,
                8552
            ],
            [
                8569,
                8571
            ],
            [
                8571,
                8599
            ],
            [
                8658,
                8721
            ],
            [
                8726,
                8823
            ],
            [
                8837,
                8838
            ],
            [
                8839,
                8862
            ],
            [
                8871,
                8895
            ],
            [
                8936,
                8938
            ],
            [
                8938,
                8951
            ],
            [
                8953,
                8995
            ],
            [
                9003,
                9023
            ],
            [
                9027,
                9080
            ],
            [
                9080,
                9092
            ],
            [
                9114,
                9125
            ],
            [
                9130,
                9154
            ],
            [
                9168,
                9182
            ],
            [
                9182,
                9228
            ],
            [
                9228,
                9259
            ],
            [
                9265,
                9287
            ],
            [
                9320,
                9322
            ],
            [
                9322,
                9365
            ],
            [
                9367,
                9413
            ],
            [
                9415,
                9475
            ],
            [
                9475,
                9548
            ],
            [
                9560,
                9568
            ],
            [
                9568,
                9612
            ],
            [
                9628,
                9661
            ],
            [
                9676,
                9691
            ],
            [
                9742,
                9744
            ],
            [
                9744,
                9747
            ],
            [
                9758,
                9779
            ],
            [
                9788,
                9790
            ],
            [
                9790,
                9829
            ],
            [
                10013,
                10039
            ],
            [
                9865,
                9868
            ],
            [
                10040,
                10047
            ],
            [
                10062,
                10132
            ],
            [
                10166,
                10168
            ],
            [
                10168,
                10178
            ],
            [
                10214,
                10283
            ],
            [
                10385,
                10394
            ],
            [
                10343,
                10350
            ],
            [
                10363,
                10370
            ],
            [
                10377,
                10385
            ],
            [
                10421,
                10422
            ],
            [
                10488,
                10559
            ],
            [
                10559,
                10587
            ],
            [
                10600,
                10626
            ],
            [
                10626,
                10685
            ],
            [
                10747,
                10774
            ],
            [
                11061,
                11090
            ],
            [
                11115,
                11126
            ],
            [
                11185,
                11252
            ],
            [
                11257,
                11266
            ],
            [
                11271,
                11290
            ],
            [
                11410,
                11496
            ],
            [
                11506,
                11508
            ],
            [
                11508,
                11521
            ],
            [
                11572,
                11575
            ],
            [
                11623,
                11630
            ],
            [
                11522,
                11534
            ],
            [
                11555,
                11568
            ],
            [
                11535,
                11550
            ],
            [
                11643,
                11645
            ],
            [
                11648,
                11718
            ],
            [
                11726,
                11731
            ],
            [
                11732,
                11738
            ],
            [
                11745,
                11747
            ],
            [
                11747,
                11757
            ],
            [
                11773,
                11827
            ],
            [
                11839,
                11862
            ],
            [
                11862,
                11950
            ],
            [
                12244,
                12247
            ],
            [
                12344,
                12348
            ],
            [
                12754,
                12757
            ],
            [
                12374,
                12377
            ],
            [
                12382,
                12386
            ],
            [
                12457,
                12460
            ],
            [
                12283,
                12286
            ],
            [
                12519,
                12535
            ],
            [
                12387,
                12389
            ],
            [
                12541,
                12576
            ],
            [
                12249,
                12250
            ],
            [
                12787,
                12829
            ],
            [
                12848,
                12859
            ],
            [
                12864,
                12867
            ],
            [
                12884,
                12902
            ],
            [
                12913,
                12915
            ],
            [
                12932,
                12936
            ],
            [
                12948,
                12967
            ],
            [
                12977,
                12983
            ],
            [
                12985,
                13014
            ],
            [
                13034,
                13081
            ],
            [
                13082,
                13092
            ],
            [
                13123,
                13124
            ],
            [
                13125,
                13209
            ],
            [
                13211,
                13216
            ],
            [
                13253,
                13314
            ],
            [
                13316,
                13342
            ],
            [
                13361,
                13367
            ],
            [
                13372,
                13408
            ],
            [
                13429,
                13465
            ],
            [
                13466,
                13500
            ],
            [
                13514,
                13537
            ],
            [
                13548,
                13549
            ],
            [
                13554,
                13623
            ],
            [
                13722,
                13724
            ],
            [
                13724,
                13757
            ],
            [
                13800,
                13890
            ],
            [
                13894,
                13907
            ],
            [
                13924,
                13930
            ],
            [
                13765,
                13768
            ],
            [
                14045,
                14047
            ],
            [
                14047,
                14050
            ],
            [
                14059,
                14063
            ],
            [
                14073,
                14117
            ],
            [
                14126,
                14138
            ],
            [
                14150,
                14198
            ],
            [
                14202,
                14222
            ],
            [
                14245,
                14257
            ],
            [
                14271,
                14323
            ],
            [
                14332,
                14339
            ],
            [
                14390,
                14391
            ],
            [
                14707,
                14746
            ],
            [
                14774,
                14785
            ],
            [
                14765,
                14769
            ],
            [
                14813,
                14823
            ],
            [
                14851,
                14914
            ],
            [
                14965,
                14967
            ],
            [
                14967,
                14986
            ],
            [
                15079,
                15081
            ],
            [
                15081,
                15132
            ],
            [
                15143,
                15149
            ],
            [
                15301,
                15304
            ],
            [
                15153,
                15164
            ],
            [
                15316,
                15319
            ],
            [
                15170,
                15212
            ],
            [
                15335,
                15348
            ],
            [
                15374,
                15431
            ],
            [
                15431,
                15454
            ],
            [
                15472,
                15508
            ],
            [
                15551,
                15567
            ],
            [
                15580,
                15597
            ],
            [
                15601,
                15616
            ],
            [
                15673,
                15677
            ],
            [
                15687,
                15726
            ],
            [
                15736,
                15738
            ],
            [
                15738,
                15753
            ],
            [
                15767,
                15792
            ],
            [
                15810,
                15822
            ],
            [
                15827,
                15873
            ],
            [
                15873,
                15875
            ],
            [
                15942,
                15970
            ],
            [
                15981,
                15988
            ],
            [
                15936,
                15941
            ],
            [
                15993,
                16003
            ],
            [
                16004,
                16026
            ],
            [
                16063,
                16096
            ],
            [
                16143,
                16145
            ],
            [
                16145,
                16180
            ],
            [
                16185,
                16190
            ],
            [
                16218,
                16260
            ],
            [
                16181,
                16184
            ],
            [
                16336,
                16338
            ],
            [
                16267,
                16276
            ],
            [
                16350,
                16352
            ],
            [
                16352,
                16393
            ],
            [
                16404,
                16425
            ],
            [
                16425,
                16431
            ],
            [
                16443,
                16471
            ],
            [
                16479,
                16496
            ],
            [
                16566,
                16568
            ],
            [
                16579,
                16647
            ],
            [
                16653,
                16655
            ],
            [
                16655,
                16692
            ],
            [
                16703,
                16716
            ],
            [
                16731,
                16752
            ],
            [
                16760,
                16817
            ],
            [
                16841,
                16842
            ],
            [
                16843,
                16860
            ],
            [
                16831,
                16834
            ],
            [
                16893,
                16896
            ],
            [
                16874,
                16879
            ],
            [
                16896,
                16930
            ],
            [
                16870,
                16873
            ],
            [
                16957,
                16988
            ],
            [
                16994,
                17000
            ],
            [
                17000,
                17055
            ],
            [
                17107,
                17127
            ],
            [
                17078,
                17083
            ],
            [
                17056,
                17068
            ],
            [
                17201,
                17249
            ],
            [
                17251,
                17257
            ],
            [
                17265,
                17272
            ],
            [
                17291,
                17297
            ],
            [
                17084,
                17087
            ],
            [
                17329,
                17351
            ],
            [
                17351,
                17391
            ],
            [
                17466,
                17468
            ],
            [
                17468,
                17482
            ],
            [
                17493,
                17546
            ],
            [
                17571,
                17587
            ],
            [
                17587,
                17588
            ],
            [
                17604,
                17621
            ],
            [
                17621,
                17632
            ],
            [
                17632,
                17673
            ],
            [
                17673,
                17693
            ],
            [
                17693,
                17859
            ],
            [
                17859,
                17873
            ],
            [
                17890,
                17944
            ],
            [
                17944,
                17947
            ],
            [
                17963,
                17982
            ],
            [
                18002,
                18004
            ],
            [
                18009,
                18011
            ],
            [
                18014,
                18030
            ],
            [
                18041,
                18095
            ],
            [
                18095,
                18135
            ],
            [
                18176,
                18179
            ],
            [
                18239,
                18243
            ],
            [
                18254,
                18256
            ],
            [
                18216,
                18219
            ],
            [
                18262,
                18270
            ],
            [
                18285,
                18294
            ],
            [
                18294,
                18341
            ],
            [
                18341,
                18388
            ],
            [
                18388,
                18430
            ],
            [
                18432,
                18435
            ],
            [
                18437,
                18467
            ],
            [
                18488,
                18526
            ],
            [
                18526,
                18573
            ],
            [
                18575,
                18586
            ],
            [
                18590,
                18616
            ],
            [
                18616,
                18635
            ],
            [
                18658,
                18660
            ],
            [
                18689,
                18732
            ],
            [
                18732,
                18753
            ],
            [
                18760,
                18776
            ],
            [
                18776,
                18798
            ],
            [
                18798,
                18814
            ],
            [
                18834,
                18846
            ],
            [
                18865,
                18891
            ],
            [
                19177,
                19203
            ],
            [
                19214,
                19241
            ],
            [
                19241,
                19277
            ],
            [
                19301,
                19346
            ],
            [
                19383,
                19411
            ],
            [
                19354,
                19355
            ],
            [
                19415,
                19468
            ],
            [
                19512,
                19561
            ],
            [
                19631,
                19665
            ],
            [
                19665,
                19712
            ],
            [
                19755,
                19757
            ],
            [
                19757,
                19758
            ],
            [
                19762,
                19778
            ],
            [
                19782,
                19801
            ],
            [
                19806,
                19831
            ],
            [
                19882,
                19926
            ],
            [
                19930,
                19966
            ],
            [
                19995,
                19997
            ],
            [
                19997,
                20031
            ],
            [
                20031,
                20046
            ],
            [
                20089,
                20091
            ],
            [
                20091,
                20102
            ],
            [
                20124,
                20149
            ],
            [
                20150,
                20223
            ],
            [
                20223,
                20324
            ],
            [
                20447,
                20486
            ],
            [
                20501,
                20529
            ],
            [
                20530,
                20558
            ],
            [
                20558,
                20592
            ],
            [
                20600,
                20602
            ],
            [
                20607,
                20635
            ],
            [
                20636,
                20702
            ],
            [
                20707,
                20781
            ],
            [
                20781,
                20876
            ],
            [
                20877,
                20919
            ],
            [
                20919,
                20922
            ],
            [
                20977,
                21061
            ],
            [
                21061,
                21079
            ],
            [
                21085,
                21116
            ],
            [
                21138,
                21183
            ],
            [
                21184,
                21296
            ],
            [
                21296,
                21305
            ],
            [
                21319,
                21353
            ],
            [
                21362,
                21363
            ],
            [
                21370,
                21373
            ],
            [
                21446,
                21453
            ],
            [
                21467,
                21513
            ],
            [
                21533,
                21619
            ],
            [
                21419,
                21422
            ],
            [
                21668,
                21670
            ],
            [
                21670,
                21675
            ],
            [
                21693,
                21786
            ],
            [
                21795,
                21838
            ]
        ],
        "row_chars": [
            [
                0,
                192
            ],
            [
                192,
                468
            ],
            [
                468,
                590
            ],
            [
                590,
                653
            ],
            [
                653,
                772
            ],
            [
                772,
                851
            ],
            [
                851,
                920
            ],
            [
                920,
                1125
            ],
            [
                1125,
                1305
            ],
            [
                1305,
                1430
            ],
            [
                1430,
                1688
            ],
            [
                1688,
                1893
            ],
            [
                1893,
                2394
            ],
            [
                2394,
                2712
            ],
            [
                2712,
                2859
            ],
            [
                2859,
                2922
            ],
            [
                2922,
                3011
            ],
            [
                3011,
                3124
            ],
            [
                3124,
                3294
            ],
            [
                3294,
                3354
            ],
            [
                3354,
                3410
            ],
            [
                3410,
                3516
            ],
            [
                3516,
                3586
            ],
            [
                3586,
                3716
            ],
            [
                3716,
                3919
            ],
            [
                3919,
                4054
            ],
            [
                4054,
                4201
            ],
            [
                4201,
                4404
            ],
            [
                4404,
                4498
            ],
            [
                4498,
                4771
            ],
            [
                4771,
                4989
            ],
            [
                4989,
                5043
            ],
            [
                5043,
                5146
            ],
            [
                5146,
                5282
            ],
            [
                5282,
                5579
            ],
            [
                5579,
                5842
            ],
            [
                5842,
                5893
            ],
            [
                5893,
                6046
            ],
            [
                6046,
                6138
            ],
            [
                6138,
                6184
            ],
            [
                6184,
                6233
            ],
            [
                6233,
                6292
            ],
            [
                6292,
                6306
            ],
            [
                6306,
                6323
            ],
            [
                6323,
                6353
            ],
            [
                6353,
                6386
            ],
            [
                6386,
                6440
            ],
            [
                6440,
                6496
            ],
            [
                6496,
                6773
            ],
            [
                6773,
                6841
            ],
            [
                6841,
                6886
            ],
            [
                6886,
                6927
            ],
            [
                6927,
                7064
            ],
            [
                7064,
                7160
            ],
            [
                7160,
                7242
            ],
            [
                7242,
                7301
            ],
            [
                7301,
                7369
            ],
            [
                7369,
                7473
            ],
            [
                7473,
                7508
            ],
            [
                7508,
                7626
            ],
            [
                7626,
                7728
            ],
            [
                7728,
                7736
            ],
            [
                7736,
                7792
            ],
            [
                7792,
                7891
            ],
            [
                7891,
                8009
            ],
            [
                8009,
                8042
            ],
            [
                8042,
                8092
            ],
            [
                8092,
                8142
            ],
            [
                8142,
                8190
            ],
            [
                8190,
                8317
            ],
            [
                8317,
                8423
            ],
            [
                8423,
                8498
            ],
            [
                8498,
                8571
            ],
            [
                8571,
                8722
            ],
            [
                8722,
                8839
            ],
            [
                8839,
                8938
            ],
            [
                8938,
                8995
            ],
            [
                8995,
                9003
            ],
            [
                9003,
                9182
            ],
            [
                9182,
                9228
            ],
            [
                9228,
                9322
            ],
            [
                9322,
                9475
            ],
            [
                9475,
                9568
            ],
            [
                9568,
                9744
            ],
            [
                9744,
                9790
            ],
            [
                9790,
                10168
            ],
            [
                10168,
                10423
            ],
            [
                10423,
                10488
            ],
            [
                10488,
                10559
            ],
            [
                10559,
                10626
            ],
            [
                10626,
                10774
            ],
            [
                10774,
                10907
            ],
            [
                10907,
                11061
            ],
            [
                11061,
                11126
            ],
            [
                11126,
                11508
            ],
            [
                11508,
                11645
            ],
            [
                11645,
                11747
            ],
            [
                11747,
                11862
            ],
            [
                11862,
                11951
            ],
            [
                11951,
                12100
            ],
            [
                12100,
                12244
            ],
            [
                12244,
                12787
            ],
            [
                12787,
                12915
            ],
            [
                12915,
                13125
            ],
            [
                13125,
                13466
            ],
            [
                13466,
                13724
            ],
            [
                13724,
                14047
            ],
            [
                14047,
                14198
            ],
            [
                14198,
                14392
            ],
            [
                14392,
                14707
            ],
            [
                14707,
                14967
            ],
            [
                14967,
                15081
            ],
            [
                15081,
                15431
            ],
            [
                15431,
                15673
            ],
            [
                15673,
                15738
            ],
            [
                15738,
                15873
            ],
            [
                15873,
                16145
            ],
            [
                16145,
                16352
            ],
            [
                16352,
                16425
            ],
            [
                16425,
                16568
            ],
            [
                16568,
                16655
            ],
            [
                16655,
                17000
            ],
            [
                17000,
                17351
            ],
            [
                17351,
                17468
            ],
            [
                17468,
                17587
            ],
            [
                17587,
                17621
            ],
            [
                17621,
                17632
            ],
            [
                17632,
                17673
            ],
            [
                17673,
                17693
            ],
            [
                17693,
                17859
            ],
            [
                17859,
                17944
            ],
            [
                17944,
                18095
            ],
            [
                18095,
                18135
            ],
            [
                18135,
                18176
            ],
            [
                18176,
                18294
            ],
            [
                18294,
                18341
            ],
            [
                18341,
                18388
            ],
            [
                18388,
                18526
            ],
            [
                18526,
                18590
            ],
            [
                18590,
                18616
            ],
            [
                18616,
                18660
            ],
            [
                18660,
                18689
            ],
            [
                18689,
                18732
            ],
            [
                18732,
                18798
            ],
            [
                18798,
                18914
            ],
            [
                18914,
                18954
            ],
            [
                18954,
                19177
            ],
            [
                19177,
                19241
            ],
            [
                19241,
                19665
            ],
            [
                19665,
                19757
            ],
            [
                19757,
                19997
            ],
            [
                19997,
                20031
            ],
            [
                20031,
                20091
            ],
            [
                20091,
                20223
            ],
            [
                20223,
                20447
            ],
            [
                20447,
                20558
            ],
            [
                20558,
                20602
            ],
            [
                20602,
                20781
            ],
            [
                20781,
                20877
            ],
            [
                20877,
                20919
            ],
            [
                20919,
                21061
            ],
            [
                21061,
                21296
            ],
            [
                21296,
                21670
            ],
            [
                21670,
                21838
            ]
        ]
    },
    "abridged": {
        "text": "We now return to some old Hampshire acquaintances, whose hopes of inheritance were so woefully disappointed. It was a heavy blow to Bute Crawley to receive only five thousand pounds from Miss Crawley's estate. Once he had paid his own debts and Jim's, very little remained to portion off his four plain daughters. Mrs. Bute never knew, or at least never acknowledged, how far her own tyrannous behaviour had ruined her husband. She vowed that she had done all that woman could do. Was it her fault if she was not as hypocritical as her nephew, Pitt Crawley?\n\"At least the money will remain in the family,\" she said. \"Pitt will never spend it, my dear; for a greater miser does not exist.\"\nSo Mrs. Bute, after the first shock, began to adjust to her altered fortunes and to save with all her might. She invented a thousand methods to conceal poverty. She took her daughters to public places with praiseworthy energy; she entertained her friends hospitably at the Rectory. Nobody would have supposed that the family had been disappointed in their expectations, or have guessed how she pinched and starved at home. Her girls appeared perseveringly at the Winchester assemblies; they went to Cowes for the balls and regattas; and their carriage, with the horses taken from the plough, was at work perpetually, until it began almost to be believed that the four sisters had had fortunes left them by their aunt, of whom the family spoke only with gratitude. I know no sort of lying which is more frequent in Vanity Fair than this. People who practise it fancy that they are exceedingly virtuous, because they are able to deceive the world about their means.\nMrs. Bute certainly thought herself one of the most virtuous women in England, and the sight of her happy family was an edifying one. They were so cheerful, so loving, so well-educated, so simple! Martha painted flowers exquisitely and furnished half the charity bazaars in the county. Emma's verses in the Hampshire Telegraph were the glory of its Poet's Corner. Fanny and Matilda sang duets together, Mamma playing the piano, and the other two sisters sitting with their arms round each other's waists and listening affectionately. Nobody saw the poor girls drumming at the duets in private. No one saw Mamma drilling them rigidly hour after hour.\nEverything that a respectable mother could do Mrs. Bute did. She got over yachting men from Southampton, parsons from the Cathedral Close at Winchester, and officers from the barracks. She tried to inveigle the young barristers at assizes and encouraged Jim to bring home friends with whom he went hunting.\nBetween such a woman and her brother-in-law, the odious Baronet, there could be very little in common. The rupture between Bute and his brother Sir Pitt was complete; indeed, Sir Pitt scandalised the whole county. His dislike for respectable society increased with age, and no gentleman's carriage had passed his gates since Pitt and Lady Jane paid a visit after their marriage.\nThat was an awful visit, remembered by the family with horror. Pitt begged his wife never to speak of it, and it was only through Mrs. Bute, who still knew everything which took place at the Hall, that the nature of Sir Pitt's reception of his son and daughter-in-law was ever known.\nAs they drove up the avenue of the park, Pitt remarked with dismay great gaps among the trees - his trees - which the old Baronet was felling without permission. The park wore an aspect of utter dreariness and ruin. The neat carriage floundered in muddy pools along the road. The great sweep in front of the terrace and entrance stair was black and covered with moss; the flower-beds were rank and weedy.\nAfter much ringing of the bell, the door was unbarred; an individual in ribbons was seen flitting up the stairs, as Horrocks at length admitted Pitt and Lady Jane. He led the way into Sir Pitt's \"library,\" where the tobacco fumes were strong.\nThe library looked out on the front. Sir Pitt had opened one of the windows, and was bawling out to a servant who was about to take the baggage down from the carriage.\n\"Don't move them trunks,\" he cried. \"It's only a morning visit, Tucker, you fool. How do, Pitt? How do, my dear? Come to see the old man, hay? 'Gad - you've a pretty face. You ain't like that old horse, your mother. Come and give old Pitt a kiss, like a good little gal.\"\nThe embrace disconcerted his daughter-in-law; but she submitted.\n\"Pitt has got fat,\" said the Baronet. \"Does he read ee very long zermons, my dear? Go and get a glass of Malmsey and a cake for my Lady Jane, Horrocks, you great big booby, and don't stand there like a fat pig. I won't ask you to stay, my dear; you'll find it too stoopid. I'm an old man now, and like my own ways, and my pipe and backgammon of a night.\"\n\"I can play backgammon, sir,\" said Lady Jane, laughing. \"I used to play with Papa, didn't I, Mr. Crawley?\"\n\"Lady Jane can play, sir,\" Pitt said haughtily.\n\"But she wawn't stay for all that. Naw, go back to Mudbury; or drive down to the Rectory and ask Buty for dinner. He'll be charmed to see you; he's so much obliged to you for gettin' the old woman's money. Ha, ha!\"\n\"I perceive, sir,\" said Pitt with a heightened voice, \"that your people are cutting down the timber.\"\n\"Very fine weather for the time of year,\" Sir Pitt answered, suddenly grown deaf. \"But I'm gittin' old now. I'm not very fur from four-score - he, he.\" He laughed, took snuff, and leered at Lady Jane. \"I've been cruel bad this year with the lumbago. I shan't be here for long; but I'm glad ee've come. I like your face, Lady Jane: and I'll give ee something pretty, my dear, to go to Court in.\"\nHe shuffled across the room to a cupboard, from which he took a little old case containing jewels.\n\"Take that,\" said he, \"it belonged to my mother. Pretty pearls - never gave 'em the ironmonger's daughter. Take 'em and put 'em away quick,\" said he, thrusting the case into his daughter-in-law's hand, and shutting the cabinet as Horrocks entered with refreshments.\n\"What have you a been and given Pitt's wife?\" said the individual in ribbons, after Pitt and Lady Jane had left. It was Miss Horrocks, the butler's daughter - the cause of the scandal throughout the county - the lady who reigned now almost supreme at Queen's Crawley.\nThe rise and progress of those Ribbons had been marked with dismay by the family. The Ribbons opened an account at the Mudbury Bank; the Ribbons drove to church in the pony-chaise. The servants were dismissed at her wish. The Scotch gardener, who still lingered, found the Ribbons eating his peaches one morning at the south-wall, and had his ears boxed when he remonstrated with her. He and his family, the only respectable inhabitants of Queen's Crawley, were forced to leave, and the stately gardens went to waste.\nOnly two or three domestics shuddered in the bleak old servants' hall. The stables and offices were shut up, and half ruined. Sir Pitt lived in private, and boozed nightly with Horrocks and the abandoned Ribbons. He quarrelled with his agents by letter. The lawyers and farm-bailiffs who had to do business with him could only reach him through the Ribbons; and so the Baronet's daily perplexities increased, and his embarrassments multiplied.\nThe horror of his correct son Pitt Crawley at these reports may be imagined. Pitt trembled daily lest he should hear that the Ribbons was proclaimed his legal stepmother. After that visit, his father's name was never mentioned in Pitt's genteel establishment. It was the skeleton in his house, and all the family walked by it in terror and silence.\nSir Pitt was cut dead by his old acquaintance: but he put his hands in his pockets, and burst out laughing. Miss Horrocks was installed as housekeeper, and ruled the servants with great majesty. They were told to address her as \"Madam\" - and there was one little maid who persisted in calling her \"My Lady,\" without receiving any rebuke.\n\"There has been better ladies, and there has been worser, Hester,\" was Miss Horrocks's reply. So she ruled, having supreme power over all except her father - whom, however, she treated haughtily, warning him not to be too familiar towards one \"as was to be a Baronet's lady.\"\nIndeed, she rehearsed that exalted position with great satisfaction, to the amusement of old Sir Pitt, who chuckled at her airs and graces. He swore it was as good as a play, and he made her put on one of the first Lady Crawley's court-dresses, swearing (entirely with Miss Horrocks's agreement) that it suited her greatly. She ransacked the wardrobes of the two defunct ladies, and hacked their finery so as to suit her own tastes and figure. She would have liked their jewels too; but the old Baronet had locked them away in his cabinet.\nThough the good people of the Parsonage shunned the Hall, yet they knew all that happened there, and were looking out every day for the catastrophic marriage. But Fate intervened.\nOne day the Baronet surprised \"her ladyship,\" as he called the Ribbons, seated at the old and tuneless piano in the drawing-room and squalling in imitation of the music which she had sometimes heard. The little kitchen-maid was standing at her mistress's side, wagging her head and crying, \"Lor, Ma'am, 'tis bittiful.\"\nThis made the old Baronet roar with laughter. He narrated the incident a dozen times to Horrocks during the evening, greatly to the discomfiture of Miss Horrocks. He squalled in imitation of her singing, and vowed that with such a beautiful voice she ought to have singing-masters. He was in great spirits that night, drank an extraordinary quantity of rum-and-water, and went to bed very late.\nHalf an hour afterwards there was a great bustle in the house. Lights moved from window to window in the desolate old Hall. A boy on a pony went galloping off to Mudbury, to the Doctor's house. And in another hour (by which fact we see how carefully Mrs. Bute Crawley had kept up an understanding with the great house), that lady, with the Reverend Bute and their son James, had walked over from the Rectory and entered the mansion by the open door.\nThey passed through the hall and the small oak parlour, where the empty rum-bottle stood on the table. They entered Sir Pitt's study, where they found Miss Horrocks of the ribbons wildly trying the desks with a bunch of keys. She dropped them with a scream of terror.\n\"Look at that, Mr. Crawley,\" cried Mrs. Bute, pointing at the scared, guilty wench.\n\"He gave 'em me!\" she cried.\n\"Gave them you, you abandoned creature!\" screamed Mrs. Bute. \"Bear witness, Mr. Crawley, we found this good-for-nothing woman in the act of stealing your brother's property; and she will be hanged, as I always said she would.\"\nBetsy Horrocks flung herself down on her knees, bursting into tears. But a really good woman is in no hurry to forgive; the humiliation of an enemy is a triumph to her soul.\n\"Ring the bell, James,\" Mrs. Bute said. The servants came at the jangling summons.\n\"Put that woman in the strong-room,\" she said. \"We caught her in the act of robbing Sir Pitt. Mr. Crawley, you'll make out her committal - and Beddoes, you'll drive her over in the morning, to Southampton Gaol.\"\n\"My dear,\" interposed the Magistrate and Rector, \"she's only-\"\n\"Are there no handcuffs?\" Mrs. Bute continued. \"Where's the creature's abominable father?\"\n\"He did give 'em me,\" cried poor Betsy Horrocks; \"didn't he, Hester? You saw Sir Pitt give 'em me, the day after Mudbury fair.\"\n\"Law, Betsy, how could you tell such a wicked story!\" said Hester, the little kitchen-maid, \"and to Madame Crawley, so good and kind, and you may search all my boxes, Ma'am, I'm sure, and here's my keys as I'm an honest girl, and if you find so much as a beggarly bit of lace, may I never go to church agin.\"\n\"Give up your keys, you hardened hussy,\" hissed Mrs. Bute at Betsy.\n\"Here's a candle, Ma'am, and if you please, I can show you her room, where she keeps heaps and heaps of things, Ma'am,\" cried out the eager little Hester.\n\"Hold your tongue, if you please. I know the room. Mrs. Brown, come with me, and Beddoes, don't you lose sight of that woman,\" said Mrs. Bute, seizing the candle. \"Mr. Crawley, you had better go upstairs and see that they are not murdering your unfortunate brother.\"\nBute went upstairs and found the Doctor with the frightened Horrocks bending over his master in a chair. They were trying to bleed Sir Pitt.\nIn the early morning an express message was sent off to Mr. Pitt Crawley by the Rector's lady, who assumed command of everything, and had watched the old Baronet through the night. He had been brought back to a sort of life; he could not speak, but seemed to recognize people.\nMrs. Bute kept resolutely by his bedside. She did not close her fiery black eyes once, though the Doctor snored in the arm-chair. Horrocks made some efforts to assert his authority; but Mrs. Bute called him a tipsy old wretch, and bade him never show his face again in that house, or he should be transported like his abominable daughter.\nTerrified, he slunk down to the oak parlour. He was ordered to get another bottle of rum, which he fetched, and to which the Rector and his son sat down, ordering Horrocks to put down the keys and leave.\nCowed, Horrocks gave up the keys, and he and his daughter slunk off silently through the night and abandoned possession of the house of Queen's Crawley.",
        "paragraph_chars": [
            [
                0,
                558
            ],
            [
                558,
                689
            ],
            [
                689,
                1653
            ],
            [
                1653,
                2303
            ],
            [
                2303,
                2610
            ],
            [
                2610,
                2989
            ],
            [
                2989,
                3273
            ],
            [
                3273,
                3678
            ],
            [
                3678,
                3921
            ],
            [
                3921,
                4089
            ],
            [
                4089,
                4361
            ],
            [
                4361,
                4426
            ],
            [
                4426,
                4781
            ],
            [
                4781,
                4888
            ],
            [
                4888,
                4936
            ],
            [
                4936,
                5151
            ],
            [
                5151,
                5253
            ],
            [
                5253,
                5648
            ],
            [
                5648,
                5747
            ],
            [
                5747,
                6013
            ],
            [
                6013,
                6281
            ],
            [
                6281,
                6799
            ],
            [
                6799,
                7243
            ],
            [
                7243,
                7592
            ],
            [
                7592,
                7930
            ],
            [
                7930,
                8206
            ],
            [
                8206,
                8746
            ],
            [
                8746,
                8926
            ],
            [
                8926,
                9245
            ],
            [
                9245,
                9640
            ],
            [
                9640,
                10090
            ],
            [
                10090,
                10358
            ],
            [
                10358,
                10442
            ],
            [
                10442,
                10471
            ],
            [
                10471,
                10698
            ],
            [
                10698,
                10872
            ],
            [
                10872,
                10955
            ],
            [
                10955,
                11167
            ],
            [
                11167,
                11230
            ],
            [
                11230,
                11321
            ],
            [
                11321,
                11449
            ],
            [
                11449,
                11758
            ],
            [
                11758,
                11826
            ],
            [
                11826,
                11981
            ],
            [
                11981,
                12248
            ],
            [
                12248,
                12389
            ],
            [
                12389,
                12666
            ],
            [
                12666,
                13005
            ],
            [
                13005,
                13209
            ],
            [
                13209,
                13361
            ]
        ],
        "segment_chars": [
            [
                0,
                109
            ],
            [
                109,
                210
            ],
            [
                210,
                314
            ],
            [
                314,
                428
            ],
            [
                428,
                481
            ],
            [
                481,
                558
            ],
            [
                558,
                616
            ],
            [
                616,
                689
            ],
            [
                689,
                798
            ],
            [
                798,
                850
            ],
            [
                850,
                971
            ],
            [
                971,
                1112
            ],
            [
                1112,
                1453
            ],
            [
                1453,
                1526
            ],
            [
                1526,
                1653
            ],
            [
                1653,
                1787
            ],
            [
                1787,
                1850
            ],
            [
                1850,
                1939
            ],
            [
                1939,
                2017
            ],
            [
                2017,
                2187
            ],
            [
                2187,
                2247
            ],
            [
                2247,
                2303
            ],
            [
                2303,
                2364
            ],
            [
                2364,
                2488
            ],
            [
                2488,
                2610
            ],
            [
                2610,
                2713
            ],
            [
                2713,
                2824
            ],
            [
                2824,
                2989
            ],
            [
                2989,
                3052
            ],
            [
                3052,
                3273
            ],
            [
                3273,
                3435
            ],
            [
                3435,
                3489
            ],
            [
                3489,
                3549
            ],
            [
                3549,
                3678
            ],
            [
                3678,
                3842
            ],
            [
                3842,
                3921
            ],
            [
                3921,
                3958
            ],
            [
                3958,
                4089
            ],
            [
                4089,
                4125
            ],
            [
                4125,
                4171
            ],
            [
                4171,
                4185
            ],
            [
                4185,
                4202
            ],
            [
                4202,
                4232
            ],
            [
                4232,
                4261
            ],
            [
                4261,
                4305
            ],
            [
                4305,
                4361
            ],
            [
                4361,
                4426
            ],
            [
                4426,
                4464
            ],
            [
                4464,
                4509
            ],
            [
                4509,
                4637
            ],
            [
                4637,
                4699
            ],
            [
                4699,
                4781
            ],
            [
                4781,
                4837
            ],
            [
                4837,
                4888
            ],
            [
                4888,
                4936
            ],
            [
                4936,
                4971
            ],
            [
                4971,
                5050
            ],
            [
                5050,
                5142
            ],
            [
                5142,
                5151
            ],
            [
                5151,
                5253
            ],
            [
                5253,
                5335
            ],
            [
                5335,
                5361
            ],
            [
                5361,
                5405
            ],
            [
                5405,
                5454
            ],
            [
                5454,
                5503
            ],
            [
                5503,
                5555
            ],
            [
                5555,
                5648
            ],
            [
                5648,
                5747
            ],
            [
                5747,
                5796
            ],
            [
                5796,
                5854
            ],
            [
                5854,
                6013
            ],
            [
                6013,
                6059
            ],
            [
                6059,
                6126
            ],
            [
                6126,
                6281
            ],
            [
                6281,
                6363
            ],
            [
                6363,
                6462
            ],
            [
                6462,
                6503
            ],
            [
                6503,
                6666
            ],
            [
                6666,
                6799
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6925
            ],
            [
                6925,
                7012
            ],
            [
                7012,
                7053
            ],
            [
                7053,
                7243
            ],
            [
                7243,
                7320
            ],
            [
                7320,
                7414
            ],
            [
                7414,
                7503
            ],
            [
                7503,
                7592
            ],
            [
                7592,
                7700
            ],
            [
                7700,
                7787
            ],
            [
                7787,
                7930
            ],
            [
                7930,
                8024
            ],
            [
                8024,
                8206
            ],
            [
                8206,
                8346
            ],
            [
                8346,
                8530
            ],
            [
                8530,
                8650
            ],
            [
                8650,
                8746
            ],
            [
                8746,
                8905
            ],
            [
                8905,
                8926
            ],
            [
                8926,
                9126
            ],
            [
                9126,
                9245
            ],
            [
                9245,
                9291
            ],
            [
                9291,
                9408
            ],
            [
                9408,
                9527
            ],
            [
                9527,
                9640
            ],
            [
                9640,
                9703
            ],
            [
                9703,
                9764
            ],
            [
                9764,
                9834
            ],
            [
                9834,
                10090
            ],
            [
                10090,
                10193
            ],
            [
                10193,
                10316
            ],
            [
                10316,
                10358
            ],
            [
                10358,
                10442
            ],
            [
                10442,
                10460
            ],
            [
                10460,
                10471
            ],
            [
                10471,
                10512
            ],
            [
                10512,
                10532
            ],
            [
                10532,
                10698
            ],
            [
                10698,
                10767
            ],
            [
                10767,
                10872
            ],
            [
                10872,
                10912
            ],
            [
                10912,
                10955
            ],
            [
                10955,
                11002
            ],
            [
                11002,
                11049
            ],
            [
                11049,
                11167
            ],
            [
                11167,
                11230
            ],
            [
                11230,
                11256
            ],
            [
                11256,
                11277
            ],
            [
                11277,
                11321
            ],
            [
                11321,
                11390
            ],
            [
                11390,
                11449
            ],
            [
                11449,
                11503
            ],
            [
                11503,
                11758
            ],
            [
                11758,
                11826
            ],
            [
                11826,
                11981
            ],
            [
                11981,
                12015
            ],
            [
                12015,
                12032
            ],
            [
                12032,
                12144
            ],
            [
                12144,
                12248
            ],
            [
                12248,
                12353
            ],
            [
                12353,
                12389
            ],
            [
                12389,
                12570
            ],
            [
                12570,
                12666
            ],
            [
                12666,
                12708
            ],
            [
                12708,
                12796
            ],
            [
                12796,
                13005
            ],
            [
                13005,
                13050
            ],
            [
                13050,
                13209
            ],
            [
                13209,
                13361
            ]
        ],
        "overlap_chars": [
            [
                3,
                6
            ],
            [
                14,
                49
            ],
            [
                49,
                62
            ],
            [
                63,
                65
            ],
            [
                78,
                109
            ],
            [
                109,
                155
            ],
            [
                161,
                165
            ],
            [
                166,
                186
            ],
            [
                215,
                244
            ],
            [
                245,
                248
            ],
            [
                250,
                251
            ],
            [
                252,
                256
            ],
            [
                264,
                314
            ],
            [
                314,
                407
            ],
            [
                415,
                428
            ],
            [
                428,
                437
            ],
            [
                443,
                455
            ],
            [
                456,
                479
            ],
            [
                479,
                481
            ],
            [
                481,
                504
            ],
            [
                509,
                512
            ],
            [
                516,
                528
            ],
            [
                532,
                535
            ],
            [
                536,
                556
            ],
            [
                556,
                557
            ],
            [
                558,
                614
            ],
            [
                614,
                616
            ],
            [
                616,
                650
            ],
            [
                650,
                686
            ],
            [
                686,
                689
            ],
            [
                689,
                724
            ],
            [
                724,
                734
            ],
            [
                742,
                777
            ],
            [
                778,
                798
            ],
            [
                798,
                801
            ],
            [
                802,
                821
            ],
            [
                822,
                840
            ],
            [
                841,
                848
            ],
            [
                848,
                850
            ],
            [
                850,
                858
            ],
            [
                873,
                875
            ],
            [
                876,
                889
            ],
            [
                890,
                915
            ],
            [
                916,
                943
            ],
            [
                944,
                948
            ],
            [
                955,
                969
            ],
            [
                969,
                971
            ],
            [
                978,
                1074
            ],
            [
                1075,
                1112
            ],
            [
                1112,
                1121
            ],
            [
                1122,
                1162
            ],
            [
                1163,
                1179
            ],
            [
                1185,
                1201
            ],
            [
                1202,
                1215
            ],
            [
                1220,
                1406
            ],
            [
                1415,
                1425
            ],
            [
                1437,
                1441
            ],
            [
                1442,
                1451
            ],
            [
                1451,
                1453
            ],
            [
                1453,
                1524
            ],
            [
                1526,
                1548
            ],
            [
                1549,
                1589
            ],
            [
                1589,
                1633
            ],
            [
                1640,
                1653
            ],
            [
                1653,
                1785
            ],
            [
                1785,
                1787
            ],
            [
                1787,
                1850
            ],
            [
                1850,
                1939
            ],
            [
                1939,
                1943
            ],
            [
                1946,
                2017
            ],
            [
                2017,
                2187
            ],
            [
                2187,
                2247
            ],
            [
                2247,
                2302
            ],
            [
                2303,
                2320
            ],
            [
                2321,
                2364
            ],
            [
                2364,
                2486
            ],
            [
                2486,
                2488
            ],
            [
                2488,
                2600
            ],
            [
                2601,
                2608
            ],
            [
                2608,
                2609
            ],
            [
                2610,
                2673
            ],
            [
                2673,
                2674
            ],
            [
                2675,
                2713
            ],
            [
                2713,
                2784
            ],
            [
                2785,
                2793
            ],
            [
                2794,
                2801
            ],
            [
                2806,
                2822
            ],
            [
                2822,
                2824
            ],
            [
                2824,
                2883
            ],
            [
                2887,
                2907
            ],
            [
                2908,
                2911
            ],
            [
                2929,
                2953
            ],
            [
                2959,
                2960
            ],
            [
                2961,
                2966
            ],
            [
                2967,
                2989
            ],
            [
                2989,
                3006
            ],
            [
                3007,
                3013
            ],
            [
                3025,
                3038
            ],
            [
                3044,
                3052
            ],
            [
                3052,
                3072
            ],
            [
                3073,
                3128
            ],
            [
                3128,
                3194
            ],
            [
                3202,
                3256
            ],
            [
                3261,
                3271
            ],
            [
                3271,
                3273
            ],
            [
                3273,
                3312
            ],
            [
                3312,
                3339
            ],
            [
                3340,
                3366
            ],
            [
                3367,
                3368
            ],
            [
                3369,
                3378
            ],
            [
                3381,
                3414
            ],
            [
                3415,
                3422
            ],
            [
                3433,
                3435
            ],
            [
                3435,
                3489
            ],
            [
                3489,
                3506
            ],
            [
                3507,
                3549
            ],
            [
                3549,
                3639
            ],
            [
                3639,
                3644
            ],
            [
                3645,
                3656
            ],
            [
                3662,
                3677
            ],
            [
                3678,
                3708
            ],
            [
                3710,
                3713
            ],
            [
                3714,
                3731
            ],
            [
                3731,
                3782
            ],
            [
                3789,
                3821
            ],
            [
                3827,
                3830
            ],
            [
                3840,
                3842
            ],
            [
                3842,
                3883
            ],
            [
                3890,
                3893
            ],
            [
                3894,
                3901
            ],
            [
                3902,
                3907
            ],
            [
                3919,
                3921
            ],
            [
                3921,
                3956
            ],
            [
                3956,
                3958
            ],
            [
                3958,
                4017
            ],
            [
                4018,
                4020
            ],
            [
                4023,
                4030
            ],
            [
                4031,
                4034
            ],
            [
                4039,
                4069
            ],
            [
                4075,
                4078
            ],
            [
                4087,
                4089
            ],
            [
                4089,
                4100
            ],
            [
                4101,
                4123
            ],
            [
                4123,
                4125
            ],
            [
                4125,
                4171
            ],
            [
                4171,
                4185
            ],
            [
                4185,
                4202
            ],
            [
                4202,
                4232
            ],
            [
                4232,
                4236
            ],
            [
                4239,
                4259
            ],
            [
                4259,
                4261
            ],
            [
                4261,
                4290
            ],
            [
                4290,
                4305
            ],
            [
                4305,
                4361
            ],
            [
                4361,
                4385
            ],
            [
                4390,
                4405
            ],
            [
                4407,
                4414
            ],
            [
                4415,
                4424
            ],
            [
                4424,
                4426
            ],
            [
                4426,
                4439
            ],
            [
                4443,
                4462
            ],
            [
                4462,
                4464
            ],
            [
                4464,
                4509
            ],
            [
                4509,
                4614
            ],
            [
                4615,
                4637
            ],
            [
                4637,
                4655
            ],
            [
                4660,
                4697
            ],
            [
                4697,
                4699
            ],
            [
                4699,
                4781
            ],
            [
                4781,
                4792
            ],
            [
                4793,
                4837
            ],
            [
                4837,
                4862
            ],
            [
                4862,
                4888
            ],
            [
                4888,
                4912
            ],
            [
                4912,
                4936
            ],
            [
                4936,
                4951
            ],
            [
                4957,
                4971
            ],
            [
                4971,
                4978
            ],
            [
                4979,
                4994
            ],
            [
                4994,
                5041
            ],
            [
                5042,
                5050
            ],
            [
                5050,
                5077
            ],
            [
                5077,
                5142
            ],
            [
                5142,
                5148
            ],
            [
                5151,
                5222
            ],
            [
                5235,
                5253
            ],
            [
                5253,
                5254
            ],
            [
                5254,
                5271
            ],
            [
                5272,
                5313
            ],
            [
                5314,
                5335
            ],
            [
                5335,
                5355
            ],
            [
                5356,
                5361
            ],
            [
                5361,
                5382
            ],
            [
                5387,
                5393
            ],
            [
                5396,
                5402
            ],
            [
                5405,
                5416
            ],
            [
                5417,
                5442
            ],
            [
                5452,
                5453
            ],
            [
                5454,
                5456
            ],
            [
                5460,
                5503
            ],
            [
                5503,
                5519
            ],
            [
                5520,
                5553
            ],
            [
                5553,
                5555
            ],
            [
                5555,
                5583
            ],
            [
                5584,
                5647
            ],
            [
                5648,
                5745
            ],
            [
                5745,
                5746
            ],
            [
                5747,
                5770
            ],
            [
                5770,
                5794
            ],
            [
                5794,
                5796
            ],
            [
                5796,
                5809
            ],
            [
                5812,
                5854
            ],
            [
                5854,
                5874
            ],
            [
                5880,
                5933
            ],
            [
                5940,
                5952
            ],
            [
                5962,
                5973
            ],
            [
                5974,
                5998
            ],
            [
                5999,
                6013
            ],
            [
                6013,
                6059
            ],
            [
                6059,
                6090
            ],
            [
                6097,
                6119
            ],
            [
                6124,
                6126
            ],
            [
                6126,
                6169
            ],
            [
                6172,
                6218
            ],
            [
                6221,
                6281
            ],
            [
                6281,
                6354
            ],
            [
                6355,
                6363
            ],
            [
                6363,
                6407
            ],
            [
                6408,
                6441
            ],
            [
                6445,
                6460
            ],
            [
                6460,
                6462
            ],
            [
                6462,
                6465
            ],
            [
                6475,
                6496
            ],
            [
                6501,
                6503
            ],
            [
                6503,
                6542
            ],
            [
                6542,
                6568
            ],
            [
                6569,
                6572
            ],
            [
                6573,
                6580
            ],
            [
                6585,
                6655
            ],
            [
                6664,
                6666
            ],
            [
                6666,
                6676
            ],
            [
                6683,
                6752
            ],
            [
                6758,
                6767
            ],
            [
                6768,
                6775
            ],
            [
                6776,
                6783
            ],
            [
                6789,
                6797
            ],
            [
                6797,
                6798
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6898
            ],
            [
                6899,
                6925
            ],
            [
                6925,
                6984
            ],
            [
                6985,
                7012
            ],
            [
                7012,
                7041
            ],
            [
                7042,
                7053
            ],
            [
                7053,
                7120
            ],
            [
                7126,
                7135
            ],
            [
                7136,
                7155
            ],
            [
                7155,
                7241
            ],
            [
                7241,
                7243
            ],
            [
                7243,
                7256
            ],
            [
                7257,
                7260
            ],
            [
                7261,
                7268
            ],
            [
                7273,
                7285
            ],
            [
                7289,
                7302
            ],
            [
                7303,
                7318
            ],
            [
                7318,
                7320
            ],
            [
                7325,
                7395
            ],
            [
                7396,
                7401
            ],
            [
                7406,
                7412
            ],
            [
                7412,
                7414
            ],
            [
                7414,
                7424
            ],
            [
                7425,
                7479
            ],
            [
                7480,
                7503
            ],
            [
                7503,
                7591
            ],
            [
                7592,
                7595
            ],
            [
                7596,
                7600
            ],
            [
                7601,
                7604
            ],
            [
                7605,
                7608
            ],
            [
                7609,
                7613
            ],
            [
                7617,
                7620
            ],
            [
                7621,
                7624
            ],
            [
                7643,
                7659
            ],
            [
                7660,
                7662
            ],
            [
                7663,
                7698
            ],
            [
                7698,
                7699
            ],
            [
                7700,
                7742
            ],
            [
                7742,
                7753
            ],
            [
                7754,
                7757
            ],
            [
                7767,
                7785
            ],
            [
                7785,
                7787
            ],
            [
                7792,
                7796
            ],
            [
                7802,
                7821
            ],
            [
                7821,
                7827
            ],
            [
                7830,
                7859
            ],
            [
                7860,
                7907
            ],
            [
                7918,
                7928
            ],
            [
                7928,
                7929
            ],
            [
                7930,
                8014
            ],
            [
                8017,
                8022
            ],
            [
                8024,
                8085
            ],
            [
                8088,
                8114
            ],
            [
                8115,
                8121
            ],
            [
                8124,
                8160
            ],
            [
                8169,
                8205
            ],
            [
                8206,
                8240
            ],
            [
                8250,
                8273
            ],
            [
                8273,
                8274
            ],
            [
                8275,
                8344
            ],
            [
                8344,
                8346
            ],
            [
                8346,
                8379
            ],
            [
                8379,
                8469
            ],
            [
                8475,
                8488
            ],
            [
                8500,
                8506
            ],
            [
                8517,
                8520
            ],
            [
                8528,
                8530
            ],
            [
                8530,
                8533
            ],
            [
                8534,
                8538
            ],
            [
                8544,
                8588
            ],
            [
                8589,
                8601
            ],
            [
                8602,
                8650
            ],
            [
                8650,
                8670
            ],
            [
                8671,
                8683
            ],
            [
                8684,
                8736
            ],
            [
                8737,
                8744
            ],
            [
                8744,
                8745
            ],
            [
                8746,
                8785
            ],
            [
                8786,
                8797
            ],
            [
                8798,
                8802
            ],
            [
                8802,
                8812
            ],
            [
                8818,
                8881
            ],
            [
                8903,
                8905
            ],
            [
                8905,
                8924
            ],
            [
                8924,
                8926
            ],
            [
                8926,
                8977
            ],
            [
                8978,
                8984
            ],
            [
                8985,
                8988
            ],
            [
                8996,
                9007
            ],
            [
                9008,
                9011
            ],
            [
                9012,
                9054
            ],
            [
                9055,
                9068
            ],
            [
                9069,
                9126
            ],
            [
                9126,
                9149
            ],
            [
                9150,
                9186
            ],
            [
                9187,
                9203
            ],
            [
                9204,
                9221
            ],
            [
                9227,
                9242
            ],
            [
                9245,
                9249
            ],
            [
                9250,
                9289
            ],
            [
                9289,
                9291
            ],
            [
                9291,
                9306
            ],
            [
                9316,
                9341
            ],
            [
                9349,
                9361
            ],
            [
                9362,
                9408
            ],
            [
                9408,
                9410
            ],
            [
                9411,
                9439
            ],
            [
                9440,
                9447
            ],
            [
                9447,
                9452
            ],
            [
                9453,
                9463
            ],
            [
                9469,
                9491
            ],
            [
                9492,
                9525
            ],
            [
                9525,
                9527
            ],
            [
                9527,
                9562
            ],
            [
                9563,
                9568
            ],
            [
                9569,
                9611
            ],
            [
                9613,
                9616
            ],
            [
                9622,
                9624
            ],
            [
                9629,
                9638
            ],
            [
                9638,
                9640
            ],
            [
                9640,
                9681
            ],
            [
                9682,
                9703
            ],
            [
                9703,
                9709
            ],
            [
                9716,
                9744
            ],
            [
                9745,
                9762
            ],
            [
                9762,
                9764
            ],
            [
                9764,
                9832
            ],
            [
                9832,
                9834
            ],
            [
                9834,
                9871
            ],
            [
                9876,
                9889
            ],
            [
                9890,
                9911
            ],
            [
                9912,
                9969
            ],
            [
                9969,
                9970
            ],
            [
                9976,
                9993
            ],
            [
                9994,
                9997
            ],
            [
                10004,
                10007
            ],
            [
                10008,
                10013
            ],
            [
                10013,
                10047
            ],
            [
                10048,
                10051
            ],
            [
                10052,
                10083
            ],
            [
                10084,
                10090
            ],
            [
                10090,
                10145
            ],
            [
                10152,
                10172
            ],
            [
                10173,
                10178
            ],
            [
                10179,
                10191
            ],
            [
                10206,
                10254
            ],
            [
                10255,
                10261
            ],
            [
                10262,
                10269
            ],
            [
                10277,
                10283
            ],
            [
                10284,
                10287
            ],
            [
                10294,
                10316
            ],
            [
                10316,
                10356
            ],
            [
                10356,
                10358
            ],
            [
                10358,
                10372
            ],
            [
                10373,
                10426
            ],
            [
                10426,
                10442
            ],
            [
                10442,
                10443
            ],
            [
                10443,
                10460
            ],
            [
                10460,
                10471
            ],
            [
                10471,
                10512
            ],
            [
                10512,
                10532
            ],
            [
                10532,
                10698
            ],
            [
                10698,
                10712
            ],
            [
                10713,
                10767
            ],
            [
                10767,
                10770
            ],
            [
                10771,
                10790
            ],
            [
                10791,
                10793
            ],
            [
                10794,
                10796
            ],
            [
                10800,
                10816
            ],
            [
                10818,
                10872
            ],
            [
                10872,
                10912
            ],
            [
                10912,
                10915
            ],
            [
                10925,
                10929
            ],
            [
                10930,
                10932
            ],
            [
                10933,
                10936
            ],
            [
                10937,
                10945
            ],
            [
                10946,
                10955
            ],
            [
                10955,
                11002
            ],
            [
                11002,
                11049
            ],
            [
                11049,
                11091
            ],
            [
                11094,
                11097
            ],
            [
                11098,
                11128
            ],
            [
                11129,
                11167
            ],
            [
                11167,
                11214
            ],
            [
                11216,
                11227
            ],
            [
                11230,
                11256
            ],
            [
                11256,
                11275
            ],
            [
                11275,
                11277
            ],
            [
                11278,
                11321
            ],
            [
                11321,
                11342
            ],
            [
                11343,
                11359
            ],
            [
                11368,
                11390
            ],
            [
                11390,
                11406
            ],
            [
                11407,
                11419
            ],
            [
                11420,
                11446
            ],
            [
                11449,
                11475
            ],
            [
                11476,
                11503
            ],
            [
                11503,
                11539
            ],
            [
                11541,
                11586
            ],
            [
                11587,
                11615
            ],
            [
                11618,
                11619
            ],
            [
                11621,
                11674
            ],
            [
                11675,
                11724
            ],
            [
                11724,
                11758
            ],
            [
                11758,
                11805
            ],
            [
                11824,
                11826
            ],
            [
                11826,
                11827
            ],
            [
                11827,
                11843
            ],
            [
                11849,
                11868
            ],
            [
                11868,
                11893
            ],
            [
                11893,
                11937
            ],
            [
                11943,
                11979
            ],
            [
                11979,
                11981
            ],
            [
                11981,
                12015
            ],
            [
                12015,
                12030
            ],
            [
                12030,
                12032
            ],
            [
                12032,
                12043
            ],
            [
                12044,
                12069
            ],
            [
                12071,
                12144
            ],
            [
                12144,
                12245
            ],
            [
                12248,
                12287
            ],
            [
                12288,
                12316
            ],
            [
                12325,
                12353
            ],
            [
                12353,
                12387
            ],
            [
                12387,
                12389
            ],
            [
                12392,
                12420
            ],
            [
                12429,
                12495
            ],
            [
                12496,
                12570
            ],
            [
                12570,
                12665
            ],
            [
                12666,
                12708
            ],
            [
                12708,
                12711
            ],
            [
                12712,
                12796
            ],
            [
                12796,
                12814
            ],
            [
                12815,
                12846
            ],
            [
                12846,
                12891
            ],
            [
                12893,
                13005
            ],
            [
                13005,
                13014
            ],
            [
                13014,
                13048
            ],
            [
                13048,
                13049
            ],
            [
                13053,
                13056
            ],
            [
                13057,
                13064
            ],
            [
                13065,
                13111
            ],
            [
                13111,
                13197
            ],
            [
                13198,
                13201
            ],
            [
                13207,
                13209
            ],
            [
                13209,
                13214
            ],
            [
                13214,
                13307
            ],
            [
                13318,
                13361
            ]
        ],
        "row_chars": [
            [
                0,
                109
            ],
            [
                109,
                314
            ],
            [
                314,
                428
            ],
            [
                428,
                481
            ],
            [
                481,
                558
            ],
            [
                558,
                558
            ],
            [
                558,
                616
            ],
            [
                616,
                689
            ],
            [
                689,
                798
            ],
            [
                798,
                850
            ],
            [
                850,
                971
            ],
            [
                971,
                1112
            ],
            [
                1112,
                1453
            ],
            [
                1453,
                1653
            ],
            [
                1653,
                1787
            ],
            [
                1787,
                1850
            ],
            [
                1850,
                1939
            ],
            [
                1939,
                2017
            ],
            [
                2017,
                2187
            ],
            [
                2187,
                2247
            ],
            [
                2247,
                2303
            ],
            [
                2303,
                2303
            ],
            [
                2303,
                2364
            ],
            [
                2364,
                2488
            ],
            [
                2488,
                2610
            ],
            [
                2610,
                2713
            ],
            [
                2713,
                2824
            ],
            [
                2824,
                2989
            ],
            [
                2989,
                3052
            ],
            [
                3052,
                3273
            ],
            [
                3273,
                3435
            ],
            [
                3435,
                3489
            ],
            [
                3489,
                3549
            ],
            [
                3549,
                3678
            ],
            [
                3678,
                3842
            ],
            [
                3842,
                3921
            ],
            [
                3921,
                3958
            ],
            [
                3958,
                4089
            ],
            [
                4089,
                4125
            ],
            [
                4125,
                4171
            ],
            [
                4171,
                4171
            ],
            [
                4171,
                4171
            ],
            [
                4171,
                4185
            ],
            [
                4185,
                4202
            ],
            [
                4202,
                4232
            ],
            [
                4232,
                4261
            ],
            [
                4261,
                4305
            ],
            [
                4305,
                4361
            ],
            [
                4361,
                4426
            ],
            [
                4426,
                4464
            ],
            [
                4464,
                4509
            ],
            [
                4509,
                4509
            ],
            [
                4509,
                4637
            ],
            [
                4637,
                4699
            ],
            [
                4699,
                4781
            ],
            [
                4781,
                4837
            ],
            [
                4837,
                4888
            ],
            [
                4888,
                4936
            ],
            [
                4936,
                4971
            ],
            [
                4971,
                5050
            ],
            [
                5050,
                5142
            ],
            [
                5142,
                5151
            ],
            [
                5151,
                5151
            ],
            [
                5151,
                5253
            ],
            [
                5253,
                5335
            ],
            [
                5335,
                5361
            ],
            [
                5361,
                5361
            ],
            [
                5361,
                5361
            ],
            [
                5361,
                5361
            ],
            [
                5361,
                5454
            ],
            [
                5454,
                5454
            ],
            [
                5454,
                5503
            ],
            [
                5503,
                5555
            ],
            [
                5555,
                5648
            ],
            [
                5648,
                5747
            ],
            [
                5747,
                5796
            ],
            [
                5796,
                5854
            ],
            [
                5854,
                5854
            ],
            [
                5854,
                6013
            ],
            [
                6013,
                6059
            ],
            [
                6059,
                6126
            ],
            [
                6126,
                6281
            ],
            [
                6281,
                6363
            ],
            [
                6363,
                6462
            ],
            [
                6462,
                6503
            ],
            [
                6503,
                6666
            ],
            [
                6666,
                6799
            ],
            [
                6799,
                6799
            ],
            [
                6799,
                6870
            ],
            [
                6870,
                6925
            ],
            [
                6925,
                7012
            ],
            [
                7012,
                7012
            ],
            [
                7012,
                7012
            ],
            [
                7012,
                7053
            ],
            [
                7053,
                7243
            ],
            [
                7243,
                7320
            ],
            [
                7320,
                7414
            ],
            [
                7414,
                7503
            ],
            [
                7503,
                7592
            ],
            [
                7592,
                7592
            ],
            [
                7592,
                7592
            ],
            [
                7592,
                7700
            ],
            [
                7700,
                7787
            ],
            [
                7787,
                7930
            ],
            [
                7930,
                8206
            ],
            [
                8206,
                8346
            ],
            [
                8346,
                8530
            ],
            [
                8530,
                8650
            ],
            [
                8650,
                8746
            ],
            [
                8746,
                8746
            ],
            [
                8746,
                8905
            ],
            [
                8905,
                8926
            ],
            [
                8926,
                9126
            ],
            [
                9126,
                9245
            ],
            [
                9245,
                9291
            ],
            [
                9291,
                9408
            ],
            [
                9408,
                9527
            ],
            [
                9527,
                9640
            ],
            [
                9640,
                9703
            ],
            [
                9703,
                9764
            ],
            [
                9764,
                9834
            ],
            [
                9834,
                10090
            ],
            [
                10090,
                10316
            ],
            [
                10316,
                10358
            ],
            [
                10358,
                10442
            ],
            [
                10442,
                10460
            ],
            [
                10460,
                10471
            ],
            [
                10471,
                10512
            ],
            [
                10512,
                10532
            ],
            [
                10532,
                10698
            ],
            [
                10698,
                10767
            ],
            [
                10767,
                10872
            ],
            [
                10872,
                10912
            ],
            [
                10912,
                10912
            ],
            [
                10912,
                10955
            ],
            [
                10955,
                11002
            ],
            [
                11002,
                11049
            ],
            [
                11049,
                11167
            ],
            [
                11167,
                11230
            ],
            [
                11230,
                11256
            ],
            [
                11256,
                11277
            ],
            [
                11277,
                11277
            ],
            [
                11277,
                11321
            ],
            [
                11321,
                11390
            ],
            [
                11390,
                11449
            ],
            [
                11449,
                11449
            ],
            [
                11449,
                11449
            ],
            [
                11449,
                11503
            ],
            [
                11503,
                11758
            ],
            [
                11758,
                11826
            ],
            [
                11826,
                11981
            ],
            [
                11981,
                12015
            ],
            [
                12015,
                12032
            ],
            [
                12032,
                12144
            ],
            [
                12144,
                12248
            ],
            [
                12248,
                12353
            ],
            [
                12353,
                12389
            ],
            [
                12389,
                12570
            ],
            [
                12570,
                12666
            ],
            [
                12666,
                12708
            ],
            [
                12708,
                12796
            ],
            [
                12796,
                13005
            ],
            [
                13005,
                13209
            ],
            [
                13209,
                13361
            ]
        ]
    }
}