{
    "original": {
        "text": "The heir of Crawley arrived at home, in due time, after this catastrophe, and henceforth may be said to have reigned in Queen's Crawley. For though the old Baronet survived many months, he never recovered the use of his intellect or his speech completely, and the government of the estate devolved upon his elder son. In a strange condition Pitt found it. Sir Pitt was always buying and mortgaging; he had twenty men of business, and quarrels with each; quarrels with all his tenants, and lawsuits with them; lawsuits with the lawyers; lawsuits with the Mining and Dock Companies in which he was proprietor; and with every person with whom he had business. To unravel these difficulties and to set the estate clear was a task worthy of the orderly and persevering diplomatist of Pumpernickel, and he set himself to work with prodigious assiduity. His whole family, of course, was transported to Queen's Crawley, whither Lady Southdown, of course, came too; and she set about converting the parish under the Rector's nose, and brought down her irregular clergy to the dismay of the angry Mrs Bute. Sir Pitt had concluded no bargain for the sale of the living of Queen's Crawley; when it should drop, her Ladyship proposed to take the patronage into her own hands and present a young protege to the Rectory, on which subject the diplomatic Pitt said nothing.\nMrs. Bute's intentions with regard to Miss Betsy Horrocks were not carried into effect, and she paid no visit to Southampton Gaol. She and her father left the Hall when the latter took possession of the Crawley Arms in the village, of which he had got a lease from Sir Pitt. The ex-butler had obtained a small freehold there likewise, which gave him a vote for the borough. The Rector had another of these votes, and these and four others formed the representative body which returned the two members for Queen's Crawley.\nThere was a show of courtesy kept up between the Rectory and the Hall ladies, between the younger ones at least, for Mrs. Bute and Lady Southdown never could meet without battles, and gradually ceased seeing each other. Her Ladyship kept her room when the ladies from the Rectory visited their cousins at the Hall. Perhaps Mr. Pitt was not very much displeased at these occasional absences of his mamma-in-law. He believed the Binkie family to be the greatest and wisest and most interesting in the world, and her Ladyship and his aunt had long held ascendency over him; but sometimes he felt that she commanded him too much. To be considered young was complimentary, doubtless, but at six-and-forty to be treated as a boy was sometimes mortifying. Lady Jane yielded up everything, however, to her mother. She was only fond of her children in private, and it was lucky for her that Lady Southdown's multifarious business, her conferences with ministers, and her correspondence with all the missionaries of Africa, Asia, and Australasia, &c., occupied the venerable Countess a great deal, so that she had but little time to devote to her granddaughter, the little Matilda, and her grandson, Master Pitt Crawley. The latter was a feeble child, and it was only by prodigious quantities of calomel that Lady Southdown was able to keep him in life at all.\nAs for Sir Pitt he retired into those very apartments where Lady Crawley had been previously extinguished, and here was tended by Miss Hester, the girl upon her promotion, with constant care and assiduity. What love, what fidelity, what constancy is there equal to that of a nurse with good wages? They smooth pillows; and make arrowroot; they get up at nights; they bear complaints and querulousness; they see the sun shining out of doors and don't want to go abroad; they sleep on arm-chairs and eat their meals in solitude; they pass long long evenings doing nothing, watching the embers, and the patient's drink simmering in the jug; they read the weekly paper the whole week through; and Law's Serious Call or the Whole Duty of Man suffices them for literature for the year--and we quarrel with them because, when their relations come to see them once a week, a little gin is smuggled in in their linen basket. Ladies, what man's love is there that would stand a year's nursing of the object of his affection? Whereas a nurse will stand by you for ten pounds a quarter, and we think her too highly paid. At least Mr. Crawley grumbled a good deal about paying half as much to Miss Hester for her constant attendance upon the Baronet his father.\nOf sunshiny days this old gentleman was taken out in a chair on the terrace--the very chair which Miss Crawley had had at Brighton, and which had been transported thence with a number of Lady Southdown's effects to Queen's Crawley. Lady Jane always walked by the old man, and was an evident favourite with him. He used to nod many times to her and smile when she came in, and utter inarticulate deprecatory moans when she was going away. When the door shut upon her he would cry and sob--whereupon Hester's face and manner, which was always exceedingly bland and gentle while her lady was present, would change at once, and she would make faces at him and clench her fist and scream out \"Hold your tongue, you stoopid old fool,\" and twirl away his chair from the fire which he loved to look at--at which he would cry more. For this was all that was left after more than seventy years of cunning, and struggling, and drinking, and scheming, and sin and selfishness--a whimpering old idiot put in and out of bed and cleaned and fed like a baby.\nAt last a day came when the nurse's occupation was over. Early one morning, as Pitt Crawley was at his steward's and bailiff's books in the study, a knock came to the door, and Hester presented herself, dropping a curtsey, and said,\n\"If you please, Sir Pitt, Sir Pitt died this morning, Sir Pitt. I was a-making of his toast, Sir Pitt, for his gruel, Sir Pitt, which he took every morning regular at six, Sir Pitt, and--I thought I heard a moan-like, Sir Pitt--and--and--and--\" She dropped another curtsey.\nWhat was it that made Pitt's pale face flush quite red? Was it because he was Sir Pitt at last, with a seat in Parliament, and perhaps future honours in prospect? \"I'll clear the estate now with the ready money,\" he thought and rapidly calculated its incumbrances and the improvements which he would make. He would not use his aunt's money previously lest Sir Pitt should recover and his outlay be in vain.\nAll the blinds were pulled down at the Hall and Rectory: the church bell was tolled, and the chancel hung in black; and Bute Crawley didn't go to a coursing meeting, but went and dined quietly at Fuddleston, where they talked about his deceased brother and young Sir Pitt over their port. Miss Betsy, who was by this time married to a saddler at Mudbury, cried a good deal. The family surgeon rode over and paid his respectful compliments, and inquiries for the health of their ladyships. The death was talked about at Mudbury and at the Crawley Arms, the landlord whereof had become reconciled with the Rector of late, who was occasionally known to step into the parlour and taste Mr. Horrocks' mild beer.\n\"Shall I write to your brother--or will you?\" asked Lady Jane of her husband, Sir Pitt.\n\"I will write, of course,\" Sir Pitt said, \"and invite him to the funeral: it will be but becoming.\"\n\"And--and--Mrs. Rawdon,\" said Lady Jane timidly.\n\"Jane!\" said Lady Southdown, \"how can you think of such a thing?\"\n\"Mrs. Rawdon must of course be asked,\" said Sir Pitt, resolutely.\n\"Not whilst I am in the house!\" said Lady Southdown.\n\"Your Ladyship will be pleased to recollect that I am the head of this family,\" Sir Pitt replied. \"If you please, Lady Jane, you will write a letter to Mrs. Rawdon Crawley, requesting her presence upon this melancholy occasion.\"\n\"Jane, I forbid you to put pen to paper!\" cried the Countess.\n\"I believe I am the head of this family,\" Sir Pitt repeated; \"and however much I may regret any circumstance which may lead to your Ladyship quitting this house, must, if you please, continue to govern it as I see fit.\"\nLady Southdown rose up as magnificent as Mrs. Siddons in Lady Macbeth and ordered that horses might be put to her carriage. If her son and daughter turned her out of their house, she would hide her sorrows somewhere in loneliness and pray for their conversion to better thoughts.\n\"We don't turn you out of our house, Mamma,\" said the timid Lady Jane imploringly.\n\"You invite such company to it as no Christian lady should meet, and I will have my horses to-morrow morning.\"\n\"Have the goodness to write, Jane, under my dictation,\" said Sir Pitt, rising and throwing himself into an attitude of command, like the portrait of a Gentleman in the Exhibition, \"and begin. 'Queen's Crawley, September 14, 1822.--My dear brother--'\"\nHearing these decisive and terrible words, Lady Macbeth, who had been waiting for a sign of weakness or vacillation on the part of her son-in-law, rose and, with a scared look, left the library. Lady Jane looked up to her husband as if she would fain follow and soothe her mamma, but Pitt forbade his wife to move.\n\"She won't go away,\" he said. \"She has let her house at Brighton and has spent her last half-year's dividends. A Countess living at an inn is a ruined woman. I have been waiting long for an opportunity--to take this--this decisive step, my love; for, as you must perceive, it is impossible that there should be two chiefs in a family: and now, if you please, we will resume the dictation. 'My dear brother, the melancholy intelligence which it is my duty to convey to my family must have been long anticipated by,'\" &c.\nIn a word, Pitt having come to his kingdom, and having by good luck, or desert rather, as he considered, assumed almost all the fortune which his other relatives had expected, was determined to treat his family kindly and respectably and make a house of Queen's Crawley once more. It pleased him to think that he should be its chief. He proposed to use the vast influence that his commanding talents and position must speedily acquire for him in the county to get his brother placed and his cousins decently provided for, and perhaps had a little sting of repentance as he thought that he was the proprietor of all that they had hoped for. In the course of three or four days' reign his bearing was changed and his plans quite fixed: he determined to rule justly and honestly, to depose Lady Southdown, and to be on the friendliest possible terms with all the relations of his blood.\nSo he dictated a letter to his brother Rawdon--a solemn and elaborate letter, containing the profoundest observations, couched in the longest words, and filling with wonder the simple little secretary, who wrote under her husband's order. \"What an orator this will be,\" thought she, \"when he enters the House of Commons\" (on which point, and on the tyranny of Lady Southdown, Pitt had sometimes dropped hints to his wife in bed); \"how wise and good, and what a genius my husband is! I fancied him a little cold; but how good, and what a genius!\"\nThe fact is, Pitt Crawley had got every word of the letter by heart and had studied it, with diplomatic secrecy, deeply and perfectly, long before he thought fit to communicate it to his astonished wife.\nThis letter, with a huge black border and seal, was accordingly despatched by Sir Pitt Crawley to his brother the Colonel, in London. Rawdon Crawley was but half-pleased at the receipt of it. \"What's the use of going down to that stupid place?\" thought he. \"I can't stand being alone with Pitt after dinner, and horses there and back will cost us twenty pound.\"\nHe carried the letter, as he did all difficulties, to Becky, upstairs in her bedroom--with her chocolate, which he always made and took to her of a morning.\nHe put the tray with the breakfast and the letter on the dressing-table, before which Becky sat combing her yellow hair. She took up the black-edged missive, and having read it, she jumped up from the chair, crying \"Hurray!\" and waving the note round her head.\n\"Hurray?\" said Rawdon, wondering at the little figure capering about in a streaming flannel dressing-gown, with tawny locks dishevelled. \"He's not left us anything, Becky. I had my share when I came of age.\"\n\"You'll never be of age, you silly old man,\" Becky replied. \"Run out now to Madam Brunoy's, for I must have some mourning: and get a crape on your hat, and a black waistcoat--I don't think you've got one; order it to be brought home to-morrow, so that we may be able to start on Thursday.\"\n\"You don't mean to go?\" Rawdon interposed.\n\"Of course I mean to go. I mean that Lady Jane shall present me at Court next year. I mean that your brother shall give you a seat in Parliament, you stupid old creature. I mean that Lord Steyne shall have your vote and his, my dear, old silly man; and that you shall be an Irish Secretary, or a West Indian Governor: or a Treasurer, or a Consul, or some such thing.\"\n\"Posting will cost a dooce of a lot of money,\" grumbled Rawdon.\n\"We might take Southdown's carriage, which ought to be present at the funeral, as he is a relation of the family: but, no--I intend that we shall go by the coach. They'll like it better. It seems more humble--\"\n\"Rawdy goes, of course?\" the Colonel asked.\n\"No such thing; why pay an extra place? He's too big to travel bodkin between you and me. Let him stay here in the nursery, and Briggs can make him a black frock. Go you, and do as I bid you. And you had best tell Sparks, your man, that old Sir Pitt is dead and that you will come in for something considerable when the affairs are arranged. He'll tell this to Raggles, who has been pressing for money, and it will console poor Raggles.\" And so Becky began sipping her chocolate.\nWhen the faithful Lord Steyne arrived in the evening, he found Becky and her companion, who was no other than our friend Briggs, busy cutting, ripping, snipping, and tearing all sorts of black stuffs available for the melancholy occasion.\n\"Miss Briggs and I are plunged in grief and despondency for the death of our Papa,\" Rebecca said. \"Sir Pitt Crawley is dead, my lord. We have been tearing our hair all the morning, and now we are tearing up our old clothes.\"\n\"Oh, Rebecca, how can you--\" was all that Briggs could say as she turned up her eyes.\n\"Oh, Rebecca, how can you--\" echoed my Lord. \"So that old scoundrel's dead, is he? He might have been a Peer if he had played his cards better. Mr. Pitt had very nearly made him; but he ratted always at the wrong time. What an old Silenus it was!\"\n\"I might have been Silenus's widow,\" said Rebecca. \"Don't you remember, Miss Briggs, how you peeped in at the door and saw old Sir Pitt on his knees to me?\" Miss Briggs, our old friend, blushed very much at this reminiscence, and was glad when Lord Steyne ordered her to go downstairs and make him a cup of tea.\nBriggs was the house-dog whom Rebecca had provided as guardian of her innocence and reputation. Miss Crawley had left her a little annuity. She would have been content to remain in the Crawley family with Lady Jane, who was good to her and to everybody; but Lady Southdown dismissed poor Briggs as quickly as decency permitted; and Mr. Pitt (who thought himself much injured by the uncalled-for generosity of his deceased relative towards a lady who had only been Miss Crawley's faithful retainer a score of years) made no objection to that exercise of the dowager's authority. Bowls and Firkin likewise received their legacies and their dismissals, and married and set up a lodging-house, according to the custom of their kind.\nBriggs tried to live with her relations in the country, but found that attempt was vain after the better society to which she had been accustomed. Briggs's friends, small tradesmen, in a country town, quarrelled over Miss Briggs's forty pounds a year as eagerly and more openly than Miss Crawley's kinsfolk had for that lady's inheritance. Briggs's brother, a radical hatter and grocer, called his sister a purse-proud aristocrat, because she would not advance a part of her capital to stock his shop; and she would have done so most likely, but that their sister, a dissenting shoemaker's lady, at variance with the hatter and grocer, who went to another chapel, showed how their brother was on the verge of bankruptcy, and took possession of Briggs for a while. The dissenting shoemaker wanted Miss Briggs to send his son to college and make a gentleman of him. Between them the two families got a great portion of her private savings out of her, and finally she fled to London followed by the anathemas of both, and determined to seek for servitude again as infinitely less onerous than liberty. And advertising in the papers that a \"Gentlewoman of agreeable manners, and accustomed to the best society, was anxious to,\" &c., she took up her residence with Mr. Bowls in Half Moon Street, and waited the result of the advertisement.\nSo it was that she fell in with Rebecca. Mrs. Rawdon's dashing little carriage and ponies was whirling down the street one day, just as Miss Briggs, fatigued, had reached Mr. Bowls's door, after a weary walk to the Times Office in the City to insert her advertisement for the sixth time. Rebecca was driving, and at once recognized the gentlewoman with agreeable manners, and being a perfectly good-humoured woman, as we have seen, and having a regard for Briggs, she pulled up the ponies at the doorsteps, gave the reins to the groom, and jumping out, had hold of both Briggs's hands, before she of the agreeable manners had recovered from the shock of seeing an old friend.\nBriggs cried, and Becky laughed a great deal and kissed the gentlewoman as soon as they got into the passage; and thence into Mrs. Bowls's front parlour, with the red moreen curtains, and the round looking-glass, with the chained eagle above, gazing upon the back of the ticket in the window which announced \"Apartments to Let.\"\nBriggs told all her history amidst those perfectly uncalled-for sobs and ejaculations of wonder with which women of her soft nature salute an old acquaintance, or regard a rencontre in the street; for though people meet other people every day, yet some there are who insist upon discovering miracles; and women, even though they have disliked each other, begin to cry when they meet, deploring and remembering the time when they last quarrelled. So, in a word, Briggs told all her history, and Becky gave a narrative of her own life, with her usual artlessness and candour.\nMrs. Bowls, late Firkin, came and listened grimly in the passage to the hysterical sniffling and giggling which went on in the front parlour. Becky had never been a favourite of hers. Since the establishment of the married couple in London they had frequented their former friends of the house of Raggles, and did not like the latter's account of the Colonel's menage. \"I wouldn't trust him, Ragg, my boy,\" Bowls remarked; and his wife, when Mrs. Rawdon issued from the parlour, only saluted the lady with a very sour curtsey; and her fingers were like so many sausages, cold and lifeless, when she held them out in deference to Mrs. Rawdon, who persisted in shaking hands with the retired lady's maid. She whirled away into Piccadilly, nodding with the sweetest of smiles towards Miss Briggs, who hung nodding at the window close under the advertisement-card, and at the next moment was in the park with a half-dozen of dandies cantering after her carriage.\nWhen she found how her friend was situated, and how having a snug legacy from Miss Crawley, salary was no object to our gentlewoman, Becky instantly formed some benevolent little domestic plans concerning her. This was just such a companion as would suit her establishment, and she invited Briggs to come to dinner with her that very evening, when she should see Becky's dear little darling Rawdon.\nMrs. Bowls cautioned her lodger against venturing into the lion's den, \"wherein you will rue it, Miss B., mark my words, and as sure as my name is Bowls.\" And Briggs promised to be very cautious. The upshot of which caution was that she went to live with Mrs. Rawdon the next week, and had lent Rawdon Crawley six hundred pounds upon annuity before six months were over.",
        "paragraph_chars": [
            [
                0,
                1357
            ],
            [
                1357,
                1879
            ],
            [
                1879,
                3230
            ],
            [
                3230,
                4479
            ],
            [
                4479,
                5522
            ],
            [
                5522,
                5755
            ],
            [
                5755,
                6029
            ],
            [
                6029,
                6436
            ],
            [
                6436,
                7143
            ],
            [
                7143,
                7231
            ],
            [
                7231,
                7331
            ],
            [
                7331,
                7380
            ],
            [
                7380,
                7446
            ],
            [
                7446,
                7512
            ],
            [
                7512,
                7565
            ],
            [
                7565,
                7794
            ],
            [
                7794,
                7856
            ],
            [
                7856,
                8076
            ],
            [
                8076,
                8356
            ],
            [
                8356,
                8439
            ],
            [
                8439,
                8550
            ],
            [
                8550,
                8801
            ],
            [
                8801,
                9116
            ],
            [
                9116,
                9636
            ],
            [
                9636,
                10520
            ],
            [
                10520,
                11066
            ],
            [
                11066,
                11270
            ],
            [
                11270,
                11632
            ],
            [
                11632,
                11789
            ],
            [
                11789,
                12050
            ],
            [
                12050,
                12258
            ],
            [
                12258,
                12548
            ],
            [
                12548,
                12591
            ],
            [
                12591,
                12959
            ],
            [
                12959,
                13023
            ],
            [
                13023,
                13234
            ],
            [
                13234,
                13278
            ],
            [
                13278,
                13758
            ],
            [
                13758,
                13997
            ],
            [
                13997,
                14222
            ],
            [
                14222,
                14308
            ],
            [
                14308,
                14556
            ],
            [
                14556,
                14868
            ],
            [
                14868,
                15597
            ],
            [
                15597,
                16932
            ],
            [
                16932,
                17608
            ],
            [
                17608,
                17937
            ],
            [
                17937,
                18511
            ],
            [
                18511,
                19470
            ],
            [
                19470,
                19869
            ],
            [
                19869,
                20239
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                318
            ],
            [
                318,
                356
            ],
            [
                356,
                657
            ],
            [
                657,
                847
            ],
            [
                847,
                1097
            ],
            [
                1097,
                1357
            ],
            [
                1357,
                1488
            ],
            [
                1488,
                1632
            ],
            [
                1632,
                1731
            ],
            [
                1731,
                1879
            ],
            [
                1879,
                2099
            ],
            [
                2099,
                2194
            ],
            [
                2194,
                2290
            ],
            [
                2290,
                2505
            ],
            [
                2505,
                2628
            ],
            [
                2628,
                2685
            ],
            [
                2685,
                3090
            ],
            [
                3090,
                3230
            ],
            [
                3230,
                3436
            ],
            [
                3436,
                3528
            ],
            [
                3528,
                4146
            ],
            [
                4146,
                4245
            ],
            [
                4245,
                4339
            ],
            [
                4339,
                4479
            ],
            [
                4479,
                4711
            ],
            [
                4711,
                4790
            ],
            [
                4790,
                4917
            ],
            [
                4917,
                5302
            ],
            [
                5302,
                5522
            ],
            [
                5522,
                5579
            ],
            [
                5579,
                5755
            ],
            [
                5755,
                5819
            ],
            [
                5819,
                6029
            ],
            [
                6029,
                6085
            ],
            [
                6085,
                6192
            ],
            [
                6192,
                6335
            ],
            [
                6335,
                6436
            ],
            [
                6436,
                6725
            ],
            [
                6725,
                6810
            ],
            [
                6810,
                6925
            ],
            [
                6925,
                7143
            ],
            [
                7143,
                7189
            ],
            [
                7189,
                7231
            ],
            [
                7231,
                7331
            ],
            [
                7331,
                7380
            ],
            [
                7380,
                7388
            ],
            [
                7388,
                7446
            ],
            [
                7446,
                7512
            ],
            [
                7512,
                7544
            ],
            [
                7544,
                7565
            ],
            [
                7565,
                7663
            ],
            [
                7663,
                7794
            ],
            [
                7794,
                7836
            ],
            [
                7836,
                7856
            ],
            [
                7856,
                8076
            ],
            [
                8076,
                8200
            ],
            [
                8200,
                8356
            ],
            [
                8356,
                8439
            ],
            [
                8439,
                8550
            ],
            [
                8550,
                8742
            ],
            [
                8742,
                8801
            ],
            [
                8801,
                8996
            ],
            [
                8996,
                9116
            ],
            [
                9116,
                9146
            ],
            [
                9146,
                9227
            ],
            [
                9227,
                9274
            ],
            [
                9274,
                9505
            ],
            [
                9505,
                9636
            ],
            [
                9636,
                9917
            ],
            [
                9917,
                9970
            ],
            [
                9970,
                10276
            ],
            [
                10276,
                10520
            ],
            [
                10520,
                10759
            ],
            [
                10759,
                11003
            ],
            [
                11003,
                11066
            ],
            [
                11066,
                11270
            ],
            [
                11270,
                11404
            ],
            [
                11404,
                11462
            ],
            [
                11462,
                11515
            ],
            [
                11515,
                11527
            ],
            [
                11527,
                11632
            ],
            [
                11632,
                11789
            ],
            [
                11789,
                11910
            ],
            [
                11910,
                12014
            ],
            [
                12014,
                12050
            ],
            [
                12050,
                12060
            ],
            [
                12060,
                12187
            ],
            [
                12187,
                12222
            ],
            [
                12222,
                12258
            ],
            [
                12258,
                12318
            ],
            [
                12318,
                12548
            ],
            [
                12548,
                12572
            ],
            [
                12572,
                12591
            ],
            [
                12591,
                12616
            ],
            [
                12616,
                12675
            ],
            [
                12675,
                12762
            ],
            [
                12762,
                12959
            ],
            [
                12959,
                13023
            ],
            [
                13023,
                13186
            ],
            [
                13186,
                13210
            ],
            [
                13210,
                13234
            ],
            [
                13234,
                13259
            ],
            [
                13259,
                13278
            ],
            [
                13278,
                13318
            ],
            [
                13318,
                13368
            ],
            [
                13368,
                13441
            ],
            [
                13441,
                13470
            ],
            [
                13470,
                13620
            ],
            [
                13620,
                13716
            ],
            [
                13716,
                13758
            ],
            [
                13758,
                13997
            ],
            [
                13997,
                14095
            ],
            [
                14095,
                14131
            ],
            [
                14131,
                14222
            ],
            [
                14222,
                14308
            ],
            [
                14308,
                14353
            ],
            [
                14353,
                14391
            ],
            [
                14391,
                14452
            ],
            [
                14452,
                14527
            ],
            [
                14527,
                14556
            ],
            [
                14556,
                14607
            ],
            [
                14607,
                14713
            ],
            [
                14713,
                14868
            ],
            [
                14868,
                14964
            ],
            [
                14964,
                15008
            ],
            [
                15008,
                15446
            ],
            [
                15446,
                15597
            ],
            [
                15597,
                15744
            ],
            [
                15744,
                15937
            ],
            [
                15937,
                16361
            ],
            [
                16361,
                16461
            ],
            [
                16461,
                16696
            ],
            [
                16696,
                16932
            ],
            [
                16932,
                16973
            ],
            [
                16973,
                17220
            ],
            [
                17220,
                17608
            ],
            [
                17608,
                17937
            ],
            [
                17937,
                18383
            ],
            [
                18383,
                18511
            ],
            [
                18511,
                18653
            ],
            [
                18653,
                18695
            ],
            [
                18695,
                18880
            ],
            [
                18880,
                19214
            ],
            [
                19214,
                19470
            ],
            [
                19470,
                19680
            ],
            [
                19680,
                19869
            ],
            [
                19869,
                20024
            ],
            [
                20024,
                20065
            ],
            [
                20065,
                20239
            ]
        ],
        "overlap_chars": [
            [
                141,
                194
            ],
            [
                244,
                254
            ],
            [
                195,
                243
            ],
            [
                278,
                288
            ],
            [
                303,
                317
            ],
            [
                318,
                356
            ],
            [
                360,
                452
            ],
            [
                489,
                497
            ],
            [
                463,
                484
            ],
            [
                527,
                534
            ],
            [
                550,
                591
            ],
            [
                608,
                657
            ],
            [
                657,
                686
            ],
            [
                715,
                747
            ],
            [
                779,
                780
            ],
            [
                791,
                803
            ],
            [
                812,
                819
            ],
            [
                845,
                847
            ],
            [
                847,
                863
            ],
            [
                892,
                911
            ],
            [
                957,
                960
            ],
            [
                920,
                934
            ],
            [
                947,
                955
            ],
            [
                863,
                864
            ],
            [
                1039,
                1059
            ],
            [
                874,
                875
            ],
            [
                1060,
                1090
            ],
            [
                1091,
                1096
            ],
            [
                1357,
                1368
            ],
            [
                1392,
                1431
            ],
            [
                1486,
                1488
            ],
            [
                1500,
                1506
            ],
            [
                1537,
                1541
            ],
            [
                1556,
                1632
            ],
            [
                1646,
                1731
            ],
            [
                1731,
                1806
            ],
            [
                1827,
                1857
            ],
            [
                1858,
                1879
            ],
            [
                1879,
                1955
            ],
            [
                1957,
                2024
            ],
            [
                2031,
                2036
            ],
            [
                2025,
                2030
            ],
            [
                2037,
                2057
            ],
            [
                2097,
                2099
            ],
            [
                2112,
                2116
            ],
            [
                2117,
                2166
            ],
            [
                2192,
                2194
            ],
            [
                2194,
                2218
            ],
            [
                2229,
                2290
            ],
            [
                2454,
                2463
            ],
            [
                2477,
                2503
            ],
            [
                2448,
                2449
            ],
            [
                2579,
                2601
            ],
            [
                2562,
                2564
            ],
            [
                2568,
                2569
            ],
            [
                2565,
                2568
            ],
            [
                2528,
                2531
            ],
            [
                2616,
                2628
            ],
            [
                2628,
                2659
            ],
            [
                2670,
                2685
            ],
            [
                2735,
                2777
            ],
            [
                2817,
                2831
            ],
            [
                2731,
                2734
            ],
            [
                2841,
                2860
            ],
            [
                2869,
                2881
            ],
            [
                2967,
                2969
            ],
            [
                2921,
                2929
            ],
            [
                2706,
                2709
            ],
            [
                2970,
                2982
            ],
            [
                2987,
                3015
            ],
            [
                3088,
                3089
            ],
            [
                3230,
                3236
            ],
            [
                3237,
                3245
            ],
            [
                3371,
                3372
            ],
            [
                3246,
                3267
            ],
            [
                3284,
                3306
            ],
            [
                3335,
                3340
            ],
            [
                3346,
                3371
            ],
            [
                3402,
                3420
            ],
            [
                3434,
                3436
            ],
            [
                3436,
                3460
            ],
            [
                3477,
                3528
            ],
            [
                3569,
                3612
            ],
            [
                3630,
                3656
            ],
            [
                3670,
                3690
            ],
            [
                3657,
                3660
            ],
            [
                3697,
                3716
            ],
            [
                3717,
                3799
            ],
            [
                4144,
                4145
            ],
            [
                4607,
                4609
            ],
            [
                4482,
                4554
            ],
            [
                4709,
                4711
            ],
            [
                4711,
                4758
            ],
            [
                4770,
                4790
            ],
            [
                4790,
                4800
            ],
            [
                4827,
                4873
            ],
            [
                4886,
                4917
            ],
            [
                4917,
                4965
            ],
            [
                4967,
                5037
            ],
            [
                5049,
                5112
            ],
            [
                5135,
                5161
            ],
            [
                5166,
                5272
            ],
            [
                5274,
                5302
            ],
            [
                5302,
                5338
            ],
            [
                5357,
                5374
            ],
            [
                5395,
                5404
            ],
            [
                5409,
                5417
            ],
            [
                5427,
                5442
            ],
            [
                5444,
                5522
            ],
            [
                5522,
                5557
            ],
            [
                5569,
                5579
            ],
            [
                5579,
                5597
            ],
            [
                5601,
                5617
            ],
            [
                5655,
                5724
            ],
            [
                5736,
                5743
            ],
            [
                5743,
                5755
            ],
            [
                5755,
                5819
            ],
            [
                5819,
                5846
            ],
            [
                5858,
                5872
            ],
            [
                5937,
                5940
            ],
            [
                5966,
                5967
            ],
            [
                5983,
                5986
            ],
            [
                5942,
                5966
            ],
            [
                5967,
                5981
            ],
            [
                5988,
                5991
            ],
            [
                5993,
                5996
            ],
            [
                6000,
                6029
            ],
            [
                6029,
                6073
            ],
            [
                6083,
                6085
            ],
            [
                6085,
                6150
            ],
            [
                6190,
                6192
            ],
            [
                6192,
                6218
            ],
            [
                6239,
                6252
            ],
            [
                6257,
                6264
            ],
            [
                6297,
                6334
            ],
            [
                6436,
                6519
            ],
            [
                6723,
                6725
            ],
            [
                6725,
                6809
            ],
            [
                7143,
                7173
            ],
            [
                7175,
                7189
            ],
            [
                7189,
                7231
            ],
            [
                7231,
                7244
            ],
            [
                7255,
                7257
            ],
            [
                7267,
                7303
            ],
            [
                7328,
                7331
            ],
            [
                7331,
                7335
            ],
            [
                7337,
                7340
            ],
            [
                7342,
                7380
            ],
            [
                7380,
                7388
            ],
            [
                7388,
                7446
            ],
            [
                7446,
                7498
            ],
            [
                7500,
                7512
            ],
            [
                7512,
                7544
            ],
            [
                7544,
                7565
            ],
            [
                7565,
                7663
            ],
            [
                7663,
                7664
            ],
            [
                7684,
                7689
            ],
            [
                7671,
                7677
            ],
            [
                7699,
                7704
            ],
            [
                7714,
                7794
            ],
            [
                7794,
                7836
            ],
            [
                7836,
                7856
            ],
            [
                7856,
                8017
            ],
            [
                8018,
                8022
            ],
            [
                8051,
                8076
            ],
            [
                8076,
                8095
            ],
            [
                8146,
                8200
            ],
            [
                8200,
                8356
            ],
            [
                8356,
                8439
            ],
            [
                8439,
                8529
            ],
            [
                8540,
                8550
            ],
            [
                8550,
                8551
            ],
            [
                8572,
                8577
            ],
            [
                8577,
                8583
            ],
            [
                8603,
                8627
            ],
            [
                8711,
                8713
            ],
            [
                8654,
                8676
            ],
            [
                8740,
                8742
            ],
            [
                8742,
                8772
            ],
            [
                8781,
                8796
            ],
            [
                8801,
                8823
            ],
            [
                8837,
                8848
            ],
            [
                8856,
                8901
            ],
            [
                8932,
                8996
            ],
            [
                8996,
                9012
            ],
            [
                9031,
                9046
            ],
            [
                9052,
                9058
            ],
            [
                9079,
                9116
            ],
            [
                9116,
                9146
            ],
            [
                9146,
                9180
            ],
            [
                9225,
                9227
            ],
            [
                9274,
                9317
            ],
            [
                9319,
                9326
            ],
            [
                9333,
                9361
            ],
            [
                9451,
                9505
            ],
            [
                9505,
                9537
            ],
            [
                9551,
                9580
            ],
            [
                9594,
                9625
            ],
            [
                9647,
                9651
            ],
            [
                9645,
                9646
            ],
            [
                9652,
                9678
            ],
            [
                9680,
                9683
            ],
            [
                9778,
                9781
            ],
            [
                9764,
                9771
            ],
            [
                9810,
                9917
            ],
            [
                9917,
                9970
            ],
            [
                9970,
                9988
            ],
            [
                10013,
                10016
            ],
            [
                9998,
                10007
            ],
            [
                10093,
                10156
            ],
            [
                10274,
                10276
            ],
            [
                10276,
                10491
            ],
            [
                10509,
                10512
            ],
            [
                10496,
                10505
            ],
            [
                10518,
                10520
            ],
            [
                10520,
                10565
            ],
            [
                10567,
                10638
            ],
            [
                10669,
                10680
            ],
            [
                10697,
                10720
            ],
            [
                10681,
                10692
            ],
            [
                10757,
                10758
            ],
            [
                10759,
                10774
            ],
            [
                10780,
                10839
            ],
            [
                10951,
                11001
            ],
            [
                11066,
                11095
            ],
            [
                11114,
                11124
            ],
            [
                11201,
                11215
            ],
            [
                11243,
                11270
            ],
            [
                11270,
                11289
            ],
            [
                11295,
                11321
            ],
            [
                11365,
                11367
            ],
            [
                11384,
                11391
            ],
            [
                11357,
                11364
            ],
            [
                11402,
                11404
            ],
            [
                11419,
                11422
            ],
            [
                11427,
                11442
            ],
            [
                11458,
                11461
            ],
            [
                11462,
                11515
            ],
            [
                11515,
                11527
            ],
            [
                11527,
                11632
            ],
            [
                11632,
                11692
            ],
            [
                11702,
                11716
            ],
            [
                11718,
                11758
            ],
            [
                11771,
                11788
            ],
            [
                11910,
                11966
            ],
            [
                11971,
                11980
            ],
            [
                11995,
                12014
            ],
            [
                12014,
                12050
            ],
            [
                12050,
                12060
            ],
            [
                12060,
                12155
            ],
            [
                12185,
                12187
            ],
            [
                12187,
                12222
            ],
            [
                12222,
                12258
            ],
            [
                12258,
                12318
            ],
            [
                12318,
                12330
            ],
            [
                12381,
                12388
            ],
            [
                12366,
                12370
            ],
            [
                12391,
                12431
            ],
            [
                12493,
                12494
            ],
            [
                12463,
                12471
            ],
            [
                12350,
                12353
            ],
            [
                12500,
                12548
            ],
            [
                12548,
                12571
            ],
            [
                12591,
                12616
            ],
            [
                12616,
                12622
            ],
            [
                12628,
                12637
            ],
            [
                12644,
                12675
            ],
            [
                12675,
                12681
            ],
            [
                12687,
                12699
            ],
            [
                12706,
                12762
            ],
            [
                12762,
                12768
            ],
            [
                12774,
                12785
            ],
            [
                12792,
                12806
            ],
            [
                12814,
                12823
            ],
            [
                12825,
                12843
            ],
            [
                12849,
                12907
            ],
            [
                12936,
                12959
            ],
            [
                12959,
                12960
            ],
            [
                12960,
                12964
            ],
            [
                12968,
                13014
            ],
            [
                13021,
                13022
            ],
            [
                13234,
                13258
            ],
            [
                13278,
                13281
            ],
            [
                13292,
                13301
            ],
            [
                13302,
                13318
            ],
            [
                13368,
                13401
            ],
            [
                13406,
                13412
            ],
            [
                13439,
                13441
            ],
            [
                13441,
                13443
            ],
            [
                13449,
                13470
            ],
            [
                13470,
                13498
            ],
            [
                13510,
                13565
            ],
            [
                13618,
                13620
            ],
            [
                13620,
                13630
            ],
            [
                13639,
                13673
            ],
            [
                13713,
                13716
            ],
            [
                13729,
                13758
            ],
            [
                13758,
                13762
            ],
            [
                13776,
                13908
            ],
            [
                13920,
                13923
            ],
            [
                13910,
                13918
            ],
            [
                13932,
                13956
            ],
            [
                13968,
                13997
            ],
            [
                14095,
                14129
            ],
            [
                14078,
                14094
            ],
            [
                14131,
                14160
            ],
            [
                14161,
                14222
            ],
            [
                14353,
                14389
            ],
            [
                14344,
                14351
            ],
            [
                14351,
                14352
            ],
            [
                14527,
                14546
            ],
            [
                14550,
                14556
            ],
            [
                14556,
                14607
            ],
            [
                14607,
                14713
            ],
            [
                14713,
                14724
            ],
            [
                14742,
                14759
            ],
            [
                14780,
                14868
            ],
            [
                14868,
                14909
            ],
            [
                14919,
                14937
            ],
            [
                14952,
                14964
            ],
            [
                14964,
                14985
            ],
            [
                14990,
                15008
            ],
            [
                15008,
                15045
            ],
            [
                15068,
                15103
            ],
            [
                15120,
                15150
            ],
            [
                15444,
                15446
            ],
            [
                15446,
                15556
            ],
            [
                15595,
                15597
            ],
            [
                15597,
                15667
            ],
            [
                15798,
                15813
            ],
            [
                15828,
                15858
            ],
            [
                15880,
                15907
            ],
            [
                15912,
                15937
            ],
            [
                15937,
                15953
            ],
            [
                15984,
                15990
            ],
            [
                16068,
                16071
            ],
            [
                16004,
                16015
            ],
            [
                16026,
                16057
            ],
            [
                16080,
                16098
            ],
            [
                16354,
                16359
            ],
            [
                15995,
                16001
            ],
            [
                16143,
                16147
            ],
            [
                16272,
                16321
            ],
            [
                16386,
                16412
            ],
            [
                16417,
                16431
            ],
            [
                16359,
                16360
            ],
            [
                16461,
                16533
            ],
            [
                16544,
                16576
            ],
            [
                16610,
                16611
            ],
            [
                16616,
                16673
            ],
            [
                16682,
                16696
            ],
            [
                16696,
                16820
            ],
            [
                16823,
                16851
            ],
            [
                16867,
                16869
            ],
            [
                16857,
                16866
            ],
            [
                16886,
                16891
            ],
            [
                16899,
                16909
            ],
            [
                16930,
                16932
            ],
            [
                16984,
                17010
            ],
            [
                17022,
                17079
            ],
            [
                17095,
                17119
            ],
            [
                17121,
                17159
            ],
            [
                17172,
                17220
            ],
            [
                17220,
                17227
            ],
            [
                17245,
                17263
            ],
            [
                17388,
                17394
            ],
            [
                17396,
                17420
            ],
            [
                17466,
                17484
            ],
            [
                17489,
                17516
            ],
            [
                17606,
                17608
            ],
            [
                17608,
                17639
            ],
            [
                17653,
                17663
            ],
            [
                18053,
                18056
            ],
            [
                17716,
                17721
            ],
            [
                17691,
                17695
            ],
            [
                17729,
                17761
            ],
            [
                17937,
                17964
            ],
            [
                17819,
                17825
            ],
            [
                18425,
                18485
            ],
            [
                18502,
                18510
            ],
            [
                19609,
                19618
            ],
            [
                19680,
                19728
            ],
            [
                19742,
                19766
            ],
            [
                19775,
                19869
            ],
            [
                18511,
                18575
            ],
            [
                18651,
                18652
            ],
            [
                18653,
                18694
            ],
            [
                19106,
                19109
            ],
            [
                18821,
                18833
            ],
            [
                18808,
                18815
            ],
            [
                18844,
                18871
            ],
            [
                18878,
                18879
            ],
            [
                18880,
                18917
            ],
            [
                19140,
                19141
            ],
            [
                19143,
                19144
            ],
            [
                18918,
                18964
            ],
            [
                18977,
                18989
            ],
            [
                18995,
                19036
            ],
            [
                19212,
                19213
            ],
            [
                19256,
                19304
            ],
            [
                19218,
                19247
            ],
            [
                18604,
                18607
            ],
            [
                19383,
                19415
            ],
            [
                19418,
                19422
            ],
            [
                19416,
                19417
            ],
            [
                19423,
                19428
            ],
            [
                19432,
                19470
            ],
            [
                19869,
                19889
            ],
            [
                19940,
                19941
            ],
            [
                19949,
                19988
            ],
            [
                20021,
                20024
            ],
            [
                20024,
                20065
            ],
            [
                20065,
                20075
            ],
            [
                20093,
                20239
            ]
        ],
        "row_chars": [
            [
                0,
                137
            ],
            [
                137,
                318
            ],
            [
                318,
                356
            ],
            [
                356,
                657
            ],
            [
                657,
                847
            ],
            [
                847,
                1097
            ],
            [
                1097,
                1357
            ],
            [
                1357,
                1488
            ],
            [
                1488,
                1632
            ],
            [
                1632,
                1731
            ],
            [
                1731,
                1879
            ],
            [
                1879,
                2099
            ],
            [
                2099,
                2194
            ],
            [
                2194,
                2290
            ],
            [
                2290,
                2628
            ],
            [
                2628,
                2685
            ],
            [
                2685,
                3090
            ],
            [
                3090,
                3230
            ],
            [
                3230,
                3436
            ],
            [
                3436,
                3528
            ],
            [
                3528,
                4146
            ],
            [
                4146,
                4245
            ],
            [
                4245,
                4339
            ],
            [
                4339,
                4479
            ],
            [
                4479,
                4711
            ],
            [
                4711,
                4790
            ],
            [
                4790,
                4917
            ],
            [
                4917,
                5302
            ],
            [
                5302,
                5522
            ],
            [
                5522,
                5579
            ],
            [
                5579,
                5755
            ],
            [
                5755,
                5819
            ],
            [
                5819,
                6029
            ],
            [
                6029,
                6085
            ],
            [
                6085,
                6192
            ],
            [
                6192,
                6335
            ],
            [
                6335,
                6436
            ],
            [
                6436,
                6725
            ],
            [
                6725,
                6810
            ],
            [
                6810,
                6925
            ],
            [
                6925,
                7143
            ],
            [
                7143,
                7189
            ],
            [
                7189,
                7231
            ],
            [
                7231,
                7331
            ],
            [
                7331,
                7380
            ],
            [
                7380,
                7388
            ],
            [
                7388,
                7446
            ],
            [
                7446,
                7512
            ],
            [
                7512,
                7544
            ],
            [
                7544,
                7565
            ],
            [
                7565,
                7663
            ],
            [
                7663,
                7794
            ],
            [
                7794,
                7836
            ],
            [
                7836,
                7856
            ],
            [
                7856,
                8076
            ],
            [
                8076,
                8200
            ],
            [
                8200,
                8356
            ],
            [
                8356,
                8439
            ],
            [
                8439,
                8550
            ],
            [
                8550,
                8742
            ],
            [
                8742,
                8801
            ],
            [
                8801,
                8996
            ],
            [
                8996,
                9116
            ],
            [
                9116,
                9146
            ],
            [
                9146,
                9227
            ],
            [
                9227,
                9274
            ],
            [
                9274,
                9505
            ],
            [
                9505,
                9636
            ],
            [
                9636,
                9917
            ],
            [
                9917,
                9970
            ],
            [
                9970,
                10276
            ],
            [
                10276,
                10520
            ],
            [
                10520,
                10759
            ],
            [
                10759,
                11003
            ],
            [
                11003,
                11066
            ],
            [
                11066,
                11270
            ],
            [
                11270,
                11404
            ],
            [
                11404,
                11462
            ],
            [
                11462,
                11515
            ],
            [
                11515,
                11527
            ],
            [
                11527,
                11632
            ],
            [
                11632,
                11789
            ],
            [
                11789,
                11910
            ],
            [
                11910,
                12014
            ],
            [
                12014,
                12050
            ],
            [
                12050,
                12060
            ],
            [
                12060,
                12187
            ],
            [
                12187,
                12222
            ],
            [
                12222,
                12258
            ],
            [
                12258,
                12318
            ],
            [
                12318,
                12548
            ],
            [
                12548,
                12572
            ],
            [
                12572,
                12591
            ],
            [
                12591,
                12616
            ],
            [
                12616,
                12675
            ],
            [
                12675,
                12762
            ],
            [
                12762,
                12959
            ],
            [
                12959,
                13023
            ],
            [
                13023,
                13186
            ],
            [
                13186,
                13210
            ],
            [
                13210,
                13234
            ],
            [
                13234,
                13259
            ],
            [
                13259,
                13278
            ],
            [
                13278,
                13318
            ],
            [
                13318,
                13368
            ],
            [
                13368,
                13441
            ],
            [
                13441,
                13470
            ],
            [
                13470,
                13620
            ],
            [
                13620,
                13716
            ],
            [
                13716,
                13758
            ],
            [
                13758,
                13997
            ],
            [
                13997,
                14131
            ],
            [
                14131,
                14222
            ],
            [
                14222,
                14308
            ],
            [
                14308,
                14391
            ],
            [
                14391,
                14452
            ],
            [
                14452,
                14527
            ],
            [
                14527,
                14556
            ],
            [
                14556,
                14607
            ],
            [
                14607,
                14713
            ],
            [
                14713,
                14868
            ],
            [
                14868,
                14964
            ],
            [
                14964,
                15008
            ],
            [
                15008,
                15446
            ],
            [
                15446,
                15597
            ],
            [
                15597,
                15937
            ],
            [
                15937,
                16461
            ],
            [
                16461,
                16696
            ],
            [
                16696,
                16932
            ],
            [
                16932,
                16973
            ],
            [
                16973,
                17220
            ],
            [
                17220,
                17608
            ],
            [
                17608,
                18511
            ],
            [
                18511,
                19869
            ],
            [
                19869,
                20024
            ],
            [
                20024,
                20065
            ],
            [
                20065,
                20239
            ]
        ]
    },
    "abridged": {
        "text": "Though the old Baronet survived many months, he never completely recovered the use of his intellect or his speech. The estate was governed by his elder son.\nIn a strange condition Pitt found it. Old Sir Pitt was always buying and mortgaging; he had twenty men of business, and quarrels with each. He had lawsuits with all his tenants, his lawyers, the Mining and Dock Companies in which he had a share, and with every person with whom he had business. To unravel these difficulties was a task worthy of the orderly Pitt, and he set to work. His whole family moved to Queen's Crawley, and Lady Southdown came too, bringing her irregular clergy, to the dismay of the angry Mrs. Bute.\nMrs. Bute's threats to Miss Betsy Horrocks were not carried out. Betsy's father took over the Crawley Arms in the village, of which he had got a lease from Sir Pitt. He had obtained a small freehold there likewise, which gave him a vote for the borough. The Rector had another of these votes, and these and four others formed the electorate which returned the two Members of Parliament for Queen's Crawley.\nThere was a show of courtesy kept up between the Rectory and the Hall ladies; between the younger ones at least, for Mrs. Bute and Lady Southdown could never meet without battles. Lady Southdown kept to her room when the ladies from the Rectory visited. Perhaps Mr. Pitt was not displeased at these occasional absences of his mamma-in-law. Sometimes she commanded him too much; to be treated as a boy at forty-six was mortifying. Lady Jane yielded up everything to her mother. It was lucky for her that Lady Southdown's meetings with ministers and correspondence with missionaries so occupied her that she had little time to devote to her grandchildren.\nAs for old Sir Pitt, he retired into those same rooms where Lady Crawley had lived, and was tended by Miss Hester with constant care. What love, what fidelity is there equal to that of a nurse with good wages? They get up at nights; they bear complaints; they see the sun shining and don't want to go out; they sleep on armchairs and eat their meals in solitude; they pass long long evenings doing nothing.\nOn sunshiny days this old gentleman was taken out in a chair on the terrace. Lady Jane always walked by the old man, and was a favourite with him. He used to smile when she came in, and utter inarticulate moans when she was going away. When the door shut upon her he would cry and sob - whereupon Hester's face and manner, which was always exceedingly bland while her lady was present, would change at once, and she would clench her fist and scream, \"Hold your tongue, you stoopid old fool,\" and twirl away his chair from the fire which he loved to look at - at which he would cry more. For this was all that was left after years of cunning, drinking, scheming and selfishness - a whimpering old idiot put in and out of bed and cleaned and fed like a baby.\nAt last a day came when the nurse's task was over. Early one morning, when Pitt Crawley was in the study, a knock came to the door, and Hester presented herself, curtseyed, and said,\n\"If you please, Sir Pitt, Sir Pitt died this morning, Sir Pitt. I was a-making of his toast for his gruel, and - and I thought I heard a moan like, Sir Pitt - and - and-\" She dropped another curtsey.\nWhat was it that made Pitt's pale face flush? Was it because he was Sir Pitt at last, with a seat in Parliament? \"I'll clear the estate now,\" he thought, rapidly calculating the improvements which he would make.\nAll the blinds were pulled down at the Hall and Rectory: the church bell was tolled. Miss Betsy, who was by this time married to a saddler at Mudbury, cried a good deal.\n\"Shall I write to your brother - or will you?\" asked Lady Jane of her husband, Sir Pitt.\n\"I will write,\" he said, \"and invite him to the funeral.\"\n\"And - and Mrs. Rawdon,\" said Lady Jane timidly.\n\"Jane!\" said Lady Southdown, \"how can you think of such a thing?\"\n\"Mrs. Rawdon must of course be asked,\" said Sir Pitt resolutely.\n\"Not whilst I am in the house!\" said Lady Southdown.\n\"Your Ladyship will be pleased to recollect that I am the head of this family,\" Sir Pitt replied. \"Lady Jane, please write to Mrs. Rawdon Crawley, requesting her presence upon this melancholy occasion.\"\n\"Jane, I forbid you to put pen to paper!\" cried the Countess.\n\"I believe I am the head of this family,\" Sir Pitt repeated; \"and however much I may regret any circumstance which may lead to your Ladyship quitting this house, I must govern it as I see fit.\"\nLady Southdown rose magnificently and ordered that horses might be put to her carriage. If her son and daughter turned her out of their house, she would hide her sorrows somewhere in loneliness and pray for their conversion to better thoughts.\n\"We don't turn you out of our house, Mamma,\" said the timid Lady Jane imploringly.\n\"You invite such company to it as no Christian lady should meet, and I will have my horses tomorrow morning.\"\n\"Please write this, Jane,\" said Sir Pitt, rising in an attitude of command. 'Queen's Crawley, September 14. My dear brother-'\"\nHearing these decisive words, Lady Southdown, who had been waiting for a sign of weakness from her son-in-law, rose and, with a scared look, left the library. Lady Jane looked as if she would follow, but Pitt forbade his wife to move.\n\"She won't go away,\" he said. \"She has let her house at Brighton. I have been waiting long for an opportunity to take this decisive step, my love; and now, if you please, we will resume the dictation. 'My dear brother, the melancholy news which it is my duty to convey must have been long anticipated,' etc.\"\nPitt, having come to his kingdom and his fortune, was determined to treat his family kindly and respectably and make a house of Queen's Crawley once more. It pleased him to think that he should be its chief. He proposed to use his influence to get his brother placed and his cousins decently provided for. In the course of three or four days' reign his bearing was changed and his plans quite fixed: he determined to rule justly and honestly, to depose Lady Southdown, and to be on the friendliest possible terms with all his relations.\nSo he dictated a letter to his brother Rawdon - a solemn and elaborate letter, containing the profoundest observations, and filling his simple little secretary with wonder.\n\"What an orator he will be,\" thought she, \"when he enters the House of Commons. How wise and good, and what a genius my husband is!\" The fact is, Pitt Crawley had composed the letter long before he dictated it to his astonished wife.\nThis letter, with a black border and seal, was sent to Colonel Rawdon Crawley. He was only half-pleased at receiving it.\n\"What's the use of going down to that stupid place?\" thought he. \"I can't stand being alone with Pitt after dinner, and horses there and back will cost us twenty pound.\"\nHe carried the letter, as he did all difficulties, to Becky, in her bedroom - with her chocolate, which he always made for her of a morning. She took up the black-edged missive, and having read it, jumped up, crying \"Hurray!\" and waving the note round her head.\n\"Hurray?\" said Rawdon, wondering at the little figure capering about in a streaming flannel dressing-gown. \"He's not left us anything, Becky. I had my share when I came of age.\"\n\"You'll never be of age, you silly old man,\" Becky replied. \"Run out now and get some black crape on your hat, and a black waistcoat - order it for tomorrow, so that we may be able to start on Thursday.\"\n\"You don't mean to go?\"\n\"Of course I mean to go. I mean Lady Jane to present me at Court next year. I mean your brother to give you a seat in Parliament, you stupid old creature. I mean Lord Steyne to have your vote, my dear old silly man; and you shall be an Irish Secretary, or a West Indian Governor, or some such thing.\"\n\"Going by post-chaise will cost a dooce of a lot of money,\" grumbled the Colonel. \"Rawdy goes, of course?\"\n\"No; why pay for an extra place? Let him stay here in the nursery, with Briggs. Go and do as I bid you. And you had best tell Sparks that old Sir Pitt is dead and that you will come in for some money. He'll tell Raggles, who has been pressing for rent.\" Becky began sipping her chocolate.\nWhen Lord Steyne arrived in the evening, he found Becky and her companion, who was no other than our friend Briggs, busy cutting, ripping and snipping all sorts of black stuff for the melancholy occasion.\n\"Sir Pitt Crawley is dead, my lord,\" Rebecca said. \"We have been tearing our hair with grief all the morning, and now we are tearing up our old clothes.\"\n\"So that old scoundrel's dead, is he?\" my Lord said. \"What an old Silenus he was!\"\n\"I might have been Silenus's widow,\" said Rebecca. \"Don't you remember, Miss Briggs, how you peeped in at the door and saw old Sir Pitt on his knees to me?\" Miss Briggs blushed very much, and was glad when Lord Steyne ordered her to go downstairs and make him a cup of tea.\nBriggs was the house-dog whom Rebecca had wanted as guardian of her reputation. Miss Crawley had left Briggs a little annuity. She would have been content to remain with Lady Jane, who was good to her; but Lady Southdown dismissed her. Bowls and Firkin likewise received their legacies and their dismissals, and married and set up a lodging-house.\nBriggs tried to live with her relations in the country, but found that her family quarrelled over her forty pounds a year as eagerly as Miss Crawley's kinsfolk had over that lady's inheritance. Briggs's brother called her purse-proud, because she would not advance her money to stock his shop; while her sister told her that their brother was on the verge of bankruptcy, and wanted Miss Briggs to send her own son to college.\nBetween them the two families got a great portion of her private savings, and finally she fled to London, determined to seek for servitude again as infinitely less burdensome than liberty. And advertising in the papers that a \"Gentlewoman of agreeable manners, and accustomed to the best society, was anxious to,\" etc., she took up her residence in Mr. Bowls's lodging-house, and awaited the result.\nRebecca's dashing little carriage was whirling down the street one day, just as Miss Briggs reached Mr. Bowls's door after a weary walk to the Times Office to insert her advertisement for the sixth time. Rebecca at once recognized Briggs. She pulled up the ponies, and jumping out, took hold of both Briggs's hands.\nBriggs cried, and Becky laughed and kissed her; and they went into Mrs. Bowls's front parlour, where Briggs told all her history, with sniffles, and Becky gave a narrative of her own life, with her usual candour. Becky instantly decided that this was just such a companion as would suit her, and she invited Briggs to dinner with her that very evening, when she should see Becky's dear little darling Rawdon.\nMrs. Bowls, late Firkin, came and listened grimly in the passage. Becky had never been a favourite of hers. She did not like Raggles's account of the Colonel's household.\n\"I wouldn't trust him, Ragg, my boy,\" Mr. Bowls remarked; and his wife, when Mrs. Rawdon left the parlour, saluted the lady with a very sour curtsey. With the sweetest of smiles towards Miss Briggs, Rebecca whirled away into Piccadilly, and next moment was in the park with half a dozen dandies cantering after her carriage.\nMrs. Bowls cautioned Miss Briggs: \"You will rue it, Miss B., mark my words.\" And Briggs promised to be very cautious. The upshot was that she went to live with Mrs. Rawdon the next week, and had lent Rawdon Crawley six hundred pounds upon annuity before six months were over.",
        "paragraph_chars": [
            [
                0,
                157
            ],
            [
                157,
                682
            ],
            [
                682,
                1089
            ],
            [
                1089,
                1743
            ],
            [
                1743,
                2150
            ],
            [
                2150,
                2907
            ],
            [
                2907,
                3090
            ],
            [
                3090,
                3290
            ],
            [
                3290,
                3502
            ],
            [
                3502,
                3672
            ],
            [
                3672,
                3761
            ],
            [
                3761,
                3819
            ],
            [
                3819,
                3868
            ],
            [
                3868,
                3934
            ],
            [
                3934,
                3999
            ],
            [
                3999,
                4052
            ],
            [
                4052,
                4255
            ],
            [
                4255,
                4317
            ],
            [
                4317,
                4511
            ],
            [
                4511,
                4755
            ],
            [
                4755,
                4838
            ],
            [
                4838,
                4948
            ],
            [
                4948,
                5075
            ],
            [
                5075,
                5310
            ],
            [
                5310,
                5619
            ],
            [
                5619,
                6156
            ],
            [
                6156,
                6329
            ],
            [
                6329,
                6563
            ],
            [
                6563,
                6684
            ],
            [
                6684,
                6854
            ],
            [
                6854,
                7116
            ],
            [
                7116,
                7294
            ],
            [
                7294,
                7498
            ],
            [
                7498,
                7522
            ],
            [
                7522,
                7823
            ],
            [
                7823,
                7930
            ],
            [
                7930,
                8219
            ],
            [
                8219,
                8424
            ],
            [
                8424,
                8578
            ],
            [
                8578,
                8661
            ],
            [
                8661,
                8935
            ],
            [
                8935,
                9283
            ],
            [
                9283,
                9709
            ],
            [
                9709,
                10109
            ],
            [
                10109,
                10425
            ],
            [
                10425,
                10834
            ],
            [
                10834,
                11005
            ],
            [
                11005,
                11330
            ],
            [
                11330,
                11605
            ]
        ],
        "segment_chars": [
            [
                0,
                115
            ],
            [
                115,
                157
            ],
            [
                157,
                195
            ],
            [
                195,
                297
            ],
            [
                297,
                452
            ],
            [
                452,
                541
            ],
            [
                541,
                682
            ],
            [
                682,
                747
            ],
            [
                747,
                848
            ],
            [
                848,
                936
            ],
            [
                936,
                1089
            ],
            [
                1089,
                1269
            ],
            [
                1269,
                1343
            ],
            [
                1343,
                1429
            ],
            [
                1429,
                1519
            ],
            [
                1519,
                1566
            ],
            [
                1566,
                1743
            ],
            [
                1743,
                1877
            ],
            [
                1877,
                1953
            ],
            [
                1953,
                2150
            ],
            [
                2150,
                2227
            ],
            [
                2227,
                2297
            ],
            [
                2297,
                2386
            ],
            [
                2386,
                2737
            ],
            [
                2737,
                2907
            ],
            [
                2907,
                2958
            ],
            [
                2958,
                3090
            ],
            [
                3090,
                3154
            ],
            [
                3154,
                3290
            ],
            [
                3290,
                3336
            ],
            [
                3336,
                3403
            ],
            [
                3403,
                3502
            ],
            [
                3502,
                3587
            ],
            [
                3587,
                3672
            ],
            [
                3672,
                3719
            ],
            [
                3719,
                3761
            ],
            [
                3761,
                3819
            ],
            [
                3819,
                3868
            ],
            [
                3868,
                3876
            ],
            [
                3876,
                3934
            ],
            [
                3934,
                3999
            ],
            [
                3999,
                4031
            ],
            [
                4031,
                4052
            ],
            [
                4052,
                4150
            ],
            [
                4150,
                4255
            ],
            [
                4255,
                4297
            ],
            [
                4297,
                4317
            ],
            [
                4317,
                4511
            ],
            [
                4511,
                4599
            ],
            [
                4599,
                4755
            ],
            [
                4755,
                4838
            ],
            [
                4838,
                4948
            ],
            [
                4948,
                5024
            ],
            [
                5024,
                5056
            ],
            [
                5056,
                5075
            ],
            [
                5075,
                5234
            ],
            [
                5234,
                5310
            ],
            [
                5310,
                5340
            ],
            [
                5340,
                5376
            ],
            [
                5376,
                5511
            ],
            [
                5511,
                5619
            ],
            [
                5619,
                5774
            ],
            [
                5774,
                5827
            ],
            [
                5827,
                5925
            ],
            [
                5925,
                6156
            ],
            [
                6156,
                6329
            ],
            [
                6329,
                6409
            ],
            [
                6409,
                6462
            ],
            [
                6462,
                6563
            ],
            [
                6563,
                6642
            ],
            [
                6642,
                6684
            ],
            [
                6684,
                6737
            ],
            [
                6737,
                6749
            ],
            [
                6749,
                6854
            ],
            [
                6854,
                6995
            ],
            [
                6995,
                7080
            ],
            [
                7080,
                7116
            ],
            [
                7116,
                7126
            ],
            [
                7126,
                7223
            ],
            [
                7223,
                7258
            ],
            [
                7258,
                7294
            ],
            [
                7294,
                7354
            ],
            [
                7354,
                7498
            ],
            [
                7498,
                7522
            ],
            [
                7522,
                7547
            ],
            [
                7547,
                7598
            ],
            [
                7598,
                7677
            ],
            [
                7677,
                7823
            ],
            [
                7823,
                7905
            ],
            [
                7905,
                7930
            ],
            [
                7930,
                7963
            ],
            [
                7963,
                8010
            ],
            [
                8010,
                8034
            ],
            [
                8034,
                8131
            ],
            [
                8131,
                8184
            ],
            [
                8184,
                8219
            ],
            [
                8219,
                8424
            ],
            [
                8424,
                8475
            ],
            [
                8475,
                8578
            ],
            [
                8578,
                8617
            ],
            [
                8617,
                8631
            ],
            [
                8631,
                8661
            ],
            [
                8661,
                8712
            ],
            [
                8712,
                8818
            ],
            [
                8818,
                8935
            ],
            [
                8935,
                9015
            ],
            [
                9015,
                9062
            ],
            [
                9062,
                9171
            ],
            [
                9171,
                9283
            ],
            [
                9283,
                9477
            ],
            [
                9477,
                9709
            ],
            [
                9709,
                9898
            ],
            [
                9898,
                10109
            ],
            [
                10109,
                10313
            ],
            [
                10313,
                10348
            ],
            [
                10348,
                10425
            ],
            [
                10425,
                10638
            ],
            [
                10638,
                10834
            ],
            [
                10834,
                10900
            ],
            [
                10900,
                10942
            ],
            [
                10942,
                11005
            ],
            [
                11005,
                11155
            ],
            [
                11155,
                11330
            ],
            [
                11330,
                11407
            ],
            [
                11407,
                11448
            ],
            [
                11448,
                11605
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                54,
                64
            ],
            [
                65,
                113
            ],
            [
                115,
                125
            ],
            [
                142,
                156
            ],
            [
                157,
                195
            ],
            [
                203,
                295
            ],
            [
                304,
                312
            ],
            [
                313,
                334
            ],
            [
                339,
                346
            ],
            [
                348,
                389
            ],
            [
                403,
                452
            ],
            [
                452,
                481
            ],
            [
                482,
                514
            ],
            [
                515,
                516
            ],
            [
                519,
                531
            ],
            [
                532,
                539
            ],
            [
                539,
                541
            ],
            [
                541,
                557
            ],
            [
                564,
                583
            ],
            [
                584,
                587
            ],
            [
                588,
                602
            ],
            [
                603,
                611
            ],
            [
                611,
                612
            ],
            [
                622,
                642
            ],
            [
                642,
                643
            ],
            [
                644,
                674
            ],
            [
                676,
                681
            ],
            [
                682,
                693
            ],
            [
                702,
                741
            ],
            [
                745,
                747
            ],
            [
                755,
                761
            ],
            [
                762,
                766
            ],
            [
                772,
                848
            ],
            [
                851,
                936
            ],
            [
                936,
                1011
            ],
            [
                1023,
                1053
            ],
            [
                1068,
                1089
            ],
            [
                1089,
                1165
            ],
            [
                1167,
                1234
            ],
            [
                1235,
                1240
            ],
            [
                1241,
                1246
            ],
            [
                1247,
                1267
            ],
            [
                1267,
                1269
            ],
            [
                1284,
                1288
            ],
            [
                1292,
                1341
            ],
            [
                1341,
                1343
            ],
            [
                1343,
                1367
            ],
            [
                1368,
                1429
            ],
            [
                1429,
                1438
            ],
            [
                1439,
                1465
            ],
            [
                1465,
                1466
            ],
            [
                1467,
                1489
            ],
            [
                1490,
                1492
            ],
            [
                1498,
                1499
            ],
            [
                1499,
                1502
            ],
            [
                1503,
                1506
            ],
            [
                1507,
                1519
            ],
            [
                1519,
                1550
            ],
            [
                1551,
                1566
            ],
            [
                1566,
                1608
            ],
            [
                1618,
                1632
            ],
            [
                1633,
                1636
            ],
            [
                1637,
                1656
            ],
            [
                1657,
                1669
            ],
            [
                1670,
                1672
            ],
            [
                1673,
                1681
            ],
            [
                1682,
                1685
            ],
            [
                1686,
                1698
            ],
            [
                1699,
                1727
            ],
            [
                1741,
                1742
            ],
            [
                1743,
                1749
            ],
            [
                1754,
                1762
            ],
            [
                1762,
                1763
            ],
            [
                1764,
                1785
            ],
            [
                1797,
                1819
            ],
            [
                1825,
                1830
            ],
            [
                1831,
                1856
            ],
            [
                1857,
                1875
            ],
            [
                1875,
                1877
            ],
            [
                1877,
                1901
            ],
            [
                1902,
                1953
            ],
            [
                1953,
                1996
            ],
            [
                1996,
                2022
            ],
            [
                2023,
                2043
            ],
            [
                2044,
                2047
            ],
            [
                2047,
                2066
            ],
            [
                2066,
                2148
            ],
            [
                2148,
                2149
            ],
            [
                2150,
                2152
            ],
            [
                2153,
                2225
            ],
            [
                2225,
                2227
            ],
            [
                2227,
                2274
            ],
            [
                2277,
                2297
            ],
            [
                2297,
                2307
            ],
            [
                2308,
                2354
            ],
            [
                2355,
                2386
            ],
            [
                2386,
                2434
            ],
            [
                2437,
                2507
            ],
            [
                2508,
                2571
            ],
            [
                2572,
                2598
            ],
            [
                2600,
                2706
            ],
            [
                2709,
                2737
            ],
            [
                2737,
                2773
            ],
            [
                2774,
                2791
            ],
            [
                2792,
                2801
            ],
            [
                2802,
                2810
            ],
            [
                2811,
                2826
            ],
            [
                2829,
                2907
            ],
            [
                2907,
                2942
            ],
            [
                2948,
                2958
            ],
            [
                2958,
                2976
            ],
            [
                2982,
                2998
            ],
            [
                2999,
                3068
            ],
            [
                3069,
                3076
            ],
            [
                3078,
                3090
            ],
            [
                3090,
                3154
            ],
            [
                3154,
                3181
            ],
            [
                3182,
                3196
            ],
            [
                3197,
                3200
            ],
            [
                3201,
                3202
            ],
            [
                3203,
                3206
            ],
            [
                3207,
                3231
            ],
            [
                3232,
                3246
            ],
            [
                3249,
                3252
            ],
            [
                3255,
                3258
            ],
            [
                3261,
                3290
            ],
            [
                3290,
                3334
            ],
            [
                3334,
                3336
            ],
            [
                3336,
                3401
            ],
            [
                3401,
                3403
            ],
            [
                3403,
                3429
            ],
            [
                3429,
                3442
            ],
            [
                3444,
                3451
            ],
            [
                3464,
                3501
            ],
            [
                3502,
                3585
            ],
            [
                3585,
                3587
            ],
            [
                3587,
                3671
            ],
            [
                3672,
                3702
            ],
            [
                3705,
                3719
            ],
            [
                3719,
                3761
            ],
            [
                3761,
                3774
            ],
            [
                3774,
                3776
            ],
            [
                3780,
                3816
            ],
            [
                3816,
                3819
            ],
            [
                3819,
                3823
            ],
            [
                3826,
                3829
            ],
            [
                3830,
                3868
            ],
            [
                3868,
                3876
            ],
            [
                3876,
                3934
            ],
            [
                3934,
                3986
            ],
            [
                3987,
                3999
            ],
            [
                3999,
                4031
            ],
            [
                4031,
                4052
            ],
            [
                4052,
                4150
            ],
            [
                4150,
                4151
            ],
            [
                4156,
                4161
            ],
            [
                4162,
                4168
            ],
            [
                4169,
                4174
            ],
            [
                4175,
                4255
            ],
            [
                4255,
                4297
            ],
            [
                4297,
                4317
            ],
            [
                4317,
                4478
            ],
            [
                4481,
                4485
            ],
            [
                4486,
                4511
            ],
            [
                4511,
                4530
            ],
            [
                4545,
                4599
            ],
            [
                4599,
                4755
            ],
            [
                4755,
                4838
            ],
            [
                4838,
                4928
            ],
            [
                4938,
                4948
            ],
            [
                4948,
                4949
            ],
            [
                4956,
                4961
            ],
            [
                4966,
                4972
            ],
            [
                4972,
                4996
            ],
            [
                4997,
                4999
            ],
            [
                5000,
                5022
            ],
            [
                5022,
                5024
            ],
            [
                5024,
                5054
            ],
            [
                5056,
                5071
            ],
            [
                5075,
                5097
            ],
            [
                5098,
                5109
            ],
            [
                5119,
                5164
            ],
            [
                5170,
                5234
            ],
            [
                5234,
                5250
            ],
            [
                5251,
                5266
            ],
            [
                5267,
                5273
            ],
            [
                5273,
                5310
            ],
            [
                5310,
                5340
            ],
            [
                5340,
                5374
            ],
            [
                5374,
                5376
            ],
            [
                5376,
                5419
            ],
            [
                5420,
                5427
            ],
            [
                5428,
                5456
            ],
            [
                5457,
                5511
            ],
            [
                5511,
                5543
            ],
            [
                5549,
                5578
            ],
            [
                5579,
                5610
            ],
            [
                5619,
                5623
            ],
            [
                5623,
                5624
            ],
            [
                5625,
                5651
            ],
            [
                5652,
                5655
            ],
            [
                5656,
                5659
            ],
            [
                5660,
                5667
            ],
            [
                5667,
                5774
            ],
            [
                5774,
                5827
            ],
            [
                5827,
                5845
            ],
            [
                5846,
                5849
            ],
            [
                5850,
                5859
            ],
            [
                5860,
                5923
            ],
            [
                5923,
                5925
            ],
            [
                5925,
                6140
            ],
            [
                6141,
                6144
            ],
            [
                6145,
                6154
            ],
            [
                6154,
                6156
            ],
            [
                6156,
                6201
            ],
            [
                6204,
                6275
            ],
            [
                6276,
                6287
            ],
            [
                6292,
                6315
            ],
            [
                6316,
                6327
            ],
            [
                6327,
                6328
            ],
            [
                6329,
                6344
            ],
            [
                6348,
                6407
            ],
            [
                6409,
                6459
            ],
            [
                6462,
                6491
            ],
            [
                6501,
                6511
            ],
            [
                6512,
                6526
            ],
            [
                6536,
                6563
            ],
            [
                6563,
                6582
            ],
            [
                6583,
                6609
            ],
            [
                6615,
                6617
            ],
            [
                6618,
                6625
            ],
            [
                6633,
                6640
            ],
            [
                6640,
                6642
            ],
            [
                6645,
                6648
            ],
            [
                6654,
                6669
            ],
            [
                6680,
                6683
            ],
            [
                6684,
                6737
            ],
            [
                6737,
                6749
            ],
            [
                6749,
                6854
            ],
            [
                6854,
                6914
            ],
            [
                6915,
                6929
            ],
            [
                6932,
                6972
            ],
            [
                6977,
                6994
            ],
            [
                6995,
                7051
            ],
            [
                7052,
                7061
            ],
            [
                7061,
                7080
            ],
            [
                7080,
                7116
            ],
            [
                7116,
                7126
            ],
            [
                7126,
                7221
            ],
            [
                7221,
                7223
            ],
            [
                7223,
                7258
            ],
            [
                7258,
                7294
            ],
            [
                7294,
                7354
            ],
            [
                7354,
                7366
            ],
            [
                7367,
                7374
            ],
            [
                7375,
                7379
            ],
            [
                7386,
                7426
            ],
            [
                7427,
                7428
            ],
            [
                7429,
                7437
            ],
            [
                7438,
                7441
            ],
            [
                7450,
                7498
            ],
            [
                7498,
                7521
            ],
            [
                7522,
                7547
            ],
            [
                7547,
                7553
            ],
            [
                7554,
                7563
            ],
            [
                7567,
                7598
            ],
            [
                7598,
                7604
            ],
            [
                7605,
                7617
            ],
            [
                7621,
                7677
            ],
            [
                7677,
                7683
            ],
            [
                7684,
                7695
            ],
            [
                7699,
                7713
            ],
            [
                7713,
                7722
            ],
            [
                7723,
                7741
            ],
            [
                7742,
                7800
            ],
            [
                7800,
                7823
            ],
            [
                7823,
                7824
            ],
            [
                7833,
                7837
            ],
            [
                7845,
                7891
            ],
            [
                7903,
                7904
            ],
            [
                7905,
                7929
            ],
            [
                7930,
                7933
            ],
            [
                7933,
                7942
            ],
            [
                7947,
                7963
            ],
            [
                7963,
                7996
            ],
            [
                8002,
                8008
            ],
            [
                8008,
                8010
            ],
            [
                8010,
                8012
            ],
            [
                8013,
                8034
            ],
            [
                8034,
                8062
            ],
            [
                8063,
                8118
            ],
            [
                8129,
                8131
            ],
            [
                8131,
                8141
            ],
            [
                8142,
                8176
            ],
            [
                8181,
                8184
            ],
            [
                8190,
                8219
            ],
            [
                8219,
                8223
            ],
            [
                8224,
                8356
            ],
            [
                8357,
                8360
            ],
            [
                8361,
                8369
            ],
            [
                8370,
                8394
            ],
            [
                8395,
                8424
            ],
            [
                8424,
                8458
            ],
            [
                8458,
                8474
            ],
            [
                8476,
                8505
            ],
            [
                8517,
                8578
            ],
            [
                8578,
                8614
            ],
            [
                8617,
                8624
            ],
            [
                8629,
                8630
            ],
            [
                8632,
                8651
            ],
            [
                8655,
                8661
            ],
            [
                8661,
                8712
            ],
            [
                8712,
                8818
            ],
            [
                8818,
                8829
            ],
            [
                8830,
                8847
            ],
            [
                8847,
                8935
            ],
            [
                8935,
                8976
            ],
            [
                8984,
                9002
            ],
            [
                9003,
                9015
            ],
            [
                9015,
                9036
            ],
            [
                9044,
                9062
            ],
            [
                9062,
                9099
            ],
            [
                9100,
                9135
            ],
            [
                9135,
                9165
            ],
            [
                9169,
                9171
            ],
            [
                9171,
                9281
            ],
            [
                9281,
                9283
            ],
            [
                9283,
                9353
            ],
            [
                9365,
                9380
            ],
            [
                9385,
                9415
            ],
            [
                9419,
                9446
            ],
            [
                9452,
                9477
            ],
            [
                9477,
                9493
            ],
            [
                9494,
                9500
            ],
            [
                9501,
                9504
            ],
            [
                9505,
                9516
            ],
            [
                9516,
                9547
            ],
            [
                9558,
                9576
            ],
            [
                9577,
                9582
            ],
            [
                9587,
                9593
            ],
            [
                9603,
                9607
            ],
            [
                9608,
                9657
            ],
            [
                9658,
                9684
            ],
            [
                9693,
                9707
            ],
            [
                9707,
                9708
            ],
            [
                9709,
                9781
            ],
            [
                9781,
                9813
            ],
            [
                9813,
                9814
            ],
            [
                9815,
                9872
            ],
            [
                9884,
                9898
            ],
            [
                9898,
                10022
            ],
            [
                10026,
                10054
            ],
            [
                10055,
                10057
            ],
            [
                10058,
                10067
            ],
            [
                10083,
                10088
            ],
            [
                10097,
                10107
            ],
            [
                10107,
                10109
            ],
            [
                10116,
                10142
            ],
            [
                10143,
                10200
            ],
            [
                10201,
                10225
            ],
            [
                10226,
                10264
            ],
            [
                10265,
                10313
            ],
            [
                10313,
                10320
            ],
            [
                10321,
                10339
            ],
            [
                10340,
                10346
            ],
            [
                10348,
                10372
            ],
            [
                10372,
                10390
            ],
            [
                10396,
                10423
            ],
            [
                10423,
                10425
            ],
            [
                10425,
                10456
            ],
            [
                10457,
                10467
            ],
            [
                10468,
                10471
            ],
            [
                10471,
                10476
            ],
            [
                10477,
                10481
            ],
            [
                10487,
                10519
            ],
            [
                10526,
                10553
            ],
            [
                10553,
                10559
            ],
            [
                10568,
                10628
            ],
            [
                10629,
                10637
            ],
            [
                10644,
                10653
            ],
            [
                10667,
                10715
            ],
            [
                10715,
                10739
            ],
            [
                10740,
                10834
            ],
            [
                10834,
                10898
            ],
            [
                10898,
                10899
            ],
            [
                10900,
                10941
            ],
            [
                10942,
                10945
            ],
            [
                10946,
                10958
            ],
            [
                10959,
                10966
            ],
            [
                10966,
                10993
            ],
            [
                11003,
                11004
            ],
            [
                11005,
                11042
            ],
            [
                11043,
                11044
            ],
            [
                11045,
                11046
            ],
            [
                11047,
                11093
            ],
            [
                11099,
                11111
            ],
            [
                11112,
                11153
            ],
            [
                11153,
                11154
            ],
            [
                11155,
                11203
            ],
            [
                11212,
                11241
            ],
            [
                11242,
                11245
            ],
            [
                11246,
                11278
            ],
            [
                11279,
                11283
            ],
            [
                11284,
                11285
            ],
            [
                11286,
                11291
            ],
            [
                11292,
                11330
            ],
            [
                11330,
                11350
            ],
            [
                11364,
                11365
            ],
            [
                11365,
                11404
            ],
            [
                11404,
                11407
            ],
            [
                11407,
                11448
            ],
            [
                11448,
                11458
            ],
            [
                11459,
                11605
            ]
        ],
        "row_chars": [
            [
                0,
                0
            ],
            [
                0,
                157
            ],
            [
                157,
                195
            ],
            [
                195,
                452
            ],
            [
                452,
                541
            ],
            [
                541,
                682
            ],
            [
                682,
                682
            ],
            [
                682,
                747
            ],
            [
                747,
                848
            ],
            [
                848,
                936
            ],
            [
                936,
                1089
            ],
            [
                1089,
                1269
            ],
            [
                1269,
                1343
            ],
            [
                1343,
                1429
            ],
            [
                1429,
                1519
            ],
            [
                1519,
                1566
            ],
            [
                1566,
                1743
            ],
            [
                1743,
                1743
            ],
            [
                1743,
                1877
            ],
            [
                1877,
                1953
            ],
            [
                1953,
                2150
            ],
            [
                2150,
                2150
            ],
            [
                2150,
                2150
            ],
            [
                2150,
                2150
            ],
            [
                2150,
                2227
            ],
            [
                2227,
                2297
            ],
            [
                2297,
                2386
            ],
            [
                2386,
                2737
            ],
            [
                2737,
                2907
            ],
            [
                2907,
                2958
            ],
            [
                2958,
                3090
            ],
            [
                3090,
                3154
            ],
            [
                3154,
                3290
            ],
            [
                3290,
                3336
            ],
            [
                3336,
                3403
            ],
            [
                3403,
                3502
            ],
            [
                3502,
                3502
            ],
            [
                3502,
                3587
            ],
            [
                3587,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3719
            ],
            [
                3719,
                3761
            ],
            [
                3761,
                3819
            ],
            [
                3819,
                3868
            ],
            [
                3868,
                3876
            ],
            [
                3876,
                3934
            ],
            [
                3934,
                3999
            ],
            [
                3999,
                4031
            ],
            [
                4031,
                4052
            ],
            [
                4052,
                4150
            ],
            [
                4150,
                4255
            ],
            [
                4255,
                4297
            ],
            [
                4297,
                4317
            ],
            [
                4317,
                4511
            ],
            [
                4511,
                4599
            ],
            [
                4599,
                4755
            ],
            [
                4755,
                4838
            ],
            [
                4838,
                4948
            ],
            [
                4948,
                5024
            ],
            [
                5024,
                5075
            ],
            [
                5075,
                5234
            ],
            [
                5234,
                5310
            ],
            [
                5310,
                5340
            ],
            [
                5340,
                5376
            ],
            [
                5376,
                5376
            ],
            [
                5376,
                5511
            ],
            [
                5511,
                5619
            ],
            [
                5619,
                5774
            ],
            [
                5774,
                5827
            ],
            [
                5827,
                5925
            ],
            [
                5925,
                6156
            ],
            [
                6156,
                6329
            ],
            [
                6329,
                6462
            ],
            [
                6462,
                6462
            ],
            [
                6462,
                6563
            ],
            [
                6563,
                6642
            ],
            [
                6642,
                6684
            ],
            [
                6684,
                6737
            ],
            [
                6737,
                6749
            ],
            [
                6749,
                6854
            ],
            [
                6854,
                6995
            ],
            [
                6995,
                6995
            ],
            [
                6995,
                7080
            ],
            [
                7080,
                7116
            ],
            [
                7116,
                7126
            ],
            [
                7126,
                7223
            ],
            [
                7223,
                7258
            ],
            [
                7258,
                7294
            ],
            [
                7294,
                7354
            ],
            [
                7354,
                7498
            ],
            [
                7498,
                7522
            ],
            [
                7522,
                7522
            ],
            [
                7522,
                7547
            ],
            [
                7547,
                7598
            ],
            [
                7598,
                7677
            ],
            [
                7677,
                7823
            ],
            [
                7823,
                7905
            ],
            [
                7905,
                7905
            ],
            [
                7905,
                7905
            ],
            [
                7905,
                7905
            ],
            [
                7905,
                7930
            ],
            [
                7930,
                7930
            ],
            [
                7930,
                7963
            ],
            [
                7963,
                7963
            ],
            [
                7963,
                8010
            ],
            [
                8010,
                8034
            ],
            [
                8034,
                8131
            ],
            [
                8131,
                8184
            ],
            [
                8184,
                8219
            ],
            [
                8219,
                8424
            ],
            [
                8424,
                8475
            ],
            [
                8475,
                8578
            ],
            [
                8578,
                8578
            ],
            [
                8578,
                8631
            ],
            [
                8631,
                8631
            ],
            [
                8631,
                8631
            ],
            [
                8631,
                8661
            ],
            [
                8661,
                8712
            ],
            [
                8712,
                8818
            ],
            [
                8818,
                8935
            ],
            [
                8935,
                9015
            ],
            [
                9015,
                9062
            ],
            [
                9062,
                9171
            ],
            [
                9171,
                9283
            ],
            [
                9283,
                9477
            ],
            [
                9477,
                9709
            ],
            [
                9709,
                9898
            ],
            [
                9898,
                10109
            ],
            [
                10109,
                10109
            ],
            [
                10109,
                10313
            ],
            [
                10313,
                10425
            ],
            [
                10425,
                10638
            ],
            [
                10638,
                11330
            ],
            [
                11330,
                11407
            ],
            [
                11407,
                11448
            ],
            [
                11448,
                11605
            ]
        ]
    }
}