{
    "original": {
        "text": "Considerable time has elapsed since we have seen our respectable friend, old Mr. Osborne of Russell Square. He has not been the happiest of mortals since last we met him. Events have occurred which have not improved his temper, and in more instances than one he has not been allowed to have his own way. To be thwarted in this reasonable desire was always very injurious to the old gentleman; and resistance became doubly exasperating when gout, age, loneliness, and the force of many disappointments combined to weigh him down. His stiff black hair began to grow quite white soon after his son's death; his face grew redder; his hands trembled more and more as he poured out his glass of port wine. He led his clerks a dire life in the City: his family at home were not much happier. I doubt if Rebecca, whom we have seen piously praying for Consols, would have exchanged her poverty and the dare-devil excitement and chances of her life for Osborne's money and the humdrum gloom which enveloped him. He had proposed for Miss Swartz, but had been rejected scornfully by the partisans of that lady, who married her to a young sprig of Scotch nobility. He was a man to have married a woman out of low life and bullied her dreadfully afterwards; but no person presented herself suitable to his taste, and, instead, he tyrannized over his unmarried daughter, at home. She had a fine carriage and fine horses and sat at the head of a table loaded with the grandest plate. She had a cheque-book, a prize footman to follow her when she walked, unlimited credit, and bows and compliments from all the tradesmen, and all the appurtenances of an heiress; but she spent a woeful time. The little charity-girls at the Foundling, the sweeperess at the crossing, the poorest under-kitchen-maid in the servants' hall, was happy compared to that unfortunate and now middle-aged young lady.\nFrederick Bullock, Esq., of the house of Bullock, Hulker, and Bullock, had married Maria Osborne, not without a great deal of difficulty and grumbling on Mr. Bullock's part. George being dead and cut out of his father's will, Frederick insisted that the half of the old gentleman's property should be settled upon his Maria, and indeed, for a long time, refused, \"to come to the scratch\" (it was Mr. Frederick's own expression) on any other terms. Osborne said Fred had agreed to take his daughter with twenty thousand, and he should bind himself to no more. \"Fred might take it, and welcome, or leave it, and go and be hanged.\" Fred, whose hopes had been raised when George had been disinherited, thought himself infamously swindled by the old merchant, and for some time made as if he would break off the match altogether. Osborne withdrew his account from Bullock and Hulker's, went on 'Change with a horsewhip which he swore he would lay across the back of a certain scoundrel that should be nameless, and demeaned himself in his usual violent manner. Jane Osborne condoled with her sister Maria during this family feud. \"I always told you, Maria, that it was your money he loved and not you,\" she said, soothingly.\n\"He selected me and my money at any rate; he didn't choose you and yours,\" replied Maria, tossing up her head.\nThe rapture was, however, only temporary. Fred's father and senior partners counselled him to take Maria, even with the twenty thousand settled, half down, and half at the death of Mr. Osborne, with the chances of the further division of the property. So he \"knuckled down,\" again to use his own phrase, and sent old Hulker with peaceable overtures to Osborne. It was his father, he said, who would not hear of the match, and had made the difficulties; he was most anxious to keep the engagement. The excuse was sulkily accepted by Mr. Osborne. Hulker and Bullock were a high family of the City aristocracy, and connected with the \"nobs\" at the West End. It was something for the old man to be able to say, \"My son, sir, of the house of Hulker, Bullock, and Co., sir; my daughter's cousin, Lady Mary Mango, sir, daughter of the Right Hon. The Earl of Castlemouldy.\" In his imagination he saw his house peopled by the \"nobs.\" So he forgave young Bullock and consented that the marriage should take place.\nIt was a grand affair--the bridegroom's relatives giving the breakfast, their habitations being near St. George's, Hanover Square, where the business took place. The \"nobs of the West End\" were invited, and many of them signed the book. Mr. Mango and Lady Mary Mango were there, with the dear young Gwendoline and Guinever Mango as bridesmaids; Colonel Bludyer of the Dragoon Guards (eldest son of the house of Bludyer Brothers, Mincing Lane), another cousin of the bridegroom, and the Honourable Mrs. Bludyer; the Honourable George Boulter, Lord Levant's son, and his lady, Miss Mango that was; Lord Viscount Castletoddy; Honourable James McMull and Mrs. McMull (formerly Miss Swartz); and a host of fashionables, who have all married into Lombard Street and done a great deal to ennoble Cornhill.\nThe young couple had a house near Berkeley Square and a small villa at Roehampton, among the banking colony there. Fred was considered to have made rather a mesalliance by the ladies of his family, whose grandfather had been in a Charity School, and who were allied through the husbands with some of the best blood in England. And Maria was bound, by superior pride and great care in the composition of her visiting-book, to make up for the defects of birth, and felt it her duty to see her father and sister as little as possible.\nThat she should utterly break with the old man, who had still so many scores of thousand pounds to give away, is absurd to suppose. Fred Bullock would never allow her to do that. But she was still young and incapable of hiding her feelings; and by inviting her papa and sister to her third-rate parties, and behaving very coldly to them when they came, and by avoiding Russell Square, and indiscreetly begging her father to quit that odious vulgar place, she did more harm than all Frederick's diplomacy could repair, and perilled her chance of her inheritance like a giddy heedless creature as she was.\n\"So Russell Square is not good enough for Mrs. Maria, hay?\" said the old gentleman, rattling up the carriage windows as he and his daughter drove away one night from Mrs. Frederick Bullock's, after dinner. \"So she invites her father and sister to a second day's dinner (if those sides, or ontrys, as she calls 'em, weren't served yesterday, I'm d--d), and to meet City folks and littery men, and keeps the Earls and the Ladies, and the Honourables to herself. Honourables? Damn Honourables. I am a plain British merchant I am, and could buy the beggarly hounds over and over. Lords, indeed!--why, at one of her swarreys I saw one of 'em speak to a dam fiddler--a fellar I despise. And they won't come to Russell Square, won't they? Why, I'll lay my life I've got a better glass of wine, and pay a better figure for it, and can show a handsomer service of silver, and can lay a better dinner on my mahogany, than ever they see on theirs--the cringing, sneaking, stuck-up fools. Drive on quick, James: I want to get back to Russell Square--ha, ha!\" and he sank back into the corner with a furious laugh. With such reflections on his own superior merit, it was the custom of the old gentleman not unfrequently to console himself.\nJane Osborne could not but concur in these opinions respecting her sister's conduct; and when Mrs. Frederick's first-born, Frederick Augustus Howard Stanley Devereux Bullock, was born, old Osborne, who was invited to the christening and to be godfather, contented himself with sending the child a gold cup, with twenty guineas inside it for the nurse. \"That's more than any of your Lords will give, I'LL warrant,\" he said and refused to attend at the ceremony.\nThe splendour of the gift, however, caused great satisfaction to the house of Bullock. Maria thought that her father was very much pleased with her, and Frederick augured the best for his little son and heir.\nOne can fancy the pangs with which Miss Osborne in her solitude in Russell Square read the Morning Post, where her sister's name occurred every now and then, in the articles headed \"Fashionable Reunions,\" and where she had an opportunity of reading a description of Mrs. F. Bullock's costume, when presented at the drawing room by Lady Frederica Bullock. Jane's own life, as we have said, admitted of no such grandeur. It was an awful existence. She had to get up of black winter's mornings to make breakfast for her scowling old father, who would have turned the whole house out of doors if his tea had not been ready at half-past eight. She remained silent opposite to him, listening to the urn hissing, and sitting in tremor while the parent read his paper and consumed his accustomed portion of muffins and tea. At half-past nine he rose and went to the City, and she was almost free till dinner-time, to make visitations in the kitchen and to scold the servants; to drive abroad and descend upon the tradesmen, who were prodigiously respectful; to leave her cards and her papa's at the great glum respectable houses of their City friends; or to sit alone in the large drawing-room, expecting visitors; and working at a huge piece of worsted by the fire, on the sofa, hard by the great Iphigenia clock, which ticked and tolled with mournful loudness in the dreary room. The great glass over the mantelpiece, faced by the other great console glass at the opposite end of the room, increased and multiplied between them the brown Holland bag in which the chandelier hung, until you saw these brown Holland bags fading away in endless perspectives, and this apartment of Miss Osborne's seemed the centre of a system of drawing-rooms. When she removed the cordovan leather from the grand piano and ventured to play a few notes on it, it sounded with a mournful sadness, startling the dismal echoes of the house. George's picture was gone, and laid upstairs in a lumber-room in the garret; and though there was a consciousness of him, and father and daughter often instinctively knew that they were thinking of him, no mention was ever made of the brave and once darling son.\nAt five o'clock Mr. Osborne came back to his dinner, which he and his daughter took in silence (seldom broken, except when he swore and was savage, if the cooking was not to his liking), or which they shared twice in a month with a party of dismal friends of Osborne's rank and age. Old Dr. Gulp and his lady from Bloomsbury Square; old Mr. Frowser, the attorney, from Bedford Row, a very great man, and from his business, hand-in-glove with the \"nobs at the West End\"; old Colonel Livermore, of the Bombay Army, and Mrs. Livermore, from Upper Bedford Place; old Sergeant Toffy and Mrs. Toffy; and sometimes old Sir Thomas Coffin and Lady Coffin, from Bedford Square. Sir Thomas was celebrated as a hanging judge, and the particular tawny port was produced when he dined with Mr. Osborne.\nThese people and their like gave the pompous Russell Square merchant pompous dinners back again. They had solemn rubbers of whist, when they went upstairs after drinking, and their carriages were called at half past ten. Many rich people, whom we poor devils are in the habit of envying, lead contentedly an existence like that above described. Jane Osborne scarcely ever met a man under sixty, and almost the only bachelor who appeared in their society was Mr. Smirk, the celebrated ladies' doctor.\nI can't say that nothing had occurred to disturb the monotony of this awful existence: the fact is, there had been a secret in poor Jane's life which had made her father more savage and morose than even nature, pride, and over-feeding had made him. This secret was connected with Miss Wirt, who had a cousin an artist, Mr. Smee, very celebrated since as a portrait-painter and R.A., but who once was glad enough to give drawing lessons to ladies of fashion. Mr. Smee has forgotten where Russell Square is now, but he was glad enough to visit it in the year 1818, when Miss Osborne had instruction from him.\nSmee (formerly a pupil of Sharpe of Frith Street, a dissolute, irregular, and unsuccessful man, but a man with great knowledge of his art) being the cousin of Miss Wirt, we say, and introduced by her to Miss Osborne, whose hand and heart were still free after various incomplete love affairs, felt a great attachment for this lady, and it is believed inspired one in her bosom. Miss Wirt was the confidante of this intrigue. I know not whether she used to leave the room where the master and his pupil were painting, in order to give them an opportunity for exchanging those vows and sentiments which cannot be uttered advantageously in the presence of a third party; I know not whether she hoped that should her cousin succeed in carrying off the rich merchant's daughter, he would give Miss Wirt a portion of the wealth which she had enabled him to win--all that is certain is that Mr. Osborne got some hint of the transaction, came back from the City abruptly, and entered the drawing-room with his bamboo cane; found the painter, the pupil, and the companion all looking exceedingly pale there; turned the former out of doors with menaces that he would break every bone in his skin, and half an hour afterwards dismissed Miss Wirt likewise, kicking her trunks down the stairs, trampling on her bandboxes, and shaking his fist at her hackney coach as it bore her away.\nJane Osborne kept her bedroom for many days. She was not allowed to have a companion afterwards. Her father swore to her that she should not have a shilling of his money if she made any match without his concurrence; and as he wanted a woman to keep his house, he did not choose that she should marry, so that she was obliged to give up all projects with which Cupid had any share. During her papa's life, then, she resigned herself to the manner of existence here described, and was content to be an old maid. Her sister, meanwhile, was having children with finer names every year and the intercourse between the two grew fainter continually. \"Jane and I do not move in the same sphere of life,\" Mrs. Bullock said. \"I regard her as a sister, of course\"--which means--what does it mean when a lady says that she regards Jane as a sister?\nIt has been described how the Misses Dobbin lived with their father at a fine villa at Denmark Hill, where there were beautiful graperies and peach-trees which delighted little Georgy Osborne. The Misses Dobbin, who drove often to Brompton to see our dear Amelia, came sometimes to Russell Square too, to pay a visit to their old acquaintance Miss Osborne. I believe it was in consequence of the commands of their brother the Major in India (for whom their papa had a prodigious respect), that they paid attention to Mrs. George; for the Major, the godfather and guardian of Amelia's little boy, still hoped that the child's grandfather might be induced to relent towards him and acknowledge him for the sake of his son. The Misses Dobbin kept Miss Osborne acquainted with the state of Amelia's affairs; how she was living with her father and mother; how poor they were; how they wondered what men, and such men as their brother and dear Captain Osborne, could find in such an insignificant little chit; how she was still, as heretofore, a namby-pamby milk-and-water affected creature--but how the boy was really the noblest little boy ever seen--for the hearts of all women warm towards young children, and the sourest spinster is kind to them.\nOne day, after great entreaties on the part of the Misses Dobbin, Amelia allowed little George to go and pass a day with them at Denmark Hill--a part of which day she spent herself in writing to the Major in India. She congratulated him on the happy news which his sisters had just conveyed to her. She prayed for his prosperity and that of the bride he had chosen. She thanked him for a thousand thousand kind offices and proofs of steadfast friendship to her in her affliction. She told him the last news about little Georgy, and how he was gone to spend that very day with his sisters in the country. She underlined the letter a great deal, and she signed herself affectionately his friend, Amelia Osborne. She forgot to send any message of kindness to Lady O'Dowd, as her wont was--and did not mention Glorvina by name, and only in italics, as the Major's BRIDE, for whom she begged blessings. But the news of the marriage removed the reserve which she had kept up towards him. She was glad to be able to own and feel how warmly and gratefully she regarded him--and as for the idea of being jealous of Glorvina (Glorvina, indeed!), Amelia would have scouted it, if an angel from heaven had hinted it to her. That night, when Georgy came back in the pony-carriage in which he rejoiced, and in which he was driven by Sir Wm. Dobbin's old coachman, he had round his neck a fine gold chain and watch. He said an old lady, not pretty, had given it him, who cried and kissed him a great deal. But he didn't like her. He liked grapes very much. And he only liked his mamma. Amelia shrank and started; the timid soul felt a presentiment of terror when she heard that the relations of the child's father had seen him.\nMiss Osborne came back to give her father his dinner. He had made a good speculation in the City, and was rather in a good humour that day, and chanced to remark the agitation under which she laboured. \"What's the matter, Miss Osborne?\" he deigned to say.\nThe woman burst into tears. \"Oh, sir,\" she said, \"I've seen little George. He is as beautiful as an angel--and so like him!\" The old man opposite to her did not say a word, but flushed up and began to tremble in every limb.",
        "paragraph_chars": [
            [
                0,
                1875
            ],
            [
                1875,
                3095
            ],
            [
                3095,
                3206
            ],
            [
                3206,
                4210
            ],
            [
                4210,
                5009
            ],
            [
                5009,
                5541
            ],
            [
                5541,
                6145
            ],
            [
                6145,
                7372
            ],
            [
                7372,
                7833
            ],
            [
                7833,
                8042
            ],
            [
                8042,
                10217
            ],
            [
                10217,
                11006
            ],
            [
                11006,
                11506
            ],
            [
                11506,
                12113
            ],
            [
                12113,
                13485
            ],
            [
                13485,
                14323
            ],
            [
                14323,
                15569
            ],
            [
                15569,
                17282
            ],
            [
                17282,
                17538
            ],
            [
                17538,
                17761
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                171
            ],
            [
                171,
                304
            ],
            [
                304,
                529
            ],
            [
                529,
                700
            ],
            [
                700,
                785
            ],
            [
                785,
                1002
            ],
            [
                1002,
                1152
            ],
            [
                1152,
                1365
            ],
            [
                1365,
                1468
            ],
            [
                1468,
                1675
            ],
            [
                1675,
                1875
            ],
            [
                1875,
                2049
            ],
            [
                2049,
                2323
            ],
            [
                2323,
                2434
            ],
            [
                2434,
                2504
            ],
            [
                2504,
                2700
            ],
            [
                2700,
                2931
            ],
            [
                2931,
                3000
            ],
            [
                3000,
                3095
            ],
            [
                3095,
                3206
            ],
            [
                3206,
                3248
            ],
            [
                3248,
                3458
            ],
            [
                3458,
                3567
            ],
            [
                3567,
                3703
            ],
            [
                3703,
                3751
            ],
            [
                3751,
                3861
            ],
            [
                3861,
                4072
            ],
            [
                4072,
                4131
            ],
            [
                4131,
                4210
            ],
            [
                4210,
                4372
            ],
            [
                4372,
                4447
            ],
            [
                4447,
                5009
            ],
            [
                5009,
                5124
            ],
            [
                5124,
                5336
            ],
            [
                5336,
                5541
            ],
            [
                5541,
                5673
            ],
            [
                5673,
                5720
            ],
            [
                5720,
                6145
            ],
            [
                6145,
                6205
            ],
            [
                6205,
                6351
            ],
            [
                6351,
                6605
            ],
            [
                6605,
                6618
            ],
            [
                6618,
                6636
            ],
            [
                6636,
                6721
            ],
            [
                6721,
                6826
            ],
            [
                6826,
                6877
            ],
            [
                6877,
                7122
            ],
            [
                7122,
                7192
            ],
            [
                7192,
                7247
            ],
            [
                7247,
                7372
            ],
            [
                7372,
                7724
            ],
            [
                7724,
                7833
            ],
            [
                7833,
                7920
            ],
            [
                7920,
                8042
            ],
            [
                8042,
                8397
            ],
            [
                8397,
                8461
            ],
            [
                8461,
                8488
            ],
            [
                8488,
                8681
            ],
            [
                8681,
                8858
            ],
            [
                8858,
                9416
            ],
            [
                9416,
                9777
            ],
            [
                9777,
                9954
            ],
            [
                9954,
                10217
            ],
            [
                10217,
                10500
            ],
            [
                10500,
                10885
            ],
            [
                10885,
                11006
            ],
            [
                11006,
                11103
            ],
            [
                11103,
                11227
            ],
            [
                11227,
                11351
            ],
            [
                11351,
                11506
            ],
            [
                11506,
                11755
            ],
            [
                11755,
                11964
            ],
            [
                11964,
                12113
            ],
            [
                12113,
                12491
            ],
            [
                12491,
                12538
            ],
            [
                12538,
                13485
            ],
            [
                13485,
                13530
            ],
            [
                13530,
                13582
            ],
            [
                13582,
                13867
            ],
            [
                13867,
                13996
            ],
            [
                13996,
                14129
            ],
            [
                14129,
                14201
            ],
            [
                14201,
                14323
            ],
            [
                14323,
                14516
            ],
            [
                14516,
                14680
            ],
            [
                14680,
                15044
            ],
            [
                15044,
                15569
            ],
            [
                15569,
                15784
            ],
            [
                15784,
                15868
            ],
            [
                15868,
                15935
            ],
            [
                15935,
                16049
            ],
            [
                16049,
                16173
            ],
            [
                16173,
                16279
            ],
            [
                16279,
                16467
            ],
            [
                16467,
                16551
            ],
            [
                16551,
                16702
            ],
            [
                16702,
                16781
            ],
            [
                16781,
                16896
            ],
            [
                16896,
                16970
            ],
            [
                16970,
                17060
            ],
            [
                17060,
                17084
            ],
            [
                17084,
                17111
            ],
            [
                17111,
                17140
            ],
            [
                17140,
                17282
            ],
            [
                17282,
                17336
            ],
            [
                17336,
                17484
            ],
            [
                17484,
                17519
            ],
            [
                17519,
                17538
            ],
            [
                17538,
                17566
            ],
            [
                17566,
                17613
            ],
            [
                17613,
                17663
            ],
            [
                17663,
                17761
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                30,
                48
            ],
            [
                73,
                108
            ],
            [
                108,
                139
            ],
            [
                169,
                171
            ],
            [
                259,
                269
            ],
            [
                270,
                302
            ],
            [
                226,
                231
            ],
            [
                304,
                326
            ],
            [
                338,
                355
            ],
            [
                371,
                396
            ],
            [
                415,
                466
            ],
            [
                485,
                500
            ],
            [
                519,
                528
            ],
            [
                529,
                532
            ],
            [
                539,
                563
            ],
            [
                570,
                644
            ],
            [
                659,
                671
            ],
            [
                676,
                700
            ],
            [
                1002,
                1067
            ],
            [
                1097,
                1098
            ],
            [
                1103,
                1110
            ],
            [
                1118,
                1152
            ],
            [
                1152,
                1182
            ],
            [
                1196,
                1199
            ],
            [
                1183,
                1188
            ],
            [
                1205,
                1250
            ],
            [
                1276,
                1284
            ],
            [
                1251,
                1275
            ],
            [
                1297,
                1302
            ],
            [
                1304,
                1354
            ],
            [
                1356,
                1365
            ],
            [
                1365,
                1392
            ],
            [
                1398,
                1404
            ],
            [
                1489,
                1559
            ],
            [
                1569,
                1603
            ],
            [
                1644,
                1653
            ],
            [
                1472,
                1475
            ],
            [
                1660,
                1674
            ],
            [
                1875,
                1892
            ],
            [
                1946,
                1972
            ],
            [
                1985,
                2025
            ],
            [
                2047,
                2049
            ],
            [
                2105,
                2124
            ],
            [
                2129,
                2203
            ],
            [
                2229,
                2236
            ],
            [
                2238,
                2264
            ],
            [
                2082,
                2085
            ],
            [
                2287,
                2323
            ],
            [
                2323,
                2401
            ],
            [
                2434,
                2435
            ],
            [
                2446,
                2454
            ],
            [
                2468,
                2470
            ],
            [
                2492,
                2504
            ],
            [
                2504,
                2508
            ],
            [
                2573,
                2608
            ],
            [
                2628,
                2647
            ],
            [
                2653,
                2700
            ],
            [
                2700,
                2754
            ],
            [
                2879,
                2884
            ],
            [
                2779,
                2784
            ],
            [
                2902,
                2930
            ],
            [
                3206,
                3209
            ],
            [
                3218,
                3248
            ],
            [
                3248,
                3261
            ],
            [
                3282,
                3311
            ],
            [
                3317,
                3341
            ],
            [
                3456,
                3458
            ],
            [
                3458,
                3463
            ],
            [
                3514,
                3518
            ],
            [
                3535,
                3554
            ],
            [
                3657,
                3658
            ],
            [
                3567,
                3598
            ],
            [
                3632,
                3640
            ],
            [
                3645,
                3657
            ],
            [
                3701,
                3703
            ],
            [
                3703,
                3751
            ],
            [
                3751,
                3817
            ],
            [
                3861,
                3877
            ],
            [
                3894,
                3899
            ],
            [
                3818,
                3832
            ],
            [
                3859,
                3860
            ],
            [
                4178,
                4190
            ],
            [
                4213,
                4231
            ],
            [
                4370,
                4372
            ],
            [
                4447,
                4487
            ],
            [
                4553,
                4592
            ],
            [
                4719,
                4750
            ],
            [
                4804,
                4923
            ],
            [
                5007,
                5009
            ],
            [
                5009,
                5124
            ],
            [
                5124,
                5165
            ],
            [
                5169,
                5177
            ],
            [
                5205,
                5206
            ],
            [
                5336,
                5345
            ],
            [
                5472,
                5541
            ],
            [
                5618,
                5620
            ],
            [
                5546,
                5549
            ],
            [
                5557,
                5610
            ],
            [
                5621,
                5649
            ],
            [
                5671,
                5673
            ],
            [
                5673,
                5720
            ],
            [
                5720,
                5723
            ],
            [
                5786,
                5929
            ],
            [
                5943,
                5974
            ],
            [
                5982,
                6057
            ],
            [
                6143,
                6145
            ],
            [
                6145,
                6205
            ],
            [
                6205,
                6228
            ],
            [
                6262,
                6284
            ],
            [
                6285,
                6315
            ],
            [
                6326,
                6335
            ],
            [
                6349,
                6351
            ],
            [
                6830,
                6877
            ],
            [
                6877,
                6883
            ],
            [
                6900,
                6907
            ],
            [
                6910,
                6916
            ],
            [
                6926,
                6935
            ],
            [
                6977,
                7011
            ],
            [
                7020,
                7041
            ],
            [
                7050,
                7080
            ],
            [
                7082,
                7120
            ],
            [
                7461,
                7488
            ],
            [
                7493,
                7604
            ],
            [
                7615,
                7625
            ],
            [
                7798,
                7815
            ],
            [
                7831,
                7832
            ],
            [
                7786,
                7788
            ],
            [
                7657,
                7723
            ],
            [
                7920,
                7980
            ],
            [
                8040,
                8042
            ],
            [
                8042,
                8081
            ],
            [
                8082,
                8089
            ],
            [
                8124,
                8179
            ],
            [
                8200,
                8260
            ],
            [
                8291,
                8333
            ],
            [
                8395,
                8397
            ],
            [
                8397,
                8430
            ],
            [
                8464,
                8488
            ],
            [
                8488,
                8505
            ],
            [
                8509,
                8521
            ],
            [
                8524,
                8578
            ],
            [
                8679,
                8681
            ],
            [
                8681,
                8684
            ],
            [
                8694,
                8700
            ],
            [
                8748,
                8751
            ],
            [
                8701,
                8709
            ],
            [
                8713,
                8717
            ],
            [
                8770,
                8775
            ],
            [
                8787,
                8818
            ],
            [
                8841,
                8857
            ],
            [
                8858,
                8878
            ],
            [
                8888,
                8950
            ],
            [
                8956,
                8961
            ],
            [
                8971,
                8986
            ],
            [
                8990,
                9018
            ],
            [
                8987,
                8989
            ],
            [
                9043,
                9056
            ],
            [
                9090,
                9110
            ],
            [
                9126,
                9228
            ],
            [
                9239,
                9247
            ],
            [
                9056,
                9057
            ],
            [
                9249,
                9279
            ],
            [
                9322,
                9331
            ],
            [
                9342,
                9347
            ],
            [
                9355,
                9416
            ],
            [
                9954,
                9980
            ],
            [
                9985,
                9998
            ],
            [
                10016,
                10041
            ],
            [
                10080,
                10105
            ],
            [
                10149,
                10188
            ],
            [
                10199,
                10217
            ],
            [
                10217,
                10311
            ],
            [
                10326,
                10327
            ],
            [
                10404,
                10430
            ],
            [
                10434,
                10485
            ],
            [
                10495,
                10498
            ],
            [
                10500,
                10525
            ],
            [
                10363,
                10364
            ],
            [
                10550,
                10580
            ],
            [
                10687,
                10728
            ],
            [
                10774,
                10846
            ],
            [
                10597,
                10598
            ],
            [
                10368,
                10371
            ],
            [
                10900,
                10910
            ],
            [
                10916,
                10929
            ],
            [
                10498,
                10499
            ],
            [
                11006,
                11018
            ],
            [
                11075,
                11090
            ],
            [
                11019,
                11022
            ],
            [
                11108,
                11135
            ],
            [
                11175,
                11227
            ],
            [
                11351,
                11399
            ],
            [
                11504,
                11506
            ],
            [
                11597,
                11601
            ],
            [
                11606,
                11703
            ],
            [
                11753,
                11755
            ],
            [
                11755,
                11813
            ],
            [
                11814,
                11878
            ],
            [
                11889,
                11901
            ],
            [
                11926,
                11964
            ],
            [
                11964,
                12067
            ],
            [
                12111,
                12113
            ],
            [
                12295,
                12308
            ],
            [
                12272,
                12281
            ],
            [
                12313,
                12329
            ],
            [
                12406,
                12433
            ],
            [
                12309,
                12312
            ],
            [
                12161,
                12162
            ],
            [
                12449,
                12463
            ],
            [
                12489,
                12491
            ],
            [
                12491,
                12504
            ],
            [
                12509,
                12519
            ],
            [
                12536,
                12538
            ],
            [
                12538,
                12651
            ],
            [
                12779,
                12780
            ],
            [
                12969,
                13008
            ],
            [
                13043,
                13076
            ],
            [
                13081,
                13105
            ],
            [
                12885,
                12886
            ],
            [
                13128,
                13156
            ],
            [
                13158,
                13204
            ],
            [
                13210,
                13247
            ],
            [
                12961,
                12963
            ],
            [
                13270,
                13347
            ],
            [
                13356,
                13376
            ],
            [
                13420,
                13485
            ],
            [
                13485,
                13502
            ],
            [
                13503,
                13530
            ],
            [
                13530,
                13582
            ],
            [
                13582,
                13598
            ],
            [
                13606,
                13641
            ],
            [
                13655,
                13688
            ],
            [
                13700,
                13785
            ],
            [
                13865,
                13867
            ],
            [
                13867,
                13920
            ],
            [
                13935,
                13944
            ],
            [
                13994,
                13996
            ],
            [
                13996,
                14066
            ],
            [
                14067,
                14070
            ],
            [
                14127,
                14128
            ],
            [
                14323,
                14423
            ],
            [
                14441,
                14476
            ],
            [
                14483,
                14516
            ],
            [
                14516,
                14569
            ],
            [
                14579,
                14642
            ],
            [
                14666,
                14680
            ],
            [
                14690,
                14696
            ],
            [
                14715,
                14763
            ],
            [
                14812,
                14821
            ],
            [
                14898,
                14904
            ],
            [
                14851,
                14852
            ],
            [
                14882,
                14885
            ],
            [
                15198,
                15202
            ],
            [
                15062,
                15125
            ],
            [
                15379,
                15380
            ],
            [
                15127,
                15197
            ],
            [
                15331,
                15344
            ],
            [
                15297,
                15313
            ],
            [
                15363,
                15374
            ],
            [
                15399,
                15407
            ],
            [
                15383,
                15384
            ],
            [
                15409,
                15412
            ],
            [
                15417,
                15468
            ],
            [
                15567,
                15569
            ],
            [
                15569,
                15576
            ],
            [
                15635,
                15689
            ],
            [
                15616,
                15633
            ],
            [
                15712,
                15741
            ],
            [
                15750,
                15784
            ],
            [
                15784,
                15850
            ],
            [
                15863,
                15866
            ],
            [
                15898,
                15901
            ],
            [
                15872,
                15886
            ],
            [
                15914,
                15919
            ],
            [
                15887,
                15897
            ],
            [
                15933,
                15935
            ],
            [
                15935,
                15965
            ],
            [
                15988,
                15991
            ],
            [
                16053,
                16065
            ],
            [
                16071,
                16095
            ],
            [
                16171,
                16173
            ],
            [
                16217,
                16279
            ],
            [
                16551,
                16577
            ],
            [
                16591,
                16633
            ],
            [
                16635,
                16701
            ],
            [
                16779,
                16780
            ],
            [
                16781,
                16835
            ],
            [
                16917,
                16970
            ],
            [
                16970,
                16989
            ],
            [
                17003,
                17020
            ],
            [
                17025,
                17060
            ],
            [
                17060,
                17084
            ],
            [
                17084,
                17099
            ],
            [
                17109,
                17111
            ],
            [
                17154,
                17157
            ],
            [
                17147,
                17153
            ],
            [
                17187,
                17231
            ],
            [
                17268,
                17282
            ],
            [
                17282,
                17304
            ],
            [
                17305,
                17336
            ],
            [
                17336,
                17338
            ],
            [
                17384,
                17387
            ],
            [
                17367,
                17369
            ],
            [
                17388,
                17394
            ],
            [
                17398,
                17425
            ],
            [
                17378,
                17379
            ],
            [
                17434,
                17436
            ],
            [
                17484,
                17518
            ],
            [
                17548,
                17566
            ],
            [
                17566,
                17574
            ],
            [
                17585,
                17586
            ],
            [
                17588,
                17613
            ],
            [
                17613,
                17643
            ],
            [
                17645,
                17663
            ],
            [
                17663,
                17674
            ],
            [
                17691,
                17714
            ],
            [
                17730,
                17761
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                171
            ],
            [
                171,
                529
            ],
            [
                529,
                700
            ],
            [
                700,
                785
            ],
            [
                785,
                1002
            ],
            [
                1002,
                1152
            ],
            [
                1152,
                1365
            ],
            [
                1365,
                1675
            ],
            [
                1675,
                1875
            ],
            [
                1875,
                2049
            ],
            [
                2049,
                2323
            ],
            [
                2323,
                2504
            ],
            [
                2504,
                2700
            ],
            [
                2700,
                2931
            ],
            [
                2931,
                3000
            ],
            [
                3000,
                3095
            ],
            [
                3095,
                3206
            ],
            [
                3206,
                3248
            ],
            [
                3248,
                3458
            ],
            [
                3458,
                3703
            ],
            [
                3703,
                3751
            ],
            [
                3751,
                4072
            ],
            [
                4072,
                4131
            ],
            [
                4131,
                4372
            ],
            [
                4372,
                4447
            ],
            [
                4447,
                5009
            ],
            [
                5009,
                5124
            ],
            [
                5124,
                5541
            ],
            [
                5541,
                5673
            ],
            [
                5673,
                5720
            ],
            [
                5720,
                6145
            ],
            [
                6145,
                6205
            ],
            [
                6205,
                6351
            ],
            [
                6351,
                6605
            ],
            [
                6605,
                6618
            ],
            [
                6618,
                6636
            ],
            [
                6636,
                6721
            ],
            [
                6721,
                6826
            ],
            [
                6826,
                6877
            ],
            [
                6877,
                7122
            ],
            [
                7122,
                7192
            ],
            [
                7192,
                7247
            ],
            [
                7247,
                7372
            ],
            [
                7372,
                7833
            ],
            [
                7833,
                7920
            ],
            [
                7920,
                8042
            ],
            [
                8042,
                8397
            ],
            [
                8397,
                8488
            ],
            [
                8488,
                8681
            ],
            [
                8681,
                8858
            ],
            [
                8858,
                9416
            ],
            [
                9416,
                9777
            ],
            [
                9777,
                9954
            ],
            [
                9954,
                10217
            ],
            [
                10217,
                11006
            ],
            [
                11006,
                11227
            ],
            [
                11227,
                11351
            ],
            [
                11351,
                11506
            ],
            [
                11506,
                11755
            ],
            [
                11755,
                11964
            ],
            [
                11964,
                12113
            ],
            [
                12113,
                12491
            ],
            [
                12491,
                12538
            ],
            [
                12538,
                13485
            ],
            [
                13485,
                13530
            ],
            [
                13530,
                13582
            ],
            [
                13582,
                13867
            ],
            [
                13867,
                13996
            ],
            [
                13996,
                14129
            ],
            [
                14129,
                14201
            ],
            [
                14201,
                14323
            ],
            [
                14323,
                14516
            ],
            [
                14516,
                14680
            ],
            [
                14680,
                15569
            ],
            [
                15569,
                15784
            ],
            [
                15784,
                15935
            ],
            [
                15935,
                16173
            ],
            [
                16173,
                16279
            ],
            [
                16279,
                16467
            ],
            [
                16467,
                16551
            ],
            [
                16551,
                16702
            ],
            [
                16702,
                16781
            ],
            [
                16781,
                16970
            ],
            [
                16970,
                17060
            ],
            [
                17060,
                17084
            ],
            [
                17084,
                17111
            ],
            [
                17111,
                17140
            ],
            [
                17140,
                17282
            ],
            [
                17282,
                17336
            ],
            [
                17336,
                17519
            ],
            [
                17519,
                17538
            ],
            [
                17538,
                17566
            ],
            [
                17566,
                17613
            ],
            [
                17613,
                17663
            ],
            [
                17663,
                17761
            ]
        ]
    },
    "abridged": {
        "text": "Considerable time has passed since we have seen old Mr. Osborne of Russell Square. He has not been the happiest of men. He has not always been allowed to have his own way, and to be thwarted in this desire was always harmful to the old gentleman; and it was doubly exasperating when gout, age, loneliness, and disappointments weighed him down.\nHis black hair began to grow white soon after his son's death; his face grew redder; his hands trembled as he poured his glass of port wine. He had proposed for Miss Swartz, but had been rejected scornfully, and she had married a young sprig of Scotch nobility. He was a man to have married a low-born woman and bullied her dreadfully afterwards; but no suitable person presented herself, and instead, he tyrannized over his unmarried daughter at home. She had a fine carriage and horses, a prize footman to follow her when she walked, unlimited credit, and compliments from all the tradesmen; but she had a woeful time.\nFrederick Bullock had married Maria Osborne, after a great deal of difficulty and grumbling. Frederick insisted that half of the old gentleman's property should be settled upon his Maria, and refused \"to come to the scratch\" (his own expression) on any other terms. Osborne said Fred had agreed to take his daughter with twenty thousand, and he could \"take it, or be hanged.\" Fred thought himself infamously swindled, and for some time acted as if he would break off the match altogether. Osborne withdrew his account from Bullock and Hulker's bank, and talked about horsewhipping in his usual violent manner.\nThe rupture was, however, only temporary. Fred's father counselled him to take Maria, with the twenty thousand. So he sent off peaceable overtures; it was his father, he said, who had made difficulties. The excuse was sulkily accepted by Mr. Osborne. Hulker and Bullock were a high family of the City aristocracy, and it was something to be connected with them.\nThe marriage was a grand affair. Mr. Mango and Lady Mary Mango were there; Colonel Bludyer of the Dragoon Guards; the Honourable George Boulter; Lord Viscount Castletoddy; Honourable James McMull and Mrs. McMull (formerly Miss Swartz); and a host of fashionables.\nThe young couple had a house near Berkeley Square and a small villa at Roehampton, among the banking colony there. Fred was considered to have made rather a msalliance, and Maria felt it her duty to see her father and sister as little as possible.\nOf course she would not utterly break with the old man, who had still so many thousand pounds to give away. Fred Bullock would never allow her to do that. But by inviting her papa and sister to her third-rate parties, and behaving very coldly to them when they came, and by avoiding Russell Square, and begging her father to quit that vulgar place, she did more harm than all Frederick's diplomacy could repair.\n\"So Russell Square is not good enough for Mrs. Maria, hay?\" said the old gentleman, as he and his daughter Jane drove away one night from Mrs. Bullock's. \"So they won't come to Russell Square, won't they? Why, I've got better wine, and a handsomer service of silver, and a better dinner on my table, than ever they see on theirs - the cringing, sneaking, stuck-up fools.\"\nWhen Mrs. Frederick's first child, Frederick Augustus Howard Stanley Devereux Bullock, was born, old Osborne, who was invited to the christening as godfather, refused to attend. He merely sent the child a gold cup, with twenty guineas inside it for the nurse. Yet Maria thought that her father was very much pleased with her.\nOne can fancy the pangs with which Miss Jane Osborne read the Morning Post, where her sister's name occurred in the articles headed \"Fashionable Reunions,\" and where she could read a description of Mrs. F. Bullock's costume. Jane's own life, as we have said, was an awful existence. She had to get up on black winter mornings to make breakfast for her scowling old father. She sat silent and trembling opposite him, while he read his paper and consumed his muffins and tea.\nAt half-past nine he went to the City, and she was almost free till dinner-time, to visit the kitchen and scold the servants; to drive out to see the tradesmen; to leave her cards at the great glum respectable houses of their City friends; or to sit alone in the large drawing-room, waiting for visitors, and working at a huge piece of needlework while the great clock ticked and tolled with mournful loudness in the dreary room. George's picture was gone, laid upstairs in the garret; and though father and daughter often thought of him, no mention was ever made of the once darling son.\nAt five o'clock Mr. Osborne came back to his dinner, which he and his daughter took in silence, or which they shared twice a month with a party of dismal friends of Osborne's age: old Dr. Gulp and his lady, old Mr. Frowser, the attorney, old Colonel Livermore, of the Bombay Army; old Sergeant Toffy and Mrs. Toffy; and sometimes old Sir Thomas Coffin, the celebrated hanging judge. These people exchanged pompous dinners and had solemn rubbers of whist, and their carriages were called at half past ten. Jane Osborne scarcely ever met a man under sixty.\nIn fact there had been a secret in poor Jane's life which had made her father more savage and morose than ever. This secret was connected with Miss Wirt, who had a cousin - an artist, Mr. Smee, very celebrated since as a portrait-painter; but who once gave drawing lessons to ladies of fashion. Mr. Smee has forgotten where Russell Square is now, but he was glad enough to visit it in the year 1818.\nWhen Smee was introduced by Miss Wirt to Miss Osborne, he felt a great attachment for her, which it is believed was returned. Miss Wirt was their confidante. I know not whether she used to leave the room where the master and his pupil were painting, in order to give them time alone; all that is certain is that Mr. Osborne came back from the City abruptly, entered the drawing-room, found the painter, the pupil and the companion all looking exceedingly pale; turned the former out of doors with threats to break every bone in his skin, and half an hour afterwards dismissed Miss Wirt, kicking her trunks downstairs, and shaking his fist at her hackney coach as it bore her away.\nJane Osborne kept to her bedroom for many days. She was not allowed to have a companion afterwards. Her father swore that she should not have a shilling if she made any match without his agreement; and as he wanted a woman to keep his house, he did not choose that she should marry. During her papa's life, then, she resigned herself to this existence. Her sister, meanwhile, was having children with finer names every year, and they met less and less.\nIt has been described how the Misses Dobbin lived with their father at a fine villa at Denmark Hill, whose beautiful graperies and peach-trees delighted little Georgy Osborne. The Misses Dobbin, who drove often to Brompton to see Amelia, came sometimes to Russell Square too, to pay a visit to Miss Osborne. It was following the commands of their brother the Major in India that they visited Amelia; and they kept Miss Osborne acquainted with the state of Amelia's affairs - how she was living with her father and mother; how poor they were; how she was still an insignificant namby-pamby creature - but the boy was really the noblest little boy ever seen.\nOne day Amelia allowed little George to go and pass a day with the Misses Dobbin - a part of which day she spent in writing to the Major in India. She congratulated him on the happy news which his sisters had just told her, and prayed for his and his bride's prosperity. She thanked him for a thousand kindnesses and told him the latest news about little Georgy. She signed herself affectionately his friend, Amelia Osborne. She was glad to be able to admit how warmly and gratefully she regarded him - and as for the idea of being jealous of Glorvina (Glorvina, indeed!) that was nonsense.\nThat night, when Georgy came back in the pony-carriage, he had round his neck a fine gold chain and watch. He said an old lady had given it him, and cried and kissed him a great deal. But he didn't like her. He liked grapes. And Amelia shrank with a presentiment of terror when she heard that his aunt had seen him.\nMiss Osborne came back from the Dobbin household to give her father his dinner. He was in rather a good humour that day, and seeing her agitated, he deigned to ask, \"What's the matter, Miss Osborne?\"\nShe burst into tears. \"Oh, sir, I've seen little George. He is as beautiful as an angel - and so like him!\" The old man did not say a word, but began to tremble in every limb.",
        "paragraph_chars": [
            [
                0,
                344
            ],
            [
                344,
                965
            ],
            [
                965,
                1575
            ],
            [
                1575,
                1937
            ],
            [
                1937,
                2201
            ],
            [
                2201,
                2449
            ],
            [
                2449,
                2861
            ],
            [
                2861,
                3233
            ],
            [
                3233,
                3559
            ],
            [
                3559,
                4033
            ],
            [
                4033,
                4622
            ],
            [
                4622,
                5177
            ],
            [
                5177,
                5577
            ],
            [
                5577,
                6258
            ],
            [
                6258,
                6711
            ],
            [
                6711,
                7368
            ],
            [
                7368,
                7959
            ],
            [
                7959,
                8275
            ],
            [
                8275,
                8475
            ],
            [
                8475,
                8650
            ]
        ],
        "segment_chars": [
            [
                0,
                83
            ],
            [
                83,
                120
            ],
            [
                120,
                344
            ],
            [
                344,
                485
            ],
            [
                485,
                606
            ],
            [
                606,
                797
            ],
            [
                797,
                965
            ],
            [
                965,
                1058
            ],
            [
                1058,
                1231
            ],
            [
                1231,
                1341
            ],
            [
                1341,
                1454
            ],
            [
                1454,
                1575
            ],
            [
                1575,
                1617
            ],
            [
                1617,
                1687
            ],
            [
                1687,
                1778
            ],
            [
                1778,
                1826
            ],
            [
                1826,
                1937
            ],
            [
                1937,
                1970
            ],
            [
                1970,
                2201
            ],
            [
                2201,
                2316
            ],
            [
                2316,
                2449
            ],
            [
                2449,
                2557
            ],
            [
                2557,
                2604
            ],
            [
                2604,
                2861
            ],
            [
                2861,
                2921
            ],
            [
                2921,
                3015
            ],
            [
                3015,
                3066
            ],
            [
                3066,
                3233
            ],
            [
                3233,
                3411
            ],
            [
                3411,
                3493
            ],
            [
                3493,
                3559
            ],
            [
                3559,
                3784
            ],
            [
                3784,
                3842
            ],
            [
                3842,
                3932
            ],
            [
                3932,
                4033
            ],
            [
                4033,
                4463
            ],
            [
                4463,
                4622
            ],
            [
                4622,
                5005
            ],
            [
                5005,
                5127
            ],
            [
                5127,
                5177
            ],
            [
                5177,
                5289
            ],
            [
                5289,
                5472
            ],
            [
                5472,
                5577
            ],
            [
                5577,
                5703
            ],
            [
                5703,
                5735
            ],
            [
                5735,
                6258
            ],
            [
                6258,
                6306
            ],
            [
                6306,
                6358
            ],
            [
                6358,
                6541
            ],
            [
                6541,
                6611
            ],
            [
                6611,
                6711
            ],
            [
                6711,
                6887
            ],
            [
                6887,
                7019
            ],
            [
                7019,
                7368
            ],
            [
                7368,
                7515
            ],
            [
                7515,
                7639
            ],
            [
                7639,
                7731
            ],
            [
                7731,
                7793
            ],
            [
                7793,
                7940
            ],
            [
                7940,
                7959
            ],
            [
                7959,
                8066
            ],
            [
                8066,
                8143
            ],
            [
                8143,
                8167
            ],
            [
                8167,
                8184
            ],
            [
                8184,
                8275
            ],
            [
                8275,
                8355
            ],
            [
                8355,
                8475
            ],
            [
                8475,
                8497
            ],
            [
                8497,
                8532
            ],
            [
                8532,
                8583
            ],
            [
                8583,
                8650
            ]
        ],
        "overlap_chars": [
            [
                0,
                21
            ],
            [
                29,
                47
            ],
            [
                48,
                83
            ],
            [
                83,
                114
            ],
            [
                118,
                120
            ],
            [
                120,
                130
            ],
            [
                138,
                170
            ],
            [
                170,
                175
            ],
            [
                176,
                198
            ],
            [
                199,
                216
            ],
            [
                225,
                250
            ],
            [
                258,
                309
            ],
            [
                310,
                325
            ],
            [
                334,
                343
            ],
            [
                344,
                347
            ],
            [
                348,
                372
            ],
            [
                373,
                447
            ],
            [
                448,
                460
            ],
            [
                461,
                485
            ],
            [
                485,
                550
            ],
            [
                550,
                551
            ],
            [
                564,
                571
            ],
            [
                572,
                606
            ],
            [
                606,
                636
            ],
            [
                637,
                640
            ],
            [
                646,
                651
            ],
            [
                652,
                697
            ],
            [
                698,
                706
            ],
            [
                707,
                731
            ],
            [
                731,
                736
            ],
            [
                737,
                787
            ],
            [
                788,
                797
            ],
            [
                797,
                824
            ],
            [
                825,
                831
            ],
            [
                831,
                901
            ],
            [
                902,
                936
            ],
            [
                936,
                945
            ],
            [
                946,
                949
            ],
            [
                950,
                964
            ],
            [
                965,
                982
            ],
            [
                983,
                1009
            ],
            [
                1016,
                1056
            ],
            [
                1056,
                1058
            ],
            [
                1062,
                1081
            ],
            [
                1082,
                1156
            ],
            [
                1157,
                1164
            ],
            [
                1165,
                1191
            ],
            [
                1191,
                1194
            ],
            [
                1195,
                1231
            ],
            [
                1231,
                1309
            ],
            [
                1316,
                1317
            ],
            [
                1317,
                1325
            ],
            [
                1326,
                1328
            ],
            [
                1329,
                1341
            ],
            [
                1341,
                1345
            ],
            [
                1346,
                1381
            ],
            [
                1381,
                1400
            ],
            [
                1407,
                1454
            ],
            [
                1454,
                1508
            ],
            [
                1513,
                1518
            ],
            [
                1532,
                1537
            ],
            [
                1546,
                1574
            ],
            [
                1575,
                1578
            ],
            [
                1587,
                1617
            ],
            [
                1617,
                1630
            ],
            [
                1631,
                1660
            ],
            [
                1661,
                1685
            ],
            [
                1685,
                1687
            ],
            [
                1687,
                1692
            ],
            [
                1693,
                1697
            ],
            [
                1702,
                1721
            ],
            [
                1721,
                1722
            ],
            [
                1723,
                1754
            ],
            [
                1755,
                1763
            ],
            [
                1764,
                1776
            ],
            [
                1776,
                1778
            ],
            [
                1778,
                1826
            ],
            [
                1826,
                1892
            ],
            [
                1893,
                1909
            ],
            [
                1910,
                1915
            ],
            [
                1916,
                1930
            ],
            [
                1935,
                1936
            ],
            [
                1937,
                1949
            ],
            [
                1950,
                1968
            ],
            [
                1968,
                1970
            ],
            [
                1970,
                2010
            ],
            [
                2010,
                2049
            ],
            [
                2049,
                2080
            ],
            [
                2080,
                2199
            ],
            [
                2199,
                2201
            ],
            [
                2201,
                2316
            ],
            [
                2316,
                2357
            ],
            [
                2360,
                2368
            ],
            [
                2368,
                2369
            ],
            [
                2370,
                2379
            ],
            [
                2380,
                2449
            ],
            [
                2449,
                2451
            ],
            [
                2459,
                2462
            ],
            [
                2473,
                2526
            ],
            [
                2527,
                2555
            ],
            [
                2555,
                2557
            ],
            [
                2557,
                2604
            ],
            [
                2604,
                2607
            ],
            [
                2608,
                2751
            ],
            [
                2752,
                2783
            ],
            [
                2784,
                2859
            ],
            [
                2859,
                2861
            ],
            [
                2861,
                2921
            ],
            [
                2921,
                2944
            ],
            [
                2945,
                2967
            ],
            [
                2973,
                3003
            ],
            [
                3004,
                3013
            ],
            [
                3013,
                3015
            ],
            [
                3019,
                3066
            ],
            [
                3066,
                3072
            ],
            [
                3072,
                3079
            ],
            [
                3080,
                3086
            ],
            [
                3087,
                3096
            ],
            [
                3097,
                3131
            ],
            [
                3132,
                3153
            ],
            [
                3159,
                3189
            ],
            [
                3192,
                3230
            ],
            [
                3233,
                3260
            ],
            [
                3266,
                3377
            ],
            [
                3381,
                3391
            ],
            [
                3392,
                3409
            ],
            [
                3409,
                3410
            ],
            [
                3411,
                3413
            ],
            [
                3426,
                3492
            ],
            [
                3497,
                3557
            ],
            [
                3557,
                3559
            ],
            [
                3559,
                3598
            ],
            [
                3604,
                3611
            ],
            [
                3612,
                3667
            ],
            [
                3668,
                3728
            ],
            [
                3740,
                3782
            ],
            [
                3782,
                3784
            ],
            [
                3784,
                3817
            ],
            [
                3818,
                3842
            ],
            [
                3842,
                3859
            ],
            [
                3863,
                3875
            ],
            [
                3876,
                3930
            ],
            [
                3930,
                3932
            ],
            [
                3932,
                3935
            ],
            [
                3940,
                3946
            ],
            [
                3947,
                3950
            ],
            [
                3961,
                3969
            ],
            [
                3970,
                3974
            ],
            [
                3975,
                3980
            ],
            [
                3984,
                4015
            ],
            [
                4016,
                4032
            ],
            [
                4033,
                4053
            ],
            [
                4054,
                4116
            ],
            [
                4117,
                4122
            ],
            [
                4123,
                4138
            ],
            [
                4139,
                4167
            ],
            [
                4172,
                4174
            ],
            [
                4179,
                4192
            ],
            [
                4192,
                4212
            ],
            [
                4213,
                4315
            ],
            [
                4328,
                4336
            ],
            [
                4336,
                4337
            ],
            [
                4338,
                4368
            ],
            [
                4386,
                4395
            ],
            [
                4396,
                4401
            ],
            [
                4402,
                4463
            ],
            [
                4463,
                4489
            ],
            [
                4490,
                4503
            ],
            [
                4504,
                4529
            ],
            [
                4530,
                4555
            ],
            [
                4564,
                4603
            ],
            [
                4604,
                4622
            ],
            [
                4622,
                4716
            ],
            [
                4716,
                4717
            ],
            [
                4718,
                4744
            ],
            [
                4745,
                4796
            ],
            [
                4797,
                4800
            ],
            [
                4802,
                4827
            ],
            [
                4827,
                4828
            ],
            [
                4829,
                4859
            ],
            [
                4860,
                4901
            ],
            [
                4901,
                4973
            ],
            [
                4973,
                4974
            ],
            [
                4975,
                4978
            ],
            [
                4979,
                4989
            ],
            [
                4990,
                5003
            ],
            [
                5003,
                5004
            ],
            [
                5005,
                5017
            ],
            [
                5028,
                5043
            ],
            [
                5044,
                5047
            ],
            [
                5048,
                5075
            ],
            [
                5075,
                5127
            ],
            [
                5127,
                5175
            ],
            [
                5175,
                5177
            ],
            [
                5180,
                5184
            ],
            [
                5185,
                5282
            ],
            [
                5287,
                5289
            ],
            [
                5289,
                5347
            ],
            [
                5350,
                5414
            ],
            [
                5416,
                5428
            ],
            [
                5434,
                5472
            ],
            [
                5472,
                5575
            ],
            [
                5575,
                5577
            ],
            [
                5591,
                5604
            ],
            [
                5605,
                5614
            ],
            [
                5615,
                5631
            ],
            [
                5635,
                5662
            ],
            [
                5663,
                5666
            ],
            [
                5666,
                5667
            ],
            [
                5674,
                5688
            ],
            [
                5701,
                5703
            ],
            [
                5703,
                5716
            ],
            [
                5723,
                5733
            ],
            [
                5733,
                5735
            ],
            [
                5735,
                5848
            ],
            [
                5859,
                5860
            ],
            [
                5861,
                5900
            ],
            [
                5901,
                5934
            ],
            [
                5935,
                5959
            ],
            [
                5959,
                5960
            ],
            [
                5961,
                5989
            ],
            [
                5990,
                6036
            ],
            [
                6036,
                6073
            ],
            [
                6082,
                6084
            ],
            [
                6085,
                6162
            ],
            [
                6162,
                6182
            ],
            [
                6193,
                6258
            ],
            [
                6258,
                6275
            ],
            [
                6279,
                6306
            ],
            [
                6306,
                6358
            ],
            [
                6358,
                6374
            ],
            [
                6375,
                6410
            ],
            [
                6411,
                6444
            ],
            [
                6454,
                6539
            ],
            [
                6539,
                6541
            ],
            [
                6541,
                6594
            ],
            [
                6600,
                6609
            ],
            [
                6609,
                6611
            ],
            [
                6611,
                6681
            ],
            [
                6683,
                6686
            ],
            [
                6709,
                6710
            ],
            [
                6711,
                6811
            ],
            [
                6818,
                6853
            ],
            [
                6854,
                6887
            ],
            [
                6887,
                6940
            ],
            [
                6941,
                7004
            ],
            [
                7005,
                7019
            ],
            [
                7019,
                7025
            ],
            [
                7036,
                7084
            ],
            [
                7085,
                7094
            ],
            [
                7103,
                7109
            ],
            [
                7109,
                7110
            ],
            [
                7111,
                7114
            ],
            [
                7115,
                7119
            ],
            [
                7120,
                7183
            ],
            [
                7184,
                7185
            ],
            [
                7186,
                7256
            ],
            [
                7257,
                7270
            ],
            [
                7271,
                7287
            ],
            [
                7288,
                7299
            ],
            [
                7300,
                7308
            ],
            [
                7309,
                7310
            ],
            [
                7311,
                7314
            ],
            [
                7315,
                7366
            ],
            [
                7366,
                7368
            ],
            [
                7368,
                7375
            ],
            [
                7376,
                7430
            ],
            [
                7431,
                7448
            ],
            [
                7451,
                7480
            ],
            [
                7481,
                7515
            ],
            [
                7515,
                7581
            ],
            [
                7587,
                7590
            ],
            [
                7592,
                7595
            ],
            [
                7596,
                7610
            ],
            [
                7619,
                7624
            ],
            [
                7627,
                7637
            ],
            [
                7637,
                7639
            ],
            [
                7639,
                7669
            ],
            [
                7681,
                7684
            ],
            [
                7685,
                7697
            ],
            [
                7705,
                7729
            ],
            [
                7729,
                7731
            ],
            [
                7731,
                7793
            ],
            [
                7793,
                7819
            ],
            [
                7826,
                7868
            ],
            [
                7871,
                7937
            ],
            [
                7957,
                7958
            ],
            [
                7959,
                8013
            ],
            [
                8013,
                8066
            ],
            [
                8066,
                8085
            ],
            [
                8086,
                8103
            ],
            [
                8108,
                8143
            ],
            [
                8143,
                8167
            ],
            [
                8167,
                8182
            ],
            [
                8182,
                8184
            ],
            [
                8184,
                8187
            ],
            [
                8195,
                8201
            ],
            [
                8207,
                8251
            ],
            [
                8261,
                8275
            ],
            [
                8275,
                8297
            ],
            [
                8324,
                8355
            ],
            [
                8355,
                8357
            ],
            [
                8358,
                8361
            ],
            [
                8362,
                8364
            ],
            [
                8365,
                8371
            ],
            [
                8372,
                8399
            ],
            [
                8419,
                8420
            ],
            [
                8432,
                8434
            ],
            [
                8440,
                8474
            ],
            [
                8479,
                8497
            ],
            [
                8497,
                8505
            ],
            [
                8505,
                8506
            ],
            [
                8507,
                8532
            ],
            [
                8532,
                8562
            ],
            [
                8565,
                8583
            ],
            [
                8583,
                8594
            ],
            [
                8595,
                8618
            ],
            [
                8619,
                8650
            ]
        ],
        "row_chars": [
            [
                0,
                83
            ],
            [
                83,
                120
            ],
            [
                120,
                344
            ],
            [
                344,
                485
            ],
            [
                485,
                485
            ],
            [
                485,
                485
            ],
            [
                485,
                606
            ],
            [
                606,
                797
            ],
            [
                797,
                965
            ],
            [
                965,
                965
            ],
            [
                965,
                1058
            ],
            [
                1058,
                1231
            ],
            [
                1231,
                1341
            ],
            [
                1341,
                1454
            ],
            [
                1454,
                1575
            ],
            [
                1575,
                1575
            ],
            [
                1575,
                1575
            ],
            [
                1575,
                1575
            ],
            [
                1575,
                1617
            ],
            [
                1617,
                1687
            ],
            [
                1687,
                1778
            ],
            [
                1778,
                1826
            ],
            [
                1826,
                1937
            ],
            [
                1937,
                1937
            ],
            [
                1937,
                1970
            ],
            [
                1970,
                1970
            ],
            [
                1970,
                2201
            ],
            [
                2201,
                2316
            ],
            [
                2316,
                2449
            ],
            [
                2449,
                2557
            ],
            [
                2557,
                2604
            ],
            [
                2604,
                2861
            ],
            [
                2861,
                2921
            ],
            [
                2921,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3015
            ],
            [
                3015,
                3066
            ],
            [
                3066,
                3233
            ],
            [
                3233,
                3233
            ],
            [
                3233,
                3233
            ],
            [
                3233,
                3233
            ],
            [
                3233,
                3493
            ],
            [
                3493,
                3493
            ],
            [
                3493,
                3559
            ],
            [
                3559,
                3784
            ],
            [
                3784,
                3842
            ],
            [
                3842,
                3932
            ],
            [
                3932,
                4033
            ],
            [
                4033,
                4463
            ],
            [
                4463,
                4463
            ],
            [
                4463,
                4463
            ],
            [
                4463,
                4622
            ],
            [
                4622,
                5005
            ],
            [
                5005,
                5127
            ],
            [
                5127,
                5127
            ],
            [
                5127,
                5177
            ],
            [
                5177,
                5289
            ],
            [
                5289,
                5472
            ],
            [
                5472,
                5577
            ],
            [
                5577,
                5703
            ],
            [
                5703,
                5735
            ],
            [
                5735,
                6258
            ],
            [
                6258,
                6306
            ],
            [
                6306,
                6358
            ],
            [
                6358,
                6541
            ],
            [
                6541,
                6611
            ],
            [
                6611,
                6711
            ],
            [
                6711,
                6711
            ],
            [
                6711,
                6711
            ],
            [
                6711,
                6887
            ],
            [
                6887,
                7019
            ],
            [
                7019,
                7368
            ],
            [
                7368,
                7515
            ],
            [
                7515,
                7639
            ],
            [
                7639,
                7731
            ],
            [
                7731,
                7793
            ],
            [
                7793,
                7793
            ],
            [
                7793,
                7793
            ],
            [
                7793,
                7940
            ],
            [
                7940,
                7959
            ],
            [
                7959,
                8066
            ],
            [
                8066,
                8143
            ],
            [
                8143,
                8167
            ],
            [
                8167,
                8184
            ],
            [
                8184,
                8184
            ],
            [
                8184,
                8275
            ],
            [
                8275,
                8355
            ],
            [
                8355,
                8475
            ],
            [
                8475,
                8475
            ],
            [
                8475,
                8497
            ],
            [
                8497,
                8532
            ],
            [
                8532,
                8583
            ],
            [
                8583,
                8650
            ]
        ]
    }
}