{
    "original": {
        "text": "Our old friends the Crawleys' family house, in Great Gaunt Street, still bore over its front the hatchment which had been placed there as a token of mourning for Sir Pitt Crawley's demise, yet this heraldic emblem was in itself a very splendid and gaudy piece of furniture, and all the rest of the mansion became more brilliant than it had ever been during the late baronet's reign. The black outer-coating of the bricks was removed, and they appeared with a cheerful, blushing face streaked with white: the old bronze lions of the knocker were gilt handsomely, the railings painted, and the dismallest house in Great Gaunt Street became the smartest in the whole quarter, before the green leaves in Hampshire had replaced those yellowing ones which were on the trees in Queen's Crawley Avenue when old Sir Pitt Crawley passed under them for the last time.\nA little woman, with a carriage to correspond, was perpetually seen about this mansion; an elderly spinster, accompanied by a little boy, also might be remarked coming thither daily. It was Miss Briggs and little Rawdon, whose business it was to see to the inward renovation of Sir Pitt's house, to superintend the female band engaged in stitching the blinds and hangings, to poke and rummage in the drawers and cupboards crammed with the dirty relics and congregated trumperies of a couple of generations of Lady Crawleys, and to take inventories of the china, the glass, and other properties in the closets and store-rooms.\nMrs. Rawdon Crawley was general-in-chief over these arrangements, with full orders from Sir Pitt to sell, barter, confiscate, or purchase furniture, and she enjoyed herself not a little in an occupation which gave full scope to her taste and ingenuity. The renovation of the house was determined upon when Sir Pitt came to town in November to see his lawyers, and when he passed nearly a week in Curzon Street, under the roof of his affectionate brother and sister.\nHe had put up at an hotel at first, but, Becky, as soon as she heard of the Baronet's arrival, went off alone to greet him, and returned in an hour to Curzon Street with Sir Pitt in the carriage by her side. It was impossible sometimes to resist this artless little creature's hospitalities, so kindly were they pressed, so frankly and amiably offered. Becky seized Pitt's hand in a transport of gratitude when he agreed to come. \"Thank you,\" she said, squeezing it and looking into the Baronet's eyes, who blushed a good deal; \"how happy this will make Rawdon!\" She bustled up to Pitt's bedroom, leading on the servants, who were carrying his trunks thither. She came in herself laughing, with a coal-scuttle out of her own room.\nA fire was blazing already in Sir Pitt's apartment (it was Miss Briggs's room, by the way, who was sent upstairs to sleep with the maid). \"I knew I should bring you,\" she said with pleasure beaming in her glance. Indeed, she was really sincerely happy at having him for a guest.\nBecky made Rawdon dine out once or twice on business, while Pitt stayed with them, and the Baronet passed the happy evening alone with her and Briggs. She went downstairs to the kitchen and actually cooked little dishes for him. \"Isn't it a good salmi?\" she said; \"I made it for you. I can make you better dishes than that, and will when you come to see me.\"\n\"Everything you do, you do well,\" said the Baronet gallantly. \"The salmi is excellent indeed.\"\n\"A poor man's wife,\" Rebecca replied gaily, \"must make herself useful, you know\"; on which her brother-in-law vowed that \"she was fit to be the wife of an Emperor, and that to be skilful in domestic duties was surely one of the most charming of woman's qualities.\" And Sir Pitt thought, with something like mortification, of Lady Jane at home, and of a certain pie which she had insisted on making, and serving to him at dinner--a most abominable pie.\nBesides the salmi, which was made of Lord Steyne's pheasants from his lordship's cottage of Stillbrook, Becky gave her brother-in-law a bottle of white wine, some that Rawdon had brought with him from France, and had picked up for nothing, the little story-teller said; whereas the liquor was, in truth, some White Hermitage from the Marquis of Steyne's famous cellars, which brought fire into the Baronet's pallid cheeks and a glow into his feeble frame.\nThen when he had drunk up the bottle of petit vin blanc, she gave him her hand, and took him up to the drawing-room, and made him snug on the sofa by the fire, and let him talk as she listened with the tenderest kindly interest, sitting by him, and hemming a shirt for her dear little boy. Whenever Mrs. Rawdon wished to be particularly humble and virtuous, this little shirt used to come out of her work-box. It had got to be too small for Rawdon long before it was finished.\nWell, Rebecca listened to Pitt, she talked to him, she sang to him, she coaxed him, and cuddled him, so that he found himself more and more glad every day to get back from the lawyer's at Gray's Inn, to the blazing fire in Curzon Street--a gladness in which the men of law likewise participated, for Pitt's harangues were of the longest--and so that when he went away he felt quite a pang at departing. How pretty she looked kissing her hand to him from the carriage and waving her handkerchief when he had taken his place in the mail! She put the handkerchief to her eyes once. He pulled his sealskin cap over his, as the coach drove away, and, sinking back, he thought to himself how she respected him and how he deserved it, and how Rawdon was a foolish dull fellow who didn't half appreciate his wife; and how mum and stupid his own wife was compared to that brilliant little Becky. Becky had hinted every one of these things herself, perhaps, but so delicately and gently that you hardly knew when or where. And, before they parted, it was agreed that the house in London should be redecorated for the next season, and that the brothers' families should meet again in the country at Christmas.\n\"I wish you could have got a little money out of him,\" Rawdon said to his wife moodily when the Baronet was gone. \"I should like to give something to old Raggles, hanged if I shouldn't. It ain't right, you know, that the old fellow should be kept out of all his money. It may be inconvenient, and he might let to somebody else besides us, you know.\"\n\"Tell him,\" said Becky, \"that as soon as Sir Pitt's affairs are settled, everybody will be paid, and give him a little something on account. Here's a cheque that Pitt left for the boy,\" and she took from her bag and gave her husband a paper which his brother had handed over to her, on behalf of the little son and heir of the younger branch of the Crawleys.\nThe truth is, she had tried personally the ground on which her husband expressed a wish that she should venture--tried it ever so delicately, and found it unsafe. Even at a hint about embarrassments, Sir Pitt Crawley was off and alarmed. And he began a long speech, explaining how straitened he himself was in money matters; how the tenants would not pay; how his father's affairs, and the expenses attendant upon the demise of the old gentleman, had involved him; how he wanted to pay off incumbrances; and how the bankers and agents were overdrawn; and Pitt Crawley ended by making a compromise with his sister-in-law and giving her a very small sum for the benefit of her little boy.\nPitt knew how poor his brother and his brother's family must be. It could not have escaped the notice of such a cool and experienced old diplomatist that Rawdon's family had nothing to live upon, and that houses and carriages are not to be kept for nothing. He knew very well that he was the proprietor or appropriator of the money, which, according to all proper calculation, ought to have fallen to his younger brother, and he had, we may be sure, some secret pangs of remorse within him, which warned him that he ought to perform some act of justice, or, let us say, compensation, towards these disappointed relations. A just, decent man, not without brains, who said his prayers, and knew his catechism, and did his duty outwardly through life, he could not be otherwise than aware that something was due to his brother at his hands, and that morally he was Rawdon's debtor.\nBut, as one reads in the columns of the Times newspaper every now and then, queer announcements from the Chancellor of the Exchequer, acknowledging the receipt of 50 pounds from A. B., or 10 pounds from W. T., as conscience-money, on account of taxes due by the said A. B. or W. T., which payments the penitents beg the Right Honourable gentleman to acknowledge through the medium of the public press--so is the Chancellor no doubt, and the reader likewise, always perfectly sure that the above-named A. B. and W. T. are only paying a very small instalment of what they really owe, and that the man who sends up a twenty-pound note has very likely hundreds or thousands more for which he ought to account. Such, at least, are my feelings, when I see A. B. or W. T.'s insufficient acts of repentance. And I have no doubt that Pitt Crawley's contrition, or kindness if you will, towards his younger brother, by whom he had so much profited, was only a very small dividend upon the capital sum in which he was indebted to Rawdon. Not everybody is willing to pay even so much. To part with money is a sacrifice beyond almost all men endowed with a sense of order. There is scarcely any man alive who does not think himself meritorious for giving his neighbour five pounds. Thriftless gives, not from a beneficent pleasure in giving, but from a lazy delight in spending. He would not deny himself one enjoyment; not his opera-stall, not his horse, not his dinner, not even the pleasure of giving Lazarus the five pounds. Thrifty, who is good, wise, just, and owes no man a penny, turns from a beggar, haggles with a hackney-coachman, or denies a poor relation, and I doubt which is the most selfish of the two. Money has only a different value in the eyes of each.\nSo, in a word, Pitt Crawley thought he would do something for his brother, and then thought that he would think about it some other time.\nAnd with regard to Becky, she was not a woman who expected too much from the generosity of her neighbours, and so was quite content with all that Pitt Crawley had done for her. She was acknowledged by the head of the family. If Pitt would not give her anything, he would get something for her some day. If she got no money from her brother-in-law, she got what was as good as money--credit. Raggles was made rather easy in his mind by the spectacle of the union between the brothers, by a small payment on the spot, and by the promise of a much larger sum speedily to be assigned to him. And Rebecca told Miss Briggs, whose Christmas dividend upon the little sum lent by her Becky paid with an air of candid joy, and as if her exchequer was brimming over with gold--Rebecca, we say, told Miss Briggs, in strict confidence that she had conferred with Sir Pitt, who was famous as a financier, on Briggs's special behalf, as to the most profitable investment of Miss B.'s remaining capital; that Sir Pitt, after much consideration, had thought of a most safe and advantageous way in which Briggs could lay out her money; that, being especially interested in her as an attached friend of the late Miss Crawley, and of the whole family, and that long before he left town, he had recommended that she should be ready with the money at a moment's notice, so as to purchase at the most favourable opportunity the shares which Sir Pitt had in his eye. Poor Miss Briggs was very grateful for this mark of Sir Pitt's attention--it came so unsolicited, she said, for she never should have thought of removing the money from the funds--and the delicacy enhanced the kindness of the office; and she promised to see her man of business immediately and be ready with her little cash at the proper hour.\nAnd this worthy woman was so grateful for the kindness of Rebecca in the matter, and for that of her generous benefactor, the Colonel, that she went out and spent a great part of her half-year's dividend in the purchase of a black velvet coat for little Rawdon, who, by the way, was grown almost too big for black velvet now, and was of a size and age befitting him for the assumption of the virile jacket and pantaloons.\nHe was a fine open-faced boy, with blue eyes and waving flaxen hair, sturdy in limb, but generous and soft in heart, fondly attaching himself to all who were good to him--to the pony--to Lord Southdown, who gave him the horse (he used to blush and glow all over when he saw that kind young nobleman)--to the groom who had charge of the pony--to Molly, the cook, who crammed him with ghost stories at night, and with good things from the dinner--to Briggs, whom he plagued and laughed at--and to his father especially, whose attachment towards the lad was curious too to witness. Here, as he grew to be about eight years old, his attachments may be said to have ended. The beautiful mother-vision had faded away after a while. During near two years she had scarcely spoken to the child. She disliked him. He had the measles and the hooping-cough. He bored her. One day when he was standing at the landing-place, having crept down from the upper regions, attracted by the sound of his mother's voice, who was singing to Lord Steyne, the drawing room door opening suddenly, discovered the little spy, who but a moment before had been rapt in delight, and listening to the music.\nHis mother came out and struck him violently a couple of boxes on the ear. He heard a laugh from the Marquis in the inner room (who was amused by this free and artless exhibition of Becky's temper) and fled down below to his friends of the kitchen, bursting in an agony of grief.\n\"It is not because it hurts me,\" little Rawdon gasped out--\"only--only\"--sobs and tears wound up the sentence in a storm. It was the little boy's heart that was bleeding. \"Why mayn't I hear her singing? Why don't she ever sing to me--as she does to that baldheaded man with the large teeth?\" He gasped out at various intervals these exclamations of rage and grief. The cook looked at the housemaid, the housemaid looked knowingly at the footman--the awful kitchen inquisition which sits in judgement in every house and knows everything--sat on Rebecca at that moment.\nAfter this incident, the mother's dislike increased to hatred; the consciousness that the child was in the house was a reproach and a pain to her. His very sight annoyed her. Fear, doubt, and resistance sprang up, too, in the boy's own bosom. They were separated from that day of the boxes on the ear.\nLord Steyne also heartily disliked the boy. When they met by mischance, he made sarcastic bows or remarks to the child, or glared at him with savage-looking eyes. Rawdon used to stare him in the face and double his little fists in return. He knew his enemy, and this gentleman, of all who came to the house, was the one who angered him most. One day the footman found him squaring his fists at Lord Steyne's hat in the hall. The footman told the circumstance as a good joke to Lord Steyne's coachman; that officer imparted it to Lord Steyne's gentleman, and to the servants' hall in general. And very soon afterwards, when Mrs. Rawdon Crawley made her appearance at Gaunt House, the porter who unbarred the gates, the servants of all uniforms in the hall, the functionaries in white waistcoats, who bawled out from landing to landing the names of Colonel and Mrs. Rawdon Crawley, knew about her, or fancied they did. The man who brought her refreshment and stood behind her chair, had talked her character over with the large gentleman in motley-coloured clothes at his side. Bon Dieu! it is awful, that servants' inquisition! You see a woman in a great party in a splendid saloon, surrounded by faithful admirers, distributing sparkling glances, dressed to perfection, curled, rouged, smiling and happy--Discovery walks respectfully up to her, in the shape of a huge powdered man with large calves and a tray of ices--with Calumny (which is as fatal as truth) behind him, in the shape of the hulking fellow carrying the wafer-biscuits. Madam, your secret will be talked over by those men at their club at the public-house to-night. Jeames will tell Chawles his notions about you over their pipes and pewter beer-pots. Some people ought to have mutes for servants in Vanity Fair--mutes who could not write. If you are guilty, tremble. That fellow behind your chair may be a Janissary with a bow-string in his plush breeches pocket. If you are not guilty, have a care of appearances, which are as ruinous as guilt.\n\"Was Rebecca guilty or not?\" the Vehmgericht of the servants' hall had pronounced against her.\nAnd, I shame to say, she would not have got credit had they not believed her to be guilty. It was the sight of the Marquis of Steyne's carriage-lamps at her door, contemplated by Raggles, burning in the blackness of midnight, \"that kep him up,\" as he afterwards said, that even more than Rebecca's arts and coaxings.\nAnd so--guiltless very likely--she was writhing and pushing onward towards what they call \"a position in society,\" and the servants were pointing at her as lost and ruined. So you see Molly, the housemaid, of a morning, watching a spider in the doorpost lay his thread and laboriously crawl up it, until, tired of the sport, she raises her broom and sweeps away the thread and the artificer.\nA day or two before Christmas, Becky, her husband and her son made ready and went to pass the holidays at the seat of their ancestors at Queen's Crawley. Becky would have liked to leave the little brat behind, and would have done so but for Lady Jane's urgent invitations to the youngster, and the symptoms of revolt and discontent which Rawdon manifested at her neglect of her son. \"He's the finest boy in England,\" the father said in a tone of reproach to her, \"and you don't seem to care for him, Becky, as much as you do for your spaniel. He shan't bother you much; at home he will be away from you in the nursery, and he shall go outside on the coach with me.\"\n\"Where you go yourself because you want to smoke those filthy cigars,\" replied Mrs. Rawdon.\n\"I remember when you liked 'em though,\" answered the husband.\nBecky laughed; she was almost always good-humoured. \"That was when I was on my promotion, Goosey,\" she said. \"Take Rawdon outside with you and give him a cigar too if you like.\"\nRawdon did not warm his little son for the winter's journey in this way, but he and Briggs wrapped up the child in shawls and comforters, and he was hoisted respectfully onto the roof of the coach in the dark morning, under the lamps of the White Horse Cellar; and with no small delight he watched the dawn rise and made his first journey to the place which his father still called home. It was a journey of infinite pleasure to the boy, to whom the incidents of the road afforded endless interest, his father answering to him all questions connected with it and telling him who lived in the great white house to the right, and whom the park belonged to. His mother, inside the vehicle, with her maid and her furs, her wrappers, and her scent bottles, made such a to-do that you would have thought she never had been in a stage-coach before--much less, that she had been turned out of this very one to make room for a paying passenger on a certain journey performed some half-score years ago.\nIt was dark again when little Rawdon was wakened up to enter his uncle's carriage at Mudbury, and he sat and looked out of it wondering as the great iron gates flew open, and at the white trunks of the limes as they swept by, until they stopped, at length, before the light windows of the Hall, which were blazing and comfortable with Christmas welcome. The hall-door was flung open--a big fire was burning in the great old fire-place--a carpet was down over the chequered black flags--\"It's the old Turkey one that used to be in the Ladies' Gallery,\" thought Rebecca, and the next instant was kissing Lady Jane.\nShe and Sir Pitt performed the same salute with great gravity; but Rawdon, having been smoking, hung back rather from his sister-in-law, whose two children came up to their cousin; and, while Matilda held out her hand and kissed him, Pitt Binkie Southdown, the son and heir, stood aloof rather and examined him as a little dog does a big dog.\nThen the kind hostess conducted her guests to the snug apartments blazing with cheerful fires. Then the young ladies came and knocked at Mrs. Rawdon's door, under the pretence that they were desirous to be useful, but in reality to have the pleasure of inspecting the contents of her band and bonnet-boxes, and her dresses which, though black, were of the newest London fashion. And they told her how much the Hall was changed for the better, and how old Lady Southdown was gone, and how Pitt was taking his station in the county, as became a Crawley in fact. Then the great dinner-bell having rung, the family assembled at dinner, at which meal Rawdon Junior was placed by his aunt, the good-natured lady of the house, Sir Pitt being uncommonly attentive to his sister-in-law at his own right hand.\nLittle Rawdon exhibited a fine appetite and showed a gentlemanlike behaviour.\n\"I like to dine here,\" he said to his aunt when he had completed his meal, at the conclusion of which, and after a decent grace by Sir Pitt, the younger son and heir was introduced, and was perched on a high chair by the Baronet's side, while the daughter took possession of the place and the little wine-glass prepared for her near her mother. \"I like to dine here,\" said Rawdon Minor, looking up at his relation's kind face.\n\"Why?\" said the good Lady Jane.\n\"I dine in the kitchen when I am at home,\" replied Rawdon Minor, \"or else with Briggs.\" But Becky was so engaged with the Baronet, her host, pouring out a flood of compliments and delights and raptures, and admiring young Pitt Binkie, whom she declared to be the most beautiful, intelligent, noble-looking little creature, and so like his father, that she did not hear the remarks of her own flesh and blood at the other end of the broad shining table.\nAs a guest, and it being the first night of his arrival, Rawdon the Second was allowed to sit up until the hour when tea being over, and a great gilt book being laid on the table before Sir Pitt, all the domestics of the family streamed in, and Sir Pitt read prayers. It was the first time the poor little boy had ever witnessed or heard of such a ceremonial.\nThe house had been much improved even since the Baronet's brief reign, and was pronounced by Becky to be perfect, charming, delightful, when she surveyed it in his company. As for little Rawdon, who examined it with the children for his guides, it seemed to him a perfect palace of enchantment and wonder. There were long galleries, and ancient state bedrooms, there were pictures and old China, and armour. There were the rooms in which Grandpapa died, and by which the children walked with terrified looks. \"Who was Grandpapa?\" he asked; and they told him how he used to be very old, and used to be wheeled about in a garden-chair, and they showed him the garden-chair one day rotting in the out-house in which it had lain since the old gentleman had been wheeled away yonder to the church, of which the spire was glittering over the park elms.\nThe brothers had good occupation for several mornings in examining the improvements which had been effected by Sir Pitt's genius and economy. And as they walked or rode, and looked at them, they could talk without too much boring each other. And Pitt took care to tell Rawdon what a heavy outlay of money these improvements had occasioned, and that a man of landed and funded property was often very hard pressed for twenty pounds. \"There is that new lodge-gate,\" said Pitt, pointing to it humbly with the bamboo cane, \"I can no more pay for it before the dividends in January than I can fly.\"\n\"I can lend you, Pitt, till then,\" Rawdon answered rather ruefully; and they went in and looked at the restored lodge, where the family arms were just new scraped in stone, and where old Mrs. Lock, for the first time these many long years, had tight doors, sound roofs, and whole windows.",
        "paragraph_chars": [
            [
                0,
                857
            ],
            [
                857,
                1483
            ],
            [
                1483,
                1949
            ],
            [
                1949,
                2680
            ],
            [
                2680,
                2959
            ],
            [
                2959,
                3318
            ],
            [
                3318,
                3413
            ],
            [
                3413,
                3865
            ],
            [
                3865,
                4321
            ],
            [
                4321,
                4798
            ],
            [
                4798,
                5997
            ],
            [
                5997,
                6347
            ],
            [
                6347,
                6706
            ],
            [
                6706,
                7393
            ],
            [
                7393,
                8272
            ],
            [
                8272,
                10032
            ],
            [
                10032,
                10170
            ],
            [
                10170,
                11957
            ],
            [
                11957,
                12379
            ],
            [
                12379,
                13555
            ],
            [
                13555,
                13835
            ],
            [
                13835,
                14403
            ],
            [
                14403,
                14705
            ],
            [
                14705,
                16719
            ],
            [
                16719,
                16814
            ],
            [
                16814,
                17131
            ],
            [
                17131,
                17523
            ],
            [
                17523,
                18189
            ],
            [
                18189,
                18281
            ],
            [
                18281,
                18343
            ],
            [
                18343,
                18521
            ],
            [
                18521,
                19514
            ],
            [
                19514,
                20127
            ],
            [
                20127,
                20470
            ],
            [
                20470,
                21270
            ],
            [
                21270,
                21348
            ],
            [
                21348,
                21775
            ],
            [
                21775,
                21807
            ],
            [
                21807,
                22260
            ],
            [
                22260,
                22620
            ],
            [
                22620,
                23467
            ],
            [
                23467,
                24061
            ],
            [
                24061,
                24349
            ]
        ],
        "segment_chars": [
            [
                0,
                383
            ],
            [
                383,
                857
            ],
            [
                857,
                1040
            ],
            [
                1040,
                1483
            ],
            [
                1483,
                1736
            ],
            [
                1736,
                1949
            ],
            [
                1949,
                2157
            ],
            [
                2157,
                2302
            ],
            [
                2302,
                2379
            ],
            [
                2379,
                2512
            ],
            [
                2512,
                2609
            ],
            [
                2609,
                2680
            ],
            [
                2680,
                2818
            ],
            [
                2818,
                2893
            ],
            [
                2893,
                2959
            ],
            [
                2959,
                3110
            ],
            [
                3110,
                3188
            ],
            [
                3188,
                3213
            ],
            [
                3213,
                3243
            ],
            [
                3243,
                3318
            ],
            [
                3318,
                3380
            ],
            [
                3380,
                3413
            ],
            [
                3413,
                3678
            ],
            [
                3678,
                3865
            ],
            [
                3865,
                4321
            ],
            [
                4321,
                4611
            ],
            [
                4611,
                4731
            ],
            [
                4731,
                4798
            ],
            [
                4798,
                5201
            ],
            [
                5201,
                5334
            ],
            [
                5334,
                5377
            ],
            [
                5377,
                5685
            ],
            [
                5685,
                5811
            ],
            [
                5811,
                5997
            ],
            [
                5997,
                6111
            ],
            [
                6111,
                6183
            ],
            [
                6183,
                6266
            ],
            [
                6266,
                6347
            ],
            [
                6347,
                6488
            ],
            [
                6488,
                6706
            ],
            [
                6706,
                6869
            ],
            [
                6869,
                6944
            ],
            [
                6944,
                7393
            ],
            [
                7393,
                7458
            ],
            [
                7458,
                7651
            ],
            [
                7651,
                8015
            ],
            [
                8015,
                8272
            ],
            [
                8272,
                8453
            ],
            [
                8453,
                8542
            ],
            [
                8542,
                8776
            ],
            [
                8776,
                8978
            ],
            [
                8978,
                9025
            ],
            [
                9025,
                9072
            ],
            [
                9072,
                9299
            ],
            [
                9299,
                9345
            ],
            [
                9345,
                9432
            ],
            [
                9432,
                9541
            ],
            [
                9541,
                9638
            ],
            [
                9638,
                9788
            ],
            [
                9788,
                9978
            ],
            [
                9978,
                10032
            ],
            [
                10032,
                10170
            ],
            [
                10170,
                10347
            ],
            [
                10347,
                10395
            ],
            [
                10395,
                10473
            ],
            [
                10473,
                10561
            ],
            [
                10561,
                10758
            ],
            [
                10758,
                11136
            ],
            [
                11136,
                11613
            ],
            [
                11613,
                11957
            ],
            [
                11957,
                12379
            ],
            [
                12379,
                12958
            ],
            [
                12958,
                13047
            ],
            [
                13047,
                13105
            ],
            [
                13105,
                13165
            ],
            [
                13165,
                13183
            ],
            [
                13183,
                13225
            ],
            [
                13225,
                13239
            ],
            [
                13239,
                13555
            ],
            [
                13555,
                13630
            ],
            [
                13630,
                13835
            ],
            [
                13835,
                13957
            ],
            [
                13957,
                14006
            ],
            [
                14006,
                14038
            ],
            [
                14038,
                14127
            ],
            [
                14127,
                14200
            ],
            [
                14200,
                14403
            ],
            [
                14403,
                14550
            ],
            [
                14550,
                14578
            ],
            [
                14578,
                14646
            ],
            [
                14646,
                14705
            ],
            [
                14705,
                14749
            ],
            [
                14749,
                14868
            ],
            [
                14868,
                14944
            ],
            [
                14944,
                15047
            ],
            [
                15047,
                15130
            ],
            [
                15130,
                15297
            ],
            [
                15297,
                15622
            ],
            [
                15622,
                15781
            ],
            [
                15781,
                15791
            ],
            [
                15791,
                15832
            ],
            [
                15832,
                16242
            ],
            [
                16242,
                16338
            ],
            [
                16338,
                16424
            ],
            [
                16424,
                16512
            ],
            [
                16512,
                16540
            ],
            [
                16540,
                16637
            ],
            [
                16637,
                16719
            ],
            [
                16719,
                16748
            ],
            [
                16748,
                16814
            ],
            [
                16814,
                16905
            ],
            [
                16905,
                17131
            ],
            [
                17131,
                17304
            ],
            [
                17304,
                17523
            ],
            [
                17523,
                17677
            ],
            [
                17677,
                17906
            ],
            [
                17906,
                18066
            ],
            [
                18066,
                18189
            ],
            [
                18189,
                18281
            ],
            [
                18281,
                18343
            ],
            [
                18343,
                18395
            ],
            [
                18395,
                18452
            ],
            [
                18452,
                18521
            ],
            [
                18521,
                18909
            ],
            [
                18909,
                19176
            ],
            [
                19176,
                19514
            ],
            [
                19514,
                19868
            ],
            [
                19868,
                20127
            ],
            [
                20127,
                20470
            ],
            [
                20470,
                20565
            ],
            [
                20565,
                20849
            ],
            [
                20849,
                21030
            ],
            [
                21030,
                21270
            ],
            [
                21270,
                21348
            ],
            [
                21348,
                21693
            ],
            [
                21693,
                21775
            ],
            [
                21775,
                21782
            ],
            [
                21782,
                21807
            ],
            [
                21807,
                21895
            ],
            [
                21895,
                22260
            ],
            [
                22260,
                22528
            ],
            [
                22528,
                22620
            ],
            [
                22620,
                22793
            ],
            [
                22793,
                22926
            ],
            [
                22926,
                23028
            ],
            [
                23028,
                23129
            ],
            [
                23129,
                23150
            ],
            [
                23150,
                23467
            ],
            [
                23467,
                23609
            ],
            [
                23609,
                23709
            ],
            [
                23709,
                23899
            ],
            [
                23899,
                24061
            ],
            [
                24061,
                24349
            ]
        ],
        "overlap_chars": [
            [
                16,
                29
            ],
            [
                37,
                66
            ],
            [
                306,
                383
            ],
            [
                383,
                398
            ],
            [
                407,
                433
            ],
            [
                457,
                482
            ],
            [
                502,
                546
            ],
            [
                560,
                591
            ],
            [
                603,
                608
            ],
            [
                631,
                657
            ],
            [
                855,
                857
            ],
            [
                857,
                871
            ],
            [
                873,
                888
            ],
            [
                904,
                964
            ],
            [
                981,
                982
            ],
            [
                990,
                993
            ],
            [
                995,
                1008
            ],
            [
                1033,
                1040
            ],
            [
                1040,
                1077
            ],
            [
                1100,
                1113
            ],
            [
                1121,
                1151
            ],
            [
                1153,
                1171
            ],
            [
                1195,
                1204
            ],
            [
                1336,
                1338
            ],
            [
                1209,
                1232
            ],
            [
                1242,
                1252
            ],
            [
                1269,
                1291
            ],
            [
                1296,
                1308
            ],
            [
                1379,
                1384
            ],
            [
                1388,
                1407
            ],
            [
                1412,
                1417
            ],
            [
                1238,
                1241
            ],
            [
                1423,
                1428
            ],
            [
                1481,
                1483
            ],
            [
                1483,
                1506
            ],
            [
                1529,
                1553
            ],
            [
                1559,
                1587
            ],
            [
                1609,
                1611
            ],
            [
                1621,
                1630
            ],
            [
                1632,
                1655
            ],
            [
                1515,
                1517
            ],
            [
                1675,
                1685
            ],
            [
                1734,
                1736
            ],
            [
                1793,
                1797
            ],
            [
                1925,
                1928
            ],
            [
                1754,
                1763
            ],
            [
                1847,
                1854
            ],
            [
                1798,
                1810
            ],
            [
                1823,
                1841
            ],
            [
                1947,
                1949
            ],
            [
                1949,
                1951
            ],
            [
                1956,
                1965
            ],
            [
                1969,
                1988
            ],
            [
                1990,
                1996
            ],
            [
                2008,
                2020
            ],
            [
                2035,
                2052
            ],
            [
                2059,
                2085
            ],
            [
                2097,
                2157
            ],
            [
                2157,
                2240
            ],
            [
                2293,
                2300
            ],
            [
                2241,
                2250
            ],
            [
                2281,
                2284
            ],
            [
                2273,
                2280
            ],
            [
                2300,
                2302
            ],
            [
                2302,
                2329
            ],
            [
                2345,
                2372
            ],
            [
                2377,
                2378
            ],
            [
                2379,
                2418
            ],
            [
                2432,
                2443
            ],
            [
                2450,
                2463
            ],
            [
                2475,
                2511
            ],
            [
                2757,
                2758
            ],
            [
                2680,
                2757
            ],
            [
                2775,
                2818
            ],
            [
                2905,
                2908
            ],
            [
                2916,
                2959
            ],
            [
                2965,
                3012
            ],
            [
                3019,
                3023
            ],
            [
                3058,
                3110
            ],
            [
                3110,
                3113
            ],
            [
                3149,
                3186
            ],
            [
                3133,
                3144
            ],
            [
                3186,
                3187
            ],
            [
                3188,
                3204
            ],
            [
                3210,
                3213
            ],
            [
                3213,
                3221
            ],
            [
                3241,
                3242
            ],
            [
                3318,
                3380
            ],
            [
                3380,
                3384
            ],
            [
                3391,
                3413
            ],
            [
                3413,
                3431
            ],
            [
                3458,
                3482
            ],
            [
                3431,
                3455
            ],
            [
                3504,
                3535
            ],
            [
                3600,
                3678
            ],
            [
                3678,
                3704
            ],
            [
                3720,
                3734
            ],
            [
                3761,
                3783
            ],
            [
                3738,
                3747
            ],
            [
                3788,
                3803
            ],
            [
                3827,
                3830
            ],
            [
                3842,
                3865
            ],
            [
                3865,
                3876
            ],
            [
                3882,
                3925
            ],
            [
                3967,
                4021
            ],
            [
                4133,
                4134
            ],
            [
                4023,
                4051
            ],
            [
                4061,
                4133
            ],
            [
                4159,
                4168
            ],
            [
                4154,
                4157
            ],
            [
                4174,
                4248
            ],
            [
                4291,
                4297
            ],
            [
                4254,
                4286
            ],
            [
                4319,
                4321
            ],
            [
                4321,
                4325
            ],
            [
                4378,
                4413
            ],
            [
                4417,
                4532
            ],
            [
                4540,
                4611
            ],
            [
                4611,
                4731
            ],
            [
                4731,
                4733
            ],
            [
                4748,
                4798
            ],
            [
                4798,
                4876
            ],
            [
                4882,
                4887
            ],
            [
                4894,
                4923
            ],
            [
                4933,
                4982
            ],
            [
                4998,
                5034
            ],
            [
                4880,
                4881
            ],
            [
                4929,
                4932
            ],
            [
                5148,
                5173
            ],
            [
                5180,
                5186
            ],
            [
                5199,
                5201
            ],
            [
                5201,
                5246
            ],
            [
                5293,
                5332
            ],
            [
                5332,
                5334
            ],
            [
                5334,
                5341
            ],
            [
                5346,
                5370
            ],
            [
                5375,
                5376
            ],
            [
                5414,
                5438
            ],
            [
                5442,
                5457
            ],
            [
                5461,
                5577
            ],
            [
                5583,
                5611
            ],
            [
                5616,
                5685
            ],
            [
                5685,
                5736
            ],
            [
                5746,
                5763
            ],
            [
                5775,
                5795
            ],
            [
                5804,
                5810
            ],
            [
                5816,
                5896
            ],
            [
                5916,
                5930
            ],
            [
                5941,
                5997
            ],
            [
                5997,
                6023
            ],
            [
                6033,
                6111
            ],
            [
                6111,
                6158
            ],
            [
                6181,
                6183
            ],
            [
                6183,
                6266
            ],
            [
                6294,
                6323
            ],
            [
                6334,
                6347
            ],
            [
                6347,
                6475
            ],
            [
                6486,
                6488
            ],
            [
                6488,
                6530
            ],
            [
                6537,
                6540
            ],
            [
                6563,
                6567
            ],
            [
                6622,
                6628
            ],
            [
                6572,
                6579
            ],
            [
                6704,
                6706
            ],
            [
                6706,
                6733
            ],
            [
                6745,
                6755
            ],
            [
                6825,
                6869
            ],
            [
                6869,
                6883
            ],
            [
                6904,
                6914
            ],
            [
                6923,
                6926
            ],
            [
                6935,
                6944
            ],
            [
                6948,
                6986
            ],
            [
                7131,
                7133
            ],
            [
                7016,
                7021
            ],
            [
                6998,
                7000
            ],
            [
                7009,
                7012
            ],
            [
                7001,
                7008
            ],
            [
                7029,
                7060
            ],
            [
                7086,
                7091
            ],
            [
                7066,
                7078
            ],
            [
                7153,
                7156
            ],
            [
                7166,
                7169
            ],
            [
                7096,
                7104
            ],
            [
                7151,
                7152
            ],
            [
                6944,
                6947
            ],
            [
                7218,
                7255
            ],
            [
                7175,
                7177
            ],
            [
                7274,
                7302
            ],
            [
                7326,
                7336
            ],
            [
                7341,
                7361
            ],
            [
                7377,
                7393
            ],
            [
                7393,
                7411
            ],
            [
                7428,
                7458
            ],
            [
                7458,
                7483
            ],
            [
                7488,
                7494
            ],
            [
                7542,
                7546
            ],
            [
                7563,
                7587
            ],
            [
                7649,
                7651
            ],
            [
                7651,
                7676
            ],
            [
                7822,
                7825
            ],
            [
                7715,
                7724
            ],
            [
                7726,
                7731
            ],
            [
                7770,
                7783
            ],
            [
                7743,
                7745
            ],
            [
                7813,
                7821
            ],
            [
                7825,
                7871
            ],
            [
                7882,
                7937
            ],
            [
                7963,
                7975
            ],
            [
                7977,
                8015
            ],
            [
                8015,
                8016
            ],
            [
                8023,
                8029
            ],
            [
                8021,
                8022
            ],
            [
                8030,
                8033
            ],
            [
                8053,
                8075
            ],
            [
                8099,
                8144
            ],
            [
                8251,
                8254
            ],
            [
                8173,
                8216
            ],
            [
                8270,
                8272
            ],
            [
                9345,
                9400
            ],
            [
                9414,
                9432
            ],
            [
                10032,
                10034
            ],
            [
                10047,
                10170
            ],
            [
                10189,
                10199
            ],
            [
                10204,
                10207
            ],
            [
                10229,
                10237
            ],
            [
                10275,
                10287
            ],
            [
                10294,
                10320
            ],
            [
                10329,
                10347
            ],
            [
                10347,
                10395
            ],
            [
                10395,
                10473
            ],
            [
                10473,
                10525
            ],
            [
                10553,
                10561
            ],
            [
                10561,
                10577
            ],
            [
                10585,
                10608
            ],
            [
                10632,
                10689
            ],
            [
                10693,
                10725
            ],
            [
                10735,
                10737
            ],
            [
                10756,
                10757
            ],
            [
                10758,
                10786
            ],
            [
                10971,
                11098
            ],
            [
                11115,
                11136
            ],
            [
                11136,
                11171
            ],
            [
                11199,
                11286
            ],
            [
                11375,
                11380
            ],
            [
                11444,
                11471
            ],
            [
                11486,
                11495
            ],
            [
                11475,
                11480
            ],
            [
                11496,
                11516
            ],
            [
                11524,
                11526
            ],
            [
                11571,
                11596
            ],
            [
                11611,
                11612
            ],
            [
                11613,
                11647
            ],
            [
                11845,
                11866
            ],
            [
                11907,
                11956
            ],
            [
                11957,
                11985
            ],
            [
                11995,
                11998
            ],
            [
                12015,
                12022
            ],
            [
                12149,
                12151
            ],
            [
                12003,
                12011
            ],
            [
                12092,
                12113
            ],
            [
                12180,
                12222
            ],
            [
                12236,
                12281
            ],
            [
                12377,
                12379
            ],
            [
                12379,
                12407
            ],
            [
                12407,
                12454
            ],
            [
                12464,
                12485
            ],
            [
                12494,
                12548
            ],
            [
                12550,
                12561
            ],
            [
                12563,
                12590
            ],
            [
                12614,
                12616
            ],
            [
                12591,
                12594
            ],
            [
                12680,
                12710
            ],
            [
                12721,
                12799
            ],
            [
                12824,
                12865
            ],
            [
                12623,
                12626
            ],
            [
                12885,
                12895
            ],
            [
                12871,
                12884
            ],
            [
                12895,
                12941
            ],
            [
                12946,
                12957
            ],
            [
                12958,
                12962
            ],
            [
                13008,
                13019
            ],
            [
                13040,
                13047
            ],
            [
                13047,
                13084
            ],
            [
                13103,
                13105
            ],
            [
                13117,
                13165
            ],
            [
                13165,
                13183
            ],
            [
                13183,
                13209
            ],
            [
                13212,
                13225
            ],
            [
                13225,
                13239
            ],
            [
                13239,
                13267
            ],
            [
                13618,
                13624
            ],
            [
                13275,
                13282
            ],
            [
                13330,
                13376
            ],
            [
                13386,
                13431
            ],
            [
                13440,
                13448
            ],
            [
                13527,
                13530
            ],
            [
                13450,
                13475
            ],
            [
                13575,
                13578
            ],
            [
                13555,
                13558
            ],
            [
                13590,
                13599
            ],
            [
                13628,
                13630
            ],
            [
                13630,
                13663
            ],
            [
                13757,
                13766
            ],
            [
                13773,
                13803
            ],
            [
                13813,
                13835
            ],
            [
                13835,
                13892
            ],
            [
                13894,
                13899
            ],
            [
                13901,
                13905
            ],
            [
                13945,
                13955
            ],
            [
                13908,
                13912
            ],
            [
                13955,
                13957
            ],
            [
                13957,
                14006
            ],
            [
                14006,
                14038
            ],
            [
                14038,
                14067
            ],
            [
                14069,
                14093
            ],
            [
                14100,
                14126
            ],
            [
                14200,
                14232
            ],
            [
                14234,
                14279
            ],
            [
                14281,
                14349
            ],
            [
                14372,
                14375
            ],
            [
                14376,
                14403
            ],
            [
                14403,
                14469
            ],
            [
                14554,
                14564
            ],
            [
                14489,
                14492
            ],
            [
                14516,
                14534
            ],
            [
                14542,
                14549
            ],
            [
                14578,
                14582
            ],
            [
                14591,
                14594
            ],
            [
                14584,
                14589
            ],
            [
                14606,
                14634
            ],
            [
                14639,
                14646
            ],
            [
                14646,
                14679
            ],
            [
                14703,
                14705
            ],
            [
                14705,
                14721
            ],
            [
                14731,
                14749
            ],
            [
                14749,
                14762
            ],
            [
                14775,
                14810
            ],
            [
                14823,
                14837
            ],
            [
                14847,
                14853
            ],
            [
                14866,
                14868
            ],
            [
                14868,
                14888
            ],
            [
                14905,
                14908
            ],
            [
                14916,
                14944
            ],
            [
                14944,
                14961
            ],
            [
                15045,
                15047
            ],
            [
                15047,
                15130
            ],
            [
                15130,
                15146
            ],
            [
                15228,
                15230
            ],
            [
                15164,
                15218
            ],
            [
                15266,
                15284
            ],
            [
                15295,
                15297
            ],
            [
                15297,
                15300
            ],
            [
                15306,
                15347
            ],
            [
                15368,
                15394
            ],
            [
                15560,
                15563
            ],
            [
                15585,
                15589
            ],
            [
                15435,
                15438
            ],
            [
                15590,
                15622
            ],
            [
                15791,
                15832
            ],
            [
                16424,
                16483
            ],
            [
                16510,
                16512
            ],
            [
                16512,
                16540
            ],
            [
                16637,
                16659
            ],
            [
                16672,
                16719
            ],
            [
                16724,
                16731
            ],
            [
                16720,
                16723
            ],
            [
                16732,
                16745
            ],
            [
                16748,
                16751
            ],
            [
                16764,
                16813
            ],
            [
                16835,
                16905
            ],
            [
                16905,
                16976
            ],
            [
                16990,
                17001
            ],
            [
                17041,
                17045
            ],
            [
                17054,
                17056
            ],
            [
                17129,
                17131
            ],
            [
                17131,
                17137
            ],
            [
                17144,
                17160
            ],
            [
                17162,
                17205
            ],
            [
                17221,
                17245
            ],
            [
                17250,
                17303
            ],
            [
                17536,
                17584
            ],
            [
                17600,
                17625
            ],
            [
                17657,
                17677
            ],
            [
                17677,
                17731
            ],
            [
                17756,
                17816
            ],
            [
                17861,
                17867
            ],
            [
                17879,
                17905
            ],
            [
                17906,
                17955
            ],
            [
                17984,
                18066
            ],
            [
                18066,
                18092
            ],
            [
                18146,
                18189
            ],
            [
                18189,
                18202
            ],
            [
                18220,
                18281
            ],
            [
                18281,
                18318
            ],
            [
                18343,
                18356
            ],
            [
                18393,
                18395
            ],
            [
                18452,
                18513
            ],
            [
                18518,
                18521
            ],
            [
                18521,
                18527
            ],
            [
                18601,
                18642
            ],
            [
                18657,
                18737
            ],
            [
                18786,
                18790
            ],
            [
                18800,
                18909
            ],
            [
                18909,
                18992
            ],
            [
                19002,
                19040
            ],
            [
                19048,
                19051
            ],
            [
                19052,
                19061
            ],
            [
                19080,
                19105
            ],
            [
                19174,
                19176
            ],
            [
                19176,
                19186
            ],
            [
                19188,
                19206
            ],
            [
                19208,
                19234
            ],
            [
                19250,
                19271
            ],
            [
                19512,
                19514
            ],
            [
                19514,
                19606
            ],
            [
                19612,
                19614
            ],
            [
                19623,
                19758
            ],
            [
                19771,
                19781
            ],
            [
                19788,
                19827
            ],
            [
                19844,
                19868
            ],
            [
                19868,
                19896
            ],
            [
                19898,
                19933
            ],
            [
                19938,
                19948
            ],
            [
                19950,
                19976
            ],
            [
                19987,
                19992
            ],
            [
                20125,
                20127
            ],
            [
                20074,
                20081
            ],
            [
                20116,
                20125
            ],
            [
                20131,
                20143
            ],
            [
                20188,
                20232
            ],
            [
                20240,
                20306
            ],
            [
                20081,
                20082
            ],
            [
                20313,
                20326
            ],
            [
                20349,
                20365
            ],
            [
                20373,
                20413
            ],
            [
                20421,
                20470
            ],
            [
                20470,
                20565
            ],
            [
                20570,
                20586
            ],
            [
                20596,
                20626
            ],
            [
                20646,
                20655
            ],
            [
                20670,
                20722
            ],
            [
                20750,
                20753
            ],
            [
                20763,
                20849
            ],
            [
                20853,
                20911
            ],
            [
                20948,
                21020
            ],
            [
                21028,
                21030
            ],
            [
                21070,
                21101
            ],
            [
                21116,
                21153
            ],
            [
                21190,
                21198
            ],
            [
                21205,
                21228
            ],
            [
                21268,
                21270
            ],
            [
                21270,
                21283
            ],
            [
                21314,
                21320
            ],
            [
                21294,
                21309
            ],
            [
                21346,
                21347
            ],
            [
                21348,
                21390
            ],
            [
                21455,
                21460
            ],
            [
                21426,
                21429
            ],
            [
                21417,
                21421
            ],
            [
                21691,
                21692
            ],
            [
                21775,
                21782
            ],
            [
                21782,
                21807
            ],
            [
                21807,
                21849
            ],
            [
                21850,
                21857
            ],
            [
                21870,
                21895
            ],
            [
                21905,
                21911
            ],
            [
                21925,
                21936
            ],
            [
                22008,
                22033
            ],
            [
                22042,
                22074
            ],
            [
                22099,
                22112
            ],
            [
                22120,
                22152
            ],
            [
                22154,
                22198
            ],
            [
                22258,
                22260
            ],
            [
                22317,
                22376
            ],
            [
                22397,
                22414
            ],
            [
                22421,
                22463
            ],
            [
                22488,
                22528
            ],
            [
                22528,
                22588
            ],
            [
                22601,
                22607
            ],
            [
                22618,
                22620
            ],
            [
                22620,
                22629
            ],
            [
                22689,
                22690
            ],
            [
                22644,
                22652
            ],
            [
                22658,
                22667
            ],
            [
                22668,
                22677
            ],
            [
                22732,
                22733
            ],
            [
                22695,
                22724
            ],
            [
                22734,
                22742
            ],
            [
                22791,
                22793
            ],
            [
                22793,
                22926
            ],
            [
                22926,
                22979
            ],
            [
                22981,
                23004
            ],
            [
                23020,
                23028
            ],
            [
                23028,
                23077
            ],
            [
                23081,
                23128
            ],
            [
                23129,
                23150
            ],
            [
                23150,
                23195
            ],
            [
                23221,
                23253
            ],
            [
                23327,
                23332
            ],
            [
                23258,
                23273
            ],
            [
                23299,
                23309
            ],
            [
                23314,
                23323
            ],
            [
                23465,
                23467
            ],
            [
                23467,
                23479
            ],
            [
                23504,
                23550
            ],
            [
                23607,
                23609
            ],
            [
                23613,
                23636
            ],
            [
                23657,
                23672
            ],
            [
                23697,
                23709
            ],
            [
                23713,
                23794
            ],
            [
                23897,
                23898
            ],
            [
                23899,
                23956
            ],
            [
                23986,
                24061
            ],
            [
                24061,
                24076
            ],
            [
                24076,
                24142
            ],
            [
                24146,
                24206
            ],
            [
                24216,
                24232
            ],
            [
                24234,
                24277
            ],
            [
                24143,
                24145
            ],
            [
                24284,
                24349
            ]
        ],
        "row_chars": [
            [
                0,
                383
            ],
            [
                383,
                857
            ],
            [
                857,
                1040
            ],
            [
                1040,
                1483
            ],
            [
                1483,
                1736
            ],
            [
                1736,
                1949
            ],
            [
                1949,
                2157
            ],
            [
                2157,
                2302
            ],
            [
                2302,
                2379
            ],
            [
                2379,
                2512
            ],
            [
                2512,
                2609
            ],
            [
                2609,
                2680
            ],
            [
                2680,
                2818
            ],
            [
                2818,
                2893
            ],
            [
                2893,
                2959
            ],
            [
                2959,
                3110
            ],
            [
                3110,
                3188
            ],
            [
                3188,
                3213
            ],
            [
                3213,
                3243
            ],
            [
                3243,
                3318
            ],
            [
                3318,
                3380
            ],
            [
                3380,
                3413
            ],
            [
                3413,
                3678
            ],
            [
                3678,
                3865
            ],
            [
                3865,
                4321
            ],
            [
                4321,
                4611
            ],
            [
                4611,
                4731
            ],
            [
                4731,
                4798
            ],
            [
                4798,
                5201
            ],
            [
                5201,
                5334
            ],
            [
                5334,
                5377
            ],
            [
                5377,
                5685
            ],
            [
                5685,
                5811
            ],
            [
                5811,
                5997
            ],
            [
                5997,
                6111
            ],
            [
                6111,
                6183
            ],
            [
                6183,
                6266
            ],
            [
                6266,
                6347
            ],
            [
                6347,
                6488
            ],
            [
                6488,
                6706
            ],
            [
                6706,
                6869
            ],
            [
                6869,
                6944
            ],
            [
                6944,
                7393
            ],
            [
                7393,
                7458
            ],
            [
                7458,
                7651
            ],
            [
                7651,
                8015
            ],
            [
                8015,
                8272
            ],
            [
                8272,
                8453
            ],
            [
                8453,
                8542
            ],
            [
                8542,
                8776
            ],
            [
                8776,
                8978
            ],
            [
                8978,
                9025
            ],
            [
                9025,
                9072
            ],
            [
                9072,
                9299
            ],
            [
                9299,
                9345
            ],
            [
                9345,
                9432
            ],
            [
                9432,
                9541
            ],
            [
                9541,
                9638
            ],
            [
                9638,
                9788
            ],
            [
                9788,
                9978
            ],
            [
                9978,
                10032
            ],
            [
                10032,
                10170
            ],
            [
                10170,
                10347
            ],
            [
                10347,
                10395
            ],
            [
                10395,
                10473
            ],
            [
                10473,
                10561
            ],
            [
                10561,
                10758
            ],
            [
                10758,
                11136
            ],
            [
                11136,
                11613
            ],
            [
                11613,
                11957
            ],
            [
                11957,
                12379
            ],
            [
                12379,
                12958
            ],
            [
                12958,
                13047
            ],
            [
                13047,
                13105
            ],
            [
                13105,
                13165
            ],
            [
                13165,
                13183
            ],
            [
                13183,
                13225
            ],
            [
                13225,
                13239
            ],
            [
                13239,
                13630
            ],
            [
                13630,
                13835
            ],
            [
                13835,
                13957
            ],
            [
                13957,
                14006
            ],
            [
                14006,
                14038
            ],
            [
                14038,
                14127
            ],
            [
                14127,
                14200
            ],
            [
                14200,
                14403
            ],
            [
                14403,
                14578
            ],
            [
                14578,
                14646
            ],
            [
                14646,
                14705
            ],
            [
                14705,
                14749
            ],
            [
                14749,
                14868
            ],
            [
                14868,
                14944
            ],
            [
                14944,
                15047
            ],
            [
                15047,
                15130
            ],
            [
                15130,
                15297
            ],
            [
                15297,
                15622
            ],
            [
                15622,
                15781
            ],
            [
                15781,
                15791
            ],
            [
                15791,
                15832
            ],
            [
                15832,
                16242
            ],
            [
                16242,
                16338
            ],
            [
                16338,
                16424
            ],
            [
                16424,
                16512
            ],
            [
                16512,
                16540
            ],
            [
                16540,
                16637
            ],
            [
                16637,
                16719
            ],
            [
                16719,
                16814
            ],
            [
                16814,
                16905
            ],
            [
                16905,
                17131
            ],
            [
                17131,
                17304
            ],
            [
                17304,
                17523
            ],
            [
                17523,
                17677
            ],
            [
                17677,
                17906
            ],
            [
                17906,
                18066
            ],
            [
                18066,
                18189
            ],
            [
                18189,
                18281
            ],
            [
                18281,
                18343
            ],
            [
                18343,
                18395
            ],
            [
                18395,
                18452
            ],
            [
                18452,
                18521
            ],
            [
                18521,
                18909
            ],
            [
                18909,
                19176
            ],
            [
                19176,
                19514
            ],
            [
                19514,
                19868
            ],
            [
                19868,
                20470
            ],
            [
                20470,
                20565
            ],
            [
                20565,
                20849
            ],
            [
                20849,
                21030
            ],
            [
                21030,
                21270
            ],
            [
                21270,
                21348
            ],
            [
                21348,
                21693
            ],
            [
                21693,
                21775
            ],
            [
                21775,
                21782
            ],
            [
                21782,
                21807
            ],
            [
                21807,
                21895
            ],
            [
                21895,
                22260
            ],
            [
                22260,
                22528
            ],
            [
                22528,
                22620
            ],
            [
                22620,
                22793
            ],
            [
                22793,
                22926
            ],
            [
                22926,
                23028
            ],
            [
                23028,
                23129
            ],
            [
                23129,
                23150
            ],
            [
                23150,
                23467
            ],
            [
                23467,
                23609
            ],
            [
                23609,
                23709
            ],
            [
                23709,
                23899
            ],
            [
                23899,
                24061
            ],
            [
                24061,
                24349
            ]
        ]
    },
    "abridged": {
        "text": "The Crawleys' house, in Great Gaunt Street, became more brilliant than it had ever been during the late baronet's reign. The black outer coating of the bricks was removed, to reveal a cheerful, blushing face: the old bronze lions of the knocker were gilded, the railings painted, and the house became the smartest in the area.\nA little woman with a carriage was perpetually seen about this mansion; an elderly spinster and a boy also might be observed daily. It was Miss Briggs and little Rawdon, there to see to the renovation of Sir Pitt's house: to superintend the stitching of blinds and hangings, to rummage in cupboards crammed with dirty relics, and take inventories of china and glass.\nMrs. Rawdon Crawley was managing these arrangements, with orders from Sir Pitt to sell or buy furniture; and she enjoyed herself in this occupation. Sir Pitt had decided to renovate the house when he came to town to see his lawyers.\nHe put up at a hotel at first, but Becky, when she heard of his arrival, went off to greet him, and returned to Curzon Street with Sir Pitt in the carriage by her side. It was impossible sometimes to resist this artless little creature's hospitalities, offered so kindly and frankly. Becky seized Pitt's hand in gratitude when he agreed to stay.\n\"Thank you,\" she said, squeezing it and gazing at the Baronet, who blushed; \"how happy this will make Rawdon!\"\nAt her house, a fire was blazing already in Sir Pitt's apartment (it was Miss Briggs's room; she was sent upstairs to sleep with the maid). Becky was sincerely happy at having him for a guest.\nShe made Rawdon dine out once or twice on business, so that Pitt passed the happy evening alone with her and Briggs. She actually cooked little dishes for him in the kitchen.\n\"Isn't it a good casserole?\" she said.\n\"Everything you do, you do well,\" said the Baronet gallantly. \"The casserole is excellent indeed.\"\n\"A poor man's wife must make herself useful,\" Rebecca replied gaily.\nHer brother-in-law vowed that \"skill in domestic duties was surely one of the most charming of woman's qualities.\" And Sir Pitt thought, with mortification, of a certain pie which Lady Jane had insisted on baking for him - a most abominable pie.\nBesides the casserole, which was made of Lord Steyne's pheasants, Becky gave her brother-in-law a bottle of white wine; some that Rawdon had brought from France, and had picked up for nothing, the little story-teller said. In truth, it was White Hermitage from the Marquis of Steyne's famous cellars, which brought a glow into the Baronet's pallid cheeks.\nThen she gave him her hand, and took him to the drawing-room, and made him snug on the sofa by the fire, and let him talk as she listened with the tenderest interest, sitting by him, and hemming a shirt for her dear little boy. Whenever Mrs. Rawdon wished to be particularly humble and virtuous, this little shirt used to come out of her work-box. It was too small for Rawdon long before it was finished.\nWell, Rebecca listened to Pitt, she talked to him, she sang to him, she coaxed and coddled him, so that he found himself more glad every day to get back from the lawyer's to the blazing fire in Curzon Street, and when he went away he felt a pang. How pretty she looked kissing her hand to him when he had taken his place in the mail-coach! She put her handkerchief to her eyes.\nAs the coach drove away, Pitt, sinking back, thought to himself how she respected him and how he deserved it, and how Rawdon was a foolish dull fellow who didn't appreciate his wife; and how mute and stupid his own wife was compared to that brilliant little Becky. Becky had hinted every one of these things herself, but so delicately that you hardly knew where.\nBefore they parted, it was agreed that the house in London should be redecorated, and that the families should meet again in the country at Christmas.\n\"I wish you could have got some money out of him,\" Rawdon said to his wife moodily when the Baronet was gone. \"I should like to give something to old Raggles. It ain't right, you know, that the old fellow should be kept out of all his money. He might let to somebody else, you know.\"\n\"Tell him,\" said Becky, \"that as soon as Sir Pitt's affairs are settled, everybody will be paid, and give him a little something meanwhile. Here's a cheque that Pitt left for the boy.\" She gave it to her husband.\nThe truth is, she had tried the ground about money - tried it ever so delicately, and found it unsafe. Even at a hint, Sir Pitt was alarmed. He began a long speech, explaining how short of money he was himself; how the tenants would not pay, and his father's death had caused him great expenses, and the bankers and agents were overdrawn. He ended by making a compromise and giving Becky a very small sum for her little boy.\nPitt knew how poor his brother's family must be. It could not have escaped his notice that they had nothing to live upon. He knew very well that he had the money which properly ought to have gone to Rawdon, and he felt, we may be sure, some secret pangs of remorse, which warned him that he ought to perform some act of compensation towards these disappointed relations. As a decent, clever man, who said his prayers, and did his duty outwardly through life, he was aware that something was due to his brother.\nHowever, to part with money is a sacrifice beyond almost all men who have a sense of order. So Pitt Crawley thought he would do something for his brother, and then thought that he would think about it some other time.\nAs for Becky, she did not expect too much, and so was content with all that Pitt had done for her. She was acknowledged by the head of the family. If Pitt would not give her anything, he would get something for her some day. If she got no money from her brother-in-law, she got credit. Raggles was made easy in his mind by the reunion between the brothers, by a small payment on the spot, and the promise of a much larger sum to follow.\nAnd Rebecca told Miss Briggs in strict confidence that she had conferred with Sir Pitt, who was famous as a financier, on Briggs's special behalf, as to the best investment of Miss B.'s remaining capital; that Sir Pitt had thought of a most safe and advantageous way in which Briggs could lay out her money, and recommended that she should have the money ready at a moment's notice to buy the shares which Sir Pitt advised.\nPoor Miss Briggs was very grateful; and she promised to be ready with her little cash at the proper hour. And this worthy woman was so thankful for Rebecca's kindness that she went out and bought a black velvet coat for little Rawdon, who was grown almost too big for black velvet now.\nHe was a fine open-faced boy of about eight, with blue eyes and waving flaxen hair, sturdy but generous and soft-hearted, fondly attaching himself to all who were good to him - to the pony - to Lord Southdown, who gave it to him - to the groom who had charge of it - to Molly, the cook, who crammed him with ghost stories at night, and with good food by day -to Briggs, whom he plagued and laughed at - and especially to his father, whose attachment towards the lad was curious to witness.\nHere young Rawdon's attachments ended. The beautiful mother-vision had faded. For nearly two years she had scarcely spoken to the child. She disliked him. He had the measles and the whooping-cough. He bored her. One day when he was standing on the landing, attracted by the sound of his mother's voice singing to Lord Steyne, the drawing room door opened suddenly: and she discovered the little spy and boxed his ears violently. He heard a laugh from the Marquis as he fled down to his friends of the kitchen, in an agony of grief.\n\"It is not because it hurts me,\" little Rawdon gasped out - \"only- only-\" He ended in a storm of sobs. It was the little boy's heart that was bleeding. \"Why mayn't I hear her singing? Why don't she ever sing to me - as she does to that bald man with the large teeth?\"\nThe cook looked at the housemaid; the housemaid looked knowingly at the footman. The awful kitchen inquisition which sits in judgement in every house sat in judgement on Rebecca at that moment.\nAfter this incident, the mother's dislike increased to hatred; the very sight of the boy was a reproach and an annoyance to her. Fear and doubt sprang up, too, in the boy's bosom. They were separated from that day.\nLord Steyne also disliked the boy. When they met, he made sarcastic bows or remarks, or glared at Rawdon savagely. Rawdon used to stare back and clench his little fists in return. He knew his enemy. One day the footman found him squaring his fists at Lord Steyne's hat in the hall. The footman told it as a good joke to Lord Steyne's coachman; that officer told the servants' hall. And soon afterwards, when Mrs. Rawdon Crawley arrived at Gaunt House, the porter and footmen knew all about her, or fancied they did. It is awful, that servants' inquisition! Some people ought to have mutes for servants in Vanity Fair. If you are guilty, tremble. If you are not guilty, beware of appearances, which are as ruinous as guilt.\nWhether Rebecca was guilty or not, the tribunal of the servants' hall had pronounced against her. She would not have got credit had they not believed her to be guilty. It was the sight of the Marquis of Steyne's carriage-lamps at her door, seen by Raggles, that kept his hopes up.\nAnd so - guiltless very likely - she was writhing and pushing onward towards \"a position in society,\" while the servants were pointing at her as lost and ruined.\nJust before Christmas, Becky, her husband and her son went to pass the holidays at Queen's Crawley. Becky would have liked to leave the little brat behind but for Lady Jane's urgent invitations to the youngster, and Rawdon's reproaches at her neglect of her son.\n\"He's the finest boy in England,\" the father said, \"and you don't seem to care for him, Becky, as much as you do for your spaniel. He shan't bother you much; he shall go outside on the coach with me.\"\n\"Where you go when you want to smoke those filthy cigars,\" replied Mrs. Rawdon.\n\"I remember when you liked 'em though.\"\nBecky laughed. \"Take Rawdon outside with you and give him a cigar too if you want.\"\nSo Rawdon and Briggs wrapped up the child in shawls, and he was hoisted respectfully onto the roof of the coach in the dark morning. With delight he watched the dawn rise and made his first journey to the place which his father still called home. It was a journey of infinite pleasure to the boy, to whom the incidents of the road gave endless interest, his father answering all his questions and telling him who lived where. His mother stayed inside the vehicle with her maid and her furs and her scent bottles.\nIt was dark again when little Rawdon was wakened up to enter his uncle's carriage at Mudbury. He looked out of it wondering as the great iron gates flew open, and at the white trunks of the limes as they swept by, until they stopped before the windows of the Hall, which were blazing with Christmas welcome. The hall-door was flung open - a big fire was burning in the great fire-place - a carpet was down over the black flagstones.\nRebecca kissed Lady Jane and Sir Pitt; but Rawdon, having been smoking, hung back from his sister-in-law, whose two children came up to their cousin, young Rawdon. While Matilda kissed him, Pitt Southdown, the son and heir, stood aloof and examined him as a little dog does a big dog.\nThen the kind hostess conducted her guests to the snug apartments blazing with cheerful fires. The young ladies knocked at Mrs. Rawdon's door, pretending that they wished to be useful, but in reality to have the pleasure of looking through her bonnet-boxes, and her dresses which, though black, were of the newest London fashion. They told her how much the Hall was changed for the better, and how Pitt was taking his station in the county, as became a Crawley. When the family assembled at dinner, Rawdon Junior was placed by his aunt, while Sir Pitt was uncommonly attentive to Rebecca beside him.\nLittle Rawdon showed a fine appetite. \"I like to dine here,\" he said to his aunt after the meal.\n\"Why?\" said the good Lady Jane.\n\"I dine in the kitchen when I am at home,\" he replied, \"or else with Briggs.\" Becky was so busy complimenting the Baronet, and admiring young Pitt - whom she declared to be the most noble-looking creature, and so like his father - that she did not hear the remarks of her own son.\nYoung Rawdon the Second was allowed to sit up until the hour when a great gilt book was laid on the table before Sir Pitt, all the servants streamed in, and Sir Pitt read prayers. It was the first time the poor little boy had ever witnessed such a ceremony.\nThe house, improved since the old Baronet's day, was pronounced by Becky to be charming. As for little Rawdon, who examined it with the children for his guides, it seemed to him a perfect palace of enchantment and wonder. There were long galleries, and ancient state bedrooms; there were pictures and armour. There were the rooms in which Grandpapa died, and past which the children walked with terrified looks.\n\"Who was Grandpapa?\" he asked; and they told him how he used to be wheeled about in a garden-chair, which they showed him rotting in an out-house.\nThe brothers spent several mornings in examining the improvements to the place. As they walked or rode, they could talk to each other. Pitt took care to tell Rawdon what a heavy outlay of money these improvements had caused.\n\"There is that new lodge-gate,\" said Pitt, pointing to it. \"I can no more pay for it before the dividends in January than I can fly.\"\n\"I can lend you something, Pitt, till then,\" Rawdon answered rather ruefully; and they went and looked at the restored lodge, where the family arms were newly scraped in stone; and where old Mrs. Lock, for the first time in many long years, had tight doors, sound roofs, and whole windows.",
        "paragraph_chars": [
            [
                0,
                327
            ],
            [
                327,
                694
            ],
            [
                694,
                927
            ],
            [
                927,
                1273
            ],
            [
                1273,
                1384
            ],
            [
                1384,
                1577
            ],
            [
                1577,
                1752
            ],
            [
                1752,
                1791
            ],
            [
                1791,
                1890
            ],
            [
                1890,
                1959
            ],
            [
                1959,
                2205
            ],
            [
                2205,
                2561
            ],
            [
                2561,
                2966
            ],
            [
                2966,
                3344
            ],
            [
                3344,
                3707
            ],
            [
                3707,
                3858
            ],
            [
                3858,
                4142
            ],
            [
                4142,
                4355
            ],
            [
                4355,
                4780
            ],
            [
                4780,
                5291
            ],
            [
                5291,
                5509
            ],
            [
                5509,
                5946
            ],
            [
                5946,
                6370
            ],
            [
                6370,
                6656
            ],
            [
                6656,
                7146
            ],
            [
                7146,
                7678
            ],
            [
                7678,
                7946
            ],
            [
                7946,
                8140
            ],
            [
                8140,
                8355
            ],
            [
                8355,
                9078
            ],
            [
                9078,
                9359
            ],
            [
                9359,
                9521
            ],
            [
                9521,
                9784
            ],
            [
                9784,
                9985
            ],
            [
                9985,
                10065
            ],
            [
                10065,
                10105
            ],
            [
                10105,
                10189
            ],
            [
                10189,
                10702
            ],
            [
                10702,
                11135
            ],
            [
                11135,
                11420
            ],
            [
                11420,
                12020
            ],
            [
                12020,
                12117
            ],
            [
                12117,
                12149
            ],
            [
                12149,
                12430
            ],
            [
                12430,
                12688
            ],
            [
                12688,
                13100
            ],
            [
                13100,
                13247
            ],
            [
                13247,
                13472
            ],
            [
                13472,
                13606
            ],
            [
                13606,
                13895
            ]
        ],
        "segment_chars": [
            [
                0,
                121
            ],
            [
                121,
                327
            ],
            [
                327,
                459
            ],
            [
                459,
                694
            ],
            [
                694,
                843
            ],
            [
                843,
                927
            ],
            [
                927,
                1096
            ],
            [
                1096,
                1211
            ],
            [
                1211,
                1273
            ],
            [
                1273,
                1384
            ],
            [
                1384,
                1524
            ],
            [
                1524,
                1577
            ],
            [
                1577,
                1694
            ],
            [
                1694,
                1752
            ],
            [
                1752,
                1781
            ],
            [
                1781,
                1791
            ],
            [
                1791,
                1853
            ],
            [
                1853,
                1890
            ],
            [
                1890,
                1959
            ],
            [
                1959,
                2074
            ],
            [
                2074,
                2205
            ],
            [
                2205,
                2428
            ],
            [
                2428,
                2561
            ],
            [
                2561,
                2789
            ],
            [
                2789,
                2909
            ],
            [
                2909,
                2966
            ],
            [
                2966,
                3213
            ],
            [
                3213,
                3306
            ],
            [
                3306,
                3344
            ],
            [
                3344,
                3609
            ],
            [
                3609,
                3707
            ],
            [
                3707,
                3858
            ],
            [
                3858,
                3968
            ],
            [
                3968,
                4017
            ],
            [
                4017,
                4100
            ],
            [
                4100,
                4142
            ],
            [
                4142,
                4282
            ],
            [
                4282,
                4327
            ],
            [
                4327,
                4355
            ],
            [
                4355,
                4458
            ],
            [
                4458,
                4496
            ],
            [
                4496,
                4694
            ],
            [
                4694,
                4780
            ],
            [
                4780,
                4829
            ],
            [
                4829,
                4902
            ],
            [
                4902,
                5151
            ],
            [
                5151,
                5291
            ],
            [
                5291,
                5383
            ],
            [
                5383,
                5509
            ],
            [
                5509,
                5608
            ],
            [
                5608,
                5656
            ],
            [
                5656,
                5734
            ],
            [
                5734,
                5795
            ],
            [
                5795,
                5946
            ],
            [
                5946,
                6129
            ],
            [
                6129,
                6370
            ],
            [
                6370,
                6476
            ],
            [
                6476,
                6656
            ],
            [
                6656,
                7146
            ],
            [
                7146,
                7185
            ],
            [
                7185,
                7224
            ],
            [
                7224,
                7283
            ],
            [
                7283,
                7301
            ],
            [
                7301,
                7344
            ],
            [
                7344,
                7358
            ],
            [
                7358,
                7575
            ],
            [
                7575,
                7678
            ],
            [
                7678,
                7781
            ],
            [
                7781,
                7830
            ],
            [
                7830,
                7862
            ],
            [
                7862,
                7946
            ],
            [
                7946,
                8027
            ],
            [
                8027,
                8140
            ],
            [
                8140,
                8269
            ],
            [
                8269,
                8320
            ],
            [
                8320,
                8355
            ],
            [
                8355,
                8390
            ],
            [
                8390,
                8470
            ],
            [
                8470,
                8535
            ],
            [
                8535,
                8554
            ],
            [
                8554,
                8637
            ],
            [
                8637,
                8737
            ],
            [
                8737,
                8871
            ],
            [
                8871,
                8912
            ],
            [
                8912,
                8973
            ],
            [
                8973,
                9001
            ],
            [
                9001,
                9078
            ],
            [
                9078,
                9176
            ],
            [
                9176,
                9246
            ],
            [
                9246,
                9359
            ],
            [
                9359,
                9521
            ],
            [
                9521,
                9621
            ],
            [
                9621,
                9784
            ],
            [
                9784,
                9915
            ],
            [
                9915,
                9985
            ],
            [
                9985,
                10065
            ],
            [
                10065,
                10105
            ],
            [
                10105,
                10120
            ],
            [
                10120,
                10189
            ],
            [
                10189,
                10322
            ],
            [
                10322,
                10436
            ],
            [
                10436,
                10615
            ],
            [
                10615,
                10702
            ],
            [
                10702,
                10796
            ],
            [
                10796,
                11010
            ],
            [
                11010,
                11135
            ],
            [
                11135,
                11299
            ],
            [
                11299,
                11420
            ],
            [
                11420,
                11515
            ],
            [
                11515,
                11750
            ],
            [
                11750,
                11882
            ],
            [
                11882,
                12020
            ],
            [
                12020,
                12058
            ],
            [
                12058,
                12117
            ],
            [
                12117,
                12124
            ],
            [
                12124,
                12149
            ],
            [
                12149,
                12227
            ],
            [
                12227,
                12430
            ],
            [
                12430,
                12610
            ],
            [
                12610,
                12688
            ],
            [
                12688,
                12777
            ],
            [
                12777,
                12910
            ],
            [
                12910,
                12997
            ],
            [
                12997,
                13100
            ],
            [
                13100,
                13121
            ],
            [
                13121,
                13247
            ],
            [
                13247,
                13327
            ],
            [
                13327,
                13382
            ],
            [
                13382,
                13472
            ],
            [
                13472,
                13531
            ],
            [
                13531,
                13606
            ],
            [
                13606,
                13895
            ]
        ],
        "overlap_chars": [
            [
                0,
                13
            ],
            [
                14,
                43
            ],
            [
                44,
                121
            ],
            [
                121,
                136
            ],
            [
                145,
                171
            ],
            [
                182,
                207
            ],
            [
                207,
                251
            ],
            [
                256,
                287
            ],
            [
                288,
                293
            ],
            [
                294,
                320
            ],
            [
                325,
                327
            ],
            [
                327,
                341
            ],
            [
                342,
                357
            ],
            [
                358,
                418
            ],
            [
                423,
                424
            ],
            [
                425,
                428
            ],
            [
                429,
                442
            ],
            [
                452,
                459
            ],
            [
                459,
                496
            ],
            [
                503,
                516
            ],
            [
                517,
                547
            ],
            [
                549,
                567
            ],
            [
                568,
                577
            ],
            [
                578,
                580
            ],
            [
                581,
                604
            ],
            [
                605,
                615
            ],
            [
                616,
                638
            ],
            [
                639,
                651
            ],
            [
                651,
                656
            ],
            [
                657,
                676
            ],
            [
                677,
                682
            ],
            [
                683,
                686
            ],
            [
                687,
                692
            ],
            [
                692,
                694
            ],
            [
                694,
                717
            ],
            [
                727,
                751
            ],
            [
                752,
                780
            ],
            [
                781,
                783
            ],
            [
                788,
                797
            ],
            [
                799,
                822
            ],
            [
                823,
                825
            ],
            [
                831,
                841
            ],
            [
                841,
                843
            ],
            [
                847,
                851
            ],
            [
                872,
                875
            ],
            [
                876,
                885
            ],
            [
                886,
                893
            ],
            [
                894,
                906
            ],
            [
                907,
                925
            ],
            [
                925,
                927
            ],
            [
                927,
                929
            ],
            [
                930,
                939
            ],
            [
                942,
                961
            ],
            [
                962,
                968
            ],
            [
                974,
                986
            ],
            [
                991,
                1008
            ],
            [
                1009,
                1035
            ],
            [
                1036,
                1096
            ],
            [
                1096,
                1179
            ],
            [
                1180,
                1187
            ],
            [
                1188,
                1197
            ],
            [
                1198,
                1201
            ],
            [
                1202,
                1209
            ],
            [
                1209,
                1211
            ],
            [
                1211,
                1238
            ],
            [
                1239,
                1266
            ],
            [
                1271,
                1272
            ],
            [
                1273,
                1312
            ],
            [
                1323,
                1334
            ],
            [
                1334,
                1347
            ],
            [
                1347,
                1383
            ],
            [
                1396,
                1397
            ],
            [
                1398,
                1475
            ],
            [
                1481,
                1524
            ],
            [
                1530,
                1533
            ],
            [
                1534,
                1577
            ],
            [
                1581,
                1628
            ],
            [
                1637,
                1641
            ],
            [
                1642,
                1694
            ],
            [
                1694,
                1697
            ],
            [
                1698,
                1735
            ],
            [
                1739,
                1750
            ],
            [
                1750,
                1751
            ],
            [
                1752,
                1768
            ],
            [
                1778,
                1781
            ],
            [
                1781,
                1789
            ],
            [
                1789,
                1790
            ],
            [
                1791,
                1853
            ],
            [
                1853,
                1857
            ],
            [
                1868,
                1890
            ],
            [
                1890,
                1908
            ],
            [
                1909,
                1933
            ],
            [
                1933,
                1957
            ],
            [
                1959,
                1990
            ],
            [
                1996,
                2074
            ],
            [
                2074,
                2100
            ],
            [
                2101,
                2115
            ],
            [
                2116,
                2138
            ],
            [
                2139,
                2148
            ],
            [
                2149,
                2164
            ],
            [
                2176,
                2179
            ],
            [
                2182,
                2205
            ],
            [
                2205,
                2216
            ],
            [
                2226,
                2269
            ],
            [
                2269,
                2323
            ],
            [
                2323,
                2324
            ],
            [
                2325,
                2353
            ],
            [
                2354,
                2426
            ],
            [
                2428,
                2437
            ],
            [
                2441,
                2444
            ],
            [
                2445,
                2519
            ],
            [
                2520,
                2526
            ],
            [
                2527,
                2559
            ],
            [
                2559,
                2561
            ],
            [
                2561,
                2565
            ],
            [
                2566,
                2601
            ],
            [
                2602,
                2717
            ],
            [
                2718,
                2789
            ],
            [
                2789,
                2909
            ],
            [
                2909,
                2911
            ],
            [
                2916,
                2966
            ],
            [
                2966,
                3044
            ],
            [
                3045,
                3050
            ],
            [
                3057,
                3086
            ],
            [
                3087,
                3136
            ],
            [
                3137,
                3173
            ],
            [
                3173,
                3174
            ],
            [
                3175,
                3178
            ],
            [
                3179,
                3204
            ],
            [
                3205,
                3211
            ],
            [
                3211,
                3213
            ],
            [
                3213,
                3258
            ],
            [
                3259,
                3298
            ],
            [
                3304,
                3306
            ],
            [
                3306,
                3313
            ],
            [
                3318,
                3342
            ],
            [
                3342,
                3343
            ],
            [
                3344,
                3368
            ],
            [
                3373,
                3388
            ],
            [
                3389,
                3505
            ],
            [
                3506,
                3534
            ],
            [
                3540,
                3609
            ],
            [
                3609,
                3660
            ],
            [
                3661,
                3678
            ],
            [
                3679,
                3699
            ],
            [
                3700,
                3706
            ],
            [
                3707,
                3787
            ],
            [
                3787,
                3801
            ],
            [
                3802,
                3858
            ],
            [
                3858,
                3884
            ],
            [
                3890,
                3968
            ],
            [
                3968,
                4015
            ],
            [
                4015,
                4017
            ],
            [
                4017,
                4100
            ],
            [
                4100,
                4129
            ],
            [
                4129,
                4142
            ],
            [
                4142,
                4270
            ],
            [
                4280,
                4282
            ],
            [
                4282,
                4324
            ],
            [
                4327,
                4330
            ],
            [
                4331,
                4335
            ],
            [
                4339,
                4345
            ],
            [
                4346,
                4353
            ],
            [
                4353,
                4355
            ],
            [
                4355,
                4382
            ],
            [
                4383,
                4393
            ],
            [
                4414,
                4458
            ],
            [
                4458,
                4472
            ],
            [
                4472,
                4482
            ],
            [
                4483,
                4486
            ],
            [
                4487,
                4496
            ],
            [
                4496,
                4534
            ],
            [
                4541,
                4543
            ],
            [
                4544,
                4549
            ],
            [
                4550,
                4552
            ],
            [
                4553,
                4556
            ],
            [
                4557,
                4564
            ],
            [
                4564,
                4595
            ],
            [
                4595,
                4600
            ],
            [
                4601,
                4613
            ],
            [
                4620,
                4623
            ],
            [
                4631,
                4634
            ],
            [
                4641,
                4649
            ],
            [
                4649,
                4650
            ],
            [
                4651,
                4654
            ],
            [
                4655,
                4692
            ],
            [
                4694,
                4696
            ],
            [
                4697,
                4725
            ],
            [
                4726,
                4736
            ],
            [
                4743,
                4763
            ],
            [
                4764,
                4780
            ],
            [
                4780,
                4798
            ],
            [
                4799,
                4829
            ],
            [
                4829,
                4854
            ],
            [
                4859,
                4865
            ],
            [
                4866,
                4870
            ],
            [
                4876,
                4900
            ],
            [
                4900,
                4902
            ],
            [
                4902,
                4927
            ],
            [
                4928,
                4931
            ],
            [
                4932,
                4941
            ],
            [
                4942,
                4947
            ],
            [
                4957,
                4970
            ],
            [
                4976,
                4978
            ],
            [
                4985,
                4993
            ],
            [
                4998,
                5044
            ],
            [
                5044,
                5099
            ],
            [
                5100,
                5112
            ],
            [
                5113,
                5151
            ],
            [
                5154,
                5155
            ],
            [
                5156,
                5162
            ],
            [
                5162,
                5163
            ],
            [
                5171,
                5174
            ],
            [
                5174,
                5196
            ],
            [
                5196,
                5241
            ],
            [
                5242,
                5245
            ],
            [
                5246,
                5289
            ],
            [
                5289,
                5291
            ],
            [
                5300,
                5355
            ],
            [
                5365,
                5383
            ],
            [
                5383,
                5385
            ],
            [
                5386,
                5509
            ],
            [
                5516,
                5526
            ],
            [
                5531,
                5534
            ],
            [
                5542,
                5550
            ],
            [
                5550,
                5562
            ],
            [
                5563,
                5589
            ],
            [
                5590,
                5608
            ],
            [
                5608,
                5656
            ],
            [
                5656,
                5734
            ],
            [
                5734,
                5786
            ],
            [
                5787,
                5795
            ],
            [
                5795,
                5811
            ],
            [
                5812,
                5835
            ],
            [
                5844,
                5901
            ],
            [
                5902,
                5934
            ],
            [
                5935,
                5937
            ],
            [
                5944,
                5945
            ],
            [
                5946,
                5974
            ],
            [
                5975,
                6102
            ],
            [
                6108,
                6129
            ],
            [
                6129,
                6164
            ],
            [
                6165,
                6252
            ],
            [
                6252,
                6257
            ],
            [
                6258,
                6285
            ],
            [
                6291,
                6300
            ],
            [
                6301,
                6306
            ],
            [
                6307,
                6327
            ],
            [
                6328,
                6330
            ],
            [
                6335,
                6360
            ],
            [
                6368,
                6369
            ],
            [
                6370,
                6404
            ],
            [
                6404,
                6425
            ],
            [
                6426,
                6475
            ],
            [
                6476,
                6504
            ],
            [
                6514,
                6517
            ],
            [
                6518,
                6525
            ],
            [
                6525,
                6527
            ],
            [
                6528,
                6536
            ],
            [
                6537,
                6558
            ],
            [
                6566,
                6608
            ],
            [
                6609,
                6654
            ],
            [
                6654,
                6656
            ],
            [
                6656,
                6684
            ],
            [
                6699,
                6746
            ],
            [
                6747,
                6768
            ],
            [
                6776,
                6830
            ],
            [
                6833,
                6844
            ],
            [
                6847,
                6874
            ],
            [
                6878,
                6880
            ],
            [
                6881,
                6884
            ],
            [
                6887,
                6917
            ],
            [
                6923,
                7001
            ],
            [
                7015,
                7056
            ],
            [
                7059,
                7062
            ],
            [
                7063,
                7073
            ],
            [
                7074,
                7087
            ],
            [
                7087,
                7133
            ],
            [
                7134,
                7145
            ],
            [
                7146,
                7150
            ],
            [
                7166,
                7177
            ],
            [
                7178,
                7185
            ],
            [
                7185,
                7222
            ],
            [
                7222,
                7224
            ],
            [
                7235,
                7283
            ],
            [
                7283,
                7301
            ],
            [
                7301,
                7327
            ],
            [
                7331,
                7344
            ],
            [
                7344,
                7358
            ],
            [
                7358,
                7386
            ],
            [
                7387,
                7393
            ],
            [
                7394,
                7401
            ],
            [
                7401,
                7447
            ],
            [
                7448,
                7493
            ],
            [
                7501,
                7509
            ],
            [
                7511,
                7514
            ],
            [
                7519,
                7544
            ],
            [
                7545,
                7548
            ],
            [
                7555,
                7558
            ],
            [
                7564,
                7573
            ],
            [
                7573,
                7575
            ],
            [
                7575,
                7608
            ],
            [
                7615,
                7624
            ],
            [
                7625,
                7655
            ],
            [
                7656,
                7678
            ],
            [
                7678,
                7735
            ],
            [
                7738,
                7743
            ],
            [
                7745,
                7749
            ],
            [
                7761,
                7771
            ],
            [
                7775,
                7779
            ],
            [
                7779,
                7781
            ],
            [
                7781,
                7830
            ],
            [
                7830,
                7862
            ],
            [
                7862,
                7891
            ],
            [
                7894,
                7918
            ],
            [
                7919,
                7945
            ],
            [
                7946,
                7978
            ],
            [
                7980,
                8025
            ],
            [
                8027,
                8095
            ],
            [
                8096,
                8099
            ],
            [
                8113,
                8140
            ],
            [
                8140,
                8206
            ],
            [
                8207,
                8217
            ],
            [
                8221,
                8224
            ],
            [
                8229,
                8247
            ],
            [
                8261,
                8268
            ],
            [
                8269,
                8273
            ],
            [
                8274,
                8277
            ],
            [
                8278,
                8283
            ],
            [
                8284,
                8312
            ],
            [
                8313,
                8320
            ],
            [
                8320,
                8353
            ],
            [
                8353,
                8355
            ],
            [
                8355,
                8371
            ],
            [
                8372,
                8390
            ],
            [
                8390,
                8403
            ],
            [
                8403,
                8438
            ],
            [
                8438,
                8452
            ],
            [
                8460,
                8466
            ],
            [
                8468,
                8470
            ],
            [
                8470,
                8490
            ],
            [
                8496,
                8499
            ],
            [
                8507,
                8535
            ],
            [
                8535,
                8552
            ],
            [
                8552,
                8554
            ],
            [
                8554,
                8637
            ],
            [
                8637,
                8653
            ],
            [
                8654,
                8656
            ],
            [
                8657,
                8711
            ],
            [
                8717,
                8735
            ],
            [
                8735,
                8737
            ],
            [
                8737,
                8740
            ],
            [
                8741,
                8782
            ],
            [
                8791,
                8817
            ],
            [
                8818,
                8821
            ],
            [
                8830,
                8834
            ],
            [
                8835,
                8838
            ],
            [
                8839,
                8871
            ],
            [
                8871,
                8912
            ],
            [
                8912,
                8971
            ],
            [
                8971,
                8973
            ],
            [
                8973,
                9001
            ],
            [
                9001,
                9023
            ],
            [
                9031,
                9078
            ],
            [
                9086,
                9093
            ],
            [
                9094,
                9097
            ],
            [
                9098,
                9111
            ],
            [
                9113,
                9116
            ],
            [
                9126,
                9175
            ],
            [
                9176,
                9246
            ],
            [
                9246,
                9317
            ],
            [
                9323,
                9334
            ],
            [
                9335,
                9339
            ],
            [
                9355,
                9357
            ],
            [
                9357,
                9359
            ],
            [
                9359,
                9365
            ],
            [
                9373,
                9389
            ],
            [
                9392,
                9435
            ],
            [
                9436,
                9460
            ],
            [
                9467,
                9520
            ],
            [
                9526,
                9574
            ],
            [
                9575,
                9600
            ],
            [
                9601,
                9621
            ],
            [
                9621,
                9675
            ],
            [
                9676,
                9736
            ],
            [
                9737,
                9743
            ],
            [
                9757,
                9783
            ],
            [
                9784,
                9833
            ],
            [
                9833,
                9915
            ],
            [
                9915,
                9941
            ],
            [
                9942,
                9985
            ],
            [
                9985,
                9998
            ],
            [
                10004,
                10065
            ],
            [
                10065,
                10102
            ],
            [
                10105,
                10118
            ],
            [
                10118,
                10120
            ],
            [
                10120,
                10181
            ],
            [
                10186,
                10189
            ],
            [
                10192,
                10198
            ],
            [
                10199,
                10240
            ],
            [
                10240,
                10320
            ],
            [
                10322,
                10326
            ],
            [
                10327,
                10436
            ],
            [
                10436,
                10519
            ],
            [
                10525,
                10563
            ],
            [
                10564,
                10567
            ],
            [
                10572,
                10581
            ],
            [
                10582,
                10607
            ],
            [
                10613,
                10615
            ],
            [
                10615,
                10625
            ],
            [
                10633,
                10651
            ],
            [
                10652,
                10678
            ],
            [
                10679,
                10700
            ],
            [
                10700,
                10702
            ],
            [
                10702,
                10794
            ],
            [
                10796,
                10798
            ],
            [
                10799,
                10934
            ],
            [
                10935,
                10945
            ],
            [
                10946,
                10985
            ],
            [
                10986,
                11010
            ],
            [
                11010,
                11038
            ],
            [
                11041,
                11076
            ],
            [
                11077,
                11087
            ],
            [
                11090,
                11116
            ],
            [
                11117,
                11122
            ],
            [
                11133,
                11135
            ],
            [
                11135,
                11142
            ],
            [
                11150,
                11159
            ],
            [
                11160,
                11172
            ],
            [
                11172,
                11216
            ],
            [
                11217,
                11283
            ],
            [
                11283,
                11284
            ],
            [
                11299,
                11312
            ],
            [
                11313,
                11329
            ],
            [
                11330,
                11370
            ],
            [
                11371,
                11420
            ],
            [
                11420,
                11515
            ],
            [
                11515,
                11531
            ],
            [
                11532,
                11562
            ],
            [
                11574,
                11583
            ],
            [
                11591,
                11643
            ],
            [
                11660,
                11663
            ],
            [
                11664,
                11750
            ],
            [
                11750,
                11808
            ],
            [
                11808,
                11880
            ],
            [
                11880,
                11882
            ],
            [
                11887,
                11918
            ],
            [
                11919,
                11956
            ],
            [
                11963,
                11971
            ],
            [
                11976,
                11999
            ],
            [
                12018,
                12020
            ],
            [
                12020,
                12033
            ],
            [
                12034,
                12040
            ],
            [
                12041,
                12056
            ],
            [
                12056,
                12057
            ],
            [
                12058,
                12100
            ],
            [
                12101,
                12106
            ],
            [
                12107,
                12110
            ],
            [
                12111,
                12115
            ],
            [
                12115,
                12116
            ],
            [
                12117,
                12124
            ],
            [
                12124,
                12149
            ],
            [
                12149,
                12191
            ],
            [
                12195,
                12202
            ],
            [
                12202,
                12227
            ],
            [
                12233,
                12239
            ],
            [
                12259,
                12270
            ],
            [
                12270,
                12295
            ],
            [
                12298,
                12330
            ],
            [
                12331,
                12344
            ],
            [
                12345,
                12377
            ],
            [
                12380,
                12424
            ],
            [
                12428,
                12430
            ],
            [
                12436,
                12495
            ],
            [
                12496,
                12513
            ],
            [
                12518,
                12560
            ],
            [
                12570,
                12610
            ],
            [
                12610,
                12670
            ],
            [
                12671,
                12677
            ],
            [
                12686,
                12688
            ],
            [
                12688,
                12697
            ],
            [
                12697,
                12698
            ],
            [
                12699,
                12707
            ],
            [
                12708,
                12717
            ],
            [
                12722,
                12731
            ],
            [
                12735,
                12736
            ],
            [
                12737,
                12766
            ],
            [
                12767,
                12775
            ],
            [
                12775,
                12777
            ],
            [
                12777,
                12910
            ],
            [
                12910,
                12963
            ],
            [
                12965,
                12988
            ],
            [
                12989,
                12997
            ],
            [
                12997,
                13046
            ],
            [
                13052,
                13099
            ],
            [
                13100,
                13121
            ],
            [
                13121,
                13166
            ],
            [
                13167,
                13199
            ],
            [
                13200,
                13205
            ],
            [
                13206,
                13221
            ],
            [
                13222,
                13232
            ],
            [
                13236,
                13245
            ],
            [
                13245,
                13247
            ],
            [
                13247,
                13259
            ],
            [
                13266,
                13312
            ],
            [
                13325,
                13327
            ],
            [
                13327,
                13350
            ],
            [
                13351,
                13366
            ],
            [
                13370,
                13382
            ],
            [
                13382,
                13463
            ],
            [
                13470,
                13471
            ],
            [
                13472,
                13529
            ],
            [
                13531,
                13606
            ],
            [
                13606,
                13621
            ],
            [
                13631,
                13697
            ],
            [
                13698,
                13758
            ],
            [
                13765,
                13781
            ],
            [
                13783,
                13826
            ],
            [
                13827,
                13829
            ],
            [
                13830,
                13895
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                327
            ],
            [
                327,
                459
            ],
            [
                459,
                694
            ],
            [
                694,
                843
            ],
            [
                843,
                927
            ],
            [
                927,
                1096
            ],
            [
                1096,
                1211
            ],
            [
                1211,
                1273
            ],
            [
                1273,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1384
            ],
            [
                1384,
                1524
            ],
            [
                1524,
                1524
            ],
            [
                1524,
                1577
            ],
            [
                1577,
                1694
            ],
            [
                1694,
                1752
            ],
            [
                1752,
                1781
            ],
            [
                1781,
                1791
            ],
            [
                1791,
                1791
            ],
            [
                1791,
                1853
            ],
            [
                1853,
                1890
            ],
            [
                1890,
                2074
            ],
            [
                2074,
                2205
            ],
            [
                2205,
                2561
            ],
            [
                2561,
                2789
            ],
            [
                2789,
                2909
            ],
            [
                2909,
                2966
            ],
            [
                2966,
                3213
            ],
            [
                3213,
                3306
            ],
            [
                3306,
                3344
            ],
            [
                3344,
                3609
            ],
            [
                3609,
                3707
            ],
            [
                3707,
                3858
            ],
            [
                3858,
                3968
            ],
            [
                3968,
                4017
            ],
            [
                4017,
                4100
            ],
            [
                4100,
                4142
            ],
            [
                4142,
                4282
            ],
            [
                4282,
                4355
            ],
            [
                4355,
                4458
            ],
            [
                4458,
                4496
            ],
            [
                4496,
                4780
            ],
            [
                4780,
                4829
            ],
            [
                4829,
                4902
            ],
            [
                4902,
                5151
            ],
            [
                5151,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5291
            ],
            [
                5291,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5383
            ],
            [
                5383,
                5509
            ],
            [
                5509,
                5608
            ],
            [
                5608,
                5656
            ],
            [
                5656,
                5734
            ],
            [
                5734,
                5795
            ],
            [
                5795,
                5946
            ],
            [
                5946,
                6129
            ],
            [
                6129,
                6370
            ],
            [
                6370,
                6476
            ],
            [
                6476,
                6656
            ],
            [
                6656,
                7146
            ],
            [
                7146,
                7185
            ],
            [
                7185,
                7224
            ],
            [
                7224,
                7283
            ],
            [
                7283,
                7301
            ],
            [
                7301,
                7344
            ],
            [
                7344,
                7358
            ],
            [
                7358,
                7575
            ],
            [
                7575,
                7678
            ],
            [
                7678,
                7781
            ],
            [
                7781,
                7830
            ],
            [
                7830,
                7862
            ],
            [
                7862,
                7946
            ],
            [
                7946,
                7946
            ],
            [
                7946,
                8140
            ],
            [
                8140,
                8269
            ],
            [
                8269,
                8320
            ],
            [
                8320,
                8355
            ],
            [
                8355,
                8390
            ],
            [
                8390,
                8470
            ],
            [
                8470,
                8535
            ],
            [
                8535,
                8554
            ],
            [
                8554,
                8637
            ],
            [
                8637,
                8737
            ],
            [
                8737,
                8871
            ],
            [
                8871,
                8871
            ],
            [
                8871,
                8871
            ],
            [
                8871,
                8912
            ],
            [
                8912,
                8912
            ],
            [
                8912,
                8912
            ],
            [
                8912,
                8912
            ],
            [
                8912,
                8973
            ],
            [
                8973,
                9001
            ],
            [
                9001,
                9001
            ],
            [
                9001,
                9078
            ],
            [
                9078,
                9176
            ],
            [
                9176,
                9246
            ],
            [
                9246,
                9359
            ],
            [
                9359,
                9521
            ],
            [
                9521,
                9521
            ],
            [
                9521,
                9621
            ],
            [
                9621,
                9784
            ],
            [
                9784,
                9915
            ],
            [
                9915,
                9985
            ],
            [
                9985,
                10065
            ],
            [
                10065,
                10105
            ],
            [
                10105,
                10120
            ],
            [
                10120,
                10120
            ],
            [
                10120,
                10189
            ],
            [
                10189,
                10436
            ],
            [
                10436,
                10615
            ],
            [
                10615,
                10702
            ],
            [
                10702,
                11010
            ],
            [
                11010,
                11420
            ],
            [
                11420,
                11515
            ],
            [
                11515,
                11750
            ],
            [
                11750,
                11882
            ],
            [
                11882,
                12020
            ],
            [
                12020,
                12058
            ],
            [
                12058,
                12117
            ],
            [
                12117,
                12117
            ],
            [
                12117,
                12124
            ],
            [
                12124,
                12149
            ],
            [
                12149,
                12227
            ],
            [
                12227,
                12430
            ],
            [
                12430,
                12610
            ],
            [
                12610,
                12688
            ],
            [
                12688,
                12777
            ],
            [
                12777,
                12910
            ],
            [
                12910,
                12997
            ],
            [
                12997,
                13100
            ],
            [
                13100,
                13121
            ],
            [
                13121,
                13247
            ],
            [
                13247,
                13327
            ],
            [
                13327,
                13382
            ],
            [
                13382,
                13472
            ],
            [
                13472,
                13606
            ],
            [
                13606,
                13895
            ]
        ]
    }
}