{
    "original": {
        "text": "Our friends at Brompton were meanwhile passing their Christmas after their fashion and in a manner by no means too cheerful.\nOut of the hundred pounds a year, which was about the amount of her income, the Widow Osborne had been in the habit of giving up nearly three-fourths to her father and mother, for the expenses of herself and her little boy. With 120_l_. more, supplied by Jos, this family of four people, attended by a single Irish servant who also did for Clapp and his wife, might manage to live in decent comfort through the year, and hold up their heads yet, and be able to give a friend a dish of tea still, after the storms and disappointments of their early life. Sedley still maintained his ascendency over the family of Mr. Clapp, his ex-clerk. Clapp remembered the time when, sitting on the edge of the chair, he tossed off a bumper to the health of \"Mrs. S--, Miss Emmy, and Mr. Joseph in India,\" at the merchant's rich table in Russell Square. Time magnified the splendour of those recollections in the honest clerk's bosom. Whenever he came up from the kitchen-parlour to the drawing-room and partook of tea or gin-and-water with Mr. Sedley, he would say, \"This was not what you was accustomed to once, sir,\" and as gravely and reverentially drink the health of the ladies as he had done in the days of their utmost prosperity. He thought Miss 'Melia's playing the divinest music ever performed, and her the finest lady. He never would sit down before Sedley at the club even, nor would he have that gentleman's character abused by any member of the society. He had seen the first men in London shaking hands with Mr. S--; he said, \"He'd known him in times when Rothschild might be seen on 'Change with him any day, and he owed him personally everythink.\"\nClapp, with the best of characters and handwritings, had been able very soon after his master's disaster to find other employment for himself. \"Such a little fish as me can swim in any bucket,\" he used to remark, and a member of the house from which old Sedley had seceded was very glad to make use of Mr. Clapp's services and to reward them with a comfortable salary. In fine, all Sedley's wealthy friends had dropped off one by one, and this poor ex-dependent still remained faithfully attached to him.\nOut of the small residue of her income which Amelia kept back for herself, the widow had need of all the thrift and care possible in order to enable her to keep her darling boy dressed in such a manner as became George Osborne's son, and to defray the expenses of the little school to which, after much misgiving and reluctance and many secret pangs and fears on her own part, she had been induced to send the lad. She had sat up of nights conning lessons and spelling over crabbed grammars and geography books in order to teach them to Georgy. She had worked even at the Latin accidence, fondly hoping that she might be capable of instructing him in that language. To part with him all day, to send him out to the mercy of a schoolmaster's cane and his schoolfellows' roughness, was almost like weaning him over again to that weak mother, so tremulous and full of sensibility. He, for his part, rushed off to the school with the utmost happiness. He was longing for the change. That childish gladness wounded his mother, who was herself so grieved to part with him. She would rather have had him more sorry, she thought, and then was deeply repentant within herself for daring to be so selfish as to wish her own son to be unhappy.\nGeorgy made great progress in the school, which was kept by a friend of his mother's constant admirer, the Rev. Mr. Binny. He brought home numberless prizes and testimonials of ability. He told his mother countless stories every night about his school-companions: and what a fine fellow Lyons was, and what a sneak Sniffin was, and how Steel's father actually supplied the meat for the establishment, whereas Golding's mother came in a carriage to fetch him every Saturday, and how Neat had straps to his trowsers--might he have straps?--and how Bull Major was so strong (though only in Eutropius) that it was believed he could lick the Usher, Mr. Ward, himself. So Amelia learned to know every one of the boys in that school as well as Georgy himself, and of nights she used to help him in his exercises and puzzle her little head over his lessons as eagerly as if she was herself going in the morning into the presence of the master. Once, after a certain combat with Master Smith, George came home to his mother with a black eye, and bragged prodigiously to his parent and his delighted old grandfather about his valour in the fight, in which, if the truth was known he did not behave with particular heroism, and in which he decidedly had the worst. But Amelia has never forgiven that Smith to this day, though he is now a peaceful apothecary near Leicester Square.\nIn these quiet labours and harmless cares the gentle widow's life was passing away, a silver hair or two marking the progress of time on her head and a line deepening ever so little on her fair forehead. She used to smile at these marks of time. \"What matters it,\" she asked, \"For an old woman like me?\" All she hoped for was to live to see her son great, famous, and glorious, as he deserved to be. She kept his copy-books, his drawings, and compositions, and showed them about in her little circle as if they were miracles of genius. She confided some of these specimens to Miss Dobbin, to show them to Miss Osborne, George's aunt, to show them to Mr. Osborne himself--to make that old man repent of his cruelty and ill feeling towards him who was gone. All her husband's faults and foibles she had buried in the grave with him: she only remembered the lover, who had married her at all sacrifices, the noble husband, so brave and beautiful, in whose arms she had hung on the morning when he had gone away to fight, and die gloriously for his king. From heaven the hero must be smiling down upon that paragon of a boy whom he had left to comfort and console her. We have seen how one of George's grandfathers (Mr. Osborne), in his easy chair in Russell Square, daily grew more violent and moody, and how his daughter, with her fine carriage, and her fine horses, and her name on half the public charity-lists of the town, was a lonely, miserable, persecuted old maid. She thought again and again of the beautiful little boy, her brother's son, whom she had seen. She longed to be allowed to drive in the fine carriage to the house in which he lived, and she used to look out day after day as she took her solitary drive in the park, in hopes that she might see him. Her sister, the banker's lady, occasionally condescended to pay her old home and companion a visit in Russell Square. She brought a couple of sickly children attended by a prim nurse, and in a faint genteel giggling tone cackled to her sister about her fine acquaintance, and how her little Frederick was the image of Lord Claud Lollypop and her sweet Maria had been noticed by the Baroness as they were driving in their donkey-chaise at Roehampton. She urged her to make her papa do something for the darlings. Frederick she had determined should go into the Guards; and if they made an elder son of him (and Mr. Bullock was positively ruining and pinching himself to death to buy land), how was the darling girl to be provided for? \"I expect YOU, dear,\" Mrs. Bullock would say, \"for of course my share of our Papa's property must go to the head of the house, you know. Dear Rhoda McMull will disengage the whole of the Castletoddy property as soon as poor dear Lord Castletoddy dies, who is quite epileptic; and little Macduff McMull will be Viscount Castletoddy. Both the Mr. Bludyers of Mincing Lane have settled their fortunes on Fanny Bludyer's little boy. My darling Frederick must positively be an eldest son; and--and do ask Papa to bring us back his account in Lombard Street, will you, dear? It doesn't look well, his going to Stumpy and Rowdy's.\" After which kind of speeches, in which fashion and the main chance were blended together, and after a kiss, which was like the contact of an oyster--Mrs. Frederick Bullock would gather her starched nurslings and simper back into her carriage.\nEvery visit which this leader of ton paid to her family was more unlucky for her. Her father paid more money into Stumpy and Rowdy's. Her patronage became more and more insufferable. The poor widow in the little cottage at Brompton, guarding her treasure there, little knew how eagerly some people coveted it.\nOn that night when Jane Osborne had told her father that she had seen his grandson, the old man had made her no reply, but he had shown no anger--and had bade her good-night on going himself to his room in rather a kindly voice. And he must have meditated on what she said and have made some inquiries of the Dobbin family regarding her visit, for a fortnight after it took place, he asked her where was her little French watch and chain she used to wear?\n\"I bought it with my money, sir,\" she said in a great fright.\n\"Go and order another like it, or a better if you can get it,\" said the old gentleman and lapsed again into silence.\nOf late the Misses Dobbin more than once repeated their entreaties to Amelia, to allow George to visit them. His aunt had shown her inclination; perhaps his grandfather himself, they hinted, might be disposed to be reconciled to him. Surely, Amelia could not refuse such advantageous chances for the boy. Nor could she, but she acceded to their overtures with a very heavy and suspicious heart, was always uneasy during the child's absence from her, and welcomed him back as if he was rescued out of some danger. He brought back money and toys, at which the widow looked with alarm and jealousy; she asked him always if he had seen any gentleman--\"Only old Sir William, who drove him about in the four-wheeled chaise, and Mr. Dobbin, who arrived on the beautiful bay horse in the afternoon--in the green coat and pink neck-cloth, with the gold-headed whip, who promised to show him the Tower of London and take him out with the Surrey hounds.\" At last, he said, \"There was an old gentleman, with thick eyebrows, and a broad hat, and large chain and seals.\" He came one day as the coachman was lunging Georgy round the lawn on the gray pony. \"He looked at me very much. He shook very much. I said 'My name is Norval' after dinner. My aunt began to cry. She is always crying.\" Such was George's report on that night.\nThen Amelia knew that the boy had seen his grandfather; and looked out feverishly for a proposal which she was sure would follow, and which came, in fact, in a few days afterwards. Mr. Osborne formally offered to take the boy and make him heir to the fortune which he had intended that his father should inherit. He would make Mrs. George Osborne an allowance, such as to assure her a decent competency. If Mrs. George Osborne proposed to marry again, as Mr. O. heard was her intention, he would not withdraw that allowance. But it must be understood that the child would live entirely with his grandfather in Russell Square, or at whatever other place Mr. O. should select, and that he would be occasionally permitted to see Mrs. George Osborne at her own residence. This message was brought or read to her in a letter one day, when her mother was from home and her father absent as usual in the City.\nShe was never seen angry but twice or thrice in her life, and it was in one of these moods that Mr. Osborne's attorney had the fortune to behold her. She rose up trembling and flushing very much as soon as, after reading the letter, Mr. Poe handed it to her, and she tore the paper into a hundred fragments, which she trod on. \"I marry again! I take money to part from my child! Who dares insult me by proposing such a thing? Tell Mr. Osborne it is a cowardly letter, sir--a cowardly letter--I will not answer it. I wish you good morning, sir--and she bowed me out of the room like a tragedy Queen,\" said the lawyer who told the story.\nHer parents never remarked her agitation on that day, and she never told them of the interview. They had their own affairs to interest them, affairs which deeply interested this innocent and unconscious lady. The old gentleman, her father, was always dabbling in speculation. We have seen how the wine company and the coal company had failed him. But, prowling about the City always eagerly and restlessly still, he lighted upon some other scheme, of which he thought so well that he embarked in it in spite of the remonstrances of Mr. Clapp, to whom indeed he never dared to tell how far he had engaged himself in it. And as it was always Mr. Sedley's maxim not to talk about money matters before women, they had no inkling of the misfortunes that were in store for them until the unhappy old gentleman was forced to make gradual confessions.\nThe bills of the little household, which had been settled weekly, first fell into arrear. The remittances had not arrived from India, Mr. Sedley told his wife with a disturbed face. As she had paid her bills very regularly hitherto, one or two of the tradesmen to whom the poor lady was obliged to go round asking for time were very angry at a delay to which they were perfectly used from more irregular customers. Emmy's contribution, paid over cheerfully without any questions, kept the little company in half-rations however. And the first six months passed away pretty easily, old Sedley still keeping up with the notion that his shares must rise and that all would be well.\nNo sixty pounds, however, came to help the household at the end of the half year, and it fell deeper and deeper into trouble--Mrs. Sedley, who was growing infirm and was much shaken, remained silent or wept a great deal with Mrs. Clapp in the kitchen. The butcher was particularly surly, the grocer insolent: once or twice little Georgy had grumbled about the dinners, and Amelia, who still would have been satisfied with a slice of bread for her own dinner, could not but perceive that her son was neglected and purchased little things out of her private purse to keep the boy in health.\nAt last they told her, or told her such a garbled story as people in difficulties tell. One day, her own money having been received, and Amelia about to pay it over, she, who had kept an account of the moneys expended by her, proposed to keep a certain portion back out of her dividend, having contracted engagements for a new suit for Georgy.\nThen it came out that Jos's remittances were not paid, that the house was in difficulties, which Amelia ought to have seen before, her mother said, but she cared for nothing or nobody except Georgy. At this she passed all her money across the table, without a word, to her mother, and returned to her room to cry her eyes out. She had a great access of sensibility too that day, when obliged to go and countermand the clothes, the darling clothes on which she had set her heart for Christmas Day, and the cut and fashion of which she had arranged in many conversations with a small milliner, her friend.\nHardest of all, she had to break the matter to Georgy, who made a loud outcry. Everybody had new clothes at Christmas. The others would laugh at him. He would have new clothes. She had promised them to him. The poor widow had only kisses to give him. She darned the old suit in tears. She cast about among her little ornaments to see if she could sell anything to procure the desired novelties. There was her India shawl that Dobbin had sent her. She remembered in former days going with her mother to a fine India shop on Ludgate Hill, where the ladies had all sorts of dealings and bargains in these articles. Her cheeks flushed and her eyes shone with pleasure as she thought of this resource, and she kissed away George to school in the morning, smiling brightly after him. The boy felt that there was good news in her look.\nPacking up her shawl in a handkerchief (another of the gifts of the good Major), she hid them under her cloak and walked flushed and eager all the way to Ludgate Hill, tripping along by the park wall and running over the crossings, so that many a man turned as she hurried by him and looked after her rosy pretty face. She calculated how she should spend the proceeds of her shawl--how, besides the clothes, she would buy the books that he longed for, and pay his half-year's schooling; and how she would buy a cloak for her father instead of that old great-coat which he wore. She was not mistaken as to the value of the Major's gift. It was a very fine and beautiful web, and the merchant made a very good bargain when he gave her twenty guineas for her shawl.\nShe ran on amazed and flurried with her riches to Darton's shop, in St. Paul's Churchyard, and there purchased the Parents' Assistant and the Sandford and Merton Georgy longed for, and got into the coach there with her parcel, and went home exulting. And she pleased herself by writing in the fly-leaf in her neatest little hand, \"George Osborne, A Christmas gift from his affectionate mother.\" The books are extant to this day, with the fair delicate superscription.\nShe was going from her own room with the books in her hand to place them on George's table, where he might find them on his return from school, when in the passage, she and her mother met. The gilt bindings of the seven handsome little volumes caught the old lady's eye.\n\"What are those?\" she said.\n\"Some books for Georgy,\" Amelia replied--\"I--I promised them to him at Christmas.\"\n\"Books!\" cried the elder lady indignantly, \"Books, when the whole house wants bread! Books, when to keep you and your son in luxury, and your dear father out of gaol, I've sold every trinket I had, the India shawl from my back even down to the very spoons, that our tradesmen mightn't insult us, and that Mr. Clapp, which indeed he is justly entitled, being not a hard landlord, and a civil man, and a father, might have his rent. Oh, Amelia! you break my heart with your books and that boy of yours, whom you are ruining, though part with him you will not. Oh, Amelia, may God send you a more dutiful child than I have had! There's Jos, deserts his father in his old age; and there's George, who might be provided for, and who might be rich, going to school like a lord, with a gold watch and chain round his neck--while my dear, dear old man is without a sh--shilling.\" Hysteric sobs and cries ended Mrs. Sedley's speech--it echoed through every room in the small house, whereof the other female inmates heard every word of the colloquy.\n\"Oh, Mother, Mother!\" cried poor Amelia in reply. \"You told me nothing--I--I promised him the books. I--I only sold my shawl this morning. Take the money--take everything\"--and with quivering hands she took out her silver, and her sovereigns--her precious golden sovereigns, which she thrust into the hands of her mother, whence they overflowed and tumbled, rolling down the stairs.\nAnd then she went into her room, and sank down in despair and utter misery. She saw it all now. Her selfishness was sacrificing the boy. But for her he might have wealth, station, education, and his father's place, which the elder George had forfeited for her sake. She had but to speak the words, and her father was restored to competency and the boy raised to fortune. Oh, what a conviction it was to that tender and stricken heart!",
        "paragraph_chars": [
            [
                0,
                125
            ],
            [
                125,
                1777
            ],
            [
                1777,
                2282
            ],
            [
                2282,
                3515
            ],
            [
                3515,
                4885
            ],
            [
                4885,
                8255
            ],
            [
                8255,
                8565
            ],
            [
                8565,
                9021
            ],
            [
                9021,
                9083
            ],
            [
                9083,
                9200
            ],
            [
                9200,
                10515
            ],
            [
                10515,
                11418
            ],
            [
                11418,
                12054
            ],
            [
                12054,
                12898
            ],
            [
                12898,
                13577
            ],
            [
                13577,
                14166
            ],
            [
                14166,
                14510
            ],
            [
                14510,
                15114
            ],
            [
                15114,
                15943
            ],
            [
                15943,
                16706
            ],
            [
                16706,
                17174
            ],
            [
                17174,
                17445
            ],
            [
                17445,
                17473
            ],
            [
                17473,
                17556
            ],
            [
                17556,
                18596
            ],
            [
                18596,
                18979
            ],
            [
                18979,
                19413
            ]
        ],
        "segment_chars": [
            [
                0,
                125
            ],
            [
                125,
                349
            ],
            [
                349,
                362
            ],
            [
                362,
                679
            ],
            [
                679,
                762
            ],
            [
                762,
                964
            ],
            [
                964,
                1045
            ],
            [
                1045,
                1349
            ],
            [
                1349,
                1442
            ],
            [
                1442,
                1580
            ],
            [
                1580,
                1777
            ],
            [
                1777,
                1920
            ],
            [
                1920,
                2146
            ],
            [
                2146,
                2282
            ],
            [
                2282,
                2697
            ],
            [
                2697,
                2827
            ],
            [
                2827,
                2948
            ],
            [
                2948,
                3160
            ],
            [
                3160,
                3230
            ],
            [
                3230,
                3261
            ],
            [
                3261,
                3349
            ],
            [
                3349,
                3515
            ],
            [
                3515,
                3638
            ],
            [
                3638,
                3701
            ],
            [
                3701,
                4178
            ],
            [
                4178,
                4451
            ],
            [
                4451,
                4769
            ],
            [
                4769,
                4885
            ],
            [
                4885,
                5089
            ],
            [
                5089,
                5131
            ],
            [
                5131,
                5189
            ],
            [
                5189,
                5285
            ],
            [
                5285,
                5421
            ],
            [
                5421,
                5641
            ],
            [
                5641,
                5936
            ],
            [
                5936,
                6050
            ],
            [
                6050,
                6355
            ],
            [
                6355,
                6450
            ],
            [
                6450,
                6653
            ],
            [
                6653,
                6771
            ],
            [
                6771,
                7103
            ],
            [
                7103,
                7165
            ],
            [
                7165,
                7387
            ],
            [
                7387,
                7524
            ],
            [
                7524,
                7719
            ],
            [
                7719,
                7816
            ],
            [
                7816,
                7956
            ],
            [
                7956,
                8012
            ],
            [
                8012,
                8255
            ],
            [
                8255,
                8337
            ],
            [
                8337,
                8389
            ],
            [
                8389,
                8438
            ],
            [
                8438,
                8565
            ],
            [
                8565,
                8794
            ],
            [
                8794,
                9021
            ],
            [
                9021,
                9083
            ],
            [
                9083,
                9200
            ],
            [
                9200,
                9309
            ],
            [
                9309,
                9434
            ],
            [
                9434,
                9505
            ],
            [
                9505,
                9713
            ],
            [
                9713,
                10144
            ],
            [
                10144,
                10257
            ],
            [
                10257,
                10341
            ],
            [
                10341,
                10369
            ],
            [
                10369,
                10389
            ],
            [
                10389,
                10430
            ],
            [
                10430,
                10452
            ],
            [
                10452,
                10475
            ],
            [
                10475,
                10515
            ],
            [
                10515,
                10696
            ],
            [
                10696,
                10828
            ],
            [
                10828,
                10919
            ],
            [
                10919,
                11040
            ],
            [
                11040,
                11283
            ],
            [
                11283,
                11418
            ],
            [
                11418,
                11568
            ],
            [
                11568,
                11745
            ],
            [
                11745,
                11761
            ],
            [
                11761,
                11797
            ],
            [
                11797,
                11844
            ],
            [
                11844,
                11932
            ],
            [
                11932,
                12054
            ],
            [
                12054,
                12150
            ],
            [
                12150,
                12263
            ],
            [
                12263,
                12330
            ],
            [
                12330,
                12401
            ],
            [
                12401,
                12673
            ],
            [
                12673,
                12898
            ],
            [
                12898,
                12988
            ],
            [
                12988,
                13080
            ],
            [
                13080,
                13313
            ],
            [
                13313,
                13427
            ],
            [
                13427,
                13577
            ],
            [
                13577,
                13829
            ],
            [
                13829,
                14166
            ],
            [
                14166,
                14254
            ],
            [
                14254,
                14510
            ],
            [
                14510,
                14709
            ],
            [
                14709,
                14837
            ],
            [
                14837,
                15114
            ],
            [
                15114,
                15193
            ],
            [
                15193,
                15233
            ],
            [
                15233,
                15264
            ],
            [
                15264,
                15291
            ],
            [
                15291,
                15321
            ],
            [
                15321,
                15365
            ],
            [
                15365,
                15399
            ],
            [
                15399,
                15509
            ],
            [
                15509,
                15561
            ],
            [
                15561,
                15726
            ],
            [
                15726,
                15892
            ],
            [
                15892,
                15943
            ],
            [
                15943,
                16262
            ],
            [
                16262,
                16521
            ],
            [
                16521,
                16579
            ],
            [
                16579,
                16706
            ],
            [
                16706,
                16957
            ],
            [
                16957,
                17101
            ],
            [
                17101,
                17174
            ],
            [
                17174,
                17363
            ],
            [
                17363,
                17445
            ],
            [
                17445,
                17463
            ],
            [
                17463,
                17473
            ],
            [
                17473,
                17556
            ],
            [
                17556,
                17565
            ],
            [
                17565,
                17641
            ],
            [
                17641,
                17987
            ],
            [
                17987,
                17999
            ],
            [
                17999,
                18114
            ],
            [
                18114,
                18181
            ],
            [
                18181,
                18428
            ],
            [
                18428,
                18596
            ],
            [
                18596,
                18618
            ],
            [
                18618,
                18646
            ],
            [
                18646,
                18697
            ],
            [
                18697,
                18735
            ],
            [
                18735,
                18979
            ],
            [
                18979,
                19055
            ],
            [
                19055,
                19075
            ],
            [
                19075,
                19116
            ],
            [
                19116,
                19245
            ],
            [
                19245,
                19350
            ],
            [
                19350,
                19413
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                29,
                38
            ],
            [
                24,
                28
            ],
            [
                39,
                62
            ],
            [
                87,
                98
            ],
            [
                115,
                125
            ],
            [
                125,
                128
            ],
            [
                186,
                199
            ],
            [
                129,
                131
            ],
            [
                136,
                157
            ],
            [
                199,
                349
            ],
            [
                349,
                357
            ],
            [
                362,
                366
            ],
            [
                380,
                404
            ],
            [
                411,
                456
            ],
            [
                461,
                464
            ],
            [
                532,
                535
            ],
            [
                465,
                467
            ],
            [
                483,
                523
            ],
            [
                677,
                679
            ],
            [
                679,
                760
            ],
            [
                792,
                793
            ],
            [
                762,
                767
            ],
            [
                1151,
                1162
            ],
            [
                890,
                893
            ],
            [
                1166,
                1171
            ],
            [
                1187,
                1190
            ],
            [
                1516,
                1542
            ],
            [
                851,
                853
            ],
            [
                1543,
                1552
            ],
            [
                1578,
                1580
            ],
            [
                1741,
                1752
            ],
            [
                1651,
                1652
            ],
            [
                1644,
                1651
            ],
            [
                1637,
                1638
            ],
            [
                1854,
                1881
            ],
            [
                1782,
                1783
            ],
            [
                1777,
                1782
            ],
            [
                1830,
                1833
            ],
            [
                1844,
                1853
            ],
            [
                1890,
                1906
            ],
            [
                1918,
                1920
            ],
            [
                1920,
                1988
            ],
            [
                2081,
                2082
            ],
            [
                2282,
                2298
            ],
            [
                2307,
                2338
            ],
            [
                2355,
                2356
            ],
            [
                2379,
                2382
            ],
            [
                2403,
                2411
            ],
            [
                2387,
                2402
            ],
            [
                2435,
                2522
            ],
            [
                2344,
                2347
            ],
            [
                2546,
                2584
            ],
            [
                2599,
                2631
            ],
            [
                2657,
                2666
            ],
            [
                2688,
                2697
            ],
            [
                2697,
                2711
            ],
            [
                2847,
                2849
            ],
            [
                2715,
                2721
            ],
            [
                2742,
                2755
            ],
            [
                2764,
                2825
            ],
            [
                2738,
                2741
            ],
            [
                2831,
                2834
            ],
            [
                2842,
                2846
            ],
            [
                2835,
                2841
            ],
            [
                2854,
                2859
            ],
            [
                2869,
                2902
            ],
            [
                2914,
                2922
            ],
            [
                2926,
                2948
            ],
            [
                2948,
                3065
            ],
            [
                3101,
                3103
            ],
            [
                3158,
                3160
            ],
            [
                3160,
                3191
            ],
            [
                3196,
                3202
            ],
            [
                3237,
                3261
            ],
            [
                3261,
                3295
            ],
            [
                3296,
                3307
            ],
            [
                3408,
                3412
            ],
            [
                3469,
                3476
            ],
            [
                3488,
                3515
            ],
            [
                3515,
                3599
            ],
            [
                3609,
                3638
            ],
            [
                3638,
                3671
            ],
            [
                3811,
                3816
            ],
            [
                3704,
                3719
            ],
            [
                3730,
                3777
            ],
            [
                3841,
                3842
            ],
            [
                4076,
                4078
            ],
            [
                4113,
                4117
            ],
            [
                4181,
                4225
            ],
            [
                4241,
                4266
            ],
            [
                3699,
                3700
            ],
            [
                4282,
                4363
            ],
            [
                4449,
                4451
            ],
            [
                4451,
                4464
            ],
            [
                4473,
                4484
            ],
            [
                4485,
                4515
            ],
            [
                4530,
                4559
            ],
            [
                4516,
                4529
            ],
            [
                4587,
                4604
            ],
            [
                4609,
                4650
            ],
            [
                4728,
                4731
            ],
            [
                4773,
                4861
            ],
            [
                4883,
                4885
            ],
            [
                4885,
                4907
            ],
            [
                4927,
                4962
            ],
            [
                4967,
                5018
            ],
            [
                5031,
                5041
            ],
            [
                5019,
                5025
            ],
            [
                5079,
                5087
            ],
            [
                5042,
                5051
            ],
            [
                5060,
                5066
            ],
            [
                5087,
                5089
            ],
            [
                5189,
                5213
            ],
            [
                5222,
                5233
            ],
            [
                5234,
                5239
            ],
            [
                5249,
                5261
            ],
            [
                5263,
                5277
            ],
            [
                5283,
                5284
            ],
            [
                5285,
                5308
            ],
            [
                5324,
                5327
            ],
            [
                5314,
                5322
            ],
            [
                5342,
                5357
            ],
            [
                5367,
                5421
            ],
            [
                5421,
                5424
            ],
            [
                5434,
                5481
            ],
            [
                5487,
                5518
            ],
            [
                5522,
                5554
            ],
            [
                5556,
                5598
            ],
            [
                5615,
                5641
            ],
            [
                5641,
                5665
            ],
            [
                5678,
                5739
            ],
            [
                5790,
                5828
            ],
            [
                5747,
                5754
            ],
            [
                5911,
                5921
            ],
            [
                5934,
                5935
            ],
            [
                6050,
                6066
            ],
            [
                6132,
                6133
            ],
            [
                6099,
                6108
            ],
            [
                6148,
                6228
            ],
            [
                6309,
                6355
            ],
            [
                6355,
                6366
            ],
            [
                6383,
                6406
            ],
            [
                6535,
                6540
            ],
            [
                6545,
                6561
            ],
            [
                6648,
                6651
            ],
            [
                6576,
                6618
            ],
            [
                6448,
                6449
            ],
            [
                6653,
                6677
            ],
            [
                6682,
                6716
            ],
            [
                6744,
                6751
            ],
            [
                6783,
                6810
            ],
            [
                6835,
                6840
            ],
            [
                7107,
                7112
            ],
            [
                7117,
                7165
            ],
            [
                7169,
                7174
            ],
            [
                7194,
                7224
            ],
            [
                7342,
                7353
            ],
            [
                7362,
                7387
            ],
            [
                8161,
                8165
            ],
            [
                8176,
                8254
            ],
            [
                8255,
                8272
            ],
            [
                8292,
                8335
            ],
            [
                8389,
                8402
            ],
            [
                8337,
                8347
            ],
            [
                8335,
                8336
            ],
            [
                8442,
                8446
            ],
            [
                8486,
                8509
            ],
            [
                8475,
                8486
            ],
            [
                8515,
                8564
            ],
            [
                8565,
                8669
            ],
            [
                8674,
                8709
            ],
            [
                8711,
                8738
            ],
            [
                8768,
                8794
            ],
            [
                8794,
                8805
            ],
            [
                8842,
                8887
            ],
            [
                8898,
                8924
            ],
            [
                8944,
                8992
            ],
            [
                9003,
                9021
            ],
            [
                8829,
                8832
            ],
            [
                8931,
                8933
            ],
            [
                9021,
                9041
            ],
            [
                9042,
                9083
            ],
            [
                9083,
                9112
            ],
            [
                9143,
                9168
            ],
            [
                9112,
                9113
            ],
            [
                9169,
                9200
            ],
            [
                9208,
                9225
            ],
            [
                9270,
                9276
            ],
            [
                9278,
                9309
            ],
            [
                9345,
                9368
            ],
            [
                9376,
                9399
            ],
            [
                9415,
                9432
            ],
            [
                9434,
                9440
            ],
            [
                9442,
                9505
            ],
            [
                9505,
                9527
            ],
            [
                9555,
                9598
            ],
            [
                9606,
                9639
            ],
            [
                9648,
                9692
            ],
            [
                9640,
                9644
            ],
            [
                9705,
                9713
            ],
            [
                9796,
                9799
            ],
            [
                9810,
                9816
            ],
            [
                9800,
                9809
            ],
            [
                9817,
                9835
            ],
            [
                9924,
                9925
            ],
            [
                10153,
                10155
            ],
            [
                10160,
                10161
            ],
            [
                10144,
                10152
            ],
            [
                10162,
                10163
            ],
            [
                10173,
                10189
            ],
            [
                10191,
                10210
            ],
            [
                10260,
                10264
            ],
            [
                10169,
                10172
            ],
            [
                10323,
                10329
            ],
            [
                10335,
                10341
            ],
            [
                10342,
                10369
            ],
            [
                10369,
                10387
            ],
            [
                10515,
                10574
            ],
            [
                10586,
                10659
            ],
            [
                10673,
                10695
            ],
            [
                10696,
                10753
            ],
            [
                10801,
                10804
            ],
            [
                10754,
                10758
            ],
            [
                10826,
                10828
            ],
            [
                10828,
                10836
            ],
            [
                10842,
                10875
            ],
            [
                10884,
                10906
            ],
            [
                10917,
                10919
            ],
            [
                10919,
                10976
            ],
            [
                10977,
                11040
            ],
            [
                11040,
                11043
            ],
            [
                11071,
                11140
            ],
            [
                11190,
                11193
            ],
            [
                11202,
                11271
            ],
            [
                11281,
                11283
            ],
            [
                11283,
                11307
            ],
            [
                11316,
                11334
            ],
            [
                11344,
                11352
            ],
            [
                11416,
                11418
            ],
            [
                11418,
                11527
            ],
            [
                11563,
                11568
            ],
            [
                11568,
                11602
            ],
            [
                11625,
                11650
            ],
            [
                11677,
                11680
            ],
            [
                11685,
                11724
            ],
            [
                11653,
                11654
            ],
            [
                11761,
                11762
            ],
            [
                11763,
                11797
            ],
            [
                11797,
                11844
            ],
            [
                11844,
                11889
            ],
            [
                11910,
                11932
            ],
            [
                11943,
                11960
            ],
            [
                12054,
                12071
            ],
            [
                12081,
                12094
            ],
            [
                12106,
                12150
            ],
            [
                12150,
                12193
            ],
            [
                12261,
                12263
            ],
            [
                12282,
                12292
            ],
            [
                12294,
                12330
            ],
            [
                12330,
                12401
            ],
            [
                12401,
                12414
            ],
            [
                12449,
                12459
            ],
            [
                12415,
                12429
            ],
            [
                12465,
                12482
            ],
            [
                12494,
                12501
            ],
            [
                12505,
                12513
            ],
            [
                12538,
                12546
            ],
            [
                12572,
                12574
            ],
            [
                12553,
                12561
            ],
            [
                12583,
                12595
            ],
            [
                12671,
                12673
            ],
            [
                12673,
                12679
            ],
            [
                12694,
                12704
            ],
            [
                12725,
                12871
            ],
            [
                12896,
                12898
            ],
            [
                12898,
                12984
            ],
            [
                12986,
                12988
            ],
            [
                13036,
                13056
            ],
            [
                12988,
                12991
            ],
            [
                13020,
                13030
            ],
            [
                13004,
                13019
            ],
            [
                13083,
                13086
            ],
            [
                13181,
                13211
            ],
            [
                13145,
                13158
            ],
            [
                13212,
                13220
            ],
            [
                13311,
                13313
            ],
            [
                13313,
                13333
            ],
            [
                13418,
                13425
            ],
            [
                13376,
                13417
            ],
            [
                13425,
                13427
            ],
            [
                13431,
                13451
            ],
            [
                13477,
                13489
            ],
            [
                13504,
                13506
            ],
            [
                13512,
                13577
            ],
            [
                13592,
                13593
            ],
            [
                13616,
                13629
            ],
            [
                13666,
                13670
            ],
            [
                13682,
                13701
            ],
            [
                13703,
                13738
            ],
            [
                13601,
                13602
            ],
            [
                13779,
                13829
            ],
            [
                13829,
                13844
            ],
            [
                13858,
                13961
            ],
            [
                13968,
                14035
            ],
            [
                14059,
                14085
            ],
            [
                14086,
                14089
            ],
            [
                14100,
                14146
            ],
            [
                14164,
                14166
            ],
            [
                14254,
                14262
            ],
            [
                14303,
                14309
            ],
            [
                14310,
                14322
            ],
            [
                14263,
                14266
            ],
            [
                14271,
                14276
            ],
            [
                14326,
                14335
            ],
            [
                14392,
                14410
            ],
            [
                14427,
                14431
            ],
            [
                14487,
                14509
            ],
            [
                14510,
                14526
            ],
            [
                14527,
                14537
            ],
            [
                14550,
                14558
            ],
            [
                14563,
                14675
            ],
            [
                14687,
                14709
            ],
            [
                14709,
                14716
            ],
            [
                14721,
                14741
            ],
            [
                14776,
                14789
            ],
            [
                14760,
                14774
            ],
            [
                14789,
                14837
            ],
            [
                14837,
                14844
            ],
            [
                14902,
                14904
            ],
            [
                14924,
                14927
            ],
            [
                14937,
                14940
            ],
            [
                14949,
                15005
            ],
            [
                15112,
                15114
            ],
            [
                15114,
                15150
            ],
            [
                15158,
                15193
            ],
            [
                15193,
                15233
            ],
            [
                15233,
                15236
            ],
            [
                15244,
                15264
            ],
            [
                15291,
                15307
            ],
            [
                15316,
                15319
            ],
            [
                15278,
                15290
            ],
            [
                15321,
                15365
            ],
            [
                15365,
                15397
            ],
            [
                15408,
                15477
            ],
            [
                15486,
                15489
            ],
            [
                15507,
                15509
            ],
            [
                15509,
                15559
            ],
            [
                15561,
                15575
            ],
            [
                15591,
                15633
            ],
            [
                15576,
                15578
            ],
            [
                15724,
                15726
            ],
            [
                15749,
                15800
            ],
            [
                15890,
                15891
            ],
            [
                15994,
                15997
            ],
            [
                15958,
                15963
            ],
            [
                16037,
                16052
            ],
            [
                16109,
                16110
            ],
            [
                16024,
                16027
            ],
            [
                16057,
                16081
            ],
            [
                16094,
                16096
            ],
            [
                16007,
                16010
            ],
            [
                16173,
                16200
            ],
            [
                16223,
                16262
            ],
            [
                16262,
                16310
            ],
            [
                16500,
                16501
            ],
            [
                16330,
                16433
            ],
            [
                16438,
                16474
            ],
            [
                16519,
                16520
            ],
            [
                16521,
                16579
            ],
            [
                16579,
                16585
            ],
            [
                16588,
                16597
            ],
            [
                16615,
                16640
            ],
            [
                16646,
                16694
            ],
            [
                16704,
                16705
            ],
            [
                16737,
                16752
            ],
            [
                16769,
                16770
            ],
            [
                16706,
                16709
            ],
            [
                16921,
                16924
            ],
            [
                16931,
                16957
            ],
            [
                16957,
                17100
            ],
            [
                17174,
                17196
            ],
            [
                17201,
                17265
            ],
            [
                17318,
                17322
            ],
            [
                17339,
                17361
            ],
            [
                17323,
                17337
            ],
            [
                17361,
                17363
            ],
            [
                17363,
                17366
            ],
            [
                17403,
                17445
            ],
            [
                17445,
                17462
            ],
            [
                17473,
                17512
            ],
            [
                17514,
                17515
            ],
            [
                17518,
                17556
            ],
            [
                17556,
                17565
            ],
            [
                17565,
                17597
            ],
            [
                17599,
                17641
            ],
            [
                17641,
                17752
            ],
            [
                17987,
                17999
            ],
            [
                17999,
                18114
            ],
            [
                18114,
                18181
            ],
            [
                18181,
                18261
            ],
            [
                18299,
                18327
            ],
            [
                18372,
                18415
            ],
            [
                18419,
                18428
            ],
            [
                18428,
                18434
            ],
            [
                18437,
                18441
            ],
            [
                18452,
                18478
            ],
            [
                18594,
                18596
            ],
            [
                18596,
                18618
            ],
            [
                18618,
                18635
            ],
            [
                18644,
                18646
            ],
            [
                18646,
                18666
            ],
            [
                18671,
                18697
            ],
            [
                18697,
                18698
            ],
            [
                18700,
                18735
            ],
            [
                18735,
                18749
            ],
            [
                18751,
                18766
            ],
            [
                18769,
                18826
            ],
            [
                18843,
                18851
            ],
            [
                18859,
                18916
            ],
            [
                18977,
                18979
            ],
            [
                18983,
                19055
            ],
            [
                19055,
                19075
            ],
            [
                19075,
                19116
            ],
            [
                19116,
                19149
            ],
            [
                19170,
                19173
            ],
            [
                19159,
                19168
            ],
            [
                19243,
                19245
            ],
            [
                19245,
                19252
            ],
            [
                19257,
                19304
            ],
            [
                19319,
                19350
            ],
            [
                19350,
                19413
            ]
        ],
        "row_chars": [
            [
                0,
                125
            ],
            [
                125,
                349
            ],
            [
                349,
                679
            ],
            [
                679,
                1580
            ],
            [
                1580,
                1777
            ],
            [
                1777,
                1920
            ],
            [
                1920,
                2146
            ],
            [
                2146,
                2282
            ],
            [
                2282,
                2697
            ],
            [
                2697,
                2948
            ],
            [
                2948,
                3160
            ],
            [
                3160,
                3261
            ],
            [
                3261,
                3515
            ],
            [
                3515,
                3638
            ],
            [
                3638,
                4451
            ],
            [
                4451,
                4885
            ],
            [
                4885,
                5089
            ],
            [
                5089,
                5131
            ],
            [
                5131,
                5189
            ],
            [
                5189,
                5285
            ],
            [
                5285,
                5421
            ],
            [
                5421,
                5641
            ],
            [
                5641,
                5936
            ],
            [
                5936,
                6050
            ],
            [
                6050,
                6355
            ],
            [
                6355,
                6653
            ],
            [
                6653,
                7165
            ],
            [
                7165,
                7387
            ],
            [
                7387,
                7524
            ],
            [
                7524,
                7719
            ],
            [
                7719,
                7816
            ],
            [
                7816,
                7956
            ],
            [
                7956,
                8012
            ],
            [
                8012,
                8255
            ],
            [
                8255,
                8438
            ],
            [
                8438,
                8565
            ],
            [
                8565,
                8794
            ],
            [
                8794,
                9021
            ],
            [
                9021,
                9083
            ],
            [
                9083,
                9200
            ],
            [
                9200,
                9309
            ],
            [
                9309,
                9505
            ],
            [
                9505,
                9713
            ],
            [
                9713,
                10144
            ],
            [
                10144,
                10341
            ],
            [
                10341,
                10369
            ],
            [
                10369,
                10389
            ],
            [
                10389,
                10430
            ],
            [
                10430,
                10452
            ],
            [
                10452,
                10475
            ],
            [
                10475,
                10515
            ],
            [
                10515,
                10696
            ],
            [
                10696,
                10828
            ],
            [
                10828,
                10919
            ],
            [
                10919,
                11040
            ],
            [
                11040,
                11283
            ],
            [
                11283,
                11418
            ],
            [
                11418,
                11568
            ],
            [
                11568,
                11745
            ],
            [
                11745,
                11761
            ],
            [
                11761,
                11797
            ],
            [
                11797,
                11844
            ],
            [
                11844,
                11932
            ],
            [
                11932,
                12054
            ],
            [
                12054,
                12150
            ],
            [
                12150,
                12263
            ],
            [
                12263,
                12330
            ],
            [
                12330,
                12401
            ],
            [
                12401,
                12673
            ],
            [
                12673,
                12898
            ],
            [
                12898,
                12988
            ],
            [
                12988,
                13313
            ],
            [
                13313,
                13427
            ],
            [
                13427,
                13577
            ],
            [
                13577,
                13829
            ],
            [
                13829,
                14166
            ],
            [
                14166,
                14254
            ],
            [
                14254,
                14510
            ],
            [
                14510,
                14709
            ],
            [
                14709,
                14837
            ],
            [
                14837,
                15114
            ],
            [
                15114,
                15193
            ],
            [
                15193,
                15233
            ],
            [
                15233,
                15264
            ],
            [
                15264,
                15321
            ],
            [
                15321,
                15365
            ],
            [
                15365,
                15509
            ],
            [
                15509,
                15726
            ],
            [
                15726,
                15892
            ],
            [
                15892,
                15943
            ],
            [
                15943,
                16262
            ],
            [
                16262,
                16521
            ],
            [
                16521,
                16579
            ],
            [
                16579,
                16706
            ],
            [
                16706,
                16957
            ],
            [
                16957,
                17101
            ],
            [
                17101,
                17174
            ],
            [
                17174,
                17363
            ],
            [
                17363,
                17445
            ],
            [
                17445,
                17463
            ],
            [
                17463,
                17473
            ],
            [
                17473,
                17556
            ],
            [
                17556,
                17565
            ],
            [
                17565,
                17641
            ],
            [
                17641,
                17987
            ],
            [
                17987,
                17999
            ],
            [
                17999,
                18114
            ],
            [
                18114,
                18181
            ],
            [
                18181,
                18428
            ],
            [
                18428,
                18596
            ],
            [
                18596,
                18618
            ],
            [
                18618,
                18646
            ],
            [
                18646,
                18697
            ],
            [
                18697,
                18735
            ],
            [
                18735,
                18979
            ],
            [
                18979,
                19055
            ],
            [
                19055,
                19075
            ],
            [
                19075,
                19116
            ],
            [
                19116,
                19245
            ],
            [
                19245,
                19350
            ],
            [
                19350,
                19413
            ]
        ]
    },
    "abridged": {
        "text": "Our friends at Brompton meanwhile were passing their Christmas in a manner not so cheerful.\nOut of her income of a hundred pounds a year, the Widow Osborne had been in the habit of giving up nearly three-fourths to her father and mother, for the expenses of herself and her little boy. With 120 pounds more from Jos, this family of four, attended by a single Irish servant who also worked for the Clapps, might manage to live in decent comfort. Sedley still maintained his ascendency over the family of Mr. Clapp, his ex-clerk, while Clapp still respected Mr. Sedley, and would not allow that gentleman's character to be abused by anybody. He owed him everything, he said. After his master's disaster, Clapp had very soon found other employment. \"Such a little fish as me can swim in any bucket,\" he used to remark.\nOut of the small amount of her income which Amelia kept, she used all possible thrift and care to keep her darling boy dressed in such a manner as became George Osborne's son, and to pay for the little school to which, after much reluctance and many secret pangs, she had sent the lad. She had sat up at nights spelling over grammars and geography books in order to teach them to Georgy, and had even worked at Latin, fondly hoping that she might be able to instruct him in that language. To part with him all day, to send him out to the mercy of a schoolmaster's cane and his schoolfellows' roughness, was painful to her. He, for his part, rushed off to school happily, longing for the change. That childish gladness wounded his grieving mother, who then repented of selfishly wishing her own son to be unhappy.\nGeorgy made great progress in the school, which was kept by a friend of his mother's admirer, the Rev. Mr. Binny. He brought home numberless prizes, and told his mother stories every night about his school-companions, so that Amelia learned to know every one of the boys as well as Georgy himself. At night she used to help him in his exercises and puzzle her little head over his lessons. Once, after a combat with a Master Smith, George came home with a black eye, and bragged to his mother and his delighted grandfather about his valour in the fight: and Amelia has never forgiven that Smith to this day, though he is now a peaceful apothecary.\nIn these quiet labours the gentle widow's life was passing, a silver hair or two marking the progress of time and a line on her forehead deepening a little. All she hoped for was to see her son as great and glorious as he deserved.\nShe kept his copy-books and drawings and showed them to her little circle as if they were miracles of genius. She gave some of these specimens to Miss Dobbin, to show to Miss Osborne, George's aunt, who might show them to Mr. Osborne himself - to make that old man repent of his cruelty towards him who was gone. All her husband's faults she had buried in the grave with him: she only remembered the noble husband, so brave and beautiful, who had died gloriously.\nWe have seen how old Mr. Osborne daily grew more violent and moody, and how his daughter, with her fine carriage, was a lonely, miserable, persecuted old maid. She thought often of the beautiful little nephew, and used to look out for him as she took her solitary drive in the park.\nHer sister, the banker's wife, occasionally condescended to pay a visit with a couple of sickly children, and urged Miss Osborne to make her papa do something for the darlings. Little Frederick should go into the Guards; and how was the dear little girl to be provided for? Then Mrs. Bullock would gather her starched nurslings and simper back into her carriage. But every visit which she paid to her family was more unlucky for her; her patronage annoyed her father.\nPoor Amelia, guarding her treasure at Brompton, little knew how eagerly some people coveted it. On that night when Jane Osborne had told her father that she had seen his grandson, the old man had made no reply, but he had shown no anger - and had bade her good-night in rather a kindly voice. And he must have made some inquiries of the Dobbin family about her visit, for a fortnight later, he asked her where was her little French watch she used to wear?\nShe had given it to Georgy. \"I bought it with my own money, sir,\" she said in a great fright.\n\"Go and order another like it,\" said the old gentleman, and lapsed again into silence.\nThe Misses Dobbin begged Amelia to allow George to visit them. Perhaps his grandfather, they hinted, might be reconciled to him - surely Amelia could not refuse such advantageous chances for the boy. Nor could she, but she agreed with a very heavy and suspicious heart, was uneasy during the child's absence, and welcomed him back as if he was rescued from danger. She always asked him if he had seen any gentlemen.\nHe had not, until at last, \"An old gentleman with thick eyebrows came when I was on the grey pony. He looked at me very much. He shook very much.\"\nThen Amelia knew that the boy had seen his grandfather; and waited feverishly for a proposal which she was sure would follow, and which came a few days afterwards.\nMr. Osborne formally offered to take the boy and make him his heir. He would give Mrs. George Osborne an allowance, to assure her a decent income. If Mrs. George Osborne proposed to marry again, as Mr. O. had heard was her intention, he would not withdraw that allowance. But the child would live entirely with his grandfather in Russell Square, and would be occasionally permitted to see Mrs. George Osborne at her own house. This message was brought to her in a letter when her parents were out.\nShe was never seen angry but twice or thrice in her life, and it was in one of these moods that Mr. Osborne's lawyer beheld her. She rose up trembling and flushing after reading the letter, and tore the paper into a hundred fragments.\n\"I, take money to part from my child! Who dares insult me by proposing such a thing? Tell Mr. Osborne it is a cowardly letter, sir - I will not answer it. Good morning, sir.\"\nHer parents never noticed her agitation, and she never told them of the interview. They had their own affairs to interest them. Her father was always dabbling in speculation. We have seen how the wine company and the coal company had failed him. But, prowling restlessly about the City, he lighted upon another scheme, which he embarked on in spite of Mr. Clapp's warnings. And as Mr. Sedley never talked about money matters before women, they had no inkling of the misfortunes that were in store for them until the unhappy old gentleman was forced to confess.\nThe bills of the little household, which had been settled weekly, first fell into arrears. Mr Sedley told his wife that the payments from India had not arrived; and she was obliged to go round asking the tradesmen for time. Emmy's contribution, however, kept the little company in half-rations. For the first six months, old Sedley kept up the notion that his shares must rise and that all would be well.\nBut after that time, the household fell deeper into trouble. Mrs. Sedley, who was growing infirm, wept a great deal with Mrs. Clapp in the kitchen. The butcher was surly, the grocer insolent: once or twice little Georgy had grumbled about the dinners, and Amelia, who would have been satisfied with a slice of bread for her own dinner, saw that her son was neglected, and bought little things out of her private purse to keep him healthy.\nOne day, when Amelia was about to pay her money over, she proposed to keep a part back to buy a new suit for Georgy. Then it came out: that Jos's payments were not made, that the house was in difficulties, which Amelia ought to have seen before, her mother said, but she cared for nobody except Georgy. At this Amelia passed all her money to her mother without a word, and returned to her room to cry her eyes out. She had to cancel the order for the clothes on which she had set her heart for Christmas Day.\nHardest of all, she had to break the news to Georgy, who made a loud outcry. Everybody had new clothes at Christmas. The other boys would laugh at him. She had promised him new clothes.\nThe poor widow had only kisses to give him. She darned the old suit in tears, and hunted about among her little ornaments to see if she could sell anything to raise the money. There was her India shawl that Dobbin had sent her; she remembered once going with her mother to a fine India shop which dealt in such things. Her eyes shone with pleasure as she thought of this.\nHiding the shawl under her cloak, she walked flushed and eager to the shop, so that many a man turned and looked after her rosy pretty face. She calculated how she should spend the proceeds - besides the clothes, she would buy the books that he longed for, and pay his half-year's schooling; and she would buy a cloak for her father.\nShe was not mistaken as to the value of the Major's gift. It was very fine, and the merchant made a good bargain when he gave her twenty guineas for it. Amazed with her riches, she bought her purchases, and went home exulting. And she pleased herself by writing in the fly-leaf in her neatest little hand, \"George Osborne, A Christmas gift from his affectionate mother.\"\nShe was going from her room with the books in her hand to place them on George's table, when she and her mother met in the passage. The little volumes caught the old lady's eye.\n\"What are those?\"\n\"Some books for Georgy,\" Amelia replied. \"I promised them to him at Christmas.\"\n\"Books!\" cried the elder lady indignantly. \"Books, when the whole house wants bread! Books, when to keep you and your son in luxury, and your dear father out of gaol, I've sold every trinket I had! Oh, Amelia! you break my heart with your books and that boy of yours, whom you are ruining, though part with him you will not. Oh, Amelia, may God send you a more dutiful child than I have had! There's Jos, deserts his father in his old age; and there's George, who might be going to school like a lord, while my dear, dear old man is without a shilling.\" Hysterical sobs ended Mrs. Sedley's speech.\n\"Oh, Mother, Mother!\" cried poor Amelia. \"You told me nothing. I promised him the books. I - I only sold my shawl this morning. Take the money - take everything,\" and with quivering hands she took out her silver, and her precious sovereigns, which she thrust into the hands of her mother.\nThen she went into her room, and sank down in despair and utter misery. She saw it all now. Her selfishness was sacrificing the boy. But for her he might have wealth, status and education. She had only to speak the words, and her father was restored, and the boy raised to fortune. Oh, what a conviction it was to that tender and stricken heart!",
        "paragraph_chars": [
            [
                0,
                92
            ],
            [
                92,
                816
            ],
            [
                816,
                1629
            ],
            [
                1629,
                2277
            ],
            [
                2277,
                2509
            ],
            [
                2509,
                2973
            ],
            [
                2973,
                3256
            ],
            [
                3256,
                3724
            ],
            [
                3724,
                4180
            ],
            [
                4180,
                4274
            ],
            [
                4274,
                4361
            ],
            [
                4361,
                4777
            ],
            [
                4777,
                4924
            ],
            [
                4924,
                5088
            ],
            [
                5088,
                5586
            ],
            [
                5586,
                5821
            ],
            [
                5821,
                5996
            ],
            [
                5996,
                6557
            ],
            [
                6557,
                6962
            ],
            [
                6962,
                7401
            ],
            [
                7401,
                7910
            ],
            [
                7910,
                8096
            ],
            [
                8096,
                8468
            ],
            [
                8468,
                8802
            ],
            [
                8802,
                9173
            ],
            [
                9173,
                9351
            ],
            [
                9351,
                9369
            ],
            [
                9369,
                9449
            ],
            [
                9449,
                10047
            ],
            [
                10047,
                10336
            ],
            [
                10336,
                10681
            ]
        ],
        "segment_chars": [
            [
                0,
                92
            ],
            [
                92,
                286
            ],
            [
                286,
                445
            ],
            [
                445,
                640
            ],
            [
                640,
                673
            ],
            [
                673,
                746
            ],
            [
                746,
                816
            ],
            [
                816,
                1102
            ],
            [
                1102,
                1305
            ],
            [
                1305,
                1439
            ],
            [
                1439,
                1511
            ],
            [
                1511,
                1629
            ],
            [
                1629,
                1743
            ],
            [
                1743,
                1927
            ],
            [
                1927,
                2019
            ],
            [
                2019,
                2277
            ],
            [
                2277,
                2434
            ],
            [
                2434,
                2509
            ],
            [
                2509,
                2619
            ],
            [
                2619,
                2822
            ],
            [
                2822,
                2973
            ],
            [
                2973,
                3133
            ],
            [
                3133,
                3256
            ],
            [
                3256,
                3433
            ],
            [
                3433,
                3530
            ],
            [
                3530,
                3619
            ],
            [
                3619,
                3724
            ],
            [
                3724,
                3820
            ],
            [
                3820,
                4017
            ],
            [
                4017,
                4180
            ],
            [
                4180,
                4208
            ],
            [
                4208,
                4274
            ],
            [
                4274,
                4361
            ],
            [
                4361,
                4424
            ],
            [
                4424,
                4561
            ],
            [
                4561,
                4726
            ],
            [
                4726,
                4777
            ],
            [
                4777,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4924
            ],
            [
                4924,
                5088
            ],
            [
                5088,
                5156
            ],
            [
                5156,
                5235
            ],
            [
                5235,
                5360
            ],
            [
                5360,
                5515
            ],
            [
                5515,
                5586
            ],
            [
                5586,
                5715
            ],
            [
                5715,
                5821
            ],
            [
                5821,
                5859
            ],
            [
                5859,
                5906
            ],
            [
                5906,
                5976
            ],
            [
                5976,
                5996
            ],
            [
                5996,
                6079
            ],
            [
                6079,
                6124
            ],
            [
                6124,
                6171
            ],
            [
                6171,
                6242
            ],
            [
                6242,
                6370
            ],
            [
                6370,
                6557
            ],
            [
                6557,
                6648
            ],
            [
                6648,
                6781
            ],
            [
                6781,
                6852
            ],
            [
                6852,
                6962
            ],
            [
                6962,
                7023
            ],
            [
                7023,
                7110
            ],
            [
                7110,
                7401
            ],
            [
                7401,
                7518
            ],
            [
                7518,
                7704
            ],
            [
                7704,
                7816
            ],
            [
                7816,
                7910
            ],
            [
                7910,
                7987
            ],
            [
                7987,
                8027
            ],
            [
                8027,
                8062
            ],
            [
                8062,
                8096
            ],
            [
                8096,
                8140
            ],
            [
                8140,
                8272
            ],
            [
                8272,
                8415
            ],
            [
                8415,
                8468
            ],
            [
                8468,
                8609
            ],
            [
                8609,
                8802
            ],
            [
                8802,
                8860
            ],
            [
                8860,
                8955
            ],
            [
                8955,
                9029
            ],
            [
                9029,
                9173
            ],
            [
                9173,
                9305
            ],
            [
                9305,
                9351
            ],
            [
                9351,
                9369
            ],
            [
                9369,
                9410
            ],
            [
                9410,
                9449
            ],
            [
                9449,
                9458
            ],
            [
                9458,
                9492
            ],
            [
                9492,
                9534
            ],
            [
                9534,
                9647
            ],
            [
                9647,
                9659
            ],
            [
                9659,
                9774
            ],
            [
                9774,
                9841
            ],
            [
                9841,
                10003
            ],
            [
                10003,
                10047
            ],
            [
                10047,
                10069
            ],
            [
                10069,
                10088
            ],
            [
                10088,
                10110
            ],
            [
                10110,
                10136
            ],
            [
                10136,
                10175
            ],
            [
                10175,
                10336
            ],
            [
                10336,
                10408
            ],
            [
                10408,
                10428
            ],
            [
                10428,
                10469
            ],
            [
                10469,
                10525
            ],
            [
                10525,
                10618
            ],
            [
                10618,
                10681
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                24,
                33
            ],
            [
                34,
                38
            ],
            [
                39,
                62
            ],
            [
                63,
                74
            ],
            [
                82,
                92
            ],
            [
                92,
                95
            ],
            [
                96,
                109
            ],
            [
                110,
                112
            ],
            [
                115,
                136
            ],
            [
                136,
                286
            ],
            [
                286,
                294
            ],
            [
                302,
                306
            ],
            [
                312,
                336
            ],
            [
                336,
                381
            ],
            [
                389,
                392
            ],
            [
                393,
                396
            ],
            [
                397,
                399
            ],
            [
                403,
                443
            ],
            [
                443,
                445
            ],
            [
                445,
                526
            ],
            [
                526,
                527
            ],
            [
                534,
                539
            ],
            [
                556,
                567
            ],
            [
                568,
                571
            ],
            [
                572,
                577
            ],
            [
                578,
                581
            ],
            [
                588,
                614
            ],
            [
                615,
                617
            ],
            [
                621,
                630
            ],
            [
                638,
                640
            ],
            [
                640,
                651
            ],
            [
                662,
                663
            ],
            [
                664,
                671
            ],
            [
                671,
                672
            ],
            [
                673,
                700
            ],
            [
                700,
                701
            ],
            [
                702,
                707
            ],
            [
                708,
                711
            ],
            [
                712,
                721
            ],
            [
                728,
                744
            ],
            [
                744,
                746
            ],
            [
                746,
                814
            ],
            [
                814,
                815
            ],
            [
                816,
                832
            ],
            [
                840,
                871
            ],
            [
                871,
                872
            ],
            [
                882,
                885
            ],
            [
                886,
                894
            ],
            [
                895,
                910
            ],
            [
                911,
                998
            ],
            [
                1003,
                1006
            ],
            [
                1007,
                1045
            ],
            [
                1046,
                1078
            ],
            [
                1078,
                1087
            ],
            [
                1093,
                1102
            ],
            [
                1102,
                1116
            ],
            [
                1117,
                1119
            ],
            [
                1120,
                1126
            ],
            [
                1127,
                1140
            ],
            [
                1141,
                1202
            ],
            [
                1204,
                1207
            ],
            [
                1208,
                1211
            ],
            [
                1212,
                1216
            ],
            [
                1217,
                1223
            ],
            [
                1227,
                1232
            ],
            [
                1232,
                1265
            ],
            [
                1274,
                1282
            ],
            [
                1283,
                1305
            ],
            [
                1305,
                1422
            ],
            [
                1431,
                1433
            ],
            [
                1437,
                1439
            ],
            [
                1439,
                1470
            ],
            [
                1471,
                1477
            ],
            [
                1487,
                1511
            ],
            [
                1511,
                1545
            ],
            [
                1555,
                1566
            ],
            [
                1567,
                1571
            ],
            [
                1584,
                1591
            ],
            [
                1602,
                1629
            ],
            [
                1629,
                1713
            ],
            [
                1714,
                1743
            ],
            [
                1743,
                1776
            ],
            [
                1776,
                1781
            ],
            [
                1782,
                1797
            ],
            [
                1798,
                1845
            ],
            [
                1845,
                1846
            ],
            [
                1847,
                1849
            ],
            [
                1850,
                1854
            ],
            [
                1855,
                1899
            ],
            [
                1900,
                1925
            ],
            [
                1925,
                1926
            ],
            [
                1936,
                2017
            ],
            [
                2017,
                2019
            ],
            [
                2019,
                2032
            ],
            [
                2033,
                2044
            ],
            [
                2047,
                2077
            ],
            [
                2078,
                2107
            ],
            [
                2108,
                2121
            ],
            [
                2122,
                2139
            ],
            [
                2140,
                2181
            ],
            [
                2183,
                2186
            ],
            [
                2187,
                2275
            ],
            [
                2275,
                2277
            ],
            [
                2277,
                2299
            ],
            [
                2300,
                2335
            ],
            [
                2335,
                2386
            ],
            [
                2387,
                2397
            ],
            [
                2398,
                2404
            ],
            [
                2405,
                2413
            ],
            [
                2414,
                2423
            ],
            [
                2426,
                2432
            ],
            [
                2432,
                2434
            ],
            [
                2434,
                2458
            ],
            [
                2459,
                2470
            ],
            [
                2474,
                2479
            ],
            [
                2480,
                2492
            ],
            [
                2493,
                2507
            ],
            [
                2507,
                2508
            ],
            [
                2509,
                2532
            ],
            [
                2533,
                2536
            ],
            [
                2537,
                2545
            ],
            [
                2546,
                2561
            ],
            [
                2565,
                2619
            ],
            [
                2619,
                2622
            ],
            [
                2628,
                2675
            ],
            [
                2676,
                2707
            ],
            [
                2718,
                2750
            ],
            [
                2753,
                2795
            ],
            [
                2796,
                2822
            ],
            [
                2822,
                2846
            ],
            [
                2847,
                2908
            ],
            [
                2909,
                2947
            ],
            [
                2948,
                2955
            ],
            [
                2961,
                2971
            ],
            [
                2971,
                2972
            ],
            [
                2973,
                2989
            ],
            [
                2995,
                2996
            ],
            [
                2996,
                3005
            ],
            [
                3006,
                3086
            ],
            [
                3087,
                3133
            ],
            [
                3133,
                3144
            ],
            [
                3151,
                3174
            ],
            [
                3181,
                3186
            ],
            [
                3187,
                3203
            ],
            [
                3208,
                3211
            ],
            [
                3212,
                3254
            ],
            [
                3254,
                3255
            ],
            [
                3256,
                3280
            ],
            [
                3285,
                3319
            ],
            [
                3320,
                3327
            ],
            [
                3333,
                3360
            ],
            [
                3360,
                3365
            ],
            [
                3366,
                3371
            ],
            [
                3385,
                3433
            ],
            [
                3444,
                3449
            ],
            [
                3450,
                3480
            ],
            [
                3481,
                3492
            ],
            [
                3505,
                3530
            ],
            [
                3535,
                3539
            ],
            [
                3540,
                3618
            ],
            [
                3623,
                3640
            ],
            [
                3645,
                3688
            ],
            [
                3690,
                3703
            ],
            [
                3712,
                3722
            ],
            [
                3722,
                3723
            ],
            [
                3724,
                3728
            ],
            [
                3735,
                3758
            ],
            [
                3759,
                3770
            ],
            [
                3770,
                3819
            ],
            [
                3820,
                3924
            ],
            [
                3925,
                3960
            ],
            [
                3963,
                3990
            ],
            [
                3991,
                4017
            ],
            [
                4017,
                4028
            ],
            [
                4029,
                4074
            ],
            [
                4081,
                4107
            ],
            [
                4113,
                4161
            ],
            [
                4162,
                4180
            ],
            [
                4180,
                4183
            ],
            [
                4194,
                4196
            ],
            [
                4208,
                4228
            ],
            [
                4233,
                4274
            ],
            [
                4274,
                4303
            ],
            [
                4303,
                4328
            ],
            [
                4328,
                4329
            ],
            [
                4330,
                4361
            ],
            [
                4361,
                4378
            ],
            [
                4386,
                4392
            ],
            [
                4393,
                4424
            ],
            [
                4424,
                4447
            ],
            [
                4447,
                4470
            ],
            [
                4471,
                4488
            ],
            [
                4491,
                4497
            ],
            [
                4498,
                4561
            ],
            [
                4561,
                4583
            ],
            [
                4591,
                4634
            ],
            [
                4635,
                4668
            ],
            [
                4668,
                4712
            ],
            [
                4713,
                4717
            ],
            [
                4718,
                4726
            ],
            [
                4726,
                4729
            ],
            [
                4730,
                4736
            ],
            [
                4737,
                4746
            ],
            [
                4747,
                4765
            ],
            [
                4775,
                4776
            ],
            [
                4777,
                4779
            ],
            [
                4787,
                4788
            ],
            [
                4795,
                4803
            ],
            [
                4804,
                4805
            ],
            [
                4805,
                4821
            ],
            [
                4822,
                4841
            ],
            [
                4842,
                4846
            ],
            [
                4854,
                4857
            ],
            [
                4858,
                4864
            ],
            [
                4870,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4921
            ],
            [
                4924,
                4983
            ],
            [
                4991,
                5064
            ],
            [
                5065,
                5087
            ],
            [
                5088,
                5145
            ],
            [
                5146,
                5149
            ],
            [
                5150,
                5154
            ],
            [
                5154,
                5156
            ],
            [
                5156,
                5164
            ],
            [
                5170,
                5203
            ],
            [
                5204,
                5226
            ],
            [
                5233,
                5235
            ],
            [
                5235,
                5292
            ],
            [
                5297,
                5360
            ],
            [
                5360,
                5363
            ],
            [
                5364,
                5433
            ],
            [
                5434,
                5437
            ],
            [
                5438,
                5507
            ],
            [
                5513,
                5515
            ],
            [
                5515,
                5539
            ],
            [
                5540,
                5558
            ],
            [
                5559,
                5567
            ],
            [
                5584,
                5586
            ],
            [
                5586,
                5695
            ],
            [
                5710,
                5715
            ],
            [
                5715,
                5749
            ],
            [
                5750,
                5775
            ],
            [
                5776,
                5779
            ],
            [
                5780,
                5819
            ],
            [
                5819,
                5820
            ],
            [
                5822,
                5823
            ],
            [
                5825,
                5859
            ],
            [
                5859,
                5906
            ],
            [
                5906,
                5951
            ],
            [
                5954,
                5976
            ],
            [
                5976,
                5993
            ],
            [
                5996,
                6013
            ],
            [
                6022,
                6035
            ],
            [
                6035,
                6079
            ],
            [
                6079,
                6122
            ],
            [
                6122,
                6124
            ],
            [
                6124,
                6134
            ],
            [
                6135,
                6171
            ],
            [
                6171,
                6242
            ],
            [
                6242,
                6255
            ],
            [
                6256,
                6266
            ],
            [
                6267,
                6281
            ],
            [
                6281,
                6298
            ],
            [
                6307,
                6314
            ],
            [
                6315,
                6323
            ],
            [
                6324,
                6332
            ],
            [
                6333,
                6335
            ],
            [
                6336,
                6344
            ],
            [
                6345,
                6357
            ],
            [
                6368,
                6370
            ],
            [
                6370,
                6376
            ],
            [
                6377,
                6387
            ],
            [
                6401,
                6547
            ],
            [
                6555,
                6557
            ],
            [
                6557,
                6643
            ],
            [
                6646,
                6648
            ],
            [
                6651,
                6671
            ],
            [
                6677,
                6680
            ],
            [
                6690,
                6700
            ],
            [
                6701,
                6716
            ],
            [
                6722,
                6725
            ],
            [
                6726,
                6756
            ],
            [
                6757,
                6770
            ],
            [
                6771,
                6779
            ],
            [
                6779,
                6781
            ],
            [
                6781,
                6801
            ],
            [
                6802,
                6809
            ],
            [
                6809,
                6850
            ],
            [
                6850,
                6852
            ],
            [
                6856,
                6876
            ],
            [
                6876,
                6888
            ],
            [
                6894,
                6896
            ],
            [
                6897,
                6962
            ],
            [
                6981,
                6982
            ],
            [
                6983,
                6996
            ],
            [
                6997,
                7001
            ],
            [
                7002,
                7021
            ],
            [
                7023,
                7058
            ],
            [
                7058,
                7059
            ],
            [
                7060,
                7110
            ],
            [
                7110,
                7125
            ],
            [
                7126,
                7229
            ],
            [
                7230,
                7297
            ],
            [
                7302,
                7328
            ],
            [
                7330,
                7333
            ],
            [
                7341,
                7387
            ],
            [
                7399,
                7401
            ],
            [
                7401,
                7409
            ],
            [
                7415,
                7421
            ],
            [
                7426,
                7438
            ],
            [
                7439,
                7442
            ],
            [
                7443,
                7448
            ],
            [
                7449,
                7458
            ],
            [
                7459,
                7477
            ],
            [
                7483,
                7487
            ],
            [
                7495,
                7517
            ],
            [
                7518,
                7534
            ],
            [
                7536,
                7546
            ],
            [
                7556,
                7564
            ],
            [
                7569,
                7681
            ],
            [
                7682,
                7704
            ],
            [
                7704,
                7711
            ],
            [
                7719,
                7739
            ],
            [
                7740,
                7753
            ],
            [
                7754,
                7768
            ],
            [
                7768,
                7816
            ],
            [
                7816,
                7823
            ],
            [
                7824,
                7826
            ],
            [
                7834,
                7837
            ],
            [
                7848,
                7851
            ],
            [
                7852,
                7908
            ],
            [
                7908,
                7910
            ],
            [
                7910,
                7946
            ],
            [
                7952,
                7987
            ],
            [
                7987,
                8027
            ],
            [
                8027,
                8030
            ],
            [
                8042,
                8062
            ],
            [
                8062,
                8078
            ],
            [
                8079,
                8082
            ],
            [
                8083,
                8095
            ],
            [
                8096,
                8140
            ],
            [
                8140,
                8172
            ],
            [
                8185,
                8254
            ],
            [
                8261,
                8264
            ],
            [
                8270,
                8272
            ],
            [
                8272,
                8322
            ],
            [
                8324,
                8338
            ],
            [
                8344,
                8386
            ],
            [
                8399,
                8401
            ],
            [
                8413,
                8415
            ],
            [
                8415,
                8466
            ],
            [
                8466,
                8467
            ],
            [
                8475,
                8478
            ],
            [
                8479,
                8484
            ],
            [
                8485,
                8500
            ],
            [
                8500,
                8501
            ],
            [
                8502,
                8505
            ],
            [
                8506,
                8530
            ],
            [
                8531,
                8533
            ],
            [
                8534,
                8537
            ],
            [
                8542,
                8569
            ],
            [
                8570,
                8609
            ],
            [
                8609,
                8657
            ],
            [
                8658,
                8659
            ],
            [
                8660,
                8763
            ],
            [
                8764,
                8800
            ],
            [
                8800,
                8801
            ],
            [
                8802,
                8860
            ],
            [
                8860,
                8866
            ],
            [
                8867,
                8876
            ],
            [
                8876,
                8901
            ],
            [
                8902,
                8950
            ],
            [
                8953,
                8954
            ],
            [
                8962,
                8977
            ],
            [
                8977,
                8978
            ],
            [
                8979,
                8982
            ],
            [
                8990,
                8993
            ],
            [
                9003,
                9029
            ],
            [
                9029,
                9172
            ],
            [
                9173,
                9195
            ],
            [
                9196,
                9260
            ],
            [
                9261,
                9265
            ],
            [
                9266,
                9288
            ],
            [
                9289,
                9303
            ],
            [
                9303,
                9305
            ],
            [
                9305,
                9308
            ],
            [
                9309,
                9351
            ],
            [
                9351,
                9368
            ],
            [
                9369,
                9408
            ],
            [
                9410,
                9411
            ],
            [
                9411,
                9449
            ],
            [
                9449,
                9458
            ],
            [
                9458,
                9490
            ],
            [
                9492,
                9534
            ],
            [
                9534,
                9645
            ],
            [
                9647,
                9659
            ],
            [
                9659,
                9774
            ],
            [
                9774,
                9841
            ],
            [
                9841,
                9921
            ],
            [
                9922,
                9950
            ],
            [
                9951,
                9994
            ],
            [
                9994,
                10003
            ],
            [
                10003,
                10009
            ],
            [
                10014,
                10018
            ],
            [
                10019,
                10045
            ],
            [
                10045,
                10047
            ],
            [
                10047,
                10069
            ],
            [
                10069,
                10086
            ],
            [
                10086,
                10088
            ],
            [
                10088,
                10108
            ],
            [
                10110,
                10136
            ],
            [
                10136,
                10137
            ],
            [
                10140,
                10175
            ],
            [
                10175,
                10189
            ],
            [
                10192,
                10207
            ],
            [
                10210,
                10267
            ],
            [
                10268,
                10276
            ],
            [
                10277,
                10334
            ],
            [
                10334,
                10336
            ],
            [
                10336,
                10408
            ],
            [
                10408,
                10428
            ],
            [
                10428,
                10469
            ],
            [
                10469,
                10502
            ],
            [
                10510,
                10513
            ],
            [
                10514,
                10523
            ],
            [
                10523,
                10525
            ],
            [
                10525,
                10532
            ],
            [
                10538,
                10585
            ],
            [
                10587,
                10618
            ],
            [
                10618,
                10681
            ]
        ],
        "row_chars": [
            [
                0,
                92
            ],
            [
                92,
                286
            ],
            [
                286,
                445
            ],
            [
                445,
                640
            ],
            [
                640,
                673
            ],
            [
                673,
                746
            ],
            [
                746,
                816
            ],
            [
                816,
                816
            ],
            [
                816,
                1102
            ],
            [
                1102,
                1305
            ],
            [
                1305,
                1439
            ],
            [
                1439,
                1511
            ],
            [
                1511,
                1629
            ],
            [
                1629,
                1743
            ],
            [
                1743,
                2019
            ],
            [
                2019,
                2277
            ],
            [
                2277,
                2434
            ],
            [
                2434,
                2434
            ],
            [
                2434,
                2434
            ],
            [
                2434,
                2509
            ],
            [
                2509,
                2619
            ],
            [
                2619,
                2822
            ],
            [
                2822,
                2973
            ],
            [
                2973,
                2973
            ],
            [
                2973,
                3133
            ],
            [
                3133,
                3256
            ],
            [
                3256,
                3433
            ],
            [
                3433,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3530
            ],
            [
                3530,
                3619
            ],
            [
                3619,
                3724
            ],
            [
                3724,
                3820
            ],
            [
                3820,
                4017
            ],
            [
                4017,
                4208
            ],
            [
                4208,
                4274
            ],
            [
                4274,
                4361
            ],
            [
                4361,
                4424
            ],
            [
                4424,
                4561
            ],
            [
                4561,
                4726
            ],
            [
                4726,
                4777
            ],
            [
                4777,
                4876
            ],
            [
                4876,
                4903
            ],
            [
                4903,
                4924
            ],
            [
                4924,
                4924
            ],
            [
                4924,
                4924
            ],
            [
                4924,
                4924
            ],
            [
                4924,
                4924
            ],
            [
                4924,
                5088
            ],
            [
                5088,
                5156
            ],
            [
                5156,
                5235
            ],
            [
                5235,
                5360
            ],
            [
                5360,
                5515
            ],
            [
                5515,
                5586
            ],
            [
                5586,
                5715
            ],
            [
                5715,
                5821
            ],
            [
                5821,
                5821
            ],
            [
                5821,
                5859
            ],
            [
                5859,
                5906
            ],
            [
                5906,
                5976
            ],
            [
                5976,
                5996
            ],
            [
                5996,
                6079
            ],
            [
                6079,
                6124
            ],
            [
                6124,
                6171
            ],
            [
                6171,
                6242
            ],
            [
                6242,
                6370
            ],
            [
                6370,
                6557
            ],
            [
                6557,
                6648
            ],
            [
                6648,
                6781
            ],
            [
                6781,
                6852
            ],
            [
                6852,
                6962
            ],
            [
                6962,
                7110
            ],
            [
                7110,
                7401
            ],
            [
                7401,
                7401
            ],
            [
                7401,
                7518
            ],
            [
                7518,
                7704
            ],
            [
                7704,
                7816
            ],
            [
                7816,
                7910
            ],
            [
                7910,
                7987
            ],
            [
                7987,
                8027
            ],
            [
                8027,
                8062
            ],
            [
                8062,
                8096
            ],
            [
                8096,
                8140
            ],
            [
                8140,
                8272
            ],
            [
                8272,
                8415
            ],
            [
                8415,
                8468
            ],
            [
                8468,
                8468
            ],
            [
                8468,
                8609
            ],
            [
                8609,
                8802
            ],
            [
                8802,
                8860
            ],
            [
                8860,
                8955
            ],
            [
                8955,
                9029
            ],
            [
                9029,
                9173
            ],
            [
                9173,
                9173
            ],
            [
                9173,
                9305
            ],
            [
                9305,
                9351
            ],
            [
                9351,
                9369
            ],
            [
                9369,
                9369
            ],
            [
                9369,
                9449
            ],
            [
                9449,
                9458
            ],
            [
                9458,
                9534
            ],
            [
                9534,
                9647
            ],
            [
                9647,
                9659
            ],
            [
                9659,
                9774
            ],
            [
                9774,
                9841
            ],
            [
                9841,
                10003
            ],
            [
                10003,
                10047
            ],
            [
                10047,
                10069
            ],
            [
                10069,
                10088
            ],
            [
                10088,
                10136
            ],
            [
                10136,
                10175
            ],
            [
                10175,
                10336
            ],
            [
                10336,
                10408
            ],
            [
                10408,
                10428
            ],
            [
                10428,
                10469
            ],
            [
                10469,
                10525
            ],
            [
                10525,
                10618
            ],
            [
                10618,
                10681
            ]
        ]
    }
}