{
    "original": {
        "text": "All the world knows that Lord Steyne's town palace stands in Gaunt Square, out of which Great Gaunt Street leads, whither we first conducted Rebecca, in the time of the departed Sir Pitt Crawley. Peering over the railings and through the black trees into the garden of the Square, you see a few miserable governesses with wan-faced pupils wandering round and round it, and round the dreary grass-plot in the centre of which rises the statue of Lord Gaunt, who fought at Minden, in a three-tailed wig, and otherwise habited like a Roman Emperor. Gaunt House occupies nearly a side of the Square. The remaining three sides are composed of mansions that have passed away into dowagerism--tall, dark houses, with window-frames of stone, or picked out of a lighter red. Little light seems to be behind those lean, comfortless casements now, and hospitality to have passed away from those doors as much as the laced lacqueys and link-boys of old times, who used to put out their torches in the blank iron extinguishers that still flank the lamps over the steps. Brass plates have penetrated into the square--Doctors, the Diddlesex Bank Western Branch--the English and European Reunion, &c.--it has a dreary look--nor is my Lord Steyne's palace less dreary. All I have ever seen of it is the vast wall in front, with the rustic columns at the great gate, through which an old porter peers sometimes with a fat and gloomy red face--and over the wall the garret and bedroom windows, and the chimneys, out of which there seldom comes any smoke now. For the present Lord Steyne lives at Naples, preferring the view of the Bay and Capri and Vesuvius to the dreary aspect of the wall in Gaunt Square.\nA few score yards down New Gaunt Street, and leading into Gaunt Mews indeed, is a little modest back door, which you would not remark from that of any of the other stables. But many a little close carriage has stopped at that door, as my informant (little Tom Eaves, who knows everything, and who showed me the place) told me. \"The Prince and Perdita have been in and out of that door, sir,\" he had often told me; \"Marianne Clarke has entered it with the Duke of ------. It conducts to the famous petits appartements of Lord Steyne--one, sir, fitted up all in ivory and white satin, another in ebony and black velvet; there is a little banqueting-room taken from Sallust's house at Pompeii, and painted by Cosway--a little private kitchen, in which every saucepan was silver and all the spits were gold. It was there that Egalite Orleans roasted partridges on the night when he and the Marquis of Steyne won a hundred thousand from a great personage at ombre. Half of the money went to the French Revolution, half to purchase Lord Gaunt's Marquisate and Garter--and the remainder--\" but it forms no part of our scheme to tell what became of the remainder, for every shilling of which, and a great deal more, little Tom Eaves, who knows everybody's affairs, is ready to account.\nBesides his town palace, the Marquis had castles and palaces in various quarters of the three kingdoms, whereof the descriptions may be found in the road-books--Castle Strongbow, with its woods, on the Shannon shore; Gaunt Castle, in Carmarthenshire, where Richard II was taken prisoner--Gauntly Hall in Yorkshire, where I have been informed there were two hundred silver teapots for the breakfasts of the guests of the house, with everything to correspond in splendour; and Stillbrook in Hampshire, which was my lord's farm, an humble place of residence, of which we all remember the wonderful furniture which was sold at my lord's demise by a late celebrated auctioneer.\nThe Marchioness of Steyne was of the renowned and ancient family of the Caerlyons, Marquises of Camelot, who have preserved the old faith ever since the conversion of the venerable Druid, their first ancestor, and whose pedigree goes far beyond the date of the arrival of King Brute in these islands. Pendragon is the title of the eldest son of the house. The sons have been called Arthurs, Uthers, and Caradocs, from immemorial time. Their heads have fallen in many a loyal conspiracy. Elizabeth chopped off the head of the Arthur of her day, who had been Chamberlain to Philip and Mary, and carried letters between the Queen of Scots and her uncles the Guises. A cadet of the house was an officer of the great Duke and distinguished in the famous Saint Bartholomew conspiracy. During the whole of Mary's confinement, the house of Camelot conspired in her behalf. It was as much injured by its charges in fitting out an armament against the Spaniards, during the time of the Armada, as by the fines and confiscations levied on it by Elizabeth for harbouring of priests, obstinate recusancy, and popish misdoings. A recreant of James's time was momentarily perverted from his religion by the arguments of that great theologian, and the fortunes of the family somewhat restored by his timely weakness. But the Earl of Camelot, of the reign of Charles, returned to the old creed of his family, and they continued to fight for it, and ruin themselves for it, as long as there was a Stuart left to head or to instigate a rebellion.\nLady Mary Caerlyon was brought up at a Parisian convent; the Dauphiness Marie Antoinette was her godmother. In the pride of her beauty she had been married--sold, it was said--to Lord Gaunt, then at Paris, who won vast sums from the lady's brother at some of Philip of Orleans's banquets. The Earl of Gaunt's famous duel with the Count de la Marche, of the Grey Musqueteers, was attributed by common report to the pretensions of that officer (who had been a page, and remained a favourite of the Queen) to the hand of the beautiful Lady Mary Caerlyon. She was married to Lord Gaunt while the Count lay ill of his wound, and came to dwell at Gaunt House, and to figure for a short time in the splendid Court of the Prince of Wales. Fox had toasted her. Morris and Sheridan had written songs about her. Malmesbury had made her his best bow; Walpole had pronounced her charming; Devonshire had been almost jealous of her; but she was scared by the wild pleasures and gaieties of the society into which she was flung, and after she had borne a couple of sons, shrank away into a life of devout seclusion. No wonder that my Lord Steyne, who liked pleasure and cheerfulness, was not often seen after their marriage by the side of this trembling, silent, superstitious, unhappy lady.\nThe before-mentioned Tom Eaves (who has no part in this history, except that he knew all the great folks in London, and the stories and mysteries of each family) had further information regarding my Lady Steyne, which may or may not be true. \"The humiliations,\" Tom used to say, \"which that woman has been made to undergo, in her own house, have been frightful; Lord Steyne has made her sit down to table with women with whom I would rather die than allow Mrs. Eaves to associate--with Lady Crackenbury, with Mrs. Chippenham, with Madame de la Cruchecassee, the French secretary's wife (from every one of which ladies Tom Eaves--who would have sacrificed his wife for knowing them--was too glad to get a bow or a dinner) with the REIGNING FAVOURITE in a word. And do you suppose that that woman, of that family, who are as proud as the Bourbons, and to whom the Steynes are but lackeys, mushrooms of yesterday (for after all, they are not of the Old Gaunts, but of a minor and doubtful branch of the house); do you suppose, I say (the reader must bear in mind that it is always Tom Eaves who speaks) that the Marchioness of Steyne, the haughtiest woman in England, would bend down to her husband so submissively if there were not some cause? Pooh! I tell you there are secret reasons. I tell you that, in the emigration, the Abbe de la Marche who was here and was employed in the Quiberoon business with Puisaye and Tinteniac, was the same Colonel of Mousquetaires Gris with whom Steyne fought in the year '86--that he and the Marchioness met again--that it was after the Reverend Colonel was shot in Brittany that Lady Steyne took to those extreme practices of devotion which she carries on now; for she is closeted with her director every day--she is at service at Spanish Place, every morning, I've watched her there--that is, I've happened to be passing there--and depend on it, there's a mystery in her case. People are not so unhappy unless they have something to repent of,\" added Tom Eaves with a knowing wag of his head; \"and depend on it, that woman would not be so submissive as she is if the Marquis had not some sword to hold over her.\"\nSo, if Mr. Eaves's information be correct, it is very likely that this lady, in her high station, had to submit to many a private indignity and to hide many secret griefs under a calm face. And let us, my brethren who have not our names in the Red Book, console ourselves by thinking comfortably how miserable our betters may be, and that Damocles, who sits on satin cushions and is served on gold plate, has an awful sword hanging over his head in the shape of a bailiff, or an hereditary disease, or a family secret, which peeps out every now and then from the embroidered arras in a ghastly manner, and will be sure to drop one day or the other in the right place.\nIn comparing, too, the poor man's situation with that of the great, there is (always according to Mr. Eaves) another source of comfort for the former. You who have little or no patrimony to bequeath or to inherit, may be on good terms with your father or your son, whereas the heir of a great prince, such as my Lord Steyne, must naturally be angry at being kept out of his kingdom, and eye the occupant of it with no very agreeable glances. \"Take it as a rule,\" this sardonic old Eaves would say, \"the fathers and elder sons of all great families hate each other. The Crown Prince is always in opposition to the crown or hankering after it. Shakespeare knew the world, my good sir, and when he describes Prince Hal (from whose family the Gaunts pretend to be descended, though they are no more related to John of Gaunt than you are) trying on his father's coronet, he gives you a natural description of all heirs apparent. If you were heir to a dukedom and a thousand pounds a day, do you mean to say you would not wish for possession? Pooh! And it stands to reason that every great man, having experienced this feeling towards his father, must be aware that his son entertains it towards himself; and so they can't but be suspicious and hostile.\n\"Then again, as to the feeling of elder towards younger sons. My dear sir, you ought to know that every elder brother looks upon the cadets of the house as his natural enemies, who deprive him of so much ready money which ought to be his by right. I have often heard George Mac Turk, Lord Bajazet's eldest son, say that if he had his will when he came to the title, he would do what the sultans do, and clear the estate by chopping off all his younger brothers' heads at once; and so the case is, more or less, with them all. I tell you they are all Turks in their hearts. Pooh! sir, they know the world.\" And here, haply, a great man coming up, Tom Eaves's hat would drop off his head, and he would rush forward with a bow and a grin, which showed that he knew the world too--in the Tomeavesian way, that is. And having laid out every shilling of his fortune on an annuity, Tom could afford to bear no malice to his nephews and nieces, and to have no other feeling with regard to his betters but a constant and generous desire to dine with them.\nBetween the Marchioness and the natural and tender regard of mother for children, there was that cruel barrier placed of difference of faith. The very love which she might feel for her sons only served to render the timid and pious lady more fearful and unhappy. The gulf which separated them was fatal and impassable. She could not stretch her weak arms across it, or draw her children over to that side away from which her belief told her there was no safety. During the youth of his sons, Lord Steyne, who was a good scholar and amateur casuist, had no better sport in the evening after dinner in the country than in setting the boys' tutor, the Reverend Mr. Trail (now my Lord Bishop of Ealing) on her ladyship's director, Father Mole, over their wine, and in pitting Oxford against St. Acheul. He cried \"Bravo, Latimer! Well said, Loyola!\" alternately; he promised Mole a bishopric if he would come over, and vowed he would use all his influence to get Trail a cardinal's hat if he would secede. Neither divine allowed himself to be conquered, and though the fond mother hoped that her youngest and favourite son would be reconciled to her church--his mother church--a sad and awful disappointment awaited the devout lady--a disappointment which seemed to be a judgement upon her for the sin of her marriage.\nMy Lord Gaunt married, as every person who frequents the Peerage knows, the Lady Blanche Thistlewood, a daughter of the noble house of Bareacres, before mentioned in this veracious history. A wing of Gaunt House was assigned to this couple; for the head of the family chose to govern it, and while he reigned to reign supreme; his son and heir, however, living little at home, disagreeing with his wife, and borrowing upon post-obits such moneys as he required beyond the very moderate sums which his father was disposed to allow him. The Marquis knew every shilling of his son's debts. At his lamented demise, he was found himself to be possessor of many of his heir's bonds, purchased for their benefit, and devised by his Lordship to the children of his younger son.\nAs, to my Lord Gaunt's dismay, and the chuckling delight of his natural enemy and father, the Lady Gaunt had no children--the Lord George Gaunt was desired to return from Vienna, where he was engaged in waltzing and diplomacy, and to contract a matrimonial alliance with the Honourable Joan, only daughter of John Johnes, First Baron Helvellyn, and head of the firm of Jones, Brown, and Robinson, of Threadneedle Street, Bankers; from which union sprang several sons and daughters, whose doings do not appertain to this story.\nThe marriage at first was a happy and prosperous one. My Lord George Gaunt could not only read, but write pretty correctly. He spoke French with considerable fluency; and was one of the finest waltzers in Europe. With these talents, and his interest at home, there was little doubt that his lordship would rise to the highest dignities in his profession. The lady, his wife, felt that courts were her sphere, and her wealth enabled her to receive splendidly in those continental towns whither her husband's diplomatic duties led him. There was talk of appointing him minister, and bets were laid at the Travellers' that he would be ambassador ere long, when of a sudden, rumours arrived of the secretary's extraordinary behaviour. At a grand diplomatic dinner given by his chief, he had started up and declared that a pate de foie gras was poisoned. He went to a ball at the hotel of the Bavarian envoy, the Count de Springbock-Hohenlaufen, with his head shaved and dressed as a Capuchin friar. It was not a masked ball, as some folks wanted to persuade you. It was something queer, people whispered. His grandfather was so. It was in the family.\nHis wife and family returned to this country and took up their abode at Gaunt House. Lord George gave up his post on the European continent, and was gazetted to Brazil. But people knew better; he never returned from that Brazil expedition--never died there--never lived there--never was there at all. He was nowhere; he was gone out altogether. \"Brazil,\" said one gossip to another, with a grin--\"Brazil is St. John's Wood. Rio de Janeiro is a cottage surrounded by four walls, and George Gaunt is accredited to a keeper, who has invested him with the order of the Strait-Waistcoat.\" These are the kinds of epitaphs which men pass over one another in Vanity Fair.\nTwice or thrice in a week, in the earliest morning, the poor mother went for her sins and saw the poor invalid. Sometimes he laughed at her (and his laughter was more pitiful than to hear him cry); sometimes she found the brilliant dandy diplomatist of the Congress of Vienna dragging about a child's toy, or nursing the keeper's baby's doll. Sometimes he knew her and Father Mole, her director and companion; oftener he forgot her, as he had done wife, children, love, ambition, vanity. But he remembered his dinner-hour, and used to cry if his wine-and-water was not strong enough.\nIt was the mysterious taint of the blood; the poor mother had brought it from her own ancient race. The evil had broken out once or twice in the father's family, long before Lady Steyne's sins had begun, or her fasts and tears and penances had been offered in their expiation. The pride of the race was struck down as the first-born of Pharaoh. The dark mark of fate and doom was on the threshold--the tall old threshold surmounted by coronets and caned heraldry.\nThe absent lord's children meanwhile prattled and grew on quite unconscious that the doom was over them too. First they talked of their father and devised plans against his return. Then the name of the living dead man was less frequently in their mouth--then not mentioned at all. But the stricken old grandmother trembled to think that these too were the inheritors of their father's shame as well as of his honours, and watched sickening for the day when the awful ancestral curse should come down on them.\nThis dark presentiment also haunted Lord Steyne. He tried to lay the horrid bedside ghost in Red Seas of wine and jollity, and lost sight of it sometimes in the crowd and rout of his pleasures. But it always came back to him when alone, and seemed to grow more threatening with years. \"I have taken your son,\" it said, \"why not you? I may shut you up in a prison some day like your son George. I may tap you on the head to-morrow, and away go pleasure and honours, feasts and beauty, friends, flatterers, French cooks, fine horses and houses--in exchange for a prison, a keeper, and a straw mattress like George Gaunt's.\" And then my lord would defy the ghost which threatened him, for he knew of a remedy by which he could baulk his enemy.\nSo there was splendour and wealth, but no great happiness perchance, behind the tall caned portals of Gaunt House with its smoky coronets and ciphers. The feasts there were of the grandest in London, but there was not overmuch content therewith, except among the guests who sat at my lord's table. Had he not been so great a Prince very few possibly would have visited him; but in Vanity Fair the sins of very great personages are looked at indulgently. \"Nous regardons a deux fois\" (as the French lady said) before we condemn a person of my lord's undoubted quality. Some notorious carpers and squeamish moralists might be sulky with Lord Steyne, but they were glad enough to come when he asked them.\n\"Lord Steyne is really too bad,\" Lady Slingstone said, \"but everybody goes, and of course I shall see that my girls come to no harm.\" \"His lordship is a man to whom I owe much, everything in life,\" said the Right Reverend Doctor Trail, thinking that the Archbishop was rather shaky, and Mrs. Trail and the young ladies would as soon have missed going to church as to one of his lordship's parties. \"His morals are bad,\" said little Lord Southdown to his sister, who meekly expostulated, having heard terrific legends from her mamma with respect to the doings at Gaunt House; \"but hang it, he's got the best dry Sillery in Europe!\" And as for Sir Pitt Crawley, Bart.--Sir Pitt that pattern of decorum, Sir Pitt who had led off at missionary meetings--he never for one moment thought of not going too. \"Where you see such persons as the Bishop of Ealing and the Countess of Slingstone, you may be pretty sure, Jane,\" the Baronet would say, \"that we cannot be wrong. The great rank and station of Lord Steyne put him in a position to command people in our station in life. The Lord Lieutenant of a County, my dear, is a respectable man. Besides, George Gaunt and I were intimate in early life; he was my junior when we were attaches at Pumpernickel together.\"\nIn a word everybody went to wait upon this great man--everybody who was asked, as you the reader (do not say nay) or I the writer hereof would go if we had an invitation.",
        "paragraph_chars": [
            [
                0,
                1688
            ],
            [
                1688,
                2966
            ],
            [
                2966,
                3639
            ],
            [
                3639,
                5167
            ],
            [
                5167,
                6444
            ],
            [
                6444,
                8594
            ],
            [
                8594,
                9262
            ],
            [
                9262,
                10510
            ],
            [
                10510,
                11557
            ],
            [
                11557,
                12871
            ],
            [
                12871,
                13641
            ],
            [
                13641,
                14168
            ],
            [
                14168,
                15315
            ],
            [
                15315,
                15979
            ],
            [
                15979,
                16563
            ],
            [
                16563,
                17027
            ],
            [
                17027,
                17536
            ],
            [
                17536,
                18277
            ],
            [
                18277,
                18979
            ],
            [
                18979,
                20236
            ],
            [
                20236,
                20406
            ]
        ],
        "segment_chars": [
            [
                0,
                196
            ],
            [
                196,
                545
            ],
            [
                545,
                595
            ],
            [
                595,
                765
            ],
            [
                765,
                1056
            ],
            [
                1056,
                1251
            ],
            [
                1251,
                1539
            ],
            [
                1539,
                1688
            ],
            [
                1688,
                1861
            ],
            [
                1861,
                2015
            ],
            [
                2015,
                2159
            ],
            [
                2159,
                2492
            ],
            [
                2492,
                2648
            ],
            [
                2648,
                2966
            ],
            [
                2966,
                3639
            ],
            [
                3639,
                3940
            ],
            [
                3940,
                3995
            ],
            [
                3995,
                4074
            ],
            [
                4074,
                4126
            ],
            [
                4126,
                4302
            ],
            [
                4302,
                4418
            ],
            [
                4418,
                4504
            ],
            [
                4504,
                4753
            ],
            [
                4753,
                4940
            ],
            [
                4940,
                5167
            ],
            [
                5167,
                5275
            ],
            [
                5275,
                5456
            ],
            [
                5456,
                5719
            ],
            [
                5719,
                5898
            ],
            [
                5898,
                5919
            ],
            [
                5919,
                5968
            ],
            [
                5968,
                6268
            ],
            [
                6268,
                6444
            ],
            [
                6444,
                6686
            ],
            [
                6686,
                7204
            ],
            [
                7204,
                7686
            ],
            [
                7686,
                7692
            ],
            [
                7692,
                7729
            ],
            [
                7729,
                8358
            ],
            [
                8358,
                8594
            ],
            [
                8594,
                8784
            ],
            [
                8784,
                9262
            ],
            [
                9262,
                9413
            ],
            [
                9413,
                9704
            ],
            [
                9704,
                9827
            ],
            [
                9827,
                9904
            ],
            [
                9904,
                10186
            ],
            [
                10186,
                10299
            ],
            [
                10299,
                10305
            ],
            [
                10305,
                10510
            ],
            [
                10510,
                10572
            ],
            [
                10572,
                10758
            ],
            [
                10758,
                11036
            ],
            [
                11036,
                11083
            ],
            [
                11083,
                11089
            ],
            [
                11089,
                11116
            ],
            [
                11116,
                11320
            ],
            [
                11320,
                11557
            ],
            [
                11557,
                11699
            ],
            [
                11699,
                11820
            ],
            [
                11820,
                11876
            ],
            [
                11876,
                12019
            ],
            [
                12019,
                12356
            ],
            [
                12356,
                12382
            ],
            [
                12382,
                12402
            ],
            [
                12402,
                12558
            ],
            [
                12558,
                12871
            ],
            [
                12871,
                13061
            ],
            [
                13061,
                13406
            ],
            [
                13406,
                13458
            ],
            [
                13458,
                13641
            ],
            [
                13641,
                14168
            ],
            [
                14168,
                14222
            ],
            [
                14222,
                14292
            ],
            [
                14292,
                14381
            ],
            [
                14381,
                14523
            ],
            [
                14523,
                14702
            ],
            [
                14702,
                14899
            ],
            [
                14899,
                15018
            ],
            [
                15018,
                15163
            ],
            [
                15163,
                15227
            ],
            [
                15227,
                15269
            ],
            [
                15269,
                15293
            ],
            [
                15293,
                15315
            ],
            [
                15315,
                15400
            ],
            [
                15400,
                15484
            ],
            [
                15484,
                15616
            ],
            [
                15616,
                15660
            ],
            [
                15660,
                15739
            ],
            [
                15739,
                15899
            ],
            [
                15899,
                15979
            ],
            [
                15979,
                16091
            ],
            [
                16091,
                16322
            ],
            [
                16322,
                16467
            ],
            [
                16467,
                16563
            ],
            [
                16563,
                16663
            ],
            [
                16663,
                16840
            ],
            [
                16840,
                16908
            ],
            [
                16908,
                17027
            ],
            [
                17027,
                17136
            ],
            [
                17136,
                17208
            ],
            [
                17208,
                17308
            ],
            [
                17308,
                17536
            ],
            [
                17536,
                17585
            ],
            [
                17585,
                17730
            ],
            [
                17730,
                17821
            ],
            [
                17821,
                17869
            ],
            [
                17869,
                17930
            ],
            [
                17930,
                18158
            ],
            [
                18158,
                18277
            ],
            [
                18277,
                18428
            ],
            [
                18428,
                18575
            ],
            [
                18575,
                18731
            ],
            [
                18731,
                18845
            ],
            [
                18845,
                18979
            ],
            [
                18979,
                19113
            ],
            [
                19113,
                19377
            ],
            [
                19377,
                19610
            ],
            [
                19610,
                19779
            ],
            [
                19779,
                19943
            ],
            [
                19943,
                20049
            ],
            [
                20049,
                20113
            ],
            [
                20113,
                20236
            ],
            [
                20236,
                20406
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                194,
                196
            ],
            [
                196,
                258
            ],
            [
                259,
                367
            ],
            [
                543,
                545
            ],
            [
                545,
                595
            ],
            [
                595,
                636
            ],
            [
                685,
                708
            ],
            [
                765,
                777
            ],
            [
                790,
                796
            ],
            [
                967,
                972
            ],
            [
                1465,
                1477
            ],
            [
                1392,
                1396
            ],
            [
                1056,
                1068
            ],
            [
                715,
                716
            ],
            [
                731,
                732
            ],
            [
                807,
                808
            ],
            [
                1686,
                1688
            ],
            [
                1090,
                1100
            ],
            [
                1188,
                1205
            ],
            [
                927,
                928
            ],
            [
                1207,
                1249
            ],
            [
                1303,
                1309
            ],
            [
                1285,
                1289
            ],
            [
                1298,
                1303
            ],
            [
                1290,
                1294
            ],
            [
                834,
                835
            ],
            [
                1314,
                1328
            ],
            [
                836,
                839
            ],
            [
                1482,
                1537
            ],
            [
                1539,
                1582
            ],
            [
                763,
                764
            ],
            [
                1688,
                1689
            ],
            [
                1700,
                1727
            ],
            [
                1765,
                1814
            ],
            [
                1822,
                1826
            ],
            [
                1835,
                1838
            ],
            [
                1846,
                1851
            ],
            [
                1859,
                1861
            ],
            [
                2402,
                2403
            ],
            [
                2367,
                2369
            ],
            [
                2377,
                2382
            ],
            [
                2428,
                2430
            ],
            [
                2463,
                2466
            ],
            [
                2159,
                2161
            ],
            [
                2171,
                2219
            ],
            [
                2221,
                2224
            ],
            [
                2231,
                2240
            ],
            [
                2245,
                2270
            ],
            [
                2271,
                2339
            ],
            [
                2411,
                2426
            ],
            [
                2490,
                2491
            ],
            [
                2966,
                3006
            ],
            [
                3030,
                3037
            ],
            [
                3007,
                3014
            ],
            [
                3119,
                3120
            ],
            [
                3127,
                3144
            ],
            [
                3027,
                3029
            ],
            [
                3181,
                3199
            ],
            [
                3435,
                3436
            ],
            [
                3050,
                3053
            ],
            [
                3254,
                3280
            ],
            [
                3437,
                3491
            ],
            [
                3609,
                3610
            ],
            [
                3495,
                3501
            ],
            [
                3511,
                3585
            ],
            [
                3161,
                3163
            ],
            [
                3589,
                3598
            ],
            [
                3637,
                3639
            ],
            [
                3639,
                3675
            ],
            [
                3689,
                3770
            ],
            [
                3771,
                3847
            ],
            [
                3938,
                3940
            ],
            [
                3940,
                3995
            ],
            [
                3995,
                4056
            ],
            [
                4068,
                4072
            ],
            [
                4057,
                4067
            ],
            [
                4072,
                4074
            ],
            [
                4074,
                4126
            ],
            [
                4126,
                4181
            ],
            [
                4300,
                4302
            ],
            [
                4753,
                4823
            ],
            [
                4865,
                4915
            ],
            [
                4938,
                4940
            ],
            [
                4940,
                4964
            ],
            [
                4968,
                5039
            ],
            [
                5067,
                5070
            ],
            [
                5076,
                5137
            ],
            [
                5154,
                5167
            ],
            [
                5224,
                5227
            ],
            [
                5172,
                5222
            ],
            [
                5356,
                5357
            ],
            [
                5315,
                5322
            ],
            [
                5436,
                5438
            ],
            [
                5324,
                5341
            ],
            [
                5343,
                5356
            ],
            [
                5371,
                5414
            ],
            [
                5454,
                5456
            ],
            [
                5456,
                5515
            ],
            [
                5542,
                5545
            ],
            [
                5593,
                5608
            ],
            [
                5581,
                5592
            ],
            [
                5670,
                5684
            ],
            [
                5699,
                5708
            ],
            [
                5717,
                5719
            ],
            [
                5719,
                5827
            ],
            [
                5868,
                5873
            ],
            [
                6084,
                6268
            ],
            [
                6268,
                6375
            ],
            [
                6391,
                6444
            ],
            [
                7126,
                7129
            ],
            [
                6730,
                6734
            ],
            [
                6806,
                6817
            ],
            [
                6822,
                6859
            ],
            [
                7046,
                7048
            ],
            [
                7193,
                7202
            ],
            [
                6946,
                6952
            ],
            [
                7099,
                7102
            ],
            [
                7174,
                7192
            ],
            [
                7202,
                7204
            ],
            [
                7999,
                8005
            ],
            [
                8564,
                8568
            ],
            [
                8054,
                8063
            ],
            [
                7895,
                7896
            ],
            [
                8504,
                8530
            ],
            [
                8384,
                8390
            ],
            [
                8544,
                8559
            ],
            [
                8569,
                8591
            ],
            [
                8356,
                8357
            ],
            [
                11557,
                11584
            ],
            [
                11629,
                11637
            ],
            [
                11645,
                11648
            ],
            [
                11585,
                11588
            ],
            [
                11654,
                11667
            ],
            [
                11675,
                11699
            ],
            [
                11699,
                11722
            ],
            [
                11734,
                11751
            ],
            [
                11769,
                11772
            ],
            [
                11783,
                11820
            ],
            [
                11820,
                11853
            ],
            [
                11864,
                11876
            ],
            [
                12019,
                12025
            ],
            [
                12039,
                12047
            ],
            [
                12030,
                12035
            ],
            [
                12047,
                12060
            ],
            [
                12106,
                12125
            ],
            [
                12141,
                12153
            ],
            [
                12169,
                12224
            ],
            [
                12060,
                12061
            ],
            [
                12256,
                12273
            ],
            [
                12282,
                12295
            ],
            [
                12354,
                12356
            ],
            [
                12356,
                12382
            ],
            [
                12382,
                12402
            ],
            [
                12402,
                12455
            ],
            [
                12465,
                12558
            ],
            [
                12617,
                12708
            ],
            [
                12604,
                12605
            ],
            [
                12729,
                12767
            ],
            [
                12838,
                12841
            ],
            [
                12869,
                12871
            ],
            [
                12874,
                12892
            ],
            [
                12943,
                13016
            ],
            [
                13024,
                13041
            ],
            [
                13052,
                13061
            ],
            [
                13061,
                13111
            ],
            [
                13214,
                13224
            ],
            [
                13379,
                13382
            ],
            [
                13232,
                13288
            ],
            [
                13332,
                13378
            ],
            [
                13401,
                13406
            ],
            [
                13406,
                13457
            ],
            [
                13645,
                13704
            ],
            [
                13713,
                13761
            ],
            [
                13767,
                13818
            ],
            [
                13872,
                13874
            ],
            [
                13912,
                13954
            ],
            [
                13961,
                13997
            ],
            [
                14010,
                14037
            ],
            [
                14062,
                14069
            ],
            [
                14071,
                14075
            ],
            [
                14156,
                14160
            ],
            [
                14088,
                14121
            ],
            [
                14166,
                14168
            ],
            [
                14168,
                14222
            ],
            [
                14222,
                14248
            ],
            [
                14268,
                14273
            ],
            [
                14262,
                14263
            ],
            [
                14295,
                14307
            ],
            [
                14326,
                14329
            ],
            [
                14333,
                14334
            ],
            [
                14339,
                14342
            ],
            [
                14361,
                14365
            ],
            [
                14399,
                14404
            ],
            [
                14479,
                14481
            ],
            [
                14521,
                14523
            ],
            [
                14533,
                14541
            ],
            [
                14585,
                14591
            ],
            [
                14565,
                14568
            ],
            [
                14615,
                14623
            ],
            [
                14626,
                14652
            ],
            [
                14661,
                14701
            ],
            [
                14831,
                14837
            ],
            [
                14839,
                14857
            ],
            [
                14874,
                14899
            ],
            [
                14899,
                14927
            ],
            [
                14946,
                15018
            ],
            [
                15018,
                15035
            ],
            [
                15109,
                15163
            ],
            [
                15163,
                15175
            ],
            [
                15183,
                15187
            ],
            [
                15225,
                15227
            ],
            [
                15251,
                15267
            ],
            [
                15234,
                15243
            ],
            [
                15300,
                15315
            ],
            [
                15315,
                15327
            ],
            [
                15335,
                15346
            ],
            [
                15387,
                15400
            ],
            [
                15400,
                15428
            ],
            [
                15454,
                15463
            ],
            [
                15473,
                15484
            ],
            [
                15484,
                15553
            ],
            [
                15555,
                15571
            ],
            [
                15573,
                15590
            ],
            [
                15592,
                15616
            ],
            [
                15660,
                15674
            ],
            [
                15696,
                15697
            ],
            [
                15711,
                15712
            ],
            [
                15754,
                15766
            ],
            [
                15722,
                15737
            ],
            [
                15791,
                15792
            ],
            [
                15797,
                15809
            ],
            [
                15827,
                15887
            ],
            [
                15746,
                15747
            ],
            [
                15896,
                15899
            ],
            [
                15899,
                15940
            ],
            [
                15951,
                15979
            ],
            [
                15979,
                15994
            ],
            [
                15998,
                16012
            ],
            [
                16022,
                16030
            ],
            [
                16035,
                16051
            ],
            [
                16089,
                16091
            ],
            [
                16091,
                16118
            ],
            [
                16177,
                16196
            ],
            [
                16167,
                16170
            ],
            [
                16255,
                16283
            ],
            [
                16320,
                16322
            ],
            [
                16322,
                16359
            ],
            [
                16387,
                16458
            ],
            [
                16374,
                16377
            ],
            [
                16467,
                16470
            ],
            [
                16485,
                16500
            ],
            [
                16561,
                16563
            ],
            [
                16605,
                16632
            ],
            [
                16585,
                16590
            ],
            [
                16636,
                16663
            ],
            [
                16663,
                16703
            ],
            [
                16770,
                16773
            ],
            [
                16708,
                16723
            ],
            [
                16838,
                16840
            ],
            [
                16908,
                16924
            ],
            [
                16934,
                16959
            ],
            [
                17025,
                17027
            ],
            [
                17027,
                17063
            ],
            [
                17077,
                17084
            ],
            [
                17085,
                17136
            ],
            [
                17316,
                17324
            ],
            [
                17329,
                17369
            ],
            [
                17374,
                17417
            ],
            [
                17443,
                17536
            ],
            [
                17536,
                17585
            ],
            [
                17585,
                17604
            ],
            [
                17620,
                17702
            ],
            [
                17712,
                17730
            ],
            [
                17730,
                17776
            ],
            [
                17792,
                17813
            ],
            [
                17814,
                17821
            ],
            [
                17821,
                17869
            ],
            [
                17930,
                17955
            ],
            [
                17965,
                18011
            ],
            [
                18020,
                18027
            ],
            [
                18053,
                18077
            ],
            [
                17958,
                17959
            ],
            [
                18079,
                18135
            ],
            [
                18155,
                18158
            ],
            [
                18158,
                18195
            ],
            [
                18216,
                18277
            ],
            [
                18277,
                18334
            ],
            [
                18346,
                18361
            ],
            [
                18368,
                18390
            ],
            [
                18426,
                18428
            ],
            [
                18575,
                18578
            ],
            [
                18558,
                18565
            ],
            [
                18582,
                18599
            ],
            [
                18475,
                18476
            ],
            [
                18614,
                18617
            ],
            [
                18627,
                18707
            ],
            [
                18718,
                18723
            ],
            [
                18729,
                18731
            ],
            [
                18845,
                18849
            ],
            [
                18872,
                18979
            ],
            [
                18979,
                19112
            ],
            [
                19377,
                19444
            ],
            [
                19473,
                19487
            ],
            [
                19496,
                19510
            ],
            [
                19527,
                19585
            ],
            [
                19598,
                19609
            ],
            [
                19610,
                19637
            ],
            [
                19655,
                19678
            ],
            [
                19729,
                19773
            ],
            [
                19777,
                19778
            ],
            [
                19779,
                19809
            ],
            [
                19835,
                19943
            ],
            [
                19943,
                19957
            ],
            [
                19970,
                19984
            ],
            [
                20010,
                20039
            ],
            [
                20047,
                20049
            ],
            [
                20113,
                20145
            ],
            [
                20225,
                20235
            ]
        ],
        "row_chars": [
            [
                0,
                196
            ],
            [
                196,
                545
            ],
            [
                545,
                595
            ],
            [
                595,
                1688
            ],
            [
                1688,
                1861
            ],
            [
                1861,
                2015
            ],
            [
                2015,
                2159
            ],
            [
                2159,
                2492
            ],
            [
                2492,
                2648
            ],
            [
                2648,
                2966
            ],
            [
                2966,
                3639
            ],
            [
                3639,
                3940
            ],
            [
                3940,
                3995
            ],
            [
                3995,
                4074
            ],
            [
                4074,
                4126
            ],
            [
                4126,
                4302
            ],
            [
                4302,
                4418
            ],
            [
                4418,
                4504
            ],
            [
                4504,
                4753
            ],
            [
                4753,
                4940
            ],
            [
                4940,
                5167
            ],
            [
                5167,
                5456
            ],
            [
                5456,
                5719
            ],
            [
                5719,
                6268
            ],
            [
                6268,
                6444
            ],
            [
                6444,
                6686
            ],
            [
                6686,
                7204
            ],
            [
                7204,
                7686
            ],
            [
                7686,
                7692
            ],
            [
                7692,
                7729
            ],
            [
                7729,
                8594
            ],
            [
                8594,
                8784
            ],
            [
                8784,
                9262
            ],
            [
                9262,
                9413
            ],
            [
                9413,
                9704
            ],
            [
                9704,
                9827
            ],
            [
                9827,
                9904
            ],
            [
                9904,
                10186
            ],
            [
                10186,
                10299
            ],
            [
                10299,
                10305
            ],
            [
                10305,
                10510
            ],
            [
                10510,
                10572
            ],
            [
                10572,
                10758
            ],
            [
                10758,
                11036
            ],
            [
                11036,
                11083
            ],
            [
                11083,
                11089
            ],
            [
                11089,
                11116
            ],
            [
                11116,
                11320
            ],
            [
                11320,
                11557
            ],
            [
                11557,
                11699
            ],
            [
                11699,
                11820
            ],
            [
                11820,
                11876
            ],
            [
                11876,
                12019
            ],
            [
                12019,
                12356
            ],
            [
                12356,
                12382
            ],
            [
                12382,
                12402
            ],
            [
                12402,
                12558
            ],
            [
                12558,
                12871
            ],
            [
                12871,
                13061
            ],
            [
                13061,
                13406
            ],
            [
                13406,
                13458
            ],
            [
                13458,
                13641
            ],
            [
                13641,
                14168
            ],
            [
                14168,
                14222
            ],
            [
                14222,
                14523
            ],
            [
                14523,
                14702
            ],
            [
                14702,
                14899
            ],
            [
                14899,
                15018
            ],
            [
                15018,
                15163
            ],
            [
                15163,
                15227
            ],
            [
                15227,
                15315
            ],
            [
                15315,
                15400
            ],
            [
                15400,
                15484
            ],
            [
                15484,
                15616
            ],
            [
                15616,
                15660
            ],
            [
                15660,
                15899
            ],
            [
                15899,
                15979
            ],
            [
                15979,
                16091
            ],
            [
                16091,
                16322
            ],
            [
                16322,
                16563
            ],
            [
                16563,
                16663
            ],
            [
                16663,
                16840
            ],
            [
                16840,
                16908
            ],
            [
                16908,
                17027
            ],
            [
                17027,
                17136
            ],
            [
                17136,
                17208
            ],
            [
                17208,
                17308
            ],
            [
                17308,
                17536
            ],
            [
                17536,
                17585
            ],
            [
                17585,
                17730
            ],
            [
                17730,
                17821
            ],
            [
                17821,
                17869
            ],
            [
                17869,
                17930
            ],
            [
                17930,
                18158
            ],
            [
                18158,
                18277
            ],
            [
                18277,
                18428
            ],
            [
                18428,
                18731
            ],
            [
                18731,
                18845
            ],
            [
                18845,
                18979
            ],
            [
                18979,
                19113
            ],
            [
                19113,
                19377
            ],
            [
                19377,
                19610
            ],
            [
                19610,
                19779
            ],
            [
                19779,
                19943
            ],
            [
                19943,
                20049
            ],
            [
                20049,
                20113
            ],
            [
                20113,
                20236
            ],
            [
                20236,
                20406
            ]
        ]
    },
    "abridged": {
        "text": "All the world knows that Lord Steyne's town palace stands in Gaunt Square. Peering over the railings and through the black trees into the central garden of the Square, you see a few miserable governesses with wan-faced pupils wandering round and round it. Gaunt House occupies nearly a side of the Square. The remaining three sides are composed of tall, dark houses, with little light behind their windows, and with brass plates - Doctors, Banks, etc.\nThe Square has a dreary look - nor is my Lord Steyne's palace less dreary, with its vast front wall, rustic columns and chimneys, out of which there seldom comes any smoke now; for the present Lord Steyne lives at Naples.\nA hundred yards down New Gaunt Street is a little modest back door, which you would not distinguish from any other. But many a closed carriage has stopped at that door, and many a lady has been seen going in and out; for it leads to the famous petits appartements of Lord Steyne - one fitted up in ivory and white satin, and another in ebony and black velvet; there is a little banqueting-room and a private kitchen.\nBesides his town palace, the Marquis had various other castles - Castle Strongbow, in Ireland; Gaunt Castle, in Wales; the grand Gauntly Hall in Yorkshire, and Stillbrook in Hampshire, which was my lord's farm, a humble residence, of which we all remember the wonderful furniture which was sold on my lord's death.\nThe Marchioness of Steyne was of the ancient family of the Caerlyons, Marquises of Camelot, who have preserved the old Catholic faith ever since the conversion of the venerable Druid, their first ancestor. Pendragon is the title of the eldest son of the house. The sons have been called Arthurs, Uthers, and Caradocs, from time immemorial. Their heads have fallen in many a loyal conspiracy. Elizabeth chopped off the head of the Arthur of her day. A recreant of James's time was momentarily perverted from his religion, and the fortunes of the family somewhat restored. But the Earl of Camelot, in the reign of Charles, returned to the old creed of his family, and they fought and ruined themselves for it, as long as there was a Stuart left to head a rebellion.\nThe beautiful Lady Mary Caerlyon was brought up at a Parisian convent, before being married - or sold, it was said - to Lord Gaunt, who won vast sums from the lady's brother. The Earl of Gaunt's famous duel with the Count de la Marche was because of that officer's pretensions to the hand of Lady Mary. She was married to Lord Gaunt while the Count lay ill of his wound, and came to dwell at Gaunt House, and to be admired at court; but she was scared by the wild pleasures and gaieties of the society into which she was flung, and after she had borne a couple of sons, shrank away into a life of devout seclusion. No wonder that my Lord Steyne, who liked pleasure and cheerfulness, was not often seen after their marriage alongside this trembling, silent, superstitious, unhappy lady.\nIt was said that Lord Steyne made her sit down to table with women of doubtful reputation: in a word, with his reigning favourite. It was also said by some that Lady Mary would not be so submissive unless the Marquis had some mysterious sword to hold over her.\nBetween the Marchioness and her children was the cruel barrier of difference of faith. The very love which she felt for her sons only made the pious lady more fearful and unhappy. The gulf which separated them was impassable. During his sons' youth, Lord Steyne had no better sport after dinner than in setting the boys' tutor, the Reverend Mr. Trail, on her ladyship's priest, Father Mole. He cried \"Bravo, Latimer! Well said, Loyola!\" alternately; he promised Mole a bishopric if he would convert, and vowed he would use all his influence to get Trail a cardinal's hat if he would secede. Although the fond mother hoped that her youngest and favourite son would be reconciled to her church, a sad and awful disappointment awaited her.\nHer elder son Lord Gaunt married the Lady Blanche Thistlewood, a daughter of the noble house of Bareacres, previously mentioned in this history. A wing of Gaunt House was assigned to this couple; Lord Gaunt, however, was little at home, disagreeing with his wife, and borrowing money beyond the very moderate sums which his father allowed him. The Marquis knew every shilling of his son's debts.\nTo my Lord Gaunt's dismay, and the chuckling delight of his enemy and father, the Lady Gaunt had no children. So his brother Lord George Gaunt was desired to return from Vienna to marry the Honourable Joan, only daughter of John Jones, First Baron Helvellyn, and head of Jones, Brown, and Robinson, Bankers. From this marriage sprang several sons and daughters.\nThe marriage at first was a happy and prosperous one. My Lord George Gaunt could write well, spoke French fluently; was a fine waltzer, and seemed likely to become a highly-ranked diplomat. His wife's wealth let her hold splendid receptions in those continental towns where her husband's diplomatic duties led him.\nThen sudden rumours arrived of his extraordinary behaviour. At a grand diplomatic dinner, he had started up and declared that a pate de foie gras was poisoned. He went to a ball with his head shaved and dressed as a Capuchin friar. It was not a fancy-dress ball. People whispered that something strange ran in the family.\nHis wife and children returned to Gaunt House. Lord George gave up his post, and was supposedly sent to Brazil. But people knew better; he never returned from that Brazil expedition - never died there - never lived there - never was there at all. \"Brazil,\" said the gossips, \"is a cottage at St. John's Wood, where George Gaunt has a keeper, who has invested him with the order of the Strait-Jacket.\" These are the kinds of epitaphs which men give one another in Vanity Fair.\nTwice or thrice a week, in the early morning, his poor mother went to see him. Sometimes he laughed at her; sometimes she found him dragging about a child's toy. Sometimes he knew her and Father Mole; oftener he forgot her, as he had done wife, children, love, ambition, and all but his dinner-hour.\nThe poor mother had brought this taint from her own ancient race. The evil had broken out once or twice in her father's family. The dark mark of doom was on the threshold.\nThe absent lord's children meanwhile grew on, quite unconscious that the doom was over them too. Their stricken grandmother trembled to think that these were the inheritors of their father's shame, and watched sickening for the day when the awful ancestral curse should come down on them.\nThis dark presentiment also haunted Lord Steyne. He tried to lay the ghost in Red Seas of wine and jollity, and lost sight of it sometimes in the crowd of his pleasures. But it always came back to him when alone, and grew more threatening with the years. \"I have taken your son,\" it said, \"why not you? I may tap you on the head tomorrow, and away go pleasure and honours, feasts and friends, fine horses and houses - in exchange for a prison, a keeper, and a straw mattress.\" And then my lord would defy the ghost, for he knew of a remedy by which he could baulk his enemy.\nSo there was splendour and wealth, but no great happiness behind the tall portals of Gaunt House. Had my Lord not been so great, perhaps few would have visited him; but in Vanity Fair the sins of very great personages are indulged. Some squeamish moralists might be sulky with Lord Steyne, but they were glad enough to come when he asked them.\n\"Lord Steyne is really too bad,\" Lady Slingstone said, \"but everybody goes, and of course I shall see that my girls come to no harm.\"\n\"His morals are bad,\" said little Lord Southdown to his sister, who had heard terrific stories from her mamma about the doings at Gaunt House; \"but hang it, he's got the best Champagne in Europe!\"\nAnd as for Sir Pitt Crawley - that pattern of decorum - he never for one moment thought of not going.\n\"Where you see such persons as the Countess of Slingstone, you may be pretty sure, Jane,\" the Baronet would say, \"that we cannot be wrong. The great rank of Lord Steyne means he can command people in our station. Besides, George Gaunt and I were diplomats together.\"",
        "paragraph_chars": [
            [
                0,
                452
            ],
            [
                452,
                674
            ],
            [
                674,
                1091
            ],
            [
                1091,
                1406
            ],
            [
                1406,
                2170
            ],
            [
                2170,
                2956
            ],
            [
                2956,
                3217
            ],
            [
                3217,
                3954
            ],
            [
                3954,
                4350
            ],
            [
                4350,
                4712
            ],
            [
                4712,
                5027
            ],
            [
                5027,
                5349
            ],
            [
                5349,
                5825
            ],
            [
                5825,
                6125
            ],
            [
                6125,
                6297
            ],
            [
                6297,
                6586
            ],
            [
                6586,
                7161
            ],
            [
                7161,
                7505
            ],
            [
                7505,
                7639
            ],
            [
                7639,
                7836
            ],
            [
                7836,
                7938
            ],
            [
                7938,
                8204
            ]
        ],
        "segment_chars": [
            [
                0,
                75
            ],
            [
                75,
                256
            ],
            [
                256,
                306
            ],
            [
                306,
                452
            ],
            [
                452,
                674
            ],
            [
                674,
                790
            ],
            [
                790,
                1091
            ],
            [
                1091,
                1406
            ],
            [
                1406,
                1612
            ],
            [
                1612,
                1667
            ],
            [
                1667,
                1746
            ],
            [
                1746,
                1798
            ],
            [
                1798,
                1855
            ],
            [
                1855,
                1977
            ],
            [
                1977,
                2170
            ],
            [
                2170,
                2345
            ],
            [
                2345,
                2473
            ],
            [
                2473,
                2785
            ],
            [
                2785,
                2956
            ],
            [
                2956,
                3087
            ],
            [
                3087,
                3217
            ],
            [
                3217,
                3304
            ],
            [
                3304,
                3397
            ],
            [
                3397,
                3443
            ],
            [
                3443,
                3608
            ],
            [
                3608,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3808
            ],
            [
                3808,
                3954
            ],
            [
                3954,
                4099
            ],
            [
                4099,
                4298
            ],
            [
                4298,
                4350
            ],
            [
                4350,
                4460
            ],
            [
                4460,
                4658
            ],
            [
                4658,
                4712
            ],
            [
                4712,
                4766
            ],
            [
                4766,
                4902
            ],
            [
                4902,
                5027
            ],
            [
                5027,
                5087
            ],
            [
                5087,
                5187
            ],
            [
                5187,
                5259
            ],
            [
                5259,
                5290
            ],
            [
                5290,
                5349
            ],
            [
                5349,
                5396
            ],
            [
                5396,
                5461
            ],
            [
                5461,
                5596
            ],
            [
                5596,
                5750
            ],
            [
                5750,
                5825
            ],
            [
                5825,
                5904
            ],
            [
                5904,
                5987
            ],
            [
                5987,
                6125
            ],
            [
                6125,
                6191
            ],
            [
                6191,
                6253
            ],
            [
                6253,
                6297
            ],
            [
                6297,
                6394
            ],
            [
                6394,
                6586
            ],
            [
                6586,
                6635
            ],
            [
                6635,
                6756
            ],
            [
                6756,
                6841
            ],
            [
                6841,
                6889
            ],
            [
                6889,
                7063
            ],
            [
                7063,
                7161
            ],
            [
                7161,
                7259
            ],
            [
                7259,
                7393
            ],
            [
                7393,
                7505
            ],
            [
                7505,
                7639
            ],
            [
                7639,
                7836
            ],
            [
                7836,
                7938
            ],
            [
                7938,
                8077
            ],
            [
                8077,
                8151
            ],
            [
                8151,
                8204
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                73,
                75
            ],
            [
                75,
                137
            ],
            [
                146,
                254
            ],
            [
                254,
                256
            ],
            [
                256,
                306
            ],
            [
                306,
                347
            ],
            [
                348,
                371
            ],
            [
                372,
                384
            ],
            [
                385,
                391
            ],
            [
                392,
                397
            ],
            [
                398,
                410
            ],
            [
                411,
                415
            ],
            [
                416,
                428
            ],
            [
                429,
                430
            ],
            [
                438,
                439
            ],
            [
                445,
                446
            ],
            [
                450,
                452
            ],
            [
                452,
                462
            ],
            [
                463,
                480
            ],
            [
                481,
                482
            ],
            [
                483,
                525
            ],
            [
                525,
                531
            ],
            [
                536,
                540
            ],
            [
                541,
                546
            ],
            [
                547,
                551
            ],
            [
                551,
                552
            ],
            [
                553,
                567
            ],
            [
                568,
                571
            ],
            [
                572,
                627
            ],
            [
                629,
                672
            ],
            [
                672,
                673
            ],
            [
                674,
                675
            ],
            [
                684,
                711
            ],
            [
                712,
                761
            ],
            [
                774,
                778
            ],
            [
                779,
                782
            ],
            [
                783,
                788
            ],
            [
                788,
                790
            ],
            [
                799,
                800
            ],
            [
                829,
                831
            ],
            [
                841,
                846
            ],
            [
                879,
                881
            ],
            [
                882,
                885
            ],
            [
                895,
                897
            ],
            [
                904,
                952
            ],
            [
                955,
                958
            ],
            [
                959,
                968
            ],
            [
                969,
                994
            ],
            [
                999,
                1067
            ],
            [
                1074,
                1089
            ],
            [
                1089,
                1090
            ],
            [
                1091,
                1131
            ],
            [
                1132,
                1139
            ],
            [
                1146,
                1153
            ],
            [
                1154,
                1155
            ],
            [
                1156,
                1173
            ],
            [
                1174,
                1176
            ],
            [
                1184,
                1202
            ],
            [
                1208,
                1209
            ],
            [
                1210,
                1213
            ],
            [
                1220,
                1246
            ],
            [
                1247,
                1301
            ],
            [
                1302,
                1303
            ],
            [
                1304,
                1310
            ],
            [
                1311,
                1385
            ],
            [
                1386,
                1388
            ],
            [
                1389,
                1398
            ],
            [
                1404,
                1406
            ],
            [
                1406,
                1442
            ],
            [
                1443,
                1524
            ],
            [
                1534,
                1610
            ],
            [
                1610,
                1612
            ],
            [
                1612,
                1667
            ],
            [
                1667,
                1728
            ],
            [
                1729,
                1733
            ],
            [
                1734,
                1744
            ],
            [
                1744,
                1746
            ],
            [
                1746,
                1798
            ],
            [
                1798,
                1853
            ],
            [
                1853,
                1855
            ],
            [
                1855,
                1925
            ],
            [
                1925,
                1975
            ],
            [
                1975,
                1977
            ],
            [
                1977,
                2001
            ],
            [
                2005,
                2076
            ],
            [
                2084,
                2087
            ],
            [
                2095,
                2156
            ],
            [
                2157,
                2170
            ],
            [
                2170,
                2173
            ],
            [
                2189,
                2239
            ],
            [
                2239,
                2240
            ],
            [
                2254,
                2261
            ],
            [
                2264,
                2266
            ],
            [
                2267,
                2284
            ],
            [
                2287,
                2300
            ],
            [
                2300,
                2343
            ],
            [
                2343,
                2345
            ],
            [
                2345,
                2404
            ],
            [
                2405,
                2408
            ],
            [
                2417,
                2432
            ],
            [
                2435,
                2446
            ],
            [
                2447,
                2461
            ],
            [
                2462,
                2471
            ],
            [
                2471,
                2473
            ],
            [
                2473,
                2581
            ],
            [
                2596,
                2601
            ],
            [
                2601,
                2785
            ],
            [
                2785,
                2892
            ],
            [
                2903,
                2956
            ],
            [
                2959,
                2962
            ],
            [
                2968,
                2972
            ],
            [
                2973,
                2984
            ],
            [
                2985,
                3022
            ],
            [
                3023,
                3025
            ],
            [
                3047,
                3056
            ],
            [
                3056,
                3062
            ],
            [
                3063,
                3066
            ],
            [
                3067,
                3085
            ],
            [
                3085,
                3087
            ],
            [
                3087,
                3093
            ],
            [
                3107,
                3111
            ],
            [
                3112,
                3121
            ],
            [
                3122,
                3123
            ],
            [
                3127,
                3153
            ],
            [
                3154,
                3160
            ],
            [
                3161,
                3176
            ],
            [
                3193,
                3215
            ],
            [
                3215,
                3216
            ],
            [
                3217,
                3244
            ],
            [
                3249,
                3257
            ],
            [
                3258,
                3261
            ],
            [
                3262,
                3265
            ],
            [
                3266,
                3279
            ],
            [
                3280,
                3304
            ],
            [
                3304,
                3327
            ],
            [
                3333,
                3350
            ],
            [
                3356,
                3359
            ],
            [
                3360,
                3397
            ],
            [
                3397,
                3430
            ],
            [
                3431,
                3443
            ],
            [
                3443,
                3449
            ],
            [
                3450,
                3458
            ],
            [
                3460,
                3465
            ],
            [
                3465,
                3478
            ],
            [
                3479,
                3498
            ],
            [
                3499,
                3511
            ],
            [
                3512,
                3567
            ],
            [
                3567,
                3568
            ],
            [
                3569,
                3586
            ],
            [
                3593,
                3606
            ],
            [
                3606,
                3608
            ],
            [
                3608,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3707
            ],
            [
                3715,
                3808
            ],
            [
                3817,
                3908
            ],
            [
                3908,
                3909
            ],
            [
                3910,
                3948
            ],
            [
                3949,
                3952
            ],
            [
                3952,
                3954
            ],
            [
                3968,
                3986
            ],
            [
                3987,
                4060
            ],
            [
                4072,
                4089
            ],
            [
                4090,
                4099
            ],
            [
                4099,
                4149
            ],
            [
                4160,
                4170
            ],
            [
                4171,
                4174
            ],
            [
                4175,
                4231
            ],
            [
                4238,
                4284
            ],
            [
                4293,
                4298
            ],
            [
                4298,
                4349
            ],
            [
                4350,
                4409
            ],
            [
                4410,
                4458
            ],
            [
                4475,
                4526
            ],
            [
                4527,
                4529
            ],
            [
                4536,
                4578
            ],
            [
                4584,
                4620
            ],
            [
                4621,
                4648
            ],
            [
                4649,
                4656
            ],
            [
                4658,
                4662
            ],
            [
                4663,
                4667
            ],
            [
                4677,
                4710
            ],
            [
                4710,
                4712
            ],
            [
                4712,
                4766
            ],
            [
                4766,
                4792
            ],
            [
                4793,
                4798
            ],
            [
                4803,
                4804
            ],
            [
                4805,
                4817
            ],
            [
                4818,
                4821
            ],
            [
                4826,
                4827
            ],
            [
                4828,
                4831
            ],
            [
                4839,
                4843
            ],
            [
                4846,
                4851
            ],
            [
                4866,
                4868
            ],
            [
                4900,
                4902
            ],
            [
                4902,
                4910
            ],
            [
                4913,
                4919
            ],
            [
                4924,
                4927
            ],
            [
                4933,
                4941
            ],
            [
                4953,
                4979
            ],
            [
                4986,
                5026
            ],
            [
                5032,
                5038
            ],
            [
                5039,
                5057
            ],
            [
                5062,
                5087
            ],
            [
                5087,
                5115
            ],
            [
                5115,
                5187
            ],
            [
                5187,
                5204
            ],
            [
                5205,
                5259
            ],
            [
                5259,
                5271
            ],
            [
                5284,
                5288
            ],
            [
                5288,
                5290
            ],
            [
                5290,
                5306
            ],
            [
                5312,
                5321
            ],
            [
                5334,
                5349
            ],
            [
                5349,
                5361
            ],
            [
                5371,
                5382
            ],
            [
                5383,
                5396
            ],
            [
                5396,
                5424
            ],
            [
                5424,
                5433
            ],
            [
                5450,
                5461
            ],
            [
                5461,
                5530
            ],
            [
                5533,
                5549
            ],
            [
                5552,
                5569
            ],
            [
                5572,
                5596
            ],
            [
                5596,
                5610
            ],
            [
                5622,
                5623
            ],
            [
                5624,
                5625
            ],
            [
                5625,
                5637
            ],
            [
                5641,
                5656
            ],
            [
                5656,
                5657
            ],
            [
                5664,
                5676
            ],
            [
                5681,
                5741
            ],
            [
                5741,
                5742
            ],
            [
                5747,
                5750
            ],
            [
                5750,
                5791
            ],
            [
                5797,
                5825
            ],
            [
                5825,
                5840
            ],
            [
                5841,
                5855
            ],
            [
                5862,
                5870
            ],
            [
                5875,
                5891
            ],
            [
                5902,
                5904
            ],
            [
                5904,
                5931
            ],
            [
                5933,
                5952
            ],
            [
                5953,
                5956
            ],
            [
                5957,
                5985
            ],
            [
                5985,
                5987
            ],
            [
                5987,
                6024
            ],
            [
                6024,
                6095
            ],
            [
                6096,
                6099
            ],
            [
                6104,
                6107
            ],
            [
                6108,
                6123
            ],
            [
                6123,
                6125
            ],
            [
                6125,
                6152
            ],
            [
                6158,
                6163
            ],
            [
                6164,
                6191
            ],
            [
                6191,
                6231
            ],
            [
                6232,
                6235
            ],
            [
                6236,
                6251
            ],
            [
                6251,
                6253
            ],
            [
                6253,
                6269
            ],
            [
                6270,
                6295
            ],
            [
                6295,
                6297
            ],
            [
                6297,
                6333
            ],
            [
                6334,
                6341
            ],
            [
                6343,
                6394
            ],
            [
                6400,
                6408
            ],
            [
                6409,
                6449
            ],
            [
                6450,
                6493
            ],
            [
                6493,
                6586
            ],
            [
                6586,
                6635
            ],
            [
                6635,
                6654
            ],
            [
                6655,
                6737
            ],
            [
                6738,
                6756
            ],
            [
                6756,
                6802
            ],
            [
                6808,
                6829
            ],
            [
                6834,
                6841
            ],
            [
                6841,
                6889
            ],
            [
                6889,
                6914
            ],
            [
                6923,
                6969
            ],
            [
                6970,
                6977
            ],
            [
                6977,
                7001
            ],
            [
                7002,
                7003
            ],
            [
                7004,
                7060
            ],
            [
                7060,
                7063
            ],
            [
                7063,
                7100
            ],
            [
                7100,
                7161
            ],
            [
                7161,
                7218
            ],
            [
                7219,
                7234
            ],
            [
                7235,
                7257
            ],
            [
                7257,
                7259
            ],
            [
                7259,
                7262
            ],
            [
                7263,
                7270
            ],
            [
                7271,
                7288
            ],
            [
                7288,
                7289
            ],
            [
                7298,
                7301
            ],
            [
                7302,
                7382
            ],
            [
                7383,
                7388
            ],
            [
                7391,
                7393
            ],
            [
                7393,
                7397
            ],
            [
                7398,
                7505
            ],
            [
                7505,
                7638
            ],
            [
                7639,
                7706
            ],
            [
                7711,
                7725
            ],
            [
                7734,
                7748
            ],
            [
                7755,
                7813
            ],
            [
                7824,
                7835
            ],
            [
                7836,
                7863
            ],
            [
                7866,
                7889
            ],
            [
                7892,
                7936
            ],
            [
                7936,
                7937
            ],
            [
                7938,
                7968
            ],
            [
                7969,
                8077
            ],
            [
                8077,
                8091
            ],
            [
                8092,
                8106
            ],
            [
                8120,
                8149
            ],
            [
                8149,
                8151
            ],
            [
                8151,
                8183
            ],
            [
                8194,
                8204
            ]
        ],
        "row_chars": [
            [
                0,
                75
            ],
            [
                75,
                256
            ],
            [
                256,
                306
            ],
            [
                306,
                674
            ],
            [
                674,
                790
            ],
            [
                790,
                790
            ],
            [
                790,
                790
            ],
            [
                790,
                1091
            ],
            [
                1091,
                1091
            ],
            [
                1091,
                1091
            ],
            [
                1091,
                1406
            ],
            [
                1406,
                1612
            ],
            [
                1612,
                1667
            ],
            [
                1667,
                1746
            ],
            [
                1746,
                1798
            ],
            [
                1798,
                1855
            ],
            [
                1855,
                1855
            ],
            [
                1855,
                1855
            ],
            [
                1855,
                1855
            ],
            [
                1855,
                1977
            ],
            [
                1977,
                2170
            ],
            [
                2170,
                2345
            ],
            [
                2345,
                2473
            ],
            [
                2473,
                2785
            ],
            [
                2785,
                2956
            ],
            [
                2956,
                2956
            ],
            [
                2956,
                3087
            ],
            [
                3087,
                3087
            ],
            [
                3087,
                3087
            ],
            [
                3087,
                3087
            ],
            [
                3087,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3217
            ],
            [
                3217,
                3304
            ],
            [
                3304,
                3397
            ],
            [
                3397,
                3443
            ],
            [
                3443,
                3443
            ],
            [
                3443,
                3608
            ],
            [
                3608,
                3634
            ],
            [
                3634,
                3654
            ],
            [
                3654,
                3808
            ],
            [
                3808,
                3954
            ],
            [
                3954,
                4099
            ],
            [
                4099,
                4298
            ],
            [
                4298,
                4350
            ],
            [
                4350,
                4350
            ],
            [
                4350,
                4712
            ],
            [
                4712,
                4766
            ],
            [
                4766,
                4902
            ],
            [
                4902,
                5027
            ],
            [
                5027,
                5087
            ],
            [
                5087,
                5187
            ],
            [
                5187,
                5259
            ],
            [
                5259,
                5290
            ],
            [
                5290,
                5349
            ],
            [
                5349,
                5396
            ],
            [
                5396,
                5461
            ],
            [
                5461,
                5596
            ],
            [
                5596,
                5596
            ],
            [
                5596,
                5750
            ],
            [
                5750,
                5825
            ],
            [
                5825,
                5904
            ],
            [
                5904,
                5987
            ],
            [
                5987,
                6125
            ],
            [
                6125,
                6191
            ],
            [
                6191,
                6253
            ],
            [
                6253,
                6253
            ],
            [
                6253,
                6297
            ],
            [
                6297,
                6394
            ],
            [
                6394,
                6394
            ],
            [
                6394,
                6394
            ],
            [
                6394,
                6586
            ],
            [
                6586,
                6635
            ],
            [
                6635,
                6756
            ],
            [
                6756,
                6841
            ],
            [
                6841,
                6889
            ],
            [
                6889,
                6889
            ],
            [
                6889,
                7063
            ],
            [
                7063,
                7161
            ],
            [
                7161,
                7259
            ],
            [
                7259,
                7393
            ],
            [
                7393,
                7393
            ],
            [
                7393,
                7505
            ],
            [
                7505,
                7639
            ],
            [
                7639,
                7639
            ],
            [
                7639,
                7836
            ],
            [
                7836,
                7938
            ],
            [
                7938,
                8077
            ],
            [
                8077,
                8151
            ],
            [
                8151,
                8151
            ],
            [
                8151,
                8204
            ],
            [
                8204,
                8204
            ]
        ]
    }
}