{
    "original": {
        "text": "When the ladies of Gaunt House were at breakfast that morning, Lord Steyne (who took his chocolate in private and seldom disturbed the females of his household, or saw them except upon public days, or when they crossed each other in the hall, or when from his pit-box at the opera he surveyed them in their box on the grand tier) his lordship, we say, appeared among the ladies and the children who were assembled over the tea and toast, and a battle royal ensued apropos of Rebecca.\n\"My Lady Steyne,\" he said, \"I want to see the list for your dinner on Friday; and I want you, if you please, to write a card for Colonel and Mrs. Crawley.\"\n\"Blanche writes them,\" Lady Steyne said in a flutter. \"Lady Gaunt writes them.\"\n\"I will not write to that person,\" Lady Gaunt said, a tall and stately lady, who looked up for an instant and then down again after she had spoken. It was not good to meet Lord Steyne's eyes for those who had offended him.\n\"Send the children out of the room. Go!\" said he pulling at the bell-rope. The urchins, always frightened before him, retired: their mother would have followed too. \"Not you,\" he said. \"You stop.\"\n\"My Lady Steyne,\" he said, \"once more will you have the goodness to go to the desk and write that card for your dinner on Friday?\"\n\"My Lord, I will not be present at it,\" Lady Gaunt said; \"I will go home.\"\n\"I wish you would, and stay there. You will find the bailiffs at Bareacres very pleasant company, and I shall be freed from lending money to your relations and from your own damned tragedy airs. Who are you to give orders here? You have no money. You've got no brains. You were here to have children, and you have not had any. Gaunt's tired of you, and George's wife is the only person in the family who doesn't wish you were dead. Gaunt would marry again if you were.\"\n\"I wish I were,\" her Ladyship answered with tears and rage in her eyes.\n\"You, forsooth, must give yourself airs of virtue, while my wife, who is an immaculate saint, as everybody knows, and never did wrong in her life, has no objection to meet my young friend Mrs. Crawley. My Lady Steyne knows that appearances are sometimes against the best of women; that lies are often told about the most innocent of them. Pray, madam, shall I tell you some little anecdotes about my Lady Bareacres, your mamma?\"\n\"You may strike me if you like, sir, or hit any cruel blow,\" Lady Gaunt said. To see his wife and daughter suffering always put his Lordship into a good humour.\n\"My sweet Blanche,\" he said, \"I am a gentleman, and never lay my hand upon a woman, save in the way of kindness. I only wish to correct little faults in your character. You women are too proud, and sadly lack humility, as Father Mole, I'm sure, would tell my Lady Steyne if he were here. You mustn't give yourselves airs; you must be meek and humble, my blessings. For all Lady Steyne knows, this calumniated, simple, good-humoured Mrs. Crawley is quite innocent--even more innocent than herself. Her husband's character is not good, but it is as good as Bareacres', who has played a little and not paid a great deal, who cheated you out of the only legacy you ever had and left you a pauper on my hands. And Mrs. Crawley is not very well-born, but she is not worse than Fanny's illustrious ancestor, the first de la Jones.\"\n\"The money which I brought into the family, sir,\" Lady George cried out--\n\"You purchased a contingent reversion with it,\" the Marquis said darkly. \"If Gaunt dies, your husband may come to his honours; your little boys may inherit them, and who knows what besides? In the meanwhile, ladies, be as proud and virtuous as you like abroad, but don't give ME any airs. As for Mrs. Crawley's character, I shan't demean myself or that most spotless and perfectly irreproachable lady by even hinting that it requires a defence. You will be pleased to receive her with the utmost cordiality, as you will receive all persons whom I present in this house. This house?\" He broke out with a laugh. \"Who is the master of it? and what is it? This Temple of Virtue belongs to me. And if I invite all Newgate or all Bedlam here, by ------ they shall be welcome.\"\nAfter this vigorous allocution, to one of which sort Lord Steyne treated his \"Hareem\" whenever symptoms of insubordination appeared in his household, the crestfallen women had nothing for it but to obey. Lady Gaunt wrote the invitation which his Lordship required, and she and her mother-in-law drove in person, and with bitter and humiliated hearts, to leave the cards on Mrs. Rawdon, the reception of which caused that innocent woman so much pleasure.\nThere were families in London who would have sacrificed a year's income to receive such an honour at the hands of those great ladies. Mrs. Frederick Bullock, for instance, would have gone on her knees from May Fair to Lombard Street, if Lady Steyne and Lady Gaunt had been waiting in the City to raise her up and say, \"Come to us next Friday\"--not to one of the great crushes and grand balls of Gaunt House, whither everybody went, but to the sacred, unapproachable, mysterious, delicious entertainments, to be admitted to one of which was a privilege, and an honour, and a blessing indeed.\nSevere, spotless, and beautiful, Lady Gaunt held the very highest rank in Vanity Fair. The distinguished courtesy with which Lord Steyne treated her charmed everybody who witnessed his behaviour, caused the severest critics to admit how perfect a gentleman he was, and to own that his Lordship's heart at least was in the right place.\nThe ladies of Gaunt House called Lady Bareacres in to their aid, in order to repulse the common enemy. One of Lady Gaunt's carriages went to Hill Street for her Ladyship's mother, all whose equipages were in the hands of the bailiffs, whose very jewels and wardrobe, it was said, had been seized by those inexorable Israelites. Bareacres Castle was theirs, too, with all its costly pictures, furniture, and articles of vertu--the magnificent Vandykes; the noble Reynolds pictures; the Lawrence portraits, tawdry and beautiful, and, thirty years ago, deemed as precious as works of real genius; the matchless Dancing Nymph of Canova, for which Lady Bareacres had sat in her youth--Lady Bareacres splendid then, and radiant in wealth, rank, and beauty--a toothless, bald, old woman now--a mere rag of a former robe of state. Her lord, painted at the same time by Lawrence, as waving his sabre in front of Bareacres Castle, and clothed in his uniform as Colonel of the Thistlewood Yeomanry, was a withered, old, lean man in a greatcoat and a Brutus wig, slinking about Gray's Inn of mornings chiefly and dining alone at clubs. He did not like to dine with Steyne now. They had run races of pleasure together in youth when Bareacres was the winner. But Steyne had more bottom than he and had lasted him out. The Marquis was ten times a greater man now than the young Lord Gaunt of '85, and Bareacres nowhere in the race--old, beaten, bankrupt, and broken down. He had borrowed too much money of Steyne to find it pleasant to meet his old comrade often. The latter, whenever he wished to be merry, used jeeringly to ask Lady Gaunt why her father had not come to see her. \"He has not been here for four months,\" Lord Steyne would say. \"I can always tell by my cheque-book afterwards, when I get a visit from Bareacres. What a comfort it is, my ladies, I bank with one of my sons' fathers-in-law, and the other banks with me!\"\nOf the other illustrious persons whom Becky had the honour to encounter on this her first presentation to the grand world, it does not become the present historian to say much. There was his Excellency the Prince of Peterwaradin, with his Princess--a nobleman tightly girthed, with a large military chest, on which the plaque of his order shone magnificently, and wearing the red collar of the Golden Fleece round his neck. He was the owner of countless flocks. \"Look at his face. I think he must be descended from a sheep,\" Becky whispered to Lord Steyne. Indeed, his Excellency's countenance, long, solemn, and white, with the ornament round his neck, bore some resemblance to that of a venerable bell-wether.\nThere was Mr. John Paul Jefferson Jones, titularly attached to the American Embassy and correspondent of the New York Demagogue, who, by way of making himself agreeable to the company, asked Lady Steyne, during a pause in the conversation at dinner, how his dear friend, George Gaunt, liked the Brazils? He and George had been most intimate at Naples and had gone up Vesuvius together. Mr. Jones wrote a full and particular account of the dinner, which appeared duly in the Demagogue. He mentioned the names and titles of all the guests, giving biographical sketches of the principal people. He described the persons of the ladies with great eloquence; the service of the table; the size and costume of the servants; enumerated the dishes and wines served; the ornaments of the sideboard; and the probable value of the plate. Such a dinner he calculated could not be dished up under fifteen or eighteen dollars per head. And he was in the habit, until very lately, of sending over proteges, with letters of recommendation to the present Marquis of Steyne, encouraged to do so by the intimate terms on which he had lived with his dear friend, the late lord. He was most indignant that a young and insignificant aristocrat, the Earl of Southdown, should have taken the pas of him in their procession to the dining-room. \"Just as I was stepping up to offer my hand to a very pleasing and witty fashionable, the brilliant and exclusive Mrs. Rawdon Crawley,\"--he wrote--\"the young patrician interposed between me and the lady and whisked my Helen off without a word of apology. I was fain to bring up the rear with the Colonel, the lady's husband, a stout red-faced warrior who distinguished himself at Waterloo, where he had better luck than befell some of his brother redcoats at New Orleans.\"\nThe Colonel's countenance on coming into this polite society wore as many blushes as the face of a boy of sixteen assumes when he is confronted with his sister's schoolfellows. It has been told before that honest Rawdon had not been much used at any period of his life to ladies' company. With the men at the Club or the mess room, he was well enough; and could ride, bet, smoke, or play at billiards with the boldest of them. He had had his time for female friendships too, but that was twenty years ago, and the ladies were of the rank of those with whom Young Marlow in the comedy is represented as having been familiar before he became abashed in the presence of Miss Hardcastle. The times are such that one scarcely dares to allude to that kind of company which thousands of our young men in Vanity Fair are frequenting every day, which nightly fills casinos and dancing-rooms, which is known to exist as well as the Ring in Hyde Park or the Congregation at St. James's--but which the most squeamish if not the most moral of societies is determined to ignore. In a word, although Colonel Crawley was now five-and-forty years of age, it had not been his lot in life to meet with a half dozen good women, besides his paragon of a wife. All except her and his kind sister Lady Jane, whose gentle nature had tamed and won him, scared the worthy Colonel, and on occasion of his first dinner at Gaunt House he was not heard to make a single remark except to state that the weather was very hot. Indeed Becky would have left him at home, but that virtue ordained that her husband should be by her side to protect the timid and fluttering little creature on her first appearance in polite society.\nOn her first appearance Lord Steyne stepped forward, taking her hand, and greeting her with great courtesy, and presenting her to Lady Steyne, and their ladyships, her daughters. Their ladyships made three stately curtsies, and the elder lady to be sure gave her hand to the newcomer, but it was as cold and lifeless as marble.\nBecky took it, however, with grateful humility, and performing a reverence which would have done credit to the best dancer-master, put herself at Lady Steyne's feet, as it were, by saying that his Lordship had been her father's earliest friend and patron, and that she, Becky, had learned to honour and respect the Steyne family from the days of her childhood. The fact is that Lord Steyne had once purchased a couple of pictures of the late Sharp, and the affectionate orphan could never forget her gratitude for that favour.\nThe Lady Bareacres then came under Becky's cognizance--to whom the Colonel's lady made also a most respectful obeisance: it was returned with severe dignity by the exalted person in question.\n\"I had the pleasure of making your Ladyship's acquaintance at Brussels, ten years ago,\" Becky said in the most winning manner. \"I had the good fortune to meet Lady Bareacres at the Duchess of Richmond's ball, the night before the Battle of Waterloo. And I recollect your Ladyship, and my Lady Blanche, your daughter, sitting in the carriage in the porte-cochere at the Inn, waiting for horses. I hope your Ladyship's diamonds are safe.\"\nEverybody's eyes looked into their neighbour's. The famous diamonds had undergone a famous seizure, it appears, about which Becky, of course, knew nothing. Rawdon Crawley retreated with Lord Southdown into a window, where the latter was heard to laugh immoderately, as Rawdon told him the story of Lady Bareacres wanting horses and \"knuckling down by Jove,\" to Mrs. Crawley. \"I think I needn't be afraid of THAT woman,\" Becky thought. Indeed, Lady Bareacres exchanged terrified and angry looks with her daughter and retreated to a table, where she began to look at pictures with great energy.\nWhen the Potentate from the Danube made his appearance, the conversation was carried on in the French language, and the Lady Bareacres and the younger ladies found, to their farther mortification, that Mrs. Crawley was much better acquainted with that tongue, and spoke it with a much better accent than they. Becky had met other Hungarian magnates with the army in France in 1816-17. She asked after her friends with great interest. The foreign personages thought that she was a lady of great distinction, and the Prince and the Princess asked severally of Lord Steyne and the Marchioness, whom they conducted to dinner, who was that petite dame who spoke so well?\nFinally, the procession being formed in the order described by the American diplomatist, they marched into the apartment where the banquet was served, and which, as I have promised the reader he shall enjoy it, he shall have the liberty of ordering himself so as to suit his fancy.\nBut it was when the ladies were alone that Becky knew the tug of war would come. And then indeed the little woman found herself in such a situation as made her acknowledge the correctness of Lord Steyne's caution to her to beware of the society of ladies above her own sphere. As they say, the persons who hate Irishmen most are Irishmen; so, assuredly, the greatest tyrants over women are women. When poor little Becky, alone with the ladies, went up to the fire-place whither the great ladies had repaired, the great ladies marched away and took possession of a table of drawings. When Becky followed them to the table of drawings, they dropped off one by one to the fire again. She tried to speak to one of the children (of whom she was commonly fond in public places), but Master George Gaunt was called away by his mamma; and the stranger was treated with such cruelty finally, that even Lady Steyne herself pitied her and went up to speak to the friendless little woman.\n\"Lord Steyne,\" said her Ladyship, as her wan cheeks glowed with a blush, \"says you sing and play very beautifully, Mrs. Crawley--I wish you would do me the kindness to sing to me.\"\n\"I will do anything that may give pleasure to my Lord Steyne or to you,\" said Rebecca, sincerely grateful, and seating herself at the piano, began to sing.\nShe sang religious songs of Mozart, which had been early favourites of Lady Steyne, and with such sweetness and tenderness that the lady, lingering round the piano, sat down by its side and listened until the tears rolled down her eyes. It is true that the opposition ladies at the other end of the room kept up a loud and ceaseless buzzing and talking, but the Lady Steyne did not hear those rumours. She was a child again--and had wandered back through a forty years' wilderness to her convent garden. The chapel organ had pealed the same tones, the organist, the sister whom she loved best of the community, had taught them to her in those early happy days. She was a girl once more, and the brief period of her happiness bloomed out again for an hour--she started when the jarring doors were flung open, and with a loud laugh from Lord Steyne, the men of the party entered full of gaiety.\nHe saw at a glance what had happened in his absence, and was grateful to his wife for once. He went and spoke to her, and called her by her Christian name, so as again to bring blushes to her pale face--\"My wife says you have been singing like an angel,\" he said to Becky. Now there are angels of two kinds, and both sorts, it is said, are charming in their way.\nWhatever the previous portion of the evening had been, the rest of that night was a great triumph for Becky. She sang her very best, and it was so good that every one of the men came and crowded round the piano. The women, her enemies, were left quite alone. And Mr. Paul Jefferson Jones thought he had made a conquest of Lady Gaunt by going up to her Ladyship and praising her delightful friend's first-rate singing.",
        "paragraph_chars": [
            [
                0,
                484
            ],
            [
                484,
                640
            ],
            [
                640,
                720
            ],
            [
                720,
                943
            ],
            [
                943,
                1140
            ],
            [
                1140,
                1271
            ],
            [
                1271,
                1346
            ],
            [
                1346,
                1816
            ],
            [
                1816,
                1888
            ],
            [
                1888,
                2317
            ],
            [
                2317,
                2478
            ],
            [
                2478,
                3303
            ],
            [
                3303,
                3377
            ],
            [
                3377,
                4148
            ],
            [
                4148,
                4602
            ],
            [
                4602,
                5193
            ],
            [
                5193,
                5528
            ],
            [
                5528,
                7448
            ],
            [
                7448,
                8160
            ],
            [
                8160,
                9951
            ],
            [
                9951,
                11646
            ],
            [
                11646,
                11974
            ],
            [
                11974,
                12501
            ],
            [
                12501,
                12693
            ],
            [
                12693,
                13130
            ],
            [
                13130,
                13723
            ],
            [
                13723,
                14389
            ],
            [
                14389,
                14671
            ],
            [
                14671,
                15648
            ],
            [
                15648,
                15829
            ],
            [
                15829,
                15985
            ],
            [
                15985,
                16878
            ],
            [
                16878,
                17241
            ],
            [
                17241,
                17658
            ]
        ],
        "segment_chars": [
            [
                0,
                484
            ],
            [
                484,
                640
            ],
            [
                640,
                694
            ],
            [
                694,
                720
            ],
            [
                720,
                868
            ],
            [
                868,
                943
            ],
            [
                943,
                979
            ],
            [
                979,
                984
            ],
            [
                984,
                1018
            ],
            [
                1018,
                1108
            ],
            [
                1108,
                1128
            ],
            [
                1128,
                1140
            ],
            [
                1140,
                1271
            ],
            [
                1271,
                1346
            ],
            [
                1346,
                1381
            ],
            [
                1381,
                1541
            ],
            [
                1541,
                1574
            ],
            [
                1574,
                1593
            ],
            [
                1593,
                1615
            ],
            [
                1615,
                1673
            ],
            [
                1673,
                1778
            ],
            [
                1778,
                1816
            ],
            [
                1816,
                1888
            ],
            [
                1888,
                2090
            ],
            [
                2090,
                2227
            ],
            [
                2227,
                2317
            ],
            [
                2317,
                2395
            ],
            [
                2395,
                2478
            ],
            [
                2478,
                2591
            ],
            [
                2591,
                2647
            ],
            [
                2647,
                2766
            ],
            [
                2766,
                2843
            ],
            [
                2843,
                2975
            ],
            [
                2975,
                3183
            ],
            [
                3183,
                3303
            ],
            [
                3303,
                3377
            ],
            [
                3377,
                3450
            ],
            [
                3450,
                3567
            ],
            [
                3567,
                3666
            ],
            [
                3666,
                3822
            ],
            [
                3822,
                3947
            ],
            [
                3947,
                3960
            ],
            [
                3960,
                3987
            ],
            [
                3987,
                4013
            ],
            [
                4013,
                4029
            ],
            [
                4029,
                4066
            ],
            [
                4066,
                4148
            ],
            [
                4148,
                4352
            ],
            [
                4352,
                4602
            ],
            [
                4602,
                4736
            ],
            [
                4736,
                5193
            ],
            [
                5193,
                5280
            ],
            [
                5280,
                5528
            ],
            [
                5528,
                5631
            ],
            [
                5631,
                5856
            ],
            [
                5856,
                6351
            ],
            [
                6351,
                6652
            ],
            [
                6652,
                6693
            ],
            [
                6693,
                6773
            ],
            [
                6773,
                6832
            ],
            [
                6832,
                6985
            ],
            [
                6985,
                7077
            ],
            [
                7077,
                7194
            ],
            [
                7194,
                7257
            ],
            [
                7257,
                7341
            ],
            [
                7341,
                7448
            ],
            [
                7448,
                7625
            ],
            [
                7625,
                7872
            ],
            [
                7872,
                7910
            ],
            [
                7910,
                7929
            ],
            [
                7929,
                8005
            ],
            [
                8005,
                8160
            ],
            [
                8160,
                8464
            ],
            [
                8464,
                8546
            ],
            [
                8546,
                8645
            ],
            [
                8645,
                8752
            ],
            [
                8752,
                8986
            ],
            [
                8986,
                9081
            ],
            [
                9081,
                9317
            ],
            [
                9317,
                9478
            ],
            [
                9478,
                9733
            ],
            [
                9733,
                9951
            ],
            [
                9951,
                10128
            ],
            [
                10128,
                10240
            ],
            [
                10240,
                10378
            ],
            [
                10378,
                10635
            ],
            [
                10635,
                11016
            ],
            [
                11016,
                11190
            ],
            [
                11190,
                11445
            ],
            [
                11445,
                11646
            ],
            [
                11646,
                11825
            ],
            [
                11825,
                11974
            ],
            [
                11974,
                12335
            ],
            [
                12335,
                12501
            ],
            [
                12501,
                12693
            ],
            [
                12693,
                12820
            ],
            [
                12820,
                12943
            ],
            [
                12943,
                13087
            ],
            [
                13087,
                13130
            ],
            [
                13130,
                13178
            ],
            [
                13178,
                13286
            ],
            [
                13286,
                13505
            ],
            [
                13505,
                13565
            ],
            [
                13565,
                13723
            ],
            [
                13723,
                14033
            ],
            [
                14033,
                14108
            ],
            [
                14108,
                14157
            ],
            [
                14157,
                14389
            ],
            [
                14389,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14948
            ],
            [
                14948,
                15068
            ],
            [
                15068,
                15254
            ],
            [
                15254,
                15352
            ],
            [
                15352,
                15648
            ],
            [
                15648,
                15829
            ],
            [
                15829,
                15985
            ],
            [
                15985,
                16222
            ],
            [
                16222,
                16387
            ],
            [
                16387,
                16489
            ],
            [
                16489,
                16646
            ],
            [
                16646,
                16878
            ],
            [
                16878,
                16970
            ],
            [
                16970,
                17151
            ],
            [
                17151,
                17241
            ],
            [
                17241,
                17350
            ],
            [
                17350,
                17453
            ],
            [
                17453,
                17500
            ],
            [
                17500,
                17658
            ]
        ],
        "overlap_chars": [
            [
                0,
                74
            ],
            [
                159,
                160
            ],
            [
                76,
                79
            ],
            [
                80,
                109
            ],
            [
                350,
                360
            ],
            [
                168,
                172
            ],
            [
                438,
                463
            ],
            [
                475,
                484
            ],
            [
                484,
                512
            ],
            [
                535,
                560
            ],
            [
                566,
                601
            ],
            [
                604,
                640
            ],
            [
                640,
                693
            ],
            [
                720,
                754
            ],
            [
                766,
                770
            ],
            [
                755,
                759
            ],
            [
                760,
                765
            ],
            [
                770,
                839
            ],
            [
                866,
                868
            ],
            [
                868,
                910
            ],
            [
                938,
                943
            ],
            [
                943,
                979
            ],
            [
                979,
                984
            ],
            [
                989,
                991
            ],
            [
                984,
                988
            ],
            [
                1016,
                1018
            ],
            [
                1018,
                1048
            ],
            [
                1056,
                1102
            ],
            [
                1106,
                1108
            ],
            [
                1108,
                1128
            ],
            [
                1128,
                1137
            ],
            [
                1141,
                1155
            ],
            [
                1165,
                1166
            ],
            [
                1168,
                1271
            ],
            [
                1271,
                1315
            ],
            [
                1322,
                1346
            ],
            [
                1346,
                1363
            ],
            [
                1379,
                1381
            ],
            [
                1381,
                1515
            ],
            [
                1520,
                1541
            ],
            [
                1541,
                1574
            ],
            [
                1574,
                1593
            ],
            [
                1593,
                1615
            ],
            [
                1615,
                1673
            ],
            [
                1673,
                1778
            ],
            [
                1778,
                1816
            ],
            [
                1816,
                1865
            ],
            [
                1870,
                1888
            ],
            [
                1888,
                1892
            ],
            [
                1909,
                2001
            ],
            [
                2035,
                2054
            ],
            [
                2060,
                2090
            ],
            [
                2090,
                2092
            ],
            [
                2105,
                2110
            ],
            [
                2169,
                2220
            ],
            [
                2162,
                2167
            ],
            [
                2225,
                2227
            ],
            [
                2227,
                2317
            ],
            [
                2317,
                2394
            ],
            [
                2395,
                2478
            ],
            [
                2478,
                2591
            ],
            [
                2591,
                2647
            ],
            [
                2647,
                2670
            ],
            [
                2798,
                2827
            ],
            [
                2841,
                2843
            ],
            [
                2843,
                2869
            ],
            [
                2910,
                2925
            ],
            [
                2942,
                2975
            ],
            [
                2975,
                3118
            ],
            [
                3128,
                3134
            ],
            [
                3148,
                3183
            ],
            [
                3666,
                3721
            ],
            [
                3778,
                3801
            ],
            [
                3811,
                3822
            ],
            [
                3822,
                3830
            ],
            [
                3845,
                3945
            ],
            [
                3960,
                3962
            ],
            [
                3985,
                3987
            ],
            [
                4070,
                4081
            ],
            [
                4097,
                4116
            ],
            [
                4124,
                4148
            ],
            [
                4298,
                4352
            ],
            [
                4352,
                4383
            ],
            [
                4411,
                4517
            ],
            [
                4384,
                4389
            ],
            [
                4521,
                4532
            ],
            [
                4584,
                4602
            ],
            [
                4602,
                4699
            ],
            [
                4734,
                4736
            ],
            [
                4736,
                4869
            ],
            [
                4920,
                4943
            ],
            [
                5193,
                5209
            ],
            [
                5211,
                5230
            ],
            [
                5231,
                5280
            ],
            [
                5280,
                5388
            ],
            [
                5458,
                5461
            ],
            [
                5389,
                5456
            ],
            [
                5526,
                5528
            ],
            [
                5528,
                5575
            ],
            [
                5579,
                5591
            ],
            [
                5602,
                5631
            ],
            [
                5631,
                5688
            ],
            [
                5700,
                5707
            ],
            [
                6213,
                6222
            ],
            [
                5728,
                5761
            ],
            [
                6085,
                6087
            ],
            [
                5798,
                5801
            ],
            [
                5856,
                5872
            ],
            [
                5888,
                5918
            ],
            [
                5781,
                5784
            ],
            [
                5920,
                5929
            ],
            [
                5954,
                5978
            ],
            [
                5931,
                5934
            ],
            [
                5990,
                5998
            ],
            [
                5761,
                5762
            ],
            [
                6009,
                6031
            ],
            [
                6040,
                6043
            ],
            [
                6122,
                6149
            ],
            [
                6159,
                6206
            ],
            [
                6242,
                6249
            ],
            [
                6232,
                6237
            ],
            [
                6308,
                6311
            ],
            [
                6279,
                6296
            ],
            [
                6298,
                6307
            ],
            [
                5793,
                5794
            ],
            [
                6313,
                6351
            ],
            [
                6351,
                6359
            ],
            [
                6516,
                6521
            ],
            [
                6537,
                6541
            ],
            [
                6359,
                6360
            ],
            [
                6522,
                6530
            ],
            [
                6542,
                6604
            ],
            [
                6956,
                6966
            ],
            [
                6968,
                6985
            ],
            [
                6985,
                7015
            ],
            [
                7019,
                7069
            ],
            [
                7075,
                7077
            ],
            [
                7087,
                7193
            ],
            [
                7448,
                7509
            ],
            [
                7520,
                7522
            ],
            [
                7528,
                7531
            ],
            [
                7538,
                7570
            ],
            [
                7579,
                7582
            ],
            [
                7615,
                7625
            ],
            [
                7625,
                7682
            ],
            [
                7697,
                7698
            ],
            [
                7723,
                7724
            ],
            [
                7752,
                7753
            ],
            [
                7806,
                7807
            ],
            [
                7774,
                7776
            ],
            [
                7730,
                7731
            ],
            [
                7870,
                7871
            ],
            [
                8160,
                8200
            ],
            [
                8211,
                8293
            ],
            [
                8329,
                8331
            ],
            [
                8311,
                8328
            ],
            [
                8343,
                8362
            ],
            [
                8410,
                8450
            ],
            [
                8455,
                8456
            ],
            [
                8462,
                8463
            ],
            [
                8546,
                8568
            ],
            [
                8584,
                8612
            ],
            [
                8622,
                8626
            ],
            [
                8613,
                8621
            ],
            [
                8627,
                8645
            ],
            [
                8645,
                8696
            ],
            [
                8811,
                8812
            ],
            [
                8752,
                8768
            ],
            [
                8784,
                8790
            ],
            [
                8696,
                8697
            ],
            [
                8828,
                8837
            ],
            [
                8817,
                8824
            ],
            [
                8863,
                8875
            ],
            [
                8852,
                8859
            ],
            [
                8888,
                8908
            ],
            [
                8949,
                8986
            ],
            [
                8986,
                8999
            ],
            [
                9000,
                9013
            ],
            [
                9014,
                9081
            ],
            [
                9317,
                9416
            ],
            [
                9434,
                9477
            ],
            [
                9478,
                9524
            ],
            [
                9564,
                9567
            ],
            [
                9527,
                9550
            ],
            [
                9592,
                9613
            ],
            [
                9615,
                9623
            ],
            [
                9562,
                9563
            ],
            [
                9625,
                9635
            ],
            [
                9685,
                9692
            ],
            [
                9672,
                9680
            ],
            [
                9702,
                9733
            ],
            [
                9733,
                9734
            ],
            [
                9877,
                9880
            ],
            [
                9744,
                9866
            ],
            [
                9948,
                9951
            ],
            [
                9951,
                9962
            ],
            [
                9977,
                10011
            ],
            [
                10025,
                10027
            ],
            [
                10048,
                10064
            ],
            [
                10084,
                10128
            ],
            [
                10128,
                10170
            ],
            [
                10175,
                10178
            ],
            [
                10184,
                10193
            ],
            [
                10220,
                10240
            ],
            [
                10378,
                10420
            ],
            [
                10424,
                10479
            ],
            [
                10484,
                10488
            ],
            [
                10633,
                10635
            ],
            [
                11027,
                11059
            ],
            [
                11064,
                11065
            ],
            [
                11060,
                11064
            ],
            [
                11025,
                11026
            ],
            [
                11092,
                11099
            ],
            [
                11136,
                11140
            ],
            [
                11019,
                11020
            ],
            [
                11141,
                11157
            ],
            [
                11159,
                11190
            ],
            [
                11190,
                11204
            ],
            [
                11234,
                11235
            ],
            [
                11205,
                11224
            ],
            [
                11225,
                11234
            ],
            [
                11277,
                11309
            ],
            [
                11325,
                11359
            ],
            [
                11364,
                11367
            ],
            [
                11377,
                11445
            ],
            [
                11458,
                11490
            ],
            [
                11496,
                11571
            ],
            [
                11587,
                11646
            ],
            [
                11646,
                11652
            ],
            [
                11670,
                11697
            ],
            [
                11699,
                11715
            ],
            [
                11729,
                11753
            ],
            [
                11758,
                11787
            ],
            [
                11716,
                11719
            ],
            [
                11810,
                11823
            ],
            [
                11823,
                11825
            ],
            [
                11825,
                11888
            ],
            [
                11900,
                11974
            ],
            [
                11974,
                12025
            ],
            [
                12162,
                12242
            ],
            [
                12251,
                12272
            ],
            [
                12285,
                12307
            ],
            [
                12320,
                12335
            ],
            [
                12335,
                12403
            ],
            [
                12407,
                12483
            ],
            [
                12499,
                12501
            ],
            [
                12520,
                12524
            ],
            [
                12556,
                12558
            ],
            [
                12501,
                12519
            ],
            [
                12691,
                12692
            ],
            [
                12693,
                12780
            ],
            [
                12787,
                12820
            ],
            [
                12820,
                12821
            ],
            [
                12867,
                12943
            ],
            [
                12943,
                13033
            ],
            [
                13055,
                13087
            ],
            [
                13087,
                13130
            ],
            [
                13178,
                13228
            ],
            [
                13240,
                13286
            ],
            [
                13505,
                13506
            ],
            [
                13514,
                13549
            ],
            [
                13674,
                13677
            ],
            [
                13556,
                13563
            ],
            [
                13571,
                13572
            ],
            [
                13573,
                13666
            ],
            [
                13721,
                13723
            ],
            [
                13723,
                13807
            ],
            [
                13811,
                13813
            ],
            [
                13808,
                13810
            ],
            [
                13818,
                13824
            ],
            [
                13833,
                13834
            ],
            [
                13886,
                13890
            ],
            [
                13814,
                13817
            ],
            [
                13905,
                13918
            ],
            [
                13843,
                13880
            ],
            [
                13918,
                13919
            ],
            [
                13925,
                13937
            ],
            [
                13987,
                13992
            ],
            [
                13942,
                13953
            ],
            [
                14022,
                14033
            ],
            [
                14234,
                14248
            ],
            [
                14253,
                14261
            ],
            [
                14208,
                14210
            ],
            [
                14262,
                14267
            ],
            [
                14345,
                14389
            ],
            [
                14389,
                14396
            ],
            [
                14478,
                14549
            ],
            [
                14570,
                14580
            ],
            [
                14603,
                14645
            ],
            [
                14652,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14784
            ],
            [
                14884,
                14886
            ],
            [
                14831,
                14883
            ],
            [
                14891,
                14948
            ],
            [
                15021,
                15067
            ],
            [
                15068,
                15090
            ],
            [
                15115,
                15140
            ],
            [
                15149,
                15169
            ],
            [
                15178,
                15209
            ],
            [
                15233,
                15254
            ],
            [
                15254,
                15291
            ],
            [
                15303,
                15321
            ],
            [
                15333,
                15352
            ],
            [
                15352,
                15393
            ],
            [
                15552,
                15553
            ],
            [
                15444,
                15544
            ],
            [
                15554,
                15558
            ],
            [
                15545,
                15552
            ],
            [
                15564,
                15648
            ],
            [
                15648,
                15660
            ],
            [
                15727,
                15775
            ],
            [
                15660,
                15681
            ],
            [
                15685,
                15699
            ],
            [
                15721,
                15722
            ],
            [
                15777,
                15820
            ],
            [
                15826,
                15829
            ],
            [
                15829,
                15969
            ],
            [
                15970,
                15985
            ],
            [
                15985,
                16009
            ],
            [
                16013,
                16092
            ],
            [
                16108,
                16121
            ],
            [
                16150,
                16161
            ],
            [
                16139,
                16148
            ],
            [
                16171,
                16183
            ],
            [
                16194,
                16199
            ],
            [
                16212,
                16222
            ],
            [
                16238,
                16342
            ],
            [
                16347,
                16371
            ],
            [
                16385,
                16387
            ],
            [
                16387,
                16408
            ],
            [
                16531,
                16532
            ],
            [
                16619,
                16621
            ],
            [
                16469,
                16487
            ],
            [
                16670,
                16721
            ],
            [
                16661,
                16670
            ],
            [
                16728,
                16739
            ],
            [
                16487,
                16488
            ],
            [
                16741,
                16840
            ],
            [
                16854,
                16861
            ],
            [
                16876,
                16878
            ],
            [
                16881,
                16914
            ],
            [
                16929,
                16970
            ],
            [
                16970,
                16995
            ],
            [
                17007,
                17079
            ],
            [
                17081,
                17150
            ],
            [
                17296,
                17350
            ],
            [
                17350,
                17358
            ],
            [
                17385,
                17387
            ],
            [
                17393,
                17453
            ],
            [
                17453,
                17500
            ],
            [
                17500,
                17658
            ]
        ],
        "row_chars": [
            [
                0,
                484
            ],
            [
                484,
                640
            ],
            [
                640,
                694
            ],
            [
                694,
                720
            ],
            [
                720,
                868
            ],
            [
                868,
                943
            ],
            [
                943,
                979
            ],
            [
                979,
                984
            ],
            [
                984,
                1018
            ],
            [
                1018,
                1108
            ],
            [
                1108,
                1128
            ],
            [
                1128,
                1140
            ],
            [
                1140,
                1271
            ],
            [
                1271,
                1346
            ],
            [
                1346,
                1381
            ],
            [
                1381,
                1541
            ],
            [
                1541,
                1574
            ],
            [
                1574,
                1593
            ],
            [
                1593,
                1615
            ],
            [
                1615,
                1673
            ],
            [
                1673,
                1778
            ],
            [
                1778,
                1816
            ],
            [
                1816,
                1888
            ],
            [
                1888,
                2090
            ],
            [
                2090,
                2227
            ],
            [
                2227,
                2317
            ],
            [
                2317,
                2395
            ],
            [
                2395,
                2478
            ],
            [
                2478,
                2591
            ],
            [
                2591,
                2647
            ],
            [
                2647,
                2843
            ],
            [
                2843,
                2975
            ],
            [
                2975,
                3183
            ],
            [
                3183,
                3303
            ],
            [
                3303,
                3377
            ],
            [
                3377,
                3450
            ],
            [
                3450,
                3567
            ],
            [
                3567,
                3666
            ],
            [
                3666,
                3822
            ],
            [
                3822,
                3947
            ],
            [
                3947,
                3960
            ],
            [
                3960,
                3987
            ],
            [
                3987,
                4013
            ],
            [
                4013,
                4029
            ],
            [
                4029,
                4066
            ],
            [
                4066,
                4148
            ],
            [
                4148,
                4352
            ],
            [
                4352,
                4602
            ],
            [
                4602,
                4736
            ],
            [
                4736,
                5193
            ],
            [
                5193,
                5280
            ],
            [
                5280,
                5528
            ],
            [
                5528,
                5631
            ],
            [
                5631,
                6351
            ],
            [
                6351,
                6985
            ],
            [
                6985,
                7077
            ],
            [
                7077,
                7194
            ],
            [
                7194,
                7257
            ],
            [
                7257,
                7341
            ],
            [
                7341,
                7448
            ],
            [
                7448,
                7625
            ],
            [
                7625,
                7872
            ],
            [
                7872,
                7910
            ],
            [
                7910,
                7929
            ],
            [
                7929,
                8005
            ],
            [
                8005,
                8160
            ],
            [
                8160,
                8464
            ],
            [
                8464,
                8546
            ],
            [
                8546,
                8645
            ],
            [
                8645,
                8986
            ],
            [
                8986,
                9081
            ],
            [
                9081,
                9317
            ],
            [
                9317,
                9478
            ],
            [
                9478,
                9733
            ],
            [
                9733,
                9951
            ],
            [
                9951,
                10128
            ],
            [
                10128,
                10240
            ],
            [
                10240,
                10378
            ],
            [
                10378,
                10635
            ],
            [
                10635,
                11016
            ],
            [
                11016,
                11190
            ],
            [
                11190,
                11445
            ],
            [
                11445,
                11646
            ],
            [
                11646,
                11825
            ],
            [
                11825,
                11974
            ],
            [
                11974,
                12335
            ],
            [
                12335,
                12501
            ],
            [
                12501,
                12693
            ],
            [
                12693,
                12820
            ],
            [
                12820,
                12943
            ],
            [
                12943,
                13087
            ],
            [
                13087,
                13130
            ],
            [
                13130,
                13178
            ],
            [
                13178,
                13286
            ],
            [
                13286,
                13505
            ],
            [
                13505,
                13723
            ],
            [
                13723,
                14033
            ],
            [
                14033,
                14108
            ],
            [
                14108,
                14157
            ],
            [
                14157,
                14389
            ],
            [
                14389,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14948
            ],
            [
                14948,
                15068
            ],
            [
                15068,
                15254
            ],
            [
                15254,
                15352
            ],
            [
                15352,
                15648
            ],
            [
                15648,
                15829
            ],
            [
                15829,
                15985
            ],
            [
                15985,
                16222
            ],
            [
                16222,
                16387
            ],
            [
                16387,
                16878
            ],
            [
                16878,
                16970
            ],
            [
                16970,
                17151
            ],
            [
                17151,
                17241
            ],
            [
                17241,
                17350
            ],
            [
                17350,
                17453
            ],
            [
                17453,
                17500
            ],
            [
                17500,
                17658
            ]
        ]
    },
    "abridged": {
        "text": "When the ladies of Gaunt House were at breakfast that morning, Lord Steyne, who normally took his chocolate in private, appeared amongst them; and a battle royal ensued about Rebecca.\n\"My Lady Steyne,\" he said, \"for your dinner on Friday, I want you, if you please, to write an invitation card for Colonel and Mrs. Crawley.\"\n\"Blanche writes them,\" Lady Steyne said in a flutter.\n\"I will not write to that person,\" said Lady Blanche Gaunt, a tall and stately lady, who looked up for an instant and then down. It was not good to meet Lord Steyne's eyes after offending him.\n\"Send the children out of the room. Go!\" he said. The urchins, always frightened of him, retired: their mother would have followed. \"Not you,\" he said. \"You stop. My Lady Steyne, once more will you have the goodness to go to the desk and write that card for your dinner on Friday?\"\n\"My Lord, I will not be present at it,\" Lady Blanche said; \"I will go home.\"\n\"I wish you would. You will find the bailiffs at Bareacres very pleasant company, and I shall be freed from lending money to your relations and from your damned tragedy airs. Who are you to give orders here? You have no money. You've got no brains. You were here to have children, and you have not had any. Gaunt's tired of you, and George's wife is the only person in the family who doesn't wish you were dead. Gaunt would marry again if you were.\"\n\"I wish I were,\" her Ladyship answered with tears of rage in her eyes.\n\"You give yourself airs of virtue, while my wife, who is an immaculate saint, as everybody knows, has no objection to meeting my young friend Mrs. Crawley. My wife knows that lies are often told about the most innocent of women. Pray, madam, shall I tell you some little anecdotes about my Lady Bareacres, your mamma?\"\n\"You may strike me if you like, sir, or hit any cruel blow,\" Lady Gaunt said.\nTo see his wife and daughter suffering always put his Lordship into a good humour.\n\"My sweet Blanche,\" he said, \"I am a gentleman, and never lay my hand upon a woman, save in the way of kindness. I only wish to correct little faults in your character. You women are too proud; you must be meek and humble. For all Lady Steyne knows, Mrs. Crawley is even more innocent than herself. Her husband's character is not good, but it is as good as Bareacres', who has played a little and not paid a great deal, who cheated you out of your legacy and left you a pauper on my hands. As for Mrs. Crawley's character, I shan't demean myself by even hinting that it needs a defence. You will receive her with the utmost cordiality, as you will receive all persons whom I present in this house.\" He laughed. \"If I invite all Bedlam here, by ___, they shall be welcome.\"\nThe crestfallen women had nothing for it but to obey. Lady Gaunt wrote the invitation, and she and her mother-in-law drove in person, and with bitter and humiliated hearts, to leave the cards which gave Mrs. Rawdon so much pleasure.\nThere were families in London who would have sacrificed a year's income to receive such an honour. Mrs. Frederick Bullock, for instance, would have gone on her knees from May Fair to Lombard Street, if Lady Steyne and Lady Gaunt had said \"Come to us next Friday.\"\nSevere, spotless and beautiful, Lady Blanche Gaunt held the very highest rank in Vanity Fair. The distinguished courtesy with which Lord Steyne treated her charmed everybody who witnessed his behaviour, and caused the severest critics to admit how perfect a gentleman he was.\nThe ladies of Gaunt House called Lady Bareacres to their aid to repulse the common enemy. One of Lady Gaunt's carriages went to Hill Street for her mother, since Lady Bareacres' carriages were in the hands of the bailiffs - as was Bareacres Castle, with all its costly pictures and furniture: the magnificent Vandykes and Reynolds, the Lawrence portraits and the matchless Dancing Nymph, for which Lady Bareacres had sat in her youth - radiant then, but now a toothless, bald old woman, a mere rag of a former robe of state. Her lord was a lean, withered man in a greatcoat and a Brutus wig, slinking about Gray's Inn, bankrupt and broken down. He had borrowed too much money from Steyne to find it pleasant to meet his old comrade. Steyne, whenever he wished to be merry, used jeeringly to ask Lady Gaunt why her father had not come to see her.\nOf the other illustrious persons whom Becky had the honour to meet on her presentation to the grand world, we shall not say much. There was his Excellency the Prince of Peterwaradin, with a long, solemn, white face, of whom Becky whispered to Lord Steyne that he must be descended from a sheep.\nThere was Mr. John Paul Jefferson Jones, attached to the American Embassy and correspondent of the New York Demagogue, who, to make himself agreeable, asked Lady Steyne how his dear friend, George Gaunt, liked Brazil?\nMr. Jones wrote a full account of the dinner, which duly appeared in the Demagogue. He mentioned the names and titles of all the guests; he described the ladies, the table service, the servants' costume, the dishes and wines, and the probable value of the plate. Such a dinner, he calculated, could not be dished up under fifteen or eighteen dollars per head. He was most indignant that a young and insignificant aristocrat, the Earl of Southdown, should have overtaken him in their procession to the dining-room.\n\"Just as I was stepping up to offer my hand to the very pleasing and witty Mrs. Rawdon Crawley,\" he wrote, \"the young man whisked the lady off without a word of apology. I had to bring up the rear with the Colonel, the lady's husband, a stout red-faced warrior who distinguished himself at Waterloo.\"\nThe Colonel on coming into this polite society blushed like a boy of sixteen confronted with his sister's schoolfellows. It has been told before that honest Rawdon was not much used to ladies' company. He had had his time for female friendships, but that was twenty years ago, and the ladies were of a different rank and sort. Although Colonel Crawley was now forty-five, he had not met half a dozen good women besides his paragon of a wife. All except her, and his kind sister-in-law Lady Jane, scared the worthy Colonel, and during his first dinner at Gaunt House he did not make a single remark except to state that the weather was very hot. Becky would have left him at home, but virtue ordained that her husband should be by her side to protect the timid little creature on her first appearance in polite society.\nOn her arrival Lord Steyne stepped forward. Taking her hand, he greeted her with great courtesy, presenting her to Lady Steyne and her daughters-in-law. Their ladyships made three stately curtsies, and the elder lady gave her hand to the newcomer, but it was as cold and lifeless as marble.\nBecky took it, however, with grateful humility, and explained that his Lordship had been her father's earliest friend and patron, and that she had learned to honour the Steyne family from her childhood. The fact is that Lord Steyne had once purchased a couple of pictures from the late Sharp, and the affectionate orphan could never forget her gratitude.\nBecky then curtseyed to the Lady Bareacres. \"I had the pleasure of making your Ladyship's acquaintance at Brussels, ten years ago,\" she said in the most winning manner. \"We met at the Duchess of Richmond's ball, the night before the Battle of Waterloo. And I recollect your Ladyship, and my Lady Blanche, your daughter, sitting in the carriage at the Inn, waiting for horses. I hope your Ladyship's diamonds are safe.\"\nThe famous diamonds had undergone a famous seizure, about which Becky, of course, knew nothing. \"I needn't be afraid of that woman,\" she thought, as Lady Bareacres exchanged terrified and angry looks with her daughter and retreated to a table.\nWhen the Potentate from the Danube made his appearance, the conversation was carried in on French, which, to the mortification of Lady Bareacres and the younger ladies, Mrs. Crawley spoke much better than they. The Prince and Princess of Peterwaradin asked who was that petite dame who spoke so well?\nFinally they marched into the apartment where the banquet was served, and which the reader shall have the liberty of ordering himself to suit his fancy.\nBut it was when the ladies were alone that Becky knew the tug of war would come. And then indeed the little woman had to acknowledge the correctness of Lord Steyne's caution to beware of the society of ladies above her own sphere. Assuredly, the greatest tyrants over women are women.\nWhen poor little Becky went up to the fire-place where the great ladies had gathered, the great ladies marched away to a table of drawings. When Becky followed them to the table, they dropped off to the fire again. She tried to speak to one of the children, but Master George Gaunt was called away by his mamma; and the stranger was treated with such cruelty that finally Lady Steyne herself pitied her and went up to speak to the friendless little woman.\n\"Lord Steyne says you sing and play very beautifully, Mrs. Crawley,\" said her Ladyship, her wan cheeks blushing. \"I wish you would do me the kindness to sing.\"\n\"I will do anything that may give pleasure to my Lord Steyne or to you,\" said Rebecca, sincerely grateful, and seating herself at the piano, she began to sing.\nShe sang religious songs by Mozart, which had been early favourites of Lady Steyne, and with such sweetness that the lady sat down by the piano and listened with tears in her eyes. The opposition ladies at the other end of the room kept up a loud and ceaseless buzzing and talking, but Lady Steyne did not hear. She was a child again, in her convent garden, and the brief period of her happiness bloomed out once more for an hour. She started when the jarring doors were flung open, and with a loud laugh from Lord Steyne, the men entered.\nLord Steyne saw at a glance what had happened, and was grateful to his wife for once. He went and spoke to her, calling her by her Christian name, so as again to bring blushes to her pale face.\n\"My wife says you have been singing like an angel,\" he said to Becky.\nThe rest of that night was a great triumph for Becky. She sang so well that every one of the men came and crowded round the piano. The women, her enemies, were left quite alone. And Mr. Paul Jefferson Jones thought he had made a conquest of Lady Gaunt by going up to her Ladyship and praising her delightful friend's first-rate singing.",
        "paragraph_chars": [
            [
                0,
                184
            ],
            [
                184,
                325
            ],
            [
                325,
                379
            ],
            [
                379,
                572
            ],
            [
                572,
                854
            ],
            [
                854,
                931
            ],
            [
                931,
                1381
            ],
            [
                1381,
                1452
            ],
            [
                1452,
                1771
            ],
            [
                1771,
                1849
            ],
            [
                1849,
                1932
            ],
            [
                1932,
                2705
            ],
            [
                2705,
                2938
            ],
            [
                2938,
                3202
            ],
            [
                3202,
                3478
            ],
            [
                3478,
                4324
            ],
            [
                4324,
                4619
            ],
            [
                4619,
                4837
            ],
            [
                4837,
                5351
            ],
            [
                5351,
                5652
            ],
            [
                5652,
                6471
            ],
            [
                6471,
                6762
            ],
            [
                6762,
                7117
            ],
            [
                7117,
                7536
            ],
            [
                7536,
                7780
            ],
            [
                7780,
                8081
            ],
            [
                8081,
                8234
            ],
            [
                8234,
                8519
            ],
            [
                8519,
                8975
            ],
            [
                8975,
                9135
            ],
            [
                9135,
                9295
            ],
            [
                9295,
                9835
            ],
            [
                9835,
                10029
            ],
            [
                10029,
                10099
            ],
            [
                10099,
                10435
            ]
        ],
        "segment_chars": [
            [
                0,
                184
            ],
            [
                184,
                325
            ],
            [
                325,
                379
            ],
            [
                379,
                508
            ],
            [
                508,
                572
            ],
            [
                572,
                608
            ],
            [
                608,
                613
            ],
            [
                613,
                622
            ],
            [
                622,
                704
            ],
            [
                704,
                724
            ],
            [
                724,
                735
            ],
            [
                735,
                854
            ],
            [
                854,
                931
            ],
            [
                931,
                950
            ],
            [
                950,
                1106
            ],
            [
                1106,
                1139
            ],
            [
                1139,
                1158
            ],
            [
                1158,
                1180
            ],
            [
                1180,
                1238
            ],
            [
                1238,
                1343
            ],
            [
                1343,
                1381
            ],
            [
                1381,
                1452
            ],
            [
                1452,
                1608
            ],
            [
                1608,
                1681
            ],
            [
                1681,
                1771
            ],
            [
                1771,
                1849
            ],
            [
                1849,
                1932
            ],
            [
                1932,
                2045
            ],
            [
                2045,
                2101
            ],
            [
                2101,
                2155
            ],
            [
                2155,
                2231
            ],
            [
                2231,
                2422
            ],
            [
                2422,
                2519
            ],
            [
                2519,
                2631
            ],
            [
                2631,
                2643
            ],
            [
                2643,
                2705
            ],
            [
                2705,
                2759
            ],
            [
                2759,
                2938
            ],
            [
                2938,
                3037
            ],
            [
                3037,
                3202
            ],
            [
                3202,
                3296
            ],
            [
                3296,
                3478
            ],
            [
                3478,
                3568
            ],
            [
                3568,
                4003
            ],
            [
                4003,
                4123
            ],
            [
                4123,
                4211
            ],
            [
                4211,
                4324
            ],
            [
                4324,
                4454
            ],
            [
                4454,
                4619
            ],
            [
                4619,
                4837
            ],
            [
                4837,
                4921
            ],
            [
                4921,
                5100
            ],
            [
                5100,
                5197
            ],
            [
                5197,
                5351
            ],
            [
                5351,
                5521
            ],
            [
                5521,
                5652
            ],
            [
                5652,
                5773
            ],
            [
                5773,
                5854
            ],
            [
                5854,
                5979
            ],
            [
                5979,
                6094
            ],
            [
                6094,
                6297
            ],
            [
                6297,
                6471
            ],
            [
                6471,
                6515
            ],
            [
                6515,
                6624
            ],
            [
                6624,
                6762
            ],
            [
                6762,
                6965
            ],
            [
                6965,
                7117
            ],
            [
                7117,
                7161
            ],
            [
                7161,
                7286
            ],
            [
                7286,
                7370
            ],
            [
                7370,
                7493
            ],
            [
                7493,
                7536
            ],
            [
                7536,
                7632
            ],
            [
                7632,
                7780
            ],
            [
                7780,
                7991
            ],
            [
                7991,
                8081
            ],
            [
                8081,
                8234
            ],
            [
                8234,
                8315
            ],
            [
                8315,
                8465
            ],
            [
                8465,
                8519
            ],
            [
                8519,
                8659
            ],
            [
                8659,
                8734
            ],
            [
                8734,
                8975
            ],
            [
                8975,
                9088
            ],
            [
                9088,
                9135
            ],
            [
                9135,
                9295
            ],
            [
                9295,
                9476
            ],
            [
                9476,
                9607
            ],
            [
                9607,
                9726
            ],
            [
                9726,
                9835
            ],
            [
                9835,
                9921
            ],
            [
                9921,
                10029
            ],
            [
                10029,
                10099
            ],
            [
                10099,
                10153
            ],
            [
                10153,
                10230
            ],
            [
                10230,
                10277
            ],
            [
                10277,
                10435
            ]
        ],
        "overlap_chars": [
            [
                0,
                74
            ],
            [
                74,
                75
            ],
            [
                76,
                79
            ],
            [
                89,
                118
            ],
            [
                118,
                128
            ],
            [
                137,
                141
            ],
            [
                143,
                168
            ],
            [
                175,
                184
            ],
            [
                184,
                212
            ],
            [
                212,
                237
            ],
            [
                239,
                274
            ],
            [
                289,
                325
            ],
            [
                325,
                378
            ],
            [
                379,
                413
            ],
            [
                414,
                418
            ],
            [
                419,
                423
            ],
            [
                432,
                437
            ],
            [
                437,
                506
            ],
            [
                506,
                508
            ],
            [
                508,
                550
            ],
            [
                567,
                572
            ],
            [
                572,
                608
            ],
            [
                608,
                613
            ],
            [
                613,
                615
            ],
            [
                616,
                620
            ],
            [
                620,
                622
            ],
            [
                622,
                652
            ],
            [
                656,
                702
            ],
            [
                702,
                704
            ],
            [
                704,
                724
            ],
            [
                724,
                733
            ],
            [
                735,
                749
            ],
            [
                749,
                750
            ],
            [
                751,
                854
            ],
            [
                854,
                898
            ],
            [
                907,
                931
            ],
            [
                931,
                948
            ],
            [
                948,
                950
            ],
            [
                950,
                1084
            ],
            [
                1085,
                1106
            ],
            [
                1106,
                1139
            ],
            [
                1139,
                1158
            ],
            [
                1158,
                1180
            ],
            [
                1180,
                1238
            ],
            [
                1238,
                1343
            ],
            [
                1343,
                1381
            ],
            [
                1381,
                1430
            ],
            [
                1434,
                1452
            ],
            [
                1452,
                1456
            ],
            [
                1457,
                1549
            ],
            [
                1550,
                1569
            ],
            [
                1578,
                1608
            ],
            [
                1608,
                1610
            ],
            [
                1616,
                1621
            ],
            [
                1622,
                1673
            ],
            [
                1674,
                1679
            ],
            [
                1679,
                1681
            ],
            [
                1681,
                1771
            ],
            [
                1771,
                1848
            ],
            [
                1849,
                1932
            ],
            [
                1932,
                2045
            ],
            [
                2045,
                2101
            ],
            [
                2101,
                2124
            ],
            [
                2124,
                2153
            ],
            [
                2153,
                2155
            ],
            [
                2155,
                2181
            ],
            [
                2182,
                2197
            ],
            [
                2198,
                2231
            ],
            [
                2231,
                2374
            ],
            [
                2380,
                2386
            ],
            [
                2387,
                2422
            ],
            [
                2422,
                2477
            ],
            [
                2478,
                2501
            ],
            [
                2508,
                2519
            ],
            [
                2519,
                2527
            ],
            [
                2528,
                2628
            ],
            [
                2631,
                2633
            ],
            [
                2641,
                2643
            ],
            [
                2644,
                2655
            ],
            [
                2656,
                2675
            ],
            [
                2681,
                2705
            ],
            [
                2705,
                2759
            ],
            [
                2759,
                2790
            ],
            [
                2790,
                2896
            ],
            [
                2897,
                2902
            ],
            [
                2908,
                2919
            ],
            [
                2920,
                2938
            ],
            [
                2938,
                3035
            ],
            [
                3035,
                3037
            ],
            [
                3037,
                3170
            ],
            [
                3176,
                3199
            ],
            [
                3202,
                3218
            ],
            [
                3219,
                3238
            ],
            [
                3247,
                3296
            ],
            [
                3296,
                3404
            ],
            [
                3405,
                3408
            ],
            [
                3409,
                3476
            ],
            [
                3476,
                3478
            ],
            [
                3478,
                3525
            ],
            [
                3526,
                3538
            ],
            [
                3539,
                3568
            ],
            [
                3568,
                3625
            ],
            [
                3626,
                3633
            ],
            [
                3645,
                3654
            ],
            [
                3666,
                3699
            ],
            [
                3702,
                3704
            ],
            [
                3705,
                3708
            ],
            [
                3709,
                3725
            ],
            [
                3725,
                3755
            ],
            [
                3756,
                3759
            ],
            [
                3760,
                3769
            ],
            [
                3771,
                3795
            ],
            [
                3796,
                3799
            ],
            [
                3800,
                3808
            ],
            [
                3808,
                3809
            ],
            [
                3810,
                3832
            ],
            [
                3833,
                3836
            ],
            [
                3837,
                3864
            ],
            [
                3864,
                3911
            ],
            [
                3914,
                3921
            ],
            [
                3922,
                3927
            ],
            [
                3932,
                3935
            ],
            [
                3936,
                3953
            ],
            [
                3954,
                3963
            ],
            [
                3963,
                3964
            ],
            [
                3965,
                4003
            ],
            [
                4003,
                4011
            ],
            [
                4012,
                4017
            ],
            [
                4018,
                4022
            ],
            [
                4022,
                4023
            ],
            [
                4024,
                4032
            ],
            [
                4033,
                4095
            ],
            [
                4095,
                4105
            ],
            [
                4106,
                4123
            ],
            [
                4123,
                4153
            ],
            [
                4159,
                4209
            ],
            [
                4209,
                4211
            ],
            [
                4217,
                4323
            ],
            [
                4324,
                4385
            ],
            [
                4391,
                4393
            ],
            [
                4394,
                4397
            ],
            [
                4398,
                4430
            ],
            [
                4440,
                4443
            ],
            [
                4444,
                4454
            ],
            [
                4454,
                4511
            ],
            [
                4512,
                4513
            ],
            [
                4518,
                4519
            ],
            [
                4526,
                4527
            ],
            [
                4538,
                4539
            ],
            [
                4540,
                4542
            ],
            [
                4610,
                4611
            ],
            [
                4617,
                4618
            ],
            [
                4619,
                4659
            ],
            [
                4660,
                4742
            ],
            [
                4743,
                4745
            ],
            [
                4751,
                4768
            ],
            [
                4768,
                4787
            ],
            [
                4788,
                4828
            ],
            [
                4829,
                4830
            ],
            [
                4835,
                4836
            ],
            [
                4837,
                4859
            ],
            [
                4860,
                4888
            ],
            [
                4889,
                4893
            ],
            [
                4894,
                4902
            ],
            [
                4903,
                4921
            ],
            [
                4921,
                4972
            ],
            [
                4972,
                4973
            ],
            [
                4974,
                4990
            ],
            [
                4991,
                4997
            ],
            [
                4997,
                4998
            ],
            [
                4999,
                5008
            ],
            [
                5009,
                5016
            ],
            [
                5018,
                5030
            ],
            [
                5032,
                5039
            ],
            [
                5041,
                5061
            ],
            [
                5063,
                5100
            ],
            [
                5100,
                5113
            ],
            [
                5115,
                5128
            ],
            [
                5130,
                5197
            ],
            [
                5197,
                5296
            ],
            [
                5307,
                5350
            ],
            [
                5351,
                5397
            ],
            [
                5398,
                5401
            ],
            [
                5402,
                5425
            ],
            [
                5426,
                5447
            ],
            [
                5448,
                5456
            ],
            [
                5456,
                5457
            ],
            [
                5458,
                5468
            ],
            [
                5473,
                5480
            ],
            [
                5481,
                5489
            ],
            [
                5490,
                5521
            ],
            [
                5521,
                5522
            ],
            [
                5523,
                5526
            ],
            [
                5527,
                5649
            ],
            [
                5649,
                5652
            ],
            [
                5652,
                5663
            ],
            [
                5664,
                5698
            ],
            [
                5699,
                5701
            ],
            [
                5712,
                5728
            ],
            [
                5729,
                5773
            ],
            [
                5773,
                5815
            ],
            [
                5820,
                5823
            ],
            [
                5824,
                5833
            ],
            [
                5834,
                5854
            ],
            [
                5854,
                5896
            ],
            [
                5896,
                5951
            ],
            [
                5964,
                5968
            ],
            [
                5977,
                5979
            ],
            [
                5979,
                6011
            ],
            [
                6017,
                6018
            ],
            [
                6018,
                6022
            ],
            [
                6022,
                6023
            ],
            [
                6027,
                6034
            ],
            [
                6039,
                6043
            ],
            [
                6044,
                6045
            ],
            [
                6046,
                6062
            ],
            [
                6063,
                6094
            ],
            [
                6094,
                6108
            ],
            [
                6108,
                6109
            ],
            [
                6110,
                6129
            ],
            [
                6137,
                6146
            ],
            [
                6146,
                6178
            ],
            [
                6186,
                6220
            ],
            [
                6225,
                6228
            ],
            [
                6229,
                6297
            ],
            [
                6303,
                6335
            ],
            [
                6336,
                6411
            ],
            [
                6412,
                6471
            ],
            [
                6471,
                6477
            ],
            [
                6486,
                6513
            ],
            [
                6515,
                6531
            ],
            [
                6543,
                6567
            ],
            [
                6568,
                6597
            ],
            [
                6598,
                6601
            ],
            [
                6602,
                6615
            ],
            [
                6622,
                6624
            ],
            [
                6624,
                6687
            ],
            [
                6688,
                6762
            ],
            [
                6762,
                6813
            ],
            [
                6824,
                6904
            ],
            [
                6905,
                6926
            ],
            [
                6927,
                6949
            ],
            [
                6950,
                6965
            ],
            [
                6965,
                7033
            ],
            [
                7039,
                7115
            ],
            [
                7115,
                7117
            ],
            [
                7123,
                7127
            ],
            [
                7138,
                7140
            ],
            [
                7141,
                7159
            ],
            [
                7159,
                7160
            ],
            [
                7161,
                7248
            ],
            [
                7253,
                7286
            ],
            [
                7286,
                7287
            ],
            [
                7294,
                7370
            ],
            [
                7370,
                7460
            ],
            [
                7461,
                7493
            ],
            [
                7493,
                7536
            ],
            [
                7536,
                7586
            ],
            [
                7586,
                7632
            ],
            [
                7632,
                7633
            ],
            [
                7633,
                7668
            ],
            [
                7669,
                7672
            ],
            [
                7673,
                7680
            ],
            [
                7680,
                7681
            ],
            [
                7685,
                7778
            ],
            [
                7778,
                7780
            ],
            [
                7780,
                7864
            ],
            [
                7865,
                7867
            ],
            [
                7868,
                7870
            ],
            [
                7871,
                7877
            ],
            [
                7877,
                7878
            ],
            [
                7884,
                7888
            ],
            [
                7889,
                7892
            ],
            [
                7893,
                7906
            ],
            [
                7910,
                7947
            ],
            [
                7947,
                7948
            ],
            [
                7949,
                7961
            ],
            [
                7962,
                7967
            ],
            [
                7968,
                7979
            ],
            [
                7980,
                7991
            ],
            [
                7991,
                8005
            ],
            [
                8006,
                8014
            ],
            [
                8015,
                8017
            ],
            [
                8031,
                8036
            ],
            [
                8037,
                8081
            ],
            [
                8081,
                8088
            ],
            [
                8089,
                8160
            ],
            [
                8161,
                8171
            ],
            [
                8172,
                8214
            ],
            [
                8215,
                8234
            ],
            [
                8234,
                8315
            ],
            [
                8315,
                8347
            ],
            [
                8352,
                8354
            ],
            [
                8355,
                8407
            ],
            [
                8408,
                8465
            ],
            [
                8472,
                8518
            ],
            [
                8519,
                8541
            ],
            [
                8542,
                8567
            ],
            [
                8574,
                8594
            ],
            [
                8603,
                8634
            ],
            [
                8638,
                8659
            ],
            [
                8659,
                8696
            ],
            [
                8696,
                8714
            ],
            [
                8715,
                8734
            ],
            [
                8734,
                8775
            ],
            [
                8775,
                8776
            ],
            [
                8777,
                8877
            ],
            [
                8878,
                8882
            ],
            [
                8883,
                8890
            ],
            [
                8891,
                8975
            ],
            [
                8975,
                8987
            ],
            [
                8993,
                9041
            ],
            [
                9041,
                9062
            ],
            [
                9063,
                9077
            ],
            [
                9088,
                9089
            ],
            [
                9089,
                9132
            ],
            [
                9132,
                9135
            ],
            [
                9135,
                9275
            ],
            [
                9280,
                9295
            ],
            [
                9295,
                9319
            ],
            [
                9323,
                9402
            ],
            [
                9403,
                9416
            ],
            [
                9417,
                9428
            ],
            [
                9429,
                9438
            ],
            [
                9439,
                9451
            ],
            [
                9457,
                9462
            ],
            [
                9466,
                9476
            ],
            [
                9476,
                9580
            ],
            [
                9581,
                9605
            ],
            [
                9605,
                9607
            ],
            [
                9607,
                9628
            ],
            [
                9628,
                9629
            ],
            [
                9630,
                9632
            ],
            [
                9633,
                9651
            ],
            [
                9651,
                9702
            ],
            [
                9703,
                9712
            ],
            [
                9713,
                9724
            ],
            [
                9724,
                9725
            ],
            [
                9726,
                9825
            ],
            [
                9826,
                9833
            ],
            [
                9833,
                9835
            ],
            [
                9847,
                9880
            ],
            [
                9880,
                9921
            ],
            [
                9921,
                9946
            ],
            [
                9955,
                10027
            ],
            [
                10029,
                10098
            ],
            [
                10099,
                10153
            ],
            [
                10153,
                10161
            ],
            [
                10162,
                10164
            ],
            [
                10170,
                10230
            ],
            [
                10230,
                10277
            ],
            [
                10277,
                10435
            ]
        ],
        "row_chars": [
            [
                0,
                184
            ],
            [
                184,
                325
            ],
            [
                325,
                379
            ],
            [
                379,
                379
            ],
            [
                379,
                508
            ],
            [
                508,
                572
            ],
            [
                572,
                608
            ],
            [
                608,
                613
            ],
            [
                613,
                622
            ],
            [
                622,
                704
            ],
            [
                704,
                724
            ],
            [
                724,
                735
            ],
            [
                735,
                854
            ],
            [
                854,
                931
            ],
            [
                931,
                950
            ],
            [
                950,
                1106
            ],
            [
                1106,
                1139
            ],
            [
                1139,
                1158
            ],
            [
                1158,
                1180
            ],
            [
                1180,
                1238
            ],
            [
                1238,
                1343
            ],
            [
                1343,
                1381
            ],
            [
                1381,
                1452
            ],
            [
                1452,
                1608
            ],
            [
                1608,
                1681
            ],
            [
                1681,
                1771
            ],
            [
                1771,
                1849
            ],
            [
                1849,
                1932
            ],
            [
                1932,
                2045
            ],
            [
                2045,
                2101
            ],
            [
                2101,
                2155
            ],
            [
                2155,
                2231
            ],
            [
                2231,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2422
            ],
            [
                2422,
                2519
            ],
            [
                2519,
                2631
            ],
            [
                2631,
                2631
            ],
            [
                2631,
                2643
            ],
            [
                2643,
                2643
            ],
            [
                2643,
                2643
            ],
            [
                2643,
                2643
            ],
            [
                2643,
                2705
            ],
            [
                2705,
                2759
            ],
            [
                2759,
                2938
            ],
            [
                2938,
                3037
            ],
            [
                3037,
                3202
            ],
            [
                3202,
                3296
            ],
            [
                3296,
                3478
            ],
            [
                3478,
                3568
            ],
            [
                3568,
                4003
            ],
            [
                4003,
                4123
            ],
            [
                4123,
                4211
            ],
            [
                4211,
                4324
            ],
            [
                4324,
                4324
            ],
            [
                4324,
                4324
            ],
            [
                4324,
                4324
            ],
            [
                4324,
                4454
            ],
            [
                4454,
                4619
            ],
            [
                4619,
                4619
            ],
            [
                4619,
                4619
            ],
            [
                4619,
                4619
            ],
            [
                4619,
                4619
            ],
            [
                4619,
                4837
            ],
            [
                4837,
                4837
            ],
            [
                4837,
                4921
            ],
            [
                4921,
                5100
            ],
            [
                5100,
                5197
            ],
            [
                5197,
                5197
            ],
            [
                5197,
                5351
            ],
            [
                5351,
                5521
            ],
            [
                5521,
                5652
            ],
            [
                5652,
                5773
            ],
            [
                5773,
                5854
            ],
            [
                5854,
                5854
            ],
            [
                5854,
                5979
            ],
            [
                5979,
                5979
            ],
            [
                5979,
                6094
            ],
            [
                6094,
                6297
            ],
            [
                6297,
                6471
            ],
            [
                6471,
                6624
            ],
            [
                6624,
                6762
            ],
            [
                6762,
                6965
            ],
            [
                6965,
                7117
            ],
            [
                7117,
                7161
            ],
            [
                7161,
                7286
            ],
            [
                7286,
                7370
            ],
            [
                7370,
                7493
            ],
            [
                7493,
                7536
            ],
            [
                7536,
                7536
            ],
            [
                7536,
                7632
            ],
            [
                7632,
                7632
            ],
            [
                7632,
                7780
            ],
            [
                7780,
                7991
            ],
            [
                7991,
                7991
            ],
            [
                7991,
                7991
            ],
            [
                7991,
                8081
            ],
            [
                8081,
                8234
            ],
            [
                8234,
                8315
            ],
            [
                8315,
                8465
            ],
            [
                8465,
                8519
            ],
            [
                8519,
                8659
            ],
            [
                8659,
                8734
            ],
            [
                8734,
                8975
            ],
            [
                8975,
                9135
            ],
            [
                9135,
                9295
            ],
            [
                9295,
                9476
            ],
            [
                9476,
                9607
            ],
            [
                9607,
                9835
            ],
            [
                9835,
                9921
            ],
            [
                9921,
                10099
            ],
            [
                10099,
                10099
            ],
            [
                10099,
                10153
            ],
            [
                10153,
                10230
            ],
            [
                10230,
                10277
            ],
            [
                10277,
                10435
            ]
        ]
    }
}