{
    "original": {
        "text": "Cuff's fight with Dobbin, and the unexpected issue of that contest, will long be remembered by every man who was educated at Dr. Swishtail's famous school. The latter Youth (who used to be called Heigh-ho Dobbin, Gee-ho Dobbin, and by many other names indicative of puerile contempt) was the quietest, the clumsiest, and, as it seemed, the dullest of all Dr. Swishtail's young gentlemen. His parent was a grocer in the city: and it was bruited abroad that he was admitted into Dr. Swishtail's academy upon what are called \"mutual principles\"--that is to say, the expenses of his board and schooling were defrayed by his father in goods, not money; and he stood there--most at the bottom of the school--in his scraggy corduroys and jacket, through the seams of which his great big bones were bursting--as the representative of so many pounds of tea, candles, sugar, mottled-soap, plums (of which a very mild proportion was supplied for the puddings of the establishment), and other commodities. A dreadful day it was for young Dobbin when one of the youngsters of the school, having run into the town upon a poaching excursion for hardbake and polonies, espied the cart of Dobbin & Rudge, Grocers and Oilmen, Thames Street, London, at the Doctor's door, discharging a cargo of the wares in which the firm dealt.\nYoung Dobbin had no peace after that. The jokes were frightful, and merciless against him. \"Hullo, Dobbin,\" one wag would say, \"here's good news in the paper. Sugars is ris', my boy.\" Another would set a sum--\"If a pound of mutton-candles cost sevenpence-halfpenny, how much must Dobbin cost?\" and a roar would follow from all the circle of young knaves, usher and all, who rightly considered that the selling of goods by retail is a shameful and infamous practice, meriting the contempt and scorn of all real gentlemen.\n\"Your father's only a merchant, Osborne,\" Dobbin said in private to the little boy who had brought down the storm upon him. At which the latter replied haughtily, \"My father's a gentleman, and keeps his carriage\"; and Mr. William Dobbin retreated to a remote outhouse in the playground, where he passed a half-holiday in the bitterest sadness and woe. Who amongst us is there that does not recollect similar hours of bitter, bitter childish grief? Who feels injustice; who shrinks before a slight; who has a sense of wrong so acute, and so glowing a gratitude for kindness, as a generous boy? and how many of those gentle souls do you degrade, estrange, torture, for the sake of a little loose arithmetic, and miserable dog-latin?\nNow, William Dobbin, from an incapacity to acquire the rudiments of the above language, as they are propounded in that wonderful book the Eton Latin Grammar, was compelled to remain among the very last of Doctor Swishtail's scholars, and was \"taken down\" continually by little fellows with pink faces and pinafores when he marched up with the lower form, a giant amongst them, with his downcast, stupefied look, his dog's-eared primer, and his tight corduroys. High and low, all made fun of him. They sewed up those corduroys, tight as they were. They cut his bed-strings. They upset buckets and benches, so that he might break his shins over them, which he never failed to do. They sent him parcels, which, when opened, were found to contain the paternal soap and candles. There was no little fellow but had his jeer and joke at Dobbin; and he bore everything quite patiently, and was entirely dumb and miserable.\nCuff, on the contrary, was the great chief and dandy of the Swishtail Seminary. He smuggled wine in. He fought the town-boys. Ponies used to come for him to ride home on Saturdays. He had his top-boots in his room, in which he used to hunt in the holidays. He had a gold repeater: and took snuff like the Doctor. He had been to the Opera, and knew the merits of the principal actors, preferring Mr. Kean to Mr. Kemble. He could knock you off forty Latin verses in an hour. He could make French poetry. What else didn't he know, or couldn't he do? They said even the Doctor himself was afraid of him.\nCuff, the unquestioned king of the school, ruled over his subjects, and bullied them, with splendid superiority. This one blacked his shoes: that toasted his bread, others would fag out, and give him balls at cricket during whole summer afternoons. \"Figs\" was the fellow whom he despised most, and with whom, though always abusing him, and sneering at him, he scarcely ever condescended to hold personal communication.\nOne day in private, the two young gentlemen had had a difference. Figs, alone in the schoolroom, was blundering over a home letter; when Cuff, entering, bade him go upon some message, of which tarts were probably the subject.\n\"I can't,\" says Dobbin; \"I want to finish my letter.\"\n\"You CAN'T?\" says Mr. Cuff, laying hold of that document (in which many words were scratched out, many were mis-spelt, on which had been spent I don't know how much thought, and labour, and tears; for the poor fellow was writing to his mother, who was fond of him, although she was a grocer's wife, and lived in a back parlour in Thames Street). \"You CAN'T?\" says Mr. Cuff: \"I should like to know why, pray? Can't you write to old Mother Figs to-morrow?\"\n\"Don't call names,\" Dobbin said, getting off the bench very nervous.\n\"Well, sir, will you go?\" crowed the cock of the school.\n\"Put down the letter,\" Dobbin replied; \"no gentleman readth letterth.\"\n\"Well, NOW will you go?\" says the other.\n\"No, I won't. Don't strike, or I'll THMASH you,\" roars out Dobbin, springing to a leaden inkstand, and looking so wicked, that Mr. Cuff paused, turned down his coat sleeves again, put his hands into his pockets, and walked away with a sneer. But he never meddled personally with the grocer's boy after that; though we must do him the justice to say he always spoke of Mr. Dobbin with contempt behind his back.\nSome time after this interview, it happened that Mr. Cuff, on a sunshiny afternoon, was in the neighbourhood of poor William Dobbin, who was lying under a tree in the playground, spelling over a favourite copy of the Arabian Nights which he had apart from the rest of the school, who were pursuing their various sports--quite lonely, and almost happy. If people would but leave children to themselves; if teachers would cease to bully them; if parents would not insist upon directing their thoughts, and dominating their feelings--those feelings and thoughts which are a mystery to all (for how much do you and I know of each other, of our children, of our fathers, of our neighbour, and how far more beautiful and sacred are the thoughts of the poor lad or girl whom you govern likely to be, than those of the dull and world-corrupted person who rules him?)--if, I say, parents and masters would leave their children alone a little more, small harm would accrue, although a less quantity of as in praesenti might be acquired.\nWell, William Dobbin had for once forgotten the world, and was away with Sindbad the Sailor in the Valley of Diamonds, or with Prince Ahmed and the Fairy Peribanou in that delightful cavern where the Prince found her, and whither we should all like to make a tour; when shrill cries, as of a little fellow weeping, woke up his pleasant reverie; and looking up, he saw Cuff before him, belabouring a little boy.\nIt was the lad who had peached upon him about the grocer's cart; but he bore little malice, not at least towards the young and small. \"How dare you, sir, break the bottle?\" says Cuff to the little urchin, swinging a yellow cricket-stump over him.\nThe boy had been instructed to get over the playground wall (at a selected spot where the broken glass had been removed from the top, and niches made convenient in the brick); to run a quarter of a mile; to purchase a pint of rum-shrub on credit; to brave all the Doctor's outlying spies, and to clamber back into the playground again; during the performance of which feat, his foot had slipt, and the bottle was broken, and the shrub had been spilt, and his pantaloons had been damaged, and he appeared before his employer a perfectly guilty and trembling, though harmless, wretch.\n\"How dare you, sir, break it?\" says Cuff; \"you blundering little thief. You drank the shrub, and now you pretend to have broken the bottle. Hold out your hand, sir.\"\nDown came the stump with a great heavy thump on the child's hand. A moan followed. Dobbin looked up. The Fairy Peribanou had fled into the inmost cavern with Prince Ahmed: the Roc had whisked away Sindbad the Sailor out of the Valley of Diamonds out of sight, far into the clouds: and there was everyday life before honest William; and a big boy beating a little one without cause.\n\"Hold out your other hand, sir,\" roars Cuff to his little schoolfellow, whose face was distorted with pain. Dobbin quivered, and gathered himself up in his narrow old clothes.\n\"Take that, you little devil!\" cried Mr. Cuff, and down came the wicket again on the child's hand.--Don't be horrified, ladies, every boy at a public school has done it. Your children will so do and be done by, in all probability. Down came the wicket again; and Dobbin started up.\nI can't tell what his motive was. Torture in a public school is as much licensed as the knout in Russia. It would be ungentlemanlike (in a manner) to resist it. Perhaps Dobbin's foolish soul revolted against that exercise of tyranny; or perhaps he had a hankering feeling of revenge in his mind, and longed to measure himself against that splendid bully and tyrant, who had all the glory, pride, pomp, circumstance, banners flying, drums beating, guards saluting, in the place. Whatever may have been his incentive, however, up he sprang, and screamed out, \"Hold off, Cuff; don't bully that child any more; or I'll--\"\n\"Or you'll what?\" Cuff asked in amazement at this interruption. \"Hold out your hand, you little beast.\"\n\"I'll give you the worst thrashing you ever had in your life,\" Dobbin said, in reply to the first part of Cuff's sentence; and little Osborne, gasping and in tears, looked up with wonder and incredulity at seeing this amazing champion put up suddenly to defend him: while Cuff's astonishment was scarcely less. Fancy our late monarch George III when he heard of the revolt of the North American colonies: fancy brazen Goliath when little David stepped forward and claimed a meeting; and you have the feelings of Mr. Reginald Cuff when this rencontre was proposed to him.\n\"After school,\" says he, of course; after a pause and a look, as much as to say, \"Make your will, and communicate your last wishes to your friends between this time and that.\"\n\"As you please,\" Dobbin said. \"You must be my bottle holder, Osborne.\"\n\"Well, if you like,\" little Osborne replied; for you see his papa kept a carriage, and he was rather ashamed of his champion.\nYes, when the hour of battle came, he was almost ashamed to say, \"Go it, Figs\"; and not a single other boy in the place uttered that cry for the first two or three rounds of this famous combat; at the commencement of which the scientific Cuff, with a contemptuous smile on his face, and as light and as gay as if he was at a ball, planted his blows upon his adversary, and floored that unlucky champion three times running. At each fall there was a cheer; and everybody was anxious to have the honour of offering the conqueror a knee.\n\"What a licking I shall get when it's over,\" young Osborne thought, picking up his man. \"You'd best give in,\" he said to Dobbin; \"it's only a thrashing, Figs, and you know I'm used to it.\" But Figs, all whose limbs were in a quiver, and whose nostrils were breathing rage, put his little bottle-holder aside, and went in for a fourth time.\nAs he did not in the least know how to parry the blows that were aimed at himself, and Cuff had begun the attack on the three preceding occasions, without ever allowing his enemy to strike, Figs now determined that he would commence the engagement by a charge on his own part; and accordingly, being a left-handed man, brought that arm into action, and hit out a couple of times with all his might--once at Mr. Cuff's left eye, and once on his beautiful Roman nose.\nCuff went down this time, to the astonishment of the assembly. \"Well hit, by Jove,\" says little Osborne, with the air of a connoisseur, clapping his man on the back. \"Give it him with the left, Figs my boy.\"\nFigs's left made terrific play during all the rest of the combat. Cuff went down every time. At the sixth round, there were almost as many fellows shouting out, \"Go it, Figs,\" as there were youths exclaiming, \"Go it, Cuff.\" At the twelfth round the latter champion was all abroad, as the saying is, and had lost all presence of mind and power of attack or defence. Figs, on the contrary, was as calm as a quaker. His face being quite pale, his eyes shining open, and a great cut on his underlip bleeding profusely, gave this young fellow a fierce and ghastly air, which perhaps struck terror into many spectators. Nevertheless, his intrepid adversary prepared to close for the thirteenth time.\nIf I had the pen of a Napier, or a Bell's Life, I should like to describe this combat properly. It was the last charge of the Guard--(that is, it would have been, only Waterloo had not yet taken place)--it was Ney's column breasting the hill of La Haye Sainte, bristling with ten thousand bayonets, and crowned with twenty eagles--it was the shout of the beef-eating British, as leaping down the hill they rushed to hug the enemy in the savage arms of battle--in other words, Cuff coming up full of pluck, but quite reeling and groggy, the Fig-merchant put in his left as usual on his adversary's nose, and sent him down for the last time.\n\"I think that will do for him,\" Figs said, as his opponent dropped as neatly on the green as I have seen Jack Spot's ball plump into the pocket at billiards; and the fact is, when time was called, Mr. Reginald Cuff was not able, or did not choose, to stand up again.\nAnd now all the boys set up such a shout for Figs as would have made you think he had been their darling champion through the whole battle; and as absolutely brought Dr. Swishtail out of his study, curious to know the cause of the uproar. He threatened to flog Figs violently, of course; but Cuff, who had come to himself by this time, and was washing his wounds, stood up and said, \"It's my fault, sir--not Figs'--not Dobbin's. I was bullying a little boy; and he served me right.\" By which magnanimous speech he not only saved his conqueror a whipping, but got back all his ascendancy over the boys which his defeat had nearly cost him.\nYoung Osborne wrote home to his parents an account of the transaction.\nSugarcane House, Richmond, March, 18--\nDEAR MAMA,--I hope you are quite well. I should be much obliged to you to send me a cake and five shillings. There has been a fight here between Cuff & Dobbin. Cuff, you know, was the Cock of the School. They fought thirteen rounds, and Dobbin Licked. So Cuff is now Only Second Cock. The fight was about me. Cuff was licking me for breaking a bottle of milk, and Figs wouldn't stand it. We call him Figs because his father is a Grocer--Figs & Rudge, Thames St., City--I think as he fought for me you ought to buy your Tea & Sugar at his father's. Cuff goes home every Saturday, but can't this, because he has 2 Black Eyes. He has a white Pony to come and fetch him, and a groom in livery on a bay mare. I wish my Papa would let me have a Pony, and I am\nYour dutiful Son, GEORGE SEDLEY OSBORNE\nP.S.--Give my love to little Emmy. I am cutting her out a Coach in cardboard. Please not a seed-cake, but a plum-cake.\nIn consequence of Dobbin's victory, his character rose prodigiously in the estimation of all his schoolfellows, and the name of Figs, which had been a byword of reproach, became as respectable and popular a nickname as any other in use in the school. \"After all, it's not his fault that his father's a grocer,\" George Osborne said, who, though a little chap, had a very high popularity among the Swishtail youth; and his opinion was received with great applause. It was voted low to sneer at Dobbin about this accident of birth. \"Old Figs\" grew to be a name of kindness and endearment; and the sneak of an usher jeered at him no longer.\nAnd Dobbin's spirit rose with his altered circumstances. He made wonderful advances in scholastic learning. The superb Cuff himself, at whose condescension Dobbin could only blush and wonder, helped him on with his Latin verses; \"coached\" him in play-hours: carried him triumphantly out of the little-boy class into the middle-sized form; and even there got a fair place for him. It was discovered, that although dull at classical learning, at mathematics he was uncommonly quick. To the contentment of all he passed third in algebra, and got a French prize-book at the public Midsummer examination. You should have seen his mother's face when Telemaque (that delicious romance) was presented to him by the Doctor in the face of the whole school and the parents and company, with an inscription to Gulielmo Dobbin. All the boys clapped hands in token of applause and sympathy. His blushes, his stumbles, his awkwardness, and the number of feet which he crushed as he went back to his place, who shall describe or calculate? Old Dobbin, his father, who now respected him for the first time, gave him two guineas publicly; most of which he spent in a general tuck-out for the school: and he came back in a tail-coat after the holidays.\nDobbin was much too modest a young fellow to suppose that this happy change in all his circumstances arose from his own generous and manly disposition: he chose, from some perverseness, to attribute his good fortune to the sole agency and benevolence of little George Osborne, to whom henceforth he vowed such a love and affection as is only felt by children--such an affection, as we read in the charming fairy-book, uncouth Orson had for splendid young Valentine his conqueror. He flung himself down at little Osborne's feet, and loved him. Even before they were acquainted, he had admired Osborne in secret. Now he was his valet, his dog, his man Friday. He believed Osborne to be the possessor of every perfection, to be the handsomest, the bravest, the most active, the cleverest, the most generous of created boys. He shared his money with him: bought him uncountable presents of knives, pencil-cases, gold seals, toffee, Little Warblers, and romantic books, with large coloured pictures of knights and robbers, in many of which latter you might read inscriptions to George Sedley Osborne, Esquire, from his attached friend William Dobbin--the which tokens of homage George received very graciously, as became his superior merit.\nSo that Lieutenant Osborne, when coming to Russell Square on the day of the Vauxhall party, said to the ladies, \"Mrs. Sedley, Ma'am, I hope you have room; I've asked Dobbin of ours to come and dine here, and go with us to Vauxhall. He's almost as modest as Jos.\"\n\"Modesty! pooh,\" said the stout gentleman, casting a vainqueur look at Miss Sharp.\n\"He is--but you are incomparably more graceful, Sedley,\" Osborne added, laughing. \"I met him at the Bedford, when I went to look for you; and I told him that Miss Amelia was come home, and that we were all bent on going out for a night's pleasuring; and that Mrs. Sedley had forgiven his breaking the punch-bowl at the child's party. Don't you remember the catastrophe, Ma'am, seven years ago?\"\n\"Over Mrs. Flamingo's crimson silk gown,\" said good-natured Mrs. Sedley. \"What a gawky it was! And his sisters are not much more graceful. Lady Dobbin was at Highbury last night with three of them. Such figures! my dears.\"\n\"The Alderman's very rich, isn't he?\" Osborne said archly. \"Don't you think one of the daughters would be a good spec for me, Ma'am?\"\n\"You foolish creature! Who would take you, I should like to know, with your yellow face?\"\n\"Mine a yellow face? Stop till you see Dobbin. Why, he had the yellow fever three times; twice at Nassau, and once at St. Kitts.\"\n\"Well, well; yours is quite yellow enough for us. Isn't it, Emmy?\" Mrs. Sedley said: at which speech Miss Amelia only made a smile and a blush; and looking at Mr. George Osborne's pale interesting countenance, and those beautiful black, curling, shining whiskers, which the young gentleman himself regarded with no ordinary complacency, she thought in her little heart that in His Majesty's army, or in the wide world, there never was such a face or such a hero. \"I don't care about Captain Dobbin's complexion,\" she said, \"or about his awkwardness. I shall always like him, I know,\" her little reason being, that he was the friend and champion of George.\n\"There's not a finer fellow in the service,\" Osborne said, \"nor a better officer, though he is not an Adonis, certainly.\" And he looked towards the glass himself with much naivete; and in so doing, caught Miss Sharp's eye fixed keenly upon him, at which he blushed a little, and Rebecca thought in her heart, \"Ah, mon beau Monsieur! I think I have YOUR gauge\"--the little artful minx!\nThat evening, when Amelia came tripping into the drawing-room in a white muslin frock, prepared for conquest at Vauxhall, singing like a lark, and as fresh as a rose--a very tall ungainly gentleman, with large hands and feet, and large ears, set off by a closely cropped head of black hair, and in the hideous military frogged coat and cocked hat of those times, advanced to meet her, and made her one of the clumsiest bows that was ever performed by a mortal.\nThis was no other than Captain William Dobbin, of His Majesty's Regiment of Foot, returned from yellow fever, in the West Indies, to which the fortune of the service had ordered his regiment, whilst so many of his gallant comrades were reaping glory in the Peninsula.\nHe had arrived with a knock so very timid and quiet that it was inaudible to the ladies upstairs: otherwise, you may be sure Miss Amelia would never have been so bold as to come singing into the room. As it was, the sweet fresh little voice went right into the Captain's heart, and nestled there. When she held out her hand for him to shake, before he enveloped it in his own, he paused, and thought--\"Well, is it possible--are you the little maid I remember in the pink frock, such a short time ago--the night I upset the punch-bowl, just after I was gazetted? Are you the little girl that George Osborne said should marry him? What a blooming young creature you seem, and what a prize the rogue has got!\" All this he thought, before he took Amelia's hand into his own, and as he let his cocked hat fall.\nHis history since he left school, until the very moment when we have the pleasure of meeting him again, although not fully narrated, has yet, I think, been indicated sufficiently for an ingenious reader by the conversation in the last page. Dobbin, the despised grocer, was Alderman Dobbin--Alderman Dobbin was Colonel of the City Light Horse, then burning with military ardour to resist the French Invasion. Colonel Dobbin's corps, in which old Mr. Osborne himself was but an indifferent corporal, had been reviewed by the Sovereign and the Duke of York; and the colonel and alderman had been knighted. His son had entered the army: and young Osborne followed presently in the same regiment. They had served in the West Indies and in Canada. Their regiment had just come home, and the attachment of Dobbin to George Osborne was as warm and generous now as it had been when the two were schoolboys.\nSo these worthy people sat down to dinner presently. They talked about war and glory, and Boney and Lord Wellington, and the last Gazette. In those famous days every gazette had a victory in it, and the two gallant young men longed to see their own names in the glorious list, and cursed their unlucky fate to belong to a regiment which had been away from the chances of honour. Miss Sharp kindled with this exciting talk, but Miss Sedley trembled and grew quite faint as she heard it. Mr. Jos told several of his tiger-hunting stories, finished the one about Miss Cutler and Lance the surgeon; helped Rebecca to everything on the table, and himself gobbled and drank a great deal.\nHe sprang to open the door for the ladies, when they retired, with the most killing grace--and coming back to the table, filled himself bumper after bumper of claret, which he swallowed with nervous rapidity.\n\"He's priming himself,\" Osborne whispered to Dobbin, and at length the hour and the carriage arrived for Vauxhall.",
        "paragraph_chars": [
            [
                0,
                1311
            ],
            [
                1311,
                1832
            ],
            [
                1832,
                2563
            ],
            [
                2563,
                3478
            ],
            [
                3478,
                4078
            ],
            [
                4078,
                4497
            ],
            [
                4497,
                4723
            ],
            [
                4723,
                4777
            ],
            [
                4777,
                5232
            ],
            [
                5232,
                5301
            ],
            [
                5301,
                5358
            ],
            [
                5358,
                5429
            ],
            [
                5429,
                5470
            ],
            [
                5470,
                5880
            ],
            [
                5880,
                6907
            ],
            [
                6907,
                7318
            ],
            [
                7318,
                7565
            ],
            [
                7565,
                8148
            ],
            [
                8148,
                8314
            ],
            [
                8314,
                8696
            ],
            [
                8696,
                8872
            ],
            [
                8872,
                9154
            ],
            [
                9154,
                9772
            ],
            [
                9772,
                9876
            ],
            [
                9876,
                10447
            ],
            [
                10447,
                10623
            ],
            [
                10623,
                10694
            ],
            [
                10694,
                10820
            ],
            [
                10820,
                11355
            ],
            [
                11355,
                11695
            ],
            [
                11695,
                12161
            ],
            [
                12161,
                12369
            ],
            [
                12369,
                13063
            ],
            [
                13063,
                13703
            ],
            [
                13703,
                13970
            ],
            [
                13970,
                14609
            ],
            [
                14609,
                14680
            ],
            [
                14680,
                14719
            ],
            [
                14719,
                15473
            ],
            [
                15473,
                15513
            ],
            [
                15513,
                15632
            ],
            [
                15632,
                16269
            ],
            [
                16269,
                17503
            ],
            [
                17503,
                18739
            ],
            [
                18739,
                19002
            ],
            [
                19002,
                19085
            ],
            [
                19085,
                19480
            ],
            [
                19480,
                19703
            ],
            [
                19703,
                19837
            ],
            [
                19837,
                19927
            ],
            [
                19927,
                20057
            ],
            [
                20057,
                20713
            ],
            [
                20713,
                21098
            ],
            [
                21098,
                21559
            ],
            [
                21559,
                21827
            ],
            [
                21827,
                22633
            ],
            [
                22633,
                23532
            ],
            [
                23532,
                24214
            ],
            [
                24214,
                24423
            ],
            [
                24423,
                24537
            ]
        ],
        "segment_chars": [
            [
                0,
                156
            ],
            [
                156,
                388
            ],
            [
                388,
                994
            ],
            [
                994,
                1311
            ],
            [
                1311,
                1349
            ],
            [
                1349,
                1402
            ],
            [
                1402,
                1470
            ],
            [
                1470,
                1495
            ],
            [
                1495,
                1605
            ],
            [
                1605,
                1832
            ],
            [
                1832,
                1956
            ],
            [
                1956,
                2184
            ],
            [
                2184,
                2280
            ],
            [
                2280,
                2425
            ],
            [
                2425,
                2563
            ],
            [
                2563,
                3024
            ],
            [
                3024,
                3059
            ],
            [
                3059,
                3110
            ],
            [
                3110,
                3136
            ],
            [
                3136,
                3241
            ],
            [
                3241,
                3337
            ],
            [
                3337,
                3478
            ],
            [
                3478,
                3558
            ],
            [
                3558,
                3579
            ],
            [
                3579,
                3604
            ],
            [
                3604,
                3659
            ],
            [
                3659,
                3735
            ],
            [
                3735,
                3791
            ],
            [
                3791,
                3897
            ],
            [
                3897,
                3951
            ],
            [
                3951,
                3980
            ],
            [
                3980,
                4025
            ],
            [
                4025,
                4078
            ],
            [
                4078,
                4191
            ],
            [
                4191,
                4327
            ],
            [
                4327,
                4497
            ],
            [
                4497,
                4563
            ],
            [
                4563,
                4723
            ],
            [
                4723,
                4777
            ],
            [
                4777,
                4790
            ],
            [
                4790,
                5123
            ],
            [
                5123,
                5136
            ],
            [
                5136,
                5185
            ],
            [
                5185,
                5232
            ],
            [
                5232,
                5301
            ],
            [
                5301,
                5327
            ],
            [
                5327,
                5358
            ],
            [
                5358,
                5429
            ],
            [
                5429,
                5454
            ],
            [
                5454,
                5470
            ],
            [
                5470,
                5484
            ],
            [
                5484,
                5712
            ],
            [
                5712,
                5880
            ],
            [
                5880,
                6232
            ],
            [
                6232,
                6738
            ],
            [
                6738,
                6907
            ],
            [
                6907,
                7318
            ],
            [
                7318,
                7452
            ],
            [
                7452,
                7491
            ],
            [
                7491,
                7565
            ],
            [
                7565,
                8148
            ],
            [
                8148,
                8179
            ],
            [
                8179,
                8220
            ],
            [
                8220,
                8288
            ],
            [
                8288,
                8314
            ],
            [
                8314,
                8380
            ],
            [
                8380,
                8397
            ],
            [
                8397,
                8415
            ],
            [
                8415,
                8696
            ],
            [
                8696,
                8804
            ],
            [
                8804,
                8872
            ],
            [
                8872,
                8903
            ],
            [
                8903,
                9042
            ],
            [
                9042,
                9103
            ],
            [
                9103,
                9154
            ],
            [
                9154,
                9188
            ],
            [
                9188,
                9259
            ],
            [
                9259,
                9315
            ],
            [
                9315,
                9632
            ],
            [
                9632,
                9772
            ],
            [
                9772,
                9790
            ],
            [
                9790,
                9836
            ],
            [
                9836,
                9876
            ],
            [
                9876,
                10187
            ],
            [
                10187,
                10447
            ],
            [
                10447,
                10623
            ],
            [
                10623,
                10653
            ],
            [
                10653,
                10694
            ],
            [
                10694,
                10820
            ],
            [
                10820,
                11244
            ],
            [
                11244,
                11355
            ],
            [
                11355,
                11443
            ],
            [
                11443,
                11544
            ],
            [
                11544,
                11695
            ],
            [
                11695,
                12161
            ],
            [
                12161,
                12224
            ],
            [
                12224,
                12327
            ],
            [
                12327,
                12369
            ],
            [
                12369,
                12435
            ],
            [
                12435,
                12462
            ],
            [
                12462,
                12593
            ],
            [
                12593,
                12734
            ],
            [
                12734,
                12782
            ],
            [
                12782,
                12983
            ],
            [
                12983,
                13063
            ],
            [
                13063,
                13159
            ],
            [
                13159,
                13703
            ],
            [
                13703,
                13970
            ],
            [
                13970,
                14209
            ],
            [
                14209,
                14399
            ],
            [
                14399,
                14453
            ],
            [
                14453,
                14609
            ],
            [
                14609,
                14680
            ],
            [
                14680,
                14719
            ],
            [
                14719,
                14758
            ],
            [
                14758,
                14828
            ],
            [
                14828,
                14879
            ],
            [
                14879,
                14923
            ],
            [
                14923,
                14971
            ],
            [
                14971,
                15004
            ],
            [
                15004,
                15028
            ],
            [
                15028,
                15107
            ],
            [
                15107,
                15267
            ],
            [
                15267,
                15343
            ],
            [
                15343,
                15423
            ],
            [
                15423,
                15473
            ],
            [
                15473,
                15513
            ],
            [
                15513,
                15548
            ],
            [
                15548,
                15591
            ],
            [
                15591,
                15632
            ],
            [
                15632,
                15883
            ],
            [
                15883,
                16095
            ],
            [
                16095,
                16161
            ],
            [
                16161,
                16269
            ],
            [
                16269,
                16326
            ],
            [
                16326,
                16377
            ],
            [
                16377,
                16649
            ],
            [
                16649,
                16750
            ],
            [
                16750,
                16869
            ],
            [
                16869,
                17084
            ],
            [
                17084,
                17146
            ],
            [
                17146,
                17293
            ],
            [
                17293,
                17503
            ],
            [
                17503,
                17983
            ],
            [
                17983,
                18046
            ],
            [
                18046,
                18114
            ],
            [
                18114,
                18161
            ],
            [
                18161,
                18324
            ],
            [
                18324,
                18739
            ],
            [
                18739,
                18971
            ],
            [
                18971,
                19002
            ],
            [
                19002,
                19012
            ],
            [
                19012,
                19085
            ],
            [
                19085,
                19167
            ],
            [
                19167,
                19419
            ],
            [
                19419,
                19480
            ],
            [
                19480,
                19553
            ],
            [
                19553,
                19575
            ],
            [
                19575,
                19619
            ],
            [
                19619,
                19678
            ],
            [
                19678,
                19692
            ],
            [
                19692,
                19703
            ],
            [
                19703,
                19741
            ],
            [
                19741,
                19762
            ],
            [
                19762,
                19837
            ],
            [
                19837,
                19860
            ],
            [
                19860,
                19927
            ],
            [
                19927,
                19948
            ],
            [
                19948,
                19974
            ],
            [
                19974,
                20057
            ],
            [
                20057,
                20107
            ],
            [
                20107,
                20124
            ],
            [
                20124,
                20520
            ],
            [
                20520,
                20607
            ],
            [
                20607,
                20713
            ],
            [
                20713,
                20835
            ],
            [
                20835,
                21046
            ],
            [
                21046,
                21098
            ],
            [
                21098,
                21559
            ],
            [
                21559,
                21827
            ],
            [
                21827,
                22028
            ],
            [
                22028,
                22124
            ],
            [
                22124,
                22389
            ],
            [
                22389,
                22456
            ],
            [
                22456,
                22534
            ],
            [
                22534,
                22633
            ],
            [
                22633,
                22874
            ],
            [
                22874,
                23042
            ],
            [
                23042,
                23237
            ],
            [
                23237,
                23326
            ],
            [
                23326,
                23376
            ],
            [
                23376,
                23532
            ],
            [
                23532,
                23585
            ],
            [
                23585,
                23671
            ],
            [
                23671,
                23911
            ],
            [
                23911,
                24018
            ],
            [
                24018,
                24214
            ],
            [
                24214,
                24423
            ],
            [
                24423,
                24537
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                66,
                155
            ],
            [
                173,
                217
            ],
            [
                220,
                231
            ],
            [
                240,
                245
            ],
            [
                274,
                282
            ],
            [
                246,
                251
            ],
            [
                282,
                301
            ],
            [
                306,
                321
            ],
            [
                325,
                350
            ],
            [
                355,
                370
            ],
            [
                386,
                388
            ],
            [
                616,
                626
            ],
            [
                399,
                411
            ],
            [
                423,
                435
            ],
            [
                451,
                455
            ],
            [
                575,
                603
            ],
            [
                931,
                934
            ],
            [
                627,
                646
            ],
            [
                479,
                480
            ],
            [
                652,
                666
            ],
            [
                702,
                738
            ],
            [
                766,
                775
            ],
            [
                780,
                785
            ],
            [
                791,
                799
            ],
            [
                739,
                756
            ],
            [
                557,
                558
            ],
            [
                801,
                864
            ],
            [
                971,
                994
            ],
            [
                994,
                1048
            ],
            [
                1153,
                1207
            ],
            [
                1231,
                1252
            ],
            [
                1280,
                1285
            ],
            [
                1309,
                1311
            ],
            [
                1311,
                1349
            ],
            [
                1349,
                1363
            ],
            [
                1379,
                1388
            ],
            [
                1400,
                1402
            ],
            [
                1402,
                1470
            ],
            [
                1470,
                1471
            ],
            [
                1477,
                1495
            ],
            [
                1495,
                1508
            ],
            [
                1520,
                1549
            ],
            [
                1555,
                1605
            ],
            [
                1605,
                1633
            ],
            [
                1638,
                1664
            ],
            [
                1679,
                1729
            ],
            [
                1740,
                1753
            ],
            [
                1767,
                1776
            ],
            [
                1786,
                1789
            ],
            [
                1803,
                1832
            ],
            [
                1832,
                1955
            ],
            [
                1956,
                2049
            ],
            [
                2054,
                2118
            ],
            [
                2150,
                2184
            ],
            [
                2184,
                2187
            ],
            [
                2213,
                2248
            ],
            [
                2264,
                2280
            ],
            [
                2280,
                2299
            ],
            [
                2355,
                2357
            ],
            [
                2406,
                2425
            ],
            [
                2425,
                2474
            ],
            [
                2538,
                2541
            ],
            [
                2486,
                2519
            ],
            [
                2526,
                2536
            ],
            [
                2552,
                2563
            ],
            [
                2563,
                2588
            ],
            [
                2603,
                2605
            ],
            [
                2706,
                2711
            ],
            [
                2719,
                2744
            ],
            [
                2674,
                2676
            ],
            [
                2902,
                2917
            ],
            [
                2848,
                2852
            ],
            [
                2833,
                2839
            ],
            [
                2853,
                2857
            ],
            [
                2840,
                2847
            ],
            [
                2918,
                2982
            ],
            [
                2984,
                3006
            ],
            [
                3013,
                3024
            ],
            [
                3038,
                3059
            ],
            [
                3110,
                3136
            ],
            [
                3136,
                3140
            ],
            [
                3147,
                3154
            ],
            [
                3234,
                3236
            ],
            [
                3185,
                3205
            ],
            [
                3239,
                3241
            ],
            [
                3241,
                3337
            ],
            [
                3396,
                3399
            ],
            [
                3408,
                3423
            ],
            [
                3430,
                3478
            ],
            [
                3478,
                3547
            ],
            [
                3556,
                3558
            ],
            [
                3558,
                3579
            ],
            [
                3579,
                3604
            ],
            [
                3604,
                3610
            ],
            [
                3624,
                3659
            ],
            [
                3735,
                3757
            ],
            [
                3757,
                3791
            ],
            [
                3791,
                3820
            ],
            [
                3900,
                3951
            ],
            [
                3980,
                3984
            ],
            [
                4009,
                4025
            ],
            [
                4025,
                4078
            ],
            [
                4078,
                4162
            ],
            [
                4164,
                4191
            ],
            [
                4200,
                4217
            ],
            [
                4263,
                4264
            ],
            [
                4224,
                4242
            ],
            [
                4265,
                4268
            ],
            [
                4274,
                4327
            ],
            [
                4385,
                4386
            ],
            [
                4327,
                4332
            ],
            [
                4334,
                4371
            ],
            [
                4435,
                4467
            ],
            [
                4409,
                4412
            ],
            [
                4495,
                4497
            ],
            [
                4679,
                4680
            ],
            [
                4567,
                4615
            ],
            [
                4621,
                4627
            ],
            [
                4616,
                4620
            ],
            [
                4627,
                4671
            ],
            [
                4721,
                4723
            ],
            [
                4723,
                4777
            ],
            [
                4777,
                4790
            ],
            [
                4790,
                4804
            ],
            [
                4834,
                4873
            ],
            [
                4885,
                4895
            ],
            [
                4937,
                4941
            ],
            [
                4955,
                4961
            ],
            [
                4963,
                5074
            ],
            [
                5185,
                5219
            ],
            [
                5229,
                5232
            ],
            [
                5232,
                5301
            ],
            [
                5301,
                5327
            ],
            [
                5327,
                5358
            ],
            [
                5358,
                5429
            ],
            [
                5429,
                5454
            ],
            [
                5454,
                5470
            ],
            [
                5470,
                5484
            ],
            [
                5484,
                5496
            ],
            [
                5496,
                5536
            ],
            [
                5573,
                5590
            ],
            [
                5592,
                5612
            ],
            [
                5648,
                5712
            ],
            [
                5712,
                5732
            ],
            [
                5744,
                5784
            ],
            [
                5819,
                5821
            ],
            [
                5829,
                5837
            ],
            [
                5842,
                5880
            ],
            [
                5880,
                5900
            ],
            [
                5910,
                5967
            ],
            [
                5992,
                6058
            ],
            [
                6073,
                6111
            ],
            [
                6136,
                6158
            ],
            [
                6164,
                6177
            ],
            [
                6184,
                6198
            ],
            [
                6118,
                6120
            ],
            [
                6200,
                6232
            ],
            [
                6928,
                6979
            ],
            [
                6984,
                6998
            ],
            [
                6911,
                6912
            ],
            [
                7172,
                7176
            ],
            [
                7002,
                7005
            ],
            [
                7177,
                7189
            ],
            [
                7194,
                7220
            ],
            [
                7222,
                7250
            ],
            [
                7256,
                7279
            ],
            [
                7292,
                7317
            ],
            [
                7318,
                7340
            ],
            [
                7358,
                7386
            ],
            [
                7390,
                7394
            ],
            [
                7402,
                7408
            ],
            [
                7423,
                7451
            ],
            [
                7452,
                7465
            ],
            [
                7472,
                7488
            ],
            [
                7465,
                7470
            ],
            [
                7488,
                7491
            ],
            [
                7491,
                7507
            ],
            [
                7515,
                7533
            ],
            [
                7541,
                7554
            ],
            [
                7560,
                7564
            ],
            [
                7565,
                7624
            ],
            [
                7899,
                7900
            ],
            [
                7741,
                7837
            ],
            [
                7847,
                7857
            ],
            [
                7861,
                7899
            ],
            [
                7939,
                7951
            ],
            [
                7957,
                7989
            ],
            [
                8057,
                8059
            ],
            [
                8101,
                8121
            ],
            [
                8146,
                8148
            ],
            [
                8148,
                8161
            ],
            [
                8176,
                8179
            ],
            [
                8179,
                8220
            ],
            [
                8220,
                8229
            ],
            [
                8239,
                8288
            ],
            [
                8288,
                8314
            ],
            [
                8314,
                8346
            ],
            [
                8353,
                8380
            ],
            [
                8380,
                8397
            ],
            [
                8397,
                8413
            ],
            [
                8484,
                8493
            ],
            [
                8498,
                8510
            ],
            [
                8515,
                8536
            ],
            [
                8567,
                8573
            ],
            [
                8595,
                8622
            ],
            [
                8644,
                8645
            ],
            [
                8650,
                8696
            ],
            [
                8696,
                8804
            ],
            [
                8804,
                8844
            ],
            [
                8870,
                8872
            ],
            [
                8872,
                8903
            ],
            [
                8903,
                8917
            ],
            [
                9040,
                9042
            ],
            [
                9103,
                9116
            ],
            [
                9124,
                9141
            ],
            [
                9685,
                9691
            ],
            [
                9150,
                9152
            ],
            [
                9691,
                9710
            ],
            [
                9711,
                9768
            ],
            [
                9772,
                9790
            ],
            [
                9790,
                9813
            ],
            [
                9834,
                9836
            ],
            [
                9836,
                9876
            ],
            [
                9876,
                9950
            ],
            [
                9997,
                10062
            ],
            [
                10079,
                10140
            ],
            [
                10148,
                10186
            ],
            [
                10447,
                10462
            ],
            [
                10468,
                10471
            ],
            [
                10483,
                10496
            ],
            [
                10623,
                10653
            ],
            [
                10653,
                10694
            ],
            [
                10694,
                10742
            ],
            [
                10781,
                10820
            ],
            [
                10820,
                10926
            ],
            [
                10940,
                10993
            ],
            [
                10930,
                10933
            ],
            [
                11014,
                11016
            ],
            [
                11149,
                11150
            ],
            [
                11058,
                11102
            ],
            [
                11151,
                11158
            ],
            [
                11163,
                11187
            ],
            [
                11189,
                11200
            ],
            [
                11223,
                11244
            ],
            [
                11244,
                11274
            ],
            [
                11353,
                11355
            ],
            [
                11355,
                11362
            ],
            [
                11371,
                11443
            ],
            [
                11443,
                11543
            ],
            [
                11544,
                11553
            ],
            [
                11558,
                11695
            ],
            [
                11695,
                11708
            ],
            [
                11722,
                11739
            ],
            [
                11782,
                11786
            ],
            [
                11744,
                11749
            ],
            [
                11883,
                11918
            ],
            [
                11946,
                12013
            ],
            [
                12048,
                12092
            ],
            [
                12094,
                12161
            ],
            [
                12161,
                12209
            ],
            [
                12222,
                12223
            ],
            [
                12224,
                12327
            ],
            [
                12327,
                12369
            ],
            [
                12369,
                12426
            ],
            [
                12433,
                12435
            ],
            [
                12435,
                12462
            ],
            [
                12462,
                12524
            ],
            [
                12538,
                12542
            ],
            [
                12545,
                12547
            ],
            [
                12586,
                12590
            ],
            [
                12593,
                12613
            ],
            [
                12676,
                12721
            ],
            [
                12732,
                12734
            ],
            [
                12734,
                12760
            ],
            [
                12764,
                12768
            ],
            [
                12803,
                12882
            ],
            [
                12780,
                12781
            ],
            [
                12907,
                12938
            ],
            [
                12947,
                12982
            ],
            [
                12983,
                12996
            ],
            [
                13539,
                13543
            ],
            [
                13020,
                13061
            ],
            [
                13544,
                13572
            ],
            [
                13579,
                13597
            ],
            [
                13061,
                13062
            ],
            [
                13599,
                13631
            ],
            [
                13641,
                13703
            ],
            [
                13703,
                13724
            ],
            [
                13732,
                13769
            ],
            [
                13773,
                13792
            ],
            [
                13876,
                13877
            ],
            [
                13861,
                13864
            ],
            [
                13935,
                13942
            ],
            [
                13954,
                13970
            ],
            [
                13970,
                14022
            ],
            [
                14128,
                14209
            ],
            [
                14209,
                14235
            ],
            [
                14256,
                14305
            ],
            [
                14334,
                14372
            ],
            [
                14385,
                14399
            ],
            [
                14399,
                14453
            ],
            [
                14453,
                14455
            ],
            [
                14462,
                14570
            ],
            [
                14607,
                14609
            ],
            [
                14609,
                14648
            ],
            [
                14678,
                14680
            ],
            [
                14719,
                14729
            ],
            [
                14731,
                14758
            ],
            [
                14758,
                14828
            ],
            [
                14828,
                14879
            ],
            [
                14879,
                14923
            ],
            [
                14923,
                14971
            ],
            [
                15004,
                15028
            ],
            [
                15028,
                15107
            ],
            [
                15107,
                15154
            ],
            [
                15188,
                15267
            ],
            [
                15267,
                15312
            ],
            [
                15312,
                15343
            ],
            [
                15343,
                15397
            ],
            [
                15408,
                15423
            ],
            [
                15423,
                15473
            ],
            [
                15473,
                15513
            ],
            [
                15513,
                15516
            ],
            [
                15519,
                15548
            ],
            [
                15548,
                15591
            ],
            [
                15591,
                15632
            ],
            [
                15650,
                15686
            ],
            [
                15700,
                15706
            ],
            [
                15718,
                15764
            ],
            [
                15803,
                15824
            ],
            [
                15837,
                15863
            ],
            [
                15871,
                15882
            ],
            [
                15883,
                15990
            ],
            [
                16061,
                16064
            ],
            [
                16093,
                16094
            ],
            [
                16269,
                16326
            ],
            [
                16326,
                16355
            ],
            [
                16367,
                16377
            ],
            [
                16377,
                16400
            ],
            [
                16461,
                16471
            ],
            [
                16475,
                16496
            ],
            [
                16400,
                16401
            ],
            [
                16498,
                16525
            ],
            [
                16459,
                16460
            ],
            [
                16449,
                16452
            ],
            [
                16527,
                16551
            ],
            [
                16580,
                16595
            ],
            [
                16602,
                16606
            ],
            [
                16647,
                16648
            ],
            [
                16649,
                16666
            ],
            [
                16668,
                16750
            ],
            [
                16776,
                16811
            ],
            [
                16812,
                16813
            ],
            [
                16821,
                16831
            ],
            [
                16753,
                16756
            ],
            [
                16867,
                16869
            ],
            [
                17084,
                17104
            ],
            [
                17042,
                17043
            ],
            [
                17146,
                17157
            ],
            [
                17015,
                17018
            ],
            [
                17163,
                17171
            ],
            [
                16869,
                16907
            ],
            [
                17082,
                17083
            ],
            [
                17293,
                17379
            ],
            [
                17390,
                17415
            ],
            [
                17426,
                17430
            ],
            [
                17435,
                17503
            ],
            [
                17503,
                17509
            ],
            [
                17523,
                17529
            ],
            [
                17639,
                17641
            ],
            [
                17582,
                17585
            ],
            [
                17702,
                17721
            ],
            [
                17757,
                17787
            ],
            [
                17799,
                17807
            ],
            [
                17815,
                17833
            ],
            [
                17981,
                17983
            ],
            [
                18118,
                18161
            ],
            [
                18161,
                18186
            ],
            [
                18204,
                18209
            ],
            [
                18220,
                18221
            ],
            [
                18228,
                18260
            ],
            [
                18278,
                18309
            ],
            [
                18318,
                18324
            ],
            [
                18324,
                18364
            ],
            [
                18377,
                18410
            ],
            [
                18423,
                18430
            ],
            [
                18448,
                18451
            ],
            [
                18461,
                18466
            ],
            [
                18532,
                18537
            ],
            [
                18676,
                18739
            ],
            [
                18739,
                18741
            ],
            [
                18747,
                18766
            ],
            [
                18782,
                18873
            ],
            [
                18895,
                18971
            ],
            [
                19168,
                19193
            ],
            [
                19223,
                19226
            ],
            [
                19229,
                19237
            ],
            [
                19274,
                19290
            ],
            [
                19299,
                19308
            ],
            [
                19333,
                19419
            ],
            [
                19419,
                19480
            ],
            [
                19480,
                19553
            ],
            [
                19553,
                19566
            ],
            [
                19573,
                19575
            ],
            [
                19575,
                19619
            ],
            [
                19619,
                19678
            ],
            [
                19678,
                19692
            ],
            [
                19692,
                19703
            ],
            [
                19703,
                19704
            ],
            [
                19704,
                19741
            ],
            [
                19741,
                19762
            ],
            [
                19762,
                19815
            ],
            [
                19821,
                19837
            ],
            [
                19837,
                19860
            ],
            [
                19860,
                19927
            ],
            [
                19927,
                19948
            ],
            [
                19953,
                19974
            ],
            [
                19979,
                20057
            ],
            [
                20057,
                20063
            ],
            [
                20070,
                20107
            ],
            [
                20107,
                20124
            ],
            [
                20124,
                20140
            ],
            [
                20218,
                20219
            ],
            [
                20163,
                20174
            ],
            [
                20188,
                20191
            ],
            [
                20205,
                20215
            ],
            [
                20220,
                20241
            ],
            [
                20392,
                20393
            ],
            [
                20242,
                20253
            ],
            [
                20265,
                20270
            ],
            [
                20287,
                20320
            ],
            [
                20394,
                20405
            ],
            [
                20426,
                20430
            ],
            [
                20476,
                20519
            ],
            [
                20520,
                20583
            ],
            [
                20590,
                20607
            ],
            [
                20607,
                20630
            ],
            [
                20641,
                20644
            ],
            [
                20652,
                20664
            ],
            [
                20666,
                20713
            ],
            [
                20713,
                20747
            ],
            [
                20755,
                20835
            ],
            [
                20835,
                20860
            ],
            [
                20892,
                20897
            ],
            [
                20911,
                20986
            ],
            [
                20992,
                21007
            ],
            [
                21020,
                21046
            ],
            [
                21046,
                21065
            ],
            [
                21098,
                21184
            ],
            [
                21220,
                21263
            ],
            [
                21218,
                21219
            ],
            [
                21265,
                21392
            ],
            [
                21396,
                21482
            ],
            [
                21549,
                21550
            ],
            [
                21557,
                21559
            ],
            [
                21559,
                21567
            ],
            [
                21582,
                21622
            ],
            [
                21623,
                21654
            ],
            [
                21672,
                21688
            ],
            [
                21737,
                21749
            ],
            [
                21725,
                21728
            ],
            [
                21729,
                21736
            ],
            [
                21751,
                21757
            ],
            [
                21761,
                21827
            ],
            [
                21827,
                21857
            ],
            [
                21863,
                21868
            ],
            [
                21879,
                21934
            ],
            [
                21957,
                21980
            ],
            [
                22000,
                22028
            ],
            [
                22028,
                22124
            ],
            [
                22124,
                22168
            ],
            [
                22204,
                22226
            ],
            [
                22202,
                22203
            ],
            [
                22228,
                22229
            ],
            [
                22251,
                22304
            ],
            [
                22328,
                22360
            ],
            [
                22387,
                22389
            ],
            [
                22397,
                22456
            ],
            [
                22501,
                22534
            ],
            [
                22534,
                22583
            ],
            [
                22631,
                22633
            ],
            [
                22633,
                22666
            ],
            [
                22766,
                22769
            ],
            [
                22773,
                22835
            ],
            [
                22872,
                22874
            ],
            [
                22880,
                22902
            ],
            [
                22907,
                22922
            ],
            [
                22975,
                22976
            ],
            [
                23167,
                23170
            ],
            [
                22903,
                22906
            ],
            [
                22977,
                22981
            ],
            [
                23227,
                23237
            ],
            [
                23241,
                23293
            ],
            [
                23304,
                23326
            ],
            [
                23326,
                23376
            ],
            [
                23436,
                23439
            ],
            [
                23419,
                23429
            ],
            [
                23440,
                23469
            ],
            [
                23483,
                23501
            ],
            [
                23520,
                23526
            ],
            [
                23530,
                23532
            ],
            [
                23532,
                23573
            ],
            [
                23590,
                23661
            ],
            [
                23662,
                23671
            ],
            [
                23731,
                23789
            ],
            [
                23794,
                23838
            ],
            [
                23671,
                23673
            ],
            [
                23849,
                23887
            ],
            [
                23909,
                23910
            ],
            [
                23911,
                24000
            ],
            [
                24016,
                24018
            ],
            [
                24018,
                24077
            ],
            [
                24078,
                24173
            ],
            [
                24182,
                24214
            ],
            [
                24214,
                24274
            ],
            [
                24305,
                24308
            ],
            [
                24321,
                24341
            ],
            [
                24350,
                24423
            ],
            [
                24423,
                24537
            ]
        ],
        "row_chars": [
            [
                0,
                156
            ],
            [
                156,
                388
            ],
            [
                388,
                994
            ],
            [
                994,
                1311
            ],
            [
                1311,
                1349
            ],
            [
                1349,
                1402
            ],
            [
                1402,
                1470
            ],
            [
                1470,
                1495
            ],
            [
                1495,
                1605
            ],
            [
                1605,
                1832
            ],
            [
                1832,
                1956
            ],
            [
                1956,
                2184
            ],
            [
                2184,
                2280
            ],
            [
                2280,
                2425
            ],
            [
                2425,
                2563
            ],
            [
                2563,
                3024
            ],
            [
                3024,
                3059
            ],
            [
                3059,
                3110
            ],
            [
                3110,
                3136
            ],
            [
                3136,
                3241
            ],
            [
                3241,
                3337
            ],
            [
                3337,
                3478
            ],
            [
                3478,
                3558
            ],
            [
                3558,
                3579
            ],
            [
                3579,
                3604
            ],
            [
                3604,
                3659
            ],
            [
                3659,
                3735
            ],
            [
                3735,
                3791
            ],
            [
                3791,
                3951
            ],
            [
                3951,
                3980
            ],
            [
                3980,
                4025
            ],
            [
                4025,
                4078
            ],
            [
                4078,
                4191
            ],
            [
                4191,
                4327
            ],
            [
                4327,
                4497
            ],
            [
                4497,
                4563
            ],
            [
                4563,
                4723
            ],
            [
                4723,
                4777
            ],
            [
                4777,
                4790
            ],
            [
                4790,
                5123
            ],
            [
                5123,
                5136
            ],
            [
                5136,
                5185
            ],
            [
                5185,
                5232
            ],
            [
                5232,
                5301
            ],
            [
                5301,
                5327
            ],
            [
                5327,
                5358
            ],
            [
                5358,
                5429
            ],
            [
                5429,
                5454
            ],
            [
                5454,
                5470
            ],
            [
                5470,
                5484
            ],
            [
                5484,
                5712
            ],
            [
                5712,
                5880
            ],
            [
                5880,
                6232
            ],
            [
                6232,
                6738
            ],
            [
                6738,
                6907
            ],
            [
                6907,
                7318
            ],
            [
                7318,
                7452
            ],
            [
                7452,
                7491
            ],
            [
                7491,
                7565
            ],
            [
                7565,
                8148
            ],
            [
                8148,
                8179
            ],
            [
                8179,
                8220
            ],
            [
                8220,
                8288
            ],
            [
                8288,
                8314
            ],
            [
                8314,
                8380
            ],
            [
                8380,
                8397
            ],
            [
                8397,
                8696
            ],
            [
                8696,
                8804
            ],
            [
                8804,
                8872
            ],
            [
                8872,
                8903
            ],
            [
                8903,
                9042
            ],
            [
                9042,
                9103
            ],
            [
                9103,
                9772
            ],
            [
                9772,
                9790
            ],
            [
                9790,
                9836
            ],
            [
                9836,
                9876
            ],
            [
                9876,
                10187
            ],
            [
                10187,
                10447
            ],
            [
                10447,
                10623
            ],
            [
                10623,
                10653
            ],
            [
                10653,
                10694
            ],
            [
                10694,
                10820
            ],
            [
                10820,
                11244
            ],
            [
                11244,
                11355
            ],
            [
                11355,
                11443
            ],
            [
                11443,
                11544
            ],
            [
                11544,
                11695
            ],
            [
                11695,
                12161
            ],
            [
                12161,
                12224
            ],
            [
                12224,
                12327
            ],
            [
                12327,
                12369
            ],
            [
                12369,
                12435
            ],
            [
                12435,
                12462
            ],
            [
                12462,
                12593
            ],
            [
                12593,
                12734
            ],
            [
                12734,
                12983
            ],
            [
                12983,
                13703
            ],
            [
                13703,
                13970
            ],
            [
                13970,
                14209
            ],
            [
                14209,
                14399
            ],
            [
                14399,
                14453
            ],
            [
                14453,
                14609
            ],
            [
                14609,
                14680
            ],
            [
                14680,
                14719
            ],
            [
                14719,
                14758
            ],
            [
                14758,
                14828
            ],
            [
                14828,
                14879
            ],
            [
                14879,
                14923
            ],
            [
                14923,
                14971
            ],
            [
                14971,
                15004
            ],
            [
                15004,
                15028
            ],
            [
                15028,
                15107
            ],
            [
                15107,
                15267
            ],
            [
                15267,
                15343
            ],
            [
                15343,
                15423
            ],
            [
                15423,
                15473
            ],
            [
                15473,
                15513
            ],
            [
                15513,
                15548
            ],
            [
                15548,
                15591
            ],
            [
                15591,
                15632
            ],
            [
                15632,
                15883
            ],
            [
                15883,
                16095
            ],
            [
                16095,
                16161
            ],
            [
                16161,
                16269
            ],
            [
                16269,
                16326
            ],
            [
                16326,
                16377
            ],
            [
                16377,
                16649
            ],
            [
                16649,
                16750
            ],
            [
                16750,
                16869
            ],
            [
                16869,
                17293
            ],
            [
                17293,
                17503
            ],
            [
                17503,
                17983
            ],
            [
                17983,
                18046
            ],
            [
                18046,
                18114
            ],
            [
                18114,
                18161
            ],
            [
                18161,
                18324
            ],
            [
                18324,
                18739
            ],
            [
                18739,
                18971
            ],
            [
                18971,
                19002
            ],
            [
                19002,
                19012
            ],
            [
                19012,
                19085
            ],
            [
                19085,
                19167
            ],
            [
                19167,
                19419
            ],
            [
                19419,
                19480
            ],
            [
                19480,
                19553
            ],
            [
                19553,
                19575
            ],
            [
                19575,
                19619
            ],
            [
                19619,
                19678
            ],
            [
                19678,
                19692
            ],
            [
                19692,
                19703
            ],
            [
                19703,
                19741
            ],
            [
                19741,
                19762
            ],
            [
                19762,
                19837
            ],
            [
                19837,
                19860
            ],
            [
                19860,
                19927
            ],
            [
                19927,
                19948
            ],
            [
                19948,
                19974
            ],
            [
                19974,
                20057
            ],
            [
                20057,
                20107
            ],
            [
                20107,
                20124
            ],
            [
                20124,
                20520
            ],
            [
                20520,
                20607
            ],
            [
                20607,
                20713
            ],
            [
                20713,
                20835
            ],
            [
                20835,
                21046
            ],
            [
                21046,
                21098
            ],
            [
                21098,
                21559
            ],
            [
                21559,
                21827
            ],
            [
                21827,
                22028
            ],
            [
                22028,
                22124
            ],
            [
                22124,
                22389
            ],
            [
                22389,
                22456
            ],
            [
                22456,
                22534
            ],
            [
                22534,
                22633
            ],
            [
                22633,
                22874
            ],
            [
                22874,
                23237
            ],
            [
                23237,
                23326
            ],
            [
                23326,
                23376
            ],
            [
                23376,
                23532
            ],
            [
                23532,
                23671
            ],
            [
                23671,
                23911
            ],
            [
                23911,
                24018
            ],
            [
                24018,
                24214
            ],
            [
                24214,
                24423
            ],
            [
                24423,
                24537
            ]
        ]
    },
    "abridged": {
        "text": "Cuff's fight with Dobbin, and the unexpected result, will long be remembered by every man who was educated at Dr. Swishtail's famous school.\nDobbin (who used to be called Heigh-ho Dobbin, Gee-up Dobbin, and other contemptuous names) was the quietest, clumsiest, and, it seemed, the dullest of Dr. Swishtail's pupils. His father was a grocer: and it was rumoured that his board and schooling were paid for in goods, not money. He stood there in his scraggy corduroys and jacket, with his great bones bursting through the seams, as the representative of so many pounds of tea, candles, sugar, soap and other commodities. A dreadful day it was for young Dobbin when one of the boys espied the cart of Dobbin & Rudge, Grocers and Oilmen, at the Doctor's door, unloading its wares.\nYoung Dobbin had no peace after that. The jokes were merciless. \"Hullo, Dobbin,\" one wag would say, \"here's good news in the paper. Sugar is ris', my boy.\" Another would ask: \"If a pound of mutton-candles costs sevenpence-halfpenny, how much must Dobbin cost?\" and a roar would follow from the circle of young knaves, who rightly considered that the selling of goods is a shameful practice, deserving the scorn of all real gentlemen.\n\"Your father's only a merchant, Osborne,\" Dobbin said in private to the little boy who had brought down the storm upon him.\nAt which the latter replied haughtily, \"My father's a gentleman, and keeps his carriage\"; and William Dobbin retreated to a remote outhouse in the playground, in the bitterest sadness and woe. Who does not recollect similar hours of childish grief? Who feels injustice so acutely as a generous boy? and how many of those gentle souls do you degrade and torture, for the sake of a little arithmetic and dog-latin?\nNow, William Dobbin, from his inability to learn Latin, was compelled to remain in the lower form, with little pink-faced fellows; a giant amongst them, with his downcast, stupefied look, his dog-eared primer, and his corduroys. All made fun of him. They cut his bed-strings. They left buckets for him to break his shins over. They sent him parcels, which, when opened, were found to contain the paternal soap and candles. Dobbin bore everything patiently, and was entirely dumb and miserable.\nCuff, on the contrary, was the great chief and dandy of the Swishtail School. He smuggled wine in. He fought the town-boys. Ponies were brought for him to ride home on Saturdays. He had a gold repeater watch: and took snuff like the Doctor. He had been to the Opera, and could knock you off forty Latin verses in an hour. What couldn't he do? They said even the Doctor himself was afraid of him.\nCuff, the unquestioned king of the school, ruled over his subjects, and bullied them with splendid superiority. They blacked his shoes, toasted his bread, and gave him balls at cricket during whole summer afternoons. Dobbin, or \"Figs,\" was the fellow whom he despised most, although he scarcely ever condescended to speak to him.\nOne day, Dobbin, alone in the schoolroom, was blundering over a letter home; when Cuff, entering, bade him go upon some errand.\n\"I can't,\" says Dobbin; \"I want to finish my letter.\"\n\"You can't?\" says Mr. Cuff, picking up the letter (in which many words were scratched out or mis-spelt, with much labour and tears; for the poor fellow was writing to his mother, who was fond of him, although she was a grocer's wife.) \"Can't you write to old Mother Figs tomorrow?\"\n\"Don't call names,\" Dobbin said, getting off the bench very nervous.\n\"Well, sir, will you go?\" crowed the cock of the school.\n\"Put down the letter,\" Dobbin replied; \"no gentleman readth letterth.\"\n\"Well, NOW will you go?\" says the other.\n\"No, I won't. Don't strike me, or I'll THMASH you,\" roars out Dobbin, looking so wicked that Mr. Cuff paused, put his hands into his pockets, and walked away with a sneer. But he never meddled with the grocer's boy after that; though he spoke of Dobbin with contempt behind his back.\nSome time after this, it happened that Mr. Cuff, on a sunshiny afternoon, was near poor William Dobbin, who was lying under a tree in the playground, looking at a favourite copy of the Arabian Nights while the rest of the school were pursuing various sports. He was quite lonely, and almost happy. He had for once forgotten the world, and was away with Sinbad the Sailor, when the shrill cries of a little fellow weeping woke up his pleasant reverie. Looking up, he saw Cuff belabouring a little boy. It was the lad who had told about the grocer's cart; but Dobbin bore no malice towards the young and small.\n\"How dare you break the bottle, sir?\" says Cuff to the urchin, swinging a cricket-stump at him. The boy had been instructed to get over the playground wall; to run a quarter of a mile; to purchase a pint of rum-shrub on credit; to brave all the Doctor's spies, and clamber back into the playground again. His foot had slipped, and the bottle was broken, and he stood guilty and trembling.\n\"How dare you?\" says Cuff; \"you blundering little thief. You drank it, and now you pretend to have broken the bottle. Hold out your hand, sir.\"\nDown came the stump with a great thump on the child's hand. A moan followed. Dobbin looked up: the Roc whisked away Sinbad the Sailor out of sight, and there was everyday life; a big boy beating a little one without cause.\n\"Hold out your other hand, sir,\" roars Cuff to his little schoolfellow, whose face was distorted with pain. Dobbin quivered, and gathered himself up.\n\"Take that, you little devil!\" cried Mr. Cuff. Down came the stump again; and Dobbin sprang up, and screamed out,\n\"Hold off, Cuff; don't bully that child any more; or I'll-\"\n\"Or you'll what?\" Cuff asked in amazement. \"Hold out your hand, you little beast.\"\n\"I'll give you the worst thrashing you ever had in your life,\" Dobbin said; and little Osborne, gasping and in tears, looked up with wonder at seeing this amazing champion put up suddenly to defend him. Cuff's astonishment was scarcely less.\n\"After school,\" said he, after a pause.\n\"As you please,\" Dobbin said. \"You must be my bottle holder, Osborne.\"\n\"Well, if you like,\" little Osborne replied; for he was rather ashamed of his champion.\nYes, when the hour of battle came, he was almost ashamed to say, \"Go it, Figs\"; and not a single other boy uttered that cry for the first two or three rounds of the fight. At its start, Cuff, with a contemptuous smile on his face, planted blows upon his adversary and floored him three times running. At each fall there was a cheer.\n\"What a beating I shall get when it's over,\" young Osborne thought, picking up his man. \"You'd best give in,\" he said to Dobbin; \"it's only a thrashing, Figs, and you know I'm used to it.\"\nBut Figs, whose limbs were in a quiver, and whose nostrils were breathing rage, put his little bottle-holder aside, and went in for a fourth time.\nAs he did not know how to parry Cuff's blows, Figs now determined that he would start with a charge on his own part; and accordingly, being a left-handed man, hit out a couple of times with all his might - once at Mr. Cuff's left eye, and once on his beautiful Roman nose.\nCuff went down this time, to the astonishment of all.\n\"Well hit, by Jove,\" says little Osborne, with the air of a connoisseur, clapping his man on the back. \"Give it him with the left, Figs my boy.\"\nFigs's left made terrific play during all the rest of the fight. Cuff went down every time. At the sixth round, there were almost as many fellows shouting for Figs as for Cuff. At the twelfth round Cuff lost all presence of mind and power of attack. Figs, on the contrary, was calm and pale, his eyes shining open, and a great cut on his underlip bleeding profusely. He had a fierce and ghastly air, which struck terror into many spectators.\nNevertheless, Cuff prepared to close for the thirteenth time; coming up full of pluck, but reeling and groggy. The Fig-merchant put in his left on his adversary's nose, and sent him down for the last time.\n\"I think that will do,\" Figs said, as his opponent dropped neatly on the green, and did not stand up again.\nAnd now all the boys set up such a shout for Figs as brought Dr. Swishtail out of his study, curious to know the cause of the uproar. He threatened to flog Figs; but Cuff, who had come to himself by this time, stood up and said, \"It's my fault, sir - not Dobbin's. I was bullying a little boy; and he served me right.\" By this magnanimous speech he not only saved his conqueror a whipping, but got back all his ascendancy over the boys.\nYoung Osborne wrote home to his parents.\nDear Mama,\nI hope you are quite well. I should be much obliged to you to send me a cake and five shillings. There has been a fight here between Cuff & Dobbin. Cuff, you know, was the Cock of the School. They fought thirteen rounds, and Dobbin Licked. The fight was about me. Cuff was licking me for breaking a bottle of milk, and Figs wouldn't stand it. We call him Figs because his father is a Grocer. I think as he fought for me you ought to buy your Tea & Sugar at his father's. Cuff goes home every Saturday, but can't this week, because he has 2 Black Eyes. He has a white Pony to come and fetch him, and a groom on a bay mare. I wish my Papa would let me have a Pony, and I am\nYour dutiful Son, GEORGE SEDLEY OSBORNE\nP.S. Give my love to little Emmy. I am cutting her out a Coach in cardboard. Please not a seed-cake, but a plum-cake.\nAfter Dobbin's victory, his character rose greatly in the eyes of all his schoolfellows, and the name of Figs became as respectable a nickname as any other in the school.\n\"After all, it's not his fault that his father's a grocer,\" George Osborne said, who, though a little chap, was popular.\nAnd Dobbin's spirit rose with his altered circumstances. He made wonderful advances in learning. The superb Cuff himself helped him with his Latin verses, \"coached\" him in play-hours, and carried him triumphantly into the middle form.\nIt was discovered that although dull at classical learning, at mathematics he was uncommonly quick. He passed third in algebra, and got presented with a prize-book before the whole school. All the boys clapped, despite his blushes and stumbles; you should have seen his mother's face. Old Dobbin, his father, who now respected him for the first time, gave him two guineas, most of which he spent in tuck for the school: and he came back in a tail-coat after the holidays.\nDobbin modestly attributed all his good fortune to little George Osborne, to whom he vowed love and affection. He was his valet, his dog, his man Friday. He believed Osborne to be perfect in every way, the handsomest, the bravest, the cleverest, the most generous of boys. He shared his money with him: bought him presents of knives, pencil-cases, toffee, and books - gifts which George received very graciously, as became his superior merit.\nSo Lieutenant Osborne, arriving at Russell Square on the day of the Vauxhall party, said to the ladies, \"Mrs. Sedley, Ma'am, I've asked Dobbin of ours to come and dine here, and go with us to Vauxhall. I met him at the Bedford, and told him that we were all going out; and that Mrs. Sedley had forgiven his breaking the punch-bowl at the child's party. Don't you remember the catastrophe, Ma'am, seven years ago?\"\n\"Over Mrs. Flamingo's crimson silk gown,\" said good-natured Mrs. Sedley. \"What a gawky! And his sisters are not much more graceful. Lady Dobbin was at Highbury last night with three of them. Such figures! my dears.\"\n\"His father the Alderman's very rich, isn't he?\" Osborne said archly. \"Don't you think one of the daughters would be a good match for me, Ma'am?\"\n\"You foolish creature! Who would take you, I should like to know, with your yellow face?\"\n\"Mine a yellow face? Wait till you see Dobbin. He had the yellow fever three times; twice at Nassau, and once at St. Kitts.\"\n\"Well, yours is quite yellow enough for us. Isn't it, Emmy?\" Mrs. Sedley said. Amelia only smiled and blushed. Looking at George Osborne's pale, interesting face, and black, curling, shining whiskers, she thought that there never was such a face or such a hero.\n\"I don't care about Captain Dobbin's complexion,\" she said, \"or his awkwardness. I shall always like him;\" her reason being that he was the friend and champion of George.\n\"There's not a finer fellow in the army,\" Osborne said, \"nor a better officer, though he is not an Adonis, certainly.\" And he looked towards the mirror; and caught Miss Sharp's eye fixed keenly upon him, at which he blushed a little.\nRebecca thought, \"Ah, mon beau Monsieur! I think I have your measure.\"\nThat evening, when Amelia came tripping into the drawing-room in a white muslin frock, singing like a lark, and as fresh as a rose, a very tall ungainly gentleman, with large hands and feet, and large ears, set off by a closely cropped head of black hair, and wearing the hideous military frogged coat and cocked hat of those times, advanced to meet her, with a clumsy bow.\nThis was Captain William Dobbin, of His Majesty's ___th Regiment of Foot, returned from the West Indies, where his regiment had been ordered whilst many of his gallant comrades were reaping glory in the Peninsula.\nHe had arrived with a knock so timid that it was inaudible to the ladies upstairs: otherwise Amelia would never have come singing into the room. As it was, the sweet fresh little voice went right into the Captain's heart, and nestled there. When she held out her hand for him to shake, he paused, and thought, \"Are you the little maid I remember in the pink frock, the night I upset the punch-bowl? The little girl that George Osborne said should marry him? What a prize the rogue has got!\" All this he thought, before he took Amelia's hand.\nHis history since he left school, has, I think, been indicated sufficiently for an ingenious reader. His father, the despised grocer, became Alderman Dobbin, and was then knighted. The son had entered the army: and young Osborne followed in the same regiment. They had served in the West Indies and in Canada. Dobbin's attachment to George Osborne was as warm now as it had been at school.\nSo these worthy people sat down to dinner, and talked about war and glory, and Boney and Lord Wellington, and the last military Gazette. The two gallant young men longed to see their own names in that glorious list, and cursed their unlucky fate in belonging to a regiment which had been away from battle.\nMiss Sharp kindled with this exciting talk, but Miss Sedley trembled and grew quite faint. Mr. Jos told several of his tiger-hunting stories, finished with the one about Miss Cutler and Lance the surgeon; helped Rebecca to everything on the table, and gobbled and drank a great deal.\nHe sprang to open the door for the ladies, when they retired; and returning to the table, filled bumper after bumper of claret, which he swallowed with nervous rapidity.\n\"He's priming himself,\" Osborne whispered to Dobbin, and at length the hour and the carriage arrived for Vauxhall.",
        "paragraph_chars": [
            [
                0,
                141
            ],
            [
                141,
                777
            ],
            [
                777,
                1211
            ],
            [
                1211,
                1335
            ],
            [
                1335,
                1748
            ],
            [
                1748,
                2242
            ],
            [
                2242,
                2638
            ],
            [
                2638,
                2968
            ],
            [
                2968,
                3096
            ],
            [
                3096,
                3150
            ],
            [
                3150,
                3432
            ],
            [
                3432,
                3501
            ],
            [
                3501,
                3558
            ],
            [
                3558,
                3629
            ],
            [
                3629,
                3670
            ],
            [
                3670,
                3954
            ],
            [
                3954,
                4563
            ],
            [
                4563,
                4952
            ],
            [
                4952,
                5096
            ],
            [
                5096,
                5319
            ],
            [
                5319,
                5469
            ],
            [
                5469,
                5583
            ],
            [
                5583,
                5643
            ],
            [
                5643,
                5726
            ],
            [
                5726,
                5968
            ],
            [
                5968,
                6008
            ],
            [
                6008,
                6079
            ],
            [
                6079,
                6167
            ],
            [
                6167,
                6500
            ],
            [
                6500,
                6689
            ],
            [
                6689,
                6836
            ],
            [
                6836,
                7109
            ],
            [
                7109,
                7163
            ],
            [
                7163,
                7308
            ],
            [
                7308,
                7750
            ],
            [
                7750,
                7956
            ],
            [
                7956,
                8064
            ],
            [
                8064,
                8501
            ],
            [
                8501,
                8542
            ],
            [
                8542,
                8553
            ],
            [
                8553,
                9225
            ],
            [
                9225,
                9265
            ],
            [
                9265,
                9383
            ],
            [
                9383,
                9554
            ],
            [
                9554,
                9675
            ],
            [
                9675,
                9910
            ],
            [
                9910,
                10382
            ],
            [
                10382,
                10825
            ],
            [
                10825,
                11239
            ],
            [
                11239,
                11455
            ],
            [
                11455,
                11601
            ],
            [
                11601,
                11691
            ],
            [
                11691,
                11816
            ],
            [
                11816,
                12078
            ],
            [
                12078,
                12249
            ],
            [
                12249,
                12483
            ],
            [
                12483,
                12554
            ],
            [
                12554,
                12928
            ],
            [
                12928,
                13142
            ],
            [
                13142,
                13684
            ],
            [
                13684,
                14074
            ],
            [
                14074,
                14380
            ],
            [
                14380,
                14664
            ],
            [
                14664,
                14834
            ],
            [
                14834,
                14948
            ]
        ],
        "segment_chars": [
            [
                0,
                141
            ],
            [
                141,
                317
            ],
            [
                317,
                426
            ],
            [
                426,
                619
            ],
            [
                619,
                777
            ],
            [
                777,
                815
            ],
            [
                815,
                841
            ],
            [
                841,
                909
            ],
            [
                909,
                933
            ],
            [
                933,
                1038
            ],
            [
                1038,
                1211
            ],
            [
                1211,
                1335
            ],
            [
                1335,
                1528
            ],
            [
                1528,
                1584
            ],
            [
                1584,
                1634
            ],
            [
                1634,
                1748
            ],
            [
                1748,
                1977
            ],
            [
                1977,
                1998
            ],
            [
                1998,
                2024
            ],
            [
                2024,
                2075
            ],
            [
                2075,
                2171
            ],
            [
                2171,
                2242
            ],
            [
                2242,
                2320
            ],
            [
                2320,
                2341
            ],
            [
                2341,
                2366
            ],
            [
                2366,
                2421
            ],
            [
                2421,
                2483
            ],
            [
                2483,
                2564
            ],
            [
                2564,
                2585
            ],
            [
                2585,
                2638
            ],
            [
                2638,
                2750
            ],
            [
                2750,
                2855
            ],
            [
                2855,
                2968
            ],
            [
                2968,
                3096
            ],
            [
                3096,
                3150
            ],
            [
                3150,
                3163
            ],
            [
                3163,
                3385
            ],
            [
                3385,
                3432
            ],
            [
                3432,
                3501
            ],
            [
                3501,
                3527
            ],
            [
                3527,
                3558
            ],
            [
                3558,
                3629
            ],
            [
                3629,
                3654
            ],
            [
                3654,
                3670
            ],
            [
                3670,
                3684
            ],
            [
                3684,
                3842
            ],
            [
                3842,
                3954
            ],
            [
                3954,
                4213
            ],
            [
                4213,
                4252
            ],
            [
                4252,
                4405
            ],
            [
                4405,
                4455
            ],
            [
                4455,
                4563
            ],
            [
                4563,
                4601
            ],
            [
                4601,
                4659
            ],
            [
                4659,
                4868
            ],
            [
                4868,
                4952
            ],
            [
                4952,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5070
            ],
            [
                5070,
                5096
            ],
            [
                5096,
                5156
            ],
            [
                5156,
                5173
            ],
            [
                5173,
                5319
            ],
            [
                5319,
                5427
            ],
            [
                5427,
                5469
            ],
            [
                5469,
                5500
            ],
            [
                5500,
                5516
            ],
            [
                5516,
                5583
            ],
            [
                5583,
                5643
            ],
            [
                5643,
                5661
            ],
            [
                5661,
                5686
            ],
            [
                5686,
                5726
            ],
            [
                5726,
                5929
            ],
            [
                5929,
                5968
            ],
            [
                5968,
                6008
            ],
            [
                6008,
                6038
            ],
            [
                6038,
                6079
            ],
            [
                6079,
                6167
            ],
            [
                6167,
                6339
            ],
            [
                6339,
                6468
            ],
            [
                6468,
                6500
            ],
            [
                6500,
                6588
            ],
            [
                6588,
                6689
            ],
            [
                6689,
                6836
            ],
            [
                6836,
                7109
            ],
            [
                7109,
                7163
            ],
            [
                7163,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7373
            ],
            [
                7373,
                7400
            ],
            [
                7400,
                7485
            ],
            [
                7485,
                7558
            ],
            [
                7558,
                7675
            ],
            [
                7675,
                7750
            ],
            [
                7750,
                7861
            ],
            [
                7861,
                7956
            ],
            [
                7956,
                8064
            ],
            [
                8064,
                8198
            ],
            [
                8198,
                8329
            ],
            [
                8329,
                8383
            ],
            [
                8383,
                8501
            ],
            [
                8501,
                8542
            ],
            [
                8542,
                8553
            ],
            [
                8553,
                8580
            ],
            [
                8580,
                8650
            ],
            [
                8650,
                8701
            ],
            [
                8701,
                8745
            ],
            [
                8745,
                8793
            ],
            [
                8793,
                8817
            ],
            [
                8817,
                8896
            ],
            [
                8896,
                8945
            ],
            [
                8945,
                9024
            ],
            [
                9024,
                9105
            ],
            [
                9105,
                9175
            ],
            [
                9175,
                9225
            ],
            [
                9225,
                9265
            ],
            [
                9265,
                9299
            ],
            [
                9299,
                9342
            ],
            [
                9342,
                9383
            ],
            [
                9383,
                9554
            ],
            [
                9554,
                9675
            ],
            [
                9675,
                9732
            ],
            [
                9732,
                9772
            ],
            [
                9772,
                9910
            ],
            [
                9910,
                10010
            ],
            [
                10010,
                10099
            ],
            [
                10099,
                10195
            ],
            [
                10195,
                10382
            ],
            [
                10382,
                10493
            ],
            [
                10493,
                10536
            ],
            [
                10536,
                10655
            ],
            [
                10655,
                10825
            ],
            [
                10825,
                11027
            ],
            [
                11027,
                11178
            ],
            [
                11178,
                11239
            ],
            [
                11239,
                11312
            ],
            [
                11312,
                11327
            ],
            [
                11327,
                11371
            ],
            [
                11371,
                11430
            ],
            [
                11430,
                11444
            ],
            [
                11444,
                11455
            ],
            [
                11455,
                11504
            ],
            [
                11504,
                11525
            ],
            [
                11525,
                11601
            ],
            [
                11601,
                11624
            ],
            [
                11624,
                11691
            ],
            [
                11691,
                11712
            ],
            [
                11712,
                11738
            ],
            [
                11738,
                11816
            ],
            [
                11816,
                11860
            ],
            [
                11860,
                11877
            ],
            [
                11877,
                11895
            ],
            [
                11895,
                11927
            ],
            [
                11927,
                12078
            ],
            [
                12078,
                12159
            ],
            [
                12159,
                12249
            ],
            [
                12249,
                12368
            ],
            [
                12368,
                12483
            ],
            [
                12483,
                12524
            ],
            [
                12524,
                12554
            ],
            [
                12554,
                12928
            ],
            [
                12928,
                13142
            ],
            [
                13142,
                13287
            ],
            [
                13287,
                13383
            ],
            [
                13383,
                13541
            ],
            [
                13541,
                13600
            ],
            [
                13600,
                13633
            ],
            [
                13633,
                13684
            ],
            [
                13684,
                13785
            ],
            [
                13785,
                13865
            ],
            [
                13865,
                13944
            ],
            [
                13944,
                13994
            ],
            [
                13994,
                14074
            ],
            [
                14074,
                14211
            ],
            [
                14211,
                14380
            ],
            [
                14380,
                14471
            ],
            [
                14471,
                14664
            ],
            [
                14664,
                14834
            ],
            [
                14834,
                14948
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                51,
                140
            ],
            [
                148,
                192
            ],
            [
                195,
                206
            ],
            [
                207,
                212
            ],
            [
                213,
                221
            ],
            [
                226,
                231
            ],
            [
                231,
                250
            ],
            [
                251,
                266
            ],
            [
                267,
                292
            ],
            [
                293,
                308
            ],
            [
                315,
                317
            ],
            [
                317,
                327
            ],
            [
                328,
                340
            ],
            [
                340,
                352
            ],
            [
                362,
                366
            ],
            [
                367,
                395
            ],
            [
                401,
                404
            ],
            [
                405,
                424
            ],
            [
                424,
                425
            ],
            [
                426,
                440
            ],
            [
                441,
                477
            ],
            [
                483,
                492
            ],
            [
                493,
                498
            ],
            [
                499,
                507
            ],
            [
                508,
                525
            ],
            [
                525,
                526
            ],
            [
                527,
                590
            ],
            [
                596,
                619
            ],
            [
                619,
                673
            ],
            [
                679,
                733
            ],
            [
                734,
                755
            ],
            [
                770,
                775
            ],
            [
                775,
                777
            ],
            [
                777,
                815
            ],
            [
                815,
                829
            ],
            [
                830,
                839
            ],
            [
                839,
                841
            ],
            [
                841,
                909
            ],
            [
                909,
                910
            ],
            [
                915,
                933
            ],
            [
                933,
                946
            ],
            [
                952,
                981
            ],
            [
                988,
                1038
            ],
            [
                1038,
                1066
            ],
            [
                1067,
                1093
            ],
            [
                1093,
                1143
            ],
            [
                1144,
                1157
            ],
            [
                1158,
                1167
            ],
            [
                1178,
                1181
            ],
            [
                1182,
                1211
            ],
            [
                1211,
                1334
            ],
            [
                1335,
                1428
            ],
            [
                1429,
                1493
            ],
            [
                1494,
                1528
            ],
            [
                1528,
                1531
            ],
            [
                1532,
                1567
            ],
            [
                1568,
                1584
            ],
            [
                1584,
                1603
            ],
            [
                1604,
                1606
            ],
            [
                1615,
                1634
            ],
            [
                1634,
                1683
            ],
            [
                1684,
                1687
            ],
            [
                1688,
                1721
            ],
            [
                1722,
                1732
            ],
            [
                1737,
                1748
            ],
            [
                1748,
                1773
            ],
            [
                1788,
                1790
            ],
            [
                1797,
                1802
            ],
            [
                1802,
                1827
            ],
            [
                1828,
                1830
            ],
            [
                1831,
                1846
            ],
            [
                1847,
                1851
            ],
            [
                1852,
                1858
            ],
            [
                1859,
                1863
            ],
            [
                1870,
                1877
            ],
            [
                1879,
                1943
            ],
            [
                1943,
                1965
            ],
            [
                1966,
                1977
            ],
            [
                1977,
                1998
            ],
            [
                1998,
                2024
            ],
            [
                2024,
                2028
            ],
            [
                2034,
                2041
            ],
            [
                2050,
                2052
            ],
            [
                2053,
                2073
            ],
            [
                2073,
                2075
            ],
            [
                2075,
                2171
            ],
            [
                2174,
                2177
            ],
            [
                2178,
                2193
            ],
            [
                2194,
                2242
            ],
            [
                2242,
                2311
            ],
            [
                2318,
                2320
            ],
            [
                2320,
                2341
            ],
            [
                2341,
                2366
            ],
            [
                2366,
                2372
            ],
            [
                2386,
                2421
            ],
            [
                2421,
                2443
            ],
            [
                2449,
                2483
            ],
            [
                2483,
                2512
            ],
            [
                2513,
                2564
            ],
            [
                2564,
                2568
            ],
            [
                2569,
                2585
            ],
            [
                2585,
                2638
            ],
            [
                2638,
                2722
            ],
            [
                2723,
                2750
            ],
            [
                2755,
                2772
            ],
            [
                2772,
                2773
            ],
            [
                2774,
                2792
            ],
            [
                2793,
                2796
            ],
            [
                2802,
                2855
            ],
            [
                2861,
                2862
            ],
            [
                2866,
                2871
            ],
            [
                2874,
                2911
            ],
            [
                2921,
                2953
            ],
            [
                2963,
                2966
            ],
            [
                2966,
                2968
            ],
            [
                2975,
                2976
            ],
            [
                2983,
                3031
            ],
            [
                3032,
                3038
            ],
            [
                3039,
                3043
            ],
            [
                3043,
                3087
            ],
            [
                3094,
                3096
            ],
            [
                3096,
                3150
            ],
            [
                3150,
                3163
            ],
            [
                3163,
                3177
            ],
            [
                3200,
                3239
            ],
            [
                3243,
                3253
            ],
            [
                3259,
                3263
            ],
            [
                3264,
                3270
            ],
            [
                3271,
                3382
            ],
            [
                3386,
                3420
            ],
            [
                3429,
                3432
            ],
            [
                3432,
                3501
            ],
            [
                3501,
                3527
            ],
            [
                3527,
                3558
            ],
            [
                3558,
                3629
            ],
            [
                3629,
                3654
            ],
            [
                3654,
                3670
            ],
            [
                3670,
                3684
            ],
            [
                3684,
                3696
            ],
            [
                3699,
                3739
            ],
            [
                3740,
                3757
            ],
            [
                3758,
                3778
            ],
            [
                3778,
                3842
            ],
            [
                3842,
                3862
            ],
            [
                3863,
                3903
            ],
            [
                3904,
                3906
            ],
            [
                3907,
                3915
            ],
            [
                3916,
                3954
            ],
            [
                3954,
                3974
            ],
            [
                3974,
                4031
            ],
            [
                4037,
                4103
            ],
            [
                4115,
                4153
            ],
            [
                4160,
                4182
            ],
            [
                4183,
                4196
            ],
            [
                4197,
                4211
            ],
            [
                4213,
                4215
            ],
            [
                4220,
                4252
            ],
            [
                4255,
                4306
            ],
            [
                4310,
                4324
            ],
            [
                4324,
                4325
            ],
            [
                4326,
                4330
            ],
            [
                4331,
                4334
            ],
            [
                4335,
                4347
            ],
            [
                4348,
                4374
            ],
            [
                4375,
                4403
            ],
            [
                4405,
                4428
            ],
            [
                4429,
                4454
            ],
            [
                4455,
                4477
            ],
            [
                4483,
                4511
            ],
            [
                4519,
                4523
            ],
            [
                4527,
                4533
            ],
            [
                4534,
                4562
            ],
            [
                4563,
                4576
            ],
            [
                4577,
                4593
            ],
            [
                4593,
                4598
            ],
            [
                4598,
                4601
            ],
            [
                4601,
                4617
            ],
            [
                4618,
                4636
            ],
            [
                4637,
                4650
            ],
            [
                4654,
                4658
            ],
            [
                4659,
                4718
            ],
            [
                4718,
                4719
            ],
            [
                4720,
                4816
            ],
            [
                4817,
                4827
            ],
            [
                4828,
                4866
            ],
            [
                4868,
                4880
            ],
            [
                4888,
                4920
            ],
            [
                4921,
                4923
            ],
            [
                4930,
                4950
            ],
            [
                4950,
                4952
            ],
            [
                4952,
                4965
            ],
            [
                4965,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5018
            ],
            [
                5021,
                5070
            ],
            [
                5070,
                5096
            ],
            [
                5096,
                5128
            ],
            [
                5129,
                5156
            ],
            [
                5156,
                5173
            ],
            [
                5173,
                5189
            ],
            [
                5189,
                5198
            ],
            [
                5199,
                5211
            ],
            [
                5215,
                5236
            ],
            [
                5237,
                5243
            ],
            [
                5244,
                5271
            ],
            [
                5271,
                5272
            ],
            [
                5273,
                5319
            ],
            [
                5319,
                5427
            ],
            [
                5427,
                5467
            ],
            [
                5467,
                5469
            ],
            [
                5469,
                5500
            ],
            [
                5500,
                5514
            ],
            [
                5514,
                5516
            ],
            [
                5516,
                5529
            ],
            [
                5536,
                5553
            ],
            [
                5554,
                5560
            ],
            [
                5561,
                5563
            ],
            [
                5563,
                5582
            ],
            [
                5583,
                5640
            ],
            [
                5643,
                5661
            ],
            [
                5661,
                5684
            ],
            [
                5684,
                5686
            ],
            [
                5686,
                5726
            ],
            [
                5726,
                5800
            ],
            [
                5800,
                5865
            ],
            [
                5866,
                5927
            ],
            [
                5929,
                5967
            ],
            [
                5968,
                5983
            ],
            [
                5989,
                5992
            ],
            [
                5993,
                6006
            ],
            [
                6008,
                6038
            ],
            [
                6038,
                6079
            ],
            [
                6079,
                6127
            ],
            [
                6128,
                6167
            ],
            [
                6167,
                6273
            ],
            [
                6274,
                6327
            ],
            [
                6328,
                6331
            ],
            [
                6339,
                6341
            ],
            [
                6351,
                6352
            ],
            [
                6353,
                6397
            ],
            [
                6398,
                6405
            ],
            [
                6406,
                6430
            ],
            [
                6431,
                6442
            ],
            [
                6447,
                6468
            ],
            [
                6468,
                6498
            ],
            [
                6498,
                6500
            ],
            [
                6500,
                6507
            ],
            [
                6516,
                6588
            ],
            [
                6588,
                6688
            ],
            [
                6689,
                6698
            ],
            [
                6699,
                6836
            ],
            [
                6836,
                6849
            ],
            [
                6850,
                6867
            ],
            [
                6868,
                6872
            ],
            [
                6875,
                6880
            ],
            [
                6880,
                6915
            ],
            [
                6927,
                6994
            ],
            [
                6995,
                7039
            ],
            [
                7042,
                7109
            ],
            [
                7109,
                7157
            ],
            [
                7161,
                7162
            ],
            [
                7163,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7365
            ],
            [
                7371,
                7373
            ],
            [
                7373,
                7400
            ],
            [
                7400,
                7462
            ],
            [
                7467,
                7471
            ],
            [
                7472,
                7474
            ],
            [
                7479,
                7483
            ],
            [
                7485,
                7505
            ],
            [
                7511,
                7556
            ],
            [
                7556,
                7558
            ],
            [
                7558,
                7584
            ],
            [
                7585,
                7589
            ],
            [
                7594,
                7673
            ],
            [
                7673,
                7674
            ],
            [
                7682,
                7713
            ],
            [
                7714,
                7749
            ],
            [
                7750,
                7763
            ],
            [
                7764,
                7768
            ],
            [
                7769,
                7810
            ],
            [
                7812,
                7840
            ],
            [
                7841,
                7859
            ],
            [
                7859,
                7860
            ],
            [
                7861,
                7893
            ],
            [
                7894,
                7956
            ],
            [
                7956,
                7977
            ],
            [
                7977,
                8014
            ],
            [
                8015,
                8034
            ],
            [
                8034,
                8035
            ],
            [
                8036,
                8039
            ],
            [
                8040,
                8047
            ],
            [
                8048,
                8064
            ],
            [
                8064,
                8116
            ],
            [
                8117,
                8198
            ],
            [
                8198,
                8224
            ],
            [
                8224,
                8273
            ],
            [
                8274,
                8312
            ],
            [
                8315,
                8329
            ],
            [
                8329,
                8383
            ],
            [
                8383,
                8385
            ],
            [
                8391,
                8499
            ],
            [
                8499,
                8501
            ],
            [
                8501,
                8540
            ],
            [
                8540,
                8542
            ],
            [
                8542,
                8552
            ],
            [
                8553,
                8580
            ],
            [
                8580,
                8650
            ],
            [
                8650,
                8701
            ],
            [
                8701,
                8745
            ],
            [
                8745,
                8793
            ],
            [
                8793,
                8817
            ],
            [
                8817,
                8896
            ],
            [
                8896,
                8943
            ],
            [
                8945,
                9024
            ],
            [
                9024,
                9069
            ],
            [
                9074,
                9105
            ],
            [
                9105,
                9159
            ],
            [
                9160,
                9175
            ],
            [
                9175,
                9225
            ],
            [
                9225,
                9265
            ],
            [
                9265,
                9268
            ],
            [
                9270,
                9299
            ],
            [
                9299,
                9342
            ],
            [
                9342,
                9383
            ],
            [
                9389,
                9425
            ],
            [
                9434,
                9440
            ],
            [
                9446,
                9492
            ],
            [
                9493,
                9514
            ],
            [
                9515,
                9541
            ],
            [
                9542,
                9553
            ],
            [
                9554,
                9661
            ],
            [
                9662,
                9665
            ],
            [
                9673,
                9674
            ],
            [
                9675,
                9732
            ],
            [
                9732,
                9761
            ],
            [
                9762,
                9772
            ],
            [
                9772,
                9795
            ],
            [
                9796,
                9806
            ],
            [
                9807,
                9828
            ],
            [
                9828,
                9829
            ],
            [
                9830,
                9857
            ],
            [
                9857,
                9858
            ],
            [
                9859,
                9862
            ],
            [
                9863,
                9887
            ],
            [
                9888,
                9903
            ],
            [
                9904,
                9908
            ],
            [
                9908,
                9909
            ],
            [
                9910,
                9927
            ],
            [
                9928,
                10010
            ],
            [
                10010,
                10045
            ],
            [
                10061,
                10062
            ],
            [
                10063,
                10073
            ],
            [
                10081,
                10084
            ],
            [
                10097,
                10099
            ],
            [
                10099,
                10119
            ],
            [
                10119,
                10120
            ],
            [
                10129,
                10140
            ],
            [
                10141,
                10144
            ],
            [
                10145,
                10153
            ],
            [
                10155,
                10193
            ],
            [
                10193,
                10194
            ],
            [
                10195,
                10281
            ],
            [
                10283,
                10308
            ],
            [
                10309,
                10313
            ],
            [
                10314,
                10382
            ],
            [
                10382,
                10388
            ],
            [
                10389,
                10395
            ],
            [
                10395,
                10397
            ],
            [
                10409,
                10412
            ],
            [
                10413,
                10432
            ],
            [
                10433,
                10463
            ],
            [
                10464,
                10472
            ],
            [
                10473,
                10491
            ],
            [
                10491,
                10493
            ],
            [
                10493,
                10536
            ],
            [
                10536,
                10561
            ],
            [
                10573,
                10578
            ],
            [
                10582,
                10583
            ],
            [
                10584,
                10616
            ],
            [
                10617,
                10648
            ],
            [
                10649,
                10655
            ],
            [
                10655,
                10695
            ],
            [
                10696,
                10729
            ],
            [
                10730,
                10737
            ],
            [
                10738,
                10741
            ],
            [
                10742,
                10747
            ],
            [
                10756,
                10761
            ],
            [
                10762,
                10825
            ],
            [
                10825,
                10827
            ],
            [
                10828,
                10847
            ],
            [
                10860,
                10951
            ],
            [
                10951,
                11027
            ],
            [
                11027,
                11052
            ],
            [
                11053,
                11056
            ],
            [
                11057,
                11065
            ],
            [
                11066,
                11082
            ],
            [
                11083,
                11092
            ],
            [
                11092,
                11178
            ],
            [
                11178,
                11239
            ],
            [
                11239,
                11312
            ],
            [
                11312,
                11325
            ],
            [
                11325,
                11327
            ],
            [
                11327,
                11371
            ],
            [
                11371,
                11430
            ],
            [
                11430,
                11444
            ],
            [
                11444,
                11455
            ],
            [
                11455,
                11456
            ],
            [
                11467,
                11504
            ],
            [
                11504,
                11525
            ],
            [
                11525,
                11578
            ],
            [
                11585,
                11601
            ],
            [
                11601,
                11624
            ],
            [
                11624,
                11691
            ],
            [
                11691,
                11712
            ],
            [
                11717,
                11738
            ],
            [
                11738,
                11816
            ],
            [
                11816,
                11822
            ],
            [
                11823,
                11860
            ],
            [
                11860,
                11877
            ],
            [
                11877,
                11893
            ],
            [
                11893,
                11894
            ],
            [
                11895,
                11906
            ],
            [
                11914,
                11917
            ],
            [
                11927,
                11937
            ],
            [
                11938,
                11959
            ],
            [
                11959,
                11960
            ],
            [
                11961,
                11972
            ],
            [
                11977,
                11982
            ],
            [
                11983,
                12016
            ],
            [
                12017,
                12028
            ],
            [
                12029,
                12033
            ],
            [
                12034,
                12077
            ],
            [
                12078,
                12141
            ],
            [
                12142,
                12159
            ],
            [
                12159,
                12182
            ],
            [
                12185,
                12188
            ],
            [
                12189,
                12201
            ],
            [
                12202,
                12249
            ],
            [
                12249,
                12283
            ],
            [
                12288,
                12368
            ],
            [
                12368,
                12393
            ],
            [
                12400,
                12405
            ],
            [
                12406,
                12481
            ],
            [
                12483,
                12498
            ],
            [
                12498,
                12524
            ],
            [
                12524,
                12543
            ],
            [
                12554,
                12640
            ],
            [
                12641,
                12684
            ],
            [
                12684,
                12685
            ],
            [
                12686,
                12813
            ],
            [
                12822,
                12908
            ],
            [
                12914,
                12915
            ],
            [
                12926,
                12928
            ],
            [
                12928,
                12936
            ],
            [
                12937,
                12977
            ],
            [
                12984,
                13015
            ],
            [
                13016,
                13032
            ],
            [
                13039,
                13051
            ],
            [
                13052,
                13055
            ],
            [
                13061,
                13068
            ],
            [
                13069,
                13075
            ],
            [
                13076,
                13142
            ],
            [
                13142,
                13172
            ],
            [
                13173,
                13178
            ],
            [
                13179,
                13234
            ],
            [
                13235,
                13258
            ],
            [
                13259,
                13287
            ],
            [
                13287,
                13383
            ],
            [
                13383,
                13427
            ],
            [
                13428,
                13450
            ],
            [
                13450,
                13451
            ],
            [
                13452,
                13453
            ],
            [
                13453,
                13506
            ],
            [
                13507,
                13539
            ],
            [
                13539,
                13541
            ],
            [
                13541,
                13600
            ],
            [
                13600,
                13633
            ],
            [
                13633,
                13682
            ],
            [
                13682,
                13684
            ],
            [
                13684,
                13717
            ],
            [
                13718,
                13721
            ],
            [
                13721,
                13783
            ],
            [
                13783,
                13785
            ],
            [
                13795,
                13817
            ],
            [
                13825,
                13840
            ],
            [
                13840,
                13841
            ],
            [
                13842,
                13845
            ],
            [
                13846,
                13849
            ],
            [
                13850,
                13854
            ],
            [
                13855,
                13865
            ],
            [
                13869,
                13921
            ],
            [
                13922,
                13944
            ],
            [
                13944,
                13994
            ],
            [
                13997,
                14000
            ],
            [
                14003,
                14013
            ],
            [
                14014,
                14043
            ],
            [
                14044,
                14062
            ],
            [
                14066,
                14072
            ],
            [
                14072,
                14074
            ],
            [
                14074,
                14115
            ],
            [
                14121,
                14192
            ],
            [
                14202,
                14211
            ],
            [
                14211,
                14269
            ],
            [
                14275,
                14319
            ],
            [
                14320,
                14322
            ],
            [
                14333,
                14371
            ],
            [
                14378,
                14379
            ],
            [
                14380,
                14469
            ],
            [
                14469,
                14471
            ],
            [
                14471,
                14530
            ],
            [
                14536,
                14631
            ],
            [
                14632,
                14664
            ],
            [
                14664,
                14724
            ],
            [
                14726,
                14729
            ],
            [
                14740,
                14760
            ],
            [
                14761,
                14834
            ],
            [
                14834,
                14948
            ]
        ],
        "row_chars": [
            [
                0,
                141
            ],
            [
                141,
                317
            ],
            [
                317,
                619
            ],
            [
                619,
                777
            ],
            [
                777,
                815
            ],
            [
                815,
                841
            ],
            [
                841,
                909
            ],
            [
                909,
                933
            ],
            [
                933,
                1038
            ],
            [
                1038,
                1211
            ],
            [
                1211,
                1335
            ],
            [
                1335,
                1528
            ],
            [
                1528,
                1584
            ],
            [
                1584,
                1634
            ],
            [
                1634,
                1748
            ],
            [
                1748,
                1977
            ],
            [
                1977,
                1998
            ],
            [
                1998,
                1998
            ],
            [
                1998,
                2024
            ],
            [
                2024,
                2075
            ],
            [
                2075,
                2171
            ],
            [
                2171,
                2242
            ],
            [
                2242,
                2320
            ],
            [
                2320,
                2341
            ],
            [
                2341,
                2366
            ],
            [
                2366,
                2421
            ],
            [
                2421,
                2421
            ],
            [
                2421,
                2483
            ],
            [
                2483,
                2564
            ],
            [
                2564,
                2564
            ],
            [
                2564,
                2585
            ],
            [
                2585,
                2638
            ],
            [
                2638,
                2750
            ],
            [
                2750,
                2855
            ],
            [
                2855,
                2968
            ],
            [
                2968,
                2968
            ],
            [
                2968,
                3096
            ],
            [
                3096,
                3150
            ],
            [
                3150,
                3163
            ],
            [
                3163,
                3385
            ],
            [
                3385,
                3385
            ],
            [
                3385,
                3385
            ],
            [
                3385,
                3432
            ],
            [
                3432,
                3501
            ],
            [
                3501,
                3527
            ],
            [
                3527,
                3558
            ],
            [
                3558,
                3629
            ],
            [
                3629,
                3654
            ],
            [
                3654,
                3670
            ],
            [
                3670,
                3684
            ],
            [
                3684,
                3842
            ],
            [
                3842,
                3954
            ],
            [
                3954,
                4252
            ],
            [
                4252,
                4252
            ],
            [
                4252,
                4252
            ],
            [
                4252,
                4455
            ],
            [
                4455,
                4563
            ],
            [
                4563,
                4601
            ],
            [
                4601,
                4659
            ],
            [
                4659,
                4952
            ],
            [
                4952,
                4968
            ],
            [
                4968,
                5009
            ],
            [
                5009,
                5070
            ],
            [
                5070,
                5096
            ],
            [
                5096,
                5156
            ],
            [
                5156,
                5173
            ],
            [
                5173,
                5319
            ],
            [
                5319,
                5427
            ],
            [
                5427,
                5469
            ],
            [
                5469,
                5500
            ],
            [
                5500,
                5516
            ],
            [
                5516,
                5516
            ],
            [
                5516,
                5643
            ],
            [
                5643,
                5661
            ],
            [
                5661,
                5686
            ],
            [
                5686,
                5726
            ],
            [
                5726,
                5968
            ],
            [
                5968,
                5968
            ],
            [
                5968,
                6008
            ],
            [
                6008,
                6038
            ],
            [
                6038,
                6079
            ],
            [
                6079,
                6167
            ],
            [
                6167,
                6468
            ],
            [
                6468,
                6500
            ],
            [
                6500,
                6588
            ],
            [
                6588,
                6689
            ],
            [
                6689,
                6836
            ],
            [
                6836,
                7109
            ],
            [
                7109,
                7163
            ],
            [
                7163,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7373
            ],
            [
                7373,
                7400
            ],
            [
                7400,
                7485
            ],
            [
                7485,
                7558
            ],
            [
                7558,
                7750
            ],
            [
                7750,
                7956
            ],
            [
                7956,
                8064
            ],
            [
                8064,
                8198
            ],
            [
                8198,
                8329
            ],
            [
                8329,
                8383
            ],
            [
                8383,
                8501
            ],
            [
                8501,
                8542
            ],
            [
                8542,
                8542
            ],
            [
                8542,
                8580
            ],
            [
                8580,
                8650
            ],
            [
                8650,
                8701
            ],
            [
                8701,
                8745
            ],
            [
                8745,
                8793
            ],
            [
                8793,
                8793
            ],
            [
                8793,
                8817
            ],
            [
                8817,
                8896
            ],
            [
                8896,
                9024
            ],
            [
                9024,
                9105
            ],
            [
                9105,
                9175
            ],
            [
                9175,
                9225
            ],
            [
                9225,
                9265
            ],
            [
                9265,
                9299
            ],
            [
                9299,
                9342
            ],
            [
                9342,
                9383
            ],
            [
                9383,
                9554
            ],
            [
                9554,
                9675
            ],
            [
                9675,
                9675
            ],
            [
                9675,
                9675
            ],
            [
                9675,
                9732
            ],
            [
                9732,
                9772
            ],
            [
                9772,
                9910
            ],
            [
                9910,
                10010
            ],
            [
                10010,
                10099
            ],
            [
                10099,
                10195
            ],
            [
                10195,
                10382
            ],
            [
                10382,
                10493
            ],
            [
                10493,
                10493
            ],
            [
                10493,
                10493
            ],
            [
                10493,
                10536
            ],
            [
                10536,
                10655
            ],
            [
                10655,
                10825
            ],
            [
                10825,
                11027
            ],
            [
                11027,
                11027
            ],
            [
                11027,
                11027
            ],
            [
                11027,
                11027
            ],
            [
                11027,
                11027
            ],
            [
                11027,
                11178
            ],
            [
                11178,
                11239
            ],
            [
                11239,
                11312
            ],
            [
                11312,
                11327
            ],
            [
                11327,
                11371
            ],
            [
                11371,
                11430
            ],
            [
                11430,
                11444
            ],
            [
                11444,
                11455
            ],
            [
                11455,
                11504
            ],
            [
                11504,
                11525
            ],
            [
                11525,
                11601
            ],
            [
                11601,
                11624
            ],
            [
                11624,
                11691
            ],
            [
                11691,
                11712
            ],
            [
                11712,
                11738
            ],
            [
                11738,
                11816
            ],
            [
                11816,
                11860
            ],
            [
                11860,
                11877
            ],
            [
                11877,
                12078
            ],
            [
                12078,
                12159
            ],
            [
                12159,
                12249
            ],
            [
                12249,
                12368
            ],
            [
                12368,
                12524
            ],
            [
                12524,
                12554
            ],
            [
                12554,
                12928
            ],
            [
                12928,
                13142
            ],
            [
                13142,
                13287
            ],
            [
                13287,
                13383
            ],
            [
                13383,
                13541
            ],
            [
                13541,
                13600
            ],
            [
                13600,
                13633
            ],
            [
                13633,
                13684
            ],
            [
                13684,
                13785
            ],
            [
                13785,
                13865
            ],
            [
                13865,
                13944
            ],
            [
                13944,
                13994
            ],
            [
                13994,
                14074
            ],
            [
                14074,
                14211
            ],
            [
                14211,
                14380
            ],
            [
                14380,
                14471
            ],
            [
                14471,
                14664
            ],
            [
                14664,
                14834
            ],
            [
                14834,
                14948
            ]
        ]
    }
}