{
    "original": {
        "text": "Friend Rawdon drove on then to Mr. Moss's mansion in Cursitor Street, and was duly inducted into that dismal place of hospitality. Morning was breaking over the cheerful house-tops of Chancery Lane as the rattling cab woke up the echoes there. A little pink-eyed Jew-boy, with a head as ruddy as the rising morn, let the party into the house, and Rawdon was welcomed to the ground-floor apartments by Mr. Moss, his travelling companion and host, who cheerfully asked him if he would like a glass of something warm after his drive.\nThe Colonel was not so depressed as some mortals would be, who, quitting a palace and a placens uxor, find themselves barred into a spunging-house; for, if the truth must be told, he had been a lodger at Mr. Moss's establishment once or twice before. We have not thought it necessary in the previous course of this narrative to mention these trivial little domestic incidents: but the reader may be assured that they can't unfrequently occur in the life of a man who lives on nothing a year.\nUpon his first visit to Mr. Moss, the Colonel, then a bachelor, had been liberated by the generosity of his aunt; on the second mishap, little Becky, with the greatest spirit and kindness, had borrowed a sum of money from Lord Southdown and had coaxed her husband's creditor (who was her shawl, velvet-gown, lace pocket-handkerchief, trinket, and gim-crack purveyor, indeed) to take a portion of the sum claimed and Rawdon's promissory note for the remainder: so on both these occasions the capture and release had been conducted with the utmost gallantry on all sides, and Moss and the Colonel were therefore on the very best of terms.\n\"You'll find your old bed, Colonel, and everything comfortable,\" that gentleman said, \"as I may honestly say. You may be pretty sure its kep aired, and by the best of company, too. It was slep in the night afore last by the Honorable Capting Famish, of the Fiftieth Dragoons, whose Mar took him out, after a fortnight, jest to punish him, she said. But, Law bless you, I promise you, he punished my champagne, and had a party ere every night--reglar tip-top swells, down from the clubs and the West End--Capting Ragg, the Honorable Deuceace, who lives in the Temple, and some fellers as knows a good glass of wine, I warrant you. I've got a Doctor of Diwinity upstairs, five gents in the coffee-room, and Mrs. Moss has a tably-dy-hoty at half-past five, and a little cards or music afterwards, when we shall be most happy to see you.\"\n\"I'll ring when I want anything,\" said Rawdon and went quietly to his bedroom. He was an old soldier, we have said, and not to be disturbed by any little shocks of fate. A weaker man would have sent off a letter to his wife on the instant of his capture. \"But what is the use of disturbing her night's rest?\" thought Rawdon. \"She won't know whether I am in my room or not. It will be time enough to write to her when she has had her sleep out, and I have had mine. It's only a hundred-and-seventy, and the deuce is in it if we can't raise that.\" And so, thinking about little Rawdon (whom he would not have know that he was in such a queer place), the Colonel turned into the bed lately occupied by Captain Famish and fell asleep. It was ten o'clock when he woke up, and the ruddy-headed youth brought him, with conscious pride, a fine silver dressing-case, wherewith he might perform the operation of shaving. Indeed Mr. Moss's house, though somewhat dirty, was splendid throughout. There were dirty trays, and wine-coolers en permanence on the sideboard, huge dirty gilt cornices, with dingy yellow satin hangings to the barred windows which looked into Cursitor Street--vast and dirty gilt picture frames surrounding pieces sporting and sacred, all of which works were by the greatest masters--and fetched the greatest prices, too, in the bill transactions, in the course of which they were sold and bought over and over again. The Colonel's breakfast was served to him in the same dingy and gorgeous plated ware. Miss Moss, a dark-eyed maid in curl-papers, appeared with the teapot, and, smiling, asked the Colonel how he had slep? And she brought him in the Morning Post, with the names of all the great people who had figured at Lord Steyne's entertainment the night before. It contained a brilliant account of the festivities and of the beautiful and accomplished Mrs. Rawdon Crawley's admirable personifications.\nAfter a lively chat with this lady (who sat on the edge of the breakfast table in an easy attitude displaying the drapery of her stocking and an ex-white satin shoe, which was down at heel), Colonel Crawley called for pens and ink, and paper, and being asked how many sheets, chose one which was brought to him between Miss Moss's own finger and thumb. Many a sheet had that dark-eyed damsel brought in; many a poor fellow had scrawled and blotted hurried lines of entreaty and paced up and down that awful room until his messenger brought back the reply. Poor men always use messengers instead of the post. Who has not had their letters, with the wafers wet, and the announcement that a person is waiting in the hall?\nNow on the score of his application, Rawdon had not many misgivings.\nDEAR BECKY, (Rawdon wrote)\nI HOPE YOU SLEPT WELL. Don't be FRIGHTENED if I don't bring you in your COFFY. Last night as I was coming home smoaking, I met with an ACCADENT. I was NABBED by Moss of Cursitor Street--from whose GILT AND SPLENDID PARLER I write this--the same that had me this time two years. Miss Moss brought in my tea--she is grown very FAT, and, as usual, had her STOCKENS DOWN AT HEAL.\nIt's Nathan's business--a hundred-and-fifty--with costs, hundred-and-seventy. Please send me my desk and some CLOTHS--I'm in pumps and a white tye (something like Miss M's stockings)--I've seventy in it. And as soon as you get this, Drive to Nathan's--offer him seventy-five down, and ASK HIM TO RENEW--say I'll take wine--we may as well have some dinner sherry; but not PICTURS, they're too dear.\nIf he won't stand it. Take my ticker and such of your things as you can SPARE, and send them to Balls--we must, of coarse, have the sum to-night. It won't do to let it stand over, as to-morrow's Sunday; the beds here are not very CLEAN, and there may be other things out against me--I'm glad it an't Rawdon's Saturday for coming home. God bless you.\nYours in haste, R. C. P.S. Make haste and come.\nThis letter, sealed with a wafer, was dispatched by one of the messengers who are always hanging about Mr. Moss's establishment, and Rawdon, having seen him depart, went out in the court-yard and smoked his cigar with a tolerably easy mind--in spite of the bars overhead--for Mr. Moss's court-yard is railed in like a cage, lest the gentlemen who are boarding with him should take a fancy to escape from his hospitality.\nThree hours, he calculated, would be the utmost time required, before Becky should arrive and open his prison doors, and he passed these pretty cheerfully in smoking, in reading the paper, and in the coffee-room with an acquaintance, Captain Walker, who happened to be there, and with whom he cut for sixpences for some hours, with pretty equal luck on either side.\nBut the day passed away and no messenger returned--no Becky. Mr. Moss's tably-dy-hoty was served at the appointed hour of half-past five, when such of the gentlemen lodging in the house as could afford to pay for the banquet came and partook of it in the splendid front parlour before described, and with which Mr. Crawley's temporary lodging communicated, when Miss M. (Miss Hem, as her papa called her) appeared without the curl-papers of the morning, and Mrs. Hem did the honours of a prime boiled leg of mutton and turnips, of which the Colonel ate with a very faint appetite. Asked whether he would \"stand\" a bottle of champagne for the company, he consented, and the ladies drank to his 'ealth, and Mr. Moss, in the most polite manner, \"looked towards him.\"\nIn the midst of this repast, however, the doorbell was heard--young Moss of the ruddy hair rose up with the keys and answered the summons, and coming back, told the Colonel that the messenger had returned with a bag, a desk and a letter, which he gave him. \"No ceramony, Colonel, I beg,\" said Mrs. Moss with a wave of her hand, and he opened the letter rather tremulously. It was a beautiful letter, highly scented, on a pink paper, and with a light green seal.\nMON PAUVRE CHER PETIT, (Mrs. Crawley wrote)\nI could not sleep ONE WINK for thinking of what had become of my odious old monstre, and only got to rest in the morning after sending for Mr. Blench (for I was in a fever), who gave me a composing draught and left orders with Finette that I should be disturbed ON NO ACCOUNT. So that my poor old man's messenger, who had bien mauvaise mine Finette says, and sentoit le Genievre, remained in the hall for some hours waiting my bell. You may fancy my state when I read your poor dear old ill-spelt letter.\nIll as I was, I instantly called for the carriage, and as soon as I was dressed (though I couldn't drink a drop of chocolate--I assure you I couldn't without my monstre to bring it to me), I drove ventre a terre to Nathan's. I saw him--I wept--I cried--I fell at his odious knees. Nothing would mollify the horrid man. He would have all the money, he said, or keep my poor monstre in prison. I drove home with the intention of paying that triste visite chez mon oncle (when every trinket I have should be at your disposal though they would not fetch a hundred pounds, for some, you know, are with ce cher oncle already), and found Milor there with the Bulgarian old sheep-faced monster, who had come to compliment me upon last night's performances. Paddington came in, too, drawling and lisping and twiddling his hair; so did Champignac, and his chef--everybody with foison of compliments and pretty speeches--plaguing poor me, who longed to be rid of them, and was thinking every moment of the time of mon pauvre prisonnier.\nWhen they were gone, I went down on my knees to Milor; told him we were going to pawn everything, and begged and prayed him to give me two hundred pounds. He pish'd and psha'd in a fury--told me not to be such a fool as to pawn--and said he would see whether he could lend me the money. At last he went away, promising that he would send it me in the morning: when I will bring it to my poor old monster with a kiss from his affectionate\nBECKY\nI am writing in bed. Oh I have such a headache and such a heartache!\nWhen Rawdon read over this letter, he turned so red and looked so savage that the company at the table d'hote easily perceived that bad news had reached him. All his suspicions, which he had been trying to banish, returned upon him. She could not even go out and sell her trinkets to free him. She could laugh and talk about compliments paid to her, whilst he was in prison. Who had put him there? Wenham had walked with him. Was there.... He could hardly bear to think of what he suspected. Leaving the room hurriedly, he ran into his own--opened his desk, wrote two hurried lines, which he directed to Sir Pitt or Lady Crawley, and bade the messenger carry them at once to Gaunt Street, bidding him to take a cab, and promising him a guinea if he was back in an hour.\nIn the note he besought his dear brother and sister, for the sake of God, for the sake of his dear child and his honour, to come to him and relieve him from his difficulty. He was in prison, he wanted a hundred pounds to set him free--he entreated them to come to him.\nHe went back to the dining-room after dispatching his messenger and called for more wine. He laughed and talked with a strange boisterousness, as the people thought. Sometimes he laughed madly at his own fears and went on drinking for an hour, listening all the while for the carriage which was to bring his fate back.\nAt the expiration of that time, wheels were heard whirling up to the gate--the young janitor went out with his gate-keys. It was a lady whom he let in at the bailiff's door.\n\"Colonel Crawley,\" she said, trembling very much. He, with a knowing look, locked the outer door upon her--then unlocked and opened the inner one, and calling out, \"Colonel, you're wanted,\" led her into the back parlour, which he occupied.\nRawdon came in from the dining-parlour where all those people were carousing, into his back room; a flare of coarse light following him into the apartment where the lady stood, still very nervous.\n\"It is I, Rawdon,\" she said in a timid voice, which she strove to render cheerful. \"It is Jane.\" Rawdon was quite overcome by that kind voice and presence. He ran up to her--caught her in his arms--gasped out some inarticulate words of thanks and fairly sobbed on her shoulder. She did not know the cause of his emotion.\nThe bills of Mr. Moss were quickly settled, perhaps to the disappointment of that gentleman, who had counted on having the Colonel as his guest over Sunday at least; and Jane, with beaming smiles and happiness in her eyes, carried away Rawdon from the bailiff's house, and they went homewards in the cab in which she had hastened to his release. \"Pitt was gone to a parliamentary dinner,\" she said, \"when Rawdon's note came, and so, dear Rawdon, I--I came myself\"; and she put her kind hand in his. Perhaps it was well for Rawdon Crawley that Pitt was away at that dinner. Rawdon thanked his sister a hundred times, and with an ardour of gratitude which touched and almost alarmed that soft-hearted woman. \"Oh,\" said he, in his rude, artless way, \"you--you don't know how I'm changed since I've known you, and--and little Rawdy. I--I'd like to change somehow. You see I want--I want--to be--\" He did not finish the sentence, but she could interpret it. And that night after he left her, and as she sat by her own little boy's bed, she prayed humbly for that poor way-worn sinner.\nRawdon left her and walked home rapidly. It was nine o'clock at night. He ran across the streets and the great squares of Vanity Fair, and at length came up breathless opposite his own house. He started back and fell against the railings, trembling as he looked up. The drawing-room windows were blazing with light. She had said that she was in bed and ill. He stood there for some time, the light from the rooms on his pale face.\nHe took out his door-key and let himself into the house. He could hear laughter in the upper rooms. He was in the ball-dress in which he had been captured the night before. He went silently up the stairs, leaning against the banisters at the stair-head. Nobody was stirring in the house besides--all the servants had been sent away. Rawdon heard laughter within--laughter and singing. Becky was singing a snatch of the song of the night before; a hoarse voice shouted \"Brava! Brava!\"--it was Lord Steyne's.\nRawdon opened the door and went in. A little table with a dinner was laid out--and wine and plate. Steyne was hanging over the sofa on which Becky sat. The wretched woman was in a brilliant full toilette, her arms and all her fingers sparkling with bracelets and rings, and the brilliants on her breast which Steyne had given her. He had her hand in his, and was bowing over it to kiss it, when Becky started up with a faint scream as she caught sight of Rawdon's white face. At the next instant she tried a smile, a horrid smile, as if to welcome her husband; and Steyne rose up, grinding his teeth, pale, and with fury in his looks.\nHe, too, attempted a laugh--and came forward holding out his hand. \"What, come back! How d'ye do, Crawley?\" he said, the nerves of his mouth twitching as he tried to grin at the intruder.\nThere was that in Rawdon's face which caused Becky to fling herself before him. \"I am innocent, Rawdon,\" she said; \"before God, I am innocent.\" She clung hold of his coat, of his hands; her own were all covered with serpents, and rings, and baubles. \"I am innocent. Say I am innocent,\" she said to Lord Steyne.\nHe thought a trap had been laid for him, and was as furious with the wife as with the husband. \"You innocent! Damn you,\" he screamed out. \"You innocent! Why every trinket you have on your body is paid for by me. I have given you thousands of pounds, which this fellow has spent and for which he has sold you. Innocent, by ----! You're as innocent as your mother, the ballet-girl, and your husband the bully. Don't think to frighten me as you have done others. Make way, sir, and let me pass\"; and Lord Steyne seized up his hat, and, with flame in his eyes, and looking his enemy fiercely in the face, marched upon him, never for a moment doubting that the other would give way.\nBut Rawdon Crawley springing out, seized him by the neckcloth, until Steyne, almost strangled, writhed and bent under his arm. \"You lie, you dog!\" said Rawdon. \"You lie, you coward and villain!\" And he struck the Peer twice over the face with his open hand and flung him bleeding to the ground. It was all done before Rebecca could interpose. She stood there trembling before him. She admired her husband, strong, brave, and victorious.\n\"Come here,\" he said. She came up at once.\n\"Take off those things.\" She began, trembling, pulling the jewels from her arms, and the rings from her shaking fingers, and held them all in a heap, quivering and looking up at him. \"Throw them down,\" he said, and she dropped them. He tore the diamond ornament out of her breast and flung it at Lord Steyne. It cut him on his bald forehead. Steyne wore the scar to his dying day.\n\"Come upstairs,\" Rawdon said to his wife. \"Don't kill me, Rawdon,\" she said. He laughed savagely. \"I want to see if that man lies about the money as he has about me. Has he given you any?\"\n\"No,\" said Rebecca, \"that is--\"\n\"Give me your keys,\" Rawdon answered, and they went out together.\nRebecca gave him all the keys but one, and she was in hopes that he would not have remarked the absence of that. It belonged to the little desk which Amelia had given her in early days, and which she kept in a secret place. But Rawdon flung open boxes and wardrobes, throwing the multifarious trumpery of their contents here and there, and at last he found the desk. The woman was forced to open it. It contained papers, love-letters many years old--all sorts of small trinkets and woman's memoranda. And it contained a pocket-book with bank-notes. Some of these were dated ten years back, too, and one was quite a fresh one--a note for a thousand pounds which Lord Steyne had given her.\n\"Did he give you this?\" Rawdon said.\n\"Yes,\" Rebecca answered.\n\"I'll send it to him to-day,\" Rawdon said (for day had dawned again, and many hours had passed in this search), \"and I will pay Briggs, who was kind to the boy, and some of the debts. You will let me know where I shall send the rest to you. You might have spared me a hundred pounds, Becky, out of all this--I have always shared with you.\"\n\"I am innocent,\" said Becky. And he left her without another word.\nWhat were her thoughts when he left her? She remained for hours after he was gone, the sunshine pouring into the room, and Rebecca sitting alone on the bed's edge. The drawers were all opened and their contents scattered about--dresses and feathers, scarfs and trinkets, a heap of tumbled vanities lying in a wreck. Her hair was falling over her shoulders; her gown was torn where Rawdon had wrenched the brilliants out of it. She heard him go downstairs a few minutes after he left her, and the door slamming and closing on him. She knew he would never come back. He was gone forever. Would he kill himself?--she thought--not until after he had met Lord Steyne. She thought of her long past life, and all the dismal incidents of it. Ah, how dreary it seemed, how miserable, lonely and profitless! Should she take laudanum, and end it, to have done with all hopes, schemes, debts, and triumphs? The French maid found her in this position--sitting in the midst of her miserable ruins with clasped hands and dry eyes. The woman was her accomplice and in Steyne's pay. \"Mon Dieu, madame, what has happened?\" she asked.\nWhat had happened? Was she guilty or not? She said not, but who could tell what was truth which came from those lips, or if that corrupt heart was in this case pure?\nAll her lies and her schemes, and her selfishness and her wiles, all her wit and genius had come to this bankruptcy. The woman closed the curtains and, with some entreaty and show of kindness, persuaded her mistress to lie down on the bed. Then she went below and gathered up the trinkets which had been lying on the floor since Rebecca dropped them there at her husband's orders, and Lord Steyne went away.",
        "paragraph_chars": [
            [
                0,
                531
            ],
            [
                531,
                1023
            ],
            [
                1023,
                1660
            ],
            [
                1660,
                2495
            ],
            [
                2495,
                4416
            ],
            [
                4416,
                5135
            ],
            [
                5135,
                5204
            ],
            [
                5204,
                5231
            ],
            [
                5231,
                5607
            ],
            [
                5607,
                6005
            ],
            [
                6005,
                6355
            ],
            [
                6355,
                6403
            ],
            [
                6403,
                6824
            ],
            [
                6824,
                7190
            ],
            [
                7190,
                7954
            ],
            [
                7954,
                8416
            ],
            [
                8416,
                8460
            ],
            [
                8460,
                8965
            ],
            [
                8965,
                9991
            ],
            [
                9991,
                10429
            ],
            [
                10429,
                10435
            ],
            [
                10435,
                10504
            ],
            [
                10504,
                11274
            ],
            [
                11274,
                11543
            ],
            [
                11543,
                11862
            ],
            [
                11862,
                12036
            ],
            [
                12036,
                12276
            ],
            [
                12276,
                12473
            ],
            [
                12473,
                12794
            ],
            [
                12794,
                13874
            ],
            [
                13874,
                14305
            ],
            [
                14305,
                14812
            ],
            [
                14812,
                15447
            ],
            [
                15447,
                15635
            ],
            [
                15635,
                15946
            ],
            [
                15946,
                16624
            ],
            [
                16624,
                17061
            ],
            [
                17061,
                17104
            ],
            [
                17104,
                17485
            ],
            [
                17485,
                17674
            ],
            [
                17674,
                17706
            ],
            [
                17706,
                17772
            ],
            [
                17772,
                18460
            ],
            [
                18460,
                18497
            ],
            [
                18497,
                18522
            ],
            [
                18522,
                18862
            ],
            [
                18862,
                18929
            ],
            [
                18929,
                20045
            ],
            [
                20045,
                20211
            ],
            [
                20211,
                20618
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                244
            ],
            [
                244,
                531
            ],
            [
                531,
                782
            ],
            [
                782,
                1023
            ],
            [
                1023,
                1660
            ],
            [
                1660,
                1770
            ],
            [
                1770,
                1841
            ],
            [
                1841,
                2009
            ],
            [
                2009,
                2290
            ],
            [
                2290,
                2495
            ],
            [
                2495,
                2574
            ],
            [
                2574,
                2665
            ],
            [
                2665,
                2750
            ],
            [
                2750,
                2804
            ],
            [
                2804,
                2820
            ],
            [
                2820,
                2868
            ],
            [
                2868,
                2960
            ],
            [
                2960,
                3041
            ],
            [
                3041,
                3226
            ],
            [
                3226,
                3406
            ],
            [
                3406,
                3479
            ],
            [
                3479,
                3926
            ],
            [
                3926,
                4012
            ],
            [
                4012,
                4131
            ],
            [
                4131,
                4276
            ],
            [
                4276,
                4416
            ],
            [
                4416,
                4769
            ],
            [
                4769,
                4972
            ],
            [
                4972,
                5024
            ],
            [
                5024,
                5135
            ],
            [
                5135,
                5204
            ],
            [
                5204,
                5231
            ],
            [
                5231,
                5254
            ],
            [
                5254,
                5310
            ],
            [
                5310,
                5376
            ],
            [
                5376,
                5509
            ],
            [
                5509,
                5607
            ],
            [
                5607,
                5685
            ],
            [
                5685,
                5811
            ],
            [
                5811,
                6005
            ],
            [
                6005,
                6027
            ],
            [
                6027,
                6151
            ],
            [
                6151,
                6340
            ],
            [
                6340,
                6355
            ],
            [
                6355,
                6403
            ],
            [
                6403,
                6824
            ],
            [
                6824,
                7190
            ],
            [
                7190,
                7251
            ],
            [
                7251,
                7771
            ],
            [
                7771,
                7954
            ],
            [
                7954,
                8211
            ],
            [
                8211,
                8327
            ],
            [
                8327,
                8416
            ],
            [
                8416,
                8460
            ],
            [
                8460,
                8737
            ],
            [
                8737,
                8893
            ],
            [
                8893,
                8965
            ],
            [
                8965,
                9190
            ],
            [
                9190,
                9246
            ],
            [
                9246,
                9284
            ],
            [
                9284,
                9357
            ],
            [
                9357,
                9714
            ],
            [
                9714,
                9991
            ],
            [
                9991,
                10146
            ],
            [
                10146,
                10278
            ],
            [
                10278,
                10429
            ],
            [
                10429,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10504
            ],
            [
                10504,
                10662
            ],
            [
                10662,
                10737
            ],
            [
                10737,
                10798
            ],
            [
                10798,
                10879
            ],
            [
                10879,
                10902
            ],
            [
                10902,
                10930
            ],
            [
                10930,
                10944
            ],
            [
                10944,
                10996
            ],
            [
                10996,
                11274
            ],
            [
                11274,
                11447
            ],
            [
                11447,
                11543
            ],
            [
                11543,
                11633
            ],
            [
                11633,
                11709
            ],
            [
                11709,
                11862
            ],
            [
                11862,
                11984
            ],
            [
                11984,
                12036
            ],
            [
                12036,
                12086
            ],
            [
                12086,
                12276
            ],
            [
                12276,
                12473
            ],
            [
                12473,
                12556
            ],
            [
                12556,
                12570
            ],
            [
                12570,
                12629
            ],
            [
                12629,
                12751
            ],
            [
                12751,
                12794
            ],
            [
                12794,
                13140
            ],
            [
                13140,
                13293
            ],
            [
                13293,
                13367
            ],
            [
                13367,
                13500
            ],
            [
                13500,
                13623
            ],
            [
                13623,
                13654
            ],
            [
                13654,
                13747
            ],
            [
                13747,
                13874
            ],
            [
                13874,
                13915
            ],
            [
                13915,
                13945
            ],
            [
                13945,
                14066
            ],
            [
                14066,
                14140
            ],
            [
                14140,
                14190
            ],
            [
                14190,
                14232
            ],
            [
                14232,
                14305
            ],
            [
                14305,
                14362
            ],
            [
                14362,
                14405
            ],
            [
                14405,
                14478
            ],
            [
                14478,
                14559
            ],
            [
                14559,
                14638
            ],
            [
                14638,
                14690
            ],
            [
                14690,
                14781
            ],
            [
                14781,
                14788
            ],
            [
                14788,
                14812
            ],
            [
                14812,
                14848
            ],
            [
                14848,
                14911
            ],
            [
                14911,
                14964
            ],
            [
                14964,
                15143
            ],
            [
                15143,
                15288
            ],
            [
                15288,
                15447
            ],
            [
                15447,
                15514
            ],
            [
                15514,
                15532
            ],
            [
                15532,
                15555
            ],
            [
                15555,
                15635
            ],
            [
                15635,
                15715
            ],
            [
                15715,
                15779
            ],
            [
                15779,
                15885
            ],
            [
                15885,
                15901
            ],
            [
                15901,
                15946
            ],
            [
                15946,
                16041
            ],
            [
                16041,
                16056
            ],
            [
                16056,
                16084
            ],
            [
                16084,
                16099
            ],
            [
                16099,
                16158
            ],
            [
                16158,
                16255
            ],
            [
                16255,
                16274
            ],
            [
                16274,
                16354
            ],
            [
                16354,
                16406
            ],
            [
                16406,
                16624
            ],
            [
                16624,
                16751
            ],
            [
                16751,
                16771
            ],
            [
                16771,
                16784
            ],
            [
                16784,
                16819
            ],
            [
                16819,
                16919
            ],
            [
                16919,
                16967
            ],
            [
                16967,
                17005
            ],
            [
                17005,
                17061
            ],
            [
                17061,
                17083
            ],
            [
                17083,
                17104
            ],
            [
                17104,
                17129
            ],
            [
                17129,
                17287
            ],
            [
                17287,
                17337
            ],
            [
                17337,
                17413
            ],
            [
                17413,
                17446
            ],
            [
                17446,
                17485
            ],
            [
                17485,
                17527
            ],
            [
                17527,
                17562
            ],
            [
                17562,
                17583
            ],
            [
                17583,
                17651
            ],
            [
                17651,
                17674
            ],
            [
                17674,
                17706
            ],
            [
                17706,
                17772
            ],
            [
                17772,
                17885
            ],
            [
                17885,
                17996
            ],
            [
                17996,
                18139
            ],
            [
                18139,
                18172
            ],
            [
                18172,
                18273
            ],
            [
                18273,
                18321
            ],
            [
                18321,
                18460
            ],
            [
                18460,
                18484
            ],
            [
                18484,
                18497
            ],
            [
                18497,
                18522
            ],
            [
                18522,
                18706
            ],
            [
                18706,
                18763
            ],
            [
                18763,
                18862
            ],
            [
                18862,
                18891
            ],
            [
                18891,
                18929
            ],
            [
                18929,
                18970
            ],
            [
                18970,
                19093
            ],
            [
                19093,
                19245
            ],
            [
                19245,
                19356
            ],
            [
                19356,
                19459
            ],
            [
                19459,
                19494
            ],
            [
                19494,
                19515
            ],
            [
                19515,
                19592
            ],
            [
                19592,
                19663
            ],
            [
                19663,
                19727
            ],
            [
                19727,
                19824
            ],
            [
                19824,
                19945
            ],
            [
                19945,
                19995
            ],
            [
                19995,
                20034
            ],
            [
                20034,
                20045
            ],
            [
                20045,
                20064
            ],
            [
                20064,
                20087
            ],
            [
                20087,
                20211
            ],
            [
                20211,
                20328
            ],
            [
                20328,
                20451
            ],
            [
                20451,
                20618
            ]
        ],
        "overlap_chars": [
            [
                7,
                22
            ],
            [
                28,
                39
            ],
            [
                39,
                82
            ],
            [
                92,
                114
            ],
            [
                129,
                131
            ],
            [
                131,
                160
            ],
            [
                170,
                244
            ],
            [
                347,
                366
            ],
            [
                398,
                531
            ],
            [
                531,
                571
            ],
            [
                580,
                588
            ],
            [
                633,
                648
            ],
            [
                661,
                677
            ],
            [
                588,
                589
            ],
            [
                702,
                704
            ],
            [
                677,
                682
            ],
            [
                691,
                696
            ],
            [
                709,
                745
            ],
            [
                760,
                782
            ],
            [
                782,
                814
            ],
            [
                856,
                887
            ],
            [
                897,
                911
            ],
            [
                943,
                947
            ],
            [
                967,
                1023
            ],
            [
                1023,
                1095
            ],
            [
                1106,
                1171
            ],
            [
                1212,
                1224
            ],
            [
                1234,
                1316
            ],
            [
                1198,
                1201
            ],
            [
                1324,
                1325
            ],
            [
                1396,
                1405
            ],
            [
                1439,
                1471
            ],
            [
                1483,
                1557
            ],
            [
                1569,
                1660
            ],
            [
                1660,
                1724
            ],
            [
                1740,
                1744
            ],
            [
                1768,
                1770
            ],
            [
                1797,
                1841
            ],
            [
                1841,
                1883
            ],
            [
                1894,
                1934
            ],
            [
                2007,
                2009
            ],
            [
                2290,
                2495
            ],
            [
                2495,
                2540
            ],
            [
                2541,
                2574
            ],
            [
                2574,
                2596
            ],
            [
                2615,
                2624
            ],
            [
                2635,
                2637
            ],
            [
                2642,
                2665
            ],
            [
                2665,
                2688
            ],
            [
                2689,
                2693
            ],
            [
                2698,
                2718
            ],
            [
                2748,
                2749
            ],
            [
                2750,
                2804
            ],
            [
                2804,
                2811
            ],
            [
                2818,
                2820
            ],
            [
                2879,
                2933
            ],
            [
                2958,
                2960
            ],
            [
                2960,
                2991
            ],
            [
                2991,
                3041
            ],
            [
                3041,
                3077
            ],
            [
                3143,
                3225
            ],
            [
                3226,
                3260
            ],
            [
                3283,
                3300
            ],
            [
                3324,
                3352
            ],
            [
                3363,
                3371
            ],
            [
                3404,
                3406
            ],
            [
                3406,
                3479
            ],
            [
                3479,
                3489
            ],
            [
                3557,
                3632
            ],
            [
                3673,
                3702
            ],
            [
                3756,
                3761
            ],
            [
                3767,
                3790
            ],
            [
                3511,
                3512
            ],
            [
                3633,
                3638
            ],
            [
                3884,
                3926
            ],
            [
                3926,
                3970
            ],
            [
                3980,
                3998
            ],
            [
                3999,
                4012
            ],
            [
                4012,
                4131
            ],
            [
                4135,
                4150
            ],
            [
                4154,
                4171
            ],
            [
                4279,
                4311
            ],
            [
                4230,
                4243
            ],
            [
                4316,
                4385
            ],
            [
                4414,
                4416
            ],
            [
                4416,
                4450
            ],
            [
                4580,
                4581
            ],
            [
                4607,
                4642
            ],
            [
                4652,
                4662
            ],
            [
                5187,
                5204
            ],
            [
                5204,
                5215
            ],
            [
                5231,
                5254
            ],
            [
                5254,
                5310
            ],
            [
                5310,
                5376
            ],
            [
                5376,
                5415
            ],
            [
                5467,
                5487
            ],
            [
                5498,
                5507
            ],
            [
                5507,
                5509
            ],
            [
                5509,
                5536
            ],
            [
                5538,
                5564
            ],
            [
                5576,
                5607
            ],
            [
                5607,
                5629
            ],
            [
                5640,
                5641
            ],
            [
                5631,
                5632
            ],
            [
                5664,
                5685
            ],
            [
                5685,
                5699
            ],
            [
                5712,
                5716
            ],
            [
                5708,
                5711
            ],
            [
                5700,
                5707
            ],
            [
                5791,
                5811
            ],
            [
                5811,
                5857
            ],
            [
                5859,
                5908
            ],
            [
                6003,
                6005
            ],
            [
                6005,
                6025
            ],
            [
                6027,
                6045
            ],
            [
                6059,
                6100
            ],
            [
                6025,
                6026
            ],
            [
                6108,
                6151
            ],
            [
                6157,
                6159
            ],
            [
                6166,
                6187
            ],
            [
                6197,
                6286
            ],
            [
                6288,
                6340
            ],
            [
                6340,
                6355
            ],
            [
                6355,
                6376
            ],
            [
                6377,
                6403
            ],
            [
                6403,
                6414
            ],
            [
                6437,
                6440
            ],
            [
                6452,
                6454
            ],
            [
                6428,
                6429
            ],
            [
                6530,
                6572
            ],
            [
                6462,
                6465
            ],
            [
                6595,
                6642
            ],
            [
                6822,
                6824
            ],
            [
                6824,
                6864
            ],
            [
                6872,
                6885
            ],
            [
                6887,
                6939
            ],
            [
                6941,
                7072
            ],
            [
                7188,
                7190
            ],
            [
                7190,
                7208
            ],
            [
                7214,
                7239
            ],
            [
                7241,
                7251
            ],
            [
                7251,
                7289
            ],
            [
                7312,
                7354
            ],
            [
                7376,
                7391
            ],
            [
                7403,
                7414
            ],
            [
                7435,
                7467
            ],
            [
                7503,
                7504
            ],
            [
                7552,
                7611
            ],
            [
                7616,
                7627
            ],
            [
                7642,
                7656
            ],
            [
                7676,
                7717
            ],
            [
                7721,
                7770
            ],
            [
                7954,
                7974
            ],
            [
                7981,
                8014
            ],
            [
                8132,
                8190
            ],
            [
                8209,
                8211
            ],
            [
                8211,
                8214
            ],
            [
                8223,
                8327
            ],
            [
                8327,
                8372
            ],
            [
                8375,
                8385
            ],
            [
                8414,
                8416
            ],
            [
                8416,
                8437
            ],
            [
                8439,
                8460
            ],
            [
                8460,
                8647
            ],
            [
                8658,
                8737
            ],
            [
                8737,
                8744
            ],
            [
                8763,
                8772
            ],
            [
                8840,
                8893
            ],
            [
                8893,
                8965
            ],
            [
                8965,
                9089
            ],
            [
                9151,
                9161
            ],
            [
                9177,
                9190
            ],
            [
                9190,
                9199
            ],
            [
                9201,
                9207
            ],
            [
                9209,
                9216
            ],
            [
                9218,
                9246
            ],
            [
                9246,
                9284
            ],
            [
                9284,
                9356
            ],
            [
                9357,
                9403
            ],
            [
                9433,
                9531
            ],
            [
                9583,
                9607
            ],
            [
                9531,
                9532
            ],
            [
                9608,
                9616
            ],
            [
                9627,
                9630
            ],
            [
                9617,
                9626
            ],
            [
                9631,
                9637
            ],
            [
                9650,
                9681
            ],
            [
                9427,
                9429
            ],
            [
                9687,
                9699
            ],
            [
                9712,
                9714
            ],
            [
                10012,
                10099
            ],
            [
                10111,
                10146
            ],
            [
                10146,
                10176
            ],
            [
                10178,
                10218
            ],
            [
                10220,
                10237
            ],
            [
                10259,
                10278
            ],
            [
                10286,
                10288
            ],
            [
                10315,
                10334
            ],
            [
                10342,
                10429
            ],
            [
                10429,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10504
            ],
            [
                10504,
                10541
            ],
            [
                10560,
                10566
            ],
            [
                10549,
                10559
            ],
            [
                10570,
                10593
            ],
            [
                10631,
                10662
            ],
            [
                10662,
                10680
            ],
            [
                10718,
                10726
            ],
            [
                10735,
                10737
            ],
            [
                10737,
                10740
            ],
            [
                10747,
                10798
            ],
            [
                10798,
                10813
            ],
            [
                10852,
                10879
            ],
            [
                10879,
                10902
            ],
            [
                10902,
                10930
            ],
            [
                10930,
                10995
            ],
            [
                11024,
                11026
            ],
            [
                11013,
                11020
            ],
            [
                11031,
                11039
            ],
            [
                11008,
                11012
            ],
            [
                11022,
                11023
            ],
            [
                11045,
                11071
            ],
            [
                11080,
                11156
            ],
            [
                11163,
                11175
            ],
            [
                11272,
                11274
            ],
            [
                11274,
                11288
            ],
            [
                11298,
                11342
            ],
            [
                11364,
                11367
            ],
            [
                11373,
                11397
            ],
            [
                11414,
                11447
            ],
            [
                11447,
                11467
            ],
            [
                11475,
                11507
            ],
            [
                11509,
                11534
            ],
            [
                11541,
                11543
            ],
            [
                11543,
                11574
            ],
            [
                11607,
                11633
            ],
            [
                11633,
                11685
            ],
            [
                11753,
                11814
            ],
            [
                11819,
                11827
            ],
            [
                11860,
                11862
            ],
            [
                11862,
                11868
            ],
            [
                11880,
                11935
            ],
            [
                11982,
                11983
            ],
            [
                11937,
                11940
            ],
            [
                11947,
                11954
            ],
            [
                12226,
                12229
            ],
            [
                11991,
                11997
            ],
            [
                12234,
                12256
            ],
            [
                12157,
                12160
            ],
            [
                12198,
                12223
            ],
            [
                12276,
                12287
            ],
            [
                12291,
                12307
            ],
            [
                12368,
                12372
            ],
            [
                12352,
                12353
            ],
            [
                12374,
                12452
            ],
            [
                12459,
                12473
            ],
            [
                12473,
                12500
            ],
            [
                12506,
                12511
            ],
            [
                12554,
                12556
            ],
            [
                12556,
                12569
            ],
            [
                12570,
                12614
            ],
            [
                12627,
                12629
            ],
            [
                12629,
                12638
            ],
            [
                12654,
                12669
            ],
            [
                12678,
                12751
            ],
            [
                12751,
                12767
            ],
            [
                12792,
                12794
            ],
            [
                12794,
                12803
            ],
            [
                12816,
                12836
            ],
            [
                12958,
                12959
            ],
            [
                12964,
                12968
            ],
            [
                13017,
                13024
            ],
            [
                13030,
                13036
            ],
            [
                13025,
                13029
            ],
            [
                13037,
                13089
            ],
            [
                13094,
                13097
            ],
            [
                12809,
                12810
            ],
            [
                13140,
                13198
            ],
            [
                13208,
                13241
            ],
            [
                13245,
                13256
            ],
            [
                13259,
                13293
            ],
            [
                13367,
                13409
            ],
            [
                13414,
                13474
            ],
            [
                13498,
                13499
            ],
            [
                13500,
                13514
            ],
            [
                13541,
                13542
            ],
            [
                13547,
                13603
            ],
            [
                13605,
                13623
            ],
            [
                13654,
                13668
            ],
            [
                13670,
                13676
            ],
            [
                13678,
                13683
            ],
            [
                13687,
                13747
            ],
            [
                13747,
                13780
            ],
            [
                13785,
                13802
            ],
            [
                13807,
                13846
            ],
            [
                13872,
                13874
            ],
            [
                13886,
                13889
            ],
            [
                13874,
                13880
            ],
            [
                13894,
                13915
            ],
            [
                13915,
                13945
            ],
            [
                13945,
                14012
            ],
            [
                14023,
                14066
            ],
            [
                14066,
                14140
            ],
            [
                14140,
                14190
            ],
            [
                14190,
                14232
            ],
            [
                14232,
                14260
            ],
            [
                14303,
                14305
            ],
            [
                14305,
                14320
            ],
            [
                14326,
                14362
            ],
            [
                14362,
                14405
            ],
            [
                14478,
                14539
            ],
            [
                14557,
                14559
            ],
            [
                14559,
                14599
            ],
            [
                14601,
                14638
            ],
            [
                14638,
                14650
            ],
            [
                14668,
                14690
            ],
            [
                14690,
                14781
            ],
            [
                14781,
                14788
            ],
            [
                14790,
                14808
            ],
            [
                14810,
                14812
            ],
            [
                14812,
                14848
            ],
            [
                14848,
                14889
            ],
            [
                14909,
                14911
            ],
            [
                14911,
                14964
            ],
            [
                14983,
                14986
            ],
            [
                15015,
                15029
            ],
            [
                15038,
                15089
            ],
            [
                15101,
                15143
            ],
            [
                15143,
                15181
            ],
            [
                15190,
                15288
            ],
            [
                15288,
                15319
            ],
            [
                15336,
                15447
            ],
            [
                15447,
                15473
            ],
            [
                15475,
                15513
            ],
            [
                15514,
                15532
            ],
            [
                15532,
                15555
            ],
            [
                15555,
                15617
            ],
            [
                15633,
                15635
            ],
            [
                15635,
                15714
            ],
            [
                15715,
                15779
            ],
            [
                15779,
                15782
            ],
            [
                15797,
                15806
            ],
            [
                15810,
                15833
            ],
            [
                15838,
                15860
            ],
            [
                15865,
                15885
            ],
            [
                15901,
                15946
            ],
            [
                15946,
                16040
            ],
            [
                16041,
                16045
            ],
            [
                16046,
                16056
            ],
            [
                16056,
                16084
            ],
            [
                16084,
                16088
            ],
            [
                16089,
                16099
            ],
            [
                16099,
                16102
            ],
            [
                16103,
                16158
            ],
            [
                16158,
                16206
            ],
            [
                16207,
                16213
            ],
            [
                16241,
                16253
            ],
            [
                16228,
                16231
            ],
            [
                16253,
                16255
            ],
            [
                16255,
                16267
            ],
            [
                16272,
                16274
            ],
            [
                16354,
                16380
            ],
            [
                16404,
                16406
            ],
            [
                16406,
                16436
            ],
            [
                16443,
                16477
            ],
            [
                16479,
                16623
            ],
            [
                16624,
                16634
            ],
            [
                16653,
                16656
            ],
            [
                16658,
                16750
            ],
            [
                16751,
                16771
            ],
            [
                16771,
                16784
            ],
            [
                16784,
                16785
            ],
            [
                16794,
                16819
            ],
            [
                16819,
                16836
            ],
            [
                16842,
                16918
            ],
            [
                16919,
                16967
            ],
            [
                16967,
                16976
            ],
            [
                16983,
                17005
            ],
            [
                17005,
                17061
            ],
            [
                17061,
                17083
            ],
            [
                17083,
                17104
            ],
            [
                17104,
                17129
            ],
            [
                17138,
                17139
            ],
            [
                17129,
                17132
            ],
            [
                17159,
                17238
            ],
            [
                17243,
                17252
            ],
            [
                17285,
                17286
            ],
            [
                17287,
                17337
            ],
            [
                17337,
                17365
            ],
            [
                17373,
                17413
            ],
            [
                17413,
                17446
            ],
            [
                17446,
                17485
            ],
            [
                17485,
                17508
            ],
            [
                17517,
                17526
            ],
            [
                17527,
                17561
            ],
            [
                17562,
                17583
            ],
            [
                17583,
                17651
            ],
            [
                17651,
                17674
            ],
            [
                17674,
                17702
            ],
            [
                17706,
                17724
            ],
            [
                17772,
                17810
            ],
            [
                17837,
                17849
            ],
            [
                17868,
                17875
            ],
            [
                17883,
                17885
            ],
            [
                17885,
                17942
            ],
            [
                17956,
                17996
            ],
            [
                17996,
                18051
            ],
            [
                18083,
                18139
            ],
            [
                18149,
                18172
            ],
            [
                18172,
                18220
            ],
            [
                18235,
                18273
            ],
            [
                18273,
                18321
            ],
            [
                18321,
                18361
            ],
            [
                18367,
                18384
            ],
            [
                18387,
                18392
            ],
            [
                18398,
                18426
            ],
            [
                18433,
                18444
            ],
            [
                18458,
                18460
            ],
            [
                18460,
                18484
            ],
            [
                18484,
                18497
            ],
            [
                18497,
                18503
            ],
            [
                18512,
                18522
            ],
            [
                18522,
                18535
            ],
            [
                18536,
                18542
            ],
            [
                18549,
                18589
            ],
            [
                18631,
                18657
            ],
            [
                18683,
                18706
            ],
            [
                18706,
                18763
            ],
            [
                18763,
                18828
            ],
            [
                18830,
                18862
            ],
            [
                18862,
                18891
            ],
            [
                18891,
                18929
            ],
            [
                18929,
                18970
            ],
            [
                18970,
                19011
            ],
            [
                19060,
                19091
            ],
            [
                19046,
                19047
            ],
            [
                19012,
                19046
            ],
            [
                19091,
                19093
            ],
            [
                19093,
                19109
            ],
            [
                19121,
                19155
            ],
            [
                19165,
                19198
            ],
            [
                19227,
                19245
            ],
            [
                19245,
                19303
            ],
            [
                19354,
                19356
            ],
            [
                19356,
                19383
            ],
            [
                19415,
                19438
            ],
            [
                19457,
                19459
            ],
            [
                19459,
                19494
            ],
            [
                19494,
                19514
            ],
            [
                19515,
                19537
            ],
            [
                19539,
                19550
            ],
            [
                19552,
                19578
            ],
            [
                19579,
                19592
            ],
            [
                19592,
                19625
            ],
            [
                19661,
                19663
            ],
            [
                19663,
                19727
            ],
            [
                19727,
                19764
            ],
            [
                19768,
                19823
            ],
            [
                19824,
                19849
            ],
            [
                19876,
                19945
            ],
            [
                19945,
                19958
            ],
            [
                19978,
                19994
            ],
            [
                19995,
                20034
            ],
            [
                20034,
                20045
            ],
            [
                20045,
                20064
            ],
            [
                20064,
                20087
            ],
            [
                20087,
                20119
            ],
            [
                20129,
                20134
            ],
            [
                20141,
                20211
            ],
            [
                20211,
                20227
            ],
            [
                20249,
                20264
            ],
            [
                20269,
                20328
            ],
            [
                20328,
                20361
            ],
            [
                20404,
                20451
            ],
            [
                20451,
                20499
            ],
            [
                20515,
                20533
            ],
            [
                20617,
                20618
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                244
            ],
            [
                244,
                531
            ],
            [
                531,
                782
            ],
            [
                782,
                1023
            ],
            [
                1023,
                1660
            ],
            [
                1660,
                1770
            ],
            [
                1770,
                1841
            ],
            [
                1841,
                2009
            ],
            [
                2009,
                2290
            ],
            [
                2290,
                2495
            ],
            [
                2495,
                2574
            ],
            [
                2574,
                2665
            ],
            [
                2665,
                2750
            ],
            [
                2750,
                2804
            ],
            [
                2804,
                2820
            ],
            [
                2820,
                2868
            ],
            [
                2868,
                2960
            ],
            [
                2960,
                3041
            ],
            [
                3041,
                3226
            ],
            [
                3226,
                3406
            ],
            [
                3406,
                3479
            ],
            [
                3479,
                3926
            ],
            [
                3926,
                4012
            ],
            [
                4012,
                4131
            ],
            [
                4131,
                4416
            ],
            [
                4416,
                5204
            ],
            [
                5204,
                5231
            ],
            [
                5231,
                5254
            ],
            [
                5254,
                5310
            ],
            [
                5310,
                5376
            ],
            [
                5376,
                5509
            ],
            [
                5509,
                5607
            ],
            [
                5607,
                5685
            ],
            [
                5685,
                5811
            ],
            [
                5811,
                6005
            ],
            [
                6005,
                6151
            ],
            [
                6151,
                6340
            ],
            [
                6340,
                6355
            ],
            [
                6355,
                6403
            ],
            [
                6403,
                6824
            ],
            [
                6824,
                7190
            ],
            [
                7190,
                7251
            ],
            [
                7251,
                7771
            ],
            [
                7771,
                7954
            ],
            [
                7954,
                8211
            ],
            [
                8211,
                8327
            ],
            [
                8327,
                8416
            ],
            [
                8416,
                8460
            ],
            [
                8460,
                8737
            ],
            [
                8737,
                8893
            ],
            [
                8893,
                8965
            ],
            [
                8965,
                9190
            ],
            [
                9190,
                9246
            ],
            [
                9246,
                9284
            ],
            [
                9284,
                9357
            ],
            [
                9357,
                9714
            ],
            [
                9714,
                9991
            ],
            [
                9991,
                10146
            ],
            [
                10146,
                10278
            ],
            [
                10278,
                10429
            ],
            [
                10429,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10504
            ],
            [
                10504,
                10662
            ],
            [
                10662,
                10737
            ],
            [
                10737,
                10798
            ],
            [
                10798,
                10879
            ],
            [
                10879,
                10902
            ],
            [
                10902,
                10930
            ],
            [
                10930,
                10996
            ],
            [
                10996,
                11274
            ],
            [
                11274,
                11447
            ],
            [
                11447,
                11543
            ],
            [
                11543,
                11633
            ],
            [
                11633,
                11862
            ],
            [
                11862,
                12276
            ],
            [
                12276,
                12473
            ],
            [
                12473,
                12556
            ],
            [
                12556,
                12570
            ],
            [
                12570,
                12629
            ],
            [
                12629,
                12751
            ],
            [
                12751,
                12794
            ],
            [
                12794,
                13140
            ],
            [
                13140,
                13293
            ],
            [
                13293,
                13367
            ],
            [
                13367,
                13500
            ],
            [
                13500,
                13623
            ],
            [
                13623,
                13654
            ],
            [
                13654,
                13747
            ],
            [
                13747,
                13874
            ],
            [
                13874,
                13915
            ],
            [
                13915,
                13945
            ],
            [
                13945,
                14066
            ],
            [
                14066,
                14140
            ],
            [
                14140,
                14190
            ],
            [
                14190,
                14232
            ],
            [
                14232,
                14305
            ],
            [
                14305,
                14362
            ],
            [
                14362,
                14405
            ],
            [
                14405,
                14478
            ],
            [
                14478,
                14559
            ],
            [
                14559,
                14638
            ],
            [
                14638,
                14690
            ],
            [
                14690,
                14781
            ],
            [
                14781,
                14788
            ],
            [
                14788,
                14812
            ],
            [
                14812,
                14848
            ],
            [
                14848,
                14911
            ],
            [
                14911,
                14964
            ],
            [
                14964,
                15143
            ],
            [
                15143,
                15288
            ],
            [
                15288,
                15447
            ],
            [
                15447,
                15514
            ],
            [
                15514,
                15532
            ],
            [
                15532,
                15555
            ],
            [
                15555,
                15635
            ],
            [
                15635,
                15715
            ],
            [
                15715,
                15779
            ],
            [
                15779,
                15885
            ],
            [
                15885,
                15901
            ],
            [
                15901,
                15946
            ],
            [
                15946,
                16041
            ],
            [
                16041,
                16056
            ],
            [
                16056,
                16084
            ],
            [
                16084,
                16099
            ],
            [
                16099,
                16158
            ],
            [
                16158,
                16255
            ],
            [
                16255,
                16274
            ],
            [
                16274,
                16354
            ],
            [
                16354,
                16406
            ],
            [
                16406,
                16624
            ],
            [
                16624,
                16751
            ],
            [
                16751,
                16771
            ],
            [
                16771,
                16784
            ],
            [
                16784,
                16819
            ],
            [
                16819,
                16919
            ],
            [
                16919,
                16967
            ],
            [
                16967,
                17005
            ],
            [
                17005,
                17061
            ],
            [
                17061,
                17083
            ],
            [
                17083,
                17104
            ],
            [
                17104,
                17129
            ],
            [
                17129,
                17287
            ],
            [
                17287,
                17337
            ],
            [
                17337,
                17413
            ],
            [
                17413,
                17446
            ],
            [
                17446,
                17485
            ],
            [
                17485,
                17527
            ],
            [
                17527,
                17562
            ],
            [
                17562,
                17583
            ],
            [
                17583,
                17651
            ],
            [
                17651,
                17674
            ],
            [
                17674,
                17706
            ],
            [
                17706,
                17772
            ],
            [
                17772,
                17885
            ],
            [
                17885,
                17996
            ],
            [
                17996,
                18139
            ],
            [
                18139,
                18172
            ],
            [
                18172,
                18273
            ],
            [
                18273,
                18321
            ],
            [
                18321,
                18460
            ],
            [
                18460,
                18484
            ],
            [
                18484,
                18497
            ],
            [
                18497,
                18522
            ],
            [
                18522,
                18706
            ],
            [
                18706,
                18763
            ],
            [
                18763,
                18862
            ],
            [
                18862,
                18891
            ],
            [
                18891,
                18929
            ],
            [
                18929,
                18970
            ],
            [
                18970,
                19093
            ],
            [
                19093,
                19245
            ],
            [
                19245,
                19356
            ],
            [
                19356,
                19459
            ],
            [
                19459,
                19494
            ],
            [
                19494,
                19515
            ],
            [
                19515,
                19592
            ],
            [
                19592,
                19663
            ],
            [
                19663,
                19727
            ],
            [
                19727,
                19824
            ],
            [
                19824,
                19945
            ],
            [
                19945,
                19995
            ],
            [
                19995,
                20034
            ],
            [
                20034,
                20045
            ],
            [
                20045,
                20064
            ],
            [
                20064,
                20087
            ],
            [
                20087,
                20211
            ],
            [
                20211,
                20328
            ],
            [
                20328,
                20451
            ],
            [
                20451,
                20618
            ]
        ]
    },
    "abridged": {
        "text": "Rawdon drove on to Mr. Moss the bailiff's mansion in Cursitor Street, and was duly introduced into that dismal place. Morning was breaking over the house-tops of Chancery Lane as the rattling cab woke up the echoes there. Rawdon was welcomed in by Mr. Moss, his travelling companion and host, who cheerfully asked him if he would like a glass of something warm after his drive.\nThe Colonel was not so depressed as some men would be to find themselves shut in a spunging-house, to be confined there until payment was arranged; for in truth, he had been a lodger at Mr. Moss's once or twice before. We have not thought it necessary to mention these trivial little incidents: but they must frequently occur in the life of a man who lives on nothing a year.\nUpon his first visit to Mr. Moss, the Colonel, then a bachelor, had been freed by the generosity of his aunt; on the second mishap, little Becky had borrowed money from Lord Southdown and had coaxed her husband's creditor (who was her shawl and gown-seller) to take Rawdon's promissory note for the rest. So on both these occasions the capture and release had been conducted with gallantry on all sides, and Moss and the Colonel were therefore on the very best of terms.\n\"You'll find your old bed, Colonel, and everything comfortable,\" Mr. Moss said. \"It's kep aired, and by the best of company, too. It was slep in the night afore last by the Honourable Capting Famish, of the Fiftieth Dragoons. I've got a Doctor of Diwinity upstairs, five gents in the coffee-room, and Mrs. Moss has a tably-dy-hoty at half-past five, and a little cards or music afterwards, when we shall be most happy to see you.\"\n\"I'll ring when I want anything,\" said Rawdon, and went quietly to his bedroom. He was an old soldier, not to be shaken by little shocks of fate. A weaker man would have instantly sent a letter to his wife.\n\"But what is the use of disturbing her night's rest?\" he thought. \"Time enough to write to her when she has had her sleep. It's only a hundred-and-seventy pounds, and the deuce is in it if we can't raise that.\" And so, thinking about little Rawdon, the Colonel turned into the bed lately occupied by Captain Famish and fell asleep.\nIt was ten o'clock when he woke up. A youth brought him a fine silver dressing-case, so that he might shave. Indeed Mr. Moss's house, though somewhat dirty, was splendid throughout. There were dirty gilt cornices, with dingy yellow satin hangings to the barred windows; vast and dirty gilt picture frames surrounded works by the greatest masters - works which were sold and bought over and over again. The Colonel's breakfast was served to him in dingy and gorgeous silver-plated ware. Miss Moss, a dark-eyed maid in curl-papers, appeared with the teapot, and, smiling, asked the Colonel how he had slep? She brought him the Morning Post, which contained a brilliant account of Lord Steyne's festivities and of the beautiful and accomplished Mrs. Rawdon Crawley.\nAfter a lively chat with this lady, Colonel Crawley called for pens and paper, and wrote without many misgivings.\nDEAR BECKY,\nI HOPE YOU SLEPT WELL. Don't be FRIGHTENED if I don't bring you in your COFFY. Last night as I was coming home smoaking, I met with an ACCADENT. I was NABBED by Moss of Cursitor Street - the same that had me two years ago. Miss Moss brought in my tea - she is grown very FAT, and had her STOCKENS DOWN AT HEAL.\nIt's Nathan's business - a hundred-and-seventy. Please send me some CLOATHES and my desk - I've seventy in it. And as soon as you get this, Drive to Nathan's - offer him seventy-five down, and ASK HIM TO RENEW.\nIf he won't stand it, take my ticker and anythings as you can SPARE, and send them to the pawnbroker. We must, of coarse, have the sum to-night. We can't let it stand over, as tomorrow's Sunday; the beds here are not very CLEAN, and there may be other things out against me. I'm glad it an't Rawdon's Saturday for coming home. God bless you.\nYours in haste, R. C.\nP.S. Make haste and come.\nThis letter was sent by a messenger, and Rawdon, having seen him depart, went into the courtyard and smoked his cigar with a tolerably easy mind.\nThree hours, he calculated, would be the most time required before Becky should arrive and open his prison doors; and he passed these pretty cheerfully in smoking, in reading the paper, and in the coffee-room with an acquaintance, Captain Walker.\nBut the day passed and no messenger returned - no Becky. Mr. Moss's tably-dy-hoty was served at half-past five, when such of the gentlemen lodgers as could afford the banquet enjoyed it in the splendid front parlour. Miss M. (Miss Hem, as her papa called her) appeared without her curl-papers, and Mrs. Hem served a prime boiled leg of mutton and turnips, which the Colonel ate with a very faint appetite.\nIn the midst of this meal, however, the doorbell was heard. The messenger had returned with a bag, a desk and a letter. \"No ceremony, Colonel, I beg,\" said Mrs. Moss with a wave of her hand, and he opened the letter rather tremulously. It was a beautiful letter, highly scented, on pink paper.\nMON PAUVRE CHER PETIT (Mrs. Crawley wrote)\nI could not sleep ONE WINK for thinking of what had become of my odious old monstre, and only got to rest in the morning after sending for Mr. Blench (for I was in a fever), who gave me a draught and left orders with Finette that I should be disturbed ON NO ACCOUNT. So that your messenger remained in the hall for some hours waiting my bell. You may fancy my state when I read your poor dear old ill-spelt letter.\nIll as I was, I instantly called for the carriage, and as soon as I was dressed (though I couldn't drink a drop of chocolate), I drove like the wind to Nathan's. I saw him - I wept - I cried - I fell at his odious knees. Nothing would mollify the horrid man. He would have all the money, he said, or keep my poor monstre in prison.\nI drove home with the intention of paying that visit to the pawnbroker (when every trinket I have should be at your disposal though they would not fetch a hundred pounds), and found Milor there, with the old Bulgarian sheep-face, who had come to compliment me on last night's performance. I went down on my knees to Milor; told him we were going to pawn everything, and begged him to give me two hundred pounds. He pish'd and psha'd in a fury - told me not to be such a fool as to pawn - and said he would lend me the money. He promised he would send it me tomorrow morning: when I will bring it to my poor old monster with a kiss from his affectionate\nBECKY\nI am writing in bed. Oh I have such a headache and such a heartache!\nWhen Rawdon read over this letter, he looked so red and savage that the company saw that bad news had reached him. All his suspicions returned. She would not even go out and sell her trinkets to free him. She could laugh, whilst he was in prison. Who had put him there? Wenham had walked with him. Was there.... he could hardly bear to think of what he suspected.\nHe hurried into his room, opened his desk, wrote two lines, which he directed to Sir Pitt or Lady Crawley, and bade the messenger deliver them at once.\nIn the note he begged his dear brother and sister, for the sake of his child and his honour, to relieve him from his difficulty. He was in prison, he needed a hundred pounds to set him free - he entreated them to come.\nThen he went back to the dining-room and called for more wine. He laughed and talked with a strange boisterousness, and went on drinking for an hour, listening all the while for a carriage.\nAt the end of that time, wheels were heard whirling up to the gate. The janitor led a lady into the back parlour, and called, \"Colonel, you're wanted.\"\nRawdon came from the dining-room, a flare of coarse light following him into the apartment where the lady stood, very nervous.\n\"It is I, Rawdon,\" she said timidly. \"It is Jane.\"\nRawdon was quite overcome by that kind voice. He ran up - caught her in his arms - gasped out some inarticulate words of thanks and fairly sobbed on her shoulder. She did not know why.\nThe bills were quickly settled; Jane happily carried Rawdon away from the bailiff's house, and they went homewards in a cab.\n\"Pitt was gone to a parliamentary dinner,\" she said, \"when the note came, and so, dear Rawdon, I came myself;\" and she put her kind hand in his. Rawdon thanked his sister a hundred times, with an ardour of gratitude which touched and almost alarmed her.\n\"Oh,\" said he, \"you don't know how I'm changed since I've known you, and - and little Rawdy. You see I want - I want - to be-\" He did not finish the sentence, but she could interpret it. And that night after he left her, as she sat by her little boy's bed, she prayed humbly for Rawdon.\nOn leaving her, Rawdon walked home rapidly. It was nine o'clock at night. He ran across the streets and the great squares of Vanity Fair, and came up breathless opposite his own house. He started back and fell against the railings, trembling as he looked up. The drawing-room windows were blazing with light. She had said that she was in bed and ill. He stood there for some time.\nThen he took out his key and let himself into the house. He could hear laughter in the upper rooms. He went silently up the stairs, leaning against the banisters. Nobody was stirring in the house besides - all the servants had been sent away. Rawdon heard laughter and singing. Becky was singing a snatch of the song of the night before; a hoarse voice shouted \"Brava! Brava!\" - it was Lord Steyne.\nRawdon opened the door and went in. A little table with a dinner was laid out. Steyne was hanging over the sofa on which Becky sat. She was brilliantly dressed, her arms and fingers sparkling with bracelets and rings, and the diamonds on her breast which Steyne had given her. He had her hand in his, and was bowing to kiss it, when Becky started up with a faint scream as she caught sight of Rawdon's white face. At the next instant she tried a smile, as if to welcome her husband; and Steyne rose up, grinding his teeth, pale, and with fury in his looks.\nHe, too, attempted a laugh - and came forward holding out his hand.\n\"What, come back! How d'ye do, Crawley?\" he said, the nerves of his mouth twitching as he tried to grin.\nThere was that in Rawdon's face which caused Becky to fling herself before him.\n\"I am innocent, Rawdon,\" she said; \"before God, I am innocent.\" She clutched at his coat, his hands; her own were covered with serpents, rings, and baubles. \"Say I am innocent,\" she said to Lord Steyne.\nBut he thought a trap had been laid for him, and was as furious with the wife as with the husband.\n\"You, innocent! Damn you,\" he screamed out. \"You, innocent! Why, every trinket you have on your body is paid for by me. I have given you thousands of pounds, which this bullying fellow has sold you for. Innocent, by ___! Don't think to frighten me. Make way, sir, and let me pass.\"\nLord Steyne seized up his hat, and with flame in his eyes, and looking his enemy fiercely in the face, marched upon him, never for a moment doubting that the other would give way. But Rawdon sprang out and seized him by the neckcloth, until Steyne, almost strangled, writhed and bent under his arm.\n\"You lie, you dog!\" said Rawdon. \"You coward and villain!\" And he struck the Marquis twice over the face with his open hand and flung him bleeding to the ground.\nIt was all done before Rebecca could interpose. She stood trembling before him. She admired her husband, strong, brave, and victorious.\n\"Come here,\" he said. She came up at once.\n\"Take off those things.\" Trembling, she pulled the jewels from her arms, and the rings from her shaking fingers, and held them in a heap.\n\"Throw them down,\" he said, and she dropped them. He tore the diamond ornament from her breast and flung it at Lord Steyne. It cut him on his bald forehead. Steyne wore the scar to his dying day.\n\"Come upstairs,\" Rawdon told his wife.\n\"Don't kill me, Rawdon,\" she said.\nHe laughed savagely. \"I want to see if that man lies about the money as he has about me. Has he given you any?\"\n\"No,\" said Rebecca, \"that is-\"\n\"Give me your keys.\"\nRebecca gave him all the keys but one, hoping he would not notice its absence. It belonged to the little desk which Amelia had given her, and which she kept in a secret place. But Rawdon flung open boxes and wardrobes, throwing the contents here and there, and at last he found the desk. She was forced to open it. It contained papers, love-letters many years old - small trinkets and woman's memoranda. And it contained a pocket-book with bank-notes. Some of these were dated ten years back, and one was quite fresh - a note for a thousand pounds from Lord Steyne.\n\"Did he give you this?\" Rawdon said.\n\"Yes,\" she answered.\n\"I'll send it back to him today,\" Rawdon said (for day had dawned again), \"and I will pay Briggs, and some of the debts. You will let me know where I shall send the rest to you. You might have spared me a hundred pounds, Becky, out of all this - I have always shared with you.\"\n\"I am innocent,\" said Becky. And he left her without another word.\nWhat were her thoughts when he left her? She remained for hours after he was gone, sitting alone on the bed's edge, the sunshine pouring into the room. The drawers were open and their contents scattered about - dresses and feathers, scarfs and trinkets lying in a wreck. Her hair was falling over her shoulders; her gown was torn. She heard him go downstairs, and the door slamming. She knew he would never come back. He was gone forever.\nWould he kill himself? she thought. No, not until after he had met and fought Lord Steyne. She thought of her long past life. Ah, how dreary it seemed, how miserable, lonely and profitless! Should she take laudanum, and end it, have done with all hopes, schemes, debts, and triumphs?\nThe French maid found her sitting in the midst of her miserable ruins with clasped hands and dry eyes. The woman was in Steyne's pay.\n\"Mon Dieu, madame, what has happened?\" she asked.\nWhat had happened? Was she guilty or not? She said not, but who could tell if truth came from those lips, or if that corrupt heart was in this case pure?\nAll her lies and selfishness and wiles, all her wit and genius had come to this bankruptcy. The woman closed the curtains and persuaded her mistress to lie down on the bed. Then she went below and gathered up the trinkets that were still lying on the floor.",
        "paragraph_chars": [
            [
                0,
                378
            ],
            [
                378,
                754
            ],
            [
                754,
                1225
            ],
            [
                1225,
                1656
            ],
            [
                1656,
                1863
            ],
            [
                1863,
                2195
            ],
            [
                2195,
                2958
            ],
            [
                2958,
                3072
            ],
            [
                3072,
                3084
            ],
            [
                3084,
                3395
            ],
            [
                3395,
                3606
            ],
            [
                3606,
                3948
            ],
            [
                3948,
                3970
            ],
            [
                3970,
                3996
            ],
            [
                3996,
                4142
            ],
            [
                4142,
                4389
            ],
            [
                4389,
                4795
            ],
            [
                4795,
                5089
            ],
            [
                5089,
                5132
            ],
            [
                5132,
                5547
            ],
            [
                5547,
                5879
            ],
            [
                5879,
                6532
            ],
            [
                6532,
                6538
            ],
            [
                6538,
                6607
            ],
            [
                6607,
                6971
            ],
            [
                6971,
                7123
            ],
            [
                7123,
                7342
            ],
            [
                7342,
                7532
            ],
            [
                7532,
                7684
            ],
            [
                7684,
                7811
            ],
            [
                7811,
                7862
            ],
            [
                7862,
                8047
            ],
            [
                8047,
                8172
            ],
            [
                8172,
                8426
            ],
            [
                8426,
                8713
            ],
            [
                8713,
                9094
            ],
            [
                9094,
                9493
            ],
            [
                9493,
                10050
            ],
            [
                10050,
                10118
            ],
            [
                10118,
                10223
            ],
            [
                10223,
                10303
            ],
            [
                10303,
                10506
            ],
            [
                10506,
                10605
            ],
            [
                10605,
                10887
            ],
            [
                10887,
                11186
            ],
            [
                11186,
                11348
            ],
            [
                11348,
                11484
            ],
            [
                11484,
                11527
            ],
            [
                11527,
                11665
            ],
            [
                11665,
                11861
            ],
            [
                11861,
                11900
            ],
            [
                11900,
                11935
            ],
            [
                11935,
                12047
            ],
            [
                12047,
                12078
            ],
            [
                12078,
                12099
            ],
            [
                12099,
                12665
            ],
            [
                12665,
                12702
            ],
            [
                12702,
                12723
            ],
            [
                12723,
                13001
            ],
            [
                13001,
                13068
            ],
            [
                13068,
                13507
            ],
            [
                13507,
                13791
            ],
            [
                13791,
                13925
            ],
            [
                13925,
                13975
            ],
            [
                13975,
                14129
            ],
            [
                14129,
                14386
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                222
            ],
            [
                222,
                378
            ],
            [
                378,
                597
            ],
            [
                597,
                754
            ],
            [
                754,
                1059
            ],
            [
                1059,
                1225
            ],
            [
                1225,
                1305
            ],
            [
                1305,
                1355
            ],
            [
                1355,
                1451
            ],
            [
                1451,
                1656
            ],
            [
                1656,
                1736
            ],
            [
                1736,
                1802
            ],
            [
                1802,
                1863
            ],
            [
                1863,
                1917
            ],
            [
                1917,
                1929
            ],
            [
                1929,
                1986
            ],
            [
                1986,
                2074
            ],
            [
                2074,
                2195
            ],
            [
                2195,
                2231
            ],
            [
                2231,
                2304
            ],
            [
                2304,
                2377
            ],
            [
                2377,
                2597
            ],
            [
                2597,
                2681
            ],
            [
                2681,
                2800
            ],
            [
                2800,
                2958
            ],
            [
                2958,
                3072
            ],
            [
                3072,
                3084
            ],
            [
                3084,
                3107
            ],
            [
                3107,
                3163
            ],
            [
                3163,
                3229
            ],
            [
                3229,
                3307
            ],
            [
                3307,
                3395
            ],
            [
                3395,
                3443
            ],
            [
                3443,
                3506
            ],
            [
                3506,
                3606
            ],
            [
                3606,
                3708
            ],
            [
                3708,
                3751
            ],
            [
                3751,
                3881
            ],
            [
                3881,
                3933
            ],
            [
                3933,
                3948
            ],
            [
                3948,
                3970
            ],
            [
                3970,
                3996
            ],
            [
                3996,
                4142
            ],
            [
                4142,
                4389
            ],
            [
                4389,
                4446
            ],
            [
                4446,
                4606
            ],
            [
                4606,
                4795
            ],
            [
                4795,
                4855
            ],
            [
                4855,
                4915
            ],
            [
                4915,
                5031
            ],
            [
                5031,
                5089
            ],
            [
                5089,
                5132
            ],
            [
                5132,
                5399
            ],
            [
                5399,
                5475
            ],
            [
                5475,
                5547
            ],
            [
                5547,
                5709
            ],
            [
                5709,
                5768
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5879
            ],
            [
                5879,
                6168
            ],
            [
                6168,
                6291
            ],
            [
                6291,
                6404
            ],
            [
                6404,
                6532
            ],
            [
                6532,
                6538
            ],
            [
                6538,
                6559
            ],
            [
                6559,
                6607
            ],
            [
                6607,
                6722
            ],
            [
                6722,
                6751
            ],
            [
                6751,
                6812
            ],
            [
                6812,
                6854
            ],
            [
                6854,
                6877
            ],
            [
                6877,
                6905
            ],
            [
                6905,
                6971
            ],
            [
                6971,
                7123
            ],
            [
                7123,
                7252
            ],
            [
                7252,
                7342
            ],
            [
                7342,
                7405
            ],
            [
                7405,
                7532
            ],
            [
                7532,
                7600
            ],
            [
                7600,
                7684
            ],
            [
                7684,
                7811
            ],
            [
                7811,
                7848
            ],
            [
                7848,
                7862
            ],
            [
                7862,
                7908
            ],
            [
                7908,
                8025
            ],
            [
                8025,
                8047
            ],
            [
                8047,
                8172
            ],
            [
                8172,
                8317
            ],
            [
                8317,
                8426
            ],
            [
                8426,
                8519
            ],
            [
                8519,
                8613
            ],
            [
                8613,
                8713
            ],
            [
                8713,
                8757
            ],
            [
                8757,
                8787
            ],
            [
                8787,
                8898
            ],
            [
                8898,
                8972
            ],
            [
                8972,
                9022
            ],
            [
                9022,
                9064
            ],
            [
                9064,
                9094
            ],
            [
                9094,
                9151
            ],
            [
                9151,
                9194
            ],
            [
                9194,
                9257
            ],
            [
                9257,
                9337
            ],
            [
                9337,
                9372
            ],
            [
                9372,
                9463
            ],
            [
                9463,
                9471
            ],
            [
                9471,
                9493
            ],
            [
                9493,
                9529
            ],
            [
                9529,
                9572
            ],
            [
                9572,
                9625
            ],
            [
                9625,
                9770
            ],
            [
                9770,
                9907
            ],
            [
                9907,
                10050
            ],
            [
                10050,
                10118
            ],
            [
                10118,
                10136
            ],
            [
                10136,
                10159
            ],
            [
                10159,
                10223
            ],
            [
                10223,
                10303
            ],
            [
                10303,
                10367
            ],
            [
                10367,
                10460
            ],
            [
                10460,
                10506
            ],
            [
                10506,
                10605
            ],
            [
                10605,
                10621
            ],
            [
                10621,
                10649
            ],
            [
                10649,
                10665
            ],
            [
                10665,
                10725
            ],
            [
                10725,
                10808
            ],
            [
                10808,
                10826
            ],
            [
                10826,
                10854
            ],
            [
                10854,
                10887
            ],
            [
                10887,
                11067
            ],
            [
                11067,
                11186
            ],
            [
                11186,
                11206
            ],
            [
                11206,
                11219
            ],
            [
                11219,
                11245
            ],
            [
                11245,
                11348
            ],
            [
                11348,
                11396
            ],
            [
                11396,
                11428
            ],
            [
                11428,
                11484
            ],
            [
                11484,
                11506
            ],
            [
                11506,
                11527
            ],
            [
                11527,
                11552
            ],
            [
                11552,
                11665
            ],
            [
                11665,
                11715
            ],
            [
                11715,
                11789
            ],
            [
                11789,
                11822
            ],
            [
                11822,
                11861
            ],
            [
                11861,
                11900
            ],
            [
                11900,
                11935
            ],
            [
                11935,
                11956
            ],
            [
                11956,
                12024
            ],
            [
                12024,
                12047
            ],
            [
                12047,
                12078
            ],
            [
                12078,
                12099
            ],
            [
                12099,
                12178
            ],
            [
                12178,
                12275
            ],
            [
                12275,
                12387
            ],
            [
                12387,
                12414
            ],
            [
                12414,
                12503
            ],
            [
                12503,
                12551
            ],
            [
                12551,
                12665
            ],
            [
                12665,
                12689
            ],
            [
                12689,
                12702
            ],
            [
                12702,
                12723
            ],
            [
                12723,
                12844
            ],
            [
                12844,
                12901
            ],
            [
                12901,
                13001
            ],
            [
                13001,
                13030
            ],
            [
                13030,
                13068
            ],
            [
                13068,
                13109
            ],
            [
                13109,
                13220
            ],
            [
                13220,
                13339
            ],
            [
                13339,
                13399
            ],
            [
                13399,
                13451
            ],
            [
                13451,
                13486
            ],
            [
                13486,
                13507
            ],
            [
                13507,
                13530
            ],
            [
                13530,
                13543
            ],
            [
                13543,
                13598
            ],
            [
                13598,
                13633
            ],
            [
                13633,
                13697
            ],
            [
                13697,
                13791
            ],
            [
                13791,
                13894
            ],
            [
                13894,
                13925
            ],
            [
                13925,
                13964
            ],
            [
                13964,
                13975
            ],
            [
                13975,
                13994
            ],
            [
                13994,
                14017
            ],
            [
                14017,
                14129
            ],
            [
                14129,
                14221
            ],
            [
                14221,
                14302
            ],
            [
                14302,
                14386
            ]
        ],
        "overlap_chars": [
            [
                0,
                15
            ],
            [
                16,
                27
            ],
            [
                39,
                82
            ],
            [
                94,
                116
            ],
            [
                116,
                118
            ],
            [
                118,
                147
            ],
            [
                148,
                222
            ],
            [
                222,
                241
            ],
            [
                245,
                378
            ],
            [
                378,
                418
            ],
            [
                423,
                431
            ],
            [
                435,
                450
            ],
            [
                459,
                475
            ],
            [
                475,
                476
            ],
            [
                480,
                482
            ],
            [
                524,
                529
            ],
            [
                533,
                538
            ],
            [
                538,
                574
            ],
            [
                575,
                597
            ],
            [
                597,
                629
            ],
            [
                630,
                661
            ],
            [
                662,
                676
            ],
            [
                677,
                681
            ],
            [
                698,
                754
            ],
            [
                754,
                826
            ],
            [
                833,
                898
            ],
            [
                899,
                911
            ],
            [
                912,
                994
            ],
            [
                995,
                998
            ],
            [
                1003,
                1004
            ],
            [
                1010,
                1019
            ],
            [
                1020,
                1052
            ],
            [
                1059,
                1133
            ],
            [
                1134,
                1225
            ],
            [
                1225,
                1289
            ],
            [
                1299,
                1303
            ],
            [
                1303,
                1305
            ],
            [
                1311,
                1355
            ],
            [
                1355,
                1397
            ],
            [
                1409,
                1449
            ],
            [
                1449,
                1451
            ],
            [
                1451,
                1656
            ],
            [
                1656,
                1701
            ],
            [
                1703,
                1736
            ],
            [
                1736,
                1758
            ],
            [
                1759,
                1768
            ],
            [
                1776,
                1778
            ],
            [
                1779,
                1802
            ],
            [
                1802,
                1825
            ],
            [
                1836,
                1840
            ],
            [
                1841,
                1861
            ],
            [
                1861,
                1862
            ],
            [
                1863,
                1917
            ],
            [
                1920,
                1927
            ],
            [
                1927,
                1929
            ],
            [
                1930,
                1984
            ],
            [
                1984,
                1986
            ],
            [
                1986,
                2017
            ],
            [
                2024,
                2074
            ],
            [
                2074,
                2110
            ],
            [
                2112,
                2194
            ],
            [
                2195,
                2229
            ],
            [
                2233,
                2250
            ],
            [
                2251,
                2279
            ],
            [
                2288,
                2296
            ],
            [
                2302,
                2304
            ],
            [
                2304,
                2377
            ],
            [
                2377,
                2387
            ],
            [
                2388,
                2463
            ],
            [
                2470,
                2499
            ],
            [
                2511,
                2516
            ],
            [
                2517,
                2540
            ],
            [
                2541,
                2542
            ],
            [
                2549,
                2554
            ],
            [
                2555,
                2597
            ],
            [
                2597,
                2641
            ],
            [
                2642,
                2660
            ],
            [
                2668,
                2681
            ],
            [
                2681,
                2800
            ],
            [
                2800,
                2815
            ],
            [
                2816,
                2833
            ],
            [
                2840,
                2872
            ],
            [
                2873,
                2886
            ],
            [
                2887,
                2956
            ],
            [
                2956,
                2958
            ],
            [
                2958,
                2992
            ],
            [
                2992,
                2993
            ],
            [
                2994,
                3029
            ],
            [
                3030,
                3040
            ],
            [
                3055,
                3072
            ],
            [
                3072,
                3083
            ],
            [
                3084,
                3107
            ],
            [
                3107,
                3163
            ],
            [
                3163,
                3229
            ],
            [
                3229,
                3268
            ],
            [
                3271,
                3291
            ],
            [
                3292,
                3301
            ],
            [
                3305,
                3307
            ],
            [
                3307,
                3334
            ],
            [
                3337,
                3363
            ],
            [
                3364,
                3395
            ],
            [
                3395,
                3417
            ],
            [
                3418,
                3419
            ],
            [
                3420,
                3421
            ],
            [
                3422,
                3443
            ],
            [
                3443,
                3457
            ],
            [
                3458,
                3462
            ],
            [
                3472,
                3475
            ],
            [
                3476,
                3483
            ],
            [
                3486,
                3506
            ],
            [
                3506,
                3552
            ],
            [
                3555,
                3604
            ],
            [
                3604,
                3606
            ],
            [
                3606,
                3626
            ],
            [
                3628,
                3646
            ],
            [
                3650,
                3691
            ],
            [
                3706,
                3707
            ],
            [
                3708,
                3751
            ],
            [
                3757,
                3759
            ],
            [
                3760,
                3781
            ],
            [
                3790,
                3879
            ],
            [
                3881,
                3933
            ],
            [
                3933,
                3948
            ],
            [
                3948,
                3969
            ],
            [
                3970,
                3996
            ],
            [
                3996,
                4007
            ],
            [
                4008,
                4011
            ],
            [
                4017,
                4019
            ],
            [
                4020,
                4021
            ],
            [
                4031,
                4073
            ],
            [
                4079,
                4082
            ],
            [
                4093,
                4140
            ],
            [
                4140,
                4142
            ],
            [
                4142,
                4182
            ],
            [
                4188,
                4201
            ],
            [
                4202,
                4254
            ],
            [
                4256,
                4387
            ],
            [
                4387,
                4389
            ],
            [
                4389,
                4407
            ],
            [
                4408,
                4433
            ],
            [
                4436,
                4446
            ],
            [
                4446,
                4484
            ],
            [
                4485,
                4527
            ],
            [
                4536,
                4551
            ],
            [
                4552,
                4563
            ],
            [
                4572,
                4604
            ],
            [
                4604,
                4605
            ],
            [
                4606,
                4665
            ],
            [
                4670,
                4681
            ],
            [
                4681,
                4695
            ],
            [
                4703,
                4744
            ],
            [
                4745,
                4794
            ],
            [
                4795,
                4815
            ],
            [
                4820,
                4853
            ],
            [
                4855,
                4913
            ],
            [
                4913,
                4915
            ],
            [
                4915,
                4918
            ],
            [
                4927,
                5031
            ],
            [
                5031,
                5076
            ],
            [
                5077,
                5087
            ],
            [
                5087,
                5089
            ],
            [
                5089,
                5110
            ],
            [
                5111,
                5132
            ],
            [
                5132,
                5319
            ],
            [
                5320,
                5399
            ],
            [
                5399,
                5406
            ],
            [
                5412,
                5421
            ],
            [
                5422,
                5475
            ],
            [
                5475,
                5547
            ],
            [
                5547,
                5671
            ],
            [
                5671,
                5681
            ],
            [
                5696,
                5709
            ],
            [
                5709,
                5718
            ],
            [
                5721,
                5727
            ],
            [
                5730,
                5737
            ],
            [
                5740,
                5768
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5878
            ],
            [
                5879,
                5925
            ],
            [
                5950,
                6048
            ],
            [
                6048,
                6072
            ],
            [
                6072,
                6073
            ],
            [
                6074,
                6082
            ],
            [
                6083,
                6086
            ],
            [
                6087,
                6096
            ],
            [
                6097,
                6103
            ],
            [
                6107,
                6138
            ],
            [
                6139,
                6141
            ],
            [
                6142,
                6154
            ],
            [
                6166,
                6168
            ],
            [
                6168,
                6255
            ],
            [
                6256,
                6291
            ],
            [
                6291,
                6321
            ],
            [
                6324,
                6364
            ],
            [
                6367,
                6384
            ],
            [
                6385,
                6404
            ],
            [
                6404,
                6406
            ],
            [
                6416,
                6435
            ],
            [
                6445,
                6532
            ],
            [
                6532,
                6538
            ],
            [
                6538,
                6559
            ],
            [
                6559,
                6607
            ],
            [
                6607,
                6644
            ],
            [
                6645,
                6651
            ],
            [
                6652,
                6662
            ],
            [
                6663,
                6686
            ],
            [
                6691,
                6722
            ],
            [
                6722,
                6740
            ],
            [
                6741,
                6749
            ],
            [
                6749,
                6751
            ],
            [
                6751,
                6754
            ],
            [
                6761,
                6812
            ],
            [
                6812,
                6827
            ],
            [
                6827,
                6854
            ],
            [
                6854,
                6877
            ],
            [
                6877,
                6905
            ],
            [
                6905,
                6970
            ],
            [
                6971,
                6973
            ],
            [
                6974,
                6981
            ],
            [
                6982,
                6990
            ],
            [
                6991,
                6995
            ],
            [
                6995,
                6996
            ],
            [
                6997,
                7023
            ],
            [
                7024,
                7100
            ],
            [
                7109,
                7121
            ],
            [
                7121,
                7123
            ],
            [
                7123,
                7137
            ],
            [
                7145,
                7189
            ],
            [
                7190,
                7193
            ],
            [
                7194,
                7218
            ],
            [
                7219,
                7252
            ],
            [
                7252,
                7272
            ],
            [
                7280,
                7312
            ],
            [
                7315,
                7340
            ],
            [
                7340,
                7342
            ],
            [
                7347,
                7378
            ],
            [
                7379,
                7405
            ],
            [
                7405,
                7457
            ],
            [
                7458,
                7519
            ],
            [
                7522,
                7530
            ],
            [
                7530,
                7532
            ],
            [
                7532,
                7538
            ],
            [
                7543,
                7598
            ],
            [
                7598,
                7599
            ],
            [
                7600,
                7603
            ],
            [
                7604,
                7611
            ],
            [
                7612,
                7615
            ],
            [
                7616,
                7622
            ],
            [
                7623,
                7645
            ],
            [
                7646,
                7649
            ],
            [
                7656,
                7681
            ],
            [
                7684,
                7695
            ],
            [
                7696,
                7712
            ],
            [
                7712,
                7716
            ],
            [
                7716,
                7717
            ],
            [
                7718,
                7796
            ],
            [
                7797,
                7811
            ],
            [
                7811,
                7838
            ],
            [
                7839,
                7844
            ],
            [
                7846,
                7848
            ],
            [
                7848,
                7861
            ],
            [
                7862,
                7906
            ],
            [
                7906,
                7908
            ],
            [
                7908,
                7917
            ],
            [
                7927,
                7942
            ],
            [
                7952,
                8025
            ],
            [
                8025,
                8041
            ],
            [
                8045,
                8047
            ],
            [
                8047,
                8056
            ],
            [
                8057,
                8077
            ],
            [
                8077,
                8078
            ],
            [
                8079,
                8083
            ],
            [
                8092,
                8099
            ],
            [
                8100,
                8106
            ],
            [
                8107,
                8111
            ],
            [
                8112,
                8164
            ],
            [
                8167,
                8170
            ],
            [
                8170,
                8171
            ],
            [
                8172,
                8230
            ],
            [
                8235,
                8268
            ],
            [
                8269,
                8280
            ],
            [
                8283,
                8317
            ],
            [
                8317,
                8359
            ],
            [
                8360,
                8420
            ],
            [
                8424,
                8425
            ],
            [
                8426,
                8440
            ],
            [
                8441,
                8442
            ],
            [
                8442,
                8498
            ],
            [
                8501,
                8519
            ],
            [
                8519,
                8533
            ],
            [
                8536,
                8542
            ],
            [
                8545,
                8550
            ],
            [
                8553,
                8613
            ],
            [
                8613,
                8646
            ],
            [
                8647,
                8664
            ],
            [
                8665,
                8704
            ],
            [
                8711,
                8713
            ],
            [
                8724,
                8727
            ],
            [
                8729,
                8735
            ],
            [
                8736,
                8757
            ],
            [
                8757,
                8787
            ],
            [
                8787,
                8854
            ],
            [
                8855,
                8898
            ],
            [
                8898,
                8972
            ],
            [
                8972,
                9022
            ],
            [
                9022,
                9064
            ],
            [
                9064,
                9092
            ],
            [
                9092,
                9094
            ],
            [
                9099,
                9114
            ],
            [
                9115,
                9151
            ],
            [
                9151,
                9194
            ],
            [
                9194,
                9255
            ],
            [
                9255,
                9257
            ],
            [
                9257,
                9297
            ],
            [
                9300,
                9337
            ],
            [
                9337,
                9349
            ],
            [
                9350,
                9372
            ],
            [
                9372,
                9463
            ],
            [
                9463,
                9470
            ],
            [
                9473,
                9491
            ],
            [
                9491,
                9493
            ],
            [
                9493,
                9529
            ],
            [
                9529,
                9570
            ],
            [
                9570,
                9572
            ],
            [
                9572,
                9625
            ],
            [
                9629,
                9632
            ],
            [
                9652,
                9666
            ],
            [
                9667,
                9718
            ],
            [
                9728,
                9770
            ],
            [
                9770,
                9808
            ],
            [
                9809,
                9907
            ],
            [
                9907,
                9938
            ],
            [
                9939,
                10050
            ],
            [
                10050,
                10076
            ],
            [
                10079,
                10117
            ],
            [
                10118,
                10136
            ],
            [
                10136,
                10159
            ],
            [
                10159,
                10221
            ],
            [
                10221,
                10223
            ],
            [
                10223,
                10302
            ],
            [
                10303,
                10367
            ],
            [
                10367,
                10370
            ],
            [
                10383,
                10392
            ],
            [
                10393,
                10416
            ],
            [
                10417,
                10439
            ],
            [
                10440,
                10460
            ],
            [
                10461,
                10506
            ],
            [
                10510,
                10604
            ],
            [
                10605,
                10609
            ],
            [
                10611,
                10621
            ],
            [
                10621,
                10649
            ],
            [
                10649,
                10653
            ],
            [
                10655,
                10665
            ],
            [
                10665,
                10668
            ],
            [
                10670,
                10725
            ],
            [
                10725,
                10773
            ],
            [
                10783,
                10789
            ],
            [
                10790,
                10802
            ],
            [
                10803,
                10806
            ],
            [
                10806,
                10808
            ],
            [
                10808,
                10820
            ],
            [
                10824,
                10826
            ],
            [
                10826,
                10852
            ],
            [
                10852,
                10854
            ],
            [
                10854,
                10884
            ],
            [
                10887,
                10921
            ],
            [
                10922,
                11066
            ],
            [
                11067,
                11077
            ],
            [
                11085,
                11088
            ],
            [
                11093,
                11185
            ],
            [
                11186,
                11206
            ],
            [
                11206,
                11219
            ],
            [
                11219,
                11220
            ],
            [
                11220,
                11245
            ],
            [
                11245,
                11262
            ],
            [
                11271,
                11347
            ],
            [
                11348,
                11396
            ],
            [
                11396,
                11405
            ],
            [
                11406,
                11428
            ],
            [
                11428,
                11484
            ],
            [
                11484,
                11506
            ],
            [
                11506,
                11527
            ],
            [
                11527,
                11552
            ],
            [
                11561,
                11562
            ],
            [
                11563,
                11566
            ],
            [
                11574,
                11653
            ],
            [
                11654,
                11663
            ],
            [
                11663,
                11664
            ],
            [
                11665,
                11715
            ],
            [
                11715,
                11743
            ],
            [
                11749,
                11789
            ],
            [
                11789,
                11822
            ],
            [
                11822,
                11861
            ],
            [
                11861,
                11884
            ],
            [
                11890,
                11899
            ],
            [
                11900,
                11934
            ],
            [
                11935,
                11956
            ],
            [
                11956,
                12024
            ],
            [
                12024,
                12047
            ],
            [
                12047,
                12075
            ],
            [
                12078,
                12096
            ],
            [
                12099,
                12137
            ],
            [
                12145,
                12157
            ],
            [
                12169,
                12176
            ],
            [
                12176,
                12178
            ],
            [
                12178,
                12235
            ],
            [
                12235,
                12275
            ],
            [
                12275,
                12330
            ],
            [
                12331,
                12387
            ],
            [
                12391,
                12414
            ],
            [
                12414,
                12462
            ],
            [
                12465,
                12503
            ],
            [
                12503,
                12551
            ],
            [
                12551,
                12591
            ],
            [
                12592,
                12609
            ],
            [
                12610,
                12615
            ],
            [
                12618,
                12646
            ],
            [
                12652,
                12663
            ],
            [
                12663,
                12665
            ],
            [
                12665,
                12689
            ],
            [
                12689,
                12702
            ],
            [
                12702,
                12708
            ],
            [
                12713,
                12723
            ],
            [
                12723,
                12736
            ],
            [
                12742,
                12748
            ],
            [
                12754,
                12794
            ],
            [
                12794,
                12820
            ],
            [
                12821,
                12844
            ],
            [
                12844,
                12901
            ],
            [
                12901,
                12966
            ],
            [
                12969,
                13001
            ],
            [
                13001,
                13030
            ],
            [
                13030,
                13068
            ],
            [
                13068,
                13109
            ],
            [
                13109,
                13150
            ],
            [
                13151,
                13182
            ],
            [
                13182,
                13183
            ],
            [
                13184,
                13218
            ],
            [
                13218,
                13220
            ],
            [
                13220,
                13236
            ],
            [
                13242,
                13276
            ],
            [
                13287,
                13320
            ],
            [
                13321,
                13339
            ],
            [
                13339,
                13397
            ],
            [
                13397,
                13399
            ],
            [
                13399,
                13426
            ],
            [
                13426,
                13449
            ],
            [
                13449,
                13451
            ],
            [
                13451,
                13486
            ],
            [
                13486,
                13506
            ],
            [
                13507,
                13529
            ],
            [
                13530,
                13541
            ],
            [
                13547,
                13573
            ],
            [
                13585,
                13598
            ],
            [
                13598,
                13631
            ],
            [
                13631,
                13633
            ],
            [
                13633,
                13697
            ],
            [
                13697,
                13734
            ],
            [
                13735,
                13790
            ],
            [
                13791,
                13816
            ],
            [
                13825,
                13894
            ],
            [
                13894,
                13907
            ],
            [
                13908,
                13924
            ],
            [
                13925,
                13964
            ],
            [
                13964,
                13975
            ],
            [
                13975,
                13994
            ],
            [
                13994,
                14017
            ],
            [
                14017,
                14049
            ],
            [
                14053,
                14058
            ],
            [
                14059,
                14129
            ],
            [
                14129,
                14145
            ],
            [
                14146,
                14161
            ],
            [
                14162,
                14221
            ],
            [
                14221,
                14254
            ],
            [
                14255,
                14302
            ],
            [
                14302,
                14350
            ],
            [
                14367,
                14385
            ],
            [
                14385,
                14386
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                222
            ],
            [
                222,
                378
            ],
            [
                378,
                597
            ],
            [
                597,
                754
            ],
            [
                754,
                1225
            ],
            [
                1225,
                1305
            ],
            [
                1305,
                1355
            ],
            [
                1355,
                1451
            ],
            [
                1451,
                1451
            ],
            [
                1451,
                1656
            ],
            [
                1656,
                1736
            ],
            [
                1736,
                1802
            ],
            [
                1802,
                1863
            ],
            [
                1863,
                1917
            ],
            [
                1917,
                1929
            ],
            [
                1929,
                1929
            ],
            [
                1929,
                1986
            ],
            [
                1986,
                2074
            ],
            [
                2074,
                2195
            ],
            [
                2195,
                2304
            ],
            [
                2304,
                2377
            ],
            [
                2377,
                2597
            ],
            [
                2597,
                2681
            ],
            [
                2681,
                2800
            ],
            [
                2800,
                2958
            ],
            [
                2958,
                3072
            ],
            [
                3072,
                3084
            ],
            [
                3084,
                3107
            ],
            [
                3107,
                3163
            ],
            [
                3163,
                3229
            ],
            [
                3229,
                3307
            ],
            [
                3307,
                3395
            ],
            [
                3395,
                3443
            ],
            [
                3443,
                3506
            ],
            [
                3506,
                3606
            ],
            [
                3606,
                3751
            ],
            [
                3751,
                3933
            ],
            [
                3933,
                3948
            ],
            [
                3948,
                3996
            ],
            [
                3996,
                4142
            ],
            [
                4142,
                4389
            ],
            [
                4389,
                4446
            ],
            [
                4446,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4915
            ],
            [
                4915,
                5031
            ],
            [
                5031,
                5089
            ],
            [
                5089,
                5132
            ],
            [
                5132,
                5399
            ],
            [
                5399,
                5475
            ],
            [
                5475,
                5547
            ],
            [
                5547,
                5709
            ],
            [
                5709,
                5768
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5879
            ],
            [
                5879,
                6168
            ],
            [
                6168,
                6168
            ],
            [
                6168,
                6291
            ],
            [
                6291,
                6404
            ],
            [
                6404,
                6532
            ],
            [
                6532,
                6538
            ],
            [
                6538,
                6559
            ],
            [
                6559,
                6607
            ],
            [
                6607,
                6722
            ],
            [
                6722,
                6751
            ],
            [
                6751,
                6812
            ],
            [
                6812,
                6854
            ],
            [
                6854,
                6877
            ],
            [
                6877,
                6905
            ],
            [
                6905,
                6971
            ],
            [
                6971,
                7123
            ],
            [
                7123,
                7252
            ],
            [
                7252,
                7342
            ],
            [
                7342,
                7405
            ],
            [
                7405,
                7532
            ],
            [
                7532,
                7684
            ],
            [
                7684,
                7811
            ],
            [
                7811,
                7848
            ],
            [
                7848,
                7862
            ],
            [
                7862,
                7908
            ],
            [
                7908,
                8025
            ],
            [
                8025,
                8047
            ],
            [
                8047,
                8172
            ],
            [
                8172,
                8317
            ],
            [
                8317,
                8317
            ],
            [
                8317,
                8426
            ],
            [
                8426,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8613
            ],
            [
                8613,
                8713
            ],
            [
                8713,
                8757
            ],
            [
                8757,
                8787
            ],
            [
                8787,
                8898
            ],
            [
                8898,
                8972
            ],
            [
                8972,
                9022
            ],
            [
                9022,
                9064
            ],
            [
                9064,
                9094
            ],
            [
                9094,
                9151
            ],
            [
                9151,
                9194
            ],
            [
                9194,
                9194
            ],
            [
                9194,
                9257
            ],
            [
                9257,
                9337
            ],
            [
                9337,
                9372
            ],
            [
                9372,
                9463
            ],
            [
                9463,
                9471
            ],
            [
                9471,
                9493
            ],
            [
                9493,
                9529
            ],
            [
                9529,
                9572
            ],
            [
                9572,
                9625
            ],
            [
                9625,
                9770
            ],
            [
                9770,
                9907
            ],
            [
                9907,
                10050
            ],
            [
                10050,
                10118
            ],
            [
                10118,
                10136
            ],
            [
                10136,
                10159
            ],
            [
                10159,
                10223
            ],
            [
                10223,
                10303
            ],
            [
                10303,
                10367
            ],
            [
                10367,
                10460
            ],
            [
                10460,
                10460
            ],
            [
                10460,
                10506
            ],
            [
                10506,
                10605
            ],
            [
                10605,
                10621
            ],
            [
                10621,
                10649
            ],
            [
                10649,
                10665
            ],
            [
                10665,
                10725
            ],
            [
                10725,
                10808
            ],
            [
                10808,
                10826
            ],
            [
                10826,
                10826
            ],
            [
                10826,
                10854
            ],
            [
                10854,
                11067
            ],
            [
                11067,
                11186
            ],
            [
                11186,
                11206
            ],
            [
                11206,
                11219
            ],
            [
                11219,
                11245
            ],
            [
                11245,
                11348
            ],
            [
                11348,
                11396
            ],
            [
                11396,
                11428
            ],
            [
                11428,
                11484
            ],
            [
                11484,
                11506
            ],
            [
                11506,
                11527
            ],
            [
                11527,
                11552
            ],
            [
                11552,
                11665
            ],
            [
                11665,
                11715
            ],
            [
                11715,
                11789
            ],
            [
                11789,
                11822
            ],
            [
                11822,
                11861
            ],
            [
                11861,
                11900
            ],
            [
                11900,
                11935
            ],
            [
                11935,
                11956
            ],
            [
                11956,
                12024
            ],
            [
                12024,
                12047
            ],
            [
                12047,
                12078
            ],
            [
                12078,
                12099
            ],
            [
                12099,
                12178
            ],
            [
                12178,
                12275
            ],
            [
                12275,
                12387
            ],
            [
                12387,
                12414
            ],
            [
                12414,
                12503
            ],
            [
                12503,
                12551
            ],
            [
                12551,
                12665
            ],
            [
                12665,
                12689
            ],
            [
                12689,
                12702
            ],
            [
                12702,
                12723
            ],
            [
                12723,
                12844
            ],
            [
                12844,
                12901
            ],
            [
                12901,
                13001
            ],
            [
                13001,
                13030
            ],
            [
                13030,
                13068
            ],
            [
                13068,
                13109
            ],
            [
                13109,
                13220
            ],
            [
                13220,
                13339
            ],
            [
                13339,
                13399
            ],
            [
                13399,
                13451
            ],
            [
                13451,
                13486
            ],
            [
                13486,
                13507
            ],
            [
                13507,
                13598
            ],
            [
                13598,
                13633
            ],
            [
                13633,
                13697
            ],
            [
                13697,
                13791
            ],
            [
                13791,
                13894
            ],
            [
                13894,
                13925
            ],
            [
                13925,
                13964
            ],
            [
                13964,
                13975
            ],
            [
                13975,
                13994
            ],
            [
                13994,
                14017
            ],
            [
                14017,
                14129
            ],
            [
                14129,
                14221
            ],
            [
                14221,
                14302
            ],
            [
                14302,
                14386
            ]
        ]
    }
}