{
    "original": {
        "text": "The mansion of Sir Pitt Crawley, in Great Gaunt Street, was just beginning to dress itself for the day, as Rawdon, in his evening costume, which he had now worn two days, passed by the scared female who was scouring the steps and entered into his brother's study. Lady Jane, in her morning-gown, was up and above stairs in the nursery superintending the toilettes of her children and listening to the morning prayers which the little creatures performed at her knee. Every morning she and they performed this duty privately, and before the public ceremonial at which Sir Pitt presided and at which all the people of the household were expected to assemble. Rawdon sat down in the study before the Baronet's table, set out with the orderly blue books and the letters, the neatly docketed bills and symmetrical pamphlets, the locked account-books, desks, and dispatch boxes, the Bible, the Quarterly Review, and the Court Guide, which all stood as if on parade awaiting the inspection of their chief.\nA book of family sermons, one of which Sir Pitt was in the habit of administering to his family on Sunday mornings, lay ready on the study table, and awaiting his judicious selection. And by the sermon-book was the Observer newspaper, damp and neatly folded, and for Sir Pitt's own private use. His gentleman alone took the opportunity of perusing the newspaper before he laid it by his master's desk. Before he had brought it into the study that morning, he had read in the journal a flaming account of \"Festivities at Gaunt House,\" with the names of all the distinguished personages invited by the Marquis of Steyne to meet his Royal Highness. Having made comments upon this entertainment to the housekeeper and her niece as they were taking early tea and hot buttered toast in the former lady's apartment, and wondered how the Rawding Crawleys could git on, the valet had damped and folded the paper once more, so that it looked quite fresh and innocent against the arrival of the master of the house.\nPoor Rawdon took up the paper and began to try and read it until his brother should arrive. But the print fell blank upon his eyes, and he did not know in the least what he was reading. The Government news and appointments (which Sir Pitt as a public man was bound to peruse, otherwise he would by no means permit the introduction of Sunday papers into his household), the theatrical criticisms, the fight for a hundred pounds a side between the Barking Butcher and the Tutbury Pet, the Gaunt House chronicle itself, which contained a most complimentary though guarded account of the famous charades of which Mrs. Becky had been the heroine--all these passed as in a haze before Rawdon, as he sat waiting the arrival of the chief of the family.\nPunctually, as the shrill-toned bell of the black marble study clock began to chime nine, Sir Pitt made his appearance, fresh, neat, smugly shaved, with a waxy clean face, and stiff shirt collar, his scanty hair combed and oiled, trimming his nails as he descended the stairs majestically, in a starched cravat and a grey flannel dressing-gown--a real old English gentleman, in a word--a model of neatness and every propriety. He started when he saw poor Rawdon in his study in tumbled clothes, with blood-shot eyes, and his hair over his face. He thought his brother was not sober, and had been out all night on some orgy. \"Good gracious, Rawdon,\" he said, with a blank face, \"what brings you here at this time of the morning? Why ain't you at home?\"\n\"Home,\" said Rawdon with a wild laugh. \"Don't be frightened, Pitt. I'm not drunk. Shut the door; I want to speak to you.\"\nPitt closed the door and came up to the table, where he sat down in the other arm-chair--that one placed for the reception of the steward, agent, or confidential visitor who came to transact business with the Baronet--and trimmed his nails more vehemently than ever.\n\"Pitt, it's all over with me,\" the Colonel said after a pause. \"I'm done.\"\n\"I always said it would come to this,\" the Baronet cried peevishly, and beating a tune with his clean-trimmed nails. \"I warned you a thousand times. I can't help you any more. Every shilling of my money is tied up. Even the hundred pounds that Jane took you last night were promised to my lawyer to-morrow morning, and the want of it will put me to great inconvenience. I don't mean to say that I won't assist you ultimately. But as for paying your creditors in full, I might as well hope to pay the National Debt. It is madness, sheer madness, to think of such a thing. You must come to a compromise. It's a painful thing for the family, but everybody does it. There was George Kitely, Lord Ragland's son, went through the Court last week, and was what they call whitewashed, I believe. Lord Ragland would not pay a shilling for him, and--\"\n\"It's not money I want,\" Rawdon broke in. \"I'm not come to you about myself. Never mind what happens to me.\"\n\"What is the matter, then?\" said Pitt, somewhat relieved.\n\"It's the boy,\" said Rawdon in a husky voice. \"I want you to promise me that you will take charge of him when I'm gone. That dear good wife of yours has always been good to him; and he's fonder of her than he is of his . . .--Damn it. Look here, Pitt--you know that I was to have had Miss Crawley's money. I wasn't brought up like a younger brother, but was always encouraged to be extravagant and kep idle. But for this I might have been quite a different man. I didn't do my duty with the regiment so bad. You know how I was thrown over about the money, and who got it.\"\n\"After the sacrifices I have made, and the manner in which I have stood by you, I think this sort of reproach is useless,\" Sir Pitt said. \"Your marriage was your own doing, not mine.\"\n\"That's over now,\" said Rawdon. \"That's over now.\" And the words were wrenched from him with a groan, which made his brother start.\n\"Good God! is she dead?\" Sir Pitt said with a voice of genuine alarm and commiseration.\n\"I wish I was,\" Rawdon replied. \"If it wasn't for little Rawdon I'd have cut my throat this morning--and that damned villain's too.\"\nSir Pitt instantly guessed the truth and surmised that Lord Steyne was the person whose life Rawdon wished to take. The Colonel told his senior briefly, and in broken accents, the circumstances of the case. \"It was a regular plan between that scoundrel and her,\" he said. \"The bailiffs were put upon me; I was taken as I was going out of his house; when I wrote to her for money, she said she was ill in bed and put me off to another day. And when I got home I found her in diamonds and sitting with that villain alone.\" He then went on to describe hurriedly the personal conflict with Lord Steyne. To an affair of that nature, of course, he said, there was but one issue, and after his conference with his brother, he was going away to make the necessary arrangements for the meeting which must ensue. \"And as it may end fatally with me,\" Rawdon said with a broken voice, \"and as the boy has no mother, I must leave him to you and Jane, Pitt--only it will be a comfort to me if you will promise me to be his friend.\"\nThe elder brother was much affected, and shook Rawdon's hand with a cordiality seldom exhibited by him. Rawdon passed his hand over his shaggy eyebrows. \"Thank you, brother,\" said he. \"I know I can trust your word.\"\n\"I will, upon my honour,\" the Baronet said. And thus, and almost mutely, this bargain was struck between them.\nThen Rawdon took out of his pocket the little pocket-book which he had discovered in Becky's desk, and from which he drew a bundle of the notes which it contained. \"Here's six hundred,\" he said--\"you didn't know I was so rich. I want you to give the money to Briggs, who lent it to us--and who was kind to the boy--and I've always felt ashamed of having taken the poor old woman's money. And here's some more--I've only kept back a few pounds--which Becky may as well have, to get on with.\" As he spoke he took hold of the other notes to give to his brother, but his hands shook, and he was so agitated that the pocket-book fell from him, and out of it the thousand-pound note which had been the last of the unlucky Becky's winnings.\nPitt stooped and picked them up, amazed at so much wealth. \"Not that,\" Rawdon said. \"I hope to put a bullet into the man whom that belongs to.\" He had thought to himself, it would be a fine revenge to wrap a ball in the note and kill Steyne with it.\nAfter this colloquy the brothers once more shook hands and parted. Lady Jane had heard of the Colonel's arrival, and was waiting for her husband in the adjoining dining-room, with female instinct, auguring evil. The door of the dining-room happened to be left open, and the lady of course was issuing from it as the two brothers passed out of the study. She held out her hand to Rawdon and said she was glad he was come to breakfast, though she could perceive, by his haggard unshorn face and the dark looks of her husband, that there was very little question of breakfast between them. Rawdon muttered some excuses about an engagement, squeezing hard the timid little hand which his sister-in-law reached out to him. Her imploring eyes could read nothing but calamity in his face, but he went away without another word. Nor did Sir Pitt vouchsafe her any explanation. The children came up to salute him, and he kissed them in his usual frigid manner. The mother took both of them close to herself, and held a hand of each of them as they knelt down to prayers, which Sir Pitt read to them, and to the servants in their Sunday suits or liveries, ranged upon chairs on the other side of the hissing tea-urn. Breakfast was so late that day, in consequence of the delays which had occurred, that the church-bells began to ring whilst they were sitting over their meal; and Lady Jane was too ill, she said, to go to church, though her thoughts had been entirely astray during the period of family devotion.\nRawdon Crawley meanwhile hurried on from Great Gaunt Street, and knocking at the great bronze Medusa's head which stands on the portal of Gaunt House, brought out the purple Silenus in a red and silver waistcoat who acts as porter of that palace. The man was scared also by the Colonel's dishevelled appearance, and barred the way as if afraid that the other was going to force it. But Colonel Crawley only took out a card and enjoined him particularly to send it in to Lord Steyne, and to mark the address written on it, and say that Colonel Crawley would be all day after one o'clock at the Regent Club in St. James's Street--not at home. The fat red-faced man looked after him with astonishment as he strode away; so did the people in their Sunday clothes who were out so early; the charity-boys with shining faces, the greengrocer lolling at his door, and the publican shutting his shutters in the sunshine, against service commenced. The people joked at the cab-stand about his appearance, as he took a carriage there, and told the driver to drive him to Knightsbridge Barracks.\nAll the bells were jangling and tolling as he reached that place. He might have seen his old acquaintance Amelia on her way from Brompton to Russell Square, had he been looking out. Troops of schools were on their march to church, the shiny pavement and outsides of coaches in the suburbs were thronged with people out upon their Sunday pleasure; but the Colonel was much too busy to take any heed of these phenomena, and, arriving at Knightsbridge, speedily made his way up to the room of his old friend and comrade Captain Macmurdo, who Crawley found, to his satisfaction, was in barracks.\nCaptain Macmurdo, a veteran officer and Waterloo man, greatly liked by his regiment, in which want of money alone prevented him from attaining the highest ranks, was enjoying the forenoon calmly in bed. He had been at a fast supper-party, given the night before by Captain the Honourable George Cinqbars, at his house in Brompton Square, to several young men of the regiment, and a number of ladies of the corps de ballet, and old Mac, who was at home with people of all ages and ranks, and consorted with generals, dog-fanciers, opera-dancers, bruisers, and every kind of person, in a word, was resting himself after the night's labours, and, not being on duty, was in bed.\nHis room was hung round with boxing, sporting, and dancing pictures, presented to him by comrades as they retired from the regiment, and married and settled into quiet life. And as he was now nearly fifty years of age, twenty-four of which he had passed in the corps, he had a singular museum. He was one of the best shots in England, and, for a heavy man, one of the best riders; indeed, he and Crawley had been rivals when the latter was in the Army. To be brief, Mr. Macmurdo was lying in bed, reading in Bell's Life an account of that very fight between the Tutbury Pet and the Barking Butcher, which has been before mentioned--a venerable bristly warrior, with a little close-shaved grey head, with a silk nightcap, a red face and nose, and a great dyed moustache.\nWhen Rawdon told the Captain he wanted a friend, the latter knew perfectly well on what duty of friendship he was called to act, and indeed had conducted scores of affairs for his acquaintances with the greatest prudence and skill. His Royal Highness the late lamented Commander-in-Chief had had the greatest regard for Macmurdo on this account, and he was the common refuge of gentlemen in trouble.\n\"What's the row about, Crawley, my boy?\" said the old warrior. \"No more gambling business, hay, like that when we shot Captain Marker?\"\n\"It's about--about my wife,\" Crawley answered, casting down his eyes and turning very red.\nThe other gave a whistle. \"I always said she'd throw you over,\" he began--indeed there were bets in the regiment and at the clubs regarding the probable fate of Colonel Crawley, so lightly was his wife's character esteemed by his comrades and the world; but seeing the savage look with which Rawdon answered the expression of this opinion, Macmurdo did not think fit to enlarge upon it further.\n\"Is there no way out of it, old boy?\" the Captain continued in a grave tone. \"Is it only suspicion, you know, or--or what is it? Any letters? Can't you keep it quiet? Best not make any noise about a thing of that sort if you can help it.\" \"Think of his only finding her out now,\" the Captain thought to himself, and remembered a hundred particular conversations at the mess-table, in which Mrs. Crawley's reputation had been torn to shreds.\n\"There's no way but one out of it,\" Rawdon replied--\"and there's only a way out of it for one of us, Mac--do you understand? I was put out of the way--arrested--I found 'em alone together. I told him he was a liar and a coward, and knocked him down and thrashed him.\"\n\"Serve him right,\" Macmurdo said. \"Who is it?\"\nRawdon answered it was Lord Steyne.\n\"The deuce! a Marquis! they said he--that is, they said you--\"\n\"What the devil do you mean?\" roared out Rawdon; \"do you mean that you ever heard a fellow doubt about my wife and didn't tell me, Mac?\"\n\"The world's very censorious, old boy,\" the other replied. \"What the deuce was the good of my telling you what any tom-fools talked about?\"\n\"It was damned unfriendly, Mac,\" said Rawdon, quite overcome; and, covering his face with his hands, he gave way to an emotion, the sight of which caused the tough old campaigner opposite him to wince with sympathy. \"Hold up, old boy,\" he said; \"great man or not, we'll put a bullet in him, damn him. As for women, they're all so.\"\n\"You don't know how fond I was of that one,\" Rawdon said, half-inarticulately. \"Damme, I followed her like a footman. I gave up everything I had to her. I'm a beggar because I would marry her. By Jove, sir, I've pawned my own watch in order to get her anything she fancied; and she--she's been making a purse for herself all the time, and grudged me a hundred pound to get me out of quod.\" He then fiercely and incoherently, and with an agitation under which his counsellor had never before seen him labour, told Macmurdo the circumstances of the story. His adviser caught at some stray hints in it. \"She may be innocent, after all,\" he said. \"She says so. Steyne has been a hundred times alone with her in the house before.\"\n\"It may be so,\" Rawdon answered sadly, \"but this don't look very innocent\": and he showed the Captain the thousand-pound note which he had found in Becky's pocket-book. \"This is what he gave her, Mac, and she kep it unknown to me; and with this money in the house, she refused to stand by me when I was locked up.\" The Captain could not but own that the secreting of the money had a very ugly look.\nWhilst they were engaged in their conference, Rawdon dispatched Captain Macmurdo's servant to Curzon Street, with an order to the domestic there to give up a bag of clothes of which the Colonel had great need. And during the man's absence, and with great labour and a Johnson's Dictionary, which stood them in much stead, Rawdon and his second composed a letter, which the latter was to send to Lord Steyne. Captain Macmurdo had the honour of waiting upon the Marquis of Steyne, on the part of Colonel Rawdon Crawley, and begged to intimate that he was empowered by the Colonel to make any arrangements for the meeting which, he had no doubt, it was his Lordship's intention to demand, and which the circumstances of the morning had rendered inevitable. Captain Macmurdo begged Lord Steyne, in the most polite manner, to appoint a friend, with whom he (Captain M.M.) might communicate, and desired that the meeting might take place with as little delay as possible.\nIn a postscript the Captain stated that he had in his possession a bank-note for a large amount, which Colonel Crawley had reason to suppose was the property of the Marquis of Steyne. And he was anxious, on the Colonel's behalf, to give up the note to its owner.\nBy the time this note was composed, the Captain's servant returned from his mission to Colonel Crawley's house in Curzon Street, but without the carpet-bag and portmanteau, for which he had been sent, and with a very puzzled and odd face.\n\"They won't give 'em up,\" said the man; \"there's a regular shinty in the house, and everything at sixes and sevens. The landlord's come in and took possession. The servants was a drinkin' up in the drawingroom. They said--they said you had gone off with the plate, Colonel\"--the man added after a pause--\"One of the servants is off already. And Simpson, the man as was very noisy and drunk indeed, says nothing shall go out of the house until his wages is paid up.\"\nThe account of this little revolution in May Fair astonished and gave a little gaiety to an otherwise very triste conversation. The two officers laughed at Rawdon's discomfiture.\n\"I'm glad the little 'un isn't at home,\" Rawdon said, biting his nails. \"You remember him, Mac, don't you, in the Riding School? How he sat the kicker to be sure! didn't he?\"\n\"That he did, old boy,\" said the good-natured Captain.\nLittle Rawdon was then sitting, one of fifty gown boys, in the Chapel of Whitefriars School, thinking, not about the sermon, but about going home next Saturday, when his father would certainly tip him and perhaps would take him to the play.\n\"He's a regular trump, that boy,\" the father went on, still musing about his son. \"I say, Mac, if anything goes wrong--if I drop--I should like you to--to go and see him, you know, and say that I was very fond of him, and that. And--dash it--old chap, give him these gold sleeve-buttons: it's all I've got.\" He covered his face with his black hands, over which the tears rolled and made furrows of white. Mr. Macmurdo had also occasion to take off his silk night-cap and rub it across his eyes.\n\"Go down and order some breakfast,\" he said to his man in a loud cheerful voice. \"What'll you have, Crawley? Some devilled kidneys and a herring--let's say. And, Clay, lay out some dressing things for the Colonel: we were always pretty much of a size, Rawdon, my boy, and neither of us ride so light as we did when we first entered the corps.\" With which, and leaving the Colonel to dress himself, Macmurdo turned round towards the wall, and resumed the perusal of Bell's Life, until such time as his friend's toilette was complete and he was at liberty to commence his own.\nThis, as he was about to meet a lord, Captain Macmurdo performed with particular care. He waxed his mustachios into a state of brilliant polish and put on a tight cravat and a trim buff waistcoat, so that all the young officers in the mess-room, whither Crawley had preceded his friend, complimented Mac on his appearance at breakfast and asked if he was going to be married that Sunday.",
        "paragraph_chars": [
            [
                0,
                999
            ],
            [
                999,
                2004
            ],
            [
                2004,
                2749
            ],
            [
                2749,
                3501
            ],
            [
                3501,
                3623
            ],
            [
                3623,
                3890
            ],
            [
                3890,
                3965
            ],
            [
                3965,
                4807
            ],
            [
                4807,
                4916
            ],
            [
                4916,
                4974
            ],
            [
                4974,
                5547
            ],
            [
                5547,
                5731
            ],
            [
                5731,
                5863
            ],
            [
                5863,
                5951
            ],
            [
                5951,
                6084
            ],
            [
                6084,
                7102
            ],
            [
                7102,
                7318
            ],
            [
                7318,
                7429
            ],
            [
                7429,
                8163
            ],
            [
                8163,
                8413
            ],
            [
                8413,
                9916
            ],
            [
                9916,
                11000
            ],
            [
                11000,
                11592
            ],
            [
                11592,
                12267
            ],
            [
                12267,
                13037
            ],
            [
                13037,
                13437
            ],
            [
                13437,
                13573
            ],
            [
                13573,
                13664
            ],
            [
                13664,
                14059
            ],
            [
                14059,
                14500
            ],
            [
                14500,
                14768
            ],
            [
                14768,
                14815
            ],
            [
                14815,
                14851
            ],
            [
                14851,
                14914
            ],
            [
                14914,
                15051
            ],
            [
                15051,
                15191
            ],
            [
                15191,
                15523
            ],
            [
                15523,
                16249
            ],
            [
                16249,
                16648
            ],
            [
                16648,
                17614
            ],
            [
                17614,
                17877
            ],
            [
                17877,
                18116
            ],
            [
                18116,
                18582
            ],
            [
                18582,
                18761
            ],
            [
                18761,
                18936
            ],
            [
                18936,
                18991
            ],
            [
                18991,
                19232
            ],
            [
                19232,
                19727
            ],
            [
                19727,
                20302
            ],
            [
                20302,
                20689
            ]
        ],
        "segment_chars": [
            [
                0,
                264
            ],
            [
                264,
                467
            ],
            [
                467,
                657
            ],
            [
                657,
                999
            ],
            [
                999,
                1183
            ],
            [
                1183,
                1294
            ],
            [
                1294,
                1401
            ],
            [
                1401,
                1645
            ],
            [
                1645,
                2004
            ],
            [
                2004,
                2096
            ],
            [
                2096,
                2190
            ],
            [
                2190,
                2749
            ],
            [
                2749,
                3176
            ],
            [
                3176,
                3294
            ],
            [
                3294,
                3373
            ],
            [
                3373,
                3477
            ],
            [
                3477,
                3501
            ],
            [
                3501,
                3540
            ],
            [
                3540,
                3568
            ],
            [
                3568,
                3583
            ],
            [
                3583,
                3623
            ],
            [
                3623,
                3890
            ],
            [
                3890,
                3953
            ],
            [
                3953,
                3965
            ],
            [
                3965,
                4082
            ],
            [
                4082,
                4114
            ],
            [
                4114,
                4141
            ],
            [
                4141,
                4180
            ],
            [
                4180,
                4335
            ],
            [
                4335,
                4391
            ],
            [
                4391,
                4480
            ],
            [
                4480,
                4536
            ],
            [
                4536,
                4567
            ],
            [
                4567,
                4627
            ],
            [
                4627,
                4753
            ],
            [
                4753,
                4807
            ],
            [
                4807,
                4849
            ],
            [
                4849,
                4884
            ],
            [
                4884,
                4916
            ],
            [
                4916,
                4944
            ],
            [
                4944,
                4974
            ],
            [
                4974,
                5020
            ],
            [
                5020,
                5094
            ],
            [
                5094,
                5197
            ],
            [
                5197,
                5209
            ],
            [
                5209,
                5280
            ],
            [
                5280,
                5382
            ],
            [
                5382,
                5436
            ],
            [
                5436,
                5482
            ],
            [
                5482,
                5547
            ],
            [
                5547,
                5685
            ],
            [
                5685,
                5731
            ],
            [
                5731,
                5763
            ],
            [
                5763,
                5782
            ],
            [
                5782,
                5863
            ],
            [
                5863,
                5874
            ],
            [
                5874,
                5888
            ],
            [
                5888,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                6084
            ],
            [
                6084,
                6200
            ],
            [
                6200,
                6291
            ],
            [
                6291,
                6356
            ],
            [
                6356,
                6523
            ],
            [
                6523,
                6605
            ],
            [
                6605,
                6683
            ],
            [
                6683,
                6887
            ],
            [
                6887,
                7102
            ],
            [
                7102,
                7206
            ],
            [
                7206,
                7255
            ],
            [
                7255,
                7286
            ],
            [
                7286,
                7318
            ],
            [
                7318,
                7362
            ],
            [
                7362,
                7429
            ],
            [
                7429,
                7593
            ],
            [
                7593,
                7656
            ],
            [
                7656,
                7817
            ],
            [
                7817,
                7920
            ],
            [
                7920,
                8163
            ],
            [
                8163,
                8222
            ],
            [
                8222,
                8247
            ],
            [
                8247,
                8307
            ],
            [
                8307,
                8413
            ],
            [
                8413,
                8480
            ],
            [
                8480,
                8625
            ],
            [
                8625,
                8767
            ],
            [
                8767,
                9000
            ],
            [
                9000,
                9131
            ],
            [
                9131,
                9234
            ],
            [
                9234,
                9282
            ],
            [
                9282,
                9365
            ],
            [
                9365,
                9620
            ],
            [
                9620,
                9916
            ],
            [
                9916,
                10163
            ],
            [
                10163,
                10298
            ],
            [
                10298,
                10557
            ],
            [
                10557,
                10855
            ],
            [
                10855,
                11000
            ],
            [
                11000,
                11066
            ],
            [
                11066,
                11182
            ],
            [
                11182,
                11592
            ],
            [
                11592,
                11795
            ],
            [
                11795,
                12267
            ],
            [
                12267,
                12441
            ],
            [
                12441,
                12561
            ],
            [
                12561,
                12720
            ],
            [
                12720,
                13037
            ],
            [
                13037,
                13269
            ],
            [
                13269,
                13437
            ],
            [
                13437,
                13478
            ],
            [
                13478,
                13500
            ],
            [
                13500,
                13573
            ],
            [
                13573,
                13664
            ],
            [
                13664,
                13690
            ],
            [
                13690,
                14059
            ],
            [
                14059,
                14097
            ],
            [
                14097,
                14136
            ],
            [
                14136,
                14188
            ],
            [
                14188,
                14201
            ],
            [
                14201,
                14226
            ],
            [
                14226,
                14298
            ],
            [
                14298,
                14500
            ],
            [
                14500,
                14625
            ],
            [
                14625,
                14689
            ],
            [
                14689,
                14768
            ],
            [
                14768,
                14802
            ],
            [
                14802,
                14815
            ],
            [
                14815,
                14851
            ],
            [
                14851,
                14863
            ],
            [
                14863,
                14874
            ],
            [
                14874,
                14914
            ],
            [
                14914,
                14944
            ],
            [
                14944,
                15051
            ],
            [
                15051,
                15110
            ],
            [
                15110,
                15191
            ],
            [
                15191,
                15407
            ],
            [
                15407,
                15492
            ],
            [
                15492,
                15523
            ],
            [
                15523,
                15602
            ],
            [
                15602,
                15641
            ],
            [
                15641,
                15676
            ],
            [
                15676,
                15716
            ],
            [
                15716,
                15913
            ],
            [
                15913,
                16077
            ],
            [
                16077,
                16123
            ],
            [
                16123,
                16166
            ],
            [
                16166,
                16180
            ],
            [
                16180,
                16249
            ],
            [
                16249,
                16418
            ],
            [
                16418,
                16564
            ],
            [
                16564,
                16648
            ],
            [
                16648,
                16858
            ],
            [
                16858,
                17056
            ],
            [
                17056,
                17402
            ],
            [
                17402,
                17515
            ],
            [
                17515,
                17614
            ],
            [
                17614,
                17798
            ],
            [
                17798,
                17877
            ],
            [
                17877,
                18116
            ],
            [
                18116,
                18232
            ],
            [
                18232,
                18276
            ],
            [
                18276,
                18327
            ],
            [
                18327,
                18457
            ],
            [
                18457,
                18582
            ],
            [
                18582,
                18710
            ],
            [
                18710,
                18761
            ],
            [
                18761,
                18833
            ],
            [
                18833,
                18890
            ],
            [
                18890,
                18924
            ],
            [
                18924,
                18936
            ],
            [
                18936,
                18991
            ],
            [
                18991,
                19232
            ],
            [
                19232,
                19314
            ],
            [
                19314,
                19460
            ],
            [
                19460,
                19540
            ],
            [
                19540,
                19637
            ],
            [
                19637,
                19727
            ],
            [
                19727,
                19808
            ],
            [
                19808,
                19836
            ],
            [
                19836,
                19884
            ],
            [
                19884,
                20071
            ],
            [
                20071,
                20302
            ],
            [
                20302,
                20389
            ],
            [
                20389,
                20689
            ]
        ],
        "overlap_chars": [
            [
                19,
                31
            ],
            [
                4,
                11
            ],
            [
                56,
                64
            ],
            [
                104,
                170
            ],
            [
                216,
                237
            ],
            [
                243,
                264
            ],
            [
                264,
                273
            ],
            [
                296,
                302
            ],
            [
                320,
                334
            ],
            [
                367,
                379
            ],
            [
                380,
                396
            ],
            [
                401,
                416
            ],
            [
                273,
                274
            ],
            [
                481,
                484
            ],
            [
                467,
                472
            ],
            [
                655,
                657
            ],
            [
                657,
                726
            ],
            [
                731,
                753
            ],
            [
                758,
                766
            ],
            [
                787,
                792
            ],
            [
                853,
                871
            ],
            [
                997,
                999
            ],
            [
                999,
                1024
            ],
            [
                1032,
                1066
            ],
            [
                1081,
                1102
            ],
            [
                1113,
                1131
            ],
            [
                1138,
                1143
            ],
            [
                1181,
                1183
            ],
            [
                1183,
                1232
            ],
            [
                1292,
                1294
            ],
            [
                1294,
                1297
            ],
            [
                1411,
                1414
            ],
            [
                1319,
                1337
            ],
            [
                1423,
                1425
            ],
            [
                1361,
                1399
            ],
            [
                1455,
                1466
            ],
            [
                1482,
                1572
            ],
            [
                1584,
                1644
            ],
            [
                2004,
                2096
            ],
            [
                2096,
                2099
            ],
            [
                2140,
                2190
            ],
            [
                2190,
                2226
            ],
            [
                2656,
                2662
            ],
            [
                2666,
                2708
            ],
            [
                2747,
                2749
            ],
            [
                2749,
                2759
            ],
            [
                2833,
                2847
            ],
            [
                2867,
                2874
            ],
            [
                2921,
                2924
            ],
            [
                2889,
                2895
            ],
            [
                3037,
                3092
            ],
            [
                2774,
                2775
            ],
            [
                3135,
                3158
            ],
            [
                3165,
                3176
            ],
            [
                3176,
                3210
            ],
            [
                3224,
                3264
            ],
            [
                3266,
                3269
            ],
            [
                3274,
                3278
            ],
            [
                3292,
                3294
            ],
            [
                3294,
                3358
            ],
            [
                3371,
                3372
            ],
            [
                3373,
                3405
            ],
            [
                3424,
                3477
            ],
            [
                3477,
                3501
            ],
            [
                3501,
                3540
            ],
            [
                3540,
                3541
            ],
            [
                3568,
                3581
            ],
            [
                3560,
                3567
            ],
            [
                3583,
                3623
            ],
            [
                3623,
                3647
            ],
            [
                3679,
                3687
            ],
            [
                3888,
                3890
            ],
            [
                3890,
                3937
            ],
            [
                3951,
                3953
            ],
            [
                3953,
                3965
            ],
            [
                3965,
                4031
            ],
            [
                4080,
                4082
            ],
            [
                4082,
                4114
            ],
            [
                4114,
                4141
            ],
            [
                4141,
                4180
            ],
            [
                4180,
                4260
            ],
            [
                4271,
                4278
            ],
            [
                4333,
                4335
            ],
            [
                4335,
                4391
            ],
            [
                4391,
                4480
            ],
            [
                4536,
                4544
            ],
            [
                4807,
                4849
            ],
            [
                4884,
                4916
            ],
            [
                4916,
                4944
            ],
            [
                4944,
                4974
            ],
            [
                4974,
                5001
            ],
            [
                5007,
                5010
            ],
            [
                5018,
                5020
            ],
            [
                5020,
                5021
            ],
            [
                5043,
                5094
            ],
            [
                5099,
                5103
            ],
            [
                5109,
                5113
            ],
            [
                5123,
                5192
            ],
            [
                5205,
                5209
            ],
            [
                5209,
                5224
            ],
            [
                5280,
                5371
            ],
            [
                5376,
                5382
            ],
            [
                5395,
                5436
            ],
            [
                5436,
                5482
            ],
            [
                5482,
                5547
            ],
            [
                5685,
                5731
            ],
            [
                5731,
                5761
            ],
            [
                5831,
                5832
            ],
            [
                5819,
                5831
            ],
            [
                5861,
                5863
            ],
            [
                5863,
                5874
            ],
            [
                5874,
                5888
            ],
            [
                5888,
                5901
            ],
            [
                5918,
                5931
            ],
            [
                5949,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                6050
            ],
            [
                6052,
                6084
            ],
            [
                6084,
                6110
            ],
            [
                6134,
                6200
            ],
            [
                6200,
                6220
            ],
            [
                6228,
                6236
            ],
            [
                6241,
                6259
            ],
            [
                6289,
                6290
            ],
            [
                6291,
                6298
            ],
            [
                6314,
                6356
            ],
            [
                6356,
                6357
            ],
            [
                6388,
                6399
            ],
            [
                6357,
                6369
            ],
            [
                6400,
                6506
            ],
            [
                6521,
                6523
            ],
            [
                6523,
                6605
            ],
            [
                6605,
                6607
            ],
            [
                6656,
                6683
            ],
            [
                6683,
                6741
            ],
            [
                6746,
                6749
            ],
            [
                6755,
                6760
            ],
            [
                6800,
                6825
            ],
            [
                6840,
                6860
            ],
            [
                6869,
                6879
            ],
            [
                6885,
                6886
            ],
            [
                6887,
                7026
            ],
            [
                7072,
                7079
            ],
            [
                7083,
                7102
            ],
            [
                7102,
                7119
            ],
            [
                7124,
                7138
            ],
            [
                7143,
                7162
            ],
            [
                7204,
                7205
            ],
            [
                7318,
                7343
            ],
            [
                7356,
                7361
            ],
            [
                7429,
                7449
            ],
            [
                7464,
                7531
            ],
            [
                7546,
                7550
            ],
            [
                7532,
                7536
            ],
            [
                7579,
                7581
            ],
            [
                7551,
                7562
            ],
            [
                7567,
                7572
            ],
            [
                7591,
                7592
            ],
            [
                7593,
                7622
            ],
            [
                7654,
                7656
            ],
            [
                7656,
                7713
            ],
            [
                7715,
                7742
            ],
            [
                7815,
                7817
            ],
            [
                7817,
                7837
            ],
            [
                7839,
                7871
            ],
            [
                7873,
                7919
            ],
            [
                7920,
                7931
            ],
            [
                7992,
                8007
            ],
            [
                8020,
                8022
            ],
            [
                8032,
                8057
            ],
            [
                8066,
                8081
            ],
            [
                8082,
                8132
            ],
            [
                8145,
                8163
            ],
            [
                8163,
                8186
            ],
            [
                8192,
                8202
            ],
            [
                8220,
                8221
            ],
            [
                8222,
                8247
            ],
            [
                8247,
                8307
            ],
            [
                8307,
                8370
            ],
            [
                8376,
                8413
            ],
            [
                8433,
                8445
            ],
            [
                8456,
                8467
            ],
            [
                8446,
                8455
            ],
            [
                8468,
                8480
            ],
            [
                8480,
                8489
            ],
            [
                8530,
                8541
            ],
            [
                8558,
                8564
            ],
            [
                8575,
                8586
            ],
            [
                8623,
                8625
            ],
            [
                8722,
                8728
            ],
            [
                8668,
                8672
            ],
            [
                8756,
                8765
            ],
            [
                8677,
                8678
            ],
            [
                8767,
                8863
            ],
            [
                8874,
                8901
            ],
            [
                8937,
                8975
            ],
            [
                8998,
                9000
            ],
            [
                9000,
                9064
            ],
            [
                9069,
                9086
            ],
            [
                9129,
                9131
            ],
            [
                9131,
                9149
            ],
            [
                9156,
                9160
            ],
            [
                9173,
                9233
            ],
            [
                9234,
                9250
            ],
            [
                9261,
                9282
            ],
            [
                9322,
                9331
            ],
            [
                9603,
                9606
            ],
            [
                9286,
                9294
            ],
            [
                9337,
                9363
            ],
            [
                9316,
                9321
            ],
            [
                9527,
                9532
            ],
            [
                9369,
                9375
            ],
            [
                9416,
                9420
            ],
            [
                9444,
                9473
            ],
            [
                9363,
                9364
            ],
            [
                9916,
                9951
            ],
            [
                10054,
                10066
            ],
            [
                9977,
                9980
            ],
            [
                9990,
                9996
            ],
            [
                10161,
                10163
            ],
            [
                10163,
                10166
            ],
            [
                10171,
                10181
            ],
            [
                10187,
                10246
            ],
            [
                10298,
                10301
            ],
            [
                10318,
                10322
            ],
            [
                10352,
                10355
            ],
            [
                10285,
                10287
            ],
            [
                10334,
                10338
            ],
            [
                10383,
                10405
            ],
            [
                10442,
                10475
            ],
            [
                10502,
                10520
            ],
            [
                10484,
                10501
            ],
            [
                10544,
                10557
            ],
            [
                10617,
                10631
            ],
            [
                10772,
                10775
            ],
            [
                10917,
                10923
            ],
            [
                10879,
                10882
            ],
            [
                10973,
                11000
            ],
            [
                11000,
                11018
            ],
            [
                11032,
                11066
            ],
            [
                11182,
                11230
            ],
            [
                11250,
                11253
            ],
            [
                11231,
                11240
            ],
            [
                11289,
                11397
            ],
            [
                11423,
                11449
            ],
            [
                11450,
                11458
            ],
            [
                11475,
                11497
            ],
            [
                11509,
                11533
            ],
            [
                11590,
                11592
            ],
            [
                11592,
                11676
            ],
            [
                11754,
                11770
            ],
            [
                11787,
                11793
            ],
            [
                12204,
                12209
            ],
            [
                11810,
                11811
            ],
            [
                11817,
                11829
            ],
            [
                11793,
                11794
            ],
            [
                12267,
                12398
            ],
            [
                12439,
                12441
            ],
            [
                12445,
                12471
            ],
            [
                12533,
                12552
            ],
            [
                12559,
                12561
            ],
            [
                12561,
                12605
            ],
            [
                12624,
                12720
            ],
            [
                12720,
                12722
            ],
            [
                12731,
                12732
            ],
            [
                12746,
                12749
            ],
            [
                12899,
                12954
            ],
            [
                12960,
                12964
            ],
            [
                12986,
                13037
            ],
            [
                13037,
                13101
            ],
            [
                13267,
                13268
            ],
            [
                13144,
                13146
            ],
            [
                13177,
                13180
            ],
            [
                13191,
                13200
            ],
            [
                13209,
                13235
            ],
            [
                13249,
                13267
            ],
            [
                13164,
                13169
            ],
            [
                13390,
                13437
            ],
            [
                13437,
                13478
            ],
            [
                13478,
                13500
            ],
            [
                13500,
                13537
            ],
            [
                13543,
                13573
            ],
            [
                13573,
                13578
            ],
            [
                13586,
                13619
            ],
            [
                13646,
                13664
            ],
            [
                13664,
                13690
            ],
            [
                13690,
                13736
            ],
            [
                13840,
                13841
            ],
            [
                13777,
                13780
            ],
            [
                13756,
                13760
            ],
            [
                14042,
                14049
            ],
            [
                13761,
                13767
            ],
            [
                13916,
                13944
            ],
            [
                13950,
                13962
            ],
            [
                14002,
                14020
            ],
            [
                14057,
                14059
            ],
            [
                14059,
                14097
            ],
            [
                14109,
                14118
            ],
            [
                14124,
                14129
            ],
            [
                14134,
                14136
            ],
            [
                14136,
                14171
            ],
            [
                14192,
                14201
            ],
            [
                14201,
                14226
            ],
            [
                14226,
                14298
            ],
            [
                14299,
                14324
            ],
            [
                14329,
                14336
            ],
            [
                14369,
                14370
            ],
            [
                14339,
                14358
            ],
            [
                14386,
                14395
            ],
            [
                14407,
                14500
            ],
            [
                14500,
                14550
            ],
            [
                14661,
                14689
            ],
            [
                14689,
                14768
            ],
            [
                14768,
                14802
            ],
            [
                14802,
                14815
            ],
            [
                14838,
                14849
            ],
            [
                14851,
                14863
            ],
            [
                14863,
                14874
            ],
            [
                14874,
                14886
            ],
            [
                14888,
                14895
            ],
            [
                14914,
                14944
            ],
            [
                14944,
                14950
            ],
            [
                14961,
                14964
            ],
            [
                14967,
                14970
            ],
            [
                14996,
                15010
            ],
            [
                15017,
                15051
            ],
            [
                15110,
                15191
            ],
            [
                15191,
                15251
            ],
            [
                15292,
                15294
            ],
            [
                15267,
                15291
            ],
            [
                15332,
                15378
            ],
            [
                15383,
                15406
            ],
            [
                15407,
                15492
            ],
            [
                15492,
                15523
            ],
            [
                15523,
                15579
            ],
            [
                15600,
                15602
            ],
            [
                15602,
                15609
            ],
            [
                15641,
                15676
            ],
            [
                15676,
                15716
            ],
            [
                15730,
                15754
            ],
            [
                15764,
                15804
            ],
            [
                15809,
                15843
            ],
            [
                15848,
                15851
            ],
            [
                15852,
                15856
            ],
            [
                15910,
                15913
            ],
            [
                15913,
                15915
            ],
            [
                16031,
                16048
            ],
            [
                16070,
                16076
            ],
            [
                16123,
                16154
            ],
            [
                16154,
                16156
            ],
            [
                16077,
                16080
            ],
            [
                16160,
                16166
            ],
            [
                16180,
                16249
            ],
            [
                16249,
                16250
            ],
            [
                16260,
                16322
            ],
            [
                16329,
                16374
            ],
            [
                16416,
                16418
            ],
            [
                16418,
                16457
            ],
            [
                16462,
                16563
            ],
            [
                16594,
                16598
            ],
            [
                16637,
                16641
            ],
            [
                16646,
                16647
            ],
            [
                16694,
                16700
            ],
            [
                16731,
                16755
            ],
            [
                16771,
                16773
            ],
            [
                16804,
                16820
            ],
            [
                16856,
                16858
            ],
            [
                17194,
                17200
            ],
            [
                16968,
                16984
            ],
            [
                16992,
                17009
            ],
            [
                17032,
                17054
            ],
            [
                17291,
                17293
            ],
            [
                17189,
                17193
            ],
            [
                17056,
                17129
            ],
            [
                17139,
                17165
            ],
            [
                17226,
                17233
            ],
            [
                17238,
                17290
            ],
            [
                17298,
                17310
            ],
            [
                17326,
                17380
            ],
            [
                17390,
                17402
            ],
            [
                17402,
                17418
            ],
            [
                17426,
                17437
            ],
            [
                17466,
                17485
            ],
            [
                17532,
                17614
            ],
            [
                17614,
                17716
            ],
            [
                17821,
                17832
            ],
            [
                17755,
                17796
            ],
            [
                17816,
                17817
            ],
            [
                17798,
                17801
            ],
            [
                17805,
                17816
            ],
            [
                17744,
                17746
            ],
            [
                17863,
                17877
            ],
            [
                17877,
                17934
            ],
            [
                17935,
                17948
            ],
            [
                17991,
                18021
            ],
            [
                18029,
                18032
            ],
            [
                18060,
                18076
            ],
            [
                18050,
                18053
            ],
            [
                18076,
                18101
            ],
            [
                18110,
                18116
            ],
            [
                18116,
                18141
            ],
            [
                18142,
                18146
            ],
            [
                18154,
                18232
            ],
            [
                18232,
                18246
            ],
            [
                18259,
                18276
            ],
            [
                18276,
                18321
            ],
            [
                18321,
                18327
            ],
            [
                18327,
                18336
            ],
            [
                18338,
                18373
            ],
            [
                18374,
                18388
            ],
            [
                18421,
                18457
            ],
            [
                18457,
                18468
            ],
            [
                18500,
                18505
            ],
            [
                18514,
                18576
            ],
            [
                18579,
                18582
            ],
            [
                18597,
                18601
            ],
            [
                18586,
                18593
            ],
            [
                18647,
                18670
            ],
            [
                18696,
                18710
            ],
            [
                18727,
                18761
            ],
            [
                18761,
                18832
            ],
            [
                18991,
                19008
            ],
            [
                19009,
                19035
            ],
            [
                19041,
                19092
            ],
            [
                19120,
                19167
            ],
            [
                19210,
                19232
            ],
            [
                19232,
                19284
            ],
            [
                19312,
                19314
            ],
            [
                19314,
                19349
            ],
            [
                19376,
                19379
            ],
            [
                19398,
                19412
            ],
            [
                19421,
                19460
            ],
            [
                19460,
                19463
            ],
            [
                19474,
                19540
            ],
            [
                19540,
                19568
            ],
            [
                19575,
                19580
            ],
            [
                19635,
                19636
            ],
            [
                19727,
                19762
            ],
            [
                19766,
                19808
            ],
            [
                19808,
                19836
            ],
            [
                19836,
                19871
            ],
            [
                19882,
                19884
            ],
            [
                19884,
                19907
            ],
            [
                20007,
                20009
            ],
            [
                19924,
                19993
            ],
            [
                20068,
                20071
            ],
            [
                20095,
                20133
            ],
            [
                20293,
                20300
            ],
            [
                20237,
                20245
            ],
            [
                20300,
                20302
            ],
            [
                20302,
                20389
            ],
            [
                20389,
                20497
            ],
            [
                20499,
                20546
            ],
            [
                20624,
                20636
            ],
            [
                20641,
                20689
            ]
        ],
        "row_chars": [
            [
                0,
                264
            ],
            [
                264,
                657
            ],
            [
                657,
                999
            ],
            [
                999,
                1183
            ],
            [
                1183,
                1294
            ],
            [
                1294,
                1645
            ],
            [
                1645,
                2004
            ],
            [
                2004,
                2096
            ],
            [
                2096,
                2190
            ],
            [
                2190,
                2749
            ],
            [
                2749,
                3176
            ],
            [
                3176,
                3294
            ],
            [
                3294,
                3373
            ],
            [
                3373,
                3477
            ],
            [
                3477,
                3501
            ],
            [
                3501,
                3540
            ],
            [
                3540,
                3583
            ],
            [
                3583,
                3623
            ],
            [
                3623,
                3890
            ],
            [
                3890,
                3953
            ],
            [
                3953,
                3965
            ],
            [
                3965,
                4082
            ],
            [
                4082,
                4114
            ],
            [
                4114,
                4141
            ],
            [
                4141,
                4180
            ],
            [
                4180,
                4335
            ],
            [
                4335,
                4391
            ],
            [
                4391,
                4480
            ],
            [
                4480,
                4536
            ],
            [
                4536,
                4567
            ],
            [
                4567,
                4627
            ],
            [
                4627,
                4753
            ],
            [
                4753,
                4807
            ],
            [
                4807,
                4849
            ],
            [
                4849,
                4884
            ],
            [
                4884,
                4916
            ],
            [
                4916,
                4944
            ],
            [
                4944,
                4974
            ],
            [
                4974,
                5020
            ],
            [
                5020,
                5094
            ],
            [
                5094,
                5209
            ],
            [
                5209,
                5382
            ],
            [
                5382,
                5436
            ],
            [
                5436,
                5482
            ],
            [
                5482,
                5547
            ],
            [
                5547,
                5685
            ],
            [
                5685,
                5731
            ],
            [
                5731,
                5863
            ],
            [
                5863,
                5874
            ],
            [
                5874,
                5888
            ],
            [
                5888,
                5951
            ],
            [
                5951,
                5983
            ],
            [
                5983,
                6084
            ],
            [
                6084,
                6200
            ],
            [
                6200,
                6291
            ],
            [
                6291,
                6356
            ],
            [
                6356,
                6523
            ],
            [
                6523,
                6605
            ],
            [
                6605,
                6683
            ],
            [
                6683,
                6887
            ],
            [
                6887,
                7102
            ],
            [
                7102,
                7206
            ],
            [
                7206,
                7255
            ],
            [
                7255,
                7286
            ],
            [
                7286,
                7318
            ],
            [
                7318,
                7362
            ],
            [
                7362,
                7429
            ],
            [
                7429,
                7593
            ],
            [
                7593,
                7656
            ],
            [
                7656,
                7817
            ],
            [
                7817,
                7920
            ],
            [
                7920,
                8163
            ],
            [
                8163,
                8222
            ],
            [
                8222,
                8247
            ],
            [
                8247,
                8307
            ],
            [
                8307,
                8413
            ],
            [
                8413,
                8480
            ],
            [
                8480,
                8625
            ],
            [
                8625,
                9000
            ],
            [
                9000,
                9131
            ],
            [
                9131,
                9234
            ],
            [
                9234,
                9282
            ],
            [
                9282,
                9620
            ],
            [
                9620,
                9916
            ],
            [
                9916,
                10163
            ],
            [
                10163,
                10557
            ],
            [
                10557,
                11000
            ],
            [
                11000,
                11066
            ],
            [
                11066,
                11182
            ],
            [
                11182,
                11592
            ],
            [
                11592,
                12267
            ],
            [
                12267,
                12441
            ],
            [
                12441,
                12561
            ],
            [
                12561,
                12720
            ],
            [
                12720,
                13037
            ],
            [
                13037,
                13437
            ],
            [
                13437,
                13478
            ],
            [
                13478,
                13500
            ],
            [
                13500,
                13573
            ],
            [
                13573,
                13664
            ],
            [
                13664,
                13690
            ],
            [
                13690,
                14059
            ],
            [
                14059,
                14097
            ],
            [
                14097,
                14136
            ],
            [
                14136,
                14201
            ],
            [
                14201,
                14226
            ],
            [
                14226,
                14298
            ],
            [
                14298,
                14500
            ],
            [
                14500,
                14625
            ],
            [
                14625,
                14689
            ],
            [
                14689,
                14768
            ],
            [
                14768,
                14802
            ],
            [
                14802,
                14815
            ],
            [
                14815,
                14851
            ],
            [
                14851,
                14863
            ],
            [
                14863,
                14874
            ],
            [
                14874,
                14914
            ],
            [
                14914,
                14944
            ],
            [
                14944,
                15051
            ],
            [
                15051,
                15110
            ],
            [
                15110,
                15191
            ],
            [
                15191,
                15407
            ],
            [
                15407,
                15492
            ],
            [
                15492,
                15523
            ],
            [
                15523,
                15602
            ],
            [
                15602,
                15676
            ],
            [
                15676,
                15716
            ],
            [
                15716,
                15913
            ],
            [
                15913,
                16077
            ],
            [
                16077,
                16166
            ],
            [
                16166,
                16180
            ],
            [
                16180,
                16249
            ],
            [
                16249,
                16418
            ],
            [
                16418,
                16564
            ],
            [
                16564,
                16648
            ],
            [
                16648,
                16858
            ],
            [
                16858,
                17402
            ],
            [
                17402,
                17614
            ],
            [
                17614,
                17877
            ],
            [
                17877,
                18116
            ],
            [
                18116,
                18232
            ],
            [
                18232,
                18276
            ],
            [
                18276,
                18327
            ],
            [
                18327,
                18457
            ],
            [
                18457,
                18582
            ],
            [
                18582,
                18710
            ],
            [
                18710,
                18761
            ],
            [
                18761,
                18833
            ],
            [
                18833,
                18890
            ],
            [
                18890,
                18924
            ],
            [
                18924,
                18936
            ],
            [
                18936,
                18991
            ],
            [
                18991,
                19232
            ],
            [
                19232,
                19314
            ],
            [
                19314,
                19460
            ],
            [
                19460,
                19540
            ],
            [
                19540,
                19637
            ],
            [
                19637,
                19727
            ],
            [
                19727,
                19808
            ],
            [
                19808,
                19836
            ],
            [
                19836,
                19884
            ],
            [
                19884,
                20071
            ],
            [
                20071,
                20302
            ],
            [
                20302,
                20389
            ],
            [
                20389,
                20689
            ]
        ]
    },
    "abridged": {
        "text": "Sir Pitt Crawley's mansion was just awakening as Rawdon, in his evening costume, which he had now worn two days, walked up the steps and entered his brother's study. Lady Jane was up in the nursery helping her children dress and listening to their morning prayers, as she did every day. Rawdon sat down in the study before the Baronet's table, set out with orderly blue books and letters, bills and dispatch boxes.\nA book of family sermons, from which Sir Pitt was in the habit of reading to his family on Sundays, lay ready on the table. And by the sermon-book was the Observer newspaper. His valet had taken the opportunity of looking at it before he laid it by his master's desk; and he had read a flaming account of \"Festivities at Gaunt House,\" with the names of all the distinguished people invited by the Marquis of Steyne to meet his Royal Highness.\nPoor Rawdon took up the paper and began to try and read it until his brother should arrive. But he did not know in the least what he was reading. The Government news and appointments passed in a haze before Rawdon, as he sat waiting.\nPunctually at nine, Sir Pitt appeared, fresh and shaved, in a starched cravat and a grey flannel dressing-gown - a model of neatness and propriety. He started when he saw poor Rawdon in tumbled clothes, with blood-shot eyes and unkempt hair. He thought his brother was not sober, and had been out all night.\n\"Good gracious, Rawdon,\" he said, \"what brings you here at this time of the morning? Why ain't you at home?\"\n\"Home,\" said Rawdon with a wild laugh. \"I'm not drunk, Pitt. Shut the door; I want to speak to you.\"\nPitt closed the door and sat down opposite him.\n\"Pitt, it's all over with me,\" the Colonel said. \"I'm done.\"\n\"I always said it would come to this,\" the Baronet cried peevishly. \"I warned you a thousand times. I can't help you any more. Every shilling of my money is tied up. Even the hundred pounds that Jane took you last night were promised to my lawyer tomorrow morning. I don't mean to say that I won't assist you ultimately. But as for paying your creditors in full, I might as well hope to pay the National Debt. You must-\"\n\"It's not money I want,\" Rawdon broke in. \"Never mind what happens to me.\"\n\"What is the matter, then?\" said Pitt, somewhat relieved.\n\"It's the boy,\" said Rawdon huskily. \"Promise me that you will take charge of him when I'm gone. Your dear wife has always been good to him; and he's fonder of her than he is of his - damn it. Look here, Pitt, I wasn't brought up like a younger brother, but was always encouraged to be extravagant and idle. Otherwise I might have been quite a different man. I didn't do my duty with the regiment so bad. You know how I was thrown over about the money, and who got it.\"\n\"Your marriage was your own doing, not mine.\"\n\"That's over now,\" said Rawdon, with a groan.\n\"Good God! is she dead?\" Sir Pitt said in genuine alarm.\n\"I wish I was,\" Rawdon replied. \"If it wasn't for little Rawdon I'd have cut my throat this morning - and that damned villain's too.\"\nSir Pitt instantly guessed that Lord Steyne was the person whose life Rawdon wished to take. The Colonel told his brother briefly, in broken accents, what had happened.\n\"It was planned between that scoundrel and her,\" he said. \"I was taken by the bailiffs as I was going out of his house; when I wrote to her for money, she said she was ill in bed and put me off. And when I got home I found her in diamonds and sitting with that villain alone.\" He described his conflict with Lord Steyne. To an affair of that nature, of course, he said, there was only one result, and he was going away to make arrangements for the duel which must follow.\n\"And as it may end fatally with me,\" Rawdon said with a broken voice, \"and as the boy has no mother, I must leave him to you and Jane, Pitt - promise to be his friend.\"\nThe elder brother, much affected, shook Rawdon's hand.\n\"I will, upon my honour,\" he said.\nThen Rawdon took out the little pocket-book which he had discovered in Becky's desk, and drew from it a bundle of notes.\n\"Here's six hundred,\" he said. \"I want you to give the money to Briggs, who lent it to us - and who was kind to the boy. And here's some more - I've only kept back a few pounds - which Becky may as well have, to get on with.\"\nAs he spoke his hands shook so much that the pocket-book fell, and out of it came the thousand-pound note which had been the last of Becky's winnings.\nPitt stooped and picked it up, amazed.\n\"Not that,\" Rawdon said. \"I hope to put a bullet into the man whom that belongs to.\" He had thought to himself, it would be a fine revenge to wrap a bullet in the note and kill Steyne with it.\nThe brothers shook hands once more and parted. Lady Jane was waiting in the dining-room. As the men left the study, she held out her hand to Rawdon and said she was glad he was come to breakfast, though she could see by his haggard unshorn face that there was very little question of him staying. Rawdon muttered some excuses about an engagement, squeezing hard her timid little hand. Her imploring eyes read calamity in his face, but he went away without another word.\nNor did Sir Pitt give her any explanation. He kissed his children in his usual frigid manner, and their mother held their hands as they knelt down to prayers.\nRawdon Crawley meanwhile hurried on to Gaunt House, and knocked at the door. The porter who answered was scared by the Colonel's dishevelled appearance, and barred the way; but Rawdon only asked him to take his card to Lord Steyne, and to say that Colonel Crawley would be at the Regent Club after one o'clock - not at home. He strode away and took a cab to Knightsbridge Barracks.\nAll the bells were tolling as he reached that place. Troops of schools were on their march to church, and the shiny pavements were thronged with people out upon their Sunday pleasure; but the Colonel was much too busy to take any heed. Arriving at Knightsbridge, he speedily went to the room of his old comrade Captain Macmurdo.\nCaptain Macmurdo, a veteran officer and Waterloo man, greatly liked by his regiment, was enjoying the morning in bed after a supper-party. His room was hung round with boxing, sporting, and dancing pictures, presented to him by comrades as they retired from the regiment. As he was now nearly fifty, he had a singular gallery. He was one of the best shots in England, and one of the best riders; indeed, he and Crawley had been rivals when the latter was in the Army. To look at, he was a venerable bristly warrior, with a little close-shaved head, a red face and nose, and a great dyed moustache.\nWhen Rawdon told the Captain he wanted a friend, the latter knew why. He had arranged scores of duels for his acquaintances with great prudence and skill, and was the common refuge of gentlemen in trouble.\n\"What's the row about, Crawley, my boy?\" said the old warrior. \"No more gambling business, hay, like when we shot Captain Marker?\"\n\"It's about my wife,\" Crawley answered, turning very red.\nThe other gave a whistle. \"I always said she'd throw you over,\" he began, and indeed they had laid bets upon it in the barracks; but seeing the savage look which Rawdon gave him, Macmurdo did not go on.\n\"Is there no way out of it, old boy?\" he continued gravely. \"Is it only suspicion, you know, or letters? Can't you keep it quiet? Best not make any noise about a thing of that sort if you can help it.\" Think of his only finding out now, the Captain thought; remembering a hundred conversations at the mess-table, in which Mrs. Crawley's reputation had been torn to shreds.\n\"There's no way but one out of it,\" Rawdon replied. \"I found 'em alone together. I told him he was a liar and a coward, and knocked him down and thrashed him.\"\n\"Serve him right,\" Macmurdo said. \"Who is it?\"\n\"Lord Steyne.\"\n\"The deuce! a Marquis! they said he - that is-\"\n\"What the devil do you mean?\" roared Crawley; \"did you hear a fellow doubt my wife and didn't tell me, Mac?\"\n\"What the deuce was the good of my telling you what any tom-fools talked about?\"\n\"It was damned unfriendly, Mac,\" said Rawdon, quite overcome. He covered his face with his hands, which caused the tough old campaigner opposite to wince with sympathy.\n\"Hold up, old boy,\" he said; \"great man or not, we'll put a bullet in him, damn him. As for women, they're all so.\"\n\"You don't know how fond I was of that one,\" Rawdon said. \"Damme, I gave up everything I had to her. I'm a beggar because I would marry her. I've pawned my own watch to get her anything she fancied; and she's been making a purse for herself the whole time.\" He told Macmurdo the story.\n\"She may be innocent, after all, as she says,\" his advisor said. \"Steyne has been a hundred times alone with her in the house before.\"\n\"Maybe so,\" Rawdon answered sadly, \"but this don't look very innocent.\" He showed the Captain the thousand-pound note. \"This is what he gave her, Mac, and she kept it unknown to me; and with this money in the house, she refused to stand by me when I was locked up.\"\nMacmurdo admitted that it looked ugly. Rawdon sent his servant to Curzon Street to fetch a bag of clothes. While he was gone, Rawdon and his companion composed a letter to send to Lord Steyne: it said that Captain Macmurdo had the honour of waiting upon the Marquis of Steyne, on behalf of Colonel Rawdon Crawley, to make arrangements for the meeting which, he had no doubt, his Lordship would demand, and which the circumstances of the morning had made inevitable. Captain Macmurdo asked Lord Steyne to appoint a friend as second, and desired that the meeting might take place with as little delay as possible.\nIn a postscript the Captain stated that he had in his possession a bank-note for a large amount, which the Colonel believed was the property of the Marquis of Steyne, and was anxious to return to its owner.\nBy the time this note was composed, the Captain's servant had returned from Curzon Street, but without the bag of clothes he had been sent for, and with a very puzzled face.\n\"They won't give 'em up,\" he said; \"there's a regular shinty in the house, and everything at sixes and sevens. The landlord's took possession. The servants was a drinkin' up in the drawing-room. They said - they said you had gone off with the silver plate, Colonel. One of the servants is off already. And Simpson who is drunk says nothing shall go out of the house until his wages is paid.\"\nThis account gave a little gaiety to a sober conversation. Macmurdo laughed at Rawdon's discomfiture.\n\"I'm glad the little 'un isn't at home,\" Rawdon said, biting his nails.\nLittle Rawdon was just then sitting, one of fifty boys, in the Chapel of Whitefriars School, thinking about going home next Saturday, when his father might take him to the play.\n\"He's a regular trump, that boy,\" the father went on. \"I say, Mac, if anything goes wrong - you tell him, you know, that I was very fond of him, and that. And old chap, give him these gold sleeve-buttons: it's all I've got.\" He covered his face with his dirty hands.\n\"Go down and order some breakfast,\" Macmurdo said to his man in a loud cheerful voice. \"What'll you have, Crawley? Some devilled kidneys and a herring. And, Clay, lay out some of my clothes for the Colonel: we were always pretty much of a size, Rawdon, my boy.\" Leaving the Colonel to dress himself, Macmurdo finished his own toilette.\nThis, as he was about to meet a lord, Captain Macmurdo performed with particular care. He waxed his mustachios into a state of brilliant polish and put on a tight cravat and a trim buff waistcoat; so that all the young officers in the mess-room at breakfast asked if he was going to be married that Sunday.",
        "paragraph_chars": [
            [
                0,
                415
            ],
            [
                415,
                858
            ],
            [
                858,
                1092
            ],
            [
                1092,
                1400
            ],
            [
                1400,
                1509
            ],
            [
                1509,
                1610
            ],
            [
                1610,
                1658
            ],
            [
                1658,
                1719
            ],
            [
                1719,
                2140
            ],
            [
                2140,
                2215
            ],
            [
                2215,
                2273
            ],
            [
                2273,
                2743
            ],
            [
                2743,
                2789
            ],
            [
                2789,
                2835
            ],
            [
                2835,
                2892
            ],
            [
                2892,
                3026
            ],
            [
                3026,
                3195
            ],
            [
                3195,
                3667
            ],
            [
                3667,
                3836
            ],
            [
                3836,
                3891
            ],
            [
                3891,
                3926
            ],
            [
                3926,
                4047
            ],
            [
                4047,
                4273
            ],
            [
                4273,
                4424
            ],
            [
                4424,
                4463
            ],
            [
                4463,
                4656
            ],
            [
                4656,
                5126
            ],
            [
                5126,
                5285
            ],
            [
                5285,
                5667
            ],
            [
                5667,
                5996
            ],
            [
                5996,
                6594
            ],
            [
                6594,
                6800
            ],
            [
                6800,
                6931
            ],
            [
                6931,
                6989
            ],
            [
                6989,
                7192
            ],
            [
                7192,
                7565
            ],
            [
                7565,
                7725
            ],
            [
                7725,
                7772
            ],
            [
                7772,
                7787
            ],
            [
                7787,
                7835
            ],
            [
                7835,
                7944
            ],
            [
                7944,
                8025
            ],
            [
                8025,
                8194
            ],
            [
                8194,
                8310
            ],
            [
                8310,
                8596
            ],
            [
                8596,
                8731
            ],
            [
                8731,
                8997
            ],
            [
                8997,
                9609
            ],
            [
                9609,
                9816
            ],
            [
                9816,
                9990
            ],
            [
                9990,
                10382
            ],
            [
                10382,
                10484
            ],
            [
                10484,
                10556
            ],
            [
                10556,
                10734
            ],
            [
                10734,
                11001
            ],
            [
                11001,
                11337
            ],
            [
                11337,
                11643
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                287
            ],
            [
                287,
                415
            ],
            [
                415,
                539
            ],
            [
                539,
                590
            ],
            [
                590,
                858
            ],
            [
                858,
                950
            ],
            [
                950,
                1004
            ],
            [
                1004,
                1092
            ],
            [
                1092,
                1240
            ],
            [
                1240,
                1334
            ],
            [
                1334,
                1400
            ],
            [
                1400,
                1485
            ],
            [
                1485,
                1509
            ],
            [
                1509,
                1548
            ],
            [
                1548,
                1570
            ],
            [
                1570,
                1610
            ],
            [
                1610,
                1658
            ],
            [
                1658,
                1707
            ],
            [
                1707,
                1719
            ],
            [
                1719,
                1787
            ],
            [
                1787,
                1819
            ],
            [
                1819,
                1846
            ],
            [
                1846,
                1885
            ],
            [
                1885,
                1984
            ],
            [
                1984,
                2040
            ],
            [
                2040,
                2129
            ],
            [
                2129,
                2140
            ],
            [
                2140,
                2182
            ],
            [
                2182,
                2215
            ],
            [
                2215,
                2243
            ],
            [
                2243,
                2273
            ],
            [
                2273,
                2310
            ],
            [
                2310,
                2370
            ],
            [
                2370,
                2466
            ],
            [
                2466,
                2581
            ],
            [
                2581,
                2632
            ],
            [
                2632,
                2678
            ],
            [
                2678,
                2743
            ],
            [
                2743,
                2789
            ],
            [
                2789,
                2835
            ],
            [
                2835,
                2846
            ],
            [
                2846,
                2860
            ],
            [
                2860,
                2892
            ],
            [
                2892,
                2924
            ],
            [
                2924,
                3026
            ],
            [
                3026,
                3119
            ],
            [
                3119,
                3195
            ],
            [
                3195,
                3253
            ],
            [
                3253,
                3390
            ],
            [
                3390,
                3472
            ],
            [
                3472,
                3516
            ],
            [
                3516,
                3667
            ],
            [
                3667,
                3836
            ],
            [
                3836,
                3891
            ],
            [
                3891,
                3926
            ],
            [
                3926,
                4047
            ],
            [
                4047,
                4078
            ],
            [
                4078,
                4168
            ],
            [
                4168,
                4273
            ],
            [
                4273,
                4424
            ],
            [
                4424,
                4463
            ],
            [
                4463,
                4488
            ],
            [
                4488,
                4548
            ],
            [
                4548,
                4656
            ],
            [
                4656,
                4703
            ],
            [
                4703,
                4745
            ],
            [
                4745,
                4953
            ],
            [
                4953,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5169
            ],
            [
                5169,
                5285
            ],
            [
                5285,
                5362
            ],
            [
                5362,
                5610
            ],
            [
                5610,
                5667
            ],
            [
                5667,
                5720
            ],
            [
                5720,
                5903
            ],
            [
                5903,
                5996
            ],
            [
                5996,
                6135
            ],
            [
                6135,
                6268
            ],
            [
                6268,
                6323
            ],
            [
                6323,
                6464
            ],
            [
                6464,
                6594
            ],
            [
                6594,
                6664
            ],
            [
                6664,
                6800
            ],
            [
                6800,
                6841
            ],
            [
                6841,
                6863
            ],
            [
                6863,
                6931
            ],
            [
                6931,
                6989
            ],
            [
                6989,
                7015
            ],
            [
                7015,
                7192
            ],
            [
                7192,
                7230
            ],
            [
                7230,
                7252
            ],
            [
                7252,
                7297
            ],
            [
                7297,
                7322
            ],
            [
                7322,
                7394
            ],
            [
                7394,
                7565
            ],
            [
                7565,
                7617
            ],
            [
                7617,
                7646
            ],
            [
                7646,
                7725
            ],
            [
                7725,
                7759
            ],
            [
                7759,
                7772
            ],
            [
                7772,
                7787
            ],
            [
                7787,
                7799
            ],
            [
                7799,
                7810
            ],
            [
                7810,
                7835
            ],
            [
                7835,
                7865
            ],
            [
                7865,
                7944
            ],
            [
                7944,
                8025
            ],
            [
                8025,
                8087
            ],
            [
                8087,
                8194
            ],
            [
                8194,
                8279
            ],
            [
                8279,
                8310
            ],
            [
                8310,
                8368
            ],
            [
                8368,
                8411
            ],
            [
                8411,
                8451
            ],
            [
                8451,
                8568
            ],
            [
                8568,
                8596
            ],
            [
                8596,
                8661
            ],
            [
                8661,
                8731
            ],
            [
                8731,
                8803
            ],
            [
                8803,
                8850
            ],
            [
                8850,
                8997
            ],
            [
                8997,
                9036
            ],
            [
                9036,
                9104
            ],
            [
                9104,
                9463
            ],
            [
                9463,
                9609
            ],
            [
                9609,
                9816
            ],
            [
                9816,
                9990
            ],
            [
                9990,
                10101
            ],
            [
                10101,
                10133
            ],
            [
                10133,
                10185
            ],
            [
                10185,
                10256
            ],
            [
                10256,
                10292
            ],
            [
                10292,
                10382
            ],
            [
                10382,
                10441
            ],
            [
                10441,
                10484
            ],
            [
                10484,
                10556
            ],
            [
                10556,
                10734
            ],
            [
                10734,
                10788
            ],
            [
                10788,
                10889
            ],
            [
                10889,
                10959
            ],
            [
                10959,
                11001
            ],
            [
                11001,
                11088
            ],
            [
                11088,
                11116
            ],
            [
                11116,
                11153
            ],
            [
                11153,
                11263
            ],
            [
                11263,
                11337
            ],
            [
                11337,
                11424
            ],
            [
                11424,
                11643
            ]
        ],
        "overlap_chars": [
            [
                4,
                16
            ],
            [
                19,
                26
            ],
            [
                27,
                35
            ],
            [
                46,
                112
            ],
            [
                123,
                144
            ],
            [
                145,
                166
            ],
            [
                166,
                175
            ],
            [
                176,
                182
            ],
            [
                183,
                197
            ],
            [
                206,
                218
            ],
            [
                225,
                241
            ],
            [
                248,
                263
            ],
            [
                263,
                264
            ],
            [
                268,
                271
            ],
            [
                276,
                281
            ],
            [
                285,
                287
            ],
            [
                287,
                356
            ],
            [
                357,
                379
            ],
            [
                380,
                388
            ],
            [
                389,
                394
            ],
            [
                395,
                413
            ],
            [
                413,
                415
            ],
            [
                415,
                440
            ],
            [
                446,
                480
            ],
            [
                489,
                510
            ],
            [
                513,
                531
            ],
            [
                532,
                537
            ],
            [
                537,
                539
            ],
            [
                539,
                588
            ],
            [
                588,
                590
            ],
            [
                590,
                593
            ],
            [
                600,
                603
            ],
            [
                610,
                628
            ],
            [
                640,
                642
            ],
            [
                643,
                681
            ],
            [
                687,
                698
            ],
            [
                699,
                789
            ],
            [
                797,
                857
            ],
            [
                858,
                950
            ],
            [
                950,
                953
            ],
            [
                954,
                1004
            ],
            [
                1004,
                1040
            ],
            [
                1041,
                1047
            ],
            [
                1048,
                1090
            ],
            [
                1090,
                1092
            ],
            [
                1092,
                1102
            ],
            [
                1106,
                1120
            ],
            [
                1129,
                1136
            ],
            [
                1137,
                1140
            ],
            [
                1141,
                1147
            ],
            [
                1147,
                1202
            ],
            [
                1203,
                1204
            ],
            [
                1205,
                1228
            ],
            [
                1229,
                1240
            ],
            [
                1240,
                1274
            ],
            [
                1275,
                1315
            ],
            [
                1316,
                1319
            ],
            [
                1328,
                1332
            ],
            [
                1332,
                1334
            ],
            [
                1334,
                1398
            ],
            [
                1398,
                1399
            ],
            [
                1400,
                1432
            ],
            [
                1432,
                1485
            ],
            [
                1485,
                1509
            ],
            [
                1509,
                1548
            ],
            [
                1548,
                1549
            ],
            [
                1549,
                1562
            ],
            [
                1562,
                1569
            ],
            [
                1570,
                1610
            ],
            [
                1610,
                1634
            ],
            [
                1635,
                1643
            ],
            [
                1656,
                1658
            ],
            [
                1658,
                1705
            ],
            [
                1705,
                1707
            ],
            [
                1707,
                1719
            ],
            [
                1719,
                1785
            ],
            [
                1785,
                1787
            ],
            [
                1787,
                1819
            ],
            [
                1819,
                1846
            ],
            [
                1846,
                1885
            ],
            [
                1885,
                1965
            ],
            [
                1975,
                1982
            ],
            [
                1982,
                1984
            ],
            [
                1984,
                2040
            ],
            [
                2040,
                2129
            ],
            [
                2129,
                2137
            ],
            [
                2140,
                2182
            ],
            [
                2183,
                2215
            ],
            [
                2215,
                2243
            ],
            [
                2243,
                2273
            ],
            [
                2273,
                2300
            ],
            [
                2301,
                2304
            ],
            [
                2308,
                2310
            ],
            [
                2310,
                2311
            ],
            [
                2319,
                2370
            ],
            [
                2375,
                2379
            ],
            [
                2380,
                2384
            ],
            [
                2385,
                2454
            ],
            [
                2462,
                2466
            ],
            [
                2466,
                2481
            ],
            [
                2483,
                2574
            ],
            [
                2575,
                2581
            ],
            [
                2591,
                2632
            ],
            [
                2632,
                2678
            ],
            [
                2678,
                2743
            ],
            [
                2743,
                2789
            ],
            [
                2789,
                2819
            ],
            [
                2819,
                2820
            ],
            [
                2821,
                2833
            ],
            [
                2833,
                2835
            ],
            [
                2835,
                2846
            ],
            [
                2846,
                2860
            ],
            [
                2860,
                2873
            ],
            [
                2877,
                2890
            ],
            [
                2890,
                2892
            ],
            [
                2892,
                2924
            ],
            [
                2924,
                2991
            ],
            [
                2994,
                3026
            ],
            [
                3026,
                3052
            ],
            [
                3053,
                3119
            ],
            [
                3119,
                3139
            ],
            [
                3148,
                3156
            ],
            [
                3157,
                3175
            ],
            [
                3193,
                3194
            ],
            [
                3195,
                3202
            ],
            [
                3211,
                3253
            ],
            [
                3253,
                3254
            ],
            [
                3254,
                3265
            ],
            [
                3269,
                3281
            ],
            [
                3282,
                3388
            ],
            [
                3388,
                3390
            ],
            [
                3390,
                3472
            ],
            [
                3472,
                3474
            ],
            [
                3489,
                3516
            ],
            [
                3516,
                3574
            ],
            [
                3580,
                3583
            ],
            [
                3590,
                3595
            ],
            [
                3596,
                3621
            ],
            [
                3622,
                3642
            ],
            [
                3648,
                3658
            ],
            [
                3665,
                3666
            ],
            [
                3667,
                3806
            ],
            [
                3809,
                3816
            ],
            [
                3817,
                3836
            ],
            [
                3836,
                3853
            ],
            [
                3855,
                3869
            ],
            [
                3870,
                3889
            ],
            [
                3889,
                3890
            ],
            [
                3891,
                3916
            ],
            [
                3920,
                3925
            ],
            [
                3926,
                3946
            ],
            [
                3947,
                4014
            ],
            [
                4015,
                4019
            ],
            [
                4020,
                4024
            ],
            [
                4025,
                4027
            ],
            [
                4028,
                4039
            ],
            [
                4040,
                4045
            ],
            [
                4045,
                4046
            ],
            [
                4047,
                4076
            ],
            [
                4076,
                4078
            ],
            [
                4079,
                4136
            ],
            [
                4139,
                4166
            ],
            [
                4166,
                4168
            ],
            [
                4168,
                4188
            ],
            [
                4191,
                4223
            ],
            [
                4226,
                4272
            ],
            [
                4273,
                4284
            ],
            [
                4285,
                4300
            ],
            [
                4301,
                4303
            ],
            [
                4309,
                4334
            ],
            [
                4334,
                4349
            ],
            [
                4355,
                4405
            ],
            [
                4406,
                4424
            ],
            [
                4424,
                4447
            ],
            [
                4451,
                4461
            ],
            [
                4461,
                4462
            ],
            [
                4463,
                4488
            ],
            [
                4488,
                4548
            ],
            [
                4548,
                4611
            ],
            [
                4619,
                4656
            ],
            [
                4656,
                4668
            ],
            [
                4669,
                4680
            ],
            [
                4681,
                4690
            ],
            [
                4691,
                4703
            ],
            [
                4703,
                4712
            ],
            [
                4713,
                4724
            ],
            [
                4725,
                4731
            ],
            [
                4732,
                4743
            ],
            [
                4743,
                4745
            ],
            [
                4745,
                4751
            ],
            [
                4756,
                4760
            ],
            [
                4761,
                4770
            ],
            [
                4770,
                4771
            ],
            [
                4772,
                4868
            ],
            [
                4873,
                4900
            ],
            [
                4901,
                4939
            ],
            [
                4951,
                4953
            ],
            [
                4953,
                5017
            ],
            [
                5022,
                5039
            ],
            [
                5039,
                5041
            ],
            [
                5041,
                5059
            ],
            [
                5060,
                5064
            ],
            [
                5065,
                5125
            ],
            [
                5126,
                5142
            ],
            [
                5148,
                5169
            ],
            [
                5169,
                5178
            ],
            [
                5179,
                5182
            ],
            [
                5183,
                5191
            ],
            [
                5192,
                5218
            ],
            [
                5218,
                5223
            ],
            [
                5224,
                5229
            ],
            [
                5230,
                5236
            ],
            [
                5237,
                5241
            ],
            [
                5254,
                5283
            ],
            [
                5283,
                5284
            ],
            [
                5285,
                5320
            ],
            [
                5324,
                5336
            ],
            [
                5337,
                5340
            ],
            [
                5349,
                5355
            ],
            [
                5360,
                5362
            ],
            [
                5362,
                5365
            ],
            [
                5386,
                5396
            ],
            [
                5397,
                5456
            ],
            [
                5458,
                5461
            ],
            [
                5469,
                5473
            ],
            [
                5480,
                5483
            ],
            [
                5484,
                5486
            ],
            [
                5496,
                5500
            ],
            [
                5501,
                5523
            ],
            [
                5524,
                5557
            ],
            [
                5558,
                5576
            ],
            [
                5577,
                5594
            ],
            [
                5597,
                5610
            ],
            [
                5610,
                5624
            ],
            [
                5625,
                5628
            ],
            [
                5629,
                5635
            ],
            [
                5636,
                5639
            ],
            [
                5640,
                5667
            ],
            [
                5667,
                5685
            ],
            [
                5686,
                5720
            ],
            [
                5720,
                5768
            ],
            [
                5769,
                5772
            ],
            [
                5773,
                5782
            ],
            [
                5793,
                5901
            ],
            [
                5903,
                5929
            ],
            [
                5933,
                5941
            ],
            [
                5947,
                5969
            ],
            [
                5970,
                5994
            ],
            [
                5994,
                5996
            ],
            [
                5996,
                6080
            ],
            [
                6081,
                6097
            ],
            [
                6106,
                6112
            ],
            [
                6113,
                6118
            ],
            [
                6119,
                6120
            ],
            [
                6121,
                6133
            ],
            [
                6133,
                6134
            ],
            [
                6135,
                6266
            ],
            [
                6266,
                6268
            ],
            [
                6268,
                6294
            ],
            [
                6294,
                6313
            ],
            [
                6321,
                6323
            ],
            [
                6323,
                6367
            ],
            [
                6368,
                6464
            ],
            [
                6464,
                6466
            ],
            [
                6474,
                6475
            ],
            [
                6479,
                6482
            ],
            [
                6483,
                6538
            ],
            [
                6539,
                6543
            ],
            [
                6543,
                6594
            ],
            [
                6594,
                6658
            ],
            [
                6662,
                6663
            ],
            [
                6664,
                6666
            ],
            [
                6667,
                6670
            ],
            [
                6680,
                6689
            ],
            [
                6696,
                6722
            ],
            [
                6729,
                6747
            ],
            [
                6747,
                6752
            ],
            [
                6753,
                6800
            ],
            [
                6800,
                6841
            ],
            [
                6841,
                6863
            ],
            [
                6863,
                6900
            ],
            [
                6901,
                6931
            ],
            [
                6931,
                6936
            ],
            [
                6937,
                6970
            ],
            [
                6971,
                6989
            ],
            [
                6989,
                7015
            ],
            [
                7015,
                7061
            ],
            [
                7061,
                7062
            ],
            [
                7063,
                7066
            ],
            [
                7088,
                7092
            ],
            [
                7093,
                7100
            ],
            [
                7101,
                7107
            ],
            [
                7116,
                7144
            ],
            [
                7145,
                7157
            ],
            [
                7166,
                7184
            ],
            [
                7190,
                7192
            ],
            [
                7192,
                7230
            ],
            [
                7233,
                7242
            ],
            [
                7243,
                7248
            ],
            [
                7250,
                7252
            ],
            [
                7252,
                7287
            ],
            [
                7288,
                7297
            ],
            [
                7297,
                7322
            ],
            [
                7322,
                7394
            ],
            [
                7394,
                7419
            ],
            [
                7420,
                7427
            ],
            [
                7427,
                7428
            ],
            [
                7429,
                7448
            ],
            [
                7462,
                7471
            ],
            [
                7472,
                7565
            ],
            [
                7565,
                7615
            ],
            [
                7618,
                7646
            ],
            [
                7646,
                7725
            ],
            [
                7725,
                7759
            ],
            [
                7759,
                7772
            ],
            [
                7773,
                7784
            ],
            [
                7787,
                7799
            ],
            [
                7799,
                7810
            ],
            [
                7810,
                7822
            ],
            [
                7825,
                7832
            ],
            [
                7835,
                7865
            ],
            [
                7865,
                7871
            ],
            [
                7879,
                7882
            ],
            [
                7886,
                7889
            ],
            [
                7895,
                7909
            ],
            [
                7910,
                7944
            ],
            [
                7944,
                8025
            ],
            [
                8025,
                8085
            ],
            [
                8087,
                8089
            ],
            [
                8098,
                8122
            ],
            [
                8123,
                8169
            ],
            [
                8170,
                8193
            ],
            [
                8194,
                8279
            ],
            [
                8279,
                8310
            ],
            [
                8310,
                8366
            ],
            [
                8366,
                8368
            ],
            [
                8368,
                8375
            ],
            [
                8376,
                8411
            ],
            [
                8411,
                8451
            ],
            [
                8451,
                8475
            ],
            [
                8476,
                8516
            ],
            [
                8516,
                8550
            ],
            [
                8551,
                8554
            ],
            [
                8561,
                8565
            ],
            [
                8565,
                8568
            ],
            [
                8568,
                8570
            ],
            [
                8571,
                8588
            ],
            [
                8589,
                8595
            ],
            [
                8596,
                8627
            ],
            [
                8640,
                8642
            ],
            [
                8643,
                8646
            ],
            [
                8655,
                8661
            ],
            [
                8662,
                8731
            ],
            [
                8731,
                8732
            ],
            [
                8738,
                8800
            ],
            [
                8803,
                8848
            ],
            [
                8848,
                8850
            ],
            [
                8850,
                8889
            ],
            [
                8895,
                8996
            ],
            [
                9015,
                9019
            ],
            [
                9030,
                9034
            ],
            [
                9034,
                9035
            ],
            [
                9036,
                9042
            ],
            [
                9052,
                9076
            ],
            [
                9077,
                9079
            ],
            [
                9086,
                9102
            ],
            [
                9102,
                9104
            ],
            [
                9110,
                9116
            ],
            [
                9121,
                9137
            ],
            [
                9148,
                9165
            ],
            [
                9166,
                9188
            ],
            [
                9190,
                9192
            ],
            [
                9198,
                9202
            ],
            [
                9203,
                9276
            ],
            [
                9284,
                9310
            ],
            [
                9311,
                9318
            ],
            [
                9319,
                9371
            ],
            [
                9372,
                9384
            ],
            [
                9391,
                9445
            ],
            [
                9451,
                9463
            ],
            [
                9463,
                9479
            ],
            [
                9486,
                9497
            ],
            [
                9498,
                9517
            ],
            [
                9527,
                9609
            ],
            [
                9609,
                9711
            ],
            [
                9712,
                9723
            ],
            [
                9733,
                9774
            ],
            [
                9774,
                9775
            ],
            [
                9776,
                9779
            ],
            [
                9780,
                9791
            ],
            [
                9792,
                9794
            ],
            [
                9802,
                9816
            ],
            [
                9816,
                9873
            ],
            [
                9878,
                9891
            ],
            [
                9892,
                9922
            ],
            [
                9923,
                9926
            ],
            [
                9938,
                9954
            ],
            [
                9955,
                9958
            ],
            [
                9958,
                9983
            ],
            [
                9984,
                9990
            ],
            [
                9990,
                10015
            ],
            [
                10019,
                10023
            ],
            [
                10023,
                10101
            ],
            [
                10101,
                10115
            ],
            [
                10116,
                10133
            ],
            [
                10133,
                10178
            ],
            [
                10179,
                10185
            ],
            [
                10185,
                10194
            ],
            [
                10197,
                10232
            ],
            [
                10240,
                10254
            ],
            [
                10256,
                10292
            ],
            [
                10292,
                10303
            ],
            [
                10311,
                10316
            ],
            [
                10317,
                10379
            ],
            [
                10379,
                10382
            ],
            [
                10382,
                10386
            ],
            [
                10387,
                10394
            ],
            [
                10395,
                10418
            ],
            [
                10427,
                10441
            ],
            [
                10450,
                10484
            ],
            [
                10484,
                10555
            ],
            [
                10556,
                10573
            ],
            [
                10579,
                10605
            ],
            [
                10606,
                10657
            ],
            [
                10658,
                10705
            ],
            [
                10712,
                10734
            ],
            [
                10734,
                10786
            ],
            [
                10786,
                10788
            ],
            [
                10788,
                10823
            ],
            [
                10826,
                10829
            ],
            [
                10835,
                10849
            ],
            [
                10850,
                10889
            ],
            [
                10889,
                10892
            ],
            [
                10893,
                10959
            ],
            [
                10959,
                10987
            ],
            [
                10994,
                10999
            ],
            [
                10999,
                11000
            ],
            [
                11001,
                11036
            ],
            [
                11046,
                11088
            ],
            [
                11088,
                11116
            ],
            [
                11116,
                11151
            ],
            [
                11151,
                11153
            ],
            [
                11153,
                11176
            ],
            [
                11177,
                11179
            ],
            [
                11191,
                11260
            ],
            [
                11260,
                11263
            ],
            [
                11271,
                11309
            ],
            [
                11319,
                11326
            ],
            [
                11327,
                11335
            ],
            [
                11335,
                11337
            ],
            [
                11337,
                11424
            ],
            [
                11424,
                11532
            ],
            [
                11534,
                11581
            ],
            [
                11582,
                11594
            ],
            [
                11595,
                11643
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                287
            ],
            [
                287,
                415
            ],
            [
                415,
                539
            ],
            [
                539,
                590
            ],
            [
                590,
                858
            ],
            [
                858,
                858
            ],
            [
                858,
                950
            ],
            [
                950,
                1004
            ],
            [
                1004,
                1092
            ],
            [
                1092,
                1240
            ],
            [
                1240,
                1334
            ],
            [
                1334,
                1400
            ],
            [
                1400,
                1485
            ],
            [
                1485,
                1509
            ],
            [
                1509,
                1548
            ],
            [
                1548,
                1570
            ],
            [
                1570,
                1610
            ],
            [
                1610,
                1658
            ],
            [
                1658,
                1707
            ],
            [
                1707,
                1719
            ],
            [
                1719,
                1787
            ],
            [
                1787,
                1819
            ],
            [
                1819,
                1846
            ],
            [
                1846,
                1885
            ],
            [
                1885,
                1984
            ],
            [
                1984,
                2040
            ],
            [
                2040,
                2129
            ],
            [
                2129,
                2129
            ],
            [
                2129,
                2140
            ],
            [
                2140,
                2140
            ],
            [
                2140,
                2140
            ],
            [
                2140,
                2140
            ],
            [
                2140,
                2182
            ],
            [
                2182,
                2182
            ],
            [
                2182,
                2215
            ],
            [
                2215,
                2243
            ],
            [
                2243,
                2273
            ],
            [
                2273,
                2310
            ],
            [
                2310,
                2370
            ],
            [
                2370,
                2466
            ],
            [
                2466,
                2581
            ],
            [
                2581,
                2632
            ],
            [
                2632,
                2678
            ],
            [
                2678,
                2743
            ],
            [
                2743,
                2743
            ],
            [
                2743,
                2789
            ],
            [
                2789,
                2835
            ],
            [
                2835,
                2846
            ],
            [
                2846,
                2860
            ],
            [
                2860,
                2892
            ],
            [
                2892,
                2924
            ],
            [
                2924,
                3026
            ],
            [
                3026,
                3119
            ],
            [
                3119,
                3195
            ],
            [
                3195,
                3253
            ],
            [
                3253,
                3390
            ],
            [
                3390,
                3472
            ],
            [
                3472,
                3516
            ],
            [
                3516,
                3667
            ],
            [
                3667,
                3836
            ],
            [
                3836,
                3891
            ],
            [
                3891,
                3891
            ],
            [
                3891,
                3891
            ],
            [
                3891,
                3891
            ],
            [
                3891,
                3926
            ],
            [
                3926,
                3926
            ],
            [
                3926,
                4047
            ],
            [
                4047,
                4078
            ],
            [
                4078,
                4168
            ],
            [
                4168,
                4273
            ],
            [
                4273,
                4424
            ],
            [
                4424,
                4463
            ],
            [
                4463,
                4488
            ],
            [
                4488,
                4548
            ],
            [
                4548,
                4656
            ],
            [
                4656,
                4703
            ],
            [
                4703,
                4745
            ],
            [
                4745,
                4953
            ],
            [
                4953,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5169
            ],
            [
                5169,
                5285
            ],
            [
                5285,
                5285
            ],
            [
                5285,
                5362
            ],
            [
                5362,
                5610
            ],
            [
                5610,
                5667
            ],
            [
                5667,
                5720
            ],
            [
                5720,
                5720
            ],
            [
                5720,
                5996
            ],
            [
                5996,
                6135
            ],
            [
                6135,
                6268
            ],
            [
                6268,
                6323
            ],
            [
                6323,
                6464
            ],
            [
                6464,
                6594
            ],
            [
                6594,
                6800
            ],
            [
                6800,
                6841
            ],
            [
                6841,
                6863
            ],
            [
                6863,
                6931
            ],
            [
                6931,
                6989
            ],
            [
                6989,
                7015
            ],
            [
                7015,
                7192
            ],
            [
                7192,
                7230
            ],
            [
                7230,
                7252
            ],
            [
                7252,
                7297
            ],
            [
                7297,
                7322
            ],
            [
                7322,
                7394
            ],
            [
                7394,
                7565
            ],
            [
                7565,
                7617
            ],
            [
                7617,
                7646
            ],
            [
                7646,
                7725
            ],
            [
                7725,
                7759
            ],
            [
                7759,
                7772
            ],
            [
                7772,
                7787
            ],
            [
                7787,
                7799
            ],
            [
                7799,
                7810
            ],
            [
                7810,
                7835
            ],
            [
                7835,
                7865
            ],
            [
                7865,
                7944
            ],
            [
                7944,
                7944
            ],
            [
                7944,
                8025
            ],
            [
                8025,
                8194
            ],
            [
                8194,
                8279
            ],
            [
                8279,
                8310
            ],
            [
                8310,
                8368
            ],
            [
                8368,
                8411
            ],
            [
                8411,
                8451
            ],
            [
                8451,
                8568
            ],
            [
                8568,
                8596
            ],
            [
                8596,
                8661
            ],
            [
                8661,
                8661
            ],
            [
                8661,
                8731
            ],
            [
                8731,
                8850
            ],
            [
                8850,
                8997
            ],
            [
                8997,
                9036
            ],
            [
                9036,
                9104
            ],
            [
                9104,
                9463
            ],
            [
                9463,
                9609
            ],
            [
                9609,
                9816
            ],
            [
                9816,
                9990
            ],
            [
                9990,
                10101
            ],
            [
                10101,
                10133
            ],
            [
                10133,
                10185
            ],
            [
                10185,
                10292
            ],
            [
                10292,
                10382
            ],
            [
                10382,
                10441
            ],
            [
                10441,
                10484
            ],
            [
                10484,
                10556
            ],
            [
                10556,
                10556
            ],
            [
                10556,
                10556
            ],
            [
                10556,
                10556
            ],
            [
                10556,
                10556
            ],
            [
                10556,
                10734
            ],
            [
                10734,
                10788
            ],
            [
                10788,
                10889
            ],
            [
                10889,
                10959
            ],
            [
                10959,
                11001
            ],
            [
                11001,
                11001
            ],
            [
                11001,
                11088
            ],
            [
                11088,
                11116
            ],
            [
                11116,
                11153
            ],
            [
                11153,
                11263
            ],
            [
                11263,
                11337
            ],
            [
                11337,
                11424
            ],
            [
                11424,
                11643
            ]
        ]
    }
}