{
    "original": {
        "text": "Georgy Osborne was now fairly established in his grandfather's mansion in Russell Square, occupant of his father's room in the house and heir apparent of all the splendours there. The good looks, gallant bearing, and gentlemanlike appearance of the boy won the grandsire's heart for him. Mr. Osborne was as proud of him as ever he had been of the elder George.\nThe child had many more luxuries and indulgences than had been awarded his father. Osborne's commerce had prospered greatly of late years. His wealth and importance in the City had very much increased. He had been glad enough in former days to put the elder George to a good private school; and a commission in the army for his son had been a source of no small pride to him; for little George and his future prospects the old man looked much higher. He would make a gentleman of the little chap, was Mr. Osborne's constant saying regarding little Georgy. He saw him in his mind's eye, a collegian, a Parliament man, a Baronet, perhaps. The old man thought he would die contented if he could see his grandson in a fair way to such honours. He would have none but a tip-top college man to educate him--none of your quacks and pretenders--no, no. A few years before, he used to be savage, and inveigh against all parsons, scholars, and the like declaring that they were a pack of humbugs, and quacks that weren't fit to get their living but by grinding Latin and Greek, and a set of supercilious dogs that pretended to look down upon British merchants and gentlemen, who could buy up half a hundred of 'em. He would mourn now, in a very solemn manner, that his own education had been neglected, and repeatedly point out, in pompous orations to Georgy, the necessity and excellence of classical acquirements.\nWhen they met at dinner the grandsire used to ask the lad what he had been reading during the day, and was greatly interested at the report the boy gave of his own studies, pretending to understand little George when he spoke regarding them. He made a hundred blunders and showed his ignorance many a time. It did not increase the respect which the child had for his senior. A quick brain and a better education elsewhere showed the boy very soon that his grandsire was a dullard, and he began accordingly to command him and to look down upon him; for his previous education, humble and contracted as it had been, had made a much better gentleman of Georgy than any plans of his grandfather could make him. He had been brought up by a kind, weak, and tender woman, who had no pride about anything but about him, and whose heart was so pure and whose bearing was so meek and humble that she could not but needs be a true lady. She busied herself in gentle offices and quiet duties; if she never said brilliant things, she never spoke or thought unkind ones; guileless and artless, loving and pure, indeed how could our poor little Amelia be other than a real gentlewoman!\nYoung Georgy lorded over this soft and yielding nature; and the contrast of its simplicity and delicacy with the coarse pomposity of the dull old man with whom he next came in contact made him lord over the latter too. If he had been a Prince Royal he could not have been better brought up to think well of himself.\nWhilst his mother was yearning after him at home, and I do believe every hour of the day, and during most hours of the sad lonely nights, thinking of him, this young gentleman had a number of pleasures and consolations administered to him, which made him for his part bear the separation from Amelia very easily. Little boys who cry when they are going to school cry because they are going to a very uncomfortable place. It is only a few who weep from sheer affection. When you think that the eyes of your childhood dried at the sight of a piece of gingerbread, and that a plum cake was a compensation for the agony of parting with your mamma and sisters, oh my friend and brother, you need not be too confident of your own fine feelings.\nWell, then, Master George Osborne had every comfort and luxury that a wealthy and lavish old grandfather thought fit to provide. The coachman was instructed to purchase for him the handsomest pony which could be bought for money, and on this George was taught to ride, first at a riding-school, whence, after having performed satisfactorily without stirrups, and over the leaping-bar, he was conducted through the New Road to Regent's Park, and then to Hyde Park, where he rode in state with Martin the coachman behind him. Old Osborne, who took matters more easily in the City now, where he left his affairs to his junior partners, would often ride out with Miss O. in the same fashionable direction. As little Georgy came cantering up with his dandified air and his heels down, his grandfather would nudge the lad's aunt and say, \"Look, Miss O.\" And he would laugh, and his face would grow red with pleasure, as he nodded out of the window to the boy, as the groom saluted the carriage, and the footman saluted Master George. Here too his aunt, Mrs. Frederick Bullock (whose chariot might daily be seen in the Ring, with bullocks or emblazoned on the panels and harness, and three pasty-faced little Bullocks, covered with cockades and feathers, staring from the windows) Mrs. Frederick Bullock, I say, flung glances of the bitterest hatred at the little upstart as he rode by with his hand on his side and his hat on one ear, as proud as a lord.\nThough he was scarcely eleven years of age, Master George wore straps and the most beautiful little boots like a man. He had gilt spurs, and a gold-headed whip, and a fine pin in his handkerchief, and the neatest little kid gloves which Lamb's Conduit Street could furnish. His mother had given him a couple of neckcloths, and carefully hemmed and made some little shirts for him; but when her Eli came to see the widow, they were replaced by much finer linen. He had little jewelled buttons in the lawn shirt fronts. Her humble presents had been put aside--I believe Miss Osborne had given them to the coachman's boy. Amelia tried to think she was pleased at the change. Indeed, she was happy and charmed to see the boy looking so beautiful.\nShe had had a little black profile of him done for a shilling, and this was hung up by the side of another portrait over her bed. One day the boy came on his accustomed visit, galloping down the little street at Brompton, and bringing, as usual, all the inhabitants to the windows to admire his splendour, and with great eagerness and a look of triumph in his face, he pulled a case out of his great-coat--it was a natty white great-coat, with a cape and a velvet collar--pulled out a red morocco case, which he gave her.\n\"I bought it with my own money, Mamma,\" he said. \"I thought you'd like it.\"\nAmelia opened the case, and giving a little cry of delighted affection, seized the boy and embraced him a hundred times. It was a miniature of himself, very prettily done (though not half handsome enough, we may be sure, the widow thought). His grandfather had wished to have a picture of him by an artist whose works, exhibited in a shop-window, in Southampton Row, had caught the old gentleman's eye; and George, who had plenty of money, bethought him of asking the painter how much a copy of the little portrait would cost, saying that he would pay for it out of his own money and that he wanted to give it to his mother. The pleased painter executed it for a small price, and old Osborne himself, when he heard of the incident, growled out his satisfaction and gave the boy twice as many sovereigns as he paid for the miniature.\nBut what was the grandfather's pleasure compared to Amelia's ecstacy? That proof of the boy's affection charmed her so that she thought no child in the world was like hers for goodness. For long weeks after, the thought of his love made her happy. She slept better with the picture under her pillow, and how many many times did she kiss it and weep and pray over it! A small kindness from those she loved made that timid heart grateful. Since her parting with George she had had no such joy and consolation.\nAt his new home Master George ruled like a lord; at dinner he invited the ladies to drink wine with the utmost coolness, and took off his champagne in a way which charmed his old grandfather. \"Look at him,\" the old man would say, nudging his neighbour with a delighted purple face, \"did you ever see such a chap? Lord, Lord! he'll be ordering a dressing-case next, and razors to shave with; I'm blessed if he won't.\"\nThe antics of the lad did not, however, delight Mr. Osborne's friends so much as they pleased the old gentleman. It gave Mr. Justice Coffin no pleasure to hear Georgy cut into the conversation and spoil his stories. Colonel Fogey was not interested in seeing the little boy half tipsy. Mr. Sergeant Toffy's lady felt no particular gratitude, when, with a twist of his elbow, he tilted a glass of port-wine over her yellow satin and laughed at the disaster; nor was she better pleased, although old Osborne was highly delighted, when Georgy \"whopped\" her third boy (a young gentleman a year older than Georgy, and by chance home for the holidays from Dr. Tickleus's at Ealing School) in Russell Square. George's grandfather gave the boy a couple of sovereigns for that feat and promised to reward him further for every boy above his own size and age whom he whopped in a similar manner. It is difficult to say what good the old man saw in these combats; he had a vague notion that quarrelling made boys hardy, and that tyranny was a useful accomplishment for them to learn. English youth have been so educated time out of mind, and we have hundreds of thousands of apologists and admirers of injustice, misery, and brutality, as perpetrated among children. Flushed with praise and victory over Master Toffy, George wished naturally to pursue his conquests further, and one day as he was strutting about in prodigiously dandified new clothes, near St. Pancras, and a young baker's boy made sarcastic comments upon his appearance, the youthful patrician pulled off his dandy jacket with great spirit, and giving it in charge to the friend who accompanied him (Master Todd, of Great Coram Street, Russell Square, son of the junior partner of the house of Osborne and Co.), George tried to whop the little baker. But the chances of war were unfavourable this time, and the little baker whopped Georgy, who came home with a rueful black eye and all his fine shirt frill dabbled with the claret drawn from his own little nose. He told his grandfather that he had been in combat with a giant, and frightened his poor mother at Brompton with long, and by no means authentic, accounts of the battle.\nThis young Todd, of Coram Street, Russell Square, was Master George's great friend and admirer. They both had a taste for painting theatrical characters; for hardbake and raspberry tarts; for sliding and skating in the Regent's Park and the Serpentine, when the weather permitted; for going to the play, whither they were often conducted, by Mr. Osborne's orders, by Rowson, Master George's appointed body-servant, with whom they sat in great comfort in the pit.\nIn the company of this gentleman they visited all the principal theatres of the metropolis; knew the names of all the actors from Drury Lane to Sadler's Wells; and performed, indeed, many of the plays to the Todd family and their youthful friends, with West's famous characters, on their pasteboard theatre. Rowson, the footman, who was of a generous disposition, would not unfrequently, when in cash, treat his young master to oysters after the play, and to a glass of rum-shrub for a night-cap. We may be pretty certain that Mr. Rowson profited in his turn by his young master's liberality and gratitude for the pleasures to which the footman inducted him.\nA famous tailor from the West End of the town--Mr. Osborne would have none of your City or Holborn bunglers, he said, for the boy (though a City tailor was good enough for HIM)--was summoned to ornament little George's person, and was told to spare no expense in so doing. So, Mr. Woolsey, of Conduit Street, gave a loose to his imagination and sent the child home fancy trousers, fancy waistcoats, and fancy jackets enough to furnish a school of little dandies. Georgy had little white waistcoats for evening parties, and little cut velvet waistcoats for dinners, and a dear little darling shawl dressing-gown, for all the world like a little man. He dressed for dinner every day, \"like a regular West End swell,\" as his grandfather remarked; one of the domestics was affected to his special service, attended him at his toilette, answered his bell, and brought him his letters always on a silver tray.\nGeorgy, after breakfast, would sit in the arm-chair in the dining-room and read the Morning Post, just like a grown-up man. \"How he DU dam and swear,\" the servants would cry, delighted at his precocity. Those who remembered the Captain his father, declared Master George was his Pa, every inch of him. He made the house lively by his activity, his imperiousness, his scolding, and his good-nature.\nGeorge's education was confided to a neighbouring scholar and private pedagogue who \"prepared young noblemen and gentlemen for the Universities, the senate, and the learned professions: whose system did not embrace the degrading corporal severities still practised at the ancient places of education, and in whose family the pupils would find the elegances of refined society and the confidence and affection of a home.\" It was in this way that the Reverend Lawrence Veal of Hart Street, Bloomsbury, and domestic Chaplain to the Earl of Bareacres, strove with Mrs. Veal his wife to entice pupils.\nBy thus advertising and pushing sedulously, the domestic Chaplain and his Lady generally succeeded in having one or two scholars by them--who paid a high figure and were thought to be in uncommonly comfortable quarters. There was a large West Indian, whom nobody came to see, with a mahogany complexion, a woolly head, and an exceedingly dandyfied appearance; there was another hulking boy of three-and-twenty whose education had been neglected and whom Mr. and Mrs. Veal were to introduce into the polite world; there were two sons of Colonel Bangles of the East India Company's Service: these four sat down to dinner at Mrs. Veal's genteel board, when Georgy was introduced to her establishment.\nGeorgy was, like some dozen other pupils, only a day boy; he arrived in the morning under the guardianship of his friend Mr. Rowson, and if it was fine, would ride away in the afternoon on his pony, followed by the groom. The wealth of his grandfather was reported in the school to be prodigious. The Rev. Mr. Veal used to compliment Georgy upon it personally, warning him that he was destined for a high station; that it became him to prepare, by sedulity and docility in youth, for the lofty duties to which he would be called in mature age; that obedience in the child was the best preparation for command in the man; and that he therefore begged George would not bring toffee into the school and ruin the health of the Masters Bangles, who had everything they wanted at the elegant and abundant table of Mrs. Veal.\nWith respect to learning, \"the Curriculum,\" as Mr. Veal loved to call it, was of prodigious extent, and the young gentlemen in Hart Street might learn a something of every known science. The Rev. Mr. Veal had an orrery, an electrifying machine, a turning lathe, a theatre (in the wash-house), a chemical apparatus, and what he called a select library of all the works of the best authors of ancient and modern times and languages. He took the boys to the British Museum and descanted upon the antiquities and the specimens of natural history there, so that audiences would gather round him as he spoke, and all Bloomsbury highly admired him as a prodigiously well-informed man. And whenever he spoke (which he did almost always), he took care to produce the very finest and longest words of which the vocabulary gave him the use, rightly judging that it was as cheap to employ a handsome, large, and sonorous epithet, as to use a little stingy one.\nThus he would say to George in school, \"I observed on my return home from taking the indulgence of an evening's scientific conversation with my excellent friend Doctor Bulders--a true archaeologian, gentlemen, a true archaeologian--that the windows of your venerated grandfather's almost princely mansion in Russell Square were illuminated as if for the purposes of festivity. Am I right in my conjecture that Mr. Osborne entertained a society of chosen spirits round his sumptuous board last night?\"\nLittle Georgy, who had considerable humour, and used to mimic Mr. Veal to his face with great spirit and dexterity, would reply that Mr. V. was quite correct in his surmise.\n\"Then those friends who had the honour of partaking of Mr. Osborne's hospitality, gentlemen, had no reason, I will lay any wager, to complain of their repast. I myself have been more than once so favoured. (By the way, Master Osborne, you came a little late this morning, and have been a defaulter in this respect more than once.) I myself, I say, gentlemen, humble as I am, have been found not unworthy to share Mr. Osborne's elegant hospitality. And though I have feasted with the great and noble of the world--for I presume that I may call my excellent friend and patron, the Right Honourable George Earl of Bareacres, one of the number--yet I assure you that the board of the British merchant was to the full as richly served, and his reception as gratifying and noble. Mr. Bluck, sir, we will resume, if you please, that passage of Eutropis, which was interrupted by the late arrival of Master Osborne.\"\nTo this great man George's education was for some time entrusted. Amelia was bewildered by his phrases, but thought him a prodigy of learning. That poor widow made friends of Mrs. Veal, for reasons of her own. She liked to be in the house and see Georgy coming to school there. She liked to be asked to Mrs. Veal's conversazioni, which took place once a month (as you were informed on pink cards, with AOHNH [_Transcriber's Note: The name of the Greek goddess Athene; the \"O\" represents a capital theta._] engraved on them), and where the professor welcomed his pupils and their friends to weak tea and scientific conversation. Poor little Amelia never missed one of these entertainments and thought them delicious so long as she might have Georgy sitting by her. And she would walk from Brompton in any weather, and embrace Mrs. Veal with tearful gratitude for the delightful evening she had passed, when, the company having retired and Georgy gone off with Mr. Rowson, his attendant, poor Mrs. Osborne put on her cloaks and her shawls preparatory to walking home.\nAs for the learning which Georgy imbibed under this valuable master of a hundred sciences, to judge from the weekly reports which the lad took home to his grandfather, his progress was remarkable. The names of a score or more of desirable branches of knowledge were printed in a table, and the pupil's progress in each was marked by the professor. In Greek Georgy was pronounced aristos, in Latin optimus, in French tres bien, and so forth; and everybody had prizes for everything at the end of the year. Even Mr. Swartz, the wooly-headed young gentleman, and half-brother to the Honourable Mrs. Mac Mull, and Mr. Bluck, the neglected young pupil of three-and-twenty from the agricultural district, and that idle young scapegrace of a Master Todd before mentioned, received little eighteen-penny books, with \"Athene\" engraved on them, and a pompous Latin inscription from the professor to his young friends.\nThe family of this Master Todd were hangers-on of the house of Osborne. The old gentleman had advanced Todd from being a clerk to be a junior partner in his establishment.\nMr. Osborne was the godfather of young Master Todd (who in subsequent life wrote Mr. Osborne Todd on his cards and became a man of decided fashion), while Miss Osborne had accompanied Miss Maria Todd to the font, and gave her protegee a prayer-book, a collection of tracts, a volume of very low church poetry, or some such memento of her goodness every year. Miss O. drove the Todds out in her carriage now and then; when they were ill, her footman, in large plush smalls and waistcoat, brought jellies and delicacies from Russell Square to Coram Street. Coram Street trembled and looked up to Russell Square indeed, and Mrs. Todd, who had a pretty hand at cutting out paper trimmings for haunches of mutton, and could make flowers, ducks, &c., out of turnips and carrots in a very creditable manner, would go to \"the Square,\" as it was called, and assist in the preparations incident to a great dinner, without even so much as thinking of sitting down to the banquet. If any guest failed at the eleventh hour, Todd was asked to dine. Mrs. Todd and Maria came across in the evening, slipped in with a muffled knock, and were in the drawing-room by the time Miss Osborne and the ladies under her convoy reached that apartment--and ready to fire off duets and sing until the gentlemen came up. Poor Maria Todd; poor young lady! How she had to work and thrum at these duets and sonatas in the Street, before they appeared in public in the Square!\nThus it seemed to be decreed by fate that Georgy was to domineer over everybody with whom he came in contact, and that friends, relatives, and domestics were all to bow the knee before the little fellow. It must be owned that he accommodated himself very willingly to this arrangement. Most people do so. And Georgy liked to play the part of master and perhaps had a natural aptitude for it.\nIn Russell Square everybody was afraid of Mr. Osborne, and Mr. Osborne was afraid of Georgy. The boy's dashing manners, and offhand rattle about books and learning, his likeness to his father (dead unreconciled in Brussels yonder) awed the old gentleman and gave the young boy the mastery. The old man would start at some hereditary feature or tone unconsciously used by the little lad, and fancy that George's father was again before him. He tried by indulgence to the grandson to make up for harshness to the elder George. People were surprised at his gentleness to the boy. He growled and swore at Miss Osborne as usual, and would smile when George came down late for breakfast.\nMiss Osborne, George's aunt, was a faded old spinster, broken down by more than forty years of dulness and coarse usage. It was easy for a lad of spirit to master her. And whenever George wanted anything from her, from the jam-pots in her cupboards to the cracked and dry old colours in her paint-box (the old paint-box which she had had when she was a pupil of Mr. Smee and was still almost young and blooming), Georgy took possession of the object of his desire, which obtained, he took no further notice of his aunt.\nFor his friends and cronies, he had a pompous old schoolmaster, who flattered him, and a toady, his senior, whom he could thrash. It was dear Mrs. Todd's delight to leave him with her youngest daughter, Rosa Jemima, a darling child of eight years old. The little pair looked so well together, she would say (but not to the folks in \"the Square,\" we may be sure) \"who knows what might happen? Don't they make a pretty little couple?\" the fond mother thought.\nThe broken-spirited, old, maternal grandfather was likewise subject to the little tyrant. He could not help respecting a lad who had such fine clothes and rode with a groom behind him. Georgy, on his side, was in the constant habit of hearing coarse abuse and vulgar satire levelled at John Sedley by his pitiless old enemy, Mr. Osborne. Osborne used to call the other the old pauper, the old coal-man, the old bankrupt, and by many other such names of brutal contumely. How was little George to respect a man so prostrate? A few months after he was with his paternal grandfather, Mrs. Sedley died. There had been little love between her and the child. He did not care to show much grief. He came down to visit his mother in a fine new suit of mourning, and was very angry that he could not go to a play upon which he had set his heart.\nThe illness of that old lady had been the occupation and perhaps the safeguard of Amelia. What do men know about women's martyrdoms? We should go mad had we to endure the hundredth part of those daily pains which are meekly borne by many women. Ceaseless slavery meeting with no reward; constant gentleness and kindness met by cruelty as constant; love, labour, patience, watchfulness, without even so much as the acknowledgement of a good word; all this, how many of them have to bear in quiet, and appear abroad with cheerful faces as if they felt nothing. Tender slaves that they are, they must needs be hypocrites and weak.\nFrom her chair Amelia's mother had taken to her bed, which she had never left, and from which Mrs. Osborne herself was never absent except when she ran to see George. The old lady grudged her even those rare visits; she, who had been a kind, smiling, good-natured mother once, in the days of her prosperity, but whom poverty and infirmities had broken down. Her illness or estrangement did not affect Amelia. They rather enabled her to support the other calamity under which she was suffering, and from the thoughts of which she was kept by the ceaseless calls of the invalid. Amelia bore her harshness quite gently; smoothed the uneasy pillow; was always ready with a soft answer to the watchful, querulous voice; soothed the sufferer with words of hope, such as her pious simple heart could best feel and utter, and closed the eyes that had once looked so tenderly upon her.\nThen all her time and tenderness were devoted to the consolation and comfort of the bereaved old father, who was stunned by the blow which had befallen him, and stood utterly alone in the world. His wife, his honour, his fortune, everything he loved best had fallen away from him. There was only Amelia to stand by and support with her gentle arms the tottering, heart-broken old man. We are not going to write the history: it would be too dreary and stupid. I can see Vanity Fair yawning over it d'avance.\nOne day as the young gentlemen were assembled in the study at the Rev. Mr. Veal's, and the domestic chaplain to the Right Honourable the Earl of Bareacres was spouting away as usual, a smart carriage drove up to the door decorated with the statue of Athene, and two gentlemen stepped out. The young Masters Bangles rushed to the window with a vague notion that their father might have arrived from Bombay. The great hulking scholar of three-and-twenty, who was crying secretly over a passage of Eutropius, flattened his neglected nose against the panes and looked at the drag, as the laquais de place sprang from the box and let out the persons in the carriage.\n\"It's a fat one and a thin one,\" Mr. Bluck said as a thundering knock came to the door.\nEverybody was interested, from the domestic chaplain himself, who hoped he saw the fathers of some future pupils, down to Master Georgy, glad of any pretext for laying his book down.\nThe boy in the shabby livery with the faded copper buttons, who always thrust himself into the tight coat to open the door, came into the study and said, \"Two gentlemen want to see Master Osborne.\" The professor had had a trifling altercation in the morning with that young gentleman, owing to a difference about the introduction of crackers in school-time; but his face resumed its habitual expression of bland courtesy as he said, \"Master Osborne, I give you full permission to go and see your carriage friends--to whom I beg you to convey the respectful compliments of myself and Mrs. Veal.\"\nGeorgy went into the reception-room and saw two strangers, whom he looked at with his head up, in his usual haughty manner. One was fat, with mustachios, and the other was lean and long, in a blue frock-coat, with a brown face and a grizzled head.\n\"My God, how like he is!\" said the long gentleman with a start. \"Can you guess who we are, George?\"\nThe boy's face flushed up, as it did usually when he was moved, and his eyes brightened. \"I don't know the other,\" he said, \"but I should think you must be Major Dobbin.\"\nIndeed it was our old friend. His voice trembled with pleasure as he greeted the boy, and taking both the other's hands in his own, drew the lad to him.\n\"Your mother has talked to you about me--has she?\" he said.\n\"That she has,\" Georgy answered, \"hundreds and hundreds of times.\"",
        "paragraph_chars": [
            [
                0,
                361
            ],
            [
                361,
                1767
            ],
            [
                1767,
                2938
            ],
            [
                2938,
                3254
            ],
            [
                3254,
                3993
            ],
            [
                3993,
                5442
            ],
            [
                5442,
                6185
            ],
            [
                6185,
                6707
            ],
            [
                6707,
                6783
            ],
            [
                6783,
                7616
            ],
            [
                7616,
                8124
            ],
            [
                8124,
                8541
            ],
            [
                8541,
                10731
            ],
            [
                10731,
                11194
            ],
            [
                11194,
                11853
            ],
            [
                11853,
                12757
            ],
            [
                12757,
                13155
            ],
            [
                13155,
                13752
            ],
            [
                13752,
                14450
            ],
            [
                14450,
                15269
            ],
            [
                15269,
                16218
            ],
            [
                16218,
                16719
            ],
            [
                16719,
                16893
            ],
            [
                16893,
                17802
            ],
            [
                17802,
                18868
            ],
            [
                18868,
                19776
            ],
            [
                19776,
                19948
            ],
            [
                19948,
                21392
            ],
            [
                21392,
                21784
            ],
            [
                21784,
                22466
            ],
            [
                22466,
                22986
            ],
            [
                22986,
                23444
            ],
            [
                23444,
                24281
            ],
            [
                24281,
                24909
            ],
            [
                24909,
                25786
            ],
            [
                25786,
                26293
            ],
            [
                26293,
                26955
            ],
            [
                26955,
                27043
            ],
            [
                27043,
                27226
            ],
            [
                27226,
                27821
            ],
            [
                27821,
                28069
            ],
            [
                28069,
                28169
            ],
            [
                28169,
                28340
            ],
            [
                28340,
                28493
            ],
            [
                28493,
                28553
            ],
            [
                28553,
                28619
            ]
        ],
        "segment_chars": [
            [
                0,
                180
            ],
            [
                180,
                288
            ],
            [
                288,
                361
            ],
            [
                361,
                444
            ],
            [
                444,
                500
            ],
            [
                500,
                563
            ],
            [
                563,
                812
            ],
            [
                812,
                917
            ],
            [
                917,
                998
            ],
            [
                998,
                1101
            ],
            [
                1101,
                1206
            ],
            [
                1206,
                1566
            ],
            [
                1566,
                1767
            ],
            [
                1767,
                2009
            ],
            [
                2009,
                2074
            ],
            [
                2074,
                2142
            ],
            [
                2142,
                2474
            ],
            [
                2474,
                2693
            ],
            [
                2693,
                2938
            ],
            [
                2938,
                3157
            ],
            [
                3157,
                3254
            ],
            [
                3254,
                3567
            ],
            [
                3567,
                3675
            ],
            [
                3675,
                3723
            ],
            [
                3723,
                3993
            ],
            [
                3993,
                4122
            ],
            [
                4122,
                4517
            ],
            [
                4517,
                4695
            ],
            [
                4695,
                4841
            ],
            [
                4841,
                5021
            ],
            [
                5021,
                5442
            ],
            [
                5442,
                5560
            ],
            [
                5560,
                5716
            ],
            [
                5716,
                5903
            ],
            [
                5903,
                5960
            ],
            [
                5960,
                6061
            ],
            [
                6061,
                6114
            ],
            [
                6114,
                6185
            ],
            [
                6185,
                6315
            ],
            [
                6315,
                6707
            ],
            [
                6707,
                6756
            ],
            [
                6756,
                6783
            ],
            [
                6783,
                6904
            ],
            [
                6904,
                7024
            ],
            [
                7024,
                7408
            ],
            [
                7408,
                7616
            ],
            [
                7616,
                7686
            ],
            [
                7686,
                7802
            ],
            [
                7802,
                7864
            ],
            [
                7864,
                7983
            ],
            [
                7983,
                8053
            ],
            [
                8053,
                8124
            ],
            [
                8124,
                8316
            ],
            [
                8316,
                8437
            ],
            [
                8437,
                8449
            ],
            [
                8449,
                8541
            ],
            [
                8541,
                8654
            ],
            [
                8654,
                8757
            ],
            [
                8757,
                8827
            ],
            [
                8827,
                9243
            ],
            [
                9243,
                9427
            ],
            [
                9427,
                9614
            ],
            [
                9614,
                9797
            ],
            [
                9797,
                10349
            ],
            [
                10349,
                10561
            ],
            [
                10561,
                10731
            ],
            [
                10731,
                10827
            ],
            [
                10827,
                11194
            ],
            [
                11194,
                11502
            ],
            [
                11502,
                11691
            ],
            [
                11691,
                11853
            ],
            [
                11853,
                12126
            ],
            [
                12126,
                12316
            ],
            [
                12316,
                12502
            ],
            [
                12502,
                12757
            ],
            [
                12757,
                12881
            ],
            [
                12881,
                12960
            ],
            [
                12960,
                13059
            ],
            [
                13059,
                13155
            ],
            [
                13155,
                13576
            ],
            [
                13576,
                13752
            ],
            [
                13752,
                13972
            ],
            [
                13972,
                14450
            ],
            [
                14450,
                14672
            ],
            [
                14672,
                14747
            ],
            [
                14747,
                15269
            ],
            [
                15269,
                15456
            ],
            [
                15456,
                15700
            ],
            [
                15700,
                15947
            ],
            [
                15947,
                16218
            ],
            [
                16218,
                16595
            ],
            [
                16595,
                16719
            ],
            [
                16719,
                16893
            ],
            [
                16893,
                17052
            ],
            [
                17052,
                17099
            ],
            [
                17099,
                17224
            ],
            [
                17224,
                17341
            ],
            [
                17341,
                17667
            ],
            [
                17667,
                17802
            ],
            [
                17802,
                17868
            ],
            [
                17868,
                17945
            ],
            [
                17945,
                18012
            ],
            [
                18012,
                18080
            ],
            [
                18080,
                18430
            ],
            [
                18430,
                18566
            ],
            [
                18566,
                18868
            ],
            [
                18868,
                19065
            ],
            [
                19065,
                19216
            ],
            [
                19216,
                19373
            ],
            [
                19373,
                19776
            ],
            [
                19776,
                19848
            ],
            [
                19848,
                19948
            ],
            [
                19948,
                20307
            ],
            [
                20307,
                20503
            ],
            [
                20503,
                20917
            ],
            [
                20917,
                20983
            ],
            [
                20983,
                21240
            ],
            [
                21240,
                21274
            ],
            [
                21274,
                21392
            ],
            [
                21392,
                21596
            ],
            [
                21596,
                21678
            ],
            [
                21678,
                21697
            ],
            [
                21697,
                21784
            ],
            [
                21784,
                21877
            ],
            [
                21877,
                22074
            ],
            [
                22074,
                22224
            ],
            [
                22224,
                22309
            ],
            [
                22309,
                22361
            ],
            [
                22361,
                22466
            ],
            [
                22466,
                22587
            ],
            [
                22587,
                22634
            ],
            [
                22634,
                22986
            ],
            [
                22986,
                23116
            ],
            [
                23116,
                23238
            ],
            [
                23238,
                23378
            ],
            [
                23378,
                23419
            ],
            [
                23419,
                23444
            ],
            [
                23444,
                23534
            ],
            [
                23534,
                23629
            ],
            [
                23629,
                23782
            ],
            [
                23782,
                23915
            ],
            [
                23915,
                23968
            ],
            [
                23968,
                24043
            ],
            [
                24043,
                24097
            ],
            [
                24097,
                24133
            ],
            [
                24133,
                24281
            ],
            [
                24281,
                24371
            ],
            [
                24371,
                24414
            ],
            [
                24414,
                24526
            ],
            [
                24526,
                24840
            ],
            [
                24840,
                24909
            ],
            [
                24909,
                25076
            ],
            [
                25076,
                25267
            ],
            [
                25267,
                25318
            ],
            [
                25318,
                25486
            ],
            [
                25486,
                25786
            ],
            [
                25786,
                25981
            ],
            [
                25981,
                26067
            ],
            [
                26067,
                26171
            ],
            [
                26171,
                26245
            ],
            [
                26245,
                26293
            ],
            [
                26293,
                26582
            ],
            [
                26582,
                26699
            ],
            [
                26699,
                26955
            ],
            [
                26955,
                27043
            ],
            [
                27043,
                27226
            ],
            [
                27226,
                27424
            ],
            [
                27424,
                27821
            ],
            [
                27821,
                27945
            ],
            [
                27945,
                28069
            ],
            [
                28069,
                28095
            ],
            [
                28095,
                28133
            ],
            [
                28133,
                28169
            ],
            [
                28169,
                28258
            ],
            [
                28258,
                28340
            ],
            [
                28340,
                28370
            ],
            [
                28370,
                28493
            ],
            [
                28493,
                28544
            ],
            [
                28544,
                28553
            ],
            [
                28553,
                28619
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                30,
                89
            ],
            [
                102,
                119
            ],
            [
                133,
                141
            ],
            [
                151,
                157
            ],
            [
                162,
                172
            ],
            [
                178,
                180
            ],
            [
                245,
                252
            ],
            [
                184,
                194
            ],
            [
                213,
                216
            ],
            [
                196,
                211
            ],
            [
                253,
                256
            ],
            [
                270,
                278
            ],
            [
                286,
                288
            ],
            [
                288,
                361
            ],
            [
                361,
                393
            ],
            [
                410,
                414
            ],
            [
                432,
                442
            ],
            [
                415,
                418
            ],
            [
                442,
                444
            ],
            [
                444,
                453
            ],
            [
                463,
                476
            ],
            [
                500,
                563
            ],
            [
                563,
                586
            ],
            [
                602,
                604
            ],
            [
                609,
                650
            ],
            [
                652,
                655
            ],
            [
                693,
                701
            ],
            [
                711,
                713
            ],
            [
                685,
                688
            ],
            [
                676,
                680
            ],
            [
                658,
                668
            ],
            [
                650,
                651
            ],
            [
                737,
                754
            ],
            [
                780,
                812
            ],
            [
                812,
                857
            ],
            [
                917,
                919
            ],
            [
                947,
                998
            ],
            [
                1101,
                1160
            ],
            [
                1204,
                1205
            ],
            [
                1206,
                1236
            ],
            [
                1240,
                1246
            ],
            [
                1314,
                1318
            ],
            [
                1272,
                1303
            ],
            [
                1324,
                1328
            ],
            [
                1339,
                1347
            ],
            [
                1442,
                1464
            ],
            [
                1483,
                1510
            ],
            [
                1526,
                1566
            ],
            [
                1581,
                1584
            ],
            [
                1566,
                1568
            ],
            [
                1575,
                1580
            ],
            [
                1611,
                1657
            ],
            [
                1675,
                1690
            ],
            [
                1700,
                1724
            ],
            [
                1740,
                1752
            ],
            [
                1765,
                1767
            ],
            [
                1767,
                1804
            ],
            [
                1813,
                1849
            ],
            [
                1864,
                1892
            ],
            [
                1907,
                1914
            ],
            [
                1931,
                1964
            ],
            [
                1965,
                1978
            ],
            [
                2003,
                2009
            ],
            [
                2009,
                2039
            ],
            [
                2040,
                2060
            ],
            [
                2072,
                2074
            ],
            [
                2074,
                2097
            ],
            [
                2116,
                2121
            ],
            [
                2098,
                2105
            ],
            [
                2126,
                2129
            ],
            [
                2140,
                2142
            ],
            [
                2196,
                2203
            ],
            [
                2209,
                2213
            ],
            [
                2214,
                2222
            ],
            [
                2233,
                2251
            ],
            [
                2255,
                2260
            ],
            [
                2292,
                2349
            ],
            [
                2365,
                2457
            ],
            [
                2472,
                2474
            ],
            [
                2474,
                2513
            ],
            [
                2518,
                2567
            ],
            [
                2574,
                2578
            ],
            [
                2680,
                2691
            ],
            [
                2602,
                2606
            ],
            [
                2589,
                2594
            ],
            [
                2637,
                2647
            ],
            [
                2617,
                2624
            ],
            [
                2691,
                2693
            ],
            [
                2748,
                2822
            ],
            [
                2938,
                2962
            ],
            [
                2968,
                2993
            ],
            [
                3047,
                3087
            ],
            [
                3122,
                3157
            ],
            [
                3157,
                3204
            ],
            [
                3210,
                3216
            ],
            [
                3242,
                3254
            ],
            [
                3254,
                3284
            ],
            [
                3509,
                3512
            ],
            [
                3291,
                3302
            ],
            [
                3407,
                3433
            ],
            [
                3446,
                3455
            ],
            [
                3494,
                3508
            ],
            [
                3522,
                3546
            ],
            [
                3554,
                3567
            ],
            [
                4378,
                4384
            ],
            [
                4185,
                4189
            ],
            [
                4221,
                4226
            ],
            [
                4242,
                4287
            ],
            [
                4434,
                4442
            ],
            [
                4419,
                4432
            ],
            [
                4352,
                4355
            ],
            [
                4446,
                4516
            ],
            [
                4517,
                4529
            ],
            [
                4590,
                4593
            ],
            [
                4566,
                4570
            ],
            [
                4594,
                4656
            ],
            [
                4660,
                4695
            ],
            [
                4695,
                4752
            ],
            [
                4771,
                4800
            ],
            [
                4757,
                4760
            ],
            [
                4816,
                4841
            ],
            [
                5021,
                5062
            ],
            [
                5064,
                5069
            ],
            [
                5084,
                5089
            ],
            [
                5109,
                5115
            ],
            [
                5170,
                5203
            ],
            [
                5241,
                5265
            ],
            [
                5267,
                5289
            ],
            [
                5298,
                5314
            ],
            [
                5329,
                5371
            ],
            [
                5420,
                5442
            ],
            [
                5442,
                5471
            ],
            [
                5484,
                5504
            ],
            [
                5516,
                5558
            ],
            [
                5558,
                5560
            ],
            [
                5560,
                5606
            ],
            [
                5647,
                5651
            ],
            [
                5655,
                5672
            ],
            [
                5714,
                5716
            ],
            [
                5716,
                5730
            ],
            [
                5769,
                5778
            ],
            [
                5790,
                5794
            ],
            [
                5807,
                5813
            ],
            [
                5765,
                5768
            ],
            [
                5753,
                5763
            ],
            [
                5814,
                5831
            ],
            [
                5903,
                5905
            ],
            [
                5840,
                5851
            ],
            [
                5832,
                5835
            ],
            [
                5861,
                5901
            ],
            [
                5763,
                5764
            ],
            [
                5917,
                5933
            ],
            [
                5958,
                5960
            ],
            [
                5960,
                5998
            ],
            [
                6010,
                6061
            ],
            [
                6061,
                6098
            ],
            [
                6112,
                6114
            ],
            [
                6114,
                6185
            ],
            [
                6185,
                6188
            ],
            [
                6193,
                6205
            ],
            [
                6212,
                6268
            ],
            [
                6292,
                6315
            ],
            [
                6315,
                6342
            ],
            [
                6354,
                6379
            ],
            [
                6387,
                6405
            ],
            [
                6495,
                6519
            ],
            [
                6530,
                6537
            ],
            [
                6549,
                6553
            ],
            [
                6664,
                6669
            ],
            [
                6563,
                6567
            ],
            [
                6705,
                6707
            ],
            [
                6707,
                6756
            ],
            [
                6756,
                6783
            ],
            [
                6783,
                6819
            ],
            [
                6827,
                6833
            ],
            [
                6853,
                6886
            ],
            [
                6902,
                6904
            ],
            [
                6904,
                6953
            ],
            [
                7024,
                7075
            ],
            [
                7076,
                7088
            ],
            [
                7184,
                7222
            ],
            [
                7247,
                7324
            ],
            [
                7375,
                7407
            ],
            [
                7691,
                7731
            ],
            [
                7740,
                7777
            ],
            [
                7732,
                7734
            ],
            [
                7783,
                7787
            ],
            [
                7800,
                7802
            ],
            [
                7802,
                7805
            ],
            [
                7811,
                7864
            ],
            [
                7864,
                7928
            ],
            [
                7934,
                7959
            ],
            [
                7969,
                7983
            ],
            [
                8053,
                8124
            ],
            [
                8124,
                8185
            ],
            [
                8186,
                8218
            ],
            [
                8243,
                8253
            ],
            [
                8262,
                8298
            ],
            [
                8303,
                8315
            ],
            [
                8555,
                8562
            ],
            [
                8545,
                8551
            ],
            [
                8563,
                8610
            ],
            [
                8652,
                8654
            ],
            [
                8654,
                8757
            ],
            [
                8757,
                8827
            ],
            [
                8829,
                8830
            ],
            [
                8840,
                8845
            ],
            [
                8853,
                8860
            ],
            [
                8872,
                8881
            ],
            [
                8883,
                8887
            ],
            [
                8916,
                8968
            ],
            [
                8969,
                9009
            ],
            [
                9017,
                9104
            ],
            [
                9241,
                9243
            ],
            [
                9243,
                9276
            ],
            [
                9289,
                9340
            ],
            [
                9349,
                9381
            ],
            [
                9390,
                9427
            ],
            [
                9427,
                9454
            ],
            [
                9460,
                9594
            ],
            [
                9612,
                9614
            ],
            [
                9614,
                9632
            ],
            [
                9633,
                9640
            ],
            [
                9795,
                9796
            ],
            [
                9797,
                9809
            ],
            [
                9821,
                9861
            ],
            [
                9872,
                9903
            ],
            [
                9989,
                9990
            ],
            [
                9909,
                9945
            ],
            [
                9959,
                9981
            ],
            [
                10004,
                10047
            ],
            [
                10310,
                10316
            ],
            [
                10092,
                10106
            ],
            [
                10113,
                10152
            ],
            [
                10163,
                10165
            ],
            [
                10053,
                10056
            ],
            [
                10170,
                10176
            ],
            [
                10198,
                10210
            ],
            [
                10317,
                10349
            ],
            [
                10349,
                10352
            ],
            [
                10390,
                10400
            ],
            [
                10405,
                10517
            ],
            [
                10535,
                10547
            ],
            [
                10555,
                10561
            ],
            [
                10561,
                10596
            ],
            [
                10617,
                10656
            ],
            [
                10669,
                10731
            ],
            [
                10731,
                10747
            ],
            [
                10748,
                10750
            ],
            [
                10779,
                10827
            ],
            [
                10827,
                10852
            ],
            [
                10902,
                10942
            ],
            [
                10968,
                11011
            ],
            [
                10898,
                10901
            ],
            [
                11012,
                11034
            ],
            [
                11043,
                11058
            ],
            [
                11073,
                11075
            ],
            [
                11077,
                11121
            ],
            [
                11192,
                11194
            ],
            [
                11194,
                11196
            ],
            [
                11344,
                11346
            ],
            [
                11201,
                11208
            ],
            [
                11227,
                11247
            ],
            [
                11258,
                11266
            ],
            [
                11284,
                11318
            ],
            [
                11352,
                11367
            ],
            [
                11377,
                11440
            ],
            [
                11500,
                11502
            ],
            [
                11502,
                11509
            ],
            [
                11523,
                11530
            ],
            [
                11534,
                11544
            ],
            [
                11518,
                11522
            ],
            [
                11558,
                11563
            ],
            [
                11596,
                11673
            ],
            [
                11689,
                11691
            ],
            [
                11691,
                11752
            ],
            [
                11756,
                11785
            ],
            [
                11851,
                11853
            ],
            [
                11853,
                11861
            ],
            [
                11878,
                11886
            ],
            [
                11862,
                11868
            ],
            [
                12031,
                12046
            ],
            [
                11962,
                11964
            ],
            [
                12056,
                12069
            ],
            [
                12078,
                12112
            ],
            [
                12124,
                12126
            ],
            [
                12316,
                12326
            ],
            [
                12334,
                12382
            ],
            [
                12387,
                12421
            ],
            [
                12505,
                12595
            ],
            [
                12500,
                12501
            ],
            [
                12597,
                12607
            ],
            [
                12664,
                12667
            ],
            [
                12683,
                12731
            ],
            [
                12739,
                12757
            ],
            [
                13062,
                13154
            ],
            [
                13174,
                13177
            ],
            [
                13190,
                13212
            ],
            [
                13235,
                13263
            ],
            [
                13278,
                13340
            ],
            [
                13460,
                13538
            ],
            [
                13554,
                13576
            ],
            [
                13576,
                13626
            ],
            [
                13655,
                13658
            ],
            [
                13725,
                13733
            ],
            [
                13703,
                13709
            ],
            [
                13734,
                13752
            ],
            [
                13809,
                13830
            ],
            [
                13872,
                13880
            ],
            [
                13794,
                13795
            ],
            [
                13890,
                13912
            ],
            [
                13950,
                13972
            ],
            [
                13972,
                14034
            ],
            [
                14058,
                14069
            ],
            [
                14071,
                14074
            ],
            [
                14056,
                14057
            ],
            [
                14090,
                14121
            ],
            [
                14130,
                14186
            ],
            [
                14187,
                14196
            ],
            [
                14263,
                14329
            ],
            [
                14208,
                14209
            ],
            [
                14341,
                14434
            ],
            [
                14217,
                14218
            ],
            [
                14462,
                14491
            ],
            [
                14508,
                14510
            ],
            [
                14457,
                14460
            ],
            [
                14492,
                14506
            ],
            [
                14460,
                14461
            ],
            [
                14658,
                14660
            ],
            [
                14571,
                14581
            ],
            [
                14670,
                14671
            ],
            [
                14686,
                14701
            ],
            [
                14676,
                14682
            ],
            [
                14702,
                14747
            ],
            [
                14747,
                14862
            ],
            [
                14893,
                14894
            ],
            [
                14907,
                14910
            ],
            [
                14886,
                14893
            ],
            [
                14930,
                14978
            ],
            [
                15261,
                15262
            ],
            [
                15080,
                15099
            ],
            [
                14864,
                14868
            ],
            [
                15100,
                15188
            ],
            [
                15267,
                15269
            ],
            [
                15373,
                15392
            ],
            [
                15414,
                15419
            ],
            [
                15435,
                15456
            ],
            [
                15456,
                15587
            ],
            [
                15603,
                15622
            ],
            [
                15627,
                15656
            ],
            [
                15698,
                15700
            ],
            [
                15700,
                15742
            ],
            [
                15778,
                15791
            ],
            [
                15811,
                15817
            ],
            [
                15774,
                15777
            ],
            [
                15862,
                15864
            ],
            [
                15990,
                15996
            ],
            [
                16002,
                16011
            ],
            [
                16190,
                16196
            ],
            [
                16023,
                16056
            ],
            [
                16216,
                16218
            ],
            [
                16218,
                16393
            ],
            [
                16450,
                16498
            ],
            [
                16506,
                16595
            ],
            [
                16595,
                16719
            ],
            [
                16719,
                16737
            ],
            [
                16767,
                16812
            ],
            [
                16824,
                16893
            ],
            [
                17802,
                17842
            ],
            [
                17857,
                17868
            ],
            [
                17868,
                17945
            ],
            [
                18012,
                18015
            ],
            [
                17961,
                17987
            ],
            [
                18041,
                18044
            ],
            [
                18084,
                18161
            ],
            [
                18197,
                18198
            ],
            [
                18337,
                18430
            ],
            [
                18430,
                18531
            ],
            [
                18543,
                18566
            ],
            [
                18566,
                18579
            ],
            [
                18619,
                18686
            ],
            [
                18613,
                18614
            ],
            [
                18810,
                18816
            ],
            [
                18615,
                18618
            ],
            [
                18854,
                18868
            ],
            [
                18868,
                18874
            ],
            [
                18894,
                18900
            ],
            [
                18879,
                18887
            ],
            [
                18957,
                18991
            ],
            [
                19006,
                19065
            ],
            [
                19216,
                19373
            ],
            [
                19373,
                19377
            ],
            [
                19390,
                19393
            ],
            [
                19399,
                19406
            ],
            [
                19378,
                19389
            ],
            [
                19428,
                19467
            ],
            [
                19472,
                19502
            ],
            [
                19509,
                19534
            ],
            [
                19422,
                19427
            ],
            [
                19540,
                19543
            ],
            [
                19581,
                19592
            ],
            [
                19592,
                19597
            ],
            [
                19610,
                19614
            ],
            [
                19631,
                19669
            ],
            [
                19671,
                19675
            ],
            [
                19601,
                19602
            ],
            [
                19717,
                19753
            ],
            [
                19774,
                19776
            ],
            [
                21392,
                21420
            ],
            [
                21429,
                21471
            ],
            [
                21500,
                21510
            ],
            [
                21550,
                21553
            ],
            [
                21557,
                21596
            ],
            [
                21618,
                21620
            ],
            [
                21676,
                21678
            ],
            [
                21701,
                21784
            ],
            [
                21784,
                21877
            ],
            [
                21877,
                21903
            ],
            [
                21908,
                21948
            ],
            [
                21904,
                21907
            ],
            [
                21949,
                21968
            ],
            [
                21977,
                21981
            ],
            [
                21969,
                21975
            ],
            [
                22015,
                22037
            ],
            [
                22072,
                22074
            ],
            [
                22074,
                22085
            ],
            [
                22227,
                22249
            ],
            [
                22266,
                22277
            ],
            [
                22278,
                22309
            ],
            [
                22309,
                22361
            ],
            [
                22361,
                22397
            ],
            [
                22406,
                22407
            ],
            [
                22412,
                22466
            ],
            [
                22466,
                22478
            ],
            [
                22495,
                22498
            ],
            [
                22499,
                22535
            ],
            [
                22546,
                22560
            ],
            [
                22564,
                22587
            ],
            [
                22587,
                22602
            ],
            [
                22619,
                22634
            ],
            [
                22947,
                22949
            ],
            [
                22654,
                22669
            ],
            [
                22678,
                22729
            ],
            [
                22738,
                22766
            ],
            [
                22929,
                22930
            ],
            [
                22879,
                22904
            ],
            [
                22945,
                22946
            ],
            [
                22634,
                22637
            ],
            [
                22950,
                22986
            ],
            [
                23444,
                23447
            ],
            [
                23465,
                23468
            ],
            [
                23479,
                23490
            ],
            [
                23463,
                23464
            ],
            [
                23468,
                23469
            ],
            [
                23491,
                23534
            ],
            [
                23534,
                23616
            ],
            [
                23627,
                23629
            ],
            [
                23629,
                23653
            ],
            [
                23790,
                23797
            ],
            [
                23679,
                23699
            ],
            [
                23718,
                23757
            ],
            [
                23762,
                23780
            ],
            [
                23827,
                23828
            ],
            [
                23829,
                23868
            ],
            [
                23872,
                23893
            ],
            [
                23913,
                23915
            ],
            [
                23915,
                23918
            ],
            [
                23930,
                23936
            ],
            [
                23940,
                23947
            ],
            [
                23966,
                23968
            ],
            [
                24025,
                24041
            ],
            [
                24023,
                24024
            ],
            [
                24086,
                24095
            ],
            [
                24100,
                24107
            ],
            [
                24116,
                24133
            ],
            [
                24133,
                24247
            ],
            [
                24279,
                24281
            ],
            [
                24281,
                24371
            ],
            [
                24371,
                24414
            ],
            [
                24414,
                24430
            ],
            [
                24435,
                24437
            ],
            [
                24431,
                24434
            ],
            [
                24438,
                24525
            ],
            [
                24930,
                25002
            ],
            [
                24924,
                24930
            ],
            [
                25024,
                25076
            ],
            [
                25076,
                25123
            ],
            [
                25125,
                25128
            ],
            [
                25134,
                25158
            ],
            [
                25173,
                25185
            ],
            [
                25217,
                25220
            ],
            [
                25226,
                25237
            ],
            [
                25250,
                25260
            ],
            [
                25201,
                25204
            ],
            [
                25261,
                25267
            ],
            [
                25486,
                25501
            ],
            [
                25502,
                25511
            ],
            [
                25518,
                25596
            ],
            [
                25607,
                25622
            ],
            [
                25721,
                25726
            ],
            [
                25727,
                25786
            ],
            [
                25786,
                25834
            ],
            [
                25866,
                25909
            ],
            [
                25914,
                25918
            ],
            [
                25979,
                25981
            ],
            [
                26016,
                26067
            ],
            [
                26067,
                26112
            ],
            [
                26113,
                26133
            ],
            [
                26169,
                26171
            ],
            [
                26171,
                26245
            ],
            [
                26245,
                26282
            ],
            [
                26291,
                26293
            ],
            [
                26293,
                26307
            ],
            [
                26324,
                26375
            ],
            [
                26476,
                26513
            ],
            [
                26549,
                26582
            ],
            [
                26582,
                26699
            ],
            [
                26699,
                26702
            ],
            [
                26709,
                26744
            ],
            [
                26799,
                26856
            ],
            [
                26922,
                26925
            ],
            [
                26857,
                26863
            ],
            [
                26953,
                26955
            ],
            [
                26955,
                26987
            ],
            [
                26998,
                27002
            ],
            [
                27003,
                27007
            ],
            [
                27019,
                27024
            ],
            [
                27033,
                27043
            ],
            [
                27226,
                27229
            ],
            [
                27230,
                27233
            ],
            [
                27350,
                27424
            ],
            [
                27424,
                27456
            ],
            [
                27489,
                27493
            ],
            [
                27476,
                27488
            ],
            [
                27509,
                27587
            ],
            [
                27650,
                27657
            ],
            [
                27632,
                27646
            ],
            [
                27657,
                27686
            ],
            [
                27692,
                27721
            ],
            [
                27731,
                27738
            ],
            [
                27740,
                27767
            ],
            [
                27772,
                27794
            ],
            [
                27818,
                27821
            ],
            [
                27821,
                27897
            ],
            [
                27916,
                27945
            ],
            [
                27945,
                28069
            ],
            [
                28069,
                28095
            ],
            [
                28095,
                28133
            ],
            [
                28133,
                28169
            ],
            [
                28169,
                28191
            ],
            [
                28231,
                28258
            ],
            [
                28258,
                28299
            ],
            [
                28307,
                28340
            ],
            [
                28340,
                28370
            ],
            [
                28370,
                28436
            ],
            [
                28463,
                28466
            ],
            [
                28454,
                28459
            ],
            [
                28470,
                28493
            ],
            [
                28493,
                28532
            ],
            [
                28534,
                28544
            ],
            [
                28544,
                28553
            ],
            [
                28553,
                28619
            ]
        ],
        "row_chars": [
            [
                0,
                180
            ],
            [
                180,
                288
            ],
            [
                288,
                361
            ],
            [
                361,
                444
            ],
            [
                444,
                563
            ],
            [
                563,
                812
            ],
            [
                812,
                998
            ],
            [
                998,
                1101
            ],
            [
                1101,
                1206
            ],
            [
                1206,
                1566
            ],
            [
                1566,
                1767
            ],
            [
                1767,
                2009
            ],
            [
                2009,
                2074
            ],
            [
                2074,
                2142
            ],
            [
                2142,
                2474
            ],
            [
                2474,
                2693
            ],
            [
                2693,
                2938
            ],
            [
                2938,
                3157
            ],
            [
                3157,
                3254
            ],
            [
                3254,
                3567
            ],
            [
                3567,
                3675
            ],
            [
                3675,
                3723
            ],
            [
                3723,
                3993
            ],
            [
                3993,
                4122
            ],
            [
                4122,
                4517
            ],
            [
                4517,
                4695
            ],
            [
                4695,
                4841
            ],
            [
                4841,
                5021
            ],
            [
                5021,
                5442
            ],
            [
                5442,
                5560
            ],
            [
                5560,
                5716
            ],
            [
                5716,
                5960
            ],
            [
                5960,
                6061
            ],
            [
                6061,
                6114
            ],
            [
                6114,
                6185
            ],
            [
                6185,
                6315
            ],
            [
                6315,
                6707
            ],
            [
                6707,
                6756
            ],
            [
                6756,
                6783
            ],
            [
                6783,
                6904
            ],
            [
                6904,
                7024
            ],
            [
                7024,
                7408
            ],
            [
                7408,
                7616
            ],
            [
                7616,
                7686
            ],
            [
                7686,
                7802
            ],
            [
                7802,
                7864
            ],
            [
                7864,
                7983
            ],
            [
                7983,
                8053
            ],
            [
                8053,
                8124
            ],
            [
                8124,
                8316
            ],
            [
                8316,
                8437
            ],
            [
                8437,
                8449
            ],
            [
                8449,
                8541
            ],
            [
                8541,
                8654
            ],
            [
                8654,
                8757
            ],
            [
                8757,
                8827
            ],
            [
                8827,
                9243
            ],
            [
                9243,
                9427
            ],
            [
                9427,
                9614
            ],
            [
                9614,
                9797
            ],
            [
                9797,
                10349
            ],
            [
                10349,
                10561
            ],
            [
                10561,
                10731
            ],
            [
                10731,
                10827
            ],
            [
                10827,
                11194
            ],
            [
                11194,
                11502
            ],
            [
                11502,
                11691
            ],
            [
                11691,
                11853
            ],
            [
                11853,
                12126
            ],
            [
                12126,
                12316
            ],
            [
                12316,
                12757
            ],
            [
                12757,
                12881
            ],
            [
                12881,
                12960
            ],
            [
                12960,
                13059
            ],
            [
                13059,
                13155
            ],
            [
                13155,
                13576
            ],
            [
                13576,
                13752
            ],
            [
                13752,
                13972
            ],
            [
                13972,
                14450
            ],
            [
                14450,
                14672
            ],
            [
                14672,
                14747
            ],
            [
                14747,
                15269
            ],
            [
                15269,
                15456
            ],
            [
                15456,
                15700
            ],
            [
                15700,
                16218
            ],
            [
                16218,
                16595
            ],
            [
                16595,
                16719
            ],
            [
                16719,
                16893
            ],
            [
                16893,
                17052
            ],
            [
                17052,
                17099
            ],
            [
                17099,
                17224
            ],
            [
                17224,
                17341
            ],
            [
                17341,
                17667
            ],
            [
                17667,
                17802
            ],
            [
                17802,
                17868
            ],
            [
                17868,
                17945
            ],
            [
                17945,
                18430
            ],
            [
                18430,
                18566
            ],
            [
                18566,
                18868
            ],
            [
                18868,
                19065
            ],
            [
                19065,
                19216
            ],
            [
                19216,
                19373
            ],
            [
                19373,
                19776
            ],
            [
                19776,
                19848
            ],
            [
                19848,
                19948
            ],
            [
                19948,
                20307
            ],
            [
                20307,
                20503
            ],
            [
                20503,
                20917
            ],
            [
                20917,
                20983
            ],
            [
                20983,
                21240
            ],
            [
                21240,
                21274
            ],
            [
                21274,
                21392
            ],
            [
                21392,
                21596
            ],
            [
                21596,
                21678
            ],
            [
                21678,
                21697
            ],
            [
                21697,
                21784
            ],
            [
                21784,
                21877
            ],
            [
                21877,
                22074
            ],
            [
                22074,
                22309
            ],
            [
                22309,
                22361
            ],
            [
                22361,
                22466
            ],
            [
                22466,
                22587
            ],
            [
                22587,
                22634
            ],
            [
                22634,
                22986
            ],
            [
                22986,
                23116
            ],
            [
                23116,
                23238
            ],
            [
                23238,
                23378
            ],
            [
                23378,
                23419
            ],
            [
                23419,
                23444
            ],
            [
                23444,
                23534
            ],
            [
                23534,
                23629
            ],
            [
                23629,
                23915
            ],
            [
                23915,
                23968
            ],
            [
                23968,
                24133
            ],
            [
                24133,
                24281
            ],
            [
                24281,
                24371
            ],
            [
                24371,
                24414
            ],
            [
                24414,
                24526
            ],
            [
                24526,
                24840
            ],
            [
                24840,
                24909
            ],
            [
                24909,
                25076
            ],
            [
                25076,
                25267
            ],
            [
                25267,
                25318
            ],
            [
                25318,
                25486
            ],
            [
                25486,
                25786
            ],
            [
                25786,
                25981
            ],
            [
                25981,
                26067
            ],
            [
                26067,
                26171
            ],
            [
                26171,
                26245
            ],
            [
                26245,
                26293
            ],
            [
                26293,
                26582
            ],
            [
                26582,
                26699
            ],
            [
                26699,
                26955
            ],
            [
                26955,
                27043
            ],
            [
                27043,
                27226
            ],
            [
                27226,
                27424
            ],
            [
                27424,
                27821
            ],
            [
                27821,
                27945
            ],
            [
                27945,
                28069
            ],
            [
                28069,
                28095
            ],
            [
                28095,
                28133
            ],
            [
                28133,
                28169
            ],
            [
                28169,
                28258
            ],
            [
                28258,
                28340
            ],
            [
                28340,
                28370
            ],
            [
                28370,
                28493
            ],
            [
                28493,
                28544
            ],
            [
                28544,
                28553
            ],
            [
                28553,
                28619
            ]
        ]
    },
    "abridged": {
        "text": "Georgy Osborne was now established in his grandfather's mansion in Russell Square, occupying his father's room and heir of all its splendours. The boy's good looks and gallant bearing won his grandfather's heart. Mr. Osborne was as proud of him as ever he had been of the elder George.\nThe child had many more luxuries than his father had. Osborne's business had prospered, and his wealth and importance in the City had very much increased. He had been glad enough to send the elder George to a good private school, and had been proud of his army commission; but for little George, the old man looked much higher. He would make a gentleman of the little chap, he said: a collegian, a Parliament man, a Baronet, perhaps. He would have none but a tip-top college man to educate him.\nA few years before, he used to declare savagely that parsons, scholars, and the like were humbugs, supercilious dogs that looked down upon British merchants who could buy up half a hundred of 'em. Now he mourned that his own education had been neglected, and pointed out, in pompous speeches to Georgy, the necessity of classical learning.\nWhen they met at dinner the grandsire would ask the lad what he had been reading, and was greatly interested in the boy's studies, pretending to understand what little George said about them. He made a hundred blunders and often showed his ignorance. It did not increase the child's respect for him. The boy soon realised that his grandfather was a dullard, and began to look down upon him; for his previous education, humble as it had been, had made a much better gentleman of Georgy than any plans of his grandfather. He had been brought up by a kind, weak, tender woman, who had no pride about anything but him, a true lady with a pure heart and humble bearing. If she never said brilliant things, she never spoke or thought unkind ones.\nYoung Georgy lorded over her soft and yielding nature; the coarse pomposity of the dull old man made him lord over the latter too. If he had been a Prince Royal he could not have thought better of himself.\nWhilst his mother was yearning for him at home, this young gentleman had pleasures which made him bear the separation from her very easily. He was given a handsome pony, and was taught to ride, first at a riding-school, and then in Regent's Park and Hyde Park, where he rode in state with Martin the coachman behind him.\nOld Osborne, leaving his City affairs to his junior partners, would often ride out with Miss Osborne in the same fashionable direction. As little Georgy came cantering up with his dandified air, his grandfather would nudge his daughter and say, \"Look, Miss O.\" Here too his aunt, Mrs. Frederick Bullock - whose carriage appeared daily, with three pasty-faced little Bullocks staring from the windows - Mrs. Frederick Bullock flung glances of hatred at the little upstart as he rode by, as proud as a lord.\nThough he was scarcely eleven, Master George wore the most beautiful little boots like a man's. He had gilt spurs, and a gold-headed whip, and neat little kid gloves. His mother had carefully made shirts and neckcloths for him; but when he came to see her, they were replaced by much finer linen, with jewelled buttons. Her humble presents had been put aside - Miss Osborne had given them to the coachman's boy. Amelia tried to think she was pleased. Indeed, she was happy and charmed to see the boy looking so beautiful.\nShe had a little profile of him done for a shilling, and this was hung up beside her husband's portrait over her bed. One day the boy came on his visit, galloping down the street at Brompton; with great eagerness and triumph, he held out a leather case.\n\"I bought it with my own money, Mamma,\" he said. \"I thought you'd like it.\"\nAmelia opened the case, and giving a cry of delight, seized the boy and embraced him. It was a miniature of himself, very prettily done. His grandfather had wished to have a picture of him painted by an artist; and George, who had plenty of money, asked the painter how much a copy of the little portrait would cost, saying that he wanted to give it to his mother.\nThis proof of the boy's affection charmed her; she thought no child in the world was so good as hers. For weeks after, the thought of his love made her happy. She slept better with the picture under her pillow, and how many times did she kiss it and pray over it! Since her parting with George she had had no such joy and consolation.\nAt his new home Master George ruled like a lord; at dinner he coolly invited the ladies to drink wine, and took champagne in a way which charmed his grandfather.\nThe lad's antics did not, however, delight Mr. Osborne's friends. It gave Mr. Justice Coffin no pleasure to hear Georgy cut into the conversation and spoil his stories. Colonel Fogey was not interested in seeing the little boy half tipsy. Mrs. Toffy felt no gratitude when he tilted a glass of port-wine over her yellow satin dress and laughed at the disaster; nor was she pleased, although old Osborne was highly delighted, when Georgy \"whopped\" her third boy. George's grandfather gave the boy two sovereigns for that feat and promised to reward him for every boy above his own size whom he whopped in a similar manner. It is difficult to say what the old man saw in these combats; he had a vague notion that quarrelling made boys hardy, and that tyranny was a useful accomplishment. English youth have long been so taught.\nFlushed with victory over Master Toffy, George wished to pursue his conquests further. One day as he was strutting about in dandified new clothes, a young baker's boy made sarcastic comments. George pulled off his jacket with great spirit, and giving it to his friend Master Todd, tried to whop the little baker. But this time, the little baker whopped Georgy, who came home with a rueful black eye and all his fine shirt frill dabbled with blood from his own nose. He told his grandfather that he had fought a giant, and frightened his poor mother with long, and by no means authentic, accounts of the battle.\nThis young Todd, the son of a junior partner in Osborne's firm, was Master George's great friend and admirer. They both had a taste for raspberry tarts; for sliding and skating on the Serpentine, when the weather permitted; and for going to the play, where they were often taken at Mr Osborne's orders, by Rowson, Master George's servant.\nIn Rowson's company they visited all the main theatres; knew the names of all the actors; and performed many of the plays to the Todd family and their youthful friends. Rowson, who was a generous man, would sometimes treat his young master to oysters after the play, and to a glass of rum-shrub. We may be pretty certain that Mr. Rowson profited in his turn from his young master's liberality.\nA famous West End tailor was summoned to clothe little George, and was told to spare no expense. So Georgy had white waistcoats for evening parties, and little velvet waistcoats for dinners, and dressed for dinner every day, \"like a regular West End swell,\" as his grandfather remarked. One of the servants helped him dress, answered his bell, and brought him his letters on a silver tray.\nGeorgy made the house lively by his activity, his imperiousness, his scolding, and his good-nature. He was educated by a neighbouring scholar who \"prepared young noblemen for the Universities, the senate, and the learned professions: in whose family the pupils would find the elegances of refined society and the affection of a home.\" It was in this way that the Reverend Lawrence Veal and his wife strove to entice pupils.\nThis Chaplain and his lady had a few scholars, who paid a high figure for comfortable quarters. There was a large West Indian, whom nobody came to see, with a woolly head and a dandyfied appearance; there was a hulking boy of three-and-twenty whose education had been previously neglected; there were two sons of Colonel Bangles of the East India Company. These four sat down to dinner at Mrs. Veal's genteel board, when Georgy was introduced to her house. Like some dozen other pupils, he was only a day boy, escorted to school by Mr. Rowson.\nHis grandfather's wealth was reported in the school to be prodigious. The Rev. Mr. Veal used to compliment Georgy upon it personally, warning him that he was destined for a high station, and should prepare for the lofty duties to which he would be called. He therefore begged that George would not bring toffee into the school and ruin the health of the Masters Bangles.\nThe young gentlemen could learn every known science. The Rev. Mr. Veal had an orrery, an electrifying machine, a turning lathe, a theatre (in the wash-house), a chemical apparatus, and a select library of the works of the best authors. He took the boys to the British Museum and discussed the specimens there, gathering an audience; and he always took care when speaking to use the very finest and longest words possible.\nThus he would say to George in school, \"I observed on my return home from taking the indulgence of an evening's scientific conversation with my excellent friend Doctor Bulders that the windows of your venerated grandfather's princely mansion in Russell Square were illuminated as if for the purposes of festivity. Am I right in my conjecture that Mr. Osborne entertained a society of chosen spirits round his sumptuous board last night?\"\nLittle Georgy, who used to mimic Mr. Veal to his face with great dexterity, would reply that Mr. V. was quite correct in his surmise.\nTo this great man George's education was entrusted. Amelia was bewildered by his phrases, but thought him a prodigy of learning. She made friends of Mrs. Veal, and liked to be asked to Mrs. Veal's conversazioni, which took place once a month, when the professor welcomed his pupils and their friends to weak tea and scientific conversation. Poor little Amelia never missed one of these entertainments and thought them delicious so long as she had Georgy sitting by her. And she would embrace Mrs. Veal with tearful gratitude for the delightful evening, before putting on her cloak and walking home.\nAs for Georgy's learning, to judge from the weekly reports he took home to his grandfather, his progress was remarkable. In Greek Georgy was pronounced aristos, in Latin optimus, in French tres bien, and so forth; and everybody had prizes for everything at the end of the year. Even the woolly-headed Mr. Swartz, half-brother to the Honourable Mrs. MacMull, and Mr. Bluck, the neglected pupil of three-and-twenty, and the young scape-grace Mr. Todd, received little eighteen-penny books with a Latin inscription from the professor.\nThus it seemed to be decreed that Georgy was to domineer over everybody, and that all must bow the knee before the little fellow. He was quite willing. Georgy liked to play the part of master and perhaps had a natural aptitude for it.\nIn Russell Square everybody was afraid of Mr. Osborne, and Mr. Osborne was afraid of Georgy. The boy's dashing manners, his offhand rattle about books and learning, and his likeness to his dead father awed the old gentleman. The old man tried by indulgence to make up for his harshness to the elder George. People were surprised at his gentleness to the boy. He growled and swore at Miss Osborne, yet would smile when George came down late for breakfast.\nMiss Osborne was now a faded old spinster, broken down by forty years of dullness and coarse usage. It was easy for Georgy to master her. Whenever he wanted anything, from the jam-pots in her cupboards to the cracked old colours in her paint-box, Georgy took possession of it, and then took no further notice of his aunt.\nThe other old grandfather, Mr. Sedley, was likewise subject to the little tyrant. He could not help respecting a lad who had such fine clothes and rode with a groom. Georgy, on his side, was used to hearing coarse abuse levelled at John Sedley by his pitiless enemy, Mr. Osborne, who called him the old coal-man, the old bankrupt, and many other such names. How could George respect him? When Mrs. Sedley died, the child did not show much grief. He came down to visit his mother in a fine new suit of mourning, and was very angry that he could not go to a play.\nThe illness of that old lady had been the occupation and perhaps the safeguard of Amelia. What do men know about women's martyrdoms? We should go mad if we had to endure the hundredth part of those daily pains which are meekly borne by many women.\nAmelia's mother had taken to her bed, which she had never left, and from which Amelia was never absent except when she ran to see George. The old lady grudged her even those rare visits. She had been a kind, smiling mother once, but poverty and illness had broken her down. Amelia bore her mother's harshness gently; smoothed the uneasy pillow; was always ready with a soft answer to the querulous voice, and finally closed the eyes that had once looked so tenderly upon her.\nThen all her time and tenderness were devoted to comforting the bereaved old father, who was stunned by this blow. Everything he loved best had fallen away from him. There was only Amelia to stand by and support him with her gentle arms. We are not going to write the history: it would be too dreary and stupid. I can see Vanity Fair yawning over it already.\nOne day as the pupils were assembled in the study at the Rev. Mr. Veal's, a smart carriage drove up to the door, and two gentlemen stepped out. The young Masters Bangles rushed to the window with a vague notion that their father might have arrived from Bombay. The hulking scholar of three-and-twenty flattened his neglected nose against the panes and looked out at the men.\n\"It's a fat one and a thin one,\" he said, as a knock thundered on the door.\nThe servant-boy came into the study and said, \"Two gentlemen want to see Master Osborne.\" The professor had had a trifling disagreement that morning with George, owing to a difference about the introduction of crackers in school-time; but he said with bland courtesy, \"Master Osborne, I give you permission to go and see your friends - to whom I beg you to convey my respectful compliments.\"\nGeorgy went into the reception-room and saw two strangers, whom he looked at in his usual haughty manner. One was fat, with mustachios, and the other was lean and long, in a blue frock-coat, with a brown face and a grizzled head.\n\"My God, how like he is!\" said the long gentleman with a start. \"Can you guess who we are, George?\"\nThe boy's face flushed, and his eyes brightened. \"I don't know the other,\" he said, \"but I think you must be Major Dobbin.\"\nIndeed it was our old friend. His voice trembled with pleasure as he greeted the boy, and taking his hands, drew the lad to him.\n\"Your mother has talked to you about me - has she?\" he said.\n\"That she has,\" Georgy answered, \"hundreds and hundreds of times.\"",
        "paragraph_chars": [
            [
                0,
                286
            ],
            [
                286,
                781
            ],
            [
                781,
                1121
            ],
            [
                1121,
                1862
            ],
            [
                1862,
                2068
            ],
            [
                2068,
                2389
            ],
            [
                2389,
                2895
            ],
            [
                2895,
                3417
            ],
            [
                3417,
                3671
            ],
            [
                3671,
                3747
            ],
            [
                3747,
                4112
            ],
            [
                4112,
                4447
            ],
            [
                4447,
                4609
            ],
            [
                4609,
                5435
            ],
            [
                5435,
                6046
            ],
            [
                6046,
                6385
            ],
            [
                6385,
                6779
            ],
            [
                6779,
                7169
            ],
            [
                7169,
                7593
            ],
            [
                7593,
                8137
            ],
            [
                8137,
                8508
            ],
            [
                8508,
                8930
            ],
            [
                8930,
                9368
            ],
            [
                9368,
                9502
            ],
            [
                9502,
                10101
            ],
            [
                10101,
                10633
            ],
            [
                10633,
                10868
            ],
            [
                10868,
                11323
            ],
            [
                11323,
                11645
            ],
            [
                11645,
                12207
            ],
            [
                12207,
                12455
            ],
            [
                12455,
                12931
            ],
            [
                12931,
                13290
            ],
            [
                13290,
                13665
            ],
            [
                13665,
                13741
            ],
            [
                13741,
                14133
            ],
            [
                14133,
                14363
            ],
            [
                14363,
                14463
            ],
            [
                14463,
                14587
            ],
            [
                14587,
                14716
            ],
            [
                14716,
                14777
            ],
            [
                14777,
                14843
            ]
        ],
        "segment_chars": [
            [
                0,
                143
            ],
            [
                143,
                213
            ],
            [
                213,
                286
            ],
            [
                286,
                340
            ],
            [
                340,
                441
            ],
            [
                441,
                614
            ],
            [
                614,
                720
            ],
            [
                720,
                781
            ],
            [
                781,
                978
            ],
            [
                978,
                1121
            ],
            [
                1121,
                1313
            ],
            [
                1313,
                1372
            ],
            [
                1372,
                1421
            ],
            [
                1421,
                1641
            ],
            [
                1641,
                1786
            ],
            [
                1786,
                1862
            ],
            [
                1862,
                1993
            ],
            [
                1993,
                2068
            ],
            [
                2068,
                2208
            ],
            [
                2208,
                2389
            ],
            [
                2389,
                2525
            ],
            [
                2525,
                2650
            ],
            [
                2650,
                2895
            ],
            [
                2895,
                2991
            ],
            [
                2991,
                3062
            ],
            [
                3062,
                3215
            ],
            [
                3215,
                3307
            ],
            [
                3307,
                3346
            ],
            [
                3346,
                3417
            ],
            [
                3417,
                3535
            ],
            [
                3535,
                3671
            ],
            [
                3671,
                3720
            ],
            [
                3720,
                3747
            ],
            [
                3747,
                3833
            ],
            [
                3833,
                3884
            ],
            [
                3884,
                4112
            ],
            [
                4112,
                4214
            ],
            [
                4214,
                4271
            ],
            [
                4271,
                4376
            ],
            [
                4376,
                4447
            ],
            [
                4447,
                4609
            ],
            [
                4609,
                4675
            ],
            [
                4675,
                4778
            ],
            [
                4778,
                4848
            ],
            [
                4848,
                5071
            ],
            [
                5071,
                5231
            ],
            [
                5231,
                5395
            ],
            [
                5395,
                5435
            ],
            [
                5435,
                5522
            ],
            [
                5522,
                5627
            ],
            [
                5627,
                5748
            ],
            [
                5748,
                5901
            ],
            [
                5901,
                6046
            ],
            [
                6046,
                6156
            ],
            [
                6156,
                6385
            ],
            [
                6385,
                6554
            ],
            [
                6554,
                6681
            ],
            [
                6681,
                6779
            ],
            [
                6779,
                6876
            ],
            [
                6876,
                7066
            ],
            [
                7066,
                7169
            ],
            [
                7169,
                7269
            ],
            [
                7269,
                7504
            ],
            [
                7504,
                7593
            ],
            [
                7593,
                7689
            ],
            [
                7689,
                7949
            ],
            [
                7949,
                8050
            ],
            [
                8050,
                8137
            ],
            [
                8137,
                8207
            ],
            [
                8207,
                8393
            ],
            [
                8393,
                8508
            ],
            [
                8508,
                8561
            ],
            [
                8561,
                8744
            ],
            [
                8744,
                8930
            ],
            [
                8930,
                9244
            ],
            [
                9244,
                9368
            ],
            [
                9368,
                9502
            ],
            [
                9502,
                9554
            ],
            [
                9554,
                9631
            ],
            [
                9631,
                9843
            ],
            [
                9843,
                9972
            ],
            [
                9972,
                10101
            ],
            [
                10101,
                10222
            ],
            [
                10222,
                10379
            ],
            [
                10379,
                10633
            ],
            [
                10633,
                10763
            ],
            [
                10763,
                10785
            ],
            [
                10785,
                10868
            ],
            [
                10868,
                10961
            ],
            [
                10961,
                11093
            ],
            [
                11093,
                11175
            ],
            [
                11175,
                11227
            ],
            [
                11227,
                11323
            ],
            [
                11323,
                11423
            ],
            [
                11423,
                11461
            ],
            [
                11461,
                11645
            ],
            [
                11645,
                11727
            ],
            [
                11727,
                11811
            ],
            [
                11811,
                12003
            ],
            [
                12003,
                12033
            ],
            [
                12033,
                12091
            ],
            [
                12091,
                12207
            ],
            [
                12207,
                12297
            ],
            [
                12297,
                12340
            ],
            [
                12340,
                12455
            ],
            [
                12455,
                12593
            ],
            [
                12593,
                12642
            ],
            [
                12642,
                12729
            ],
            [
                12729,
                12931
            ],
            [
                12931,
                13046
            ],
            [
                13046,
                13097
            ],
            [
                13097,
                13169
            ],
            [
                13169,
                13243
            ],
            [
                13243,
                13290
            ],
            [
                13290,
                13434
            ],
            [
                13434,
                13551
            ],
            [
                13551,
                13665
            ],
            [
                13665,
                13741
            ],
            [
                13741,
                13831
            ],
            [
                13831,
                14133
            ],
            [
                14133,
                14239
            ],
            [
                14239,
                14363
            ],
            [
                14363,
                14389
            ],
            [
                14389,
                14427
            ],
            [
                14427,
                14463
            ],
            [
                14463,
                14512
            ],
            [
                14512,
                14587
            ],
            [
                14587,
                14617
            ],
            [
                14617,
                14716
            ],
            [
                14716,
                14768
            ],
            [
                14768,
                14777
            ],
            [
                14777,
                14843
            ]
        ],
        "overlap_chars": [
            [
                0,
                22
            ],
            [
                23,
                82
            ],
            [
                93,
                110
            ],
            [
                111,
                119
            ],
            [
                120,
                126
            ],
            [
                131,
                141
            ],
            [
                141,
                143
            ],
            [
                143,
                150
            ],
            [
                153,
                163
            ],
            [
                164,
                167
            ],
            [
                168,
                183
            ],
            [
                184,
                187
            ],
            [
                203,
                211
            ],
            [
                211,
                213
            ],
            [
                213,
                286
            ],
            [
                286,
                318
            ],
            [
                319,
                323
            ],
            [
                324,
                334
            ],
            [
                335,
                338
            ],
            [
                338,
                340
            ],
            [
                340,
                349
            ],
            [
                359,
                372
            ],
            [
                378,
                441
            ],
            [
                441,
                464
            ],
            [
                465,
                467
            ],
            [
                473,
                514
            ],
            [
                516,
                519
            ],
            [
                520,
                528
            ],
            [
                535,
                537
            ],
            [
                538,
                541
            ],
            [
                542,
                546
            ],
            [
                547,
                557
            ],
            [
                557,
                558
            ],
            [
                563,
                580
            ],
            [
                582,
                614
            ],
            [
                614,
                659
            ],
            [
                660,
                662
            ],
            [
                669,
                720
            ],
            [
                720,
                779
            ],
            [
                779,
                780
            ],
            [
                781,
                811
            ],
            [
                820,
                826
            ],
            [
                829,
                833
            ],
            [
                834,
                865
            ],
            [
                866,
                870
            ],
            [
                871,
                879
            ],
            [
                880,
                902
            ],
            [
                910,
                937
            ],
            [
                938,
                978
            ],
            [
                978,
                981
            ],
            [
                982,
                984
            ],
            [
                985,
                990
            ],
            [
                993,
                1039
            ],
            [
                1048,
                1063
            ],
            [
                1073,
                1097
            ],
            [
                1098,
                1110
            ],
            [
                1119,
                1121
            ],
            [
                1121,
                1158
            ],
            [
                1165,
                1201
            ],
            [
                1201,
                1229
            ],
            [
                1233,
                1240
            ],
            [
                1243,
                1276
            ],
            [
                1282,
                1295
            ],
            [
                1307,
                1313
            ],
            [
                1313,
                1343
            ],
            [
                1350,
                1370
            ],
            [
                1370,
                1372
            ],
            [
                1372,
                1395
            ],
            [
                1396,
                1401
            ],
            [
                1404,
                1411
            ],
            [
                1412,
                1415
            ],
            [
                1419,
                1421
            ],
            [
                1421,
                1428
            ],
            [
                1429,
                1433
            ],
            [
                1443,
                1451
            ],
            [
                1464,
                1482
            ],
            [
                1483,
                1488
            ],
            [
                1489,
                1546
            ],
            [
                1547,
                1639
            ],
            [
                1639,
                1641
            ],
            [
                1641,
                1680
            ],
            [
                1681,
                1730
            ],
            [
                1731,
                1735
            ],
            [
                1736,
                1747
            ],
            [
                1755,
                1759
            ],
            [
                1760,
                1765
            ],
            [
                1766,
                1776
            ],
            [
                1777,
                1784
            ],
            [
                1784,
                1786
            ],
            [
                1786,
                1860
            ],
            [
                1862,
                1886
            ],
            [
                1891,
                1916
            ],
            [
                1917,
                1957
            ],
            [
                1958,
                1993
            ],
            [
                1993,
                2040
            ],
            [
                2049,
                2055
            ],
            [
                2056,
                2068
            ],
            [
                2068,
                2098
            ],
            [
                2099,
                2102
            ],
            [
                2103,
                2114
            ],
            [
                2114,
                2140
            ],
            [
                2141,
                2150
            ],
            [
                2151,
                2165
            ],
            [
                2166,
                2190
            ],
            [
                2195,
                2208
            ],
            [
                2208,
                2214
            ],
            [
                2232,
                2236
            ],
            [
                2236,
                2241
            ],
            [
                2242,
                2287
            ],
            [
                2288,
                2296
            ],
            [
                2300,
                2313
            ],
            [
                2314,
                2317
            ],
            [
                2318,
                2388
            ],
            [
                2389,
                2401
            ],
            [
                2410,
                2413
            ],
            [
                2414,
                2418
            ],
            [
                2419,
                2481
            ],
            [
                2490,
                2525
            ],
            [
                2525,
                2582
            ],
            [
                2582,
                2611
            ],
            [
                2612,
                2615
            ],
            [
                2625,
                2650
            ],
            [
                2650,
                2691
            ],
            [
                2694,
                2699
            ],
            [
                2718,
                2723
            ],
            [
                2723,
                2729
            ],
            [
                2730,
                2763
            ],
            [
                2764,
                2788
            ],
            [
                2791,
                2813
            ],
            [
                2814,
                2830
            ],
            [
                2831,
                2873
            ],
            [
                2873,
                2895
            ],
            [
                2895,
                2924
            ],
            [
                2924,
                2944
            ],
            [
                2945,
                2987
            ],
            [
                2989,
                2991
            ],
            [
                2991,
                3037
            ],
            [
                3038,
                3042
            ],
            [
                3043,
                3060
            ],
            [
                3060,
                3062
            ],
            [
                3062,
                3076
            ],
            [
                3077,
                3086
            ],
            [
                3087,
                3091
            ],
            [
                3092,
                3098
            ],
            [
                3099,
                3102
            ],
            [
                3103,
                3113
            ],
            [
                3114,
                3131
            ],
            [
                3132,
                3134
            ],
            [
                3135,
                3146
            ],
            [
                3147,
                3150
            ],
            [
                3150,
                3190
            ],
            [
                3190,
                3191
            ],
            [
                3197,
                3213
            ],
            [
                3213,
                3215
            ],
            [
                3215,
                3253
            ],
            [
                3256,
                3307
            ],
            [
                3307,
                3344
            ],
            [
                3344,
                3346
            ],
            [
                3346,
                3417
            ],
            [
                3417,
                3420
            ],
            [
                3421,
                3433
            ],
            [
                3434,
                3490
            ],
            [
                3512,
                3535
            ],
            [
                3535,
                3562
            ],
            [
                3563,
                3588
            ],
            [
                3589,
                3607
            ],
            [
                3609,
                3633
            ],
            [
                3634,
                3641
            ],
            [
                3641,
                3645
            ],
            [
                3651,
                3656
            ],
            [
                3665,
                3669
            ],
            [
                3669,
                3671
            ],
            [
                3671,
                3720
            ],
            [
                3720,
                3747
            ],
            [
                3747,
                3783
            ],
            [
                3784,
                3790
            ],
            [
                3798,
                3831
            ],
            [
                3831,
                3833
            ],
            [
                3833,
                3882
            ],
            [
                3884,
                3935
            ],
            [
                3944,
                3956
            ],
            [
                3956,
                3994
            ],
            [
                4001,
                4078
            ],
            [
                4079,
                4111
            ],
            [
                4117,
                4157
            ],
            [
                4159,
                4196
            ],
            [
                4197,
                4199
            ],
            [
                4208,
                4212
            ],
            [
                4212,
                4214
            ],
            [
                4214,
                4217
            ],
            [
                4218,
                4271
            ],
            [
                4271,
                4335
            ],
            [
                4336,
                4361
            ],
            [
                4362,
                4376
            ],
            [
                4376,
                4447
            ],
            [
                4447,
                4508
            ],
            [
                4516,
                4548
            ],
            [
                4548,
                4558
            ],
            [
                4559,
                4595
            ],
            [
                4596,
                4608
            ],
            [
                4609,
                4616
            ],
            [
                4619,
                4625
            ],
            [
                4626,
                4673
            ],
            [
                4673,
                4675
            ],
            [
                4675,
                4778
            ],
            [
                4778,
                4848
            ],
            [
                4851,
                4852
            ],
            [
                4853,
                4858
            ],
            [
                4859,
                4866
            ],
            [
                4867,
                4876
            ],
            [
                4877,
                4881
            ],
            [
                4882,
                4934
            ],
            [
                4941,
                4981
            ],
            [
                4982,
                5069
            ],
            [
                5069,
                5071
            ],
            [
                5071,
                5104
            ],
            [
                5109,
                5160
            ],
            [
                5161,
                5193
            ],
            [
                5194,
                5231
            ],
            [
                5231,
                5258
            ],
            [
                5259,
                5393
            ],
            [
                5393,
                5395
            ],
            [
                5395,
                5413
            ],
            [
                5419,
                5426
            ],
            [
                5433,
                5434
            ],
            [
                5435,
                5447
            ],
            [
                5448,
                5488
            ],
            [
                5489,
                5520
            ],
            [
                5520,
                5521
            ],
            [
                5522,
                5558
            ],
            [
                5559,
                5581
            ],
            [
                5582,
                5625
            ],
            [
                5627,
                5633
            ],
            [
                5634,
                5648
            ],
            [
                5649,
                5688
            ],
            [
                5689,
                5691
            ],
            [
                5692,
                5695
            ],
            [
                5696,
                5702
            ],
            [
                5703,
                5715
            ],
            [
                5716,
                5748
            ],
            [
                5748,
                5751
            ],
            [
                5752,
                5762
            ],
            [
                5763,
                5875
            ],
            [
                5882,
                5894
            ],
            [
                5895,
                5901
            ],
            [
                5901,
                5936
            ],
            [
                5944,
                5983
            ],
            [
                5984,
                6046
            ],
            [
                6046,
                6062
            ],
            [
                6071,
                6073
            ],
            [
                6108,
                6156
            ],
            [
                6156,
                6181
            ],
            [
                6182,
                6222
            ],
            [
                6226,
                6269
            ],
            [
                6270,
                6273
            ],
            [
                6274,
                6296
            ],
            [
                6303,
                6318
            ],
            [
                6328,
                6330
            ],
            [
                6331,
                6375
            ],
            [
                6383,
                6385
            ],
            [
                6385,
                6387
            ],
            [
                6394,
                6396
            ],
            [
                6397,
                6404
            ],
            [
                6405,
                6425
            ],
            [
                6431,
                6439
            ],
            [
                6439,
                6473
            ],
            [
                6473,
                6488
            ],
            [
                6489,
                6552
            ],
            [
                6552,
                6554
            ],
            [
                6554,
                6561
            ],
            [
                6562,
                6569
            ],
            [
                6570,
                6580
            ],
            [
                6581,
                6585
            ],
            [
                6586,
                6591
            ],
            [
                6602,
                6679
            ],
            [
                6679,
                6681
            ],
            [
                6681,
                6742
            ],
            [
                6748,
                6777
            ],
            [
                6777,
                6779
            ],
            [
                6779,
                6787
            ],
            [
                6788,
                6796
            ],
            [
                6797,
                6803
            ],
            [
                6804,
                6819
            ],
            [
                6824,
                6826
            ],
            [
                6827,
                6840
            ],
            [
                6840,
                6874
            ],
            [
                6874,
                6876
            ],
            [
                6879,
                6889
            ],
            [
                6890,
                6938
            ],
            [
                6939,
                6973
            ],
            [
                6974,
                7064
            ],
            [
                7064,
                7065
            ],
            [
                7066,
                7076
            ],
            [
                7093,
                7096
            ],
            [
                7102,
                7150
            ],
            [
                7151,
                7169
            ],
            [
                7176,
                7268
            ],
            [
                7272,
                7275
            ],
            [
                7288,
                7310
            ],
            [
                7311,
                7339
            ],
            [
                7340,
                7402
            ],
            [
                7403,
                7481
            ],
            [
                7482,
                7504
            ],
            [
                7504,
                7554
            ],
            [
                7555,
                7558
            ],
            [
                7559,
                7567
            ],
            [
                7568,
                7574
            ],
            [
                7575,
                7593
            ],
            [
                7598,
                7619
            ],
            [
                7630,
                7638
            ],
            [
                7638,
                7639
            ],
            [
                7640,
                7662
            ],
            [
                7667,
                7689
            ],
            [
                7689,
                7751
            ],
            [
                7752,
                7763
            ],
            [
                7764,
                7767
            ],
            [
                7768,
                7769
            ],
            [
                7770,
                7801
            ],
            [
                7804,
                7860
            ],
            [
                7872,
                7881
            ],
            [
                7881,
                7947
            ],
            [
                7947,
                7948
            ],
            [
                7949,
                8042
            ],
            [
                8048,
                8049
            ],
            [
                8050,
                8079
            ],
            [
                8080,
                8082
            ],
            [
                8083,
                8086
            ],
            [
                8087,
                8101
            ],
            [
                8101,
                8102
            ],
            [
                8122,
                8124
            ],
            [
                8125,
                8135
            ],
            [
                8135,
                8136
            ],
            [
                8137,
                8152
            ],
            [
                8155,
                8161
            ],
            [
                8162,
                8207
            ],
            [
                8207,
                8322
            ],
            [
                8322,
                8323
            ],
            [
                8324,
                8327
            ],
            [
                8335,
                8342
            ],
            [
                8343,
                8391
            ],
            [
                8391,
                8392
            ],
            [
                8393,
                8412
            ],
            [
                8413,
                8417
            ],
            [
                8418,
                8506
            ],
            [
                8506,
                8508
            ],
            [
                8508,
                8527
            ],
            [
                8534,
                8539
            ],
            [
                8540,
                8561
            ],
            [
                8561,
                8692
            ],
            [
                8693,
                8712
            ],
            [
                8713,
                8742
            ],
            [
                8742,
                8744
            ],
            [
                8744,
                8786
            ],
            [
                8797,
                8810
            ],
            [
                8811,
                8817
            ],
            [
                8841,
                8844
            ],
            [
                8845,
                8847
            ],
            [
                8848,
                8854
            ],
            [
                8855,
                8864
            ],
            [
                8879,
                8885
            ],
            [
                8886,
                8919
            ],
            [
                8928,
                8930
            ],
            [
                8930,
                9105
            ],
            [
                9106,
                9154
            ],
            [
                9155,
                9244
            ],
            [
                9244,
                9368
            ],
            [
                9368,
                9386
            ],
            [
                9387,
                9432
            ],
            [
                9433,
                9502
            ],
            [
                9502,
                9542
            ],
            [
                9543,
                9554
            ],
            [
                9554,
                9631
            ],
            [
                9631,
                9634
            ],
            [
                9635,
                9661
            ],
            [
                9662,
                9665
            ],
            [
                9666,
                9743
            ],
            [
                9743,
                9744
            ],
            [
                9750,
                9843
            ],
            [
                9843,
                9944
            ],
            [
                9949,
                9972
            ],
            [
                9972,
                9985
            ],
            [
                9986,
                10053
            ],
            [
                10053,
                10054
            ],
            [
                10070,
                10076
            ],
            [
                10083,
                10086
            ],
            [
                10087,
                10101
            ],
            [
                10101,
                10107
            ],
            [
                10108,
                10114
            ],
            [
                10117,
                10125
            ],
            [
                10125,
                10159
            ],
            [
                10163,
                10222
            ],
            [
                10222,
                10379
            ],
            [
                10379,
                10383
            ],
            [
                10384,
                10387
            ],
            [
                10394,
                10401
            ],
            [
                10402,
                10413
            ],
            [
                10414,
                10453
            ],
            [
                10457,
                10487
            ],
            [
                10488,
                10513
            ],
            [
                10513,
                10518
            ],
            [
                10519,
                10522
            ],
            [
                10523,
                10534
            ],
            [
                10535,
                10540
            ],
            [
                10545,
                10549
            ],
            [
                10549,
                10587
            ],
            [
                10588,
                10592
            ],
            [
                10593,
                10594
            ],
            [
                10595,
                10631
            ],
            [
                10631,
                10633
            ],
            [
                10633,
                10661
            ],
            [
                10662,
                10704
            ],
            [
                10704,
                10714
            ],
            [
                10715,
                10718
            ],
            [
                10724,
                10763
            ],
            [
                10763,
                10765
            ],
            [
                10783,
                10785
            ],
            [
                10785,
                10868
            ],
            [
                10868,
                10961
            ],
            [
                10961,
                10987
            ],
            [
                10992,
                11032
            ],
            [
                11033,
                11036
            ],
            [
                11037,
                11056
            ],
            [
                11057,
                11061
            ],
            [
                11062,
                11068
            ],
            [
                11069,
                11091
            ],
            [
                11091,
                11093
            ],
            [
                11093,
                11104
            ],
            [
                11105,
                11127
            ],
            [
                11128,
                11139
            ],
            [
                11144,
                11175
            ],
            [
                11175,
                11227
            ],
            [
                11227,
                11263
            ],
            [
                11263,
                11264
            ],
            [
                11269,
                11323
            ],
            [
                11323,
                11335
            ],
            [
                11336,
                11339
            ],
            [
                11344,
                11380
            ],
            [
                11381,
                11395
            ],
            [
                11400,
                11423
            ],
            [
                11423,
                11438
            ],
            [
                11446,
                11461
            ],
            [
                11470,
                11472
            ],
            [
                11473,
                11488
            ],
            [
                11488,
                11539
            ],
            [
                11540,
                11568
            ],
            [
                11568,
                11569
            ],
            [
                11570,
                11595
            ],
            [
                11598,
                11599
            ],
            [
                11600,
                11603
            ],
            [
                11609,
                11645
            ],
            [
                11645,
                11648
            ],
            [
                11655,
                11658
            ],
            [
                11659,
                11670
            ],
            [
                11670,
                11671
            ],
            [
                11682,
                11683
            ],
            [
                11684,
                11727
            ],
            [
                11727,
                11809
            ],
            [
                11809,
                11811
            ],
            [
                11811,
                11835
            ],
            [
                11836,
                11843
            ],
            [
                11844,
                11864
            ],
            [
                11865,
                11904
            ],
            [
                11905,
                11923
            ],
            [
                11923,
                11924
            ],
            [
                11940,
                11979
            ],
            [
                11980,
                12001
            ],
            [
                12001,
                12003
            ],
            [
                12003,
                12006
            ],
            [
                12013,
                12019
            ],
            [
                12020,
                12027
            ],
            [
                12031,
                12033
            ],
            [
                12038,
                12054
            ],
            [
                12054,
                12055
            ],
            [
                12056,
                12065
            ],
            [
                12066,
                12073
            ],
            [
                12074,
                12091
            ],
            [
                12091,
                12205
            ],
            [
                12205,
                12207
            ],
            [
                12207,
                12297
            ],
            [
                12297,
                12340
            ],
            [
                12340,
                12356
            ],
            [
                12360,
                12362
            ],
            [
                12363,
                12366
            ],
            [
                12367,
                12454
            ],
            [
                12461,
                12533
            ],
            [
                12534,
                12540
            ],
            [
                12541,
                12593
            ],
            [
                12593,
                12640
            ],
            [
                12642,
                12645
            ],
            [
                12646,
                12670
            ],
            [
                12671,
                12683
            ],
            [
                12684,
                12687
            ],
            [
                12688,
                12699
            ],
            [
                12708,
                12718
            ],
            [
                12719,
                12722
            ],
            [
                12723,
                12729
            ],
            [
                12729,
                12744
            ],
            [
                12754,
                12763
            ],
            [
                12764,
                12842
            ],
            [
                12843,
                12858
            ],
            [
                12858,
                12863
            ],
            [
                12872,
                12931
            ],
            [
                12931,
                12979
            ],
            [
                12991,
                13034
            ],
            [
                13040,
                13044
            ],
            [
                13044,
                13046
            ],
            [
                13046,
                13097
            ],
            [
                13097,
                13142
            ],
            [
                13147,
                13167
            ],
            [
                13167,
                13169
            ],
            [
                13169,
                13243
            ],
            [
                13243,
                13280
            ],
            [
                13288,
                13290
            ],
            [
                13290,
                13304
            ],
            [
                13312,
                13363
            ],
            [
                13364,
                13401
            ],
            [
                13401,
                13434
            ],
            [
                13434,
                13551
            ],
            [
                13551,
                13554
            ],
            [
                13555,
                13590
            ],
            [
                13591,
                13648
            ],
            [
                13649,
                13652
            ],
            [
                13653,
                13659
            ],
            [
                13663,
                13665
            ],
            [
                13665,
                13697
            ],
            [
                13701,
                13705
            ],
            [
                13707,
                13711
            ],
            [
                13712,
                13717
            ],
            [
                13731,
                13741
            ],
            [
                13741,
                13744
            ],
            [
                13753,
                13756
            ],
            [
                13757,
                13831
            ],
            [
                13831,
                13863
            ],
            [
                13877,
                13881
            ],
            [
                13882,
                13894
            ],
            [
                13901,
                13979
            ],
            [
                13980,
                13987
            ],
            [
                13993,
                14007
            ],
            [
                14007,
                14036
            ],
            [
                14037,
                14066
            ],
            [
                14067,
                14074
            ],
            [
                14077,
                14104
            ],
            [
                14108,
                14130
            ],
            [
                14130,
                14133
            ],
            [
                14133,
                14209
            ],
            [
                14210,
                14239
            ],
            [
                14239,
                14363
            ],
            [
                14363,
                14389
            ],
            [
                14389,
                14427
            ],
            [
                14427,
                14463
            ],
            [
                14463,
                14485
            ],
            [
                14485,
                14512
            ],
            [
                14512,
                14553
            ],
            [
                14554,
                14587
            ],
            [
                14587,
                14617
            ],
            [
                14617,
                14683
            ],
            [
                14684,
                14687
            ],
            [
                14688,
                14693
            ],
            [
                14693,
                14716
            ],
            [
                14716,
                14755
            ],
            [
                14758,
                14768
            ],
            [
                14768,
                14777
            ],
            [
                14777,
                14843
            ]
        ],
        "row_chars": [
            [
                0,
                143
            ],
            [
                143,
                213
            ],
            [
                213,
                286
            ],
            [
                286,
                340
            ],
            [
                340,
                441
            ],
            [
                441,
                614
            ],
            [
                614,
                720
            ],
            [
                720,
                720
            ],
            [
                720,
                781
            ],
            [
                781,
                978
            ],
            [
                978,
                1121
            ],
            [
                1121,
                1313
            ],
            [
                1313,
                1372
            ],
            [
                1372,
                1421
            ],
            [
                1421,
                1641
            ],
            [
                1641,
                1786
            ],
            [
                1786,
                1862
            ],
            [
                1862,
                1993
            ],
            [
                1993,
                2068
            ],
            [
                2068,
                2208
            ],
            [
                2208,
                2208
            ],
            [
                2208,
                2208
            ],
            [
                2208,
                2208
            ],
            [
                2208,
                2208
            ],
            [
                2208,
                2389
            ],
            [
                2389,
                2525
            ],
            [
                2525,
                2650
            ],
            [
                2650,
                2650
            ],
            [
                2650,
                2895
            ],
            [
                2895,
                2991
            ],
            [
                2991,
                3062
            ],
            [
                3062,
                3215
            ],
            [
                3215,
                3307
            ],
            [
                3307,
                3346
            ],
            [
                3346,
                3417
            ],
            [
                3417,
                3535
            ],
            [
                3535,
                3671
            ],
            [
                3671,
                3720
            ],
            [
                3720,
                3747
            ],
            [
                3747,
                3833
            ],
            [
                3833,
                3884
            ],
            [
                3884,
                4112
            ],
            [
                4112,
                4112
            ],
            [
                4112,
                4112
            ],
            [
                4112,
                4214
            ],
            [
                4214,
                4271
            ],
            [
                4271,
                4376
            ],
            [
                4376,
                4376
            ],
            [
                4376,
                4447
            ],
            [
                4447,
                4609
            ],
            [
                4609,
                4609
            ],
            [
                4609,
                4609
            ],
            [
                4609,
                4609
            ],
            [
                4609,
                4675
            ],
            [
                4675,
                4778
            ],
            [
                4778,
                4848
            ],
            [
                4848,
                5071
            ],
            [
                5071,
                5231
            ],
            [
                5231,
                5395
            ],
            [
                5395,
                5435
            ],
            [
                5435,
                5748
            ],
            [
                5748,
                5901
            ],
            [
                5901,
                6046
            ],
            [
                6046,
                6156
            ],
            [
                6156,
                6385
            ],
            [
                6385,
                6554
            ],
            [
                6554,
                6681
            ],
            [
                6681,
                6779
            ],
            [
                6779,
                6876
            ],
            [
                6876,
                6876
            ],
            [
                6876,
                7169
            ],
            [
                7169,
                7169
            ],
            [
                7169,
                7169
            ],
            [
                7169,
                7169
            ],
            [
                7169,
                7269
            ],
            [
                7269,
                7504
            ],
            [
                7504,
                7593
            ],
            [
                7593,
                7689
            ],
            [
                7689,
                8050
            ],
            [
                8050,
                8137
            ],
            [
                8137,
                8207
            ],
            [
                8207,
                8508
            ],
            [
                8508,
                8561
            ],
            [
                8561,
                8744
            ],
            [
                8744,
                8930
            ],
            [
                8930,
                9244
            ],
            [
                9244,
                9368
            ],
            [
                9368,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9502
            ],
            [
                9502,
                9554
            ],
            [
                9554,
                9631
            ],
            [
                9631,
                9843
            ],
            [
                9843,
                9972
            ],
            [
                9972,
                10101
            ],
            [
                10101,
                10222
            ],
            [
                10222,
                10222
            ],
            [
                10222,
                10379
            ],
            [
                10379,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10633
            ],
            [
                10633,
                10763
            ],
            [
                10763,
                10785
            ],
            [
                10785,
                10785
            ],
            [
                10785,
                10868
            ],
            [
                10868,
                10961
            ],
            [
                10961,
                11093
            ],
            [
                11093,
                11175
            ],
            [
                11175,
                11227
            ],
            [
                11227,
                11323
            ],
            [
                11323,
                11423
            ],
            [
                11423,
                11461
            ],
            [
                11461,
                11645
            ],
            [
                11645,
                11645
            ],
            [
                11645,
                11645
            ],
            [
                11645,
                11645
            ],
            [
                11645,
                11645
            ],
            [
                11645,
                11645
            ],
            [
                11645,
                11727
            ],
            [
                11727,
                11811
            ],
            [
                11811,
                12003
            ],
            [
                12003,
                12033
            ],
            [
                12033,
                12091
            ],
            [
                12091,
                12207
            ],
            [
                12207,
                12297
            ],
            [
                12297,
                12340
            ],
            [
                12340,
                12455
            ],
            [
                12455,
                12455
            ],
            [
                12455,
                12455
            ],
            [
                12455,
                12593
            ],
            [
                12593,
                12729
            ],
            [
                12729,
                12729
            ],
            [
                12729,
                12729
            ],
            [
                12729,
                12931
            ],
            [
                12931,
                13046
            ],
            [
                13046,
                13097
            ],
            [
                13097,
                13169
            ],
            [
                13169,
                13243
            ],
            [
                13243,
                13290
            ],
            [
                13290,
                13434
            ],
            [
                13434,
                13551
            ],
            [
                13551,
                13665
            ],
            [
                13665,
                13741
            ],
            [
                13741,
                13741
            ],
            [
                13741,
                13831
            ],
            [
                13831,
                14133
            ],
            [
                14133,
                14239
            ],
            [
                14239,
                14363
            ],
            [
                14363,
                14389
            ],
            [
                14389,
                14427
            ],
            [
                14427,
                14463
            ],
            [
                14463,
                14512
            ],
            [
                14512,
                14587
            ],
            [
                14587,
                14617
            ],
            [
                14617,
                14716
            ],
            [
                14716,
                14768
            ],
            [
                14768,
                14777
            ],
            [
                14777,
                14843
            ]
        ]
    }
}