{
    "original": {
        "text": "I know that the tune I am piping is a very mild one (although there are some terrific chapters coming presently), and must beg the good-natured reader to remember that we are only discoursing at present about a stockbroker's family in Russell Square, who are taking walks, or luncheon, or dinner, or talking and making love as people do in common life, and without a single passionate and wonderful incident to mark the progress of their loves. The argument stands thus--Osborne, in love with Amelia, has asked an old friend to dinner and to Vauxhall--Jos Sedley is in love with Rebecca. Will he marry her? That is the great subject now in hand.\nWe might have treated this subject in the genteel, or in the romantic, or in the facetious manner. Suppose we had laid the scene in Grosvenor Square, with the very same adventures--would not some people have listened? Suppose we had shown how Lord Joseph Sedley fell in love, and the Marquis of Osborne became attached to Lady Amelia, with the full consent of the Duke, her noble father: or instead of the supremely genteel, suppose we had resorted to the entirely low, and described what was going on in Mr. Sedley's kitchen--how black Sambo was in love with the cook (as indeed he was), and how he fought a battle with the coachman in her behalf; how the knife-boy was caught stealing a cold shoulder of mutton, and Miss Sedley's new femme de chambre refused to go to bed without a wax candle; such incidents might be made to provoke much delightful laughter, and be supposed to represent scenes of \"life.\" Or if, on the contrary, we had taken a fancy for the terrible, and made the lover of the new femme de chambre a professional burglar, who bursts into the house with his band, slaughters black Sambo at the feet of his master, and carries off Amelia in her night-dress, not to be let loose again till the third volume, we should easily have constructed a tale of thrilling interest, through the fiery chapters of which the reader should hurry, panting. But my readers must hope for no such romance, only a homely story, and must be content with a chapter about Vauxhall, which is so short that it scarce deserves to be called a chapter at all. And yet it is a chapter, and a very important one too. Are not there little chapters in everybody's life, that seem to be nothing, and yet affect all the rest of the history?\nLet us then step into the coach with the Russell Square party, and be off to the Gardens. There is barely room between Jos and Miss Sharp, who are on the front seat. Mr. Osborne sitting bodkin opposite, between Captain Dobbin and Amelia.\nEvery soul in the coach agreed that on that night Jos would propose to make Rebecca Sharp Mrs. Sedley. The parents at home had acquiesced in the arrangement, though, between ourselves, old Mr. Sedley had a feeling very much akin to contempt for his son. He said he was vain, selfish, lazy, and effeminate. He could not endure his airs as a man of fashion, and laughed heartily at his pompous braggadocio stories. \"I shall leave the fellow half my property,\" he said; \"and he will have, besides, plenty of his own; but as I am perfectly sure that if you, and I, and his sister were to die to-morrow, he would say 'Good Gad!' and eat his dinner just as well as usual, I am not going to make myself anxious about him. Let him marry whom he likes. It's no affair of mine.\"\nAmelia, on the other hand, as became a young woman of her prudence and temperament, was quite enthusiastic for the match. Once or twice Jos had been on the point of saying something very important to her, to which she was most willing to lend an ear, but the fat fellow could not be brought to unbosom himself of his great secret, and very much to his sister's disappointment he only rid himself of a large sigh and turned away.\nThis mystery served to keep Amelia's gentle bosom in a perpetual flutter of excitement. If she did not speak with Rebecca on the tender subject, she compensated herself with long and intimate conversations with Mrs. Blenkinsop, the housekeeper, who dropped some hints to the lady's-maid, who may have cursorily mentioned the matter to the cook, who carried the news, I have no doubt, to all the tradesmen, so that Mr. Jos's marriage was now talked of by a very considerable number of persons in the Russell Square world.\nIt was, of course, Mrs. Sedley's opinion that her son would demean himself by a marriage with an artist's daughter. \"But, lor', Ma'am,\" ejaculated Mrs. Blenkinsop, \"we was only grocers when we married Mr. S., who was a stock-broker's clerk, and we hadn't five hundred pounds among us, and we're rich enough now.\" And Amelia was entirely of this opinion, to which, gradually, the good-natured Mrs. Sedley was brought.\nMr. Sedley was neutral. \"Let Jos marry whom he likes,\" he said; \"it's no affair of mine. This girl has no fortune; no more had Mrs. Sedley. She seems good-humoured and clever, and will keep him in order, perhaps. Better she, my dear, than a black Mrs. Sedley, and a dozen of mahogany grandchildren.\"\nSo that everything seemed to smile upon Rebecca's fortunes. She took Jos's arm, as a matter of course, on going to dinner; she had sate by him on the box of his open carriage (a most tremendous \"buck\" he was, as he sat there, serene, in state, driving his greys), and though nobody said a word on the subject of the marriage, everybody seemed to understand it. All she wanted was the proposal, and ah! how Rebecca now felt the want of a mother!--a dear, tender mother, who would have managed the business in ten minutes, and, in the course of a little delicate confidential conversation, would have extracted the interesting avowal from the bashful lips of the young man!\nSuch was the state of affairs as the carriage crossed Westminster bridge.\nThe party was landed at the Royal Gardens in due time. As the majestic Jos stepped out of the creaking vehicle the crowd gave a cheer for the fat gentleman, who blushed and looked very big and mighty, as he walked away with Rebecca under his arm. George, of course, took charge of Amelia. She looked as happy as a rose-tree in sunshine.\n\"I say, Dobbin,\" says George, \"just look to the shawls and things, there's a good fellow.\" And so while he paired off with Miss Sedley, and Jos squeezed through the gate into the gardens with Rebecca at his side, honest Dobbin contented himself by giving an arm to the shawls, and by paying at the door for the whole party.\nHe walked very modestly behind them. He was not willing to spoil sport. About Rebecca and Jos he did not care a fig. But he thought Amelia worthy even of the brilliant George Osborne, and as he saw that good-looking couple threading the walks to the girl's delight and wonder, he watched her artless happiness with a sort of fatherly pleasure. Perhaps he felt that he would have liked to have something on his own arm besides a shawl (the people laughed at seeing the gawky young officer carrying this female burthen); but William Dobbin was very little addicted to selfish calculation at all; and so long as his friend was enjoying himself, how should he be discontented? And the truth is, that of all the delights of the Gardens; of the hundred thousand extra lamps, which were always lighted; the fiddlers in cocked hats, who played ravishing melodies under the gilded cockle-shell in the midst of the gardens; the singers, both of comic and sentimental ballads, who charmed the ears there; the country dances, formed by bouncing cockneys and cockneyesses, and executed amidst jumping, thumping and laughter; the signal which announced that Madame Saqui was about to mount skyward on a slack-rope ascending to the stars; the hermit that always sat in the illuminated hermitage; the dark walks, so favourable to the interviews of young lovers; the pots of stout handed about by the people in the shabby old liveries; and the twinkling boxes, in which the happy feasters made-believe to eat slices of almost invisible ham--of all these things, and of the gentle Simpson, that kind smiling idiot, who, I daresay, presided even then over the place--Captain William Dobbin did not take the slightest notice.\nHe carried about Amelia's white cashmere shawl, and having attended under the gilt cockle-shell, while Mrs. Salmon performed the Battle of Borodino (a savage cantata against the Corsican upstart, who had lately met with his Russian reverses)--Mr. Dobbin tried to hum it as he walked away, and found he was humming--the tune which Amelia Sedley sang on the stairs, as she came down to dinner.\nHe burst out laughing at himself; for the truth is, he could sing no better than an owl.\nIt is to be understood, as a matter of course, that our young people, being in parties of two and two, made the most solemn promises to keep together during the evening, and separated in ten minutes afterwards. Parties at Vauxhall always did separate, but 'twas only to meet again at supper-time, when they could talk of their mutual adventures in the interval.\nWhat were the adventures of Mr. Osborne and Miss Amelia? That is a secret. But be sure of this--they were perfectly happy, and correct in their behaviour; and as they had been in the habit of being together any time these fifteen years, their tete-a-tete offered no particular novelty.\nBut when Miss Rebecca Sharp and her stout companion lost themselves in a solitary walk, in which there were not above five score more of couples similarly straying, they both felt that the situation was extremely tender and critical, and now or never was the moment Miss Sharp thought, to provoke that declaration which was trembling on the timid lips of Mr. Sedley. They had previously been to the panorama of Moscow, where a rude fellow, treading on Miss Sharp's foot, caused her to fall back with a little shriek into the arms of Mr. Sedley, and this little incident increased the tenderness and confidence of that gentleman to such a degree, that he told her several of his favourite Indian stories over again for, at least, the sixth time.\n\"How I should like to see India!\" said Rebecca.\n\"SHOULD you?\" said Joseph, with a most killing tenderness; and was no doubt about to follow up this artful interrogatory by a question still more tender (for he puffed and panted a great deal, and Rebecca's hand, which was placed near his heart, could count the feverish pulsations of that organ), when, oh, provoking! the bell rang for the fireworks, and, a great scuffling and running taking place, these interesting lovers were obliged to follow in the stream of people.\nCaptain Dobbin had some thoughts of joining the party at supper: as, in truth, he found the Vauxhall amusements not particularly lively--but he paraded twice before the box where the now united couples were met, and nobody took any notice of him. Covers were laid for four. The mated pairs were prattling away quite happily, and Dobbin knew he was as clean forgotten as if he had never existed in this world.\n\"I should only be de trop,\" said the Captain, looking at them rather wistfully. \"I'd best go and talk to the hermit,\"--and so he strolled off out of the hum of men, and noise, and clatter of the banquet, into the dark walk, at the end of which lived that well-known pasteboard Solitary. It wasn't very good fun for Dobbin--and, indeed, to be alone at Vauxhall, I have found, from my own experience, to be one of the most dismal sports ever entered into by a bachelor.\nThe two couples were perfectly happy then in their box: where the most delightful and intimate conversation took place. Jos was in his glory, ordering about the waiters with great majesty. He made the salad; and uncorked the Champagne; and carved the chickens; and ate and drank the greater part of the refreshments on the tables. Finally, he insisted upon having a bowl of rack punch; everybody had rack punch at Vauxhall. \"Waiter, rack punch.\"\nThat bowl of rack punch was the cause of all this history. And why not a bowl of rack punch as well as any other cause? Was not a bowl of prussic acid the cause of Fair Rosamond's retiring from the world? Was not a bowl of wine the cause of the demise of Alexander the Great, or, at least, does not Dr. Lempriere say so?--so did this bowl of rack punch influence the fates of all the principal characters in this \"Novel without a Hero,\" which we are now relating. It influenced their life, although most of them did not taste a drop of it.\nThe young ladies did not drink it; Osborne did not like it; and the consequence was that Jos, that fat gourmand, drank up the whole contents of the bowl; and the consequence of his drinking up the whole contents of the bowl was a liveliness which at first was astonishing, and then became almost painful; for he talked and laughed so loud as to bring scores of listeners round the box, much to the confusion of the innocent party within it; and, volunteering to sing a song (which he did in that maudlin high key peculiar to gentlemen in an inebriated state), he almost drew away the audience who were gathered round the musicians in the gilt scollop-shell, and received from his hearers a great deal of applause.\n\"Brayvo, Fat un!\" said one; \"Angcore, Daniel Lambert!\" said another; \"What a figure for the tight-rope!\" exclaimed another wag, to the inexpressible alarm of the ladies, and the great anger of Mr. Osborne.\n\"For Heaven's sake, Jos, let us get up and go,\" cried that gentleman, and the young women rose.\n\"Stop, my dearest diddle-diddle-darling,\" shouted Jos, now as bold as a lion, and clasping Miss Rebecca round the waist. Rebecca started, but she could not get away her hand. The laughter outside redoubled. Jos continued to drink, to make love, and to sing; and, winking and waving his glass gracefully to his audience, challenged all or any to come in and take a share of his punch.\nMr. Osborne was just on the point of knocking down a gentleman in top-boots, who proposed to take advantage of this invitation, and a commotion seemed to be inevitable, when by the greatest good luck a gentleman of the name of Dobbin, who had been walking about the gardens, stepped up to the box. \"Be off, you fools!\" said this gentleman--shouldering off a great number of the crowd, who vanished presently before his cocked hat and fierce appearance--and he entered the box in a most agitated state.\n\"Good Heavens! Dobbin, where have you been?\" Osborne said, seizing the white cashmere shawl from his friend's arm, and huddling up Amelia in it.--\"Make yourself useful, and take charge of Jos here, whilst I take the ladies to the carriage.\"\nJos was for rising to interfere--but a single push from Osborne's finger sent him puffing back into his seat again, and the lieutenant was enabled to remove the ladies in safety. Jos kissed his hand to them as they retreated, and hiccupped out \"Bless you! Bless you!\" Then, seizing Captain Dobbin's hand, and weeping in the most pitiful way, he confided to that gentleman the secret of his loves. He adored that girl who had just gone out; he had broken her heart, he knew he had, by his conduct; he would marry her next morning at St. George's, Hanover Square; he'd knock up the Archbishop of Canterbury at Lambeth: he would, by Jove! and have him in readiness; and, acting on this hint, Captain Dobbin shrewdly induced him to leave the gardens and hasten to Lambeth Palace, and, when once out of the gates, easily conveyed Mr. Jos Sedley into a hackney-coach, which deposited him safely at his lodgings.\nGeorge Osborne conducted the girls home in safety: and when the door was closed upon them, and as he walked across Russell Square, laughed so as to astonish the watchman. Amelia looked very ruefully at her friend, as they went up stairs, and kissed her, and went to bed without any more talking.\n\"He must propose to-morrow,\" thought Rebecca. \"He called me his soul's darling, four times; he squeezed my hand in Amelia's presence. He must propose to-morrow.\" And so thought Amelia, too. And I dare say she thought of the dress she was to wear as bridesmaid, and of the presents which she should make to her nice little sister-in-law, and of a subsequent ceremony in which she herself might play a principal part, &c., and &c., and &c., and &c.\nOh, ignorant young creatures! How little do you know the effect of rack punch! What is the rack in the punch, at night, to the rack in the head of a morning? To this truth I can vouch as a man; there is no headache in the world like that caused by Vauxhall punch. Through the lapse of twenty years, I can remember the consequence of two glasses! two wine-glasses! but two, upon the honour of a gentleman; and Joseph Sedley, who had a liver complaint, had swallowed at least a quart of the abominable mixture.\nThat next morning, which Rebecca thought was to dawn upon her fortune, found Sedley groaning in agonies which the pen refuses to describe. Soda-water was not invented yet. Small beer--will it be believed!--was the only drink with which unhappy gentlemen soothed the fever of their previous night's potation. With this mild beverage before him, George Osborne found the ex-Collector of Boggley Wollah groaning on the sofa at his lodgings. Dobbin was already in the room, good-naturedly tending his patient of the night before. The two officers, looking at the prostrate Bacchanalian, and askance at each other, exchanged the most frightful sympathetic grins. Even Sedley's valet, the most solemn and correct of gentlemen, with the muteness and gravity of an undertaker, could hardly keep his countenance in order, as he looked at his unfortunate master.\n\"Mr. Sedley was uncommon wild last night, sir,\" he whispered in confidence to Osborne, as the latter mounted the stair. \"He wanted to fight the 'ackney-coachman, sir. The Capting was obliged to bring him upstairs in his harms like a babby.\" A momentary smile flickered over Mr. Brush's features as he spoke; instantly, however, they relapsed into their usual unfathomable calm, as he flung open the drawing-room door, and announced \"Mr. Hosbin.\"\n\"How are you, Sedley?\" that young wag began, after surveying his victim. \"No bones broke? There's a hackney-coachman downstairs with a black eye, and a tied-up head, vowing he'll have the law of you.\"\n\"What do you mean--law?\" Sedley faintly asked.\n\"For thrashing him last night--didn't he, Dobbin? You hit out, sir, like Molyneux. The watchman says he never saw a fellow go down so straight. Ask Dobbin.\"\n\"You DID have a round with the coachman,\" Captain Dobbin said, \"and showed plenty of fight too.\"\n\"And that fellow with the white coat at Vauxhall! How Jos drove at him! How the women screamed! By Jove, sir, it did my heart good to see you. I thought you civilians had no pluck; but I'll never get in your way when you are in your cups, Jos.\"\n\"I believe I'm very terrible, when I'm roused,\" ejaculated Jos from the sofa, and made a grimace so dreary and ludicrous, that the Captain's politeness could restrain him no longer, and he and Osborne fired off a ringing volley of laughter.\nOsborne pursued his advantage pitilessly. He thought Jos a milksop. He had been revolving in his mind the marriage question pending between Jos and Rebecca, and was not over well pleased that a member of a family into which he, George Osborne, of the --th, was going to marry, should make a mesalliance with a little nobody--a little upstart governess. \"You hit, you poor old fellow!\" said Osborne. \"You terrible! Why, man, you couldn't stand--you made everybody laugh in the Gardens, though you were crying yourself. You were maudlin, Jos. Don't you remember singing a song?\"\n\"A what?\" Jos asked.\n\"A sentimental song, and calling Rosa, Rebecca, what's her name, Amelia's little friend--your dearest diddle-diddle-darling?\" And this ruthless young fellow, seizing hold of Dobbin's hand, acted over the scene, to the horror of the original performer, and in spite of Dobbin's good-natured entreaties to him to have mercy.\n\"Why should I spare him?\" Osborne said to his friend's remonstrances, when they quitted the invalid, leaving him under the hands of Doctor Gollop. \"What the deuce right has he to give himself his patronizing airs, and make fools of us at Vauxhall? Who's this little schoolgirl that is ogling and making love to him? Hang it, the family's low enough already, without HER. A governess is all very well, but I'd rather have a lady for my sister-in-law. I'm a liberal man; but I've proper pride, and know my own station: let her know hers. And I'll take down that great hectoring Nabob, and prevent him from being made a greater fool than he is. That's why I told him to look out, lest she brought an action against him.\"\n\"I suppose you know best,\" Dobbin said, though rather dubiously. \"You always were a Tory, and your family's one of the oldest in England. But--\"\n\"Come and see the girls, and make love to Miss Sharp yourself,\" the lieutenant here interrupted his friend; but Captain Dobbin declined to join Osborne in his daily visit to the young ladies in Russell Square.\nAs George walked down Southampton Row, from Holborn, he laughed as he saw, at the Sedley Mansion, in two different stories two heads on the look-out.\nThe fact is, Miss Amelia, in the drawing-room balcony, was looking very eagerly towards the opposite side of the Square, where Mr. Osborne dwelt, on the watch for the lieutenant himself; and Miss Sharp, from her little bed-room on the second floor, was in observation until Mr. Joseph's great form should heave in sight.\n\"Sister Anne is on the watch-tower,\" said he to Amelia, \"but there's nobody coming\"; and laughing and enjoying the joke hugely, he described in the most ludicrous terms to Miss Sedley, the dismal condition of her brother.\n\"I think it's very cruel of you to laugh, George,\" she said, looking particularly unhappy; but George only laughed the more at her piteous and discomfited mien, persisted in thinking the joke a most diverting one, and when Miss Sharp came downstairs, bantered her with a great deal of liveliness upon the effect of her charms on the fat civilian.\n\"O Miss Sharp! if you could but see him this morning,\" he said--\"moaning in his flowered dressing-gown--writhing on his sofa; if you could but have seen him lolling out his tongue to Gollop the apothecary.\"\n\"See whom?\" said Miss Sharp.\n\"Whom? O whom? Captain Dobbin, of course, to whom we were all so attentive, by the way, last night.\"\n\"We were very unkind to him,\" Emmy said, blushing very much. \"I--I quite forgot him.\"\n\"Of course you did,\" cried Osborne, still on the laugh.\n\"One can't be ALWAYS thinking about Dobbin, you know, Amelia. Can one, Miss Sharp?\"\n\"Except when he overset the glass of wine at dinner,\" Miss Sharp said, with a haughty air and a toss of the head, \"I never gave the existence of Captain Dobbin one single moment's consideration.\"\n\"Very good, Miss Sharp, I'll tell him,\" Osborne said; and as he spoke Miss Sharp began to have a feeling of distrust and hatred towards this young officer, which he was quite unconscious of having inspired. \"He is to make fun of me, is he?\" thought Rebecca. \"Has he been laughing about me to Joseph? Has he frightened him? Perhaps he won't come.\"--A film passed over her eyes, and her heart beat quite quick.\n\"You're always joking,\" said she, smiling as innocently as she could. \"Joke away, Mr. George; there's nobody to defend ME.\" And George Osborne, as she walked away--and Amelia looked reprovingly at him--felt some little manly compunction for having inflicted any unnecessary unkindness upon this helpless creature. \"My dearest Amelia,\" said he, \"you are too good--too kind. You don't know the world. I do. And your little friend Miss Sharp must learn her station.\"\n\"Don't you think Jos will--\"\n\"Upon my word, my dear, I don't know. He may, or may not. I'm not his master. I only know he is a very foolish vain fellow, and put my dear little girl into a very painful and awkward position last night. My dearest diddle-diddle-darling!\" He was off laughing again, and he did it so drolly that Emmy laughed too.\nAll that day Jos never came. But Amelia had no fear about this; for the little schemer had actually sent away the page, Mr. Sambo's aide-de-camp, to Mr. Joseph's lodgings, to ask for some book he had promised, and how he was; and the reply through Jos's man, Mr. Brush, was, that his master was ill in bed, and had just had the doctor with him. He must come to-morrow, she thought, but she never had the courage to speak a word on the subject to Rebecca; nor did that young woman herself allude to it in any way during the whole evening after the night at Vauxhall.\nThe next day, however, as the two young ladies sate on the sofa, pretending to work, or to write letters, or to read novels, Sambo came into the room with his usual engaging grin, with a packet under his arm, and a note on a tray. \"Note from Mr. Jos, Miss,\" says Sambo.\nHow Amelia trembled as she opened it!\nSo it ran:\nDear Amelia,--I send you the \"Orphan of the Forest.\" I was too ill to come yesterday. I leave town to-day for Cheltenham. Pray excuse me, if you can, to the amiable Miss Sharp, for my conduct at Vauxhall, and entreat her to pardon and forget every word I may have uttered when excited by that fatal supper. As soon as I have recovered, for my health is very much shaken, I shall go to Scotland for some months, and am\nTruly yours, Jos Sedley\nIt was the death-warrant. All was over. Amelia did not dare to look at Rebecca's pale face and burning eyes, but she dropt the letter into her friend's lap; and got up, and went upstairs to her room, and cried her little heart out.\nBlenkinsop, the housekeeper, there sought her presently with consolation, on whose shoulder Amelia wept confidentially, and relieved herself a good deal. \"Don't take on, Miss. I didn't like to tell you. But none of us in the house have liked her except at fust. I sor her with my own eyes reading your Ma's letters. Pinner says she's always about your trinket-box and drawers, and everybody's drawers, and she's sure she's put your white ribbing into her box.\"\n\"I gave it her, I gave it her,\" Amelia said.\nBut this did not alter Mrs. Blenkinsop's opinion of Miss Sharp. \"I don't trust them governesses, Pinner,\" she remarked to the maid. \"They give themselves the hairs and hupstarts of ladies, and their wages is no better than you nor me.\"\nIt now became clear to every soul in the house, except poor Amelia, that Rebecca should take her departure, and high and low (always with the one exception) agreed that that event should take place as speedily as possible. Our good child ransacked all her drawers, cupboards, reticules, and gimcrack boxes--passed in review all her gowns, fichus, tags, bobbins, laces, silk stockings, and fallals--selecting this thing and that and the other, to make a little heap for Rebecca. And going to her Papa, that generous British merchant, who had promised to give her as many guineas as she was years old--she begged the old gentleman to give the money to dear Rebecca, who must want it, while she lacked for nothing.\nShe even made George Osborne contribute, and nothing loth (for he was as free-handed a young fellow as any in the army), he went to Bond Street, and bought the best hat and spenser that money could buy.\n\"That's George's present to you, Rebecca, dear,\" said Amelia, quite proud of the bandbox conveying these gifts. \"What a taste he has! There's nobody like him.\"\n\"Nobody,\" Rebecca answered. \"How thankful I am to him!\" She was thinking in her heart, \"It was George Osborne who prevented my marriage.\"--And she loved George Osborne accordingly.\nShe made her preparations for departure with great equanimity; and accepted all the kind little Amelia's presents, after just the proper degree of hesitation and reluctance. She vowed eternal gratitude to Mrs. Sedley, of course; but did not intrude herself upon that good lady too much, who was embarrassed, and evidently wishing to avoid her. She kissed Mr. Sedley's hand, when he presented her with the purse; and asked permission to consider him for the future as her kind, kind friend and protector. Her behaviour was so affecting that he was going to write her a cheque for twenty pounds more; but he restrained his feelings: the carriage was in waiting to take him to dinner, so he tripped away with a \"God bless you, my dear, always come here when you come to town, you know.--Drive to the Mansion House, James.\"\nFinally came the parting with Miss Amelia, over which picture I intend to throw a veil. But after a scene in which one person was in earnest and the other a perfect performer--after the tenderest caresses, the most pathetic tears, the smelling-bottle, and some of the very best feelings of the heart, had been called into requisition--Rebecca and Amelia parted, the former vowing to love her friend for ever and ever and ever.",
        "paragraph_chars": [
            [
                0,
                646
            ],
            [
                646,
                2372
            ],
            [
                2372,
                2610
            ],
            [
                2610,
                3379
            ],
            [
                3379,
                3808
            ],
            [
                3808,
                4329
            ],
            [
                4329,
                4746
            ],
            [
                4746,
                5046
            ],
            [
                5046,
                5718
            ],
            [
                5718,
                5792
            ],
            [
                5792,
                6129
            ],
            [
                6129,
                6453
            ],
            [
                6453,
                8159
            ],
            [
                8159,
                8551
            ],
            [
                8551,
                8640
            ],
            [
                8640,
                9002
            ],
            [
                9002,
                9288
            ],
            [
                9288,
                10033
            ],
            [
                10033,
                10081
            ],
            [
                10081,
                10555
            ],
            [
                10555,
                10964
            ],
            [
                10964,
                11432
            ],
            [
                11432,
                11878
            ],
            [
                11878,
                12418
            ],
            [
                12418,
                13132
            ],
            [
                13132,
                13338
            ],
            [
                13338,
                13434
            ],
            [
                13434,
                13818
            ],
            [
                13818,
                14320
            ],
            [
                14320,
                14561
            ],
            [
                14561,
                15467
            ],
            [
                15467,
                15763
            ],
            [
                15763,
                16210
            ],
            [
                16210,
                16719
            ],
            [
                16719,
                17572
            ],
            [
                17572,
                18018
            ],
            [
                18018,
                18219
            ],
            [
                18219,
                18266
            ],
            [
                18266,
                18423
            ],
            [
                18423,
                18520
            ],
            [
                18520,
                18765
            ],
            [
                18765,
                19006
            ],
            [
                19006,
                19583
            ],
            [
                19583,
                19604
            ],
            [
                19604,
                19927
            ],
            [
                19927,
                20645
            ],
            [
                20645,
                20790
            ],
            [
                20790,
                21000
            ],
            [
                21000,
                21150
            ],
            [
                21150,
                21471
            ],
            [
                21471,
                21693
            ],
            [
                21693,
                22040
            ],
            [
                22040,
                22247
            ],
            [
                22247,
                22276
            ],
            [
                22276,
                22377
            ],
            [
                22377,
                22463
            ],
            [
                22463,
                22519
            ],
            [
                22519,
                22603
            ],
            [
                22603,
                22799
            ],
            [
                22799,
                23208
            ],
            [
                23208,
                23672
            ],
            [
                23672,
                23701
            ],
            [
                23701,
                24015
            ],
            [
                24015,
                24581
            ],
            [
                24581,
                24851
            ],
            [
                24851,
                24889
            ],
            [
                24889,
                24900
            ],
            [
                24900,
                25318
            ],
            [
                25318,
                25342
            ],
            [
                25342,
                25574
            ],
            [
                25574,
                26035
            ],
            [
                26035,
                26080
            ],
            [
                26080,
                26316
            ],
            [
                26316,
                27028
            ],
            [
                27028,
                27231
            ],
            [
                27231,
                27391
            ],
            [
                27391,
                27572
            ],
            [
                27572,
                28392
            ],
            [
                28392,
                28818
            ]
        ],
        "segment_chars": [
            [
                0,
                445
            ],
            [
                445,
                588
            ],
            [
                588,
                607
            ],
            [
                607,
                646
            ],
            [
                646,
                745
            ],
            [
                745,
                864
            ],
            [
                864,
                1555
            ],
            [
                1555,
                2006
            ],
            [
                2006,
                2197
            ],
            [
                2197,
                2252
            ],
            [
                2252,
                2372
            ],
            [
                2372,
                2462
            ],
            [
                2462,
                2538
            ],
            [
                2538,
                2610
            ],
            [
                2610,
                2713
            ],
            [
                2713,
                2864
            ],
            [
                2864,
                2916
            ],
            [
                2916,
                3023
            ],
            [
                3023,
                3234
            ],
            [
                3234,
                3325
            ],
            [
                3325,
                3354
            ],
            [
                3354,
                3379
            ],
            [
                3379,
                3501
            ],
            [
                3501,
                3808
            ],
            [
                3808,
                3896
            ],
            [
                3896,
                4329
            ],
            [
                4329,
                4445
            ],
            [
                4445,
                4642
            ],
            [
                4642,
                4746
            ],
            [
                4746,
                4770
            ],
            [
                4770,
                4835
            ],
            [
                4835,
                4886
            ],
            [
                4886,
                4959
            ],
            [
                4959,
                5046
            ],
            [
                5046,
                5106
            ],
            [
                5106,
                5407
            ],
            [
                5407,
                5448
            ],
            [
                5448,
                5718
            ],
            [
                5718,
                5792
            ],
            [
                5792,
                5847
            ],
            [
                5847,
                6039
            ],
            [
                6039,
                6081
            ],
            [
                6081,
                6129
            ],
            [
                6129,
                6220
            ],
            [
                6220,
                6453
            ],
            [
                6453,
                6490
            ],
            [
                6490,
                6525
            ],
            [
                6525,
                6570
            ],
            [
                6570,
                6797
            ],
            [
                6797,
                7126
            ],
            [
                7126,
                8159
            ],
            [
                8159,
                8551
            ],
            [
                8551,
                8640
            ],
            [
                8640,
                8851
            ],
            [
                8851,
                9002
            ],
            [
                9002,
                9059
            ],
            [
                9059,
                9077
            ],
            [
                9077,
                9288
            ],
            [
                9288,
                9655
            ],
            [
                9655,
                10033
            ],
            [
                10033,
                10067
            ],
            [
                10067,
                10081
            ],
            [
                10081,
                10095
            ],
            [
                10095,
                10400
            ],
            [
                10400,
                10555
            ],
            [
                10555,
                10802
            ],
            [
                10802,
                10829
            ],
            [
                10829,
                10964
            ],
            [
                10964,
                11044
            ],
            [
                11044,
                11251
            ],
            [
                11251,
                11432
            ],
            [
                11432,
                11552
            ],
            [
                11552,
                11621
            ],
            [
                11621,
                11763
            ],
            [
                11763,
                11856
            ],
            [
                11856,
                11878
            ],
            [
                11878,
                11937
            ],
            [
                11937,
                11998
            ],
            [
                11998,
                12083
            ],
            [
                12083,
                12342
            ],
            [
                12342,
                12418
            ],
            [
                12418,
                13132
            ],
            [
                13132,
                13150
            ],
            [
                13150,
                13187
            ],
            [
                13187,
                13237
            ],
            [
                13237,
                13338
            ],
            [
                13338,
                13434
            ],
            [
                13434,
                13555
            ],
            [
                13555,
                13609
            ],
            [
                13609,
                13641
            ],
            [
                13641,
                13818
            ],
            [
                13818,
                14116
            ],
            [
                14116,
                14137
            ],
            [
                14137,
                14320
            ],
            [
                14320,
                14335
            ],
            [
                14335,
                14365
            ],
            [
                14365,
                14561
            ],
            [
                14561,
                14740
            ],
            [
                14740,
                14817
            ],
            [
                14817,
                14829
            ],
            [
                14829,
                14958
            ],
            [
                14958,
                15197
            ],
            [
                15197,
                15467
            ],
            [
                15467,
                15638
            ],
            [
                15638,
                15763
            ],
            [
                15763,
                15809
            ],
            [
                15809,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                15953
            ],
            [
                15953,
                16210
            ],
            [
                16210,
                16240
            ],
            [
                16240,
                16289
            ],
            [
                16289,
                16368
            ],
            [
                16368,
                16474
            ],
            [
                16474,
                16556
            ],
            [
                16556,
                16574
            ],
            [
                16574,
                16719
            ],
            [
                16719,
                16858
            ],
            [
                16858,
                16891
            ],
            [
                16891,
                17027
            ],
            [
                17027,
                17157
            ],
            [
                17157,
                17245
            ],
            [
                17245,
                17377
            ],
            [
                17377,
                17572
            ],
            [
                17572,
                17692
            ],
            [
                17692,
                17739
            ],
            [
                17739,
                17813
            ],
            [
                17813,
                18009
            ],
            [
                18009,
                18018
            ],
            [
                18018,
                18041
            ],
            [
                18041,
                18091
            ],
            [
                18091,
                18108
            ],
            [
                18108,
                18219
            ],
            [
                18219,
                18244
            ],
            [
                18244,
                18266
            ],
            [
                18266,
                18316
            ],
            [
                18316,
                18349
            ],
            [
                18349,
                18410
            ],
            [
                18410,
                18423
            ],
            [
                18423,
                18520
            ],
            [
                18520,
                18570
            ],
            [
                18570,
                18592
            ],
            [
                18592,
                18616
            ],
            [
                18616,
                18663
            ],
            [
                18663,
                18765
            ],
            [
                18765,
                19006
            ],
            [
                19006,
                19048
            ],
            [
                19048,
                19074
            ],
            [
                19074,
                19359
            ],
            [
                19359,
                19391
            ],
            [
                19391,
                19405
            ],
            [
                19405,
                19420
            ],
            [
                19420,
                19524
            ],
            [
                19524,
                19547
            ],
            [
                19547,
                19583
            ],
            [
                19583,
                19593
            ],
            [
                19593,
                19604
            ],
            [
                19604,
                19730
            ],
            [
                19730,
                19927
            ],
            [
                19927,
                19953
            ],
            [
                19953,
                20074
            ],
            [
                20074,
                20175
            ],
            [
                20175,
                20243
            ],
            [
                20243,
                20298
            ],
            [
                20298,
                20377
            ],
            [
                20377,
                20463
            ],
            [
                20463,
                20569
            ],
            [
                20569,
                20645
            ],
            [
                20645,
                20710
            ],
            [
                20710,
                20783
            ],
            [
                20783,
                20790
            ],
            [
                20790,
                21000
            ],
            [
                21000,
                21150
            ],
            [
                21150,
                21471
            ],
            [
                21471,
                21693
            ],
            [
                21693,
                22040
            ],
            [
                22040,
                22055
            ],
            [
                22055,
                22247
            ],
            [
                22247,
                22259
            ],
            [
                22259,
                22276
            ],
            [
                22276,
                22283
            ],
            [
                22283,
                22291
            ],
            [
                22291,
                22377
            ],
            [
                22377,
                22438
            ],
            [
                22438,
                22463
            ],
            [
                22463,
                22519
            ],
            [
                22519,
                22581
            ],
            [
                22581,
                22603
            ],
            [
                22603,
                22799
            ],
            [
                22799,
                23006
            ],
            [
                23006,
                23040
            ],
            [
                23040,
                23057
            ],
            [
                23057,
                23099
            ],
            [
                23099,
                23122
            ],
            [
                23122,
                23145
            ],
            [
                23145,
                23208
            ],
            [
                23208,
                23278
            ],
            [
                23278,
                23332
            ],
            [
                23332,
                23522
            ],
            [
                23522,
                23581
            ],
            [
                23581,
                23607
            ],
            [
                23607,
                23613
            ],
            [
                23613,
                23672
            ],
            [
                23672,
                23701
            ],
            [
                23701,
                23739
            ],
            [
                23739,
                23759
            ],
            [
                23759,
                23779
            ],
            [
                23779,
                23906
            ],
            [
                23906,
                23941
            ],
            [
                23941,
                24015
            ],
            [
                24015,
                24044
            ],
            [
                24044,
                24360
            ],
            [
                24360,
                24581
            ],
            [
                24581,
                24812
            ],
            [
                24812,
                24851
            ],
            [
                24851,
                24889
            ],
            [
                24889,
                24900
            ],
            [
                24900,
                24953
            ],
            [
                24953,
                24986
            ],
            [
                24986,
                25022
            ],
            [
                25022,
                25207
            ],
            [
                25207,
                25318
            ],
            [
                25318,
                25342
            ],
            [
                25342,
                25368
            ],
            [
                25368,
                25382
            ],
            [
                25382,
                25574
            ],
            [
                25574,
                25728
            ],
            [
                25728,
                25750
            ],
            [
                25750,
                25777
            ],
            [
                25777,
                25836
            ],
            [
                25836,
                25890
            ],
            [
                25890,
                26035
            ],
            [
                26035,
                26080
            ],
            [
                26080,
                26144
            ],
            [
                26144,
                26212
            ],
            [
                26212,
                26316
            ],
            [
                26316,
                26539
            ],
            [
                26539,
                26794
            ],
            [
                26794,
                27028
            ],
            [
                27028,
                27231
            ],
            [
                27231,
                27343
            ],
            [
                27343,
                27365
            ],
            [
                27365,
                27391
            ],
            [
                27391,
                27419
            ],
            [
                27419,
                27447
            ],
            [
                27447,
                27528
            ],
            [
                27528,
                27572
            ],
            [
                27572,
                27746
            ],
            [
                27746,
                27916
            ],
            [
                27916,
                28076
            ],
            [
                28076,
                28392
            ],
            [
                28392,
                28480
            ],
            [
                28480,
                28818
            ]
        ],
        "overlap_chars": [
            [
                0,
                117
            ],
            [
                118,
                179
            ],
            [
                300,
                307
            ],
            [
                203,
                275
            ],
            [
                284,
                285
            ],
            [
                324,
                339
            ],
            [
                347,
                352
            ],
            [
                357,
                373
            ],
            [
                389,
                445
            ],
            [
                471,
                527
            ],
            [
                542,
                550
            ],
            [
                552,
                588
            ],
            [
                588,
                607
            ],
            [
                607,
                646
            ],
            [
                745,
                795
            ],
            [
                875,
                1044
            ],
            [
                1069,
                1171
            ],
            [
                1173,
                1279
            ],
            [
                1283,
                1286
            ],
            [
                1358,
                1363
            ],
            [
                1295,
                1334
            ],
            [
                1340,
                1358
            ],
            [
                1442,
                1462
            ],
            [
                1474,
                1555
            ],
            [
                1555,
                1560
            ],
            [
                1579,
                1585
            ],
            [
                1622,
                1626
            ],
            [
                1665,
                1687
            ],
            [
                1700,
                1714
            ],
            [
                1560,
                1561
            ],
            [
                1741,
                1752
            ],
            [
                1616,
                1621
            ],
            [
                1792,
                1832
            ],
            [
                1849,
                1874
            ],
            [
                1889,
                1893
            ],
            [
                1997,
                2004
            ],
            [
                1936,
                1965
            ],
            [
                1592,
                1593
            ],
            [
                1916,
                1925
            ],
            [
                1908,
                1912
            ],
            [
                2004,
                2005
            ],
            [
                2006,
                2025
            ],
            [
                2082,
                2097
            ],
            [
                2057,
                2076
            ],
            [
                2098,
                2122
            ],
            [
                2124,
                2197
            ],
            [
                2197,
                2212
            ],
            [
                2228,
                2246
            ],
            [
                2250,
                2252
            ],
            [
                2252,
                2255
            ],
            [
                2260,
                2265
            ],
            [
                2256,
                2259
            ],
            [
                2266,
                2301
            ],
            [
                2303,
                2358
            ],
            [
                2363,
                2372
            ],
            [
                2372,
                2448
            ],
            [
                2453,
                2462
            ],
            [
                2491,
                2509
            ],
            [
                2515,
                2536
            ],
            [
                2509,
                2510
            ],
            [
                2538,
                2557
            ],
            [
                2565,
                2610
            ],
            [
                2610,
                2680
            ],
            [
                2686,
                2699
            ],
            [
                2711,
                2713
            ],
            [
                2713,
                2747
            ],
            [
                2766,
                2774
            ],
            [
                2795,
                2823
            ],
            [
                2839,
                2864
            ],
            [
                2864,
                2914
            ],
            [
                2964,
                2977
            ],
            [
                2987,
                3001
            ],
            [
                3014,
                3022
            ],
            [
                3023,
                3078
            ],
            [
                3124,
                3127
            ],
            [
                3131,
                3163
            ],
            [
                3168,
                3169
            ],
            [
                3171,
                3197
            ],
            [
                3207,
                3234
            ],
            [
                3234,
                3260
            ],
            [
                3269,
                3274
            ],
            [
                3323,
                3325
            ],
            [
                3325,
                3354
            ],
            [
                3354,
                3379
            ],
            [
                3379,
                3405
            ],
            [
                3463,
                3499
            ],
            [
                3708,
                3713
            ],
            [
                3858,
                3862
            ],
            [
                3873,
                3896
            ],
            [
                3899,
                3936
            ],
            [
                3944,
                3952
            ],
            [
                3982,
                3986
            ],
            [
                4000,
                4034
            ],
            [
                4036,
                4108
            ],
            [
                4119,
                4173
            ],
            [
                4192,
                4263
            ],
            [
                4282,
                4299
            ],
            [
                4327,
                4329
            ],
            [
                5054,
                5106
            ],
            [
                5106,
                5124
            ],
            [
                5149,
                5172
            ],
            [
                5261,
                5264
            ],
            [
                5182,
                5220
            ],
            [
                5310,
                5339
            ],
            [
                5362,
                5407
            ],
            [
                5407,
                5438
            ],
            [
                5444,
                5448
            ],
            [
                5448,
                5472
            ],
            [
                5478,
                5489
            ],
            [
                5515,
                5571
            ],
            [
                5589,
                5606
            ],
            [
                5620,
                5658
            ],
            [
                5671,
                5686
            ],
            [
                5707,
                5716
            ],
            [
                5687,
                5699
            ],
            [
                5716,
                5718
            ],
            [
                5718,
                5792
            ],
            [
                5813,
                5833
            ],
            [
                5845,
                5847
            ],
            [
                5847,
                5902
            ],
            [
                5991,
                5992
            ],
            [
                5903,
                5960
            ],
            [
                5993,
                6039
            ],
            [
                6039,
                6080
            ],
            [
                6129,
                6145
            ],
            [
                6151,
                6169
            ],
            [
                6173,
                6220
            ],
            [
                6220,
                6328
            ],
            [
                6340,
                6376
            ],
            [
                6394,
                6409
            ],
            [
                6413,
                6453
            ],
            [
                6453,
                6462
            ],
            [
                6468,
                6488
            ],
            [
                6509,
                6511
            ],
            [
                6512,
                6517
            ],
            [
                6523,
                6525
            ],
            [
                6525,
                6570
            ],
            [
                6570,
                6650
            ],
            [
                6699,
                6797
            ],
            [
                6797,
                6845
            ],
            [
                6856,
                6870
            ],
            [
                6879,
                6886
            ],
            [
                6972,
                6994
            ],
            [
                7019,
                7026
            ],
            [
                7045,
                7125
            ],
            [
                7126,
                7183
            ],
            [
                7331,
                7332
            ],
            [
                7185,
                7208
            ],
            [
                7215,
                7221
            ],
            [
                7249,
                7261
            ],
            [
                7276,
                7277
            ],
            [
                7367,
                7379
            ],
            [
                7447,
                7466
            ],
            [
                7533,
                7628
            ],
            [
                7637,
                7692
            ],
            [
                7700,
                7766
            ],
            [
                7785,
                7797
            ],
            [
                7929,
                7930
            ],
            [
                8109,
                8159
            ],
            [
                8159,
                8217
            ],
            [
                8262,
                8273
            ],
            [
                8284,
                8332
            ],
            [
                8406,
                8472
            ],
            [
                8474,
                8507
            ],
            [
                8523,
                8550
            ],
            [
                8551,
                8588
            ],
            [
                8603,
                8640
            ],
            [
                8692,
                8695
            ],
            [
                8730,
                8733
            ],
            [
                8696,
                8701
            ],
            [
                8743,
                8747
            ],
            [
                8757,
                8823
            ],
            [
                8827,
                8838
            ],
            [
                8849,
                8851
            ],
            [
                8851,
                8891
            ],
            [
                8907,
                8966
            ],
            [
                8974,
                8984
            ],
            [
                9000,
                9002
            ],
            [
                9002,
                9059
            ],
            [
                9059,
                9077
            ],
            [
                9077,
                9088
            ],
            [
                9098,
                9288
            ],
            [
                9288,
                9369
            ],
            [
                9374,
                9395
            ],
            [
                9417,
                9421
            ],
            [
                9425,
                9432
            ],
            [
                9451,
                9500
            ],
            [
                9512,
                9520
            ],
            [
                9645,
                9646
            ],
            [
                9526,
                9553
            ],
            [
                9520,
                9521
            ],
            [
                9554,
                9573
            ],
            [
                9643,
                9645
            ],
            [
                9647,
                9653
            ],
            [
                9590,
                9601
            ],
            [
                9653,
                9655
            ],
            [
                9655,
                9714
            ],
            [
                9720,
                9726
            ],
            [
                9728,
                9757
            ],
            [
                9759,
                9808
            ],
            [
                9821,
                9831
            ],
            [
                9813,
                9817
            ],
            [
                9837,
                9841
            ],
            [
                9849,
                9867
            ],
            [
                9887,
                9897
            ],
            [
                9934,
                9990
            ],
            [
                9991,
                10001
            ],
            [
                10031,
                10033
            ],
            [
                10033,
                10067
            ],
            [
                10067,
                10081
            ],
            [
                10081,
                10095
            ],
            [
                10095,
                10106
            ],
            [
                10128,
                10134
            ],
            [
                10138,
                10180
            ],
            [
                10207,
                10215
            ],
            [
                10108,
                10112
            ],
            [
                10216,
                10233
            ],
            [
                10379,
                10400
            ],
            [
                10400,
                10436
            ],
            [
                10438,
                10467
            ],
            [
                10475,
                10480
            ],
            [
                10500,
                10529
            ],
            [
                10533,
                10555
            ],
            [
                10555,
                10573
            ],
            [
                10588,
                10618
            ],
            [
                10692,
                10698
            ],
            [
                10707,
                10712
            ],
            [
                10624,
                10626
            ],
            [
                10794,
                10796
            ],
            [
                10720,
                10737
            ],
            [
                10749,
                10756
            ],
            [
                10762,
                10777
            ],
            [
                10797,
                10802
            ],
            [
                10802,
                10829
            ],
            [
                10829,
                10902
            ],
            [
                10906,
                10921
            ],
            [
                10962,
                10964
            ],
            [
                10964,
                11008
            ],
            [
                11026,
                11044
            ],
            [
                11044,
                11079
            ],
            [
                11087,
                11101
            ],
            [
                11106,
                11116
            ],
            [
                11133,
                11138
            ],
            [
                11140,
                11218
            ],
            [
                11230,
                11251
            ],
            [
                11251,
                11285
            ],
            [
                11292,
                11323
            ],
            [
                11385,
                11391
            ],
            [
                11420,
                11432
            ],
            [
                11432,
                11468
            ],
            [
                11474,
                11486
            ],
            [
                11550,
                11552
            ],
            [
                11552,
                11621
            ],
            [
                11621,
                11639
            ],
            [
                11644,
                11667
            ],
            [
                11672,
                11747
            ],
            [
                11761,
                11763
            ],
            [
                11763,
                11855
            ],
            [
                11878,
                11937
            ],
            [
                11937,
                11948
            ],
            [
                11996,
                11998
            ],
            [
                12083,
                12152
            ],
            [
                12197,
                12198
            ],
            [
                12195,
                12197
            ],
            [
                12220,
                12230
            ],
            [
                12345,
                12355
            ],
            [
                12241,
                12261
            ],
            [
                12272,
                12314
            ],
            [
                12368,
                12418
            ],
            [
                12418,
                12481
            ],
            [
                12507,
                12510
            ],
            [
                12531,
                12570
            ],
            [
                12576,
                12594
            ],
            [
                12642,
                12706
            ],
            [
                12714,
                12832
            ],
            [
                12848,
                12857
            ],
            [
                12864,
                12942
            ],
            [
                12959,
                12969
            ],
            [
                12943,
                12952
            ],
            [
                12975,
                12980
            ],
            [
                13080,
                13132
            ],
            [
                13132,
                13150
            ],
            [
                13150,
                13158
            ],
            [
                13255,
                13258
            ],
            [
                13199,
                13236
            ],
            [
                13237,
                13254
            ],
            [
                13258,
                13266
            ],
            [
                13281,
                13309
            ],
            [
                13316,
                13338
            ],
            [
                13338,
                13369
            ],
            [
                13381,
                13385
            ],
            [
                13386,
                13391
            ],
            [
                13406,
                13434
            ],
            [
                13434,
                13511
            ],
            [
                13516,
                13555
            ],
            [
                13555,
                13598
            ],
            [
                13607,
                13609
            ],
            [
                13609,
                13621
            ],
            [
                13630,
                13641
            ],
            [
                13641,
                13764
            ],
            [
                13776,
                13778
            ],
            [
                13791,
                13818
            ],
            [
                13818,
                13880
            ],
            [
                13895,
                13910
            ],
            [
                13929,
                14017
            ],
            [
                14045,
                14051
            ],
            [
                14093,
                14115
            ],
            [
                14116,
                14137
            ],
            [
                14275,
                14277
            ],
            [
                14137,
                14141
            ],
            [
                14192,
                14201
            ],
            [
                14207,
                14215
            ],
            [
                14226,
                14269
            ],
            [
                14318,
                14320
            ],
            [
                14320,
                14335
            ],
            [
                14335,
                14365
            ],
            [
                14365,
                14396
            ],
            [
                14406,
                14447
            ],
            [
                14451,
                14463
            ],
            [
                14466,
                14561
            ],
            [
                14561,
                14568
            ],
            [
                14573,
                14592
            ],
            [
                14594,
                14599
            ],
            [
                14607,
                14699
            ],
            [
                14708,
                14740
            ],
            [
                14740,
                14786
            ],
            [
                14791,
                14796
            ],
            [
                14805,
                14817
            ],
            [
                14817,
                14829
            ],
            [
                14829,
                14877
            ],
            [
                14890,
                14893
            ],
            [
                14901,
                14914
            ],
            [
                14933,
                14950
            ],
            [
                14956,
                14958
            ],
            [
                14958,
                14995
            ],
            [
                14999,
                15024
            ],
            [
                15042,
                15176
            ],
            [
                15186,
                15197
            ],
            [
                15388,
                15389
            ],
            [
                15258,
                15273
            ],
            [
                15282,
                15306
            ],
            [
                15210,
                15212
            ],
            [
                15311,
                15335
            ],
            [
                15347,
                15369
            ],
            [
                15370,
                15376
            ],
            [
                15390,
                15393
            ],
            [
                15401,
                15428
            ],
            [
                15206,
                15209
            ],
            [
                15453,
                15467
            ],
            [
                15467,
                15481
            ],
            [
                15492,
                15506
            ],
            [
                15516,
                15521
            ],
            [
                15598,
                15605
            ],
            [
                15565,
                15567
            ],
            [
                15540,
                15546
            ],
            [
                15527,
                15535
            ],
            [
                15547,
                15556
            ],
            [
                15636,
                15638
            ],
            [
                15638,
                15651
            ],
            [
                15657,
                15679
            ],
            [
                15681,
                15693
            ],
            [
                15709,
                15715
            ],
            [
                15721,
                15744
            ],
            [
                15754,
                15763
            ],
            [
                15763,
                15779
            ],
            [
                15789,
                15809
            ],
            [
                15809,
                15841
            ],
            [
                15843,
                15897
            ],
            [
                15897,
                15912
            ],
            [
                15922,
                15925
            ],
            [
                15925,
                15953
            ],
            [
                15953,
                15996
            ],
            [
                16004,
                16022
            ],
            [
                16098,
                16155
            ],
            [
                16031,
                16034
            ],
            [
                16208,
                16210
            ],
            [
                16210,
                16240
            ],
            [
                16240,
                16289
            ],
            [
                16404,
                16474
            ],
            [
                16474,
                16556
            ],
            [
                16615,
                16632
            ],
            [
                16661,
                16691
            ],
            [
                16717,
                16719
            ],
            [
                16724,
                16788
            ],
            [
                17061,
                17118
            ],
            [
                16812,
                16822
            ],
            [
                16788,
                16789
            ],
            [
                17119,
                17157
            ],
            [
                17157,
                17223
            ],
            [
                17243,
                17245
            ],
            [
                17245,
                17261
            ],
            [
                17306,
                17328
            ],
            [
                17358,
                17377
            ],
            [
                17377,
                17390
            ],
            [
                17407,
                17413
            ],
            [
                17391,
                17396
            ],
            [
                17488,
                17509
            ],
            [
                17522,
                17530
            ],
            [
                17570,
                17572
            ],
            [
                17572,
                17632
            ],
            [
                17647,
                17657
            ],
            [
                17690,
                17692
            ],
            [
                17692,
                17739
            ],
            [
                17739,
                17750
            ],
            [
                17763,
                17791
            ],
            [
                17798,
                17812
            ],
            [
                18018,
                18041
            ],
            [
                18089,
                18091
            ],
            [
                18091,
                18108
            ],
            [
                18108,
                18163
            ],
            [
                18184,
                18209
            ],
            [
                18213,
                18219
            ],
            [
                18219,
                18236
            ],
            [
                18241,
                18244
            ],
            [
                18244,
                18266
            ],
            [
                18266,
                18295
            ],
            [
                18297,
                18316
            ],
            [
                18349,
                18410
            ],
            [
                18410,
                18423
            ],
            [
                18423,
                18520
            ],
            [
                18520,
                18536
            ],
            [
                18557,
                18570
            ],
            [
                18570,
                18592
            ],
            [
                18592,
                18616
            ],
            [
                18616,
                18663
            ],
            [
                18705,
                18765
            ],
            [
                18765,
                18793
            ],
            [
                18795,
                18812
            ],
            [
                18824,
                18842
            ],
            [
                18852,
                18853
            ],
            [
                18865,
                18871
            ],
            [
                18854,
                18861
            ],
            [
                19004,
                19006
            ],
            [
                19006,
                19048
            ],
            [
                19048,
                19074
            ],
            [
                19074,
                19111
            ],
            [
                19121,
                19129
            ],
            [
                19250,
                19252
            ],
            [
                19112,
                19120
            ],
            [
                19138,
                19174
            ],
            [
                19185,
                19249
            ],
            [
                19263,
                19296
            ],
            [
                19300,
                19313
            ],
            [
                19331,
                19358
            ],
            [
                19359,
                19360
            ],
            [
                19367,
                19372
            ],
            [
                19388,
                19391
            ],
            [
                19391,
                19395
            ],
            [
                19403,
                19405
            ],
            [
                19450,
                19474
            ],
            [
                19489,
                19524
            ],
            [
                19524,
                19547
            ],
            [
                19547,
                19575
            ],
            [
                19619,
                19668
            ],
            [
                19693,
                19729
            ],
            [
                19730,
                19769
            ],
            [
                19778,
                19798
            ],
            [
                19804,
                19817
            ],
            [
                19822,
                19828
            ],
            [
                19854,
                19907
            ],
            [
                19915,
                19927
            ],
            [
                19927,
                19953
            ],
            [
                19953,
                19979
            ],
            [
                19995,
                20074
            ],
            [
                20074,
                20118
            ],
            [
                20135,
                20175
            ],
            [
                20175,
                20185
            ],
            [
                20193,
                20218
            ],
            [
                20238,
                20243
            ],
            [
                20243,
                20298
            ],
            [
                20332,
                20377
            ],
            [
                20377,
                20378
            ],
            [
                20423,
                20463
            ],
            [
                20463,
                20471
            ],
            [
                20514,
                20521
            ],
            [
                20482,
                20486
            ],
            [
                20503,
                20508
            ],
            [
                20526,
                20569
            ],
            [
                20569,
                20645
            ],
            [
                20645,
                20710
            ],
            [
                20788,
                20789
            ],
            [
                20783,
                20786
            ],
            [
                20790,
                20868
            ],
            [
                20874,
                20885
            ],
            [
                20896,
                20925
            ],
            [
                20998,
                21000
            ],
            [
                21000,
                21037
            ],
            [
                21078,
                21096
            ],
            [
                21051,
                21073
            ],
            [
                21123,
                21150
            ],
            [
                21163,
                21241
            ],
            [
                21251,
                21270
            ],
            [
                21296,
                21312
            ],
            [
                21335,
                21351
            ],
            [
                21399,
                21402
            ],
            [
                21353,
                21357
            ],
            [
                21381,
                21397
            ],
            [
                21418,
                21471
            ],
            [
                21471,
                21525
            ],
            [
                21525,
                21553
            ],
            [
                21573,
                21614
            ],
            [
                21624,
                21639
            ],
            [
                21656,
                21693
            ],
            [
                21693,
                21761
            ],
            [
                21775,
                21816
            ],
            [
                21911,
                21943
            ],
            [
                21944,
                21952
            ],
            [
                21957,
                22018
            ],
            [
                22038,
                22040
            ],
            [
                22040,
                22055
            ],
            [
                22055,
                22092
            ],
            [
                22113,
                22142
            ],
            [
                22144,
                22222
            ],
            [
                22230,
                22233
            ],
            [
                22244,
                22247
            ],
            [
                22247,
                22259
            ],
            [
                22259,
                22276
            ],
            [
                22276,
                22283
            ],
            [
                22299,
                22377
            ],
            [
                22377,
                22426
            ],
            [
                22436,
                22438
            ],
            [
                22438,
                22440
            ],
            [
                22442,
                22463
            ],
            [
                22463,
                22504
            ],
            [
                22517,
                22518
            ],
            [
                22519,
                22581
            ],
            [
                22581,
                22603
            ],
            [
                22603,
                22618
            ],
            [
                22627,
                22688
            ],
            [
                22699,
                22730
            ],
            [
                22748,
                22766
            ],
            [
                22774,
                22799
            ],
            [
                22799,
                22856
            ],
            [
                22869,
                22953
            ],
            [
                23004,
                23005
            ],
            [
                23006,
                23040
            ],
            [
                23040,
                23057
            ],
            [
                23057,
                23064
            ],
            [
                23106,
                23116
            ],
            [
                23091,
                23097
            ],
            [
                23079,
                23087
            ],
            [
                23120,
                23122
            ],
            [
                23122,
                23145
            ],
            [
                23147,
                23208
            ],
            [
                23208,
                23278
            ],
            [
                23278,
                23332
            ],
            [
                23352,
                23370
            ],
            [
                23350,
                23351
            ],
            [
                23336,
                23342
            ],
            [
                23410,
                23448
            ],
            [
                23482,
                23488
            ],
            [
                23498,
                23521
            ],
            [
                23522,
                23556
            ],
            [
                23585,
                23607
            ],
            [
                23607,
                23613
            ],
            [
                23617,
                23635
            ],
            [
                23647,
                23672
            ],
            [
                23672,
                23673
            ],
            [
                23679,
                23697
            ],
            [
                23701,
                23702
            ],
            [
                23725,
                23739
            ],
            [
                23739,
                23759
            ],
            [
                23779,
                23872
            ],
            [
                23885,
                23906
            ],
            [
                23906,
                23941
            ],
            [
                23941,
                23967
            ],
            [
                23982,
                24015
            ],
            [
                24015,
                24044
            ],
            [
                24044,
                24082
            ],
            [
                24102,
                24105
            ],
            [
                24115,
                24119
            ],
            [
                24161,
                24228
            ],
            [
                24229,
                24272
            ],
            [
                24285,
                24329
            ],
            [
                24339,
                24360
            ],
            [
                24360,
                24372
            ],
            [
                24382,
                24435
            ],
            [
                24443,
                24468
            ],
            [
                24579,
                24581
            ],
            [
                24581,
                24627
            ],
            [
                24633,
                24665
            ],
            [
                24706,
                24716
            ],
            [
                24731,
                24760
            ],
            [
                24766,
                24811
            ],
            [
                24812,
                24813
            ],
            [
                24818,
                24838
            ],
            [
                24849,
                24851
            ],
            [
                24851,
                24888
            ],
            [
                24895,
                24900
            ],
            [
                24900,
                24912
            ],
            [
                24914,
                24953
            ],
            [
                24953,
                24986
            ],
            [
                24986,
                24998
            ],
            [
                25006,
                25022
            ],
            [
                25022,
                25123
            ],
            [
                25135,
                25154
            ],
            [
                25164,
                25207
            ],
            [
                25207,
                25318
            ],
            [
                25318,
                25342
            ],
            [
                25342,
                25368
            ],
            [
                25368,
                25382
            ],
            [
                25382,
                25458
            ],
            [
                25465,
                25498
            ],
            [
                25503,
                25509
            ],
            [
                25511,
                25528
            ],
            [
                25540,
                25574
            ],
            [
                25586,
                25601
            ],
            [
                25609,
                25619
            ],
            [
                25630,
                25646
            ],
            [
                25726,
                25728
            ],
            [
                25728,
                25750
            ],
            [
                25750,
                25777
            ],
            [
                25777,
                25836
            ],
            [
                25836,
                25837
            ],
            [
                25842,
                25845
            ],
            [
                25863,
                25890
            ],
            [
                25890,
                25937
            ],
            [
                25951,
                26011
            ],
            [
                26020,
                26035
            ],
            [
                26035,
                26036
            ],
            [
                26051,
                26080
            ],
            [
                26080,
                26144
            ],
            [
                26316,
                26403
            ],
            [
                26514,
                26539
            ],
            [
                26539,
                26563
            ],
            [
                26568,
                26591
            ],
            [
                26603,
                26606
            ],
            [
                26644,
                26653
            ],
            [
                26667,
                26683
            ],
            [
                26701,
                26704
            ],
            [
                26685,
                26699
            ],
            [
                26724,
                26743
            ],
            [
                26781,
                26794
            ],
            [
                26798,
                26815
            ],
            [
                26847,
                26914
            ],
            [
                26815,
                26816
            ],
            [
                26916,
                26926
            ],
            [
                26945,
                26978
            ],
            [
                27026,
                27028
            ],
            [
                27028,
                27072
            ],
            [
                27091,
                27097
            ],
            [
                27113,
                27114
            ],
            [
                27101,
                27112
            ],
            [
                27115,
                27127
            ],
            [
                27149,
                27200
            ],
            [
                27209,
                27231
            ],
            [
                27231,
                27292
            ],
            [
                27299,
                27343
            ],
            [
                27343,
                27365
            ],
            [
                27365,
                27391
            ],
            [
                27391,
                27419
            ],
            [
                27419,
                27447
            ],
            [
                27447,
                27463
            ],
            [
                27476,
                27528
            ],
            [
                27530,
                27572
            ],
            [
                27572,
                27575
            ],
            [
                27639,
                27651
            ],
            [
                27668,
                27729
            ],
            [
                27744,
                27746
            ],
            [
                27746,
                27789
            ],
            [
                27801,
                27848
            ],
            [
                27857,
                27878
            ],
            [
                27880,
                27883
            ],
            [
                27902,
                27916
            ],
            [
                27916,
                28020
            ],
            [
                28039,
                28076
            ],
            [
                28076,
                28201
            ],
            [
                28252,
                28253
            ],
            [
                28260,
                28353
            ],
            [
                28389,
                28392
            ],
            [
                28392,
                28421
            ],
            [
                28427,
                28434
            ],
            [
                28490,
                28566
            ],
            [
                28478,
                28479
            ],
            [
                28568,
                28596
            ],
            [
                28644,
                28647
            ],
            [
                28598,
                28622
            ],
            [
                28727,
                28818
            ]
        ],
        "row_chars": [
            [
                0,
                445
            ],
            [
                445,
                588
            ],
            [
                588,
                607
            ],
            [
                607,
                646
            ],
            [
                646,
                745
            ],
            [
                745,
                1555
            ],
            [
                1555,
                2006
            ],
            [
                2006,
                2197
            ],
            [
                2197,
                2252
            ],
            [
                2252,
                2372
            ],
            [
                2372,
                2462
            ],
            [
                2462,
                2610
            ],
            [
                2610,
                2713
            ],
            [
                2713,
                2864
            ],
            [
                2864,
                3023
            ],
            [
                3023,
                3234
            ],
            [
                3234,
                3325
            ],
            [
                3325,
                3354
            ],
            [
                3354,
                3379
            ],
            [
                3379,
                3896
            ],
            [
                3896,
                4329
            ],
            [
                4329,
                4445
            ],
            [
                4445,
                4642
            ],
            [
                4642,
                4746
            ],
            [
                4746,
                4770
            ],
            [
                4770,
                4835
            ],
            [
                4835,
                4886
            ],
            [
                4886,
                4959
            ],
            [
                4959,
                5046
            ],
            [
                5046,
                5106
            ],
            [
                5106,
                5407
            ],
            [
                5407,
                5448
            ],
            [
                5448,
                5718
            ],
            [
                5718,
                5792
            ],
            [
                5792,
                5847
            ],
            [
                5847,
                6039
            ],
            [
                6039,
                6081
            ],
            [
                6081,
                6129
            ],
            [
                6129,
                6220
            ],
            [
                6220,
                6453
            ],
            [
                6453,
                6525
            ],
            [
                6525,
                6570
            ],
            [
                6570,
                6797
            ],
            [
                6797,
                7126
            ],
            [
                7126,
                8159
            ],
            [
                8159,
                8551
            ],
            [
                8551,
                8640
            ],
            [
                8640,
                8851
            ],
            [
                8851,
                9002
            ],
            [
                9002,
                9059
            ],
            [
                9059,
                9077
            ],
            [
                9077,
                9288
            ],
            [
                9288,
                9655
            ],
            [
                9655,
                10033
            ],
            [
                10033,
                10067
            ],
            [
                10067,
                10081
            ],
            [
                10081,
                10095
            ],
            [
                10095,
                10400
            ],
            [
                10400,
                10555
            ],
            [
                10555,
                10802
            ],
            [
                10802,
                10829
            ],
            [
                10829,
                10964
            ],
            [
                10964,
                11044
            ],
            [
                11044,
                11251
            ],
            [
                11251,
                11432
            ],
            [
                11432,
                11552
            ],
            [
                11552,
                11621
            ],
            [
                11621,
                11763
            ],
            [
                11763,
                11856
            ],
            [
                11856,
                11878
            ],
            [
                11878,
                11937
            ],
            [
                11937,
                11998
            ],
            [
                11998,
                12083
            ],
            [
                12083,
                12418
            ],
            [
                12418,
                13132
            ],
            [
                13132,
                13150
            ],
            [
                13150,
                13338
            ],
            [
                13338,
                13434
            ],
            [
                13434,
                13555
            ],
            [
                13555,
                13609
            ],
            [
                13609,
                13641
            ],
            [
                13641,
                13818
            ],
            [
                13818,
                14116
            ],
            [
                14116,
                14137
            ],
            [
                14137,
                14320
            ],
            [
                14320,
                14335
            ],
            [
                14335,
                14365
            ],
            [
                14365,
                14561
            ],
            [
                14561,
                14740
            ],
            [
                14740,
                14817
            ],
            [
                14817,
                14829
            ],
            [
                14829,
                14958
            ],
            [
                14958,
                15197
            ],
            [
                15197,
                15467
            ],
            [
                15467,
                15638
            ],
            [
                15638,
                15763
            ],
            [
                15763,
                15809
            ],
            [
                15809,
                15897
            ],
            [
                15897,
                15925
            ],
            [
                15925,
                15953
            ],
            [
                15953,
                16210
            ],
            [
                16210,
                16240
            ],
            [
                16240,
                16289
            ],
            [
                16289,
                16368
            ],
            [
                16368,
                16474
            ],
            [
                16474,
                16556
            ],
            [
                16556,
                16574
            ],
            [
                16574,
                16719
            ],
            [
                16719,
                17157
            ],
            [
                17157,
                17245
            ],
            [
                17245,
                17377
            ],
            [
                17377,
                17572
            ],
            [
                17572,
                17692
            ],
            [
                17692,
                17739
            ],
            [
                17739,
                17813
            ],
            [
                17813,
                18009
            ],
            [
                18009,
                18018
            ],
            [
                18018,
                18041
            ],
            [
                18041,
                18091
            ],
            [
                18091,
                18108
            ],
            [
                18108,
                18219
            ],
            [
                18219,
                18244
            ],
            [
                18244,
                18266
            ],
            [
                18266,
                18316
            ],
            [
                18316,
                18349
            ],
            [
                18349,
                18410
            ],
            [
                18410,
                18423
            ],
            [
                18423,
                18520
            ],
            [
                18520,
                18570
            ],
            [
                18570,
                18592
            ],
            [
                18592,
                18616
            ],
            [
                18616,
                18663
            ],
            [
                18663,
                18765
            ],
            [
                18765,
                19006
            ],
            [
                19006,
                19048
            ],
            [
                19048,
                19074
            ],
            [
                19074,
                19359
            ],
            [
                19359,
                19391
            ],
            [
                19391,
                19405
            ],
            [
                19405,
                19420
            ],
            [
                19420,
                19524
            ],
            [
                19524,
                19547
            ],
            [
                19547,
                19730
            ],
            [
                19730,
                19927
            ],
            [
                19927,
                19953
            ],
            [
                19953,
                20074
            ],
            [
                20074,
                20175
            ],
            [
                20175,
                20243
            ],
            [
                20243,
                20298
            ],
            [
                20298,
                20377
            ],
            [
                20377,
                20463
            ],
            [
                20463,
                20569
            ],
            [
                20569,
                20645
            ],
            [
                20645,
                20710
            ],
            [
                20710,
                20783
            ],
            [
                20783,
                20790
            ],
            [
                20790,
                21000
            ],
            [
                21000,
                21150
            ],
            [
                21150,
                21471
            ],
            [
                21471,
                21693
            ],
            [
                21693,
                22040
            ],
            [
                22040,
                22055
            ],
            [
                22055,
                22247
            ],
            [
                22247,
                22259
            ],
            [
                22259,
                22276
            ],
            [
                22276,
                22283
            ],
            [
                22283,
                22291
            ],
            [
                22291,
                22377
            ],
            [
                22377,
                22438
            ],
            [
                22438,
                22463
            ],
            [
                22463,
                22519
            ],
            [
                22519,
                22581
            ],
            [
                22581,
                22603
            ],
            [
                22603,
                22799
            ],
            [
                22799,
                23006
            ],
            [
                23006,
                23040
            ],
            [
                23040,
                23057
            ],
            [
                23057,
                23122
            ],
            [
                23122,
                23145
            ],
            [
                23145,
                23208
            ],
            [
                23208,
                23278
            ],
            [
                23278,
                23332
            ],
            [
                23332,
                23522
            ],
            [
                23522,
                23607
            ],
            [
                23607,
                23613
            ],
            [
                23613,
                23672
            ],
            [
                23672,
                23701
            ],
            [
                23701,
                23739
            ],
            [
                23739,
                23759
            ],
            [
                23759,
                23779
            ],
            [
                23779,
                23906
            ],
            [
                23906,
                23941
            ],
            [
                23941,
                24015
            ],
            [
                24015,
                24044
            ],
            [
                24044,
                24360
            ],
            [
                24360,
                24581
            ],
            [
                24581,
                24812
            ],
            [
                24812,
                24851
            ],
            [
                24851,
                24889
            ],
            [
                24889,
                24900
            ],
            [
                24900,
                24953
            ],
            [
                24953,
                24986
            ],
            [
                24986,
                25022
            ],
            [
                25022,
                25207
            ],
            [
                25207,
                25318
            ],
            [
                25318,
                25342
            ],
            [
                25342,
                25368
            ],
            [
                25368,
                25382
            ],
            [
                25382,
                25574
            ],
            [
                25574,
                25728
            ],
            [
                25728,
                25750
            ],
            [
                25750,
                25777
            ],
            [
                25777,
                25836
            ],
            [
                25836,
                25890
            ],
            [
                25890,
                26035
            ],
            [
                26035,
                26080
            ],
            [
                26080,
                26144
            ],
            [
                26144,
                26212
            ],
            [
                26212,
                26316
            ],
            [
                26316,
                26539
            ],
            [
                26539,
                26794
            ],
            [
                26794,
                27028
            ],
            [
                27028,
                27231
            ],
            [
                27231,
                27343
            ],
            [
                27343,
                27365
            ],
            [
                27365,
                27391
            ],
            [
                27391,
                27419
            ],
            [
                27419,
                27447
            ],
            [
                27447,
                27528
            ],
            [
                27528,
                27572
            ],
            [
                27572,
                27746
            ],
            [
                27746,
                27916
            ],
            [
                27916,
                28076
            ],
            [
                28076,
                28392
            ],
            [
                28392,
                28818
            ]
        ]
    },
    "abridged": {
        "text": "I know that the tune I am piping is a very mild one (although there are some terrific chapters coming presently), and I must beg the good-natured reader to remember that we are only talking about a stockbroker's family in Russell Square, who are taking walks, or lunch, as people do in ordinary life, without a single wonderful incident to mark the progress of their loves. So far, Osborne, in love with Amelia, has asked an old friend to Vauxhall. Jos Sedley is in love with Rebecca. Will he marry her? That is the great subject now in hand.\nSuppose we had laid the scene in Grosvenor Square, and had shown how Lord Joseph Sedley fell in love, and the Marquis of Osborne became attached to Lady Amelia, with the full consent of the Duke, her noble father: or instead, suppose we had resorted to the entirely low, and described what was going on in Mr. Sedley's kitchen - how black Sambo was in love with the cook (as indeed he was), and how he fought a battle with the coachman over her, and how the knife-boy was caught stealing a shoulder of mutton. Such incidents might provoke much delightful laughter, and be supposed to represent scenes of \"life.\" Or if we had made a professional burglar burst into the house, slaughter black Sambo, and carry off Amelia in her night-dress, not to be rescued till the third volume, we would have our readers panting through the fiery chapters of such a thrilling tale.\nBut my readers must be content with a homely story, and a chapter about Vauxhall which is so short that it scarce deserves to be called a chapter at all. And yet it is a very important one. Are there not little chapters in everybody's life that seem to be nothing, and yet affect all the rest of their history?\nLet us then step into the coach with the Russell Square party, and be off to Vauxhall Gardens. Jos and Miss Sharp are on the front seat, with Mr. Osborne sitting opposite, between Captain Dobbin and Amelia.\nEvery soul in the coach agreed that on that night Jos would propose to Rebecca Sharp. The parents at home had acquiesced, though old Mr. Sedley had a feeling close to contempt for his son. He said he was vain, selfish, lazy, and effeminate, and laughed at his pompous bragging stories.\n\"I shall leave the fellow half my property,\" he said; \"but I am perfectly sure that if you, I and his sister were to die tomorrow, he would say 'Good Gad!' and eat his dinner just as usual. Let him marry whom he likes. It's no affair of mine.\"\nAmelia, on the other hand, was quite enthusiastic for the match, and in a flutter of excitement. She did not speak with Rebecca on the subject, but had long conversations with Mrs. Blenkinsop the housekeeper, who dropped some hints to the lady's-maid, who may have mentioned the matter to the cook, who carried the news to all the tradesmen, so that Mr. Jos's marriage was now talked of by a large number of persons.\nEverything seemed to smile upon Rebecca's fortunes. She took Jos's arm on going to dinner; she sat by him on the box of his open carriage; and though nobody said a word about marriage, everybody seemed to understand it. All she wanted was the proposal. Ah! how Rebecca now felt the lack of a mother! - who would have managed the business in ten minutes, and, with a little delicate conversation, would have extracted the avowal from the young man's bashful lips!\nSuch was the state of affairs as the carriage crossed Westminster bridge.\nThey arrived at the Royal Gardens. As the majestic Jos stepped out of the creaking vehicle, the crowd gave a cheer for the fat gentleman, who blushed as he walked away with Rebecca under his arm. George, of course, took charge of Amelia.\n\"I say, Dobbin,\" said George, \"just look after the shawls and things, there's a good fellow.\" And so while he paired off with Miss Sedley, and Jos squeezed through the gate into the gardens with Rebecca, honest Dobbin contented himself by carrying the shawls, and paying at the door for the whole party.\nHe walked modestly behind them, unwilling to be a spoil-sport. About Rebecca and Jos he did not care a fig. But he thought Amelia worthy even of the brilliant George Osborne, and as he saw the girl's delight and wonder, he watched her artless happiness with a sort of fatherly pleasure. Perhaps he felt that he would have liked to have someone on his own arm rather than a shawl; but William Dobbin was not selfish; and so long as his friend was enjoying himself, how should he be discontented?\nAnd the truth is, that of all the delights of the Gardens - of the hundred thousand lamps, the fiddlers, the singers, the country dances, with their jumping, thumping and laughter; the signal which announced that Madame Saqui was about to mount on a slack-rope ascending to the stars; the hermit that sat in the illuminated hermitage; the dark walks, so favourable to young lovers - Captain William Dobbin did not take the slightest notice.\nHe carried about Amelia's white cashmere shawl, and having listened to Mrs. Salmon perform the Battle of Borodino (a savage cantata against Napoleon), Dobbin tried to hum it as he walked away, and found he was humming the tune which Amelia Sedley sang as she came down to dinner. He burst out laughing at himself; for he could sing no better than an owl.\nOur two young couples made solemn promises to keep together during the evening, and separated ten minutes later. Parties at Vauxhall always did separate, to meet again at supper-time, when they could talk of their adventures.\nWhat were the adventures of Mr. Osborne and Miss Amelia? That is a secret. But be sure that they were perfectly happy, and correct in their behaviour; and as they had been in the habit of being together any time these fifteen years, their tete-a-tete offered no particular novelty.\nBut when Miss Rebecca Sharp and her stout companion lost themselves in a solitary path, in which there were no more than a hundred other couples, they both felt that the situation was extremely critical. Now or never was the moment, Miss Sharp thought, for Mr Sedley's declaration. They had previously been to the panorama of Moscow, where a fellow treading on Miss Sharp's foot caused her to fall back with a little shriek into Mr. Sedley's arms. This incident increased his confidence so much that he told her several of his favourite Indian stories all over again.\n\"How I should like to see India!\" said Rebecca.\n\"Should you?\" said Joseph tenderly; and was no doubt about to follow up this question with one still more tender - when, oh, provoking! the bell rang for the fireworks, and a great scuffling and running took place. The lovers were obliged to follow the stream of people.\nCaptain Dobbin had thought of joining the party at supper - but he walked twice in front of the box where the couples met, and nobody noticed him. Covers were laid for four. The mated pairs were prattling away quite happily, and Dobbin knew he was clean forgotten.\n\"I should only be de trop,\" said the Captain rather wistfully. \"I'd best go and talk to the hermit.\" So he strolled out of the noise and clatter of the banquet, into the dark walk, at the end of which lived that pasteboard Solitary. It wasn't very good fun for Dobbin - indeed, to be alone at Vauxhall is dismal sport for a bachelor.\nThe two couples were perfectly happy in their box. Jos was in his glory, ordering about the waiters with great majesty. He made the salad; uncorked the Champagne; carved the chickens; and ate and drank the greater part of the refreshments. Finally, he insisted upon having a bowl of rack punch; everybody had rack punch at Vauxhall.\nThat bowl of rack punch was the cause of all this history. And why not? Was not a bowl of wine the cause of the demise of Alexander the Great? So rack punch influenced the fates of all the chief characters in this \"Novel without a Hero,\" although most of them did not taste a drop of it.\nThe young ladies did not drink it; Osborne did not like it; and so Jos drank up the whole contents of the bowl. The consequence of this was a liveliness which at first was astonishing, and then became painful; for he talked and laughed so loud as to bring scores of listeners round the box, much to the confusion of the group within it. Volunteering to sing a song (which he did in that maudlin high key peculiar to inebriated gentlemen), he received from his hearers a great deal of applause.\n\"Brayvo, Fat un!\" said one wag; \"What a figure for the tight-rope!\" exclaimed another, to the alarm of the ladies, and the anger of Mr. Osborne.\n\"For Heaven's sake, Jos, let us go,\" he cried, and the young women rose.\n\"Stop, my dearest diddle-diddle-darling,\" shouted Jos, now as bold as a lion, clasping Miss Rebecca round the waist. Rebecca started, but she could not get away. The laughter redoubled. Jos continued to drink, to make love, and to sing; and, winking and waving his glass gracefully to his audience, challenged them to take a share of his punch.\nMr. Osborne was just on the point of knocking down a gentleman who proposed to accept this invitation, and a commotion seemed to be inevitable, when by the greatest good luck Dobbin stepped up to the box.\n\"Be off, you fools!\" he said. The crowd vanished before his cocked hat and fierce appearance.\n\"Good Heavens! Dobbin, where have you been?\" Osborne said, seizing the white shawl from his friend's arm, and huddling Amelia in it. \"Make yourself useful, and take charge of Jos here, whilst I take the ladies to the carriage.\"\nJos was rising to interfere - but a push from Osborne's finger sent him puffing back into his seat again, and the lieutenant was able to remove the ladies in safety. Jos kissed his hand to them as they retreated, hiccupping, \"Bless you! Bless you!\" Then, seizing Captain Dobbin's hand, and weeping pitifully, he confided the secret of his love. He adored that girl who had just gone; he had broken her heart by his conduct; he would marry her next morning at St. George's, Hanover Square; he'd knock up the Archbishop of Canterbury at Lambeth, by Jove! for the purpose.\nCaptain Dobbin shrewdly persuaded him to leave the gardens in order to hasten to Lambeth Palace. Once out of the gates, he easily got Jos into a hackney-coach, which took him to his lodgings.\nGeorge Osborne took the girls home: and laughed after he had closed the door upon them. Amelia looked ruefully at her friend as they went upstairs. They kissed and went to bed without talking.\n\"He must propose tomorrow,\" thought Rebecca. \"He called me his soul's darling four times; he squeezed my hand in Amelia's presence. He must propose tomorrow.\" And so thought Amelia, too. And I dare say she thought of the dress she would wear as bridesmaid, and of a subsequent ceremony in which she herself might be the bride.\nOh, ignorant young creatures! How little do you know the effect of rack punch! There is no headache in the world like that caused by Vauxhall punch. Through the lapse of twenty years, I can remember the consequence of two glasses! and Joseph Sedley had swallowed at least a quart.\nNext morning, which Rebecca thought was to dawn upon her fortune, George Osborne found the ex-Collector of Boggley Wollah in agonies, groaning on the sofa at his lodgings. Dobbin was already in the room, good-naturedly tending his patient. The two officers looked askance at each other, exchanging sympathetic grins. Even Sedley's solemn valet could hardly keep his face in order.\n\"Mr. Sedley was uncommon wild last night, sir,\" he whispered to Osborne. \"He wanted to fight the 'ackney-coachman, sir. The Capting had to bring him upstairs in his arms like a babby.\"\n\"How are you, Sedley?\" Osborne asked. \"No bones broke? There's a hackney-coachman downstairs with a black eye, vowing he'll have the law on you.\"\n\"What do you mean?\" Sedley faintly asked.\n\"For thrashing him last night - didn't he, Dobbin? The watchman says he never saw a fellow go down so straight. Ask Dobbin.\"\n\"You did have a round with the coachman,\" Captain Dobbin said, \"and showed plenty of fight too.\"\n\"And that fellow at Vauxhall! How Jos drove at him! How the women screamed! By Jove, sir, it did my heart good to see you. I'll never get in your way when you are in your cups, Jos.\"\n\"I believe I'm very terrible when I'm roused,\" said Jos from the sofa, with a dreary grimace.\nOsborne pursued his advantage pitilessly. He thought Jos a milksop. He had been revolving in his mind the question of marriage between Jos and Rebecca, and was not pleased that a member of a family into which he, George Osborne, was going to marry, should make a msalliance with a little upstart governess.\n\"Why, man, you couldn't stand!\" he said. \"You made everybody laugh, though you were crying yourself. You were maudlin, Jos. Don't you remember singing a song, and calling Rosa, Rebecca, what's her name, your dearest diddle-diddle-darling?\"\nAnd this ruthless young fellow, seizing Dobbin's hand, acted out the scene, to Joseph's horror, and in spite of Dobbin's good-natured entreaties to have mercy.\n\"Why should I spare him?\" Osborne said to his friend, when they quitted the invalid, leaving him under the hands of Doctor Gollop. \"What the deuce right has he to give himself airs, and make fools of us at Vauxhall? Who's this schoolgirl that is ogling him? Hang it, the family's low enough already, without her. I'd rather have a lady for my sister-in-law. I know my own station: let her know hers. And I'll prevent that Nabob from being made a greater fool than he is. That's why I told him to look out, lest she brought an action against him.\"\n\"I suppose you know best,\" Dobbin said, though rather dubiously. \"But-\"\n\"Come and see the girls, and make love to Miss Sharp yourself,\" the lieutenant interrupted; but Captain Dobbin declined.\nAs George walked down Southampton Row to the Sedley mansion, he laughed as he saw two heads on the look-out.\nMiss Amelia, in the drawing-room balcony, was looking very eagerly towards the other side of the Square, on the watch for him; and Miss Sharp was observing from the second floor until Mr. Joseph's great form should heave in sight.\n\"Sister Anne is on the watch-tower,\" said he to Amelia on entering, \"but there's nobody coming.\" Enjoying the joke hugely, he described in ludicrous terms the dismal condition of her brother.\n\"I think it's very cruel of you to laugh, George,\" she said, looking unhappy; but George only laughed the more. When Miss Sharp came downstairs, he bantered with a great deal of liveliness upon the effect of her charms.\n\"O Miss Sharp! if you could but see him this morning, moaning in his flowered dressing-gown - writhing on his sofa; if you could but have seen him lolling out his tongue to the doctor.\"\n\"See whom?\" said Miss Sharp.\n\"Whom? O Captain Dobbin, of course, to whom we were all so attentive, by the way, last night.\"\n\"We were very unkind to him,\" Emmy said, blushing. \"I - I quite forgot him.\"\n\"Of course you did,\" cried Osborne, still laughing. \"One can't be always thinking about Dobbin, you know, Amelia. Can one, Miss Sharp?\"\n\"Except when he overturned the glass of wine at dinner,\" Miss Sharp said, with a haughty toss of the head, \"I never gave Captain Dobbin one moment's consideration.\"\n\"Very good, Miss Sharp, I'll tell him,\" Osborne said; and Miss Sharp began to have a feeling of distrust and hatred towards this young officer.\n\"He is to make fun of me, is he?\" thought Rebecca. \"Has he frightened Joseph about me? Perhaps he won't come.\" A film passed over her eyes, and her heart beat quite quick.\n\"You're always joking,\" said she, smiling as innocently as she could. \"Joke away, Mr. George; there's nobody to defend me.\" As she walked away, George felt some little manly compunction for being unkind to this helpless creature.\n\"My dearest Amelia,\" said he, \"You don't know the world. I do. Your little friend must learn her station.\"\n\"Do you think Jos will-\"\n\"I don't know. He may, or may not. I only know he is a very foolish vain fellow, and put my dear little girl into a very painful position last night. My dearest diddle-diddle-darling!\" He was off laughing again, so drolly that Emmy laughed too.\nAll that day Jos never came. But Amelia had no fear about this; for she had sent a servant to Mr. Joseph's lodgings, to ask for some book he had promised, and see how he was; and the reply through Jos's man was, that his master was ill in bed, and had the doctor with him. He must come tomorrow, she thought, but she never had the courage to speak on the subject to Rebecca.\nThe next day, however, as the two young ladies sat on the sofa, pretending to work, Sambo came in with his usual engaging grin, a packet under his arm, and a note on a tray.\n\"From Mr. Jos, Miss,\" he said.\nHow Amelia trembled as she opened it! The note ran:\nDear Amelia,\nI send you the \"Orphan of the Forest.\" I was too ill to come yesterday. I leave town today for Cheltenham. Pray excuse me, if you can, to the amiable Miss Sharp, for my conduct at Vauxhall, and entreat her to forget every word I uttered when excited by that fatal supper. As soon as I have recovered, for my health is very much shaken, I shall go to Scotland for some months, and am\nTruly yours, Jos Sedley\nIt was the death-warrant. All was over. Amelia did not dare to look at Rebecca's pale face and burning eyes, but she dropped the letter into her friend's lap; got up and went upstairs, and cried her little heart out.\nThe housekeeper sought her with consolation. \"Don't take on, Miss. I didn't like to tell you. But none of us in the house have liked her except at fust. I saw her reading your Ma's letters. Pinner says she's always about your trinket-box and everybody's drawers, and she's sure she's put your white ribbon into her box.\"\n\"I gave it her,\" Amelia said.\nBut this did not alter Mrs. Blenkinsop's opinion of Miss Sharp. It now became clear to every soul in the house, except poor Amelia, that Rebecca should depart as speedily as possible. Our good child ransacked her drawers, cupboards, and bags - reviewed her gowns, bobbins, laces and silk stockings - selecting this thing and that for Rebecca. Going to her Papa, who had promised to give her as many guineas as she was years old, she begged him to give the money to dear Rebecca.\nShe even made George Osborne contribute, and since he was a free-handed young fellow, he went to Bond Street, and bought the best hat and coat that money could buy.\n\"That's George's present to you, Rebecca, dear,\" said Amelia, proud of the bandbox conveying these gifts. \"What a taste he has! There's nobody like him.\"\n\"Nobody,\" Rebecca answered. \"How thankful I am to him!\" She was thinking, \"It was George Osborne who prevented my marriage.\" And she loved George Osborne accordingly.\nShe accepted all Amelia's presents, after just the proper degree of hesitation. She vowed eternal gratitude to Mrs. Sedley, but did not intrude herself upon that good lady, who was embarrassed and wished to avoid her. She kissed Mr. Sedley's hand, when he presented her with the purse; and asked permission to consider him her kind, kind friend and protector. Her behaviour was so affecting that he was going to write her a cheque for twenty pounds more; but he restrained his feelings, and tripped away with a \"God bless you, my dear, always come here when you come to town, you know.\"\nFinally came the parting with Amelia, a scene in which one person was in earnest and the other a perfect performer. After the tenderest caresses and the most pathetic tears, Rebecca and Amelia parted, the former vowing to love her friend for ever and ever and ever.",
        "paragraph_chars": [
            [
                0,
                543
            ],
            [
                543,
                1410
            ],
            [
                1410,
                1721
            ],
            [
                1721,
                1928
            ],
            [
                1928,
                2214
            ],
            [
                2214,
                2458
            ],
            [
                2458,
                2875
            ],
            [
                2875,
                3338
            ],
            [
                3338,
                3412
            ],
            [
                3412,
                3650
            ],
            [
                3650,
                3954
            ],
            [
                3954,
                4449
            ],
            [
                4449,
                4890
            ],
            [
                4890,
                5245
            ],
            [
                5245,
                5471
            ],
            [
                5471,
                5753
            ],
            [
                5753,
                6321
            ],
            [
                6321,
                6369
            ],
            [
                6369,
                6640
            ],
            [
                6640,
                6905
            ],
            [
                6905,
                7239
            ],
            [
                7239,
                7572
            ],
            [
                7572,
                7860
            ],
            [
                7860,
                8354
            ],
            [
                8354,
                8499
            ],
            [
                8499,
                8572
            ],
            [
                8572,
                8917
            ],
            [
                8917,
                9122
            ],
            [
                9122,
                9216
            ],
            [
                9216,
                9444
            ],
            [
                9444,
                10014
            ],
            [
                10014,
                10206
            ],
            [
                10206,
                10399
            ],
            [
                10399,
                10726
            ],
            [
                10726,
                11007
            ],
            [
                11007,
                11388
            ],
            [
                11388,
                11573
            ],
            [
                11573,
                11719
            ],
            [
                11719,
                11761
            ],
            [
                11761,
                11886
            ],
            [
                11886,
                11983
            ],
            [
                11983,
                12166
            ],
            [
                12166,
                12260
            ],
            [
                12260,
                12567
            ],
            [
                12567,
                12807
            ],
            [
                12807,
                12967
            ],
            [
                12967,
                13514
            ],
            [
                13514,
                13586
            ],
            [
                13586,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                14047
            ],
            [
                14047,
                14239
            ],
            [
                14239,
                14459
            ],
            [
                14459,
                14645
            ],
            [
                14645,
                14674
            ],
            [
                14674,
                14769
            ],
            [
                14769,
                14846
            ],
            [
                14846,
                14982
            ],
            [
                14982,
                15147
            ],
            [
                15147,
                15291
            ],
            [
                15291,
                15463
            ],
            [
                15463,
                15693
            ],
            [
                15693,
                15800
            ],
            [
                15800,
                15825
            ],
            [
                15825,
                16070
            ],
            [
                16070,
                16445
            ],
            [
                16445,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16702
            ],
            [
                16702,
                16715
            ],
            [
                16715,
                17098
            ],
            [
                17098,
                17122
            ],
            [
                17122,
                17339
            ],
            [
                17339,
                17660
            ],
            [
                17660,
                17690
            ],
            [
                17690,
                18169
            ],
            [
                18169,
                18334
            ],
            [
                18334,
                18488
            ],
            [
                18488,
                18655
            ],
            [
                18655,
                19242
            ],
            [
                19242,
                19507
            ]
        ],
        "segment_chars": [
            [
                0,
                374
            ],
            [
                374,
                449
            ],
            [
                449,
                485
            ],
            [
                485,
                504
            ],
            [
                504,
                543
            ],
            [
                543,
                1053
            ],
            [
                1053,
                1155
            ],
            [
                1155,
                1410
            ],
            [
                1410,
                1564
            ],
            [
                1564,
                1600
            ],
            [
                1600,
                1721
            ],
            [
                1721,
                1816
            ],
            [
                1816,
                1928
            ],
            [
                1928,
                2014
            ],
            [
                2014,
                2117
            ],
            [
                2117,
                2214
            ],
            [
                2214,
                2370
            ],
            [
                2370,
                2404
            ],
            [
                2404,
                2433
            ],
            [
                2433,
                2458
            ],
            [
                2458,
                2555
            ],
            [
                2555,
                2875
            ],
            [
                2875,
                2927
            ],
            [
                2927,
                3095
            ],
            [
                3095,
                3128
            ],
            [
                3128,
                3132
            ],
            [
                3132,
                3175
            ],
            [
                3175,
                3338
            ],
            [
                3338,
                3412
            ],
            [
                3412,
                3447
            ],
            [
                3447,
                3608
            ],
            [
                3608,
                3650
            ],
            [
                3650,
                3744
            ],
            [
                3744,
                3954
            ],
            [
                3954,
                4017
            ],
            [
                4017,
                4062
            ],
            [
                4062,
                4241
            ],
            [
                4241,
                4449
            ],
            [
                4449,
                4890
            ],
            [
                4890,
                5170
            ],
            [
                5170,
                5245
            ],
            [
                5245,
                5358
            ],
            [
                5358,
                5471
            ],
            [
                5471,
                5528
            ],
            [
                5528,
                5546
            ],
            [
                5546,
                5753
            ],
            [
                5753,
                5957
            ],
            [
                5957,
                6035
            ],
            [
                6035,
                6201
            ],
            [
                6201,
                6321
            ],
            [
                6321,
                6355
            ],
            [
                6355,
                6369
            ],
            [
                6369,
                6383
            ],
            [
                6383,
                6505
            ],
            [
                6505,
                6584
            ],
            [
                6584,
                6640
            ],
            [
                6640,
                6787
            ],
            [
                6787,
                6814
            ],
            [
                6814,
                6905
            ],
            [
                6905,
                6968
            ],
            [
                6968,
                7006
            ],
            [
                7006,
                7138
            ],
            [
                7138,
                7239
            ],
            [
                7239,
                7290
            ],
            [
                7290,
                7359
            ],
            [
                7359,
                7479
            ],
            [
                7479,
                7572
            ],
            [
                7572,
                7631
            ],
            [
                7631,
                7644
            ],
            [
                7644,
                7715
            ],
            [
                7715,
                7860
            ],
            [
                7860,
                7972
            ],
            [
                7972,
                8197
            ],
            [
                8197,
                8354
            ],
            [
                8354,
                8372
            ],
            [
                8372,
                8422
            ],
            [
                8422,
                8499
            ],
            [
                8499,
                8572
            ],
            [
                8572,
                8689
            ],
            [
                8689,
                8734
            ],
            [
                8734,
                8758
            ],
            [
                8758,
                8917
            ],
            [
                8917,
                9122
            ],
            [
                9122,
                9143
            ],
            [
                9143,
                9152
            ],
            [
                9152,
                9216
            ],
            [
                9216,
                9231
            ],
            [
                9231,
                9261
            ],
            [
                9261,
                9349
            ],
            [
                9349,
                9444
            ],
            [
                9444,
                9610
            ],
            [
                9610,
                9681
            ],
            [
                9681,
                9693
            ],
            [
                9693,
                9789
            ],
            [
                9789,
                9997
            ],
            [
                9997,
                10014
            ],
            [
                10014,
                10111
            ],
            [
                10111,
                10206
            ],
            [
                10206,
                10294
            ],
            [
                10294,
                10354
            ],
            [
                10354,
                10399
            ],
            [
                10399,
                10444
            ],
            [
                10444,
                10531
            ],
            [
                10531,
                10558
            ],
            [
                10558,
                10586
            ],
            [
                10586,
                10726
            ],
            [
                10726,
                10756
            ],
            [
                10756,
                10805
            ],
            [
                10805,
                10875
            ],
            [
                10875,
                10957
            ],
            [
                10957,
                11007
            ],
            [
                11007,
                11179
            ],
            [
                11179,
                11247
            ],
            [
                11247,
                11324
            ],
            [
                11324,
                11388
            ],
            [
                11388,
                11461
            ],
            [
                11461,
                11508
            ],
            [
                11508,
                11573
            ],
            [
                11573,
                11596
            ],
            [
                11596,
                11611
            ],
            [
                11611,
                11628
            ],
            [
                11628,
                11719
            ],
            [
                11719,
                11739
            ],
            [
                11739,
                11761
            ],
            [
                11761,
                11812
            ],
            [
                11812,
                11873
            ],
            [
                11873,
                11886
            ],
            [
                11886,
                11983
            ],
            [
                11983,
                12013
            ],
            [
                12013,
                12035
            ],
            [
                12035,
                12059
            ],
            [
                12059,
                12106
            ],
            [
                12106,
                12166
            ],
            [
                12166,
                12260
            ],
            [
                12260,
                12302
            ],
            [
                12302,
                12328
            ],
            [
                12328,
                12567
            ],
            [
                12567,
                12599
            ],
            [
                12599,
                12608
            ],
            [
                12608,
                12668
            ],
            [
                12668,
                12691
            ],
            [
                12691,
                12807
            ],
            [
                12807,
                12967
            ],
            [
                12967,
                12993
            ],
            [
                12993,
                13098
            ],
            [
                13098,
                13183
            ],
            [
                13183,
                13225
            ],
            [
                13225,
                13280
            ],
            [
                13280,
                13325
            ],
            [
                13325,
                13367
            ],
            [
                13367,
                13438
            ],
            [
                13438,
                13514
            ],
            [
                13514,
                13579
            ],
            [
                13579,
                13586
            ],
            [
                13586,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                14047
            ],
            [
                14047,
                14144
            ],
            [
                14144,
                14239
            ],
            [
                14239,
                14351
            ],
            [
                14351,
                14459
            ],
            [
                14459,
                14474
            ],
            [
                14474,
                14645
            ],
            [
                14645,
                14657
            ],
            [
                14657,
                14674
            ],
            [
                14674,
                14681
            ],
            [
                14681,
                14769
            ],
            [
                14769,
                14820
            ],
            [
                14820,
                14846
            ],
            [
                14846,
                14898
            ],
            [
                14898,
                14960
            ],
            [
                14960,
                14982
            ],
            [
                14982,
                15147
            ],
            [
                15147,
                15291
            ],
            [
                15291,
                15325
            ],
            [
                15325,
                15342
            ],
            [
                15342,
                15378
            ],
            [
                15378,
                15402
            ],
            [
                15402,
                15463
            ],
            [
                15463,
                15533
            ],
            [
                15533,
                15587
            ],
            [
                15587,
                15693
            ],
            [
                15693,
                15750
            ],
            [
                15750,
                15756
            ],
            [
                15756,
                15800
            ],
            [
                15800,
                15825
            ],
            [
                15825,
                15840
            ],
            [
                15840,
                15860
            ],
            [
                15860,
                15975
            ],
            [
                15975,
                16010
            ],
            [
                16010,
                16070
            ],
            [
                16070,
                16099
            ],
            [
                16099,
                16343
            ],
            [
                16343,
                16445
            ],
            [
                16445,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16688
            ],
            [
                16688,
                16702
            ],
            [
                16702,
                16715
            ],
            [
                16715,
                16754
            ],
            [
                16754,
                16787
            ],
            [
                16787,
                16822
            ],
            [
                16822,
                16987
            ],
            [
                16987,
                17098
            ],
            [
                17098,
                17122
            ],
            [
                17122,
                17148
            ],
            [
                17148,
                17162
            ],
            [
                17162,
                17339
            ],
            [
                17339,
                17384
            ],
            [
                17384,
                17406
            ],
            [
                17406,
                17433
            ],
            [
                17433,
                17492
            ],
            [
                17492,
                17529
            ],
            [
                17529,
                17660
            ],
            [
                17660,
                17690
            ],
            [
                17690,
                17754
            ],
            [
                17754,
                17874
            ],
            [
                17874,
                18033
            ],
            [
                18033,
                18169
            ],
            [
                18169,
                18334
            ],
            [
                18334,
                18440
            ],
            [
                18440,
                18462
            ],
            [
                18462,
                18488
            ],
            [
                18488,
                18516
            ],
            [
                18516,
                18544
            ],
            [
                18544,
                18613
            ],
            [
                18613,
                18655
            ],
            [
                18655,
                18735
            ],
            [
                18735,
                18873
            ],
            [
                18873,
                19015
            ],
            [
                19015,
                19242
            ],
            [
                19242,
                19358
            ],
            [
                19358,
                19507
            ]
        ],
        "overlap_chars": [
            [
                0,
                117
            ],
            [
                120,
                181
            ],
            [
                182,
                189
            ],
            [
                190,
                262
            ],
            [
                268,
                269
            ],
            [
                270,
                285
            ],
            [
                295,
                300
            ],
            [
                301,
                317
            ],
            [
                318,
                374
            ],
            [
                382,
                438
            ],
            [
                439,
                447
            ],
            [
                449,
                485
            ],
            [
                485,
                504
            ],
            [
                504,
                543
            ],
            [
                543,
                593
            ],
            [
                598,
                767
            ],
            [
                767,
                869
            ],
            [
                872,
                978
            ],
            [
                984,
                987
            ],
            [
                987,
                992
            ],
            [
                993,
                1032
            ],
            [
                1033,
                1051
            ],
            [
                1053,
                1073
            ],
            [
                1074,
                1155
            ],
            [
                1155,
                1160
            ],
            [
                1161,
                1167
            ],
            [
                1168,
                1172
            ],
            [
                1173,
                1195
            ],
            [
                1202,
                1216
            ],
            [
                1216,
                1217
            ],
            [
                1228,
                1239
            ],
            [
                1239,
                1244
            ],
            [
                1251,
                1291
            ],
            [
                1300,
                1325
            ],
            [
                1332,
                1336
            ],
            [
                1349,
                1356
            ],
            [
                1357,
                1386
            ],
            [
                1392,
                1393
            ],
            [
                1394,
                1403
            ],
            [
                1404,
                1408
            ],
            [
                1408,
                1409
            ],
            [
                1410,
                1429
            ],
            [
                1430,
                1445
            ],
            [
                1446,
                1465
            ],
            [
                1466,
                1490
            ],
            [
                1491,
                1564
            ],
            [
                1564,
                1579
            ],
            [
                1580,
                1598
            ],
            [
                1598,
                1600
            ],
            [
                1600,
                1603
            ],
            [
                1604,
                1609
            ],
            [
                1610,
                1613
            ],
            [
                1614,
                1649
            ],
            [
                1650,
                1705
            ],
            [
                1712,
                1721
            ],
            [
                1721,
                1797
            ],
            [
                1807,
                1816
            ],
            [
                1816,
                1834
            ],
            [
                1835,
                1856
            ],
            [
                1856,
                1857
            ],
            [
                1863,
                1882
            ],
            [
                1883,
                1928
            ],
            [
                1928,
                1998
            ],
            [
                1999,
                2012
            ],
            [
                2012,
                2014
            ],
            [
                2014,
                2048
            ],
            [
                2048,
                2056
            ],
            [
                2057,
                2085
            ],
            [
                2092,
                2117
            ],
            [
                2117,
                2167
            ],
            [
                2167,
                2180
            ],
            [
                2181,
                2195
            ],
            [
                2205,
                2213
            ],
            [
                2214,
                2269
            ],
            [
                2269,
                2272
            ],
            [
                2273,
                2305
            ],
            [
                2306,
                2307
            ],
            [
                2308,
                2334
            ],
            [
                2343,
                2370
            ],
            [
                2370,
                2396
            ],
            [
                2397,
                2402
            ],
            [
                2402,
                2404
            ],
            [
                2404,
                2433
            ],
            [
                2433,
                2458
            ],
            [
                2458,
                2484
            ],
            [
                2485,
                2521
            ],
            [
                2521,
                2526
            ],
            [
                2527,
                2531
            ],
            [
                2532,
                2555
            ],
            [
                2555,
                2592
            ],
            [
                2593,
                2601
            ],
            [
                2610,
                2614
            ],
            [
                2615,
                2649
            ],
            [
                2650,
                2722
            ],
            [
                2723,
                2777
            ],
            [
                2778,
                2849
            ],
            [
                2856,
                2873
            ],
            [
                2873,
                2875
            ],
            [
                2875,
                2927
            ],
            [
                2927,
                2945
            ],
            [
                2946,
                2969
            ],
            [
                2970,
                2973
            ],
            [
                2974,
                3012
            ],
            [
                3014,
                3043
            ],
            [
                3050,
                3095
            ],
            [
                3095,
                3126
            ],
            [
                3128,
                3132
            ],
            [
                3132,
                3156
            ],
            [
                3162,
                3173
            ],
            [
                3177,
                3233
            ],
            [
                3239,
                3256
            ],
            [
                3257,
                3295
            ],
            [
                3296,
                3311
            ],
            [
                3312,
                3321
            ],
            [
                3324,
                3336
            ],
            [
                3336,
                3338
            ],
            [
                3338,
                3412
            ],
            [
                3425,
                3445
            ],
            [
                3445,
                3447
            ],
            [
                3447,
                3502
            ],
            [
                3502,
                3503
            ],
            [
                3504,
                3561
            ],
            [
                3562,
                3608
            ],
            [
                3608,
                3649
            ],
            [
                3650,
                3666
            ],
            [
                3672,
                3690
            ],
            [
                3697,
                3744
            ],
            [
                3744,
                3852
            ],
            [
                3852,
                3888
            ],
            [
                3898,
                3913
            ],
            [
                3914,
                3954
            ],
            [
                3954,
                3963
            ],
            [
                3964,
                3984
            ],
            [
                3996,
                3998
            ],
            [
                4004,
                4009
            ],
            [
                4015,
                4017
            ],
            [
                4017,
                4062
            ],
            [
                4062,
                4142
            ],
            [
                4143,
                4241
            ],
            [
                4241,
                4289
            ],
            [
                4298,
                4312
            ],
            [
                4325,
                4332
            ],
            [
                4334,
                4356
            ],
            [
                4361,
                4368
            ],
            [
                4368,
                4448
            ],
            [
                4449,
                4506
            ],
            [
                4507,
                4508
            ],
            [
                4509,
                4532
            ],
            [
                4533,
                4539
            ],
            [
                4540,
                4552
            ],
            [
                4552,
                4553
            ],
            [
                4554,
                4566
            ],
            [
                4567,
                4586
            ],
            [
                4598,
                4693
            ],
            [
                4694,
                4749
            ],
            [
                4750,
                4816
            ],
            [
                4817,
                4829
            ],
            [
                4830,
                4831
            ],
            [
                4840,
                4890
            ],
            [
                4890,
                4948
            ],
            [
                4961,
                4972
            ],
            [
                4981,
                5029
            ],
            [
                5041,
                5107
            ],
            [
                5108,
                5141
            ],
            [
                5142,
                5169
            ],
            [
                5170,
                5207
            ],
            [
                5208,
                5245
            ],
            [
                5245,
                5248
            ],
            [
                5249,
                5252
            ],
            [
                5253,
                5258
            ],
            [
                5267,
                5271
            ],
            [
                5272,
                5338
            ],
            [
                5339,
                5350
            ],
            [
                5356,
                5358
            ],
            [
                5358,
                5398
            ],
            [
                5399,
                5458
            ],
            [
                5459,
                5469
            ],
            [
                5469,
                5471
            ],
            [
                5471,
                5528
            ],
            [
                5528,
                5546
            ],
            [
                5546,
                5557
            ],
            [
                5563,
                5753
            ],
            [
                5753,
                5834
            ],
            [
                5839,
                5860
            ],
            [
                5864,
                5868
            ],
            [
                5890,
                5897
            ],
            [
                5897,
                5946
            ],
            [
                5947,
                5955
            ],
            [
                5955,
                5956
            ],
            [
                5957,
                5984
            ],
            [
                5984,
                5985
            ],
            [
                5986,
                6005
            ],
            [
                6010,
                6012
            ],
            [
                6013,
                6019
            ],
            [
                6022,
                6033
            ],
            [
                6033,
                6035
            ],
            [
                6035,
                6094
            ],
            [
                6095,
                6101
            ],
            [
                6102,
                6131
            ],
            [
                6132,
                6181
            ],
            [
                6182,
                6192
            ],
            [
                6195,
                6199
            ],
            [
                6201,
                6205
            ],
            [
                6206,
                6224
            ],
            [
                6229,
                6239
            ],
            [
                6248,
                6304
            ],
            [
                6309,
                6319
            ],
            [
                6319,
                6321
            ],
            [
                6321,
                6355
            ],
            [
                6355,
                6369
            ],
            [
                6369,
                6383
            ],
            [
                6383,
                6394
            ],
            [
                6395,
                6401
            ],
            [
                6403,
                6445
            ],
            [
                6446,
                6454
            ],
            [
                6455,
                6459
            ],
            [
                6464,
                6481
            ],
            [
                6484,
                6505
            ],
            [
                6505,
                6541
            ],
            [
                6542,
                6571
            ],
            [
                6577,
                6582
            ],
            [
                6588,
                6617
            ],
            [
                6618,
                6640
            ],
            [
                6640,
                6658
            ],
            [
                6667,
                6697
            ],
            [
                6700,
                6706
            ],
            [
                6714,
                6719
            ],
            [
                6720,
                6722
            ],
            [
                6729,
                6731
            ],
            [
                6732,
                6749
            ],
            [
                6750,
                6757
            ],
            [
                6758,
                6773
            ],
            [
                6782,
                6787
            ],
            [
                6787,
                6814
            ],
            [
                6814,
                6887
            ],
            [
                6888,
                6903
            ],
            [
                6903,
                6905
            ],
            [
                6905,
                6949
            ],
            [
                6950,
                6968
            ],
            [
                6968,
                7003
            ],
            [
                7006,
                7020
            ],
            [
                7021,
                7031
            ],
            [
                7032,
                7037
            ],
            [
                7038,
                7116
            ],
            [
                7117,
                7138
            ],
            [
                7138,
                7172
            ],
            [
                7175,
                7206
            ],
            [
                7210,
                7216
            ],
            [
                7227,
                7239
            ],
            [
                7239,
                7275
            ],
            [
                7276,
                7288
            ],
            [
                7288,
                7290
            ],
            [
                7290,
                7359
            ],
            [
                7359,
                7377
            ],
            [
                7378,
                7401
            ],
            [
                7402,
                7477
            ],
            [
                7477,
                7479
            ],
            [
                7479,
                7571
            ],
            [
                7572,
                7631
            ],
            [
                7631,
                7642
            ],
            [
                7642,
                7644
            ],
            [
                7644,
                7713
            ],
            [
                7713,
                7714
            ],
            [
                7715,
                7717
            ],
            [
                7718,
                7728
            ],
            [
                7729,
                7739
            ],
            [
                7740,
                7760
            ],
            [
                7767,
                7809
            ],
            [
                7810,
                7860
            ],
            [
                7860,
                7923
            ],
            [
                7927,
                7930
            ],
            [
                7931,
                7970
            ],
            [
                7972,
                7990
            ],
            [
                7996,
                8060
            ],
            [
                8061,
                8179
            ],
            [
                8186,
                8195
            ],
            [
                8197,
                8275
            ],
            [
                8276,
                8286
            ],
            [
                8287,
                8296
            ],
            [
                8296,
                8301
            ],
            [
                8302,
                8354
            ],
            [
                8354,
                8372
            ],
            [
                8372,
                8380
            ],
            [
                8381,
                8384
            ],
            [
                8384,
                8421
            ],
            [
                8422,
                8439
            ],
            [
                8439,
                8447
            ],
            [
                8448,
                8476
            ],
            [
                8477,
                8499
            ],
            [
                8499,
                8530
            ],
            [
                8531,
                8535
            ],
            [
                8539,
                8544
            ],
            [
                8544,
                8572
            ],
            [
                8572,
                8649
            ],
            [
                8650,
                8689
            ],
            [
                8689,
                8732
            ],
            [
                8732,
                8734
            ],
            [
                8734,
                8746
            ],
            [
                8747,
                8758
            ],
            [
                8758,
                8881
            ],
            [
                8887,
                8889
            ],
            [
                8890,
                8917
            ],
            [
                8917,
                8979
            ],
            [
                8980,
                8995
            ],
            [
                9003,
                9091
            ],
            [
                9092,
                9098
            ],
            [
                9099,
                9121
            ],
            [
                9122,
                9143
            ],
            [
                9143,
                9145
            ],
            [
                9146,
                9150
            ],
            [
                9152,
                9161
            ],
            [
                9162,
                9170
            ],
            [
                9171,
                9214
            ],
            [
                9214,
                9216
            ],
            [
                9216,
                9231
            ],
            [
                9231,
                9261
            ],
            [
                9261,
                9292
            ],
            [
                9293,
                9334
            ],
            [
                9335,
                9347
            ],
            [
                9349,
                9444
            ],
            [
                9444,
                9451
            ],
            [
                9452,
                9471
            ],
            [
                9474,
                9479
            ],
            [
                9480,
                9572
            ],
            [
                9578,
                9610
            ],
            [
                9610,
                9656
            ],
            [
                9657,
                9662
            ],
            [
                9669,
                9681
            ],
            [
                9681,
                9693
            ],
            [
                9693,
                9741
            ],
            [
                9742,
                9745
            ],
            [
                9751,
                9764
            ],
            [
                9765,
                9782
            ],
            [
                9787,
                9789
            ],
            [
                9789,
                9826
            ],
            [
                9826,
                9851
            ],
            [
                9852,
                9986
            ],
            [
                9986,
                9997
            ],
            [
                10012,
                10013
            ],
            [
                10022,
                10037
            ],
            [
                10048,
                10072
            ],
            [
                10073,
                10075
            ],
            [
                10085,
                10109
            ],
            [
                10111,
                10133
            ],
            [
                10137,
                10143
            ],
            [
                10148,
                10151
            ],
            [
                10152,
                10179
            ],
            [
                10185,
                10188
            ],
            [
                10192,
                10206
            ],
            [
                10206,
                10220
            ],
            [
                10226,
                10240
            ],
            [
                10240,
                10245
            ],
            [
                10246,
                10253
            ],
            [
                10260,
                10262
            ],
            [
                10267,
                10273
            ],
            [
                10274,
                10282
            ],
            [
                10283,
                10292
            ],
            [
                10292,
                10294
            ],
            [
                10294,
                10307
            ],
            [
                10308,
                10330
            ],
            [
                10331,
                10343
            ],
            [
                10359,
                10365
            ],
            [
                10366,
                10389
            ],
            [
                10390,
                10399
            ],
            [
                10399,
                10415
            ],
            [
                10424,
                10444
            ],
            [
                10444,
                10476
            ],
            [
                10477,
                10531
            ],
            [
                10531,
                10546
            ],
            [
                10555,
                10558
            ],
            [
                10558,
                10586
            ],
            [
                10586,
                10629
            ],
            [
                10636,
                10654
            ],
            [
                10654,
                10711
            ],
            [
                10715,
                10718
            ],
            [
                10724,
                10726
            ],
            [
                10726,
                10756
            ],
            [
                10756,
                10805
            ],
            [
                10805,
                10875
            ],
            [
                10875,
                10957
            ],
            [
                10957,
                10974
            ],
            [
                10975,
                11005
            ],
            [
                11005,
                11007
            ],
            [
                11007,
                11071
            ],
            [
                11071,
                11128
            ],
            [
                11129,
                11139
            ],
            [
                11139,
                11140
            ],
            [
                11141,
                11179
            ],
            [
                11179,
                11245
            ],
            [
                11245,
                11247
            ],
            [
                11247,
                11263
            ],
            [
                11271,
                11293
            ],
            [
                11305,
                11324
            ],
            [
                11324,
                11337
            ],
            [
                11338,
                11344
            ],
            [
                11345,
                11350
            ],
            [
                11351,
                11372
            ],
            [
                11378,
                11386
            ],
            [
                11386,
                11388
            ],
            [
                11388,
                11448
            ],
            [
                11449,
                11459
            ],
            [
                11459,
                11461
            ],
            [
                11461,
                11508
            ],
            [
                11508,
                11519
            ],
            [
                11524,
                11552
            ],
            [
                11558,
                11572
            ],
            [
                11573,
                11596
            ],
            [
                11609,
                11611
            ],
            [
                11611,
                11628
            ],
            [
                11628,
                11683
            ],
            [
                11684,
                11709
            ],
            [
                11713,
                11719
            ],
            [
                11719,
                11736
            ],
            [
                11736,
                11739
            ],
            [
                11739,
                11761
            ],
            [
                11761,
                11790
            ],
            [
                11793,
                11812
            ],
            [
                11812,
                11873
            ],
            [
                11873,
                11886
            ],
            [
                11886,
                11983
            ],
            [
                11983,
                11999
            ],
            [
                12000,
                12013
            ],
            [
                12013,
                12035
            ],
            [
                12035,
                12059
            ],
            [
                12059,
                12106
            ],
            [
                12106,
                12166
            ],
            [
                12166,
                12194
            ],
            [
                12195,
                12212
            ],
            [
                12218,
                12236
            ],
            [
                12242,
                12243
            ],
            [
                12244,
                12250
            ],
            [
                12251,
                12258
            ],
            [
                12258,
                12260
            ],
            [
                12260,
                12302
            ],
            [
                12302,
                12328
            ],
            [
                12328,
                12365
            ],
            [
                12366,
                12374
            ],
            [
                12375,
                12377
            ],
            [
                12378,
                12386
            ],
            [
                12387,
                12423
            ],
            [
                12424,
                12488
            ],
            [
                12489,
                12522
            ],
            [
                12525,
                12538
            ],
            [
                12539,
                12566
            ],
            [
                12567,
                12568
            ],
            [
                12576,
                12581
            ],
            [
                12596,
                12599
            ],
            [
                12602,
                12606
            ],
            [
                12606,
                12608
            ],
            [
                12609,
                12633
            ],
            [
                12633,
                12668
            ],
            [
                12668,
                12691
            ],
            [
                12691,
                12719
            ],
            [
                12720,
                12769
            ],
            [
                12770,
                12806
            ],
            [
                12807,
                12846
            ],
            [
                12847,
                12867
            ],
            [
                12872,
                12885
            ],
            [
                12895,
                12901
            ],
            [
                12901,
                12954
            ],
            [
                12955,
                12967
            ],
            [
                12967,
                12993
            ],
            [
                12993,
                13019
            ],
            [
                13019,
                13098
            ],
            [
                13098,
                13142
            ],
            [
                13143,
                13183
            ],
            [
                13183,
                13193
            ],
            [
                13194,
                13219
            ],
            [
                13220,
                13225
            ],
            [
                13225,
                13280
            ],
            [
                13280,
                13325
            ],
            [
                13325,
                13326
            ],
            [
                13327,
                13367
            ],
            [
                13367,
                13375
            ],
            [
                13376,
                13383
            ],
            [
                13384,
                13388
            ],
            [
                13389,
                13394
            ],
            [
                13395,
                13438
            ],
            [
                13438,
                13514
            ],
            [
                13514,
                13579
            ],
            [
                13579,
                13580
            ],
            [
                13580,
                13583
            ],
            [
                13586,
                13664
            ],
            [
                13665,
                13676
            ],
            [
                13676,
                13705
            ],
            [
                13705,
                13707
            ],
            [
                13707,
                13744
            ],
            [
                13748,
                13766
            ],
            [
                13766,
                13788
            ],
            [
                13789,
                13816
            ],
            [
                13816,
                13894
            ],
            [
                13901,
                13920
            ],
            [
                13921,
                13937
            ],
            [
                13941,
                13957
            ],
            [
                13958,
                13961
            ],
            [
                13972,
                13976
            ],
            [
                13977,
                13993
            ],
            [
                13994,
                14047
            ],
            [
                14047,
                14101
            ],
            [
                14113,
                14141
            ],
            [
                14144,
                14185
            ],
            [
                14186,
                14201
            ],
            [
                14202,
                14239
            ],
            [
                14239,
                14307
            ],
            [
                14308,
                14349
            ],
            [
                14351,
                14383
            ],
            [
                14387,
                14395
            ],
            [
                14396,
                14457
            ],
            [
                14457,
                14459
            ],
            [
                14459,
                14474
            ],
            [
                14474,
                14511
            ],
            [
                14521,
                14550
            ],
            [
                14553,
                14631
            ],
            [
                14632,
                14635
            ],
            [
                14642,
                14645
            ],
            [
                14645,
                14657
            ],
            [
                14657,
                14674
            ],
            [
                14674,
                14681
            ],
            [
                14691,
                14769
            ],
            [
                14769,
                14818
            ],
            [
                14818,
                14820
            ],
            [
                14820,
                14822
            ],
            [
                14825,
                14846
            ],
            [
                14846,
                14887
            ],
            [
                14896,
                14897
            ],
            [
                14898,
                14960
            ],
            [
                14960,
                14982
            ],
            [
                14982,
                14997
            ],
            [
                15009,
                15070
            ],
            [
                15071,
                15102
            ],
            [
                15103,
                15121
            ],
            [
                15122,
                15147
            ],
            [
                15147,
                15204
            ],
            [
                15205,
                15289
            ],
            [
                15289,
                15290
            ],
            [
                15291,
                15325
            ],
            [
                15325,
                15342
            ],
            [
                15342,
                15349
            ],
            [
                15350,
                15360
            ],
            [
                15361,
                15367
            ],
            [
                15368,
                15376
            ],
            [
                15376,
                15378
            ],
            [
                15378,
                15401
            ],
            [
                15402,
                15463
            ],
            [
                15463,
                15533
            ],
            [
                15533,
                15587
            ],
            [
                15587,
                15605
            ],
            [
                15605,
                15606
            ],
            [
                15607,
                15613
            ],
            [
                15614,
                15652
            ],
            [
                15659,
                15665
            ],
            [
                15669,
                15692
            ],
            [
                15693,
                15727
            ],
            [
                15728,
                15750
            ],
            [
                15750,
                15756
            ],
            [
                15756,
                15774
            ],
            [
                15775,
                15800
            ],
            [
                15800,
                15801
            ],
            [
                15804,
                15822
            ],
            [
                15825,
                15826
            ],
            [
                15826,
                15840
            ],
            [
                15840,
                15860
            ],
            [
                15860,
                15953
            ],
            [
                15954,
                15975
            ],
            [
                15975,
                16010
            ],
            [
                16010,
                16036
            ],
            [
                16037,
                16070
            ],
            [
                16070,
                16099
            ],
            [
                16099,
                16137
            ],
            [
                16142,
                16145
            ],
            [
                16146,
                16150
            ],
            [
                16161,
                16228
            ],
            [
                16233,
                16276
            ],
            [
                16277,
                16321
            ],
            [
                16322,
                16343
            ],
            [
                16343,
                16355
            ],
            [
                16364,
                16417
            ],
            [
                16418,
                16443
            ],
            [
                16443,
                16445
            ],
            [
                16445,
                16491
            ],
            [
                16496,
                16528
            ],
            [
                16529,
                16539
            ],
            [
                16543,
                16572
            ],
            [
                16573,
                16618
            ],
            [
                16619,
                16620
            ],
            [
                16620,
                16640
            ],
            [
                16648,
                16650
            ],
            [
                16650,
                16687
            ],
            [
                16697,
                16702
            ],
            [
                16702,
                16714
            ],
            [
                16715,
                16754
            ],
            [
                16754,
                16787
            ],
            [
                16787,
                16799
            ],
            [
                16806,
                16822
            ],
            [
                16822,
                16923
            ],
            [
                16924,
                16943
            ],
            [
                16944,
                16987
            ],
            [
                16987,
                17098
            ],
            [
                17098,
                17122
            ],
            [
                17122,
                17148
            ],
            [
                17148,
                17162
            ],
            [
                17162,
                17238
            ],
            [
                17247,
                17280
            ],
            [
                17281,
                17287
            ],
            [
                17288,
                17305
            ],
            [
                17305,
                17339
            ],
            [
                17339,
                17354
            ],
            [
                17355,
                17365
            ],
            [
                17366,
                17382
            ],
            [
                17382,
                17384
            ],
            [
                17384,
                17406
            ],
            [
                17406,
                17433
            ],
            [
                17433,
                17492
            ],
            [
                17492,
                17493
            ],
            [
                17498,
                17501
            ],
            [
                17502,
                17529
            ],
            [
                17529,
                17576
            ],
            [
                17577,
                17637
            ],
            [
                17645,
                17660
            ],
            [
                17660,
                17661
            ],
            [
                17661,
                17690
            ],
            [
                17690,
                17754
            ],
            [
                17754,
                17841
            ],
            [
                17849,
                17874
            ],
            [
                17874,
                17898
            ],
            [
                17899,
                17922
            ],
            [
                17923,
                17926
            ],
            [
                17943,
                17952
            ],
            [
                17952,
                17968
            ],
            [
                17969,
                17972
            ],
            [
                17973,
                17987
            ],
            [
                18000,
                18019
            ],
            [
                18020,
                18033
            ],
            [
                18033,
                18050
            ],
            [
                18050,
                18117
            ],
            [
                18117,
                18118
            ],
            [
                18119,
                18129
            ],
            [
                18134,
                18167
            ],
            [
                18167,
                18169
            ],
            [
                18169,
                18213
            ],
            [
                18220,
                18226
            ],
            [
                18227,
                18228
            ],
            [
                18229,
                18240
            ],
            [
                18241,
                18253
            ],
            [
                18255,
                18306
            ],
            [
                18312,
                18334
            ],
            [
                18334,
                18395
            ],
            [
                18396,
                18440
            ],
            [
                18440,
                18462
            ],
            [
                18462,
                18488
            ],
            [
                18488,
                18516
            ],
            [
                18516,
                18544
            ],
            [
                18544,
                18560
            ],
            [
                18560,
                18612
            ],
            [
                18613,
                18655
            ],
            [
                18655,
                18658
            ],
            [
                18659,
                18671
            ],
            [
                18672,
                18733
            ],
            [
                18733,
                18735
            ],
            [
                18735,
                18778
            ],
            [
                18779,
                18826
            ],
            [
                18826,
                18847
            ],
            [
                18848,
                18851
            ],
            [
                18859,
                18873
            ],
            [
                18873,
                18977
            ],
            [
                18978,
                19015
            ],
            [
                19015,
                19140
            ],
            [
                19140,
                19141
            ],
            [
                19146,
                19239
            ],
            [
                19239,
                19242
            ],
            [
                19242,
                19271
            ],
            [
                19272,
                19279
            ],
            [
                19280,
                19356
            ],
            [
                19356,
                19357
            ],
            [
                19358,
                19386
            ],
            [
                19387,
                19390
            ],
            [
                19391,
                19415
            ],
            [
                19416,
                19507
            ]
        ],
        "row_chars": [
            [
                0,
                374
            ],
            [
                374,
                485
            ],
            [
                485,
                504
            ],
            [
                504,
                543
            ],
            [
                543,
                543
            ],
            [
                543,
                1155
            ],
            [
                1155,
                1410
            ],
            [
                1410,
                1564
            ],
            [
                1564,
                1600
            ],
            [
                1600,
                1721
            ],
            [
                1721,
                1816
            ],
            [
                1816,
                1928
            ],
            [
                1928,
                2014
            ],
            [
                2014,
                2117
            ],
            [
                2117,
                2214
            ],
            [
                2214,
                2370
            ],
            [
                2370,
                2404
            ],
            [
                2404,
                2433
            ],
            [
                2433,
                2458
            ],
            [
                2458,
                2555
            ],
            [
                2555,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2875
            ],
            [
                2875,
                2927
            ],
            [
                2927,
                3095
            ],
            [
                3095,
                3132
            ],
            [
                3132,
                3338
            ],
            [
                3338,
                3412
            ],
            [
                3412,
                3447
            ],
            [
                3447,
                3608
            ],
            [
                3608,
                3650
            ],
            [
                3650,
                3650
            ],
            [
                3650,
                3744
            ],
            [
                3744,
                3954
            ],
            [
                3954,
                4017
            ],
            [
                4017,
                4062
            ],
            [
                4062,
                4241
            ],
            [
                4241,
                4449
            ],
            [
                4449,
                4890
            ],
            [
                4890,
                5170
            ],
            [
                5170,
                5245
            ],
            [
                5245,
                5358
            ],
            [
                5358,
                5471
            ],
            [
                5471,
                5528
            ],
            [
                5528,
                5546
            ],
            [
                5546,
                5753
            ],
            [
                5753,
                6035
            ],
            [
                6035,
                6321
            ],
            [
                6321,
                6355
            ],
            [
                6355,
                6369
            ],
            [
                6369,
                6383
            ],
            [
                6383,
                6505
            ],
            [
                6505,
                6640
            ],
            [
                6640,
                6787
            ],
            [
                6787,
                6814
            ],
            [
                6814,
                6905
            ],
            [
                6905,
                6968
            ],
            [
                6968,
                7138
            ],
            [
                7138,
                7239
            ],
            [
                7239,
                7290
            ],
            [
                7290,
                7359
            ],
            [
                7359,
                7479
            ],
            [
                7479,
                7572
            ],
            [
                7572,
                7572
            ],
            [
                7572,
                7631
            ],
            [
                7631,
                7644
            ],
            [
                7644,
                7644
            ],
            [
                7644,
                7860
            ],
            [
                7860,
                8354
            ],
            [
                8354,
                8372
            ],
            [
                8372,
                8499
            ],
            [
                8499,
                8572
            ],
            [
                8572,
                8689
            ],
            [
                8689,
                8734
            ],
            [
                8734,
                8758
            ],
            [
                8758,
                8917
            ],
            [
                8917,
                9122
            ],
            [
                9122,
                9143
            ],
            [
                9143,
                9216
            ],
            [
                9216,
                9231
            ],
            [
                9231,
                9261
            ],
            [
                9261,
                9444
            ],
            [
                9444,
                9610
            ],
            [
                9610,
                9681
            ],
            [
                9681,
                9693
            ],
            [
                9693,
                9789
            ],
            [
                9789,
                9997
            ],
            [
                9997,
                10206
            ],
            [
                10206,
                10294
            ],
            [
                10294,
                10399
            ],
            [
                10399,
                10444
            ],
            [
                10444,
                10531
            ],
            [
                10531,
                10558
            ],
            [
                10558,
                10586
            ],
            [
                10586,
                10726
            ],
            [
                10726,
                10756
            ],
            [
                10756,
                10805
            ],
            [
                10805,
                10805
            ],
            [
                10805,
                10875
            ],
            [
                10875,
                10957
            ],
            [
                10957,
                10957
            ],
            [
                10957,
                11007
            ],
            [
                11007,
                11179
            ],
            [
                11179,
                11247
            ],
            [
                11247,
                11324
            ],
            [
                11324,
                11388
            ],
            [
                11388,
                11461
            ],
            [
                11461,
                11508
            ],
            [
                11508,
                11573
            ],
            [
                11573,
                11573
            ],
            [
                11573,
                11573
            ],
            [
                11573,
                11596
            ],
            [
                11596,
                11611
            ],
            [
                11611,
                11628
            ],
            [
                11628,
                11719
            ],
            [
                11719,
                11739
            ],
            [
                11739,
                11761
            ],
            [
                11761,
                11812
            ],
            [
                11812,
                11812
            ],
            [
                11812,
                11873
            ],
            [
                11873,
                11886
            ],
            [
                11886,
                11983
            ],
            [
                11983,
                12013
            ],
            [
                12013,
                12035
            ],
            [
                12035,
                12059
            ],
            [
                12059,
                12106
            ],
            [
                12106,
                12166
            ],
            [
                12166,
                12260
            ],
            [
                12260,
                12302
            ],
            [
                12302,
                12328
            ],
            [
                12328,
                12567
            ],
            [
                12567,
                12599
            ],
            [
                12599,
                12608
            ],
            [
                12608,
                12608
            ],
            [
                12608,
                12668
            ],
            [
                12668,
                12691
            ],
            [
                12691,
                12807
            ],
            [
                12807,
                12967
            ],
            [
                12967,
                12993
            ],
            [
                12993,
                13098
            ],
            [
                13098,
                13183
            ],
            [
                13183,
                13225
            ],
            [
                13225,
                13280
            ],
            [
                13280,
                13325
            ],
            [
                13325,
                13367
            ],
            [
                13367,
                13438
            ],
            [
                13438,
                13514
            ],
            [
                13514,
                13579
            ],
            [
                13579,
                13579
            ],
            [
                13579,
                13586
            ],
            [
                13586,
                13707
            ],
            [
                13707,
                13816
            ],
            [
                13816,
                14047
            ],
            [
                14047,
                14239
            ],
            [
                14239,
                14459
            ],
            [
                14459,
                14474
            ],
            [
                14474,
                14645
            ],
            [
                14645,
                14657
            ],
            [
                14657,
                14674
            ],
            [
                14674,
                14681
            ],
            [
                14681,
                14681
            ],
            [
                14681,
                14769
            ],
            [
                14769,
                14820
            ],
            [
                14820,
                14846
            ],
            [
                14846,
                14898
            ],
            [
                14898,
                14960
            ],
            [
                14960,
                14982
            ],
            [
                14982,
                15147
            ],
            [
                15147,
                15291
            ],
            [
                15291,
                15325
            ],
            [
                15325,
                15342
            ],
            [
                15342,
                15378
            ],
            [
                15378,
                15402
            ],
            [
                15402,
                15463
            ],
            [
                15463,
                15533
            ],
            [
                15533,
                15587
            ],
            [
                15587,
                15693
            ],
            [
                15693,
                15750
            ],
            [
                15750,
                15756
            ],
            [
                15756,
                15800
            ],
            [
                15800,
                15825
            ],
            [
                15825,
                15840
            ],
            [
                15840,
                15860
            ],
            [
                15860,
                15860
            ],
            [
                15860,
                15975
            ],
            [
                15975,
                16010
            ],
            [
                16010,
                16070
            ],
            [
                16070,
                16099
            ],
            [
                16099,
                16343
            ],
            [
                16343,
                16445
            ],
            [
                16445,
                16619
            ],
            [
                16619,
                16650
            ],
            [
                16650,
                16688
            ],
            [
                16688,
                16702
            ],
            [
                16702,
                16754
            ],
            [
                16754,
                16787
            ],
            [
                16787,
                16822
            ],
            [
                16822,
                16987
            ],
            [
                16987,
                17098
            ],
            [
                17098,
                17122
            ],
            [
                17122,
                17148
            ],
            [
                17148,
                17162
            ],
            [
                17162,
                17339
            ],
            [
                17339,
                17384
            ],
            [
                17384,
                17406
            ],
            [
                17406,
                17433
            ],
            [
                17433,
                17492
            ],
            [
                17492,
                17529
            ],
            [
                17529,
                17660
            ],
            [
                17660,
                17690
            ],
            [
                17690,
                17754
            ],
            [
                17754,
                17754
            ],
            [
                17754,
                17754
            ],
            [
                17754,
                17874
            ],
            [
                17874,
                18033
            ],
            [
                18033,
                18169
            ],
            [
                18169,
                18334
            ],
            [
                18334,
                18440
            ],
            [
                18440,
                18462
            ],
            [
                18462,
                18488
            ],
            [
                18488,
                18516
            ],
            [
                18516,
                18544
            ],
            [
                18544,
                18613
            ],
            [
                18613,
                18655
            ],
            [
                18655,
                18735
            ],
            [
                18735,
                18873
            ],
            [
                18873,
                19015
            ],
            [
                19015,
                19242
            ],
            [
                19242,
                19507
            ]
        ]
    }
}